&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокЦБ	= Неопределено;
	Параметры.Свойство("СписокЦБ", СписокЦБ);
	Если Не СписокЦБ = Неопределено Тогда
		СписокПодобранныхЦБ.ЗагрузитьЗначения(СписокЦБ);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСписок(Команда)
	ЗакрытьФорму	= Истина;
	Закрыть(СписокПодобранныхЦБ.ВыгрузитьЗначения());	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Не ЗакрытьФорму Тогда
		Если Вопрос("Сохранить изменения настроек отбора?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			СтандартнаяОбработка= Ложь;
			ЗакрытьФорму		= Истина;
			Закрыть(СписокПодобранныхЦБ.ВыгрузитьЗначения());
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
