
#Область ПрограммныйИнтерфейс

// Процедура для регламентной выгрузки НКД в BackQort
//
// Параметры:
//  ДатаВыгрузкиДанных	 - Дата 	Дата от которой считается период выгрузки из РС ОбращаемостьЦБ
//
Процедура ВыгрузитьОбращаемостьЦБРегламентно() Экспорт
	
	ТекстыОшибок = "";
	ИмяПараметра = "2623.ДатаПоследнейВыгрузкиОбращаемостиЦБ";
	
	ДатаПоследнейВыгрузки = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("2623.ДатаПоследнейВыгрузкиОбращаемостиЦБ");
	
	Если НЕ ЗначениеЗаполнено(ДатаПоследнейВыгрузки) Тогда
		НачалоПериода = НачалоДня(ТекущаяДатаСеанса()) - ОбщегоНазначенияПовтИсп.СекундВСутках(2);
		КонецПериода = КонецДня(НачалоПериода);
	Иначе
		НачалоПериода = НачалоДня(ДатаПоследнейВыгрузки) + ОбщегоНазначенияПовтИсп.СекундВСутках(1);
		КонецПериода = КонецДня(ТекущаяДатаСеанса()) - ОбщегоНазначенияПовтИсп.СекундВСутках(2);
	КонецЕсли;
	
	ОбработкаВыгрузкаОбращаемостиЦБВBackQort = Обработки.ВыгрузкаОбращаемостиЦБВBackQort.Создать();
	ОбработкаВыгрузкаОбращаемостиЦБВBackQort.НачалоПериода = НачалоПериода;
	ОбработкаВыгрузкаОбращаемостиЦБВBackQort.КонецПериода = КонецПериода;
	
	Попытка
		ОбработкаВыгрузкаОбращаемостиЦБВBackQort.ВыгрузитьВBackQort();
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстыОшибок.Добавить(ТекстОшибки);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ТекстыОшибок) Тогда
		ИтоговыйТекстОшибки = СтрСоединить(ТекстыОшибок, Символы.ПС);
		ВызватьИсключение ИтоговыйТекстОшибки;
	Иначе
		РегистрыСведений.ПараметрыГлобальные.УстановитьЗначениеПараметра(ИмяПараметра, КонецПериода);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти