#Область ПрограммныйИнтерфейс

// Процедура выгружает обращаемость ЦБ в BackQort
//
// Параметры:
//  ТекстыОшибок - Массив - Коллекция для накапливания текстов об ошибках в процессе выгрузки
//
Процедура ВыгрузитьВBackQort(ТекстыОшибок = Неопределено) Экспорт
	
	ВыборкаОбращаемостиЦБ = ВыборкаОбращаемостиЦБ();
	
	ПараметрыВыгрузки = Новый Структура("ВыборкаОбращаемостиЦБ,ВсегоКВыгрузке,НомерВыгрузки");
	ПараметрыВыгрузки.ВсегоКВыгрузке = ВыборкаОбращаемостиЦБ.Количество();
	
	ВыгруженоОбращаемостиЦБ = 0;
	Если ПараметрыВыгрузки.ВсегоКВыгрузке > 0 Тогда
		Пока ВыборкаОбращаемостиЦБ.Следующий() Цикл
			ПараметрыВыгрузки.НомерВыгрузки = ВыгруженоОбращаемостиЦБ + 1;
			ПараметрыВыгрузки.ВыборкаОбращаемостиЦБ = ВыборкаОбращаемостиЦБ;
			Успешно = ВыгрузитьОбращаемостьЦБ(ПараметрыВыгрузки, ТекстыОшибок);
			ВыгруженоОбращаемостиЦБ = ?(Успешно, ПараметрыВыгрузки.НомерВыгрузки, ВыгруженоОбращаемостиЦБ);
		КонецЦикла;
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон("Выгружено %1 ценных бумаг", ВыгруженоОбращаемостиЦБ);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгрузитьОбращаемостьЦБ(ПараметрыВыгрузки, ТекстыОшибок)
	
	Сущность = "TradabilityStatus";
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaDepoToBqTradabilityStatus1642;
	УИДСообщения = Строка(Новый УникальныйИдентификатор);
	Успешно = Ложь;
	ЦеннаяБумага = ПараметрыВыгрузки.ВыборкаОбращаемостиЦБ.ЦеннаяБумага;
	
	Попытка
		ТекстJSON = СформироватьJSON(УИДСообщения, Сущность, ПараметрыВыгрузки);
		Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Сущность, ТекстJSON, УИДСообщения, ЦеннаяБумага);
		Успешно = Истина;
	Исключение
		Успешно = Ложь;
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Если ТипЗнч(ТекстыОшибок) = Тип("Массив") Тогда
			ТекстыОшибок.Добавить(ТекстОшибки);
		КонецЕсли;
	КонецПопытки;
	
	Возврат Успешно;
	
КонецФункции

Функция ТекстЗапросаОбращаемостиЦБ()
	Возврат
	"ВЫБРАТЬ
	|	ОстаткиЦБОстатки.ЦБ КАК ЦБ
	|ПОМЕСТИТЬ ВТ_ЦБСОстатками
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(&ТекущаяДата, 1 = 1) КАК ОстаткиЦБОстатки
	|ГДЕ
	|	ОстаткиЦБОстатки.КоличествоОстаток <> 0
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиЦБОстатки.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
	|	ОбращаемостьЦБ.Период КАК Date,
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.НомерРегистрации КАК RegNum,
	|	ЕСТЬNULL(КодыЗагрузкиНРД.Код, """") КАК AssetCode,
	|	ЕСТЬNULL(КодыЗагрузкиРудата.Код, """") КАК RuDataCode,
	|	ОбращаемостьЦБ.МестоОбращаемости КАК МестоОбращаемости
	|ИЗ
	|	РегистрСведений.ОбращаемостьЦБ КАК ОбращаемостьЦБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦБСОстатками КАК ВТ_ЦБСОстатками
	|		ПО ВТ_ЦБСОстатками.ЦБ = ОбращаемостьЦБ.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ОбращаемостьЦБ.ЦеннаяБумага = ЦенныеБумаги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиРудата
	|		ПО (ЦенныеБумаги.Ссылка = КодыЗагрузкиРудата.Владелец)
	|			И (НЕ КодыЗагрузкиРудата.ПометкаУдаления)
	|			И (КодыЗагрузкиРудата.Биржа = &РУДАТА)
	|			И (КодыЗагрузкиРудата.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузкиРудата.ДатаОкончанияДействия > &ТекущаяДата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиНРД
	|		ПО (ЦенныеБумаги.Ссылка = КодыЗагрузкиНРД.Владелец)
	|			И (НЕ КодыЗагрузкиНРД.ПометкаУдаления)
	|			И (КодыЗагрузкиНРД.Биржа = &НРД)
	|			И (КодыЗагрузкиНРД.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузкиНРД.ДатаОкончанияДействия > &ТекущаяДата)
	|{ГДЕ
	|	ОбращаемостьЦБ.Период КАК Период,
	|	ЦенныеБумаги.Ссылка КАК ЦенныеБумаги}";
КонецФункции

Функция ВыборкаОбращаемостиЦБ()
	
	ТекстЗапроса = ТекстЗапросаОбращаемостиЦБ();
	ПостроительЗапроса = Новый ПостроительЗапроса(ТекстЗапроса);
	ПостроительЗапроса.ЗаполнитьНастройки();
	ПостроительЗапроса.Параметры.Вставить("ТекущаяДата", ТекущаяДатаСеанса());
	ПостроительЗапроса.Параметры.Вставить("РУДАТА", Справочники.КлассификаторыЗагрузки.RuData);
	ПостроительЗапроса.Параметры.Вставить("НРД", Справочники.КлассификаторыЗагрузки.NrdCode);
	Отбор = ПостроительЗапроса.Отбор;
	
	Отбор.Добавить("Период");
	Отбор.Период.ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы;
	Отбор.Период.Использование = Истина;
	Отбор.Период.ЗначениеС = НачалоПериода;
	Отбор.Период.ЗначениеПо = КонецПериода;
	
	Если ЗначениеЗаполнено(ЦенныеБумаги) Тогда
		Отбор.Добавить("ЦенныеБумаги");
		Отбор.ЦенныеБумаги.ВидСравнения = ВидСравнения.ВСписке;
		Отбор.ЦенныеБумаги.Использование = Истина;
		СписокЦенныхБумаг = Новый СписокЗначений;
		СписокЦенныхБумаг.ЗагрузитьЗначения(ЦенныеБумаги.Выгрузить(, "ЦеннаяБумага").ВыгрузитьКолонку("ЦеннаяБумага"));
		Отбор.ЦенныеБумаги.Значение = СписокЦенныхБумаг;
	КонецЕсли;
	
	ПостроительЗапроса.Выполнить();
	ВыборкаОбращаемостиЦБ = ПостроительЗапроса.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат ВыборкаОбращаемостиЦБ;
	
КонецФункции

#Область Kafka

Функция СформироватьJSON(УИДСообщения, Сущность, ПараметрыВыгрузки)
	
	MessageInfo = ОбменДаннымиКафка.ТиповыеДанныеMessageInfo(Сущность, "INS", "1.0.0", УИДСообщения);
	
	Data = ДанныеData(ПараметрыВыгрузки);
	
	ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	Возврат ТекстJSON;
	
КонецФункции

Функция ДанныеData(ПараметрыВыгрузки)
	
	ВыборкаЗапись = ПараметрыВыгрузки.ВыборкаОбращаемостиЦБ;
	
	Date = ЗаписатьДатуJSON(ВыборкаЗапись.Date, ФорматДатыJSON.ISO);
	
	Asset = Новый Структура;
	Asset.Вставить("Isin", ВыборкаЗапись.Isin);
	РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(Asset, "AssetCode", СокрЛП(ВыборкаЗапись.AssetCode));
	РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(Asset, "RegNum", СокрЛП(ВыборкаЗапись.RegNum));
	Asset.Вставить("RuDataCode", РаботаСJSON.ЧисловойКодRuData(ВыборкаЗапись.RuDataCode));
	
	IsTradability = "";
	Если ВыборкаЗапись.МестоОбращаемости = Перечисления.МестаОбращаемостиЦБ.ОбращаетсяНаМосковскойБирже
		ИЛИ ВыборкаЗапись.МестоОбращаемости = Перечисления.МестаОбращаемостиЦБ.ОбращаетсяНаИностранныхБиржах Тогда
		IsTradability = Истина;
	Иначе
		IsTradability = Ложь;
	КонецЕсли;
	
	ДанныеПоЦеннойБумаге = Новый Структура;
	ДанныеПоЦеннойБумаге.Вставить("Date", Date);
	ДанныеПоЦеннойБумаге.Вставить("Asset", Asset);
	ДанныеПоЦеннойБумаге.Вставить("IsTradability", IsTradability);
	
	Возврат ДанныеПоЦеннойБумаге;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Инициализация

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);

#КонецОбласти
