

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресЭлектроннойПочтыПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.АдресЭлектроннойПочты;
	КонецЕсли;
		      	
КонецПроцедуры


//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьНастройки(Команда)
	
Профиль = Новый ИнтернетПочтовыйПрофиль;
	
	Профиль.АдресСервераSMTP = Объект.SMTPСервер;
	Если Объект.ВремяОжиданияСервера > 0 Тогда
		Профиль.ВремяОжидания = Объект.ВремяОжиданияСервера;
	КонецЕсли; 
	Профиль.Пароль           = Объект.Пароль;
	Профиль.Пользователь     = Объект.Логин;
	Профиль.ПортPOP3         = Объект.ПортPOP3;
	Профиль.ПортSMTP         = Объект.ПортSMTP;
	
	Профиль.ПарольSMTP       = Объект.ПарольSMTP;
	Профиль.ПользовательSMTP = Объект.ЛогинSMTP;
	
	ИнтернетПочта = Новый ИнтернетПочта;
	
	Попытка
		ИнтернетПочта.Подключиться(Профиль);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
		//Проверка = ПроверитьЗаполнениеОбязательныхПолей();
		//Если ЗначениеЗаполнено(Проверка) Тогда
		//	ОбщегоНазначения.СообщитьОбОшибке("" + Проверка);
		//КонецЕсли;
		Сообщить("Произошли ошибки при проверке настроек учетной записи.
					   |Описание ошибки приведено в окне сообщения.");
		Возврат;
	КонецПопытки;
	
	Сообщить("Проверка подключения к почтовому серверу с заданными параметрами выполнена успешно.");
	
КонецПроцедуры

//#КонецОбласти

