
Процедура ПроверитьНаПодобныеУЦБ(КодММВБ, ОбъектПроверки) Экспорт
	
	Если ЗначениеЗаполнено(ISIN) И ЗначениеЗаполнено(ТипЦБ) Тогда
		Запрос	= Новый Запрос;
		
		Запрос.Текст	= "
		|ВЫБРАТЬ
		|	ЦенныеБумаги.Ссылка	КАК ЦБ
		|	,ТаблицаКодов.КодММВБ
		|ИЗ
		|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
		|ЛЕВОЕ СОЕДИНЕНИЕ	
		|	(
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Владелец,
		|		МАКСИМУМ(ВЫБОР КОГДА Биржа = ЗНАЧЕНИЕ(Справочник.Биржи.MICEX) ТОГДА Код КОНЕЦ) КАК КодММВБ
		|	ИЗ
		|		Справочник.КодыЗагрузки
		|	ГДЕ
		|		ПометкаУдаления = ЛОЖЬ	
		|	И
		|		(ДатаОкончанияДействия = ДАТАВРЕМЯ(1,1,1) ИЛИ ДатаОкончанияДействия >= КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ))
		|	СГРУППИРОВАТЬ ПО
		|		Владелец
		|	ИМЕЮЩИЕ
		|		МАКСИМУМ(ВЫБОР КОГДА Биржа = ЗНАЧЕНИЕ(Справочник.Биржи.MICEX) ТОГДА Код КОНЕЦ) = &КодММВБ
		|	) КАК ТаблицаКодов
		|ПО
		|	(ТаблицаКодов.Владелец = ЦенныеБумаги.Ссылка)
		|ГДЕ
		|	ЦенныеБумаги.ISIN	= &ISIN
		|И
		|	ЦенныеБумаги.ТипЦБ	= &ТипЦБ
		|"+?(ОбъектПроверки = Неопределено	, "", "И ЦенныеБумаги.Ссылка <> &ТекущаяЦБ")+"
		|"+?(КодММВБ = Неопределено			, "", "И ТаблицаКодов.КодММВБ IS NOT NULL");
		
		Запрос.УстановитьПараметр("ISIN"		, ISIN);
		Запрос.УстановитьПараметр("ТипЦБ"		, ТипЦБ);
		Запрос.УстановитьПараметр("ТекущаяЦБ"	, ОбъектПроверки);
		Запрос.УстановитьПараметр("КодММВБ"		, КодММВБ);
		Запрос.УстановитьПараметр("ТекущаяДата"	, ТекущаяДата());
		
		Результат	= Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			Выборка	= Результат.Выбрать();
			ТекстСообщения	= "Найдены подобные элементы ЦБ:";
			
			Пока Выборка.Следующий() Цикл
				ТекстСообщения	= ТекстСообщения + "
				| - "+Выборка.ЦБ+" - Код 1С: "+СокрЛП(Выборка.ЦБ.Код)+" - ISIN: "+СокрЛП(Выборка.ЦБ.ISIN)+" - Тип: "+Выборка.ЦБ.ТипЦБ+?(КодММВБ = Неопределено, "", " - Код ММВБ: "+КодММВБ);
			КонецЦикла;
			
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения);
		КонецЕсли;
		
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Данные для проверки по ISIN и Типу ЦБ не верны!");
	КонецЕсли; 
	
КонецПроцедуры // ПроверитьПоISINиТипЦБ()()
	 
Функция ПолучитьКодММВБ() Экспорт
	Запрос	= Новый Запрос;
	
	Запрос.Текст	= "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ВЫБОР КОГДА Биржа = ЗНАЧЕНИЕ(Справочник.Биржи.MICEX) ТОГДА Код КОНЕЦ) КАК КодММВБ
	|ИЗ
	|	Справочник.КодыЗагрузки
	|ГДЕ
	|	ПометкаУдаления = ЛОЖЬ	
	|И
	|	(ДатаОкончанияДействия = ДАТАВРЕМЯ(1,1,1) ИЛИ ДатаОкончанияДействия >= КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ))
	|И
	|	Владелец	= &ЦеннаБумага";
	
	Запрос.УстановитьПараметр("ЦеннаБумага"	, Ссылка);
	Запрос.УстановитьПараметр("ТекущаяДата"	, ТекущаяДата());
	
	Результат	= Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.Выгрузить()[0].КодММВБ;
	КонецЕсли;
КонецФункции // ()

Процедура ПередЗаписью(Отказ)
	
	Перем СекундВСутках;
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат; // все проверки не имеют смысла для группы элементов
	КонецЕсли;
	
	Если ТипЦБ = Перечисления.ТипыЦБ.Облигация И КупоннаяОблигация И  ВалютаКупона.Пустая() Тогда
		ВалютаКупона = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	
	СекундВСутках = 24 * 60 * 60;
	
	// Проверка на наличие подобного элемента ЦБ
	Если ЭтоНовый() Тогда
		КодММВБ			= Неопределено;
		ОбъектПроверки	= Неопределено;
	Иначе
		КодММВБ			= ПолучитьКодММВБ();
		ОбъектПроверки	= Ссылка;
	КонецЕсли;
	
	ПроверитьНаПодобныеУЦБ(КодММВБ, ОбъектПроверки);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		// Должно обязательно отработать в обработчике даже в режиме загрузки, чтобы изменения были выгружены в бэкофис (BQ)
		РегистрацияИзмененийДляВыгрузки.ОтметитьИзмененияВСправочнике(ЭтотОбъект, Отказ);
		
		Возврат;
	КонецЕсли;	
	
	РегистрацияИзмененийДляВыгрузки.ОтметитьИзмененияВСправочнике(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если Основание <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
	КонецЕсли;
	
КонецПроцедуры
