
Функция КодТипаСчетаДЕПО(ТипСчетаДепо) Экспорт
	Код = "";
	
	Если ТипСчетаДепо = Перечисления.ТипыСчетовДепо.Владельца
		ИЛИ ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ВладельцаТорговый Тогда
		Код = "01";
	ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.НоминальногоДержателя
		ИЛИ ТипСчетаДепо = Перечисления.ТипыСчетовДепо.НоминальногоДержателяТорговый Тогда
		Код = "02";
	ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ДоверительногоУправляющего
		ИЛИ ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ДоверительногоУправляющегоТорговый Тогда
		Код = "03";
	ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.Залогодержателя Тогда
		Код = "04";
	ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ЭмиссионныйСчет Тогда
		Код = "05";
	ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.КазначейскийСчетЭмитента Тогда
		Код = "06";
	ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.НеустановленныхЛиц Тогда
		Код = "07";
	ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ИныеФедеральныеСчета Тогда
		Код = "13";
	ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.УчетПравНаЦБПереданныеВДепозитНотариусаСуда Тогда
		Код = "19";
	ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ИностранногоНоминальногоДержателя
		ИЛИ ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ИностранногоНоминальногоДержателяТорговый Тогда
		Код = "20";
	ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ИностранногоУполномоченногоДержателя
		ИЛИ ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ИностранногоУполномоченногоДержателяТорговый Тогда	
		Код = "21";
	КонецЕсли;
	
	Возврат Код;
КонецФункции
