
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Если Не ПустаяСтрока(Код) Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(СчетаДепо.Код) КАК Код
	|ИЗ
	|	Справочник.СчетаДепо КАК СчетаДепо
	|ГДЕ
	|	ПОДСТРОКА(СчетаДепо.Код, 1, 1) В (""1"", ""2"", ""3"", ""4"", ""5"", ""6"", ""7"", ""8"", ""9"", ""0"")
	|	И СчетаДепо.ПризнакСчетаДепо = ЗНАЧЕНИЕ(Перечисление.ПризнакиСчетаДепо.СчетДепонента)
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	Справочник.СчетаДепо";
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда 
		
		Попытка
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Если НЕ ЗначениеЗаполнено(Выборка.Код) Тогда
				Возврат;
			КонецЕсли;
			СтандартнаяОбработка = Ложь;
			Код = Формат(Число(Лев(Выборка.Код, 7)) + 1, "ЧЦ=7; ЧВН=; ЧГ=0");
		Исключение
			ВызватьИсключение "Не удалось установить новый код счета депо!";
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = СокрЛП(Владелец.Наименование);
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("НомерСчетаДепоБыл", Ссылка.Код);
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ДобавленИлиУдален = ДополнительныеСвойства.Свойство("ЭтоНовый") И ДополнительныеСвойства.ЭтоНовый Или ПометкаУдаления;
	ИзменилсяНомерСчетаДепо = Не ДобавленИлиУдален
		И ДополнительныеСвойства.Свойство("НомерСчетаДепоБыл") И ДополнительныеСвойства.НомерСчетаДепоБыл <> Код;
	Если ИзменилсяНомерСчетаДепо Тогда
		ШаблонПредупреждения = "По счету изменили ключевые параметры [было\стало]: Номер счета [%1 \ %2])";
		ТекстПредупреждения = СтрШаблон(ШаблонПредупреждения, СокрЛП(ДополнительныеСвойства.НомерСчетаДепоБыл), СокрЛП(Код));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
		ТемаПисьма = " Уведомление о смене номера Счета депо";
		ВнешнийИсточникIT = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОСменеНомераСчетаДепоИлиНомераРазделаСчетаДепо;
		ТелоПисьма = "Внимание!" + Символы.ПС + Символы.ПС;
		СообщенияQI.ОтправитьСлужебноеУведомление(ВнешнийИсточникIT, ТемаПисьма, ТелоПисьма + ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверятьЗаполнениеСчетДепоМХвСправочникеСчетаДепо =
		РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("554.ПроверятьЗаполнениеСчетДепоМХвСправочникеСчетаДепо", Ложь);
	ЭтоКонтрагент = Справочники.Контрагенты.ЯвляетсяКонтрагентом(Владелец);
	Если ПроверятьЗаполнениеСчетДепоМХвСправочникеСчетаДепо И Не ЭтоКонтрагент Тогда
		ПроверяемыеРеквизиты.Добавить("СчетДепоМХ");
	КонецЕсли;
	
	ПроверяемыеРеквизиты.Добавить("ВидСчетаДепо");
КонецПроцедуры