
&НаКлиенте
Процедура Установить(Команда)
	
	УстановитьПараметры(Заголовок);
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьПараметры(Заголовок)
	
	Заголовок = "Создание поручений по договорам ДУ";
	ЗначениеВыбора = Новый Структура;
	ЗначениеВыбора.Вставить("Значения", ПодготовитьСтруктуруХранилища());
	ЗначениеВыбора.Вставить("ЗаголовокНастроек", Заголовок);
	
	ОповеститьОВыборе(ЗначениеВыбора);
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиОбработки = Неопределено;
	Если ТипЗнч(Параметры.НастройкиАлгоритма) = Тип("Структура") тогда
		НастройкиОбработки = Параметры.НастройкиАлгоритма;
	Иначе
		ДопОбработка = Неопределено;
		Если Параметры.Свойство("ДополнительнаяОбработкаСсылка", ДопОбработка) Тогда
			НастройкиОбработки = Справочники.ДополнительныеОтчетыИОбработки.НастройкиОбработки(ДопОбработка);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиОбработки) Тогда
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.УстановитьПользовательскиеНастройки(НастройкиОбработки);
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	КонецЕсли;
		
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПодготовитьСтруктуруХранилища()
	
	Значения = Новый Структура; 
	Значения.Вставить("СтатьяЗатрат", 				Объект.СтатьяЗатрат);
	Значения.Вставить("СтатьяДДС", 					Объект.СтатьяДДС);
	Значения.Вставить("СчетРасчетов", 				Объект.СчетРасчетов);  
	Значения.Вставить("СтатьяЗатратСписание", 		Объект.СтатьяЗатратСписание);
	Значения.Вставить("СтатьяДДССписание", 			Объект.СтатьяДДССписание);
	Значения.Вставить("СтатьяЗатратСписаниеНДФЛ", 	Объект.СтатьяЗатратСписаниеЗадолженность);
	Значения.Вставить("СтатьяДДССписаниеНДФЛ", 		Объект.СтатьяДДССписаниеЗадолженность);
	Значения.Вставить("СчетРасчетовСписание", 		Объект.СчетРасчетовСписание);
	Значения.Вставить("НастрройкиНДФЛ", 			Объект.НастрройкиНДФЛ);
	Значения.Вставить("НастройкиВУК",				Объект.НастройкиВУК);
	Значения.Вставить("Шаблоны", 					Объект.Шаблоны);   
	Значения.Вставить("НазначениеПлатежа", 			Объект.НазначениеПлатежа); 
	Значения.Вставить("ПочтовыйЛогин", 				Объект.ПочтовыйЛогин);
	Значения.Вставить("СписокРассылки", 			XMLСтрока(Новый ХранилищеЗначения(Объект.СписокРассылки.Выгрузить())));
	
	Возврат Значения;
	
Конецфункции

&НаСервере
Процедура ПрочитатьНастройкиНаСервере() 
	
	ДопОбработка = Объект.ДополнительнаяОбработка;
	НастройкиОбработки = Справочники.ДополнительныеОтчетыИОбработки.НастройкиОбработки(ДопОбработка);
	
	Если ЗначениеЗаполнено(НастройкиОбработки) Тогда
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.УстановитьПользовательскиеНастройки(НастройкиОбработки);
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьНастройки(Команда)
	ПрочитатьНастройкиНаСервере();
КонецПроцедуры

#КонецОбласти