
// Возвращает реквизиты последней входящей записи на дату среза по указаному КД
Функция ПоследниеВходящиеПараметрыКД(КД, ДатаСреза = Неопределено) Экспорт
	Срез = Новый Структура("Этап, ТипУведомления",
		Справочники.ЭтапыКД.ПустаяСсылка(), Справочники.ТипыУведомления.ПустаяСсылка());
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭтапыКД.ЭтапКД КАК Этап,
	|	ЭтапыКД.ТипУведомления КАК ТипУведомления
	|ИЗ
	|	РегистрСведений.ЭтапыКД КАК ЭтапыКД
	|ГДЕ
	|	ЭтапыКД.Период <= &ДатаСреза
	|	И ЭтапыКД.КД = &КД
	|	И НЕ ЭтапыКД.Исходящее
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапыКД.Период УБЫВ");
	Запрос.УстановитьПараметр("ДатаСреза", ?(ЗначениеЗаполнено(ДатаСреза), ДатаСреза, ТекущаяДата()));
	Запрос.УстановитьПараметр("КД", КД);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Срез, Выборка);
	КонецЕсли;
	
	Возврат Срез;
КонецФункции
