// СОБЫТИЯ ФОРМЫ

#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "v."+ РеквизитФормыВЗначение("Объект").СведенияОВнешнейОбработке().Версия;
	
КонецПроцедуры

#КонецОбласти


// КОМАНДЫ ФОРМЫ

#Область КОМАНДЫ_ФОРМЫ


&НаКлиенте
Процедура ЗаполнитьОтчет(Команда)
	
	ОчиститьСообщения();
	
	// Проверка заполнения 
	Отказ = НЕ ПроверитьЗаполнение();
	Если НЕ ЗначениеЗаполнено(Объект.РегламентныйОтчет0420431) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран регл. отчет.",,"Объект.РегламентныйОтчет0420431",,Отказ);
	КонецЕсли;
	Если Отказ Тогда  Возврат;	КонецЕсли;

	ЗаполнитьОтчетНаСервере(); 
	
КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьОтчетНаСервере()
			
	Идентификатор = "ЗаполнитьОтчетПоДоговорамДУ";
	
	ОбъектыНазначения = Новый Массив;
	ОбъектыНазначения.Добавить(Объект.РегламентныйОтчет0420431);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыполнитьКоманду(Идентификатор, ОбъектыНазначения, Неопределено);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

#КонецОбласти

