
//#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьЗаголовокФормы();
	ВосстановитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗавершениеРаботы Тогда
		Возврат;		
	КонецЕсли; 
	СохранитьНастройки();
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	СформироватьЗаголовокФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	СформироватьЗаголовокФормы();
КонецПроцедуры

//#КонецОбласти 

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;		
	КонецЕсли; 
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	Если ЗначениеЗаполнено(Отчет.ДатаНачала) Тогда
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", Отчет.ДатаНачала);
	КонецЕсли; 
	Если ЗначениеЗаполнено(Отчет.ДатаОкончания) Тогда
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", Отчет.ДатаОкончания);
	КонецЕсли; 
		
	СкомпоноватьРезультат();
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период.ДатаНачала = Отчет.ДатаНачала;
	Диалог.Период.ДатаОкончания = Отчет.ДатаОкончания;
	Если Диалог.Редактировать() Тогда
		Отчет.ДатаНачала = Диалог.Период.ДатаНачала;
		Отчет.ДатаОкончания = Диалог.Период.ДатаОкончания;		
		СформироватьЗаголовокФормы();
	КонецЕсли; 	
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

// Процедура формирует зоголовок формы отчета с учетом настроек
//
// Параметры:
//  Нет.
//
Процедура СформироватьЗаголовокФормы()
	
	// Вывод заголовка, описателя периода и фильтров и заголовка
	Если Отчет.ДатаНачала = '00010101000000' И Отчет.ДатаОкончания = '00010101000000' Тогда
		
		ОписаниеПериода     = "Период не установлен";
		
	Иначе
		
		Если Отчет.ДатаНачала = '00010101000000' ИЛИ Отчет.ДатаОкончания = '00010101000000' Тогда
			
			ОписаниеПериода = "За " + Формат(Отчет.ДатаНачала, "ДФ = ""дд.ММ.гггг""; ДП = ""...""") 
			+ " - "      + Формат(Отчет.ДатаОкончания, "ДФ = ""дд.ММ.гггг""; ДП = ""...""");
			
		Иначе
			
			Если Отчет.ДатаНачала <= Отчет.ДатаОкончания Тогда
				ОписаниеПериода = "За " + ПредставлениеПериода(НачалоДня(Отчет.ДатаНачала), КонецДня(Отчет.ДатаОкончания), "ФП = Истина");
			Иначе
				ОписаниеПериода = "Неправильно задан период!"
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	Элементы.ДекорацияЗаголовок.Заголовок = ОписаниеПериода;
	Заголовок =  "Остатки и обороты (" + ОписаниеПериода + ") " ;
	
КонецПроцедуры // СформироватьЗаголовокФормы()

Процедура СохранитьНастройки()
	
	ХранилищеОбщихНастроек.Сохранить("Отчет.ОстаткиИОборотыЦБ"
		, "НастройкиКомпоновщика"
		, Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры
 
Процедура ВосстановитьНастройки()
	
	Настройки = ХранилищеОбщихНастроек.Загрузить("Отчет.ОстаткиИОборотыЦБ"
		, "НастройкиКомпоновщика");
		
	Если Настройки <> Неопределено Тогда
		НастройкиКомпоновщика =  Отчет.КомпоновщикНастроек.ПолучитьНастройки();
		КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(НастройкиКомпоновщика.Отбор
			, Настройки.Отбор);					
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновщика);			
	КонецЕсли; 
	
КонецПроцедуры

//#КонецОбласти
