Функция ПолучитьЧислоИзСтроки(ЧислоСтрокой) Экспорт
	
	Результат = 0;
	Если ЗначениеЗаполнено(ЧислоСтрокой) Тогда
		СтрокаБезРазделителейТысяч = СтрЗаменить(ЧислоСтрокой, ",", "");
		СтрокаСЗапятой = СтрЗаменить(СтрокаБезРазделителейТысяч, ".", ",");
		Попытка
			Результат = Число(СтрокаСЗапятой);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

Функция ПолучитьДатуПоСтрокеДДММГГ(ДатаСтрокой) Экспорт
	
	ДатаЦифры = СтрЗаменить(ДатаСтрокой, ".", "");
	ДатаЦифры = ВыделитьПоследовательностьЦифр(ДатаЦифры);
	Возврат Дата(Число(Прав(ДатаЦифры, 2)) + 2000, Сред(ДатаЦифры, 3, 2), Лев(ДатаЦифры, 2));
	
КонецФункции

Функция ВыделитьПоследовательностьЦифр(Строка) Экспорт
	
	ПоследовательностьЦифр = "";
	
	ДлинаСтроки = СтрДлина(Строка);
	Для Сч = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(Строка, Сч);
		
		Если ЭтоКодЦифры(КодСимвола) Тогда
			
			ПоследовательностьЦифр = ПоследовательностьЦифр + Символ(КодСимвола);
			
		Иначе
			
			Если ПустаяСтрока(ПоследовательностьЦифр) Тогда
				Продолжить;
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат ПоследовательностьЦифр;
	
КонецФункции

Функция ПолучитьДатуИзСтроки(ДатаСтрокой) Экспорт
	
	ДатаБезРазделителей = СтрЗаменить(ДатаСтрокой, ".", "");
	Возврат Дата(Прав(ДатаБезРазделителей, 4) + Сред(ДатаБезРазделителей, 3, 2) + Лев(ДатаБезРазделителей, 2));
	
КонецФункции

Функция ЭтоКодЦифры(КодСимвола)
	
	Возврат КодСимвола >= 48 И КодСимвола <= 57;
	
КонецФункции

// Получает дату и время из строки формата ГГГГ-ММ-ДДTЧЧ:ММ:СС или дату из строки формата ГГГГ-ММ-ДД
// Пример даты и времени: 2017-10-26T09:30:00
// Пример даты: 2017-10-27
Функция ДатаВремяИзСтроки(ДатаСтрокой) Экспорт
	
	РазделительДаты = "-";
	РазделительВремени = ":";
	ДатаВозврата = Дата(1, 1, 1);
	Если ЗначениеЗаполнено(ДатаСтрокой) Тогда
		Год		= Лев(ДатаСтрокой, 4);
		Месяц	= Сред(ДатаСтрокой, 6, 2);
		День	= Сред(ДатаСтрокой, 9, 2);
		РазделительДаты1 = Сред(ДатаСтрокой, 5, 1);
		РазделительДаты2 = Сред(ДатаСтрокой, 8, 1);
		Час		= Сред(ДатаСтрокой, 12, 2);
		Минута	= Сред(ДатаСтрокой, 15, 2);
		Секунда	= Сред(ДатаСтрокой, 18, 2);
		МеткаВремени = Сред(ДатаСтрокой, 11, 1);
		РазделительВремени1 = Сред(ДатаСтрокой, 14, 1);
		РазделительВремени2 = Сред(ДатаСтрокой, 17, 1);
		
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Год + Месяц + День + Час + Минута + Секунда)
			И РазделительДаты1 = РазделительДаты И РазделительДаты2 = РазделительДаты
			И МеткаВремени = "T" И РазделительВремени1 = РазделительВремени И РазделительВремени2 = РазделительВремени Тогда
			ДатаВозврата = Дата(Год, Месяц, День, Час, Минута, Секунда);
		ИначеЕсли СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Год + Месяц + День)
			И РазделительДаты1 = РазделительДаты И РазделительДаты2 = РазделительДаты Тогда
			ДатаВозврата = Дата(Год, Месяц, День, 0, 0, 0);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДатаВозврата;
	
КонецФункции

// Конвертирует время из строки в тип "Дата".
//
// Параметры:
//  ВремяСтрокой - Строка - время в формате "Ч:ММ:СС" или "ЧЧ:ММ:СС"
// 
// Возвращаемое значение:
//  Дата - время
//
Функция ВремяИзСтроки(ВремяСтрокой) Экспорт
	
	ПозицияПервогоДвоеточия = Найти(ВремяСтрокой, ":");
	Если ПозицияПервогоДвоеточия = 2 Тогда
		ДатаВремяСтрокой = "0001-01-01T0" + ВремяСтрокой;
	ИначеЕсли ПозицияПервогоДвоеточия = 3 Тогда
		ДатаВремяСтрокой = "0001-01-01T" + ВремяСтрокой;
	Иначе
		Возврат Дата(1, 1, 1, 0, 0, 0);
	КонецЕсли;
	
	Возврат ДатаВремяИзСтроки(ДатаВремяСтрокой);
	
КонецФункции

// Возвращает дату из строки формата "Текущая дата - 31 января 2019",
// где перед днем могут находиться любые нечисловые символы
Функция ДатаИзСтрокиПрописью(ДатаПрописью) Экспорт
	ДатаВозврата = Дата(1, 1, 1);
	Цифры = "0123456789";
	Месяцы = Новый Массив;
	Месяцы.Добавить("Января");
	Месяцы.Добавить("Февраля");
	Месяцы.Добавить("Марта");
	Месяцы.Добавить("Апреля");
	Месяцы.Добавить("Мая");
	Месяцы.Добавить("Июня");
	Месяцы.Добавить("Июля");
	Месяцы.Добавить("Августа");
	Месяцы.Добавить("Сентября");
	Месяцы.Добавить("Октября");
	Месяцы.Добавить("Ноября");
	Месяцы.Добавить("Декабря");
	ТекущаяПозиция = 1;
	
	Если ЗначениеЗаполнено(ДатаПрописью) Тогда
		ДеньСтрока		= СледующийБлокСимволов(ДатаПрописью, ТекущаяПозиция, Цифры, "Принадлежит");
		НазваниеМесяца	= ВРег(СокрЛП(СледующийБлокСимволов(ДатаПрописью, ТекущаяПозиция, Цифры, "НеПринадлежит")));
		ГодСтрока		= СледующийБлокСимволов(ДатаПрописью, ТекущаяПозиция, Цифры, "Принадлежит");
		
		Если ДеньСтрока = "" Тогда
			Возврат ДатаВозврата;
		КонецЕсли;
		День = Число(ДеньСтрока);
		
		Месяц = 0;
		Для Инд = 0 По 11 Цикл
			Если ВРег(Месяцы[Инд]) = НазваниеМесяца Тогда
				Месяц = Инд + 1;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ГодСтрока = "" Тогда
			Возврат ДатаВозврата;
		КонецЕсли;
		Год = Число(ГодСтрока);
		
		Попытка
			ДатаВозврата = Дата(Год, Месяц, День);
		Исключение
			Возврат ДатаВозврата;
		КонецПопытки;
	КонецЕсли;
	
	Возврат ДатаВозврата;
КонецФункции

// Возвращает первый блок символов указанного множества из текста начиная с текущей позиции
//
// Параметры:
//	Текст - исходная строка
//	ТекущаяПозиция - номер текущего символа в тексте, инкрементируется внутри функции
//	МножествоСимволов - строка - набор символов множества
//	Операция - строка - "Принадлежит" или "НеПринадлежит" символы блока указанному множеству
Функция СледующийБлокСимволов(Текст, ТекущаяПозиция, МножествоСимволов, Операция) Экспорт
	Блок = "";
	
	// Найти первый символ из множества
	Пока ТекущаяПозиция <= СтрДлина(Текст) Цикл
		Символ = Сред(Текст, ТекущаяПозиция, 1);
		Если (Операция = "Принадлежит" И Найти(МножествоСимволов, Символ) > 0)
			ИЛИ (Операция = "НеПринадлежит" И Найти(МножествоСимволов, Символ) = 0) Тогда
			Прервать;
		Иначе
			ТекущаяПозиция = ТекущаяПозиция + 1;
		КонецЕсли;
	КонецЦикла;
	
	// Собрать блок из символов множества
	Пока ТекущаяПозиция <= СтрДлина(Текст) Цикл
		Символ = Сред(Текст, ТекущаяПозиция, 1);
		Если (Операция = "Принадлежит" И Найти(МножествоСимволов, Символ) > 0)
			ИЛИ (Операция = "НеПринадлежит" И Найти(МножествоСимволов, Символ) = 0) Тогда
			Блок = Блок + Символ;
		Иначе
			Прервать;
		КонецЕсли;
		ТекущаяПозиция = ТекущаяПозиция + 1;
	КонецЦикла;
	
	Возврат Блок;
КонецФункции
