
// Возвращает элемент справочника по заданному коду НРД, в случае неудачного поиска
// возвращает Неопределено
// 
// Возвращаемое значение:
//  СправочникСсылка.СтатусыUSTAXCODEгл4
//
Функция НайтиПоКодуНРД(КодНРД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	СтатусыUSTAXCODEгл4.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатусыUSTAXCODEгл4 КАК СтатусыUSTAXCODEгл4
	|ГДЕ
	|	СтатусыUSTAXCODEгл4.КодНРД = &КодНРД
	|	И НЕ СтатусыUSTAXCODEгл4.ПометкаУдаления";
	Запрос.УстановитьПараметр("КодНРД", КодНРД);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Если Выборка.Количество() <> 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции
