	 
Перем МассивСоединений;	 
Перем ТЗсписокКлиентов;

// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область ПРОГРАММНЫЙ_ИНТЕРФЕЙС

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиЗаполнениеОбъекта();
	ПараметрыРегистрации.Версия = "1.00";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.ВерсияБСП	= СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	ПараметрыРегистрации.Наименование =  "Заполнение регламентного отчета '0420431' таксономия 7.1 (по договорам ДУ) - 1";	
	ПараметрыРегистрации.Назначение.Добавить("Документ.РО_XBRL7_1_0420431_СведенияОДеятельностиПоУправлениюЦБ_7119У");
	
	// Вызов серверного метода
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = "Заполнить отчет по договорам ДУ - 1";
	Команда.Идентификатор = "ЗаполнитьОтчетПоДоговорамДУ";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	Команда.ПоказыватьОповещение = Истина;

	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура УстановитьПользовательскиеНастройки(Знач Настройки, ПредставлениеНастроек = "") Экспорт
	
	Если Настройки.Свойство("Значения") Тогда		
		ОтноситьРасхожденияНаПрочиеЗадолженности = Настройки.Значения.ОтноситьРасхожденияНаПрочиеЗадолженности;
		ИсключитьЦессии = Настройки.Значения.ИсключитьЦессии;  
		
		МассивБазМО = Неопределено;
		Если Настройки.Значения.Свойство("МассивБазМО", МассивБазМО) Тогда  
			Для каждого СтрокаБаза Из МассивБазМО Цикл
				НоваяСтрока = ВнешниеБазыМО.Добавить();
				НоваяСтрока.База = СтрокаБаза;  
			КонецЦикла;
		 КонецЕсли; 
		 
		Настройки.Значения.Свойство("ТипУчета",					ТипУчета);
		Настройки.Значения.Свойство("ВознаграждениеКакПассив",	ВознаграждениеКакПассив);
		Настройки.Значения.Свойство("КоммисияКакПассив",		КоммисияКакПассив);
		Настройки.Значения.Свойство("НДФЛКакПассив",			НДФЛКакПассив);
		Настройки.Значения.Свойство("ИсключитьПИФ",				ИсключитьПИФ);
		Настройки.Значения.Свойство("УровеньОтсечки",			УровеньОтсечки);

		Настройки.Значения.Свойство("УчитыватьКлиентовПришедшихВнутриПериода",	УчитыватьКлиентовПришедшихВнутриПериода);
		
		ПредставлениеНастроек = "";
	КонецЕсли;
	
КонецПроцедуры

// Обработчик серверных команд.
//
// Параметры:
//   ИдентификаторКоманды - Строка - Имя команды, определенное в функции СведенияОВнешнейОбработке().
//   ОбъектыНазначения    - Массив - Ссылки объектов, для которых вызвана команда.
//       - Неопределено - для команд "ЗаполнениеФормы".
//   ПараметрыВыполнения  - Структура - Контекст выполнения команды.
//       * ДополнительнаяОбработкаСсылка - СправочникСсылка.ДополнительныеОтчетыИОбработки - Ссылка обработки.
//           Может использоваться для чтения параметров обработки.
//           Пример см. в комментарии к функции ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы().
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначения, ПараметрыВыполнения) Экспорт

	Если ИдентификаторКоманды <> "ЗаполнитьОтчетПоДоговорамДУ" ИЛИ ОбъектыНазначения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНастроки(ПараметрыВыполнения);   
		
	Если ВнешниеБазыМО.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не добавлено ни одной база МО в настройки алгоритма!");
		Возврат;	
	КонецЕсли;  
	
	МассивСоединений = Новый Массив;
	
	Для Каждого СтрокаБазаМО Из ВнешниеБазыМО Цикл   
 		БазаМО = СтрокаБазаМО.База;  
		ПараметрыПодключения = ОбщегоНазначенияКлиентСервер.СтруктураПараметровДляУстановкиВнешнегоСоединения();
		ЗаполнитьЗначенияСвойств(ПараметрыПодключения, БазаМО);
		
		СтруктураПодключения = Справочники.ВнешниеИнформационныеБазы.УстановитьВнешнееСоединение(ПараметрыПодключения);
		Соединение = СтруктураПодключения.Соединение;
		Если Соединение = Неопределено  Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПодключения.ПодробноеОписаниеОшибки);
			Возврат;
		КонецЕсли;
		
		МассивСоединений.Добавить(Соединение);
	КонецЦикла;
	
	Для Каждого ЭлементОбъектНазначения Из ОбъектыНазначения Цикл
		
		ОбъектНазначения = ЭлементОбъектНазначения.ПолучитьОбъект();
		
		// Зааполнение сопроводительного письма
		ОбъектНазначения.ЗаполнитьОтчет();
		
		// Заполнение 
		ЗаполнитьРазделыОтчета(ОбъектНазначения);
		
		// Дозаполняем пустые значения
		РегламентированнаяОтчетность.ДозаполнениеПустыхЗначенийПоОтчетамПрофучастника(ОбъектНазначения);
	
		ОбъектНазначения.Записать();
		
	КонецЦикла;
		
	Соединение = Неопределено;
	
КонецПроцедуры

#КонецОбласти  


#Область devops

Процедура ЗагрузитьНастройки(ПараметрыРегистрации) Экспорт 
	
	ВерсияПрименения = "1.01";
	ТекущаяРегистрация = СведенияОВнешнейОбработке();  
	
	Если ВерсияПрименения = ТекущаяРегистрация.Версия Тогда  
		ПараметрыРегистрации.Вставить("ЗагружатьНастройки", Истина);
		НастройкиПоУмолчанию(ЭтотОбъект);
		ЗаголовокНастроек = "";
		ЗначенияПараметров = УстановитьПараметры(ЗаголовокНастроек);
		ПараметрыРегистрации.Вставить("Настройки", Новый Структура("Значения, ЗаголовокНастроек", ЗначенияПараметров, ЗаголовокНастроек));
	КонецЕсли;	
	
КонецПроцедуры	

Процедура НастройкиПоУмолчанию(Объект) Экспорт
		
	Объект.ОтноситьРасхожденияНаПрочиеЗадолженности	= Истина;
	Объект.ИсключитьЦессии			= Истина;
	Объект.ТипУчета					= "Плановый";
	Объект.ВознаграждениеКакПассив	= Истина;
	Объект.КоммисияКакПассив		= Ложь;
	Объект.НДФЛКакПассив			= Истина;
	Объект.ИсключитьПИФ				= Истина;
	Объект.УровеньОтсечки			= 1000000;
	Объект.УчитыватьКлиентовПришедшихВнутриПериода	= Истина;
	
	Объект.ВнешниеБазыМО.Очистить();
	
	НоваяСтрока = Объект.ВнешниеБазыМО.Добавить();
	НоваяСтрока.База = Справочники.ВнешниеИнформационныеБазы.НайтиПоНаименованию("PROD_AVC_MO", Истина);
	НоваяСтрока = Объект.ВнешниеБазыМО.Добавить();
	НоваяСтрока.База = Справочники.ВнешниеИнформационныеБазы.НайтиПоНаименованию("PROD_AVC_Retail_MO", Истина);
	
КонецПроцедуры 

Функция УстановитьПараметры(ЗаголовокНастроек) Экспорт
	
	Значения = Новый Структура();
	
	Значения.Вставить("ОтноситьРасхожденияНаПрочиеЗадолженности", ЭтотОбъект.ОтноситьРасхожденияНаПрочиеЗадолженности);
	Значения.Вставить("ИсключитьЦессии", ЭтотОбъект.ИсключитьЦессии);  
	
	МассивБазМО = Новый Массив;
	Для Каждого СрокаБазаМО Из ЭтотОбъект.ВнешниеБазыМО Цикл    
		МассивБазМО.Добавить(СрокаБазаМО.База);
	КонецЦикла;	    
	
	Значения.Вставить("МассивБазМО", МассивБазМО);    
	
	Значения.Вставить("ТипУчета",					ЭтотОбъект.ТипУчета);    
	Значения.Вставить("ВознаграждениеКакПассив",	ЭтотОбъект.ВознаграждениеКакПассив);    
	Значения.Вставить("КоммисияКакПассив",			ЭтотОбъект.КоммисияКакПассив);    
	Значения.Вставить("НДФЛКакПассив",				ЭтотОбъект.НДФЛКакПассив);    
	Значения.Вставить("ИсключитьПИФ",				ЭтотОбъект.ИсключитьПИФ);    
	Значения.Вставить("УровеньОтсечки",				ЭтотОбъект.УровеньОтсечки);    
	Значения.Вставить("УчитыватьКлиентовПришедшихВнутриПериода",	ЭтотОбъект.УчитыватьКлиентовПришедшихВнутриПериода);    
	
	Возврат Значения;
	
КонецФункции	
	
#КонецОбласти


// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

Процедура ЗаполнитьНастроки(ПараметрыВыполнения)

	Если ТипЗнч(ПараметрыВыполнения) = Тип("Структура") И ТипЗнч(ПараметрыВыполнения.ПараметрыДополнительнойОбработки) = Тип("Структура") Тогда
		УстановитьПользовательскиеНастройки(ПараметрыВыполнения.ПараметрыДополнительнойОбработки);
	КонецЕсли;
	
КонецПроцедуры

Функция ТипыКлиентовДляРеестраЦБ()

	ТипыКлиентовКолонка83 = Новый Массив;
	ТипыКлиентовКолонка83.Добавить(Перечисления.ТипыКлиентовДУ.ФизическиеЛица);
	ТипыКлиентовКолонка83.Добавить(Перечисления.ТипыКлиентовДУ.ЮридическиеЛица);
	ТипыКлиентовКолонка83.Добавить(Перечисления.ТипыКлиентовДУ.ИндивидуальныеПредприниматели);
	ТипыКлиентовКолонка83.Добавить(Перечисления.ТипыКлиентовДУ.СтраховыеКомпании);
	ТипыКлиентовКолонка83.Добавить(Перечисления.ТипыКлиентовДУ.ФондЦелевогоКапитала);
	ТипыКлиентовКолонка83.Добавить(Перечисления.ТипыКлиентовДУ.СаморегулируемыеОрганизации);
	ТипыКлиентовКолонка83.Добавить(Перечисления.ТипыКлиентовДУ.ГарантийныеФонда);
	ТипыКлиентовКолонка83.Добавить(Перечисления.ТипыКлиентовДУ.СобственныеСредстваУК);
	
	Возврат ТипыКлиентовКолонка83;
	
КонецФункции

Функция ТипыКлиентовДУ()

	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Перечисления.ТипыКлиентовДУ.ФизическиеЛица);
	МассивТипов.Добавить(Перечисления.ТипыКлиентовДУ.ЮридическиеЛица);
	МассивТипов.Добавить(Перечисления.ТипыКлиентовДУ.СтраховыеКомпании);
	МассивТипов.Добавить(Перечисления.ТипыКлиентовДУ.СобственныеСредстваСК);
	МассивТипов.Добавить(Перечисления.ТипыКлиентовДУ.СаморегулируемыеОрганизации);
	МассивТипов.Добавить(Перечисления.ТипыКлиентовДУ.ФондЦелевогоКапитала);
	
	Возврат МассивТипов;
	
КонецФункции

Процедура ЗаполнитьРазделыОтчета(ОтчетОбъект)
	
	МВТ = СформироватьМенеджерВременныхТаблиц(ОтчетОбъект);
	СформироватьВТ_ДанныеПоСтратегиям(МВТ, ОтчетОбъект);
	ДополнитьВременныеТаблицы(МВТ, ОтчетОбъект);
	ДополнитьВТ_ВводыВыводы(ОтчетОбъект, МВТ);
	ЗаполнитьРаздел_1(ОтчетОбъект, МВТ);
	ЗаполнитьРаздел_2_3(ОтчетОбъект, МВТ);
	ЗаполнитьРаздел_4(ОтчетОбъект, МВТ);
	ЗаполнитьРаздел_5(ОтчетОбъект, МВТ);
	ЗаполнитьРаздел_6(ОтчетОбъект, МВТ); 
	ЗаполнитьРаздел_7(ОтчетОбъект, МВТ);
	ЗаполнитьРазделРеестрЦБ(ОтчетОбъект, МВТ);
    
КонецПроцедуры

Функция ПолучитьСписокАктивныхКлиентовИзМО(Соединение, ДатаНачала, ДатаОкончания, Валюта, Стратегия, УчитыватьКлиентовПришедшихВнутриПериода)
	
	ТипМандатаПИФ = Соединение.NewObject("Массив");
	//ОПИФ
	ТипМандатаПИФ.Добавить(Соединение.Перечисления.ТипыМандата.A);
	ТипМандатаПИФ.Добавить(Соединение.Перечисления.ТипыМандата.O);
	ТипМандатаПИФ.Добавить(Соединение.Перечисления.ТипыМандата.M);
	ТипМандатаПИФ.Добавить(Соединение.Перечисления.ТипыМандата.X);
	//ЗПИФ
	ТипМандатаПИФ.Добавить(Соединение.Перечисления.ТипыМандата.V);
	ТипМандатаПИФ.Добавить(Соединение.Перечисления.ТипыМандата.Y);
	ТипМандатаПИФ.Добавить(Соединение.Перечисления.ТипыМандата.Q);
	ТипМандатаПИФ.Добавить(Соединение.Перечисления.ТипыМандата.H);
	
	ТекстЗапросаМО = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	т.Ссылка
		|ПОМЕСТИТЬ втМандаты
		|ИЗ
		|	РегистрСведений.ДействующиеФинПланы.СрезПоследних(, ) КАК ДействующиеФинПланыСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Мандаты КАК т
		|		ПО ДействующиеФинПланыСрезПоследних.Мандат = т.Ссылка
		|ГДЕ
		|	НЕ т.ПометкаУдаления
		|	И (НЕ т.ТипМандата В (&ТипМандата)
		|			ИЛИ &НеИсключитьПИФ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	т.Мандат,
		|	СУММА(т.СуммаНаНачало) КАК СуммаНаНачало,
		|	СУММА(т.СуммаНаКонец) КАК СуммаНаКонец
		|ИЗ
		|	(ВЫБРАТЬ
		|		т.Мандат КАК Мандат,
		|		т.Сумма КАК СуммаВВалюте,
		|		т.Валюта КАК Валюта,
		|		тКурсОтчета.Курс КАК КурсВалютыОтчета,
		|		тКурсы.Курс КАК КурсРыночнойСтоимости,
		|		ВЫБОР
		|			КОГДА ЕСТЬNULL(тКурсОтчета.Курс, 0) = 0
		|				ТОГДА 0
		|			ИНАЧЕ т.Сумма * тКурсы.Курс / тКурсОтчета.Курс
		|		КОНЕЦ КАК СуммаНаНачало,
		|		0 КАК СуммаНаКонец
		|	ИЗ
		|		РегистрСведений.РыночнаяСтоимостьПозиции.СрезПоследних(
		|				&ДатаНачала,
		|				Мандат В
		|						(ВЫБРАТЬ
		|							т.Ссылка
		|						ИЗ
		|							втМандаты КАК т)
		|					И СчетМандата.Стратегия В ИЕРАРХИИ (&Стратегия)) КАК т
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаНачала, Валюта = &Валюта) КАК тКурсОтчета
		|			ПО (ИСТИНА)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаНачала, ) КАК тКурсы
		|			ПО (тКурсы.Валюта = т.Валюта)
		|	ГДЕ
		|		НАЧАЛОПЕРИОДА(т.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		т.Мандат,
		|		т.Сумма,
		|		т.Валюта,
		|		тКурсОтчета.Курс,
		|		тКурсы.Курс,
		|		0,
		|		ВЫБОР
		|			КОГДА ЕСТЬNULL(тКурсОтчета.Курс, 0) = 0
		|				ТОГДА 0
		|			ИНАЧЕ т.Сумма * тКурсы.Курс / тКурсОтчета.Курс
		|		КОНЕЦ
		|	ИЗ
		|		РегистрСведений.РыночнаяСтоимостьПозиции.СрезПоследних(
		|				&ДатаОкончания,
		|				Мандат В
		|						(ВЫБРАТЬ
		|							т.Ссылка
		|						ИЗ
		|							втМандаты КАК т)
		|					И СчетМандата.Стратегия В ИЕРАРХИИ (&Стратегия)) КАК т
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОкончания, Валюта = &Валюта) КАК тКурсОтчета
		|			ПО (ИСТИНА)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОкончания, ) КАК тКурсы
		|			ПО (тКурсы.Валюта = т.Валюта)
		|	ГДЕ
		|		НАЧАЛОПЕРИОДА(т.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)) КАК т
		|
		|СГРУППИРОВАТЬ ПО
		|	т.Мандат
		|
		|ИМЕЮЩИЕ
		|	(СУММА(т.СуммаНаНачало) > &УровеньОтсечки 
		|		ИЛИ &УчитыватьКлиентовПришедшихВнутриПериода И СУММА(т.СуммаНаНачало) = 0) И
		|	СУММА(т.СуммаНаКонец) > &УровеньОтсечки";
	
	Запрос = Соединение.NewObject("Запрос");
	Запрос.Текст = ТекстЗапросаМО;
	
	Запрос.УстановитьПараметр("ДатаНачала",			ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",		ДатаОкончания);
	Запрос.УстановитьПараметр("Валюта",				Валюта);
	Запрос.УстановитьПараметр("Стратегия",			Стратегия);
	Запрос.УстановитьПараметр("ТипМандата",			ТипМандатаПИФ);
	Запрос.УстановитьПараметр("НеИсключитьПИФ",		Не ИсключитьПИФ);
	Запрос.УстановитьПараметр("УровеньОтсечки",		УровеньОтсечки);
	Запрос.УстановитьПараметр("УчитыватьКлиентовПришедшихВнутриПериода",	УчитыватьКлиентовПришедшихВнутриПериода);
	
	СписокАктивныхКлиентов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Мандат");
	
	Возврат СписокАктивныхКлиентов;

КонецФункции

Функция СформироватьМенеджерВременныхТаблиц(ОтчетОбъект)
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("ТЗсписокКлиентов", ТЗсписокКлиентов);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДоговорДУ.Клиент КАК Клиент,
		|	ДоговорДУ.Ссылка КАК ДоговорДУ,
		|	ДоговорДУ.ТипКлиентаДУ КАК ТипКлиентаДУ,
		|	ДоговорДУ.ДатаНачала КАК ДатаНачала,
		|	ДоговорДУ.ДатаОкончания КАК ДатаОкончания,
		|	ДоговорДУ.ДатаВводаСредствВДУ КАК ДатаВводаСредствВДУ,
		|	ДоговорДУ.Код КАК Код,
		|	ВЫБОР
		|		КОГДА ДоговорДУ.ТипИИС = ЗНАЧЕНИЕ(Перечисление.ТипыИИС.)
		|				ИЛИ ДоговорДУ.ТипИИС = ЗНАЧЕНИЕ(Перечисление.ТипыИИС.Нет)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ПризнакИИС
		|ПОМЕСТИТЬ ВТ_Договоры
		|ИЗ
		|	Справочник.ДоговорДУ КАК ДоговорДУ
		|ГДЕ
		|	ДоговорДУ.ТипКлиентаДУ В(&ТипыКлиентовДУ)
		//
		//
		|	и ДоговорДУ.Клиент В(&ТЗсписокКлиентов)						
		//
		//
		|	И ДоговорДУ.УправляющаяКомпания = &УправляющаяКомпания
		|	И ДоговорДУ.ПометкаУдаления = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА &БезДоговоровЦессии = ИСТИНА
		|				ТОГДА ДоговорДУ.ДатаЦессии = ДАТАВРЕМЯ(1, 1, 1)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Договоры.Клиент КАК Клиент,
		|	ВТ_Договоры.ДоговорДУ КАК ДоговорДУ,
		|	ВТ_Договоры.ТипКлиентаДУ КАК ТипКлиентаДУ,
		|	ВТ_Договоры.ДатаНачала КАК ДатаНачала,
		|	ВТ_Договоры.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_Договоры.ДатаВводаСредствВДУ КАК ДатаВводаСредствВДУ,
		|	ВТ_Договоры.Код КАК Код,
		|	ВТ_Договоры.ПризнакИИС КАК ПризнакИИС
		|ПОМЕСТИТЬ ВТ_ДоговораЗаключенныеВПериод
		|ИЗ
		|	ВТ_Договоры КАК ВТ_Договоры
		|ГДЕ
		|	ВТ_Договоры.ДатаВводаСредствВДУ МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВТ_Договоры.ДатаНачала <= &КонецПериода
		|	И (ВТ_Договоры.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ВТ_Договоры.ДатаОкончания > &КонецПериода
		|			ИЛИ ВТ_Договоры.ДатаОкончания МЕЖДУ ВТ_Договоры.ДатаНачала И &КонецПериода)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Договоры.Клиент КАК Клиент,
		|	ВТ_Договоры.ДоговорДУ КАК ДоговорДУ,
		|	ВТ_Договоры.ТипКлиентаДУ КАК ТипКлиентаДУ,
		|	ВТ_Договоры.ДатаНачала КАК ДатаНачала,
		|	ВТ_Договоры.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_Договоры.ДатаВводаСредствВДУ КАК ДатаВводаСредствВДУ,
		|	ВТ_Договоры.Код КАК Код,
		|	ВТ_Договоры.ПризнакИИС КАК ПризнакИИС
		|ПОМЕСТИТЬ ВТ_ДоговораПрекращенныеВПериод
		|ИЗ
		|	ВТ_Договоры КАК ВТ_Договоры
		|ГДЕ
		|	ВТ_Договоры.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ВТ_Договоры.ДатаВводаСредствВДУ <> ДАТАВРЕМЯ(1, 1, 1)
		|	И НАЧАЛОПЕРИОДА(ВТ_Договоры.ДатаНачала, ДЕНЬ) <= &КонецПериода
		|	И КОНЕЦПЕРИОДА(ВТ_Договоры.ДатаОкончания, ДЕНЬ) МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВТ_Договоры.ДатаВводаСредствВДУ <= &КонецПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Договоры.Клиент КАК Клиент,
		|	ВТ_Договоры.ДоговорДУ КАК ДоговорДУ,
		|	ВТ_Договоры.ТипКлиентаДУ КАК ТипКлиентаДУ,
		|	ВТ_Договоры.ДатаНачала КАК ДатаНачала,
		|	ВТ_Договоры.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_Договоры.ДатаВводаСредствВДУ КАК ДатаВводаСредствВДУ,
		|	ВТ_Договоры.Код КАК Код,
		|	ВТ_Договоры.ПризнакИИС КАК ПризнакИИС
		|ПОМЕСТИТЬ ВТ_ДоговораНаКонецПериода
		|ИЗ
		|	ВТ_Договоры КАК ВТ_Договоры
		|ГДЕ
		|	(ВТ_Договоры.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ВТ_Договоры.ДатаОкончания > &КонецПериода)
		|	И НАЧАЛОПЕРИОДА(ВТ_Договоры.ДатаНачала, ДЕНЬ) <= &КонецПериода
		|	И ВТ_Договоры.ДатаВводаСредствВДУ <= &КонецПериода
		|	И ВТ_Договоры.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ВТ_Договоры.ДатаВводаСредствВДУ <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Договоры.Клиент КАК Клиент,
		|	ВТ_Договоры.ДоговорДУ КАК ДоговорДУ,
		|	ВТ_Договоры.ТипКлиентаДУ КАК ТипКлиентаДУ,
		|	ВТ_Договоры.ДатаНачала КАК ДатаНачала,
		|	ВТ_Договоры.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_Договоры.ДатаВводаСредствВДУ КАК ДатаВводаСредствВДУ,
		|	ВТ_Договоры.Код КАК Код,
		|	ВТ_Договоры.ПризнакИИС КАК ПризнакИИС
		|ПОМЕСТИТЬ ВТ_ДоговораПрекращенныеНаНачалоПериода
		|ИЗ
		|	ВТ_Договоры КАК ВТ_Договоры
		|ГДЕ
		|	ВТ_Договоры.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ВТ_Договоры.ДатаОкончания < &НачалоПериода
		|	И НАЧАЛОПЕРИОДА(ВТ_Договоры.ДатаНачала, ДЕНЬ) < &НачалоПериода
		|	И ВТ_Договоры.ДатаВводаСредствВДУ <= &НачалоПериода
		|	И ВТ_Договоры.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ВТ_Договоры.ДатаВводаСредствВДУ <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДоговораЗаключенныеВПериод.Клиент КАК Клиент,
		|	ВТ_ДоговораЗаключенныеВПериод.ДоговорДУ КАК ДоговорДУ,
		|	ВТ_ДоговораЗаключенныеВПериод.ТипКлиентаДУ КАК ТипКлиентаДУ,
		|	ВТ_ДоговораЗаключенныеВПериод.ДатаНачала КАК ДатаНачала,
		|	ВТ_ДоговораЗаключенныеВПериод.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_ДоговораЗаключенныеВПериод.ДатаВводаСредствВДУ КАК ДатаВводаСредствВДУ,
		|	ВТ_ДоговораЗаключенныеВПериод.Код КАК Код,
		|	ВТ_ДоговораЗаключенныеВПериод.ПризнакИИС КАК ПризнакИИС
		|ПОМЕСТИТЬ ВТ_ВсеДоговорыБезГруппировки
		|ИЗ
		|	ВТ_ДоговораЗаключенныеВПериод КАК ВТ_ДоговораЗаключенныеВПериод
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДоговораПрекращенныеВПериод.Клиент,
		|	ВТ_ДоговораПрекращенныеВПериод.ДоговорДУ,
		|	ВТ_ДоговораПрекращенныеВПериод.ТипКлиентаДУ,
		|	ВТ_ДоговораПрекращенныеВПериод.ДатаНачала,
		|	ВТ_ДоговораПрекращенныеВПериод.ДатаОкончания,
		|	ВТ_ДоговораПрекращенныеВПериод.ДатаВводаСредствВДУ,
		|	ВТ_ДоговораПрекращенныеВПериод.Код,
		|	ВТ_ДоговораПрекращенныеВПериод.ПризнакИИС
		|ИЗ
		|	ВТ_ДоговораПрекращенныеВПериод КАК ВТ_ДоговораПрекращенныеВПериод
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДоговораНаКонецПериода.Клиент,
		|	ВТ_ДоговораНаКонецПериода.ДоговорДУ,
		|	ВТ_ДоговораНаКонецПериода.ТипКлиентаДУ,
		|	ВТ_ДоговораНаКонецПериода.ДатаНачала,
		|	ВТ_ДоговораНаКонецПериода.ДатаОкончания,
		|	ВТ_ДоговораНаКонецПериода.ДатаВводаСредствВДУ,
		|	ВТ_ДоговораНаКонецПериода.Код,
		|	ВТ_ДоговораНаКонецПериода.ПризнакИИС
		|ИЗ
		|	ВТ_ДоговораНаКонецПериода КАК ВТ_ДоговораНаКонецПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДоговораПрекращенныеНаНачалоПериода.Клиент,
		|	ВТ_ДоговораПрекращенныеНаНачалоПериода.ДоговорДУ,
		|	ВТ_ДоговораПрекращенныеНаНачалоПериода.ТипКлиентаДУ,
		|	ВТ_ДоговораПрекращенныеНаНачалоПериода.ДатаНачала,
		|	ВТ_ДоговораПрекращенныеНаНачалоПериода.ДатаОкончания,
		|	ВТ_ДоговораПрекращенныеНаНачалоПериода.ДатаВводаСредствВДУ,
		|	ВТ_ДоговораПрекращенныеНаНачалоПериода.Код,
		|	ВТ_ДоговораПрекращенныеНаНачалоПериода.ПризнакИИС
		|ИЗ
		|	ВТ_ДоговораПрекращенныеНаНачалоПериода КАК ВТ_ДоговораПрекращенныеНаНачалоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ВсеДоговорыБезГруппировки.Клиент КАК Клиент,
		|	ВТ_ВсеДоговорыБезГруппировки.ДоговорДУ КАК ДоговорДУ,
		|	ВТ_ВсеДоговорыБезГруппировки.ТипКлиентаДУ КАК ТипКлиентаДУ,
		|	ВТ_ВсеДоговорыБезГруппировки.ДатаНачала КАК ДатаНачала,
		|	ВТ_ВсеДоговорыБезГруппировки.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_ВсеДоговорыБезГруппировки.ДатаВводаСредствВДУ КАК ДатаВводаСредствВДУ,
		|	ВТ_ВсеДоговорыБезГруппировки.Код КАК Код,
		|	ВТ_ВсеДоговорыБезГруппировки.ПризнакИИС КАК ПризнакИИС
		|ПОМЕСТИТЬ ВТ_ВсеДоговора
		|ИЗ
		|	ВТ_ВсеДоговорыБезГруппировки КАК ВТ_ВсеДоговорыБезГруппировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеДоговора.Клиент КАК Клиент,
		|	ВТ_ВсеДоговора.ДоговорДУ КАК ДоговорДУ,
		|	ВТ_ВсеДоговора.ТипКлиентаДУ КАК ТипКлиентаДУ,
		|	ВТ_ВсеДоговора.ДатаНачала КАК ДатаНачала,
		|	ВТ_ВсеДоговора.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_ВсеДоговора.ДатаВводаСредствВДУ КАК ДатаВводаСредствВДУ,
		|	ВТ_ВсеДоговора.Код КАК Код,
		|	ВТ_ВсеДоговора.ПризнакИИС КАК ПризнакИИС
		|ПОМЕСТИТЬ ВТ_ДействующиеДоговора
		|ИЗ
		|	ВТ_ВсеДоговора КАК ВТ_ВсеДоговора
		|ГДЕ
		|	(КОНЕЦПЕРИОДА(ВТ_ВсеДоговора.ДоговорДУ.ДатаОкончания, ДЕНЬ) > &КонецПериода
		|				И НАЧАЛОПЕРИОДА(ВТ_ВсеДоговора.ДоговорДУ.ДатаНачала, ДЕНЬ) < &КонецПериода
		|			ИЛИ ВТ_ВсеДоговора.ДоговорДУ.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|	И ВЫБОР
		|			КОГДА ВТ_ВсеДоговора.ДоговорДУ.ДатаВводаСредствВДУ <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ВТ_ВсеДоговора.ДоговорДУ.ДатаВводаСредствВДУ <= &КонецПериода
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТипыКлиентовДУ", ТипыКлиентовДУ());
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ОтчетОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОтчетОбъект.КонецПериода));
	Запрос.УстановитьПараметр("УправляющаяКомпания", ОтчетОбъект.УправляющаяКомпания);
	Запрос.УстановитьПараметр("БезДоговоровЦессии", ИсключитьЦессии);
	
	Запрос.Выполнить();	
	
	Возврат МВТ;
	
КонецФункции

Процедура СформироватьВТ_ДанныеПоСтратегиям(МВТ, ОтчетОбъект)
		
	ДанныеПортфелей = МВТ.Таблицы["ВТ_ВсеДоговора"].ПолучитьДанные().Выгрузить();
	
	НомераПортфелей = ДанныеПортфелей.ВыгрузитьКолонку("Код");
	НомераПортфелей = ОбщегоНазначенияКлиентСервер.СвернутьМассив(НомераПортфелей);
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(НомераПортфелей, "");
	
	ТекстЗапросаМО = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                 |	Мандаты.Ссылка КАК Мандат,
	                 |	Мандаты.НомерДоговора КАК НомерДоговора,
	                 |	ДействующиеФинПланыСрезПоследних.ФинансовыйПлан КАК ФинансовыйПлан
	                 |ПОМЕСТИТЬ ВТ_ФинПлатыМандатов
	                 |ИЗ
	                 |	Справочник.Мандаты КАК Мандаты
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеФинПланы.СрезПоследних(&КонецПериода, Мандат.НомерДоговора В (&НомераДоговоров)) КАК ДействующиеФинПланыСрезПоследних
	                 |		ПО (ДействующиеФинПланыСрезПоследних.Мандат = Мандаты.Ссылка)
	                 |ГДЕ
	                 |	Мандаты.НомерДоговора В(&НомераДоговоров)
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	ВТ_ФинПлатыМандатов.Мандат КАК Мандат,
	                 |	ВТ_ФинПлатыМандатов.НомерДоговора КАК НомерДоговора,
	                 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	                 |			КОГДА ФинансовыеПланыСоставСтратегий.Стратегия.Родитель <> ЗНАЧЕНИЕ(Справочник.Стратегии.ПустаяСсылка)
	                 |				ТОГДА ФинансовыеПланыСоставСтратегий.Стратегия.Родитель
	                 |			ИНАЧЕ ФинансовыеПланыСоставСтратегий.Стратегия
	                 |		КОНЕЦ) КАК Стратегия
	                 |ПОМЕСТИТЬ ВТ_ИндивидуальныеСтратегииМандатов
	                 |ИЗ
	                 |	ВТ_ФинПлатыМандатов КАК ВТ_ФинПлатыМандатов
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ФинансовыеПланы.СоставСтратегий КАК ФинансовыеПланыСоставСтратегий
	                 |		ПО ВТ_ФинПлатыМандатов.ФинансовыйПлан = ФинансовыеПланыСоставСтратегий.Ссылка
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	ВТ_ФинПлатыМандатов.НомерДоговора,
	                 |	ВТ_ФинПлатыМандатов.Мандат
	                 |
	                 |ИМЕЮЩИЕ
	                 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	                 |			КОГДА ФинансовыеПланыСоставСтратегий.Стратегия.Родитель <> ЗНАЧЕНИЕ(Справочник.Стратегии.ПустаяСсылка)
	                 |				ТОГДА ФинансовыеПланыСоставСтратегий.Стратегия.Родитель
	                 |			ИНАЧЕ ФинансовыеПланыСоставСтратегий.Стратегия
	                 |		КОНЕЦ) > 1
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	ВТ_ФинПлатыМандатов.Мандат КАК Мандат,
	                 |	ВТ_ФинПлатыМандатов.НомерДоговора КАК НомерДоговора,
	                 |	ВЫБОР
	                 |		КОГДА ФинансовыеПланыСоставСтратегий.Стратегия.Родитель <> ЗНАЧЕНИЕ(Справочник.Стратегии.ПустаяСсылка)
	                 |			ТОГДА ФинансовыеПланыСоставСтратегий.Стратегия.Родитель
	                 |		ИНАЧЕ ФинансовыеПланыСоставСтратегий.Стратегия
	                 |	КОНЕЦ КАК Стратегия,
	                 |	ЕСТЬNULL(Стратегии.Наименование, """") КАК Наименование,
	                 |	ЕСТЬNULL(Стратегии.НаименованиеАнгл, """") КАК НаименованиеАнгл,
	                 |	ЕСТЬNULL(Стратегии.ВременнойГоризонт, 0) КАК ВременнойГоризонт,
	                 |	ЕСТЬNULL(Стратегии.Закрыта, ЛОЖЬ) КАК СтратегияЗакрыта,
	                 |	ЕСТЬNULL(Стратегии.ОтображатьНулевуюДоходность, ЛОЖЬ) КАК ОтображатьНулевуюДоходность
	                 |ПОМЕСТИТЬ ВТ_ОбщиеСтратегииМандатов
	                 |ИЗ
	                 |	ВТ_ФинПлатыМандатов КАК ВТ_ФинПлатыМандатов
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ФинансовыеПланы.СоставСтратегий КАК ФинансовыеПланыСоставСтратегий
	                 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Стратегии КАК Стратегии
	                 |			ПО ФинансовыеПланыСоставСтратегий.Стратегия = Стратегии.Ссылка
	                 |		ПО ВТ_ФинПлатыМандатов.ФинансовыйПлан = ФинансовыеПланыСоставСтратегий.Ссылка
	                 |ГДЕ
	                 |	НЕ ВТ_ФинПлатыМандатов.НомерДоговора В
	                 |				(ВЫБРАТЬ
	                 |					ВТ.НомерДоговора
	                 |				ИЗ
	                 |					ВТ_ИндивидуальныеСтратегииМандатов КАК ВТ)
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	ВТ_ОбщиеСтратегииМандатов.Мандат КАК Мандат,
	                 |	ВТ_ОбщиеСтратегииМандатов.НомерДоговора КАК НомерДоговора,
	                 |	ВТ_ОбщиеСтратегииМандатов.Стратегия.КодСтратегии КАК ИдентификаторСтратегии,
	                 |	ВЫБОР
	                 |		КОГДА ВТ_ОбщиеСтратегииМандатов.НаименованиеАнгл = """"
	                 |			ТОГДА ВТ_ОбщиеСтратегииМандатов.Наименование
	                 |		ИНАЧЕ ВТ_ОбщиеСтратегииМандатов.НаименованиеАнгл
	                 |	КОНЕЦ КАК НаименованиеСтратегии,
	                 |	ВТ_ОбщиеСтратегииМандатов.Стратегия КАК Стратегия,
	                 |	ВТ_ОбщиеСтратегииМандатов.ВременнойГоризонт КАК ВременнойГоризонт,
	                 |	ВТ_ОбщиеСтратегииМандатов.СтратегияЗакрыта КАК СтратегияЗакрыта,
	                 |	ВТ_ОбщиеСтратегииМандатов.ОтображатьНулевуюДоходность КАК ОтображатьНулевуюДоходность
	                 |ИЗ
	                 |	ВТ_ОбщиеСтратегииМандатов КАК ВТ_ОбщиеСтратегииМандатов
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	ВТ_ИндивидуальныеСтратегииМандатов.Мандат,
	                 |	ВТ_ИндивидуальныеСтратегииМандатов.НомерДоговора,
	                 |	""IS-001"",
					 |	""Индивидуальная стратегия"",
	                 |	"""",
					 |	730,
	                 |	ЛОЖЬ,
	                 |	ЛОЖЬ
	                 |ИЗ
	                 |	ВТ_ИндивидуальныеСтратегииМандатов КАК ВТ_ИндивидуальныеСтратегииМандатов
					 |";					 
					 
	ТаблицаСтратегий = Новый ТаблицаЗначений;
	ТаблицаСтратегий.Колонки.Добавить("НомерДоговора", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(20)));
	ТаблицаСтратегий.Колонки.Добавить("ИдентификаторСтратегии", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50)));
	ТаблицаСтратегий.Колонки.Добавить("НаименованиеСтратегии", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100))); 
	ТаблицаСтратегий.Колонки.Добавить("ДоходностьСтратегии", Новый ОписаниеТипов("Число",,,, Новый КвалификаторыЧисла(25,6))); 
	ТаблицаСтратегий.Колонки.Добавить("ВременнойГоризонт", Новый ОписаниеТипов("Число",,,, Новый КвалификаторыЧисла(15))); 
	
	Для Каждого Соединение Из МассивСоединений Цикл   
		
		НомераПортфелейМО = Соединение.NewObject("Массив");   
		Для Каждого Номер Из НомераПортфелей Цикл
			НомераПортфелейМО.Добавить(Номер);
		КонецЦикла;
		
		Запрос = Соединение.NewObject("Запрос");
		Запрос.Текст = ТекстЗапросаМО;
		Запрос.УстановитьПараметр("НомераДоговоров", НомераПортфелейМО);
		Запрос.УстановитьПараметр("КонецПериода",    КонецДня(ОтчетОбъект.КонецПериода)); 
		ДанныеПоСтратегиям = Запрос.Выполнить().Выгрузить();
		
		ДанныеПоСтратегиямМ = ДанныеПоСтратегиям.Скопировать();
		ДанныеПоСтратегиямМ.Свернуть("Стратегия, ИдентификаторСтратегии");
		
		НачалоПериодаTWR = НачалоДня(НачалоГода(ОтчетОбъект.НачалоПериода)-1);
		ВалютаУчета = Соединение.Справочники.Валюты.RUB;

		Для Каждого ТекущаяСтрока Из ДанныеПоСтратегиямМ Цикл 
										
			МассивМандатов = Соединение.NewObject("Массив");
			
			Отбор = Соединение.NewObject("Структура");
			Отбор.Вставить("Стратегия", ТекущаяСтрока.Стратегия);
			СтрокиМандатов = ДанныеПоСтратегиям.НайтиСтроки(Отбор);  
			
			Для Каждого ТекСтрока Из СтрокиМандатов Цикл
				Если ТекСтрока.СтратегияЗакрыта И ТекСтрока.ОтображатьНулевуюДоходность Тогда
                	Продолжить;
				КонецЕсли;	
				МассивМандатов.Добавить(ТекСтрока.Мандат);
			КонецЦикла;
			
			//Определим доходность
			ФлагОсобыеСтратегии = Ложь;
			Если    ТекущаяСтрока.ИдентификаторСтратегии = "SS-010"
				Или ТекущаяСтрока.ИдентификаторСтратегии = "SS-020"
				Или ТекущаяСтрока.ИдентификаторСтратегии = "SS-030" 
				Тогда 
				ФлагОсобыеСтратегии = Истина;	
			КонецЕсли;	
			
			
			Если НЕ МассивМандатов.Количество() = 0 Тогда 
				Группировка      = "MANDATE";	
				ДанныеДоходности = Соединение.ВТБ_РасчетДоходностиСервер.TWR(НачалоПериодаTWR, ОтчетОбъект.КонецПериода,
				Соединение.Справочники.Валюты.RUB, ВознаграждениеКакПассив, ?(ТипУчета = "Плановый", Истина, Ложь),
				МассивМандатов,	ТекущаяСтрока.Стратегия, Группировка, КоммисияКакПассив, НДФЛКакПассив,);
			Иначе
				ДанныеДоходности = Неопределено;
			КонецЕсли;

			
			Отбор = Соединение.NewObject("Структура");
			Отбор.Вставить("Стратегия", ТекущаяСтрока.Стратегия);
			СтрокиМандатов = ДанныеПоСтратегиям.НайтиСтроки(Отбор);  
			Для Каждого ТекСтрока Из СтрокиМандатов Цикл  
				
			    НоваяСтрока = ТаблицаСтратегий.Добавить();	
			    ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока); 
			    НоваяСтрока.ИдентификаторСтратегии = "И_" + НоваяСтрока.ИдентификаторСтратегии;   
				    
			    Если ТекСтрока.СтратегияЗакрыта И ТекСтрока.ОтображатьНулевуюДоходность Тогда
			    	НоваяСтрока.ДоходностьСтратегии = 0;
			    	Продолжить;
			    КонецЕсли;
				    
			    /////					   
				
				Если ДанныеДоходности = Неопределено Тогда
					НоваяСтрока.ДоходностьСтратегии = 0;
			    	Продолжить;
				КонецЕсли;
				
			  	Отбор = Соединение.NewObject("Структура");
			    Отбор.Вставить("Разделитель", ТекСтрока.Мандат);
			    СтрокиДоходности = ДанныеДоходности.НайтиСтроки(Отбор);					
				Если СтрокиДоходности.Количество() = 0 Тогда 
					НоваяСтрока.ДоходностьСтратегии = 0;	
					Продолжить;
				КонецЕсли;	
					
				Если ФлагОсобыеСтратегии = Истина Тогда
					Rn_НакопленныйБенчмарк 	= 1;
					
					Для Каждого ТСтрока Из СтрокиДоходности Цикл   
						Если (ТСтрока.IO + ТСтрока.MVn_1) <> 0 Тогда 
							ТСтрока.Rn_Бенчмарк = ТСтрока.MVn/(ТСтрока.IO + ТСтрока.MVn_1);
						Иначе ТСтрока.Rn_Бенчмарк = 1;
						КонецЕсли;							
							
						Rn_НакопленныйБенчмарк = Rn_НакопленныйБенчмарк * ТСтрока.Rn_Бенчмарк;						 
						ТСтрока.TWR_Бенчмарк = Rn_НакопленныйБенчмарк -1;	
					КонецЦикла;	
				КонецЕсли;	
					
				ДнейВПериодеОтчёта = КоличествоДнейВПериодеОтчёта(СтрокиДоходности, ОтчетОбъект.КонецПериода); 
				Если ДнейВПериодеОтчёта = 0 Тогда
					НоваяСтрока.ДоходностьСтратегии = 0;	
					Продолжить;
				Иначе							
					КоличествоСтрок     = СтрокиДоходности.Количество()-1;
					ДоходностьСтратегии = (СтрокиДоходности.Получить(КоличествоСтрок).TWR_Бенчмарк) * (365/ДнейВПериодеОтчёта);
					НоваяСтрока.ДоходностьСтратегии = ДоходностьСтратегии * 100;
				КонецЕсли;
					
			КонецЦикла;	
			
		КонецЦикла;	  
    		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ.НомерДоговора КАК НомерДоговора,
		|	ТЗ.ИдентификаторСтратегии КАК ИдентификаторСтратегии,
		|	ТЗ.НаименованиеСтратегии КАК НаименованиеСтратегии,
		|	ТЗ.ДоходностьСтратегии КАК ДоходностьСтратегии,
		|	ТЗ.ВременнойГоризонт КАК ВременнойГоризонт
		|ПОМЕСТИТЬ ВТ_ДанныеПоСтратегиям
		|ИЗ
		|	&ТЗ КАК ТЗ";
	Запрос.УстановитьПараметр("ТЗ", ТаблицаСтратегий);	
	Запрос.Выполнить();	
	
КонецПроцедуры

Процедура ДополнитьВременныеТаблицы(МВТ, ОтчетОбъект)
			
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТЗсписокКлиентов", ТЗсписокКлиентов);
	
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоговорДУ.Клиент КАК Контрагент,
	|	ДоговорДУ.Ссылка КАК ДоговорДУ,
	|	ДоговорДУ.УправляющаяКомпания КАК УправляющаяКомпания,
	|	ДоговорДУ.ДатаНачала КАК ДатаНачала,
	|	ДоговорДУ.ДатаОкончания КАК ДатаОкончания,
	|	ДоговорДУ.ДатаВводаСредствВДУ КАК ДатаВводаСредствВДУ,
	|	ВЫБОР
	|		КОГДА ДоговорДУ.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЮрЛицо,
	|	ДоговорДУ.Клиент.НеРезидент КАК НеРезидент
	|ПОМЕСТИТЬ втВыбранныеДоговорыВводы
	|ИЗ
	|	Справочник.ДоговорДУ КАК ДоговорДУ
	|ГДЕ
	|	ДоговорДУ.ТипКлиентаДУ В(&ТипыКлиентовДУ)
	//
		|	и ДоговорДУ.Клиент В(&ТЗсписокКлиентов)						
		//
		
		|	И ДоговорДУ.УправляющаяКомпания = &УправляющаяКомпания
	|	И НЕ ДоговорДУ.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА ДоговорДУ.ДатаВводаСредствВДУ <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ДоговорДУ.ДатаВводаСредствВДУ <= КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &БезДоговоровЦессии = ИСТИНА
	|				ТОГДА ДоговорДУ.ДатаЦессии = ДАТАВРЕМЯ(1, 1, 1)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент,
	|	ДоговорДУ,
	|	УправляющаяКомпания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДоговорДУ.Ссылка КАК ДоговорДУ,
	|	ДоговорДУ.Клиент КАК Клиент,
	|	ДоговорДУ.ТипКлиентаДУ КАК ТипКлиентаДУ,
	|	ВЫБОР
	|		КОГДА ДоговорДУ.ТипИИС = ЗНАЧЕНИЕ(Перечисление.ТипыИИС.)
	|				ИЛИ ДоговорДУ.ТипИИС = ЗНАЧЕНИЕ(Перечисление.ТипыИИС.Нет)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПризнакИИС
	|ПОМЕСТИТЬ втВыбранныеДоговоры_Раздел_1_3
	|ИЗ
	|	Справочник.ДоговорДУ КАК ДоговорДУ
	|ГДЕ
	|	(ДоговорДУ.ДатаОкончания > КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
	|				И ДоговорДУ.ДатаНачала < КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
	|			ИЛИ ДоговорДУ.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|	И (ДоговорДУ.ДатаЦессии > КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
	|			ИЛИ ДоговорДУ.ДатаЦессии = ДАТАВРЕМЯ(1, 1, 1))
	|	И ДоговорДУ.ТипКлиентаДУ В(&ТипыКлиентовДУ)
	//
		|	и ДоговорДУ.Клиент В(&ТЗсписокКлиентов)						
		//
		
		|	И ДоговорДУ.УправляющаяКомпания = &УправляющаяКомпания
	|	И НЕ ДоговорДУ.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА ДоговорДУ.ДатаВводаСредствВДУ <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ДоговорДУ.ДатаВводаСредствВДУ <= КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорДУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Выборка.ЧтоМеняем КАК ЧтоМеняем,
	|	Выборка.НаЧтоМеняем КАК НаЧтоМеняем
	|ПОМЕСТИТЬ втПодменаБанкаВТБ
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА Сопоставления.ВнешнийОбъект = ""Контрагент_Банк_ВТБ24_ПАО""
	|					ТОГДА ВЫРАЗИТЬ(Сопоставления.НашОбъект КАК Справочник.Контрагенты)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			КОНЕЦ) КАК ЧтоМеняем,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА Сопоставления.ВнешнийОбъект = ""Контрагент_Банк_ВТБ_ПАО""
	|					ТОГДА ВЫРАЗИТЬ(Сопоставления.НашОбъект КАК Справочник.Контрагенты)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			КОНЕЦ) КАК НаЧтоМеняем
	|	ИЗ
	|		РегистрСведений.УниверсальныеСопоставления КАК Сопоставления
	|	ГДЕ
	|		Сопоставления.КонтекстСопоставления = ЗНАЧЕНИЕ(Перечисление.КонтекстСопоставления.ДоговорДУ)
	|		И Сопоставления.ВнешнийОбъект В (""Контрагент_Банк_ВТБ_ПАО"", ""Контрагент_Банк_ВТБ24_ПАО"")
	|		И Сопоставления.НашОбъект ССЫЛКА Справочник.Контрагенты) КАК Выборка
	|ГДЕ
	|	Выборка.ЧтоМеняем.Ссылка ЕСТЬ НЕ NULL 
	|	И Выборка.НаЧтоМеняем.Ссылка ЕСТЬ НЕ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЧтоМеняем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыДоговоровДУ.ДоговорДУ КАК ДоговорДУ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПараметрыДоговоровДУ.Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПараметрыДоговораДУ.ОбособленныйУчетЗадолженностиЭмитента_УУ)
	|				ТОГДА ВЫРАЗИТЬ(ПараметрыДоговоровДУ.Значение КАК БУЛЕВО)
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ОбособленныйУчетЗадолженностиЭмитента
	|ПОМЕСТИТЬ ВТ_ПараметрыДоговоровДУ
	|ИЗ
	|	РегистрСведений.ЗначенияПараметровДоговораДУ.СрезПоследних(
	|			НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ),
	|			ДоговорДУ В
	|					(ВЫБРАТЬ
	|						ВТ_ВсеДоговора.ДоговорДУ КАК ДоговорДУ
	|					ИЗ
	|						ВТ_ВсеДоговора КАК ВТ_ВсеДоговора)
	|				И Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПараметрыДоговораДУ.ОбособленныйУчетЗадолженностиЭмитента_УУ)) КАК ПараметрыДоговоровДУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПараметрыДоговоровДУ.ДоговорДУ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорДУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеКвалИнвесторыСрезПоследних.Контрагент КАК Клиент,
	|	""Квалифицированный"" КАК КвалификацияИнвестора
	|ПОМЕСТИТЬ ВТ_КвалИнвесторы
	|ИЗ
	|	РегистрСведений.ДействующиеКвалИнвесторы.СрезПоследних(
	|			&КонецПериода,
	|			Контрагент В
	|					(ВЫБРАТЬ
	|						ВТ_ВсеДоговора.Клиент
	|					ИЗ
	|						ВТ_ВсеДоговора КАК ВТ_ВсеДоговора)
	|				И ВключенВРеестр = ИСТИНА
	|				И УправляющаяКомпания = &УправляющаяКомпания) КАК ДействующиеКвалИнвесторыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнвестиционныеПрофилиСрезПоследних.ДоговорДУ КАК ДоговорДУ,
	|	ИнвестиционныеПрофилиСрезПоследних.ДоговорДУ.Клиент КАК Клиент,
	|	ИнвестиционныеПрофилиСрезПоследних.Стратегия КАК Стратегия,
	|	ИнвестиционныеПрофилиСрезПоследних.Стратегия.Стандартная КАК Стандартная,
	|	СОКРЛП(СТРЗАМЕНИТЬ(ИнвестиционныеПрофилиСрезПоследних.ТипИнвестиционногоПрофиля.Наименование, ""(old)"", """")) КАК ТипИнвестиционногоПрофиля,
	|	ИнвестиционныеПрофилиСрезПоследних.Стратегия.ВнешнийКод КАК ВнешнийКод,
	|	ИнвестиционныеПрофилиСрезПоследних.Стратегия.Наименование КАК Наименование,
	|	ИнвестиционныеПрофилиСрезПоследних.ТипИнвестиционногоПрофиля.ИнвестиционныйГоризонт КАК ВременнойГоризонт,
	|	ИнвестиционныеПрофилиСрезПоследних.ТипИнвестиционногоПрофиля.ОжидаемаяДоходность КАК ДоходностьСтратегии,
	|	ИнвестиционныеПрофилиСрезПоследних.ТипИнвестиционногоПрофиля.ДопустимыйУровеньРиска КАК Риск
	|ПОМЕСТИТЬ ВТ_ИнвестПрофили
	|ИЗ
	|	РегистрСведений.ИнвестиционныеПрофили.СрезПоследних(
	|			&КонецПериода,
	|			ДоговорДУ В
	|				(ВЫБРАТЬ
	|					ВТ_ВсеДоговора.ДоговорДУ
	|				ИЗ
	|					ВТ_ВсеДоговора КАК ВТ_ВсеДоговора)) КАК ИнвестиционныеПрофилиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеДоговора.ДоговорДУ КАК ДоговорДУ,
	|	ВТ_ВсеДоговора.ДоговорДУ.Клиент КАК Клиент,
	|	НЕОПРЕДЕЛЕНО КАК Стратегия,
	|	НЕОПРЕДЕЛЕНО КАК ТипИнвестиционногоПрофиля,
	|	ВТ_ДанныеПоСтратегиям.ИдентификаторСтратегии КАК ИдентификаторСтратегии,
	|	ВТ_ДанныеПоСтратегиям.НаименованиеСтратегии КАК НаименованиеСтратегии,
	|	МАКСИМУМ(ВТ_ДанныеПоСтратегиям.ДоходностьСтратегии) КАК ДоходностьСтратегии,
	|	0 КАК Риск,
	|	""Стандартная"" КАК ТипСтратегии,
	|	МАКСИМУМ(ВТ_ДанныеПоСтратегиям.ВременнойГоризонт) КАК ВременнойГоризонт
	|ПОМЕСТИТЬ ВТ_СтандартныеСтратегии
	|ИЗ
	|	ВТ_ДанныеПоСтратегиям КАК ВТ_ДанныеПоСтратегиям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеДоговора КАК ВТ_ВсеДоговора
	|		ПО ВТ_ДанныеПоСтратегиям.НомерДоговора = ВТ_ВсеДоговора.Код
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеДоговора.ДоговорДУ,
	|	ВТ_ВсеДоговора.ДоговорДУ.Клиент,
	|	ВТ_ДанныеПоСтратегиям.ИдентификаторСтратегии,
	|	ВТ_ДанныеПоСтратегиям.НаименованиеСтратегии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДействующиеДоговора.ДоговорДУ КАК ДоговорДУ,
	|	ВТ_ДействующиеДоговора.ДоговорДУ.Клиент КАК Клиент,
	|	НЕОПРЕДЕЛЕНО КАК Стратегия,
	|	НЕОПРЕДЕЛЕНО КАК ТипИнвестиционногоПрофиля,
	|	ВТ_ДанныеПоСтратегиям.ИдентификаторСтратегии КАК ИдентификаторСтратегии,
	|	ВТ_ДанныеПоСтратегиям.НаименованиеСтратегии КАК НаименованиеСтратегии,
	|	МАКСИМУМ(ВТ_ДанныеПоСтратегиям.ДоходностьСтратегии) КАК ДоходностьСтратегии,
	|	0 КАК Риск,
	|	""Индивидуальная"" КАК ТипСтратегии,
	|	МАКСИМУМ(ВТ_ДанныеПоСтратегиям.ВременнойГоризонт) КАК ВременнойГоризонт
	|ПОМЕСТИТЬ ВТ_СтандартныеСтратегииПоДействующимДоговорам
	|ИЗ
	|	ВТ_ДанныеПоСтратегиям КАК ВТ_ДанныеПоСтратегиям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДействующиеДоговора КАК ВТ_ДействующиеДоговора
	|		ПО ВТ_ДанныеПоСтратегиям.НомерДоговора = ВТ_ДействующиеДоговора.Код
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДействующиеДоговора.ДоговорДУ,
	|	ВТ_ДействующиеДоговора.ДоговорДУ.Клиент,
	|	ВТ_ДанныеПоСтратегиям.ИдентификаторСтратегии,
	|	ВТ_ДанныеПоСтратегиям.НаименованиеСтратегии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеДоговора.Клиент КАК Клиент,
	|	ВТ_ВсеДоговора.ДоговорДУ КАК ДоговорДУ,
	|	ВТ_ВсеДоговора.ТипКлиентаДУ КАК ТипКлиентаДУ,
	|	ВТ_ВсеДоговора.ДатаНачала КАК ДатаНачала,
	|	ВТ_ВсеДоговора.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_ВсеДоговора.ДатаВводаСредствВДУ КАК ДатаВводаСредствВДУ,
	|	МАКСИМУМ(ВТ_СтандартныеСтратегии.Стратегия) КАК Стратегия,
	|	МАКСИМУМ(ВТ_СтандартныеСтратегии.ТипИнвестиционногоПрофиля) КАК ТипИнвестиционногоПрофиля,
	|	ИСТИНА КАК Стандартная,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_СтандартныеСтратегии.НаименованиеСтратегии, """")) КАК НаименованиеСтратегии,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_СтандартныеСтратегии.ИдентификаторСтратегии, """")) КАК ИдентификаторСтратегии,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_КвалИнвесторы.КвалификацияИнвестора, ""Неквалифицированный"")) КАК КвалификацияИнвестора,
	|	""Деятельность по управлению ценными бумагами"" КАК ВидДеятельности
	|ПОМЕСТИТЬ ВТ_ДоговорыСтратегии
	|ИЗ
	|	ВТ_ВсеДоговора КАК ВТ_ВсеДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтандартныеСтратегии КАК ВТ_СтандартныеСтратегии
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_СтандартныеСтратегии.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КвалИнвесторы КАК ВТ_КвалИнвесторы
	|		ПО ВТ_ВсеДоговора.Клиент = ВТ_КвалИнвесторы.Клиент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеДоговора.Клиент,
	|	ВТ_ВсеДоговора.ДатаНачала,
	|	ВТ_ВсеДоговора.ТипКлиентаДУ,
	|	ВТ_ВсеДоговора.ДоговорДУ,
	|	ВТ_ВсеДоговора.ДатаВводаСредствВДУ,
	|	ВТ_ВсеДоговора.ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Клиент КАК Клиент,
	|	ВложенныйЗапрос.ДоговорДУ КАК ДоговорДУ,
	|	ВложенныйЗапрос.ТипКлиентаДУ КАК ТипКлиентаДУ,
	|	ВложенныйЗапрос.ДатаНачала КАК ДатаНачала,
	|	ВложенныйЗапрос.ДатаОкончания КАК ДатаОкончания,
	|	ВложенныйЗапрос.ДатаВводаСредствВДУ КАК ДатаВводаСредствВДУ
	|ПОМЕСТИТЬ ВТ_ВсеДоговораВПериоде
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ДоговораЗаключенныеВПериод.Клиент КАК Клиент,
	|		ВТ_ДоговораЗаключенныеВПериод.ДоговорДУ КАК ДоговорДУ,
	|		ВТ_ДоговораЗаключенныеВПериод.ТипКлиентаДУ КАК ТипКлиентаДУ,
	|		ВТ_ДоговораЗаключенныеВПериод.ДатаНачала КАК ДатаНачала,
	|		ВТ_ДоговораЗаключенныеВПериод.ДатаОкончания КАК ДатаОкончания,
	|		ВТ_ДоговораЗаключенныеВПериод.ДатаВводаСредствВДУ КАК ДатаВводаСредствВДУ
	|	ИЗ
	|		ВТ_ДоговораЗаключенныеВПериод КАК ВТ_ДоговораЗаключенныеВПериод
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_ДоговораПрекращенныеВПериод.Клиент,
	|		ВТ_ДоговораПрекращенныеВПериод.ДоговорДУ,
	|		ВТ_ДоговораПрекращенныеВПериод.ТипКлиентаДУ,
	|		ВТ_ДоговораПрекращенныеВПериод.ДатаНачала,
	|		ВТ_ДоговораПрекращенныеВПериод.ДатаОкончания,
	|		ВТ_ДоговораПрекращенныеВПериод.ДатаВводаСредствВДУ
	|	ИЗ
	|		ВТ_ДоговораПрекращенныеВПериод КАК ВТ_ДоговораПрекращенныеВПериод
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_ДоговораНаКонецПериода.Клиент,
	|		ВТ_ДоговораНаКонецПериода.ДоговорДУ,
	|		ВТ_ДоговораНаКонецПериода.ТипКлиентаДУ,
	|		ВТ_ДоговораНаКонецПериода.ДатаНачала,
	|		ВТ_ДоговораНаКонецПериода.ДатаОкончания,
	|		ВТ_ДоговораНаКонецПериода.ДатаВводаСредствВДУ
	|	ИЗ
	|		ВТ_ДоговораНаКонецПериода КАК ВТ_ДоговораНаКонецПериода) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АдресныйКлассификатор.Наименование + "" "" + АдресныйКлассификатор.Сокращение КАК Регион,
	|	ВЫБОР
	|		КОГДА ДЛИНАСТРОКИ(СОКРЛП(АдресныйКлассификатор.КодПоОКАТО)) > 5
	|			ТОГДА ПОДСТРОКА(СОКРЛП(АдресныйКлассификатор.КодПоОКАТО), 0, 2)
	|		ИНАЧЕ ПОДСТРОКА(СОКРЛП(АдресныйКлассификатор.КодПоОКАТО), 0, 5)
	|	КОНЕЦ КАК КодПоОКАТО
	|ПОМЕСТИТЬ ВТ_ОКАТОпоРегионам
	|ИЗ
	|	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	|ГДЕ
	|	АдресныйКлассификатор.ТипАдресногоЭлемента = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АдресныйКлассификатор.АльтернативныеНазвания КАК Регион,
	|	ВЫБОР
	|		КОГДА ДЛИНАСТРОКИ(СОКРЛП(АдресныйКлассификатор.КодПоОКАТО)) > 5
	|			ТОГДА ПОДСТРОКА(СОКРЛП(АдресныйКлассификатор.КодПоОКАТО), 0, 2)
	|		ИНАЧЕ ПОДСТРОКА(СОКРЛП(АдресныйКлассификатор.КодПоОКАТО), 0, 5)
	|	КОНЕЦ КАК КодПоОКАТО
	|ПОМЕСТИТЬ ВТ_ОКАТОАльтернативныепоРегионам
	|ИЗ
	|	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	|ГДЕ
	|	АдресныйКлассификатор.ТипАдресногоЭлемента = 1
	|	И ДЛИНАСТРОКИ(АдресныйКлассификатор.АльтернативныеНазвания) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Клиент,
	|	КонтрагентыКонтактнаяИнформация.Вид КАК Вид,
	|	КонтрагентыКонтактнаяИнформация.Регион КАК Регион,
	|	ЕСТЬNULL(ВТ_ОКАТОпоРегионам.КодПоОКАТО, ВТ_ОКАТОАльтернативныепоРегионам.КодПоОКАТО) КАК КодПоОКАТО
	|ПОМЕСТИТЬ ВТ_КодаОКАТОФизЛица
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОКАТОпоРегионам КАК ВТ_ОКАТОпоРегионам
	|		ПО КонтрагентыКонтактнаяИнформация.Регион = ВТ_ОКАТОпоРегионам.Регион
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОКАТОАльтернативныепоРегионам КАК ВТ_ОКАТОАльтернативныепоРегионам
	|		ПО (КонтрагентыКонтактнаяИнформация.Регион ПОДОБНО ""%"" + ВТ_ОКАТОАльтернативныепоРегионам.Регион + ""%"")
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ВсеДоговора.Клиент
	|			ИЗ
	|				ВТ_ВсеДоговора КАК ВТ_ВсеДоговора)
	|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
	|	И КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И НЕ ЕСТЬNULL(ВТ_ОКАТОпоРегионам.КодПоОКАТО, ВТ_ОКАТОАльтернативныепоРегионам.КодПоОКАТО) ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрРСА_СЧАСрезПоследних.ДоговорДУ КАК ДоговорДУ,
	|	СУММА(РегистрРСА_СЧАСрезПоследних.СЧА * ВЫБОР
	|			КОГДА ИСТИНА = &ОтноситьРасхождения
	|					И РегистрРСА_СЧАСрезПоследних.СЧА < 0
	|				ТОГДА -1
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК СЧА
	|ПОМЕСТИТЬ ВТ_СЧА
	|ИЗ
	|	РегистрСведений.РегистрРСА_СЧА.СрезПоследних(
	|			&КонецПериода,
	|			ДоговорДУ В
	|				(ВЫБРАТЬ
	|					ВТ_ВсеДоговора.ДоговорДУ
	|				ИЗ
	|					втВыбранныеДоговоры_Раздел_1_3 КАК ВТ_ВсеДоговора)) КАК РегистрРСА_СЧАСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрРСА_СЧАСрезПоследних.ДоговорДУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрРСА_СЧАСрезПоследних.ДоговорДУ.Клиент КАК Клиент,
	|	РегистрРСА_СЧАСрезПоследних.ДоговорДУ КАК ДоговорДУ,
	|	СУММА(РегистрРСА_СЧАСрезПоследних.СЧА * ВЫБОР
	|			КОГДА ИСТИНА = &ОтноситьРасхождения
	|					И РегистрРСА_СЧАСрезПоследних.СЧА < 0
	|				ТОГДА -1
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК СЧА
	|ПОМЕСТИТЬ ВТ_СЧА_ПоКлиентам
	|ИЗ
	|	РегистрСведений.РегистрРСА_СЧА.СрезПоследних(
	|			&КонецПериода,
	|			ДоговорДУ В
	|				(ВЫБРАТЬ
	|					ВТ_ВсеДоговора.ДоговорДУ
	|				ИЗ
	|					втВыбранныеДоговоры_Раздел_1_3 КАК ВТ_ВсеДоговора)) КАК РегистрРСА_СЧАСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрРСА_СЧАСрезПоследних.ДоговорДУ.Клиент,
	|	РегистрРСА_СЧАСрезПоследних.ДоговорДУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сделка.Ссылка КАК Ссылка,
	|	Сделка.ДоговорДУ.Клиент КАК Клиент
	|ПОМЕСТИТЬ ВТ_Сделки
	|ИЗ
	|	Документ.Сделка КАК Сделка
	|ГДЕ
	|	Сделка.ДоговорДУ В
	|			(ВЫБРАТЬ
	|				ВТ_ВсеДоговора.ДоговорДУ
	|			ИЗ
	|				ВТ_ВсеДоговора КАК ВТ_ВсеДоговора)
	|	И Сделка.Проведен = ИСТИНА
	|	И Сделка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаРЕПОПерваяНога.Ссылка,
	|	СделкаРЕПОПерваяНога.ДоговорДУ.Клиент
	|ИЗ
	|	Документ.СделкаРЕПОПерваяНога КАК СделкаРЕПОПерваяНога
	|ГДЕ
	|	СделкаРЕПОПерваяНога.ДоговорДУ В
	|			(ВЫБРАТЬ
	|				ВТ_ВсеДоговора.ДоговорДУ
	|			ИЗ
	|				ВТ_ВсеДоговора КАК ВТ_ВсеДоговора)
	|	И СделкаРЕПОПерваяНога.Проведен = ИСТИНА
	|	И СделкаРЕПОПерваяНога.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаНаСрочномРынке.Ссылка,
	|	СделкаНаСрочномРынке.ДоговорДУ.Клиент
	|ИЗ
	|	Документ.СделкаНаСрочномРынке КАК СделкаНаСрочномРынке
	|ГДЕ
	|	СделкаНаСрочномРынке.ДоговорДУ В
	|			(ВЫБРАТЬ
	|				ВТ_ВсеДоговора.ДоговорДУ
	|			ИЗ
	|				ВТ_ВсеДоговора КАК ВТ_ВсеДоговора)
	|	И СделкаНаСрочномРынке.Проведен = ИСТИНА
	|	И СделкаНаСрочномРынке.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписаниеСРасчетногоСчета.Ссылка,
	|	СписаниеСРасчетногоСчета.ДоговорДУ.Клиент
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	|ГДЕ
	|	СписаниеСРасчетногоСчета.ДоговорДУ В
	|			(ВЫБРАТЬ
	|				ВТ_ВсеДоговора.ДоговорДУ
	|			ИЗ
	|				ВТ_ВсеДоговора КАК ВТ_ВсеДоговора)
	|	И СписаниеСРасчетногоСчета.Проведен = ИСТИНА
	|	И СписаниеСРасчетногоСчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СписаниеСРасчетногоСчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ПереводНаДругойСчет)
	|	И СписаниеСРасчетногоСчета.СчетУчетаРасчетовСКонтрагентом В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчетаВРублях), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДепозитныеСчетаВВалюте))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеНаРасчетныйСчет.Ссылка,
	|	ПоступлениеНаРасчетныйСчет.ДоговорДУ.Клиент
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.ДоговорДУ В
	|			(ВЫБРАТЬ
	|				ВТ_ВсеДоговора.ДоговорДУ
	|			ИЗ
	|				ВТ_ВсеДоговора КАК ВТ_ВсеДоговора)
	|	И ПоступлениеНаРасчетныйСчет.Проведен = ИСТИНА
	|	И ПоступлениеНаРасчетныйСчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПоступлениеНаРасчетныйСчет.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПоступленияОтПродажиИностраннойВалюты), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПриобретениеИностраннойВалюты))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Сделки.Клиент КАК Клиент,
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Сделки.Ссылка) >= 1
	|			ТОГДА ""Активный""
	|		ИНАЧЕ ""Не активный""
	|	КОНЕЦ КАК СтатусКлиента
	|ПОМЕСТИТЬ ВТ_СтатусКлиента
	|ИЗ
	|	ВТ_Сделки КАК ВТ_Сделки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сделки.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Договоры.ДоговорДУ КАК ДоговорДУ,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_ПараметрыДоговоровДУ.ОбособленныйУчетЗадолженностиЭмитента, ЛОЖЬ)) КАК ОбособленныйУчетЗадолженностиЭмитента
	|ПОМЕСТИТЬ втДоговорыДУ_Раздел7
	|ИЗ
	|	ВТ_ДействующиеДоговора КАК Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыДоговоровДУ КАК ВТ_ПараметрыДоговоровДУ
	|		ПО (ВТ_ПараметрыДоговоровДУ.ДоговорДУ = Договоры.ДоговорДУ)
	|
	|СГРУППИРОВАТЬ ПО
	|	Договоры.ДоговорДУ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорДУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВсеДоговора.Клиент КАК Клиент,
	|	ВТ_ВсеДоговора.ДоговорДУ КАК ДоговорДУ,
	|	ЕСТЬNULL(ВТ_КвалИнвесторы.КвалификацияИнвестора, ""Неквалифицированный"") КАК КвалификацияИнвестора,
	|	ВЫБОР
	|		КОГДА ВТ_ВсеДоговора.Клиент.НеРезидент
	|			ТОГДА ""Нерезиденты""
	|		ИНАЧЕ ""Резиденты""
	|	КОНЕЦ КАК РезидентНерезидент,
	|	""Деятельность по управлению ценными бумагами"" КАК ВидДеятельности,
	|	ЕСТЬNULL(ВТ_СтатусКлиента.СтатусКлиента, ""Не активный"") КАК СтатусКлиента,
	|	ВЫБОР
	|		КОГДА ВТ_ВсеДоговора.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ""Юридические лица""
	|		ИНАЧЕ ""Физические лица""
	|	КОНЕЦ КАК ФизЛицаЮрЛица,
	|	ЕСТЬNULL(ВТ_СЧА.СЧА, 0) КАК СЧА,
	|	ВЫБОР
	|		КОГДА ВТ_ВсеДоговора.Клиент.НеРезидент = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ВТ_ВсеДоговора.Клиент.Страна.Код, ""999"")
	|		КОГДА ВТ_ВсеДоговора.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|				И ВТ_ВсеДоговора.Клиент.КодПоОКАТО <> """"
	|			ТОГДА ПОДСТРОКА(ВТ_ВсеДоговора.Клиент.КодПоОКАТО, 0, 2)
	|		КОГДА ВТ_ВсеДоговора.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|				И ЕСТЬNULL(ВТ_КодаОКАТОФизЛица.КодПоОКАТО, """") <> """"
	|			ТОГДА ВТ_КодаОКАТОФизЛица.КодПоОКАТО
	|		КОГДА ВТ_ВсеДоговора.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|			ТОГДА ""99""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодПоОКАТОиОКСМ,
	|	ВТ_ВсеДоговора.Клиент.НеРезидент КАК НеРезидент,
	|	ВЫБОР
	|		КОГДА ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ФизическиеЛица)
	|			ТОГДА ""Физическое лицо""
	|		КОГДА ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.СтраховыеКомпании)
	|				ИЛИ ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.СобственныеСредстваСК)
	|			ТОГДА ""СК""
	|		КОГДА ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ЮридическиеЛица)
	|				ИЛИ ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.СаморегулируемыеОрганизации)
	|				ИЛИ ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ФондЦелевогоКапитала)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ВсеДоговора.Клиент.КодСектораЭкономики = ""S125 – другие финансовые организации (за исключением страховщиков и негосударственных пенсионных фондов)""
	|						ТОГДА ""Другие финансовые организации""
	|					ИНАЧЕ ""Иное юридическое лицо""
	|				КОНЕЦ
	|	КОНЕЦ КАК КатегорияКлиента,
	|	ВТ_ВсеДоговора.ПризнакИИС КАК ПризнакИИС,
	|	ЛОЖЬ КАК ПравоИспользованияДСКлиента,
	|	ВТ_ДоговораЗаключенныеВПериод.ДоговорДУ КАК ЗаключенВПериод,
	|	ВТ_ДоговораПрекращенныеВПериод.ДоговорДУ КАК ПрекращенВПериод,
	|	ВТ_ДоговораЗаключенныеВПериод.Клиент КАК Клиент_ЗаключенВПериод,
	|	ВТ_ДоговораПрекращенныеВПериод.Клиент КАК Клиент_ПрекращенВПериод,
	|	ВТ_СтандартныеСтратегии.ИдентификаторСтратегии КАК ИдентификаторСтратегии,
	|	ВТ_СтандартныеСтратегии.НаименованиеСтратегии КАК НаименованиеСтратегии,
	|	ЕСТЬNULL(ВТ_ПараметрыДоговоровДУ.ОбособленныйУчетЗадолженностиЭмитента, ЛОЖЬ) КАК ОбособленныйУчетЗадолженностиЭмитента,
	|	ВЫБОР
	|		КОГДА ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ФизическиеЛица)
	|			ТОГДА ""Физическое лицо""
	|		ИНАЧЕ ""Юридическое лицо""
	|	КОНЕЦ КАК ТипКлиента,
	|	ВТ_ДоговораНаКонецПериода.ДоговорДУ КАК ДоговорНаКонецПериода,
	|	ВТ_ДоговораНаКонецПериода.Клиент КАК Клиент_НаКонецПериода,
	|	ЕСТЬNULL(ВТ_ИнвестПрофили.ТипИнвестиционногоПрофиля, ""не определен"") КАК ИнвестиционныйПрофиль
	|ПОМЕСТИТЬ ВТ_СведенияПоКлиентам
	|ИЗ
	|	ВТ_ВсеДоговора КАК ВТ_ВсеДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КвалИнвесторы КАК ВТ_КвалИнвесторы
	|		ПО ВТ_ВсеДоговора.Клиент = ВТ_КвалИнвесторы.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусКлиента КАК ВТ_СтатусКлиента
	|		ПО ВТ_ВсеДоговора.Клиент = ВТ_СтатусКлиента.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СЧА КАК ВТ_СЧА
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_СЧА.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодаОКАТОФизЛица КАК ВТ_КодаОКАТОФизЛица
	|		ПО ВТ_ВсеДоговора.Клиент = ВТ_КодаОКАТОФизЛица.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтандартныеСтратегии КАК ВТ_СтандартныеСтратегии
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_СтандартныеСтратегии.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораЗаключенныеВПериод КАК ВТ_ДоговораЗаключенныеВПериод
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ДоговораЗаключенныеВПериод.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораПрекращенныеВПериод КАК ВТ_ДоговораПрекращенныеВПериод
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ДоговораПрекращенныеВПериод.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыДоговоровДУ КАК ВТ_ПараметрыДоговоровДУ
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ПараметрыДоговоровДУ.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораНаКонецПериода КАК ВТ_ДоговораНаКонецПериода
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ДоговораНаКонецПериода.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнвестПрофили КАК ВТ_ИнвестПрофили
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ИнвестПрофили.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораПрекращенныеНаНачалоПериода КАК ВТ_ДоговораПрекращенныеНаНачалоПериода
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ДоговораПрекращенныеНаНачалоПериода.ДоговорДУ
	|ГДЕ
	|	ВТ_ДоговораПрекращенныеНаНачалоПериода.ДоговорДУ ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорДУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВсеДоговора.Клиент КАК Клиент,
	|	ВТ_ВсеДоговора.ДоговорДУ КАК ДоговорДУ,
	|	ЕСТЬNULL(ВТ_КвалИнвесторы.КвалификацияИнвестора, ""Неквалифицированный"") КАК КвалификацияИнвестора,
	|	ВЫБОР
	|		КОГДА ВТ_ВсеДоговора.Клиент.НеРезидент
	|			ТОГДА ""Нерезиденты""
	|		ИНАЧЕ ""Резиденты""
	|	КОНЕЦ КАК РезидентНерезидент,
	|	""Деятельность по управлению ценными бумагами"" КАК ВидДеятельности,
	|	ЕСТЬNULL(ВТ_СтатусКлиента.СтатусКлиента, ""Не активный"") КАК СтатусКлиента,
	|	ВЫБОР
	|		КОГДА ВТ_ВсеДоговора.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ""Юридические лица""
	|		ИНАЧЕ ""Физические лица""
	|	КОНЕЦ КАК ФизЛицаЮрЛица,
	|	ЕСТЬNULL(ВТ_СЧА.СЧА, 0) КАК СЧА,
	|	ВЫБОР
	|		КОГДА ВТ_ВсеДоговора.Клиент.НеРезидент = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ВТ_ВсеДоговора.Клиент.Страна.Код, ""999"")
	|		КОГДА ВТ_ВсеДоговора.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|				И ВТ_ВсеДоговора.Клиент.КодПоОКАТО <> """"
	|			ТОГДА ПОДСТРОКА(ВТ_ВсеДоговора.Клиент.КодПоОКАТО, 0, 2)
	|		КОГДА ВТ_ВсеДоговора.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|				И ЕСТЬNULL(ВТ_КодаОКАТОФизЛица.КодПоОКАТО, """") <> """"
	|			ТОГДА ВТ_КодаОКАТОФизЛица.КодПоОКАТО
	|		КОГДА ВТ_ВсеДоговора.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|			ТОГДА ""99""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодПоОКАТОиОКСМ,
	|	ВТ_ВсеДоговора.Клиент.НеРезидент КАК НеРезидент,
	|	ВЫБОР
	|		КОГДА ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ФизическиеЛица)
	|			ТОГДА ""Физическое лицо""
	|		КОГДА ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.СтраховыеКомпании)
	|				ИЛИ ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.СобственныеСредстваСК)
	|			ТОГДА ""СК""
	|		КОГДА ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ЮридическиеЛица)
	|				ИЛИ ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.СаморегулируемыеОрганизации)
	|				ИЛИ ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ФондЦелевогоКапитала)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ВсеДоговора.Клиент.КодСектораЭкономики = ""S125 – другие финансовые организации (за исключением страховщиков и негосударственных пенсионных фондов)""
	|						ТОГДА ""Другие финансовые организации""
	|					ИНАЧЕ ""Иное юридическое лицо""
	|				КОНЕЦ
	|	КОНЕЦ КАК КатегорияКлиента,
	|	ВТ_ВсеДоговора.ПризнакИИС КАК ПризнакИИС,
	|	ЛОЖЬ КАК ПравоИспользованияДСКлиента,
	|	ВТ_ДоговораЗаключенныеВПериод.ДоговорДУ КАК ЗаключенВПериод,
	|	ВТ_ДоговораПрекращенныеВПериод.ДоговорДУ КАК ПрекращенВПериод,
	|	ВТ_ДоговораЗаключенныеВПериод.Клиент КАК Клиент_ЗаключенВПериод,
	|	ВТ_ДоговораПрекращенныеВПериод.Клиент КАК Клиент_ПрекращенВПериод,
	|	ВТ_ДоговораПрекращенныеНаНачалоПериода.ДоговорДУ КАК ПрекращенНаНачалоПериода,
	|	ВТ_ДоговораПрекращенныеНаНачалоПериода.Клиент КАК Клиент_ПрекращенНаНачалоПериода,
	|	ВТ_СтандартныеСтратегии.ИдентификаторСтратегии КАК ИдентификаторСтратегии,
	|	ВТ_СтандартныеСтратегии.НаименованиеСтратегии КАК НаименованиеСтратегии,
	|	ЕСТЬNULL(ВТ_ПараметрыДоговоровДУ.ОбособленныйУчетЗадолженностиЭмитента, ЛОЖЬ) КАК ОбособленныйУчетЗадолженностиЭмитента,
	|	ВЫБОР
	|		КОГДА ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ФизическиеЛица)
	|			ТОГДА ""Физическое лицо""
	|		ИНАЧЕ ""Юридическое лицо""
	|	КОНЕЦ КАК ТипКлиента,
	|	ВТ_ДоговораНаКонецПериода.ДоговорДУ КАК ДоговорНаКонецПериода,
	|	ВТ_ДоговораНаКонецПериода.Клиент КАК Клиент_НаКонецПериода,
	|	ЕСТЬNULL(ВТ_ИнвестПрофили.ТипИнвестиционногоПрофиля, ""не определен"") КАК ИнвестиционныйПрофиль
	|ПОМЕСТИТЬ ВТ_СведенияПоКлиентам_Раздел_1_2
	|ИЗ
	|	ВТ_ВсеДоговора КАК ВТ_ВсеДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КвалИнвесторы КАК ВТ_КвалИнвесторы
	|		ПО ВТ_ВсеДоговора.Клиент = ВТ_КвалИнвесторы.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусКлиента КАК ВТ_СтатусКлиента
	|		ПО ВТ_ВсеДоговора.Клиент = ВТ_СтатусКлиента.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СЧА КАК ВТ_СЧА
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_СЧА.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодаОКАТОФизЛица КАК ВТ_КодаОКАТОФизЛица
	|		ПО ВТ_ВсеДоговора.Клиент = ВТ_КодаОКАТОФизЛица.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтандартныеСтратегии КАК ВТ_СтандартныеСтратегии
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_СтандартныеСтратегии.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораЗаключенныеВПериод КАК ВТ_ДоговораЗаключенныеВПериод
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ДоговораЗаключенныеВПериод.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораПрекращенныеВПериод КАК ВТ_ДоговораПрекращенныеВПериод
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ДоговораПрекращенныеВПериод.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораПрекращенныеНаНачалоПериода КАК ВТ_ДоговораПрекращенныеНаНачалоПериода
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ДоговораПрекращенныеНаНачалоПериода.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыДоговоровДУ КАК ВТ_ПараметрыДоговоровДУ
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ПараметрыДоговоровДУ.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораНаКонецПериода КАК ВТ_ДоговораНаКонецПериода
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ДоговораНаКонецПериода.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнвестПрофили КАК ВТ_ИнвестПрофили
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ИнвестПрофили.ДоговорДУ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорДУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВсеДоговора.Клиент КАК Клиент,
	|	ВТ_ВсеДоговора.ДоговорДУ КАК ДоговорДУ,
	|	ЕСТЬNULL(ВТ_КвалИнвесторы.КвалификацияИнвестора, ""Неквалифицированный"") КАК КвалификацияИнвестора,
	|	ВЫБОР
	|		КОГДА ВТ_ВсеДоговора.Клиент.НеРезидент
	|			ТОГДА ""Нерезиденты""
	|		ИНАЧЕ ""Резиденты""
	|	КОНЕЦ КАК РезидентНерезидент,
	|	""Деятельность по управлению ценными бумагами"" КАК ВидДеятельности,
	|	ЕСТЬNULL(ВТ_СтатусКлиента.СтатусКлиента, ""Не активный"") КАК СтатусКлиента,
	|	ВЫБОР
	|		КОГДА ВТ_ВсеДоговора.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ""Юридические лица""
	|		ИНАЧЕ ""Физические лица""
	|	КОНЕЦ КАК ФизЛицаЮрЛица,
	|	ЕСТЬNULL(ВТ_СЧА_ПоКлиентам.СЧА, 0) КАК СЧА,
	|	ВЫБОР
	|		КОГДА ВТ_ВсеДоговора.Клиент.НеРезидент = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ВТ_ВсеДоговора.Клиент.Страна.Код, ""999"")
	|		КОГДА ВТ_ВсеДоговора.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|				И ВТ_ВсеДоговора.Клиент.КодПоОКАТО <> """"
	|			ТОГДА ПОДСТРОКА(ВТ_ВсеДоговора.Клиент.КодПоОКАТО, 0, 2)
	|		КОГДА ВТ_ВсеДоговора.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|				И ЕСТЬNULL(ВТ_КодаОКАТОФизЛица.КодПоОКАТО, """") <> """"
	|			ТОГДА ВТ_КодаОКАТОФизЛица.КодПоОКАТО
	|		КОГДА ВТ_ВсеДоговора.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|			ТОГДА ""99""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодПоОКАТОиОКСМ,
	|	ВТ_ВсеДоговора.Клиент.НеРезидент КАК НеРезидент,
	|	ВЫБОР
	|		КОГДА ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ФизическиеЛица)
	|			ТОГДА ""Физическое лицо""
	|		КОГДА ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.СтраховыеКомпании)
	|				ИЛИ ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.СобственныеСредстваСК)
	|			ТОГДА ""СК""
	|		КОГДА ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ЮридическиеЛица)
	|				ИЛИ ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.СаморегулируемыеОрганизации)
	|				ИЛИ ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ФондЦелевогоКапитала)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ВсеДоговора.Клиент.КодСектораЭкономики = ""S125 – другие финансовые организации (за исключением страховщиков и негосударственных пенсионных фондов)""
	|						ТОГДА ""Другие финансовые организации""
	|					ИНАЧЕ ""Иное юридическое лицо""
	|				КОНЕЦ
	|	КОНЕЦ КАК КатегорияКлиента,
	|	ВТ_ВсеДоговора.ПризнакИИС КАК ПризнакИИС,
	|	ЛОЖЬ КАК ПравоИспользованияДСКлиента,
	|	ВТ_ДоговораЗаключенныеВПериод.ДоговорДУ КАК ЗаключенВПериод,
	|	ВТ_ДоговораПрекращенныеВПериод.ДоговорДУ КАК ПрекращенВПериод,
	|	ВТ_ДоговораЗаключенныеВПериод.Клиент КАК Клиент_ЗаключенВПериод,
	|	ВТ_ДоговораПрекращенныеВПериод.Клиент КАК Клиент_ПрекращенВПериод,
	|	ВТ_СтандартныеСтратегии.ИдентификаторСтратегии КАК ИдентификаторСтратегии,
	|	ВТ_СтандартныеСтратегии.НаименованиеСтратегии КАК НаименованиеСтратегии,
	|	ЕСТЬNULL(ВТ_ПараметрыДоговоровДУ.ОбособленныйУчетЗадолженностиЭмитента, ЛОЖЬ) КАК ОбособленныйУчетЗадолженностиЭмитента,
	|	ВЫБОР
	|		КОГДА ВТ_ВсеДоговора.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ФизическиеЛица)
	|			ТОГДА ""Физическое лицо""
	|		ИНАЧЕ ""Юридическое лицо""
	|	КОНЕЦ КАК ТипКлиента,
	|	ВТ_ДоговораНаКонецПериода.ДоговорДУ КАК ДоговорНаКонецПериода,
	|	ВТ_ДоговораНаКонецПериода.Клиент КАК Клиент_НаКонецПериода
	|ПОМЕСТИТЬ ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная
	|ИЗ
	|	втВыбранныеДоговоры_Раздел_1_3 КАК ВТ_ВсеДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КвалИнвесторы КАК ВТ_КвалИнвесторы
	|		ПО ВТ_ВсеДоговора.Клиент = ВТ_КвалИнвесторы.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусКлиента КАК ВТ_СтатусКлиента
	|		ПО ВТ_ВсеДоговора.Клиент = ВТ_СтатусКлиента.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СЧА_ПоКлиентам КАК ВТ_СЧА_ПоКлиентам
	|		ПО ВТ_ВсеДоговора.Клиент = ВТ_СЧА_ПоКлиентам.Клиент
	|			И ВТ_ВсеДоговора.ДоговорДУ = ВТ_СЧА_ПоКлиентам.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодаОКАТОФизЛица КАК ВТ_КодаОКАТОФизЛица
	|		ПО ВТ_ВсеДоговора.Клиент = ВТ_КодаОКАТОФизЛица.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтандартныеСтратегии КАК ВТ_СтандартныеСтратегии
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_СтандартныеСтратегии.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораЗаключенныеВПериод КАК ВТ_ДоговораЗаключенныеВПериод
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ДоговораЗаключенныеВПериод.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораПрекращенныеВПериод КАК ВТ_ДоговораПрекращенныеВПериод
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ДоговораПрекращенныеВПериод.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыДоговоровДУ КАК ВТ_ПараметрыДоговоровДУ
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ПараметрыДоговоровДУ.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораНаКонецПериода КАК ВТ_ДоговораНаКонецПериода
	|		ПО ВТ_ВсеДоговора.ДоговорДУ = ВТ_ДоговораНаКонецПериода.ДоговорДУ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорДУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СведенияПоКлиентам_Раздел_1_3.Клиент КАК Клиент,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3.КодПоОКАТОиОКСМ КАК КодПоОКАТОиОКСМ,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам_Раздел_1_3.ДоговорДУ) КАК ВсегоДоговоров,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам_Раздел_1_3.ЗаключенВПериод) КАК ЗаключеноВПериодДоговоров
	|ПОМЕСТИТЬ ВТ_ДоговорыПоКлиентамВсегоИЗаключеноВПериод
	|ИЗ
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная КАК ВТ_СведенияПоКлиентам_Раздел_1_3
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СведенияПоКлиентам_Раздел_1_3.Клиент,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3.КодПоОКАТОиОКСМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.Клиент КАК Клиент,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.ДоговорДУ КАК ДоговорДУ,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.КвалификацияИнвестора КАК КвалификацияИнвестора,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.РезидентНерезидент КАК РезидентНерезидент,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.ВидДеятельности КАК ВидДеятельности,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.СтатусКлиента КАК СтатусКлиента,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.ФизЛицаЮрЛица КАК ФизЛицаЮрЛица,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.СЧА КАК СЧА,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.КодПоОКАТОиОКСМ КАК КодПоОКАТОиОКСМ,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.НеРезидент КАК НеРезидент,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.КатегорияКлиента КАК КатегорияКлиента,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.ПризнакИИС КАК ПризнакИИС,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.ПравоИспользованияДСКлиента КАК ПравоИспользованияДСКлиента,
	|	ВЫБОР
	|		КОГДА ((ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.Клиент, ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.КодПоОКАТОиОКСМ) В
	|				(ВЫБРАТЬ
	|					ВТ.Клиент,
	|					ВТ.КодПоОКАТОиОКСМ
	|				ИЗ
	|					ВТ_ДоговорыПоКлиентамВсегоИЗаключеноВПериод КАК ВТ
	|				ГДЕ
	|					ВТ.ВсегоДоговоров > ВТ.ЗаключеноВПериодДоговоров)) = ИСТИНА
	|			ТОГДА NULL
	|		ИНАЧЕ ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.Клиент_ЗаключенВПериод
	|	КОНЕЦ КАК Клиент_ЗаключенВПериод,
	|	ВЫБОР
	|		КОГДА ((ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.Клиент, ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.КодПоОКАТОиОКСМ) В
	|				(ВЫБРАТЬ
	|					ВТ.Клиент,
	|					ВТ.КодПоОКАТОиОКСМ
	|				ИЗ
	|					ВТ_ДоговорыПоКлиентамВсегоИЗаключеноВПериод КАК ВТ
	|				ГДЕ
	|					ВТ.ВсегоДоговоров > ВТ.ЗаключеноВПериодДоговоров)) = ИСТИНА
	|			ТОГДА NULL
	|		ИНАЧЕ ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.ЗаключенВПериод
	|	КОНЕЦ КАК ЗаключенВПериод,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.ПрекращенВПериод КАК ПрекращенВПериод,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.Клиент_ПрекращенВПериод КАК Клиент_ПрекращенВПериод,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.ИдентификаторСтратегии КАК ИдентификаторСтратегии,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.НаименованиеСтратегии КАК НаименованиеСтратегии,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.ОбособленныйУчетЗадолженностиЭмитента КАК ОбособленныйУчетЗадолженностиЭмитента,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.ТипКлиента КАК ТипКлиента,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.ДоговорНаКонецПериода КАК ДоговорНаКонецПериода,
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная.Клиент_НаКонецПериода КАК Клиент_НаКонецПериода
	|ПОМЕСТИТЬ ВТ_СведенияПоКлиентам_Раздел_1_3
	|ИЗ
	|	ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная КАК ВТ_СведенияПоКлиентам_Раздел_1_3_Предварительная";
	
	Запрос.УстановитьПараметр("ТипыКлиентовДУ", ТипыКлиентовДУ());
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ОтчетОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОтчетОбъект.КонецПериода));
	Запрос.УстановитьПараметр("УправляющаяКомпания", ОтчетОбъект.УправляющаяКомпания);
	Запрос.УстановитьПараметр("БезДоговоровЦессии", ИсключитьЦессии);
	Запрос.УстановитьПараметр("ОтноситьРасхождения", ОтноситьРасхожденияНаПрочиеЗадолженности);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ДополнитьВТ_ВводыВыводы(ОтчетОбъект, МВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Активы_Обороты.ДоговорДУ КАК ДоговорДУ,
		|	СУММА(Активы_Обороты.ВводДС_ДенСчета) КАК ВводДС_ДенСчета,
		|	СУММА(Активы_Обороты.ВыводДС_ДенСчета) КАК ВыводДС_ДенСчета,
		|	СУММА(Активы_Обороты.ВводДС_ДепСчета) КАК ВводДС_ДепСчета,
		|	СУММА(Активы_Обороты.ВыводДС_ДепСчета) КАК ВыводДС_ДепСчета,
		|	СУММА(Активы_Обороты.ВводЦБ) КАК ВводЦБ,
		|	СУММА(Активы_Обороты.ВыводЦБ) КАК ВыводЦБ
		|ПОМЕСТИТЬ втВводыВыводыПодготовленная
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДС_Вводы.ДоговорДУ КАК ДоговорДУ,
		|		ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(ДС_Вводы.Регистратор КАК Документ.ПоступлениеНаРасчетныйСчет).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ВводДенежныхСредствВДУ)
		|					И ВЫРАЗИТЬ(ДС_Вводы.АналитическийСчет.МестоХранения КАК Справочник.БанковскиеСчета).ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Расчетный)
		|				ТОГДА ДС_Вводы.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ВводДС_ДенСчета,
		|		ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(ДС_Вводы.АналитическийСчет.МестоХранения КАК Справочник.БанковскиеСчета).ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Депозитный)
		|				ТОГДА ДС_Вводы.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ВводДС_ДепСчета,
		|		0 КАК ВыводДС_ДенСчета,
		|		0 КАК ВыводДС_ДепСчета,
		|		0 КАК ВводЦБ,
		|		0 КАК ВыводЦБ
		|	ИЗ
		|		РегистрНакопления.ДенежныеСредстваУправленческий КАК ДС_Вводы
		|	ГДЕ
		|		ДС_Вводы.Активность
		|		И ДС_Вводы.Период >= НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ)
		|		И ДС_Вводы.Период < НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1), ДЕНЬ)
		|		И ДС_Вводы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		И ДС_Вводы.АналитическийСчет.ВидАналитическогоСчета = ЗНАЧЕНИЕ(Перечисление.ВидыАналитическогоСчета.ДенежныеСредства)
		|		И ДС_Вводы.АналитическийСчет.МестоХранения ССЫЛКА Справочник.БанковскиеСчета
		|		И ВЫРАЗИТЬ(ДС_Вводы.АналитическийСчет.МестоХранения КАК Справочник.БанковскиеСчета).ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Расчетный), ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Депозитный))
		|		И ДС_Вводы.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
		|		И ВЫРАЗИТЬ(ДС_Вводы.Регистратор КАК Документ.ПоступлениеНаРасчетныйСчет).СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ВводАктивов)
		|		И ДС_Вводы.ДоговорДУ В
		|				(ВЫБРАТЬ
		|					втВыбранныеДоговорыВводы.ДоговорДУ
		|				ИЗ
		|					втВыбранныеДоговорыВводы КАК втВыбранныеДоговорыВводы)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДС_Выводы.ДоговорДУ,
		|		0,
		|		0,
		|		ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(ДС_Выводы.Регистратор КАК Документ.СписаниеСРасчетногоСчета).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ВыводДенежныхСредствИзДУ)
		|					И ВЫРАЗИТЬ(ДС_Выводы.АналитическийСчет.МестоХранения КАК Справочник.БанковскиеСчета).ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Расчетный)
		|				ТОГДА ДС_Выводы.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(ДС_Выводы.АналитическийСчет.МестоХранения КАК Справочник.БанковскиеСчета).ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Депозитный)
		|				ТОГДА ДС_Выводы.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		0,
		|		0
		|	ИЗ
		|		РегистрНакопления.ДенежныеСредстваУправленческий КАК ДС_Выводы
		|	ГДЕ
		|		ДС_Выводы.Активность
		|		И ДС_Выводы.Период >= НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ)
		|		И ДС_Выводы.Период < НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1), ДЕНЬ)
		|		И ДС_Выводы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И ДС_Выводы.АналитическийСчет.ВидАналитическогоСчета = ЗНАЧЕНИЕ(Перечисление.ВидыАналитическогоСчета.ДенежныеСредства)
		|		И ДС_Выводы.АналитическийСчет.МестоХранения ССЫЛКА Справочник.БанковскиеСчета
		|		И ВЫРАЗИТЬ(ДС_Выводы.АналитическийСчет.МестоХранения КАК Справочник.БанковскиеСчета).ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Расчетный), ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Депозитный))
		|		И ДС_Выводы.Регистратор ССЫЛКА Документ.СписаниеСРасчетногоСчета
		|		И ВЫРАЗИТЬ(ДС_Выводы.Регистратор КАК Документ.СписаниеСРасчетногоСчета).СтатьяЗатрат = ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ВыводАктивов)
		|		И ДС_Выводы.ДоговорДУ В
		|				(ВЫБРАТЬ
		|					втВыбранныеДоговорыВводы.ДоговорДУ
		|				ИЗ
		|					втВыбранныеДоговорыВводы КАК втВыбранныеДоговорыВводы)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СтоимостьАктивов.ДоговорДУ,
		|		0,
		|		0,
		|		0,
		|		0,
		|		ВЫБОР
		|			КОГДА СтоимостьАктивов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА СтоимостьАктивов.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА СтоимостьАктивов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА СтоимостьАктивов.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.СтоимостьАктивовУправленческий КАК СтоимостьАктивов
		|	ГДЕ
		|		СтоимостьАктивов.Активность
		|		И СтоимостьАктивов.Период >= НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ)
		|		И СтоимостьАктивов.Период < НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1), ДЕНЬ)
		|		И СтоимостьАктивов.Регистратор ССЫЛКА Документ.ВводВыводЦенныхБумагИзДУ
		|		И СтоимостьАктивов.ДоговорДУ В
		|				(ВЫБРАТЬ
		|					втВыбранныеДоговорыВводы.ДоговорДУ
		|				ИЗ
		|					втВыбранныеДоговорыВводы КАК втВыбранныеДоговорыВводы)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		НачисленныеКД.ДоговорДУ,
		|		0,
		|		0,
		|		0,
		|		0,
		|		ВЫБОР
		|			КОГДА НачисленныеКД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА НачисленныеКД.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА НачисленныеКД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА НачисленныеКД.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.НачисленныйКупонныйДоходУправленческий КАК НачисленныеКД
		|	ГДЕ
		|		НачисленныеКД.Активность
		|		И НачисленныеКД.Период >= НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ)
		|		И НачисленныеКД.Период < НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1), ДЕНЬ)
		|		И НачисленныеКД.Регистратор ССЫЛКА Документ.ВводВыводЦенныхБумагИзДУ
		|		И НачисленныеКД.ДоговорДУ В
		|				(ВЫБРАТЬ
		|					втВыбранныеДоговорыВводы.ДоговорДУ
		|				ИЗ
		|					втВыбранныеДоговорыВводы КАК втВыбранныеДоговорыВводы)) КАК Активы_Обороты
		|
		|СГРУППИРОВАТЬ ПО
		|	Активы_Обороты.ДоговорДУ
		|
		|ИМЕЮЩИЕ
		|	(СУММА(Активы_Обороты.ВводДС_ДенСчета) <> 0
		|		ИЛИ СУММА(Активы_Обороты.ВыводДС_ДенСчета) <> 0
		|		ИЛИ СУММА(Активы_Обороты.ВводДС_ДепСчета) <> 0
		|		ИЛИ СУММА(Активы_Обороты.ВыводДС_ДепСчета) <> 0
		|		ИЛИ СУММА(Активы_Обороты.ВводЦБ) <> 0
		|		ИЛИ СУММА(Активы_Обороты.ВыводЦБ) <> 0)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втВводыВыводыПодготовленная.ДоговорДУ КАК ДоговорДУ,
		|	втВводыВыводыПодготовленная.ВводДС_ДенСчета + втВводыВыводыПодготовленная.ВводДС_ДепСчета + втВводыВыводыПодготовленная.ВводЦБ КАК Поступления,
		|	втВводыВыводыПодготовленная.ВыводДС_ДенСчета + втВводыВыводыПодготовленная.ВыводДС_ДепСчета + втВводыВыводыПодготовленная.ВыводЦБ КАК Изъятия,
		|	втВводыВыводыПодготовленная.ВводДС_ДенСчета + втВводыВыводыПодготовленная.ВводДС_ДепСчета КАК ВводДС,
		|	втВводыВыводыПодготовленная.ВыводДС_ДенСчета + втВводыВыводыПодготовленная.ВыводДС_ДепСчета КАК ВыводДС,
		|	втВводыВыводыПодготовленная.ВводЦБ КАК ВводЦБ,
		|	втВводыВыводыПодготовленная.ВыводЦБ КАК ВыводЦБ
		|ПОМЕСТИТЬ втВводыВыводы
		|ИЗ
		|	втВводыВыводыПодготовленная КАК втВводыВыводыПодготовленная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втВводыВыводыПодготовленная";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОтчетОбъект.КонецПериода));
	Запрос.УстановитьПараметр("НачалоПериода", ОтчетОбъект.НачалоПериода);
	
	Запрос.Выполнить();	
	
КонецПроцедуры

Процедура ЗаполнитьРаздел_1(ОтчетОбъект, МВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора КАК КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента КАК СтатусКлиента,
		|	СУММА(ВТ_СведенияПоКлиентам.СЧА) КАК СЧА,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ КАК КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент КАК НеРезидент,
		|	ВТ_СведенияПоКлиентам.Клиент КАК Клиент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента КАК КатегорияКлиента,
		|	NULL КАК КоличествоКлиентовПоГруппеИмеющихИСС,
		|	0 КАК СуммаИИС,
		|	ЛОЖЬ КАК ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента КАК ПравоИспользованияДСКлиента,
		|	МАКСИМУМ(ВТ_СведенияПоКлиентам.ЗаключенВПериод) КАК КоличествоДоговоровЗаключенныхВОтчетномПериоде,
		|	МАКСИМУМ(ВТ_СведенияПоКлиентам.ПрекращенВПериод) КАК КоличествоДоговоровПрекращенныхВОтчетномПериоде,
		|	ВТ_СведенияПоКлиентам.ВидДеятельности КАК ВидДеятельности,
		|	МАКСИМУМ(ВТ_СведенияПоКлиентам.Клиент_ЗаключенВПериод) КАК КоличествоКлиентовЗаключившихДоговор,
		|	МАКСИМУМ(ВТ_СведенияПоКлиентам.Клиент_ПрекращенВПериод) КАК КоличествоКлиентовРасторгнувшихДоговор,
		|	ВТ_СведенияПоКлиентам.ТипКлиента КАК ТипКлиента
		|ПОМЕСТИТЬ ВТ_АктивыПоКлиентам
		|ИЗ
		|	ВТ_СведенияПоКлиентам_Раздел_1_3 КАК ВТ_СведенияПоКлиентам
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ВидДеятельности,
		|	ВТ_СведенияПоКлиентам.ТипКлиента,
		|	ВТ_СведенияПоКлиентам.Клиент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента,
		|	0,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент,
		|	NULL,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента,
		|	МАКСИМУМ(ВТ_СведенияПоКлиентам.ДоговорДУ),
		|	СУММА(ВТ_СведенияПоКлиентам.СЧА),
		|	ВТ_СведенияПоКлиентам.ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента,
		|	МАКСИМУМ(ВТ_СведенияПоКлиентам.ЗаключенВПериод),
		|	МАКСИМУМ(ВТ_СведенияПоКлиентам.ПрекращенВПериод),
		|	ВТ_СведенияПоКлиентам.ВидДеятельности,
		|	NULL,
		|	NULL,
		|	ВТ_СведенияПоКлиентам.ТипКлиента
		|ИЗ
		|	ВТ_СведенияПоКлиентам_Раздел_1_3 КАК ВТ_СведенияПоКлиентам
		|ГДЕ
		|	ВТ_СведенияПоКлиентам.ПризнакИИС = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ВидДеятельности,
		|	ВТ_СведенияПоКлиентам.ТипКлиента,
		|	ВТ_СведенияПоКлиентам.Клиент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента,
		|	СУММА(ВТ_СведенияПоКлиентам.СЧА),
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент,
		|	ВТ_СведенияПоКлиентам.Клиент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента,
		|	NULL,
		|	0,
		|	ЛОЖЬ,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента,
		|	МАКСИМУМ(ВТ_СведенияПоКлиентам.ЗаключенВПериод),
		|	МАКСИМУМ(ВТ_СведенияПоКлиентам.ПрекращенВПериод),
		|	ВТ_СведенияПоКлиентам.ВидДеятельности,
		|	МАКСИМУМ(ВТ_СведенияПоКлиентам.Клиент_ЗаключенВПериод),
		|	МАКСИМУМ(ВТ_СведенияПоКлиентам.Клиент_ПрекращенВПериод),
		|	ВТ_СведенияПоКлиентам.ТипКлиента
		|ИЗ
		|	ВТ_СведенияПоКлиентам КАК ВТ_СведенияПоКлиентам
		|ГДЕ
		|	НЕ ВТ_СведенияПоКлиентам.Клиент_ПрекращенВПериод ЕСТЬ NULL
		|	И НЕ ВТ_СведенияПоКлиентам.Клиент В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ВТ_СведенияПоКлиентам.Клиент_НаКонецПериода
		|				ИЗ
		|					ВТ_СведенияПоКлиентам КАК ВТ_СведенияПоКлиентам
		|				ГДЕ
		|					НЕ ВТ_СведенияПоКлиентам.Клиент_НаКонецПериода ЕСТЬ NULL)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ВидДеятельности,
		|	ВТ_СведенияПоКлиентам.ТипКлиента,
		|	ВТ_СведенияПоКлиентам.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтандартныеСтратегииПоДействующимДоговорам.НаименованиеСтратегии КАК НаименованиеСтратегии,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СтандартныеСтратегииПоДействующимДоговорам.Клиент) КАК КоличествоКлиентов,
		|	ВТ_СтандартныеСтратегииПоДействующимДоговорам.ВременнойГоризонт КАК ВременнойГоризонт,
		|	ВТ_СтандартныеСтратегииПоДействующимДоговорам.ДоходностьСтратегии КАК ДоходностьСтратегии,
		|	ВТ_СтандартныеСтратегииПоДействующимДоговорам.Риск КАК Риск,
		|	ВТ_СтандартныеСтратегииПоДействующимДоговорам.ТипСтратегии КАК ТипСтратегии,
		|	ВТ_СтандартныеСтратегииПоДействующимДоговорам.ИдентификаторСтратегии + ""_"" + ВЫРАЗИТЬ(ВТ_СтандартныеСтратегииПоДействующимДоговорам.ДоговорДУ КАК Справочник.ДоговорДУ).Код КАК ИдентификаторСтратегии,
		|	ВТ_СтандартныеСтратегииПоДействующимДоговорам.ДоговорДУ КАК ДоговорДУ,
		|	СУММА(ВТ_СведенияПоКлиентам_Раздел_1_3.СЧА) КАК СтоимостьАктивов
		|ИЗ
		|	ВТ_СтандартныеСтратегииПоДействующимДоговорам КАК ВТ_СтандартныеСтратегииПоДействующимДоговорам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияПоКлиентам_Раздел_1_3 КАК ВТ_СведенияПоКлиентам_Раздел_1_3
		|		ПО ВТ_СтандартныеСтратегииПоДействующимДоговорам.ДоговорДУ = ВТ_СведенияПоКлиентам_Раздел_1_3.ДоговорДУ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СтандартныеСтратегииПоДействующимДоговорам.ВременнойГоризонт,
		|	ВТ_СтандартныеСтратегииПоДействующимДоговорам.ДоходностьСтратегии,
		|	ВТ_СтандартныеСтратегииПоДействующимДоговорам.Риск,
		|	ВТ_СтандартныеСтратегииПоДействующимДоговорам.ИдентификаторСтратегии,
		|	ВТ_СтандартныеСтратегииПоДействующимДоговорам.НаименованиеСтратегии,
		|	ВТ_СтандартныеСтратегииПоДействующимДоговорам.ТипСтратегии,
		|	ВТ_СтандартныеСтратегииПоДействующимДоговорам.ДоговорДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора КАК КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента КАК СтатусКлиента,
		|	СУММА(ВТ_СведенияПоКлиентам.СЧА) КАК СЧА,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ КАК КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент КАК НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента КАК КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС КАК ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента КАК ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии + ""_"" + ВЫРАЗИТЬ(ВТ_СведенияПоКлиентам.ДоговорДУ КАК Справочник.ДоговорДУ).Код КАК ИдентификаторСтратегии,
		|	ВТ_СведенияПоКлиентам.ДоговорДУ КАК ДоговорДУ,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ДоговорДУ) КАК КоличествоДействующих,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ЗаключенВПериод) КАК КоличествоДоговоровЗаключенныхВОтчетномПериоде,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ПрекращенВПериод) КАК КоличествоДоговоровПрекращенныхВОтчетномПериоде,
		|	СУММА(ЕСТЬNULL(втВводыВыводы.ВводДС, 0)) КАК Поступления,
		|	СУММА(ЕСТЬNULL(втВводыВыводы.ВыводДС, 0)) КАК Изъятия,
		|	ВТ_СведенияПоКлиентам.ТипКлиента КАК ТипКлиента,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ДоговорНаКонецПериода) КАК КоличествоДоговоровНаКонецПериода,
		|	""Денежные средства"" КАК ТипИмущества,
		|	""Деятельность по управлению ценными бумагами"" КАК ВидДеятельности,
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль КАК ИнвестиционныйПрофиль
		|ИЗ
		|	ВТ_СведенияПоКлиентам_Раздел_1_2 КАК ВТ_СведенияПоКлиентам
		|		ЛЕВОЕ СОЕДИНЕНИЕ втВводыВыводы КАК втВводыВыводы
		|		ПО ВТ_СведенияПоКлиентам.ДоговорДУ = втВводыВыводы.ДоговорДУ
		|ГДЕ
		|	(втВводыВыводы.ВводДС <> 0
		|			ИЛИ втВводыВыводы.ВыводДС <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии,
		|	ВТ_СведенияПоКлиентам.ТипКлиента,
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль,
		|	ВТ_СведенияПоКлиентам.ДоговорДУ
		|
		|ИМЕЮЩИЕ
		|	(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ДоговорНаКонецПериода) <> 0
		|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ЗаключенВПериод) <> 0
		|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ПрекращенВПериод) <> 0
		|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ПрекращенНаНачалоПериода) <> 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента,
		|	СУММА(ВТ_СведенияПоКлиентам.СЧА),
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии + ""_"" + ВЫРАЗИТЬ(ВТ_СведенияПоКлиентам.ДоговорДУ КАК Справочник.ДоговорДУ).Код,
		|	ВТ_СведенияПоКлиентам.ДоговорДУ,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ДоговорДУ),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ЗаключенВПериод),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ПрекращенВПериод),
		|	СУММА(ЕСТЬNULL(втВводыВыводы.ВводЦБ, 0)),
		|	СУММА(ЕСТЬNULL(втВводыВыводы.ВыводЦБ, 0)),
		|	ВТ_СведенияПоКлиентам.ТипКлиента,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ДоговорНаКонецПериода),
		|	""Ценные бумаги"",
		|	""Деятельность по управлению ценными бумагами"",
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль
		|ИЗ
		|	ВТ_СведенияПоКлиентам_Раздел_1_2 КАК ВТ_СведенияПоКлиентам
		|		ЛЕВОЕ СОЕДИНЕНИЕ втВводыВыводы КАК втВводыВыводы
		|		ПО ВТ_СведенияПоКлиентам.ДоговорДУ = втВводыВыводы.ДоговорДУ
		|ГДЕ
		|	(втВводыВыводы.ВводЦБ <> 0
		|			ИЛИ втВводыВыводы.ВыводЦБ <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии,
		|	ВТ_СведенияПоКлиентам.ТипКлиента,
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль,
		|	ВТ_СведенияПоКлиентам.ДоговорДУ
		|
		|ИМЕЮЩИЕ
		|	(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ДоговорНаКонецПериода) <> 0
		|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ЗаключенВПериод) <> 0
		|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ПрекращенВПериод) <> 0
		|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ПрекращенНаНачалоПериода) <> 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента,
		|	СУММА(ВТ_СведенияПоКлиентам.СЧА),
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии + ""_"" + ВЫРАЗИТЬ(ВТ_СведенияПоКлиентам.ДоговорДУ КАК Справочник.ДоговорДУ).Код,
		|	ВТ_СведенияПоКлиентам.ДоговорДУ,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ДоговорДУ),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ЗаключенВПериод),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ПрекращенВПериод),
		|	СУММА(0),
		|	СУММА(0),
		|	ВТ_СведенияПоКлиентам.ТипКлиента,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ДоговорНаКонецПериода),
		|	"""",
		|	""Деятельность по управлению ценными бумагами"",
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль
		|ИЗ
		|	ВТ_СведенияПоКлиентам КАК ВТ_СведенияПоКлиентам
		|		ЛЕВОЕ СОЕДИНЕНИЕ втВводыВыводы КАК втВводыВыводы
		|		ПО ВТ_СведенияПоКлиентам.ДоговорДУ = втВводыВыводы.ДоговорДУ
		|ГДЕ
		|	втВводыВыводы.ДоговорДУ ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии,
		|	ВТ_СведенияПоКлиентам.ТипКлиента,
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль,
		|	ВТ_СведенияПоКлиентам.ДоговорДУ
		|
		|ИМЕЮЩИЕ
		|	(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ДоговорНаКонецПериода) <> 0
		|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ЗаключенВПериод) <> 0
		|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СведенияПоКлиентам.ПрекращенВПериод) <> 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодПоОКАТОиОКСМ,
		|	КвалификацияИнвестора,
		|	СтатусКлиента,
		|	ТипИмущества,
		|	ВидДеятельности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.КвалификацияИнвестора КАК КвалификацияИнвестора,
		|	ВложенныйЗапрос.СтатусКлиента КАК СтатусКлиента,
		|	ВложенныйЗапрос.СовокупныйОбъемПортфеляПоГруппе КАК СовокупныйОбъемПортфеляПоГруппе,
		|	ВложенныйЗапрос.КодПоОКАТОиОКСМ КАК КодПоОКАТОиОКСМ,
		|	ВложенныйЗапрос.НеРезидент КАК НеРезидент,
		|	ВложенныйЗапрос.ПравоИспользованияДСКлиента КАК ПравоИспользованияДСКлиента,
		|	ВложенныйЗапрос.КоличествоДействующих КАК КоличествоДействующих,
		|	ВложенныйЗапрос.КоличествоДоговоровЗаключенныхВОтчетномПериоде КАК КоличествоДоговоровЗаключенныхВОтчетномПериоде,
		|	ВложенныйЗапрос.КоличествоДоговоровПрекращенныхВОтчетномПериоде КАК КоличествоДоговоровПрекращенныхВОтчетномПериоде,
		|	ВложенныйЗапрос.ВидДеятельности КАК ВидДеятельности,
		|	ВложенныйЗапрос.КоличествоКлиентовЗаключившихДоговор КАК КоличествоКлиентовЗаключившихДоговор,
		|	ВложенныйЗапрос.КоличествоКлиентовРасторгнувшихДоговор КАК КоличествоКлиентовРасторгнувшихДоговор,
		|	ВложенныйЗапрос.КоличествоДействующих - ВложенныйЗапрос.КоличествоКлиентовРасторгнувшихДоговор КАК КоличествоКлиентовПоГруппе,
		|	ВложенныйЗапрос.ТипКлиента КАК ТипКлиента,
		|	ВложенныйЗапрос.РазмерСчетаКлиента КАК РазмерСчетаКлиента,
		|	ВложенныйЗапрос.КоличествоКлиентовПоГруппеИмеющихИСС КАК КоличествоКлиентовПоГруппеИмеющихИСС,
		|	ВложенныйЗапрос.СуммаИИС КАК СовокупныйОбъемПортфеляПоГруппеИСС
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫРАЗИТЬ(ВТ_АктивыПоКлиентам.КвалификацияИнвестора КАК СТРОКА(20)) КАК КвалификацияИнвестора,
		|		ВТ_АктивыПоКлиентам.СтатусКлиента КАК СтатусКлиента,
		|		СУММА(ВТ_АктивыПоКлиентам.СЧА) КАК СовокупныйОбъемПортфеляПоГруппе,
		|		ВТ_АктивыПоКлиентам.КодПоОКАТОиОКСМ КАК КодПоОКАТОиОКСМ,
		|		ВТ_АктивыПоКлиентам.НеРезидент КАК НеРезидент,
		|		ВТ_АктивыПоКлиентам.ПравоИспользованияДСКлиента КАК ПравоИспользованияДСКлиента,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_АктивыПоКлиентам.Клиент) КАК КоличествоДействующих,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_АктивыПоКлиентам.КоличествоДоговоровЗаключенныхВОтчетномПериоде) КАК КоличествоДоговоровЗаключенныхВОтчетномПериоде,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_АктивыПоКлиентам.КоличествоДоговоровПрекращенныхВОтчетномПериоде) КАК КоличествоДоговоровПрекращенныхВОтчетномПериоде,
		|		ВЫРАЗИТЬ(ВТ_АктивыПоКлиентам.ВидДеятельности КАК СТРОКА(50)) КАК ВидДеятельности,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_АктивыПоКлиентам.КоличествоКлиентовЗаключившихДоговор) КАК КоличествоКлиентовЗаключившихДоговор,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_АктивыПоКлиентам.КоличествоКлиентовРасторгнувшихДоговор) КАК КоличествоКлиентовРасторгнувшихДоговор,
		|		ВЫРАЗИТЬ(ВТ_АктивыПоКлиентам.ТипКлиента КАК СТРОКА(50)) КАК ТипКлиента,
		|		ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС < 0
		|					ТОГДА ""меньше 0 рублей""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС = 0
		|					ТОГДА ""пустые счета""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 10000
		|					ТОГДА ""от 0 до 10 тыс.""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 100000
		|					ТОГДА ""от 10 тыс. до 100 тыс.""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 1000000
		|					ТОГДА ""от 100 тыс. до 1 млн""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 6000000
		|					ТОГДА ""от 1 млн до 6 млн""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 10000000
		|					ТОГДА ""от 6 млн до 10 млн""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 50000000
		|					ТОГДА ""от 10 млн до 50 млн""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 100000000
		|					ТОГДА ""от 50 млн до 100 млн""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 500000000
		|					ТОГДА ""от 100 млн до 500 млн""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 1000000000
		|					ТОГДА ""от 500 млн до 1 млрд""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС > 1000000000
		|					ТОГДА ""1 млрд +""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА < 0
		|					ТОГДА ""меньше 0 рублей""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА = 0
		|					ТОГДА ""пустые счета""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 10000
		|					ТОГДА ""от 0 до 10 тыс.""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 100000
		|					ТОГДА ""от 10 тыс. до 100 тыс.""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 1000000
		|					ТОГДА ""от 100 тыс. до 1 млн""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 6000000
		|					ТОГДА ""от 1 млн до 6 млн""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 10000000
		|					ТОГДА ""от 6 млн до 10 млн""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 50000000
		|					ТОГДА ""от 10 млн до 50 млн""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 100000000
		|					ТОГДА ""от 50 млн до 100 млн""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 500000000
		|					ТОГДА ""от 100 млн до 500 млн""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 1000000000
		|					ТОГДА ""от 500 млн до 1 млрд""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА > 1000000000
		|					ТОГДА ""1 млрд +""
		|			КОНЕЦ КАК СТРОКА(30)) КАК РазмерСчетаКлиента,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_АктивыПоКлиентам.КоличествоКлиентовПоГруппеИмеющихИСС) КАК КоличествоКлиентовПоГруппеИмеющихИСС,
		|		СУММА(ВТ_АктивыПоКлиентам.СуммаИИС) КАК СуммаИИС
		|	ИЗ
		|		ВТ_АктивыПоКлиентам КАК ВТ_АктивыПоКлиентам
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_АктивыПоКлиентам.КодПоОКАТОиОКСМ,
		|		ВТ_АктивыПоКлиентам.СтатусКлиента,
		|		ВТ_АктивыПоКлиентам.НеРезидент,
		|		ВТ_АктивыПоКлиентам.ПравоИспользованияДСКлиента,
		|		ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС < 0
		|					ТОГДА ""меньше 0 рублей""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС = 0
		|					ТОГДА ""пустые счета""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 10000
		|					ТОГДА ""от 0 до 10 тыс.""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 100000
		|					ТОГДА ""от 10 тыс. до 100 тыс.""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 1000000
		|					ТОГДА ""от 100 тыс. до 1 млн""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 6000000
		|					ТОГДА ""от 1 млн до 6 млн""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 10000000
		|					ТОГДА ""от 6 млн до 10 млн""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 50000000
		|					ТОГДА ""от 10 млн до 50 млн""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 100000000
		|					ТОГДА ""от 50 млн до 100 млн""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 500000000
		|					ТОГДА ""от 100 млн до 500 млн""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС <= 1000000000
		|					ТОГДА ""от 500 млн до 1 млрд""
		|				КОГДА ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СуммаИИС > 1000000000
		|					ТОГДА ""1 млрд +""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА < 0
		|					ТОГДА ""меньше 0 рублей""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА = 0
		|					ТОГДА ""пустые счета""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 10000
		|					ТОГДА ""от 0 до 10 тыс.""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 100000
		|					ТОГДА ""от 10 тыс. до 100 тыс.""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 1000000
		|					ТОГДА ""от 100 тыс. до 1 млн""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 6000000
		|					ТОГДА ""от 1 млн до 6 млн""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 10000000
		|					ТОГДА ""от 6 млн до 10 млн""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 50000000
		|					ТОГДА ""от 10 млн до 50 млн""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 100000000
		|					ТОГДА ""от 50 млн до 100 млн""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 500000000
		|					ТОГДА ""от 100 млн до 500 млн""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА <= 1000000000
		|					ТОГДА ""от 500 млн до 1 млрд""
		|				КОГДА НЕ ВТ_АктивыПоКлиентам.ПризнакИИС
		|						И ВТ_АктивыПоКлиентам.СЧА > 1000000000
		|					ТОГДА ""1 млрд +""
		|			КОНЕЦ КАК СТРОКА(30)),
		|		ВЫРАЗИТЬ(ВТ_АктивыПоКлиентам.КвалификацияИнвестора КАК СТРОКА(20)),
		|		ВЫРАЗИТЬ(ВТ_АктивыПоКлиентам.ВидДеятельности КАК СТРОКА(50)),
		|		ВЫРАЗИТЬ(ВТ_АктивыПоКлиентам.ТипКлиента КАК СТРОКА(50))) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ОтчетОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОтчетОбъект.КонецПериода));
	Запрос.УстановитьПараметр("УправляющаяКомпания", ОтчетОбъект.УправляющаяКомпания);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ДанныеРаздела_1_1 = Результаты[Результаты.ВГраница()-2].Выбрать();
	ДанныеРаздела_1_2 = Результаты[Результаты.ВГраница()-1].Выбрать();
	ДанныеРаздела_1_3 = Результаты[Результаты.ВГраница()].Выбрать();
	
	
	СведенияПоДоговорам = МВТ.Таблицы["ВТ_СведенияПоКлиентам"].ПолучитьДанные().Выгрузить(); 
	СведенияПоДоговорамЗагруженные = СведенияПоДоговорам.Скопировать(); 
	СведенияПоДоговорамЗагруженные.Очистить();
	
	Пока ДанныеРаздела_1_1.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОтчетОбъект.Раздел1_Подраздел1_1.Добавить(), ДанныеРаздела_1_1);
	КонецЦикла;
	
	Пока ДанныеРаздела_1_2.Следующий() Цикл  
		НоваяСтрока = ОтчетОбъект.Раздел1_Подраздел1_2.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеРаздела_1_2);
				
		НоваяСтрока.КоличествоДоговоровЗаключенныхВОтчетномПериоде	= 0;
		НоваяСтрока.КоличествоДоговоровПрекращенныхВОтчетномПериоде = 0;
		НоваяСтрока.КоличествоДоговоровНаКонецПериода = 0;
				

		Отбор = Новый Структура("КвалификацияИнвестора,
						|КодПоОКАТОиОКСМ,
						|СтатусКлиента,
						|НеРезидент,
						|КатегорияКлиента,
						|ПризнакИИС,
						|ПравоИспользованияДСКлиента,
						|ДоговорДУ,
						|ИнвестиционныйПрофиль,
						|ТипКлиента", 
						ДанныеРаздела_1_2.КвалификацияИнвестора,
						ДанныеРаздела_1_2.КодПоОКАТОиОКСМ,
						ДанныеРаздела_1_2.СтатусКлиента,
						ДанныеРаздела_1_2.НеРезидент,
						ДанныеРаздела_1_2.КатегорияКлиента,
						ДанныеРаздела_1_2.ПризнакИИС,
						ДанныеРаздела_1_2.ПравоИспользованияДСКлиента,						
						ДанныеРаздела_1_2.ДоговорДУ,						
						ДанныеРаздела_1_2.ИнвестиционныйПрофиль,
						ДанныеРаздела_1_2.ТипКлиента);		
						
		Строки = СведенияПоДоговорам.НайтиСтроки(Отбор);   
		СтрокиУжеЗагружены = СведенияПоДоговорамЗагруженные.НайтиСтроки(Отбор).Количество();
		
		Если Не СтрокиУжеЗагружены Тогда  
			
			КоличествоДоговоровНаКонецПериода				= 0;
			КоличествоДоговоровЗаключенныхВОтчетномПериоде 	= 0;
			КоличествоДоговоровПрекращенныхВОтчетномПериоде	= 0;
			
			Для Каждого Строка Из Строки Цикл
				Если ЗначениеЗаполнено(Строка.ДоговорДУ) И Не ЗначениеЗаполнено(Строка.ПрекращенВПериод) Тогда
					КоличествоДоговоровНаКонецПериода = КоличествоДоговоровНаКонецПериода + 1;	
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(Строка.ЗаключенВПериод) Тогда
					КоличествоДоговоровЗаключенныхВОтчетномПериоде = КоличествоДоговоровЗаключенныхВОтчетномПериоде + 1;	
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Строка.ПрекращенВПериод) Тогда
					КоличествоДоговоровПрекращенныхВОтчетномПериоде =КоличествоДоговоровПрекращенныхВОтчетномПериоде + 1;	
				КонецЕсли;
			КонецЦикла;	
			
			 НоваяСтрока.КоличествоДоговоровЗаключенныхВОтчетномПериоде	= КоличествоДоговоровЗаключенныхВОтчетномПериоде;
			 НоваяСтрока.КоличествоДоговоровПрекращенныхВОтчетномПериоде = КоличествоДоговоровПрекращенныхВОтчетномПериоде;
			 НоваяСтрока.КоличествоДоговоровНаКонецПериода = КоличествоДоговоровНаКонецПериода;
			
			 НоваяСтрокаЗагружены = СведенияПоДоговорамЗагруженные.Добавить();  
			 ЗаполнитьЗначенияСвойств(НоваяСтрокаЗагружены, Отбор);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Пока ДанныеРаздела_1_3.Следующий() Цикл  
		
		ЗаполнитьЗначенияСвойств(ОтчетОбъект.Раздел1_Подраздел1_3.Добавить(), ДанныеРаздела_1_3);
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ЗаполнитьРаздел_2_3(ОтчетОбъект, МВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДенежныеСредства.ДоговорДУ КАК ДоговорДУ,
		|	ДенежныеСредства.Валюта КАК Валюта,
		|	СУММА(ДенежныеСредства.СуммаОстаток) КАК СуммаОстаток,
		|	ДенежныеСредства.НаименованиеКредитнойОрганизацииБрокера КАК НаименованиеКредитнойОрганизацииБрокера,
		|	ДенежныеСредства.ИдентификаторКредитнойОрганизацииБрокера КАК ИдентификаторКредитнойОрганизацииБрокера,
		|	ДенежныеСредства.Валюта.Код КАК КодВалюты,
		|	СУММА(ДенежныеСредства.НаДепозитныхСчетах) КАК НаДепозитныхСчетах
		|ПОМЕСТИТЬ ВТ_ДенежныеСредства
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДС_Остатки.ДоговорДУ КАК ДоговорДУ,
		|		ДС_Остатки.Валюта КАК Валюта,
		|		ДС_Остатки.СуммаОстаток КАК СуммаОстаток,
		|		ВЫБОР
		|			КОГДА БанковскиеСчета.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Расчетный)
		|					И БанковскиеСчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипРасчетногоСчета.Единый)
		|					И БанковскиеСчета.ДоговорДУ = ЗНАЧЕНИЕ(Справочник.ДоговорДУ.ПустаяСсылка)
		|				ТОГДА ДС_Остатки.АналитическийСчет.СубъектМестаХранения.НаименованиеСокращенное
		|			КОГДА БанковскиеСчета.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Брокерский)
		|				ТОГДА БанковскиеСчета.Владелец.НаименованиеСокращенное
		|			ИНАЧЕ БанковскиеСчета.Банк.НаименованиеСокращенное
		|		КОНЕЦ КАК НаименованиеКредитнойОрганизацииБрокера,
		|		ВЫБОР
		|			КОГДА БанковскиеСчета.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Расчетный)
		|					И БанковскиеСчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипРасчетногоСчета.Единый)
		|					И БанковскиеСчета.ДоговорДУ = ЗНАЧЕНИЕ(Справочник.ДоговорДУ.ПустаяСсылка)
		|				ТОГДА ДС_Остатки.АналитическийСчет.СубъектМестаХранения.ИНН
		|			КОГДА БанковскиеСчета.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Брокерский)
		|				ТОГДА БанковскиеСчета.Владелец.ИНН
		|			ИНАЧЕ БанковскиеСчета.Банк.ИНН
		|		КОНЕЦ КАК ИдентификаторКредитнойОрганизацииБрокера,
		|		ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(ДС_Остатки.АналитическийСчет.МестоХранения КАК Справочник.БанковскиеСчета).ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Депозитный)
		|				ТОГДА ДС_Остатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК НаДепозитныхСчетах
		|	ИЗ
		|		РегистрНакопления.ДенежныеСредстваУправленческий.Остатки(
		|				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				ДоговорДУ В
		|						(ВЫБРАТЬ
		|							ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|						ИЗ
		|							ВТ_ДействующиеДоговора КАК ДоговорыДУ)
		|					И АналитическийСчет.ВидАналитическогоСчета = ЗНАЧЕНИЕ(Перечисление.ВидыАналитическогоСчета.ДенежныеСредства)
		|					И АналитическийСчет.МестоХранения ССЫЛКА Справочник.БанковскиеСчета) КАК ДС_Остатки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|			ПО ДС_Остатки.АналитическийСчет.МестоХранения = БанковскиеСчета.Ссылка) КАК ДенежныеСредства
		|
		|СГРУППИРОВАТЬ ПО
		|	ДенежныеСредства.ДоговорДУ,
		|	ДенежныеСредства.Валюта,
		|	ДенежныеСредства.НаименованиеКредитнойОрганизацииБрокера,
		|	ДенежныеСредства.ИдентификаторКредитнойОрганизацииБрокера,
		|	ДенежныеСредства.Валюта.Код
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора КАК КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента КАК СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ КАК КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент КАК НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента КАК КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС КАК ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента КАК ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ВидДеятельности КАК ВидДеятельности,
		|	ВТ_ДенежныеСредства.КодВалюты КАК КодВалюты,
		|	ВТ_ДенежныеСредства.ИдентификаторКредитнойОрганизацииБрокера КАК ИдентификаторКредитнойОрганизацииБрокера,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВТ_ДенежныеСредства.НаименованиеКредитнойОрганизацииБрокера = ""Филиал «Центральный» Банка ВТБ (ПАО)""
		|				ТОГДА ""Банк ВТБ (ПАО)""
		|			ИНАЧЕ ВТ_ДенежныеСредства.НаименованиеКредитнойОрганизацииБрокера
		|		КОНЕЦ) КАК НаименованиеКредитнойОрганизацииБрокера,
		|	СУММА(ВТ_ДенежныеСредства.СуммаОстаток - ВТ_ДенежныеСредства.НаДепозитныхСчетах) КАК СтоимостнаяОценкаНаОтчетнуюДату,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии + ""_"" + ВЫРАЗИТЬ(ВТ_СведенияПоКлиентам.ДоговорДУ КАК Справочник.ДоговорДУ).Код КАК ИдентификаторСтратегии,
		|	ВТ_СведенияПоКлиентам.ТипКлиента КАК ТипКлиента,
		|	""Денежные средства"" КАК ТипИмущества,
		|	""Начальный (не присвоен)"" КАК УровеньРиска,
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль КАК ИнвестиционныйПрофиль
		|ИЗ
		|	ВТ_СведенияПоКлиентам КАК ВТ_СведенияПоКлиентам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДенежныеСредства КАК ВТ_ДенежныеСредства
		|		ПО ВТ_СведенияПоКлиентам.ДоговорДУ = ВТ_ДенежныеСредства.ДоговорДУ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДенежныеСредства.ИдентификаторКредитнойОрганизацииБрокера,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента,
		|	ВТ_ДенежныеСредства.КодВалюты,
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.НеРезидент,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ВидДеятельности,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль,
		|	ВТ_СведенияПоКлиентам.ТипКлиента,
		|	ВТ_СведенияПоКлиентам.ДоговорДУ
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ_ДенежныеСредства.СуммаОстаток - ВТ_ДенежныеСредства.НаДепозитныхСчетах) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора КАК КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента КАК СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ КАК КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент КАК НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента КАК КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС КАК ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента КАК ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ВидДеятельности КАК ВидДеятельности,
		|	ВТ_ДенежныеСредства.КодВалюты КАК КодВалюты,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии + ""_"" + ВЫРАЗИТЬ(ВТ_СведенияПоКлиентам.ДоговорДУ КАК Справочник.ДоговорДУ).Код КАК ИдентификаторСтратегии,
		|	СУММА(ВТ_ДенежныеСредства.НаДепозитныхСчетах) КАК СтоимостнаяОценкаНаОтчетнуюДату,
		|	ВТ_СведенияПоКлиентам.ТипКлиента КАК ТипКлиента,
		|	""Депозиты в денежных средствах"" КАК ТипИмущества,
		|	""Начальный (не присвоен)"" КАК УровеньРиска,
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль КАК ИнвестиционныйПрофиль
		|ИЗ
		|	ВТ_СведенияПоКлиентам КАК ВТ_СведенияПоКлиентам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДенежныеСредства КАК ВТ_ДенежныеСредства
		|		ПО ВТ_СведенияПоКлиентам.ДоговорДУ = ВТ_ДенежныеСредства.ДоговорДУ
		|ГДЕ
		|	ВТ_ДенежныеСредства.НаДепозитныхСчетах <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СведенияПоКлиентам.ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.НеРезидент,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии,
		|	ВТ_СведенияПоКлиентам.ВидДеятельности,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента,
		|	ВТ_ДенежныеСредства.КодВалюты,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль,
		|	ВТ_СведенияПоКлиентам.ТипКлиента,
		|	ВТ_СведенияПоКлиентам.ДоговорДУ";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОтчетОбъект.КонецПериода));
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ОтчетОбъект.Раздел2.Загрузить(Результаты[Результаты.ВГраница()-1].Выгрузить());	
	ОтчетОбъект.Раздел3.Загрузить(Результаты[Результаты.ВГраница()].Выгрузить());
	
КонецПроцедуры

Процедура ЗаполнитьРаздел_4(ОтчетОбъект, МВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Купоны.ДоговорДУ КАК ДоговорДУ,
		|	Купоны.ЦеннаяБумага КАК ЦеннаяБумага,
		|	Купоны.Эмитент КАК Эмитент,
		|	Купоны.Валюта КАК Валюта,
		|	СУММА(Купоны.Купон) КАК Купон,
		|	СУММА(Купоны.Купон_Вал) КАК Купон_Вал
		|ПОМЕСТИТЬ втКупоны
		|ИЗ
		|	(ВЫБРАТЬ
		|		НКД_Остатки.ДоговорДУ КАК ДоговорДУ,
		|		НКД_Остатки.Облигация КАК ЦеннаяБумага,
		|		НКД_Остатки.Облигация.Эмитент КАК Эмитент,
		|		ВЫБОР
		|			КОГДА НКД_Остатки.Валюта.Ссылка ЕСТЬ NULL
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.RUB)
		|			ИНАЧЕ НКД_Остатки.Валюта
		|		КОНЕЦ КАК Валюта,
		|		НКД_Остатки.СуммаОстаток КАК Купон,
		|		ВЫБОР
		|			КОГДА НКД_Остатки.Валюта.Ссылка ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ НКД_Остатки.ВалютнаяСуммаОстаток
		|		КОНЕЦ КАК Купон_Вал
		|	ИЗ
		|		РегистрНакопления.НачисленныйКупонныйДоходУправленческий.Остатки(
		|				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						ВТ_ДействующиеДоговора КАК ДоговорыДУ)) КАК НКД_Остатки) КАК Купоны
		|
		|СГРУППИРОВАТЬ ПО
		|	Купоны.ДоговорДУ,
		|	Купоны.ЦеннаяБумага,
		|	Купоны.Эмитент,
		|	Купоны.Валюта
		|
		|ИМЕЮЩИЕ
		|	(СУММА(Купоны.Купон) <> 0
		|		ИЛИ СУММА(Купоны.Купон_Вал) <> 0)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорДУ,
		|	ЦеннаяБумага,
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦенныеБумаги.ДоговорДУ КАК ДоговорДУ,
		|	ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЦенныеБумаги.БезНоминала КАК БезНоминала,
		|	ЦенныеБумаги.ВидЦБ КАК ВидЦБ,
		|	ЦенныеБумаги.Эмитент КАК Эмитент,
		|	ЦенныеБумаги.ТипЦБ КАК ТипЦБ,
		|	ЦенныеБумаги.НомерГосРег КАК НомерГосРег,
		|	ЦенныеБумаги.ISIN КАК ISIN,
		|	ЦенныеБумаги.БазовыйАктив_ISIN КАК БазовыйАктив_ISIN,
		|	ЦенныеБумаги.БазовыйАктив_Класс КАК БазовыйАктив_Класс,
		|	ЦенныеБумаги.Валюта КАК Валюта,
		|	СУММА(ЦенныеБумаги.Сумма) КАК Сумма,
		|	СУММА(ЦенныеБумаги.Сумма_Вал) КАК Сумма_Вал,
		|	СУММА(ЦенныеБумаги.Количество) КАК Количество,
		|	МАКСИМУМ(ЦенныеБумаги.CFI) КАК CFI,
		|	ЦенныеБумаги.КодТипаЦБ КАК КодТипаЦБ
		|ПОМЕСТИТЬ втЦенныеБумаги1
		|ИЗ
		|	(ВЫБРАТЬ
		|		Купоны.ДоговорДУ КАК ДоговорДУ,
		|		Купоны.ЦеннаяБумага КАК ЦеннаяБумага,
		|		ЛОЖЬ КАК БезНоминала,
		|		""Облигации"" КАК ВидЦБ,
		|		Купоны.Эмитент КАК Эмитент,
		|		Купоны.ЦеннаяБумага.КодТипаЦБ КАК ТипЦБ,
		|		Купоны.ЦеннаяБумага.НомерГосРегистрацииВыпуска КАК НомерГосРег,
		|		Купоны.ЦеннаяБумага.ISIN КАК ISIN,
		|		"""" КАК БазовыйАктив_ISIN,
		|		"""" КАК БазовыйАктив_Класс,
		|		Купоны.Валюта КАК Валюта,
		|		Купоны.Купон КАК Сумма,
		|		Купоны.Купон_Вал КАК Сумма_Вал,
		|		0 КАК Количество,
		|		Купоны.ЦеннаяБумага.CFI КАК CFI,
		|		Купоны.ЦеннаяБумага.КодТипаЦБ КАК КодТипаЦБ
		|	ИЗ
		|		втКупоны КАК Купоны
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.ДоговорДУ,
		|		СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект,
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Акции).БезНоминала
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ),
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.Облигации
		|					ТОГДА ""Облигации""
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.Акции
		|						И НЕ ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Акции).ДепозитарнаяРасписка
		|					ТОГДА ""Акции""
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.ПаиПИФ
		|					ТОГДА ""ПИФ""
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.Акции
		|						И ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Акции).ДепозитарнаяРасписка
		|					ТОГДА ""ДепозитарныеРасписки""
		|				ИНАЧЕ ""Иные""
		|			КОНЕЦ),
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Облигации).Эмитент
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Акции).Эмитент
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.ПаиПИФ
		|					ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.ПаиПИФ).Эмитент
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			КОНЕЦ),
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Облигации).КодТипаЦБ
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Акции).КодТипаЦБ
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.ПаиПИФ
		|					ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.ПаиПИФ).КодТипаЦБ
		|				ИНАЧЕ ""OTHER""
		|			КОНЕЦ),
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Облигации).НомерГосРегистрацииВыпуска
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Акции).НомерГосРегистрацииВыпуска
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.ПаиПИФ
		|					ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.ПаиПИФ).НомерГосРегистрацииВыпуска
		|				ИНАЧЕ """"
		|			КОНЕЦ),
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Облигации).ISIN
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Акции).ISIN
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.ПаиПИФ
		|					ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.ПаиПИФ).ISIN
		|				ИНАЧЕ """"
		|			КОНЕЦ),
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.Акции
		|						И ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Акции).ДепозитарнаяРасписка
		|					ТОГДА ВЫБОР
		|							КОГДА ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Акции).БазовыйАктив ССЫЛКА Справочник.Акции
		|								ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Акции).БазовыйАктив КАК Справочник.Акции).ISIN
		|							ИНАЧЕ """"
		|						КОНЕЦ
		|				ИНАЧЕ """"
		|			КОНЕЦ),
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект ССЫЛКА Справочник.Акции
		|						И ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Акции).ДепозитарнаяРасписка
		|					ТОГДА ВЫБОР
		|							КОГДА ВЫРАЗИТЬ(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект КАК Справочник.Акции).БазовыйАктив ССЫЛКА Справочник.Акции
		|								ТОГДА ""Акции""
		|							ИНАЧЕ """"
		|						КОНЕЦ
		|				ИНАЧЕ """"
		|			КОНЕЦ),
		|		ВЫБОР
		|			КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Валюта.Ссылка ЕСТЬ NULL
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.RUB)
		|			ИНАЧЕ СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Валюта
		|		КОНЕЦ,
		|		СУММА(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.СуммаОстаток),
		|		СУММА(ВЫБОР
		|				КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Валюта.Ссылка ЕСТЬ NULL
		|					ТОГДА 0
		|				ИНАЧЕ СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.ВалютнаяСуммаОстаток
		|			КОНЕЦ),
		|		СУММА(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.КоличествоОстаток),
		|		МАКСИМУМ(ЕСТЬNULL(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект.CFI, """")),
		|		ЕСТЬNULL(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект.КодТипаЦБ, """")
		|	ИЗ
		|		РегистрНакопления.СтоимостьАктивовПоСделкамРЕПОУправленческий.Остатки(
		|				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						ВТ_ДействующиеДоговора КАК ДоговорыДУ)) КАК СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки
		|	ГДЕ
		|		СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.ВидАктива В(&ВидАктиваКСУ)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.ДоговорДУ,
		|		СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект,
		|		ВЫБОР
		|			КОГДА СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Валюта.Ссылка ЕСТЬ NULL
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.RUB)
		|			ИНАЧЕ СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Валюта
		|		КОНЕЦ,
		|		ЕСТЬNULL(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив.Объект.КодТипаЦБ, """")
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.КоличествоОстаток) <> 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Активы_Остатки.ДоговорДУ,
		|		Активы_Остатки.Актив.Объект,
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Акции).БезНоминала
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ),
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.Облигации
		|					ТОГДА ""Облигации""
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.Акции
		|						И НЕ ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Акции).ДепозитарнаяРасписка
		|					ТОГДА ""Акции""
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.ПаиПИФ
		|					ТОГДА ""ПИФ""
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.Акции
		|						И ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Акции).ДепозитарнаяРасписка
		|					ТОГДА ""ДепозитарныеРасписки""
		|				ИНАЧЕ ""Иные""
		|			КОНЕЦ),
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Облигации).Эмитент
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Акции).Эмитент
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.ПаиПИФ
		|					ТОГДА ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.ПаиПИФ).Эмитент
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			КОНЕЦ),
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Облигации).КодТипаЦБ
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Акции).КодТипаЦБ
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.ПаиПИФ
		|					ТОГДА ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.ПаиПИФ).КодТипаЦБ
		|				ИНАЧЕ ""OTHER""
		|			КОНЕЦ),
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Облигации).НомерГосРегистрацииВыпуска
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Акции).НомерГосРегистрацииВыпуска
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.ПаиПИФ
		|					ТОГДА ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.ПаиПИФ).РегНомерПравилФонда
		|				ИНАЧЕ """"
		|			КОНЕЦ),
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Облигации).ISIN
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Акции).ISIN
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.ПаиПИФ
		|					ТОГДА ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.ПаиПИФ).ISIN
		|				ИНАЧЕ """"
		|			КОНЕЦ),
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.Акции
		|						И ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Акции).ДепозитарнаяРасписка
		|					ТОГДА ВЫБОР
		|							КОГДА ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Акции).БазовыйАктив ССЫЛКА Справочник.Акции
		|								ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Акции).БазовыйАктив КАК Справочник.Акции).ISIN
		|							ИНАЧЕ """"
		|						КОНЕЦ
		|				ИНАЧЕ """"
		|			КОНЕЦ),
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА Активы_Остатки.Актив.Объект ССЫЛКА Справочник.Акции
		|						И ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Акции).ДепозитарнаяРасписка
		|					ТОГДА ВЫБОР
		|							КОГДА ВЫРАЗИТЬ(Активы_Остатки.Актив.Объект КАК Справочник.Акции).БазовыйАктив ССЫЛКА Справочник.Акции
		|								ТОГДА ""Акции""
		|							ИНАЧЕ """"
		|						КОНЕЦ
		|				ИНАЧЕ """"
		|			КОНЕЦ),
		|		ВЫБОР
		|			КОГДА Активы_Остатки.Валюта.Ссылка ЕСТЬ NULL
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.RUB)
		|			ИНАЧЕ Активы_Остатки.Валюта
		|		КОНЕЦ,
		|		СУММА(Активы_Остатки.СуммаОстаток),
		|		СУММА(ВЫБОР
		|				КОГДА Активы_Остатки.Валюта.Ссылка ЕСТЬ NULL
		|					ТОГДА 0
		|				ИНАЧЕ Активы_Остатки.ВалютнаяСуммаОстаток
		|			КОНЕЦ),
		|		СУММА(Активы_Остатки.КоличествоОстаток),
		|		МАКСИМУМ(ЕСТЬNULL(Активы_Остатки.Актив.Объект.CFI, """")),
		|		ЕСТЬNULL(Активы_Остатки.Актив.Объект.КодТипаЦБ, """")
		|	ИЗ
		|		РегистрНакопления.СтоимостьАктивовУправленческий.Остатки(
		|				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						ВТ_ДействующиеДоговора КАК ДоговорыДУ)) КАК Активы_Остатки
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Активы_Остатки.ДоговорДУ,
		|		Активы_Остатки.Актив.Объект,
		|		ВЫБОР
		|			КОГДА Активы_Остатки.Валюта.Ссылка ЕСТЬ NULL
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.RUB)
		|			ИНАЧЕ Активы_Остатки.Валюта
		|		КОНЕЦ,
		|		ЕСТЬNULL(Активы_Остатки.Актив.Объект.КодТипаЦБ, """")
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(Активы_Остатки.КоличествоОстаток) <> 0) КАК ЦенныеБумаги
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦенныеБумаги.ДоговорДУ,
		|	ЦенныеБумаги.ЦеннаяБумага,
		|	ЦенныеБумаги.БезНоминала,
		|	ЦенныеБумаги.ВидЦБ,
		|	ЦенныеБумаги.Эмитент,
		|	ЦенныеБумаги.ТипЦБ,
		|	ЦенныеБумаги.НомерГосРег,
		|	ЦенныеБумаги.ISIN,
		|	ЦенныеБумаги.БазовыйАктив_ISIN,
		|	ЦенныеБумаги.БазовыйАктив_Класс,
		|	ЦенныеБумаги.Валюта,
		|	ЦенныеБумаги.КодТипаЦБ
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ЦенныеБумаги.Сумма) <> 0
		|		ИЛИ СУММА(ЦенныеБумаги.Сумма_Вал) <> 0) И
		|	СУММА(ЦенныеБумаги.Количество) > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорДУ,
		|	ЦеннаяБумага,
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.ДоговорДУ КАК ДоговорДУ,
		|	ХозрасчетныйОстатки.Субконто2.Объект КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстатки.Субконто2.Объект ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2.Объект КАК Справочник.Акции).БезНоминала
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК БезНоминала,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстатки.Субконто2.Объект ССЫЛКА Справочник.Облигации
		|			ТОГДА ""Облигации""
		|		КОГДА ХозрасчетныйОстатки.Субконто2.Объект ССЫЛКА Справочник.Акции
		|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2.Объект КАК Справочник.Акции).ДепозитарнаяРасписка
		|			ТОГДА ""Акции""
		|		КОГДА ХозрасчетныйОстатки.Субконто2.Объект ССЫЛКА Справочник.ПаиПИФ
		|			ТОГДА ""ПИФ""
		|		КОГДА ХозрасчетныйОстатки.Субконто2.Объект ССЫЛКА Справочник.Акции
		|				И ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2.Объект КАК Справочник.Акции).ДепозитарнаяРасписка
		|			ТОГДА ""ДепозитарныеРасписки""
		|		ИНАЧЕ ""Иные""
		|	КОНЕЦ КАК ВидЦБ,
		|	ХозрасчетныйОстатки.Субконто2.Эмитент КАК Эмитент,
		|	ХозрасчетныйОстатки.Субконто2.Объект.КодТипаЦБ КАК ТипЦБ,
		|	ХозрасчетныйОстатки.Субконто2.Объект.НомерГосРегистрацииВыпуска КАК НомерГосРег,
		|	ХозрасчетныйОстатки.Субконто2.Объект.ISIN КАК ISIN,
		|	"""" КАК БазовыйАктив_ISIN,
		|	"""" КАК БазовыйАктив_Класс,
		|	ХозрасчетныйОстатки.Субконто2.ВалютаНоминальнойСтоимости КАК Валюта,
		|	СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК Сумма,
		|	СУММА(ХозрасчетныйОстатки.ВалютнаяСуммаОстаток) КАК Сумма_Вал,
		|	СУММА(ХозрасчетныйОстатки.КоличествоОстаток) КАК Количество,
		|	ХозрасчетныйОстатки.Субконто2.Объект.CFI КАК CFI,
		|	ХозрасчетныйОстатки.Субконто2.Объект.КодТипаЦБ КАК КодТипаЦБ
		|ПОМЕСТИТЬ втЦенныеБумаги2
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&КонецПериода,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВУЦБ),
		|			,
		|			ДоговорДУ В
		|				(ВЫБРАТЬ
		|					ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|				ИЗ
		|					ВТ_ДействующиеДоговора КАК ДоговорыДУ)) КАК ХозрасчетныйОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЦенныеБумаги1 КАК втЦенныеБумаги1
		|		ПО ХозрасчетныйОстатки.ДоговорДУ = втЦенныеБумаги1.ДоговорДУ
		|			И ХозрасчетныйОстатки.Субконто2.Объект = втЦенныеБумаги1.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьАктивовПоСделкамРЕПОУправленческий.Остатки(
		|				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						ВТ_ДействующиеДоговора КАК ДоговорыДУ)) КАК СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки
		|		ПО ХозрасчетныйОстатки.ДоговорДУ = СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.ДоговорДУ
		|			И ХозрасчетныйОстатки.Субконто2 = СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.Актив
		|ГДЕ
		|	ХозрасчетныйОстатки.КоличествоОстаток <> 0
		|	И втЦенныеБумаги1.ДоговорДУ ЕСТЬ NULL
		|	И СтоимостьАктивовПоСделкамРЕПОУправленческийОстатки.ДоговорДУ ЕСТЬ NULL
		|	И ХозрасчетныйОстатки.Субконто2.Объект.КодТипаЦБ <> ""OTHER""
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОстатки.ДоговорДУ,
		|	ХозрасчетныйОстатки.Субконто2,
		|	ХозрасчетныйОстатки.Субконто2.Эмитент,
		|	ХозрасчетныйОстатки.Субконто2.Объект.КодТипаЦБ,
		|	ХозрасчетныйОстатки.Субконто2.Объект.НомерГосРегистрацииВыпуска,
		|	ХозрасчетныйОстатки.Субконто2.Объект.ISIN,
		|	ХозрасчетныйОстатки.Субконто2.Объект.CFI,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстатки.Субконто2.Объект ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2.Объект КАК Справочник.Акции).БезНоминала
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстатки.Субконто2.Объект ССЫЛКА Справочник.Облигации
		|			ТОГДА ""Облигации""
		|		КОГДА ХозрасчетныйОстатки.Субконто2.Объект ССЫЛКА Справочник.Акции
		|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2.Объект КАК Справочник.Акции).ДепозитарнаяРасписка
		|			ТОГДА ""Акции""
		|		КОГДА ХозрасчетныйОстатки.Субконто2.Объект ССЫЛКА Справочник.ПаиПИФ
		|			ТОГДА ""ПИФ""
		|		КОГДА ХозрасчетныйОстатки.Субконто2.Объект ССЫЛКА Справочник.Акции
		|				И ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2.Объект КАК Справочник.Акции).ДепозитарнаяРасписка
		|			ТОГДА ""ДепозитарныеРасписки""
		|		ИНАЧЕ ""Иные""
		|	КОНЕЦ,
		|	ХозрасчетныйОстатки.Субконто2.ВалютаНоминальнойСтоимости,
		|	ХозрасчетныйОстатки.Субконто2.Объект,
		|	ХозрасчетныйОстатки.Субконто2.Объект.КодТипаЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЦенныеБумаги1.ДоговорДУ КАК ДоговорДУ,
		|	втЦенныеБумаги1.ЦеннаяБумага КАК ЦеннаяБумага,
		|	втЦенныеБумаги1.БезНоминала КАК БезНоминала,
		|	втЦенныеБумаги1.ВидЦБ КАК ВидЦБ,
		|	втЦенныеБумаги1.Эмитент КАК Эмитент,
		|	втЦенныеБумаги1.ТипЦБ КАК ТипЦБ,
		|	втЦенныеБумаги1.НомерГосРег КАК НомерГосРег,
		|	втЦенныеБумаги1.ISIN КАК ISIN,
		|	втЦенныеБумаги1.БазовыйАктив_ISIN КАК БазовыйАктив_ISIN,
		|	втЦенныеБумаги1.БазовыйАктив_Класс КАК БазовыйАктив_Класс,
		|	втЦенныеБумаги1.Валюта КАК Валюта,
		|	втЦенныеБумаги1.Сумма КАК Сумма,
		|	втЦенныеБумаги1.Сумма_Вал КАК Сумма_Вал,
		|	втЦенныеБумаги1.Количество КАК Количество,
		|	втЦенныеБумаги1.CFI КАК CFI,
		|	втЦенныеБумаги1.КодТипаЦБ КАК КодТипаЦБ
		|ПОМЕСТИТЬ втЦенныеБумаги
		|ИЗ
		|	втЦенныеБумаги1 КАК втЦенныеБумаги1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втЦенныеБумаги2.ДоговорДУ,
		|	втЦенныеБумаги2.ЦеннаяБумага,
		|	втЦенныеБумаги2.БезНоминала,
		|	втЦенныеБумаги2.ВидЦБ,
		|	втЦенныеБумаги2.Эмитент,
		|	втЦенныеБумаги2.ТипЦБ,
		|	втЦенныеБумаги2.НомерГосРег,
		|	втЦенныеБумаги2.ISIN,
		|	втЦенныеБумаги2.БазовыйАктив_ISIN,
		|	втЦенныеБумаги2.БазовыйАктив_Класс,
		|	втЦенныеБумаги2.Валюта,
		|	втЦенныеБумаги2.Сумма,
		|	втЦенныеБумаги2.Сумма_Вал,
		|	втЦенныеБумаги2.Количество,
		|	втЦенныеБумаги2.CFI,
		|	втЦенныеБумаги2.КодТипаЦБ
		|ИЗ
		|	втЦенныеБумаги2 КАК втЦенныеБумаги2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора КАК КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента КАК СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ КАК КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент КАК НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента КАК КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС КАК ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента КАК ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ВидДеятельности КАК ВидДеятельности,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии + ""_"" + ВЫРАЗИТЬ(ВТ_СведенияПоКлиентам.ДоговорДУ КАК Справочник.ДоговорДУ).Код КАК ИдентификаторСтратегии,
		|	втЦенныеБумаги.НомерГосРег КАК НомерГосРег,
		|	втЦенныеБумаги.ISIN КАК ISIN,
		|	втЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(втЦенныеБумаги.Количество) КАК КоличествоЦенныхБумаг,
		|	СУММА(втЦенныеБумаги.Сумма) КАК СтоимостнаяОценкаНаОтчетнуюДату,
		|	втЦенныеБумаги.CFI КАК CFI,
		|	ВТ_СведенияПоКлиентам.ТипКлиента КАК ТипКлиента,
		|	""Ценные бумаги"" КАК ТипИмущества,
		|	втЦенныеБумаги.КодТипаЦБ КАК КодТипаЦБ,
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль КАК ИнвестиционныйПрофиль
		|ИЗ
		|	ВТ_СведенияПоКлиентам КАК ВТ_СведенияПоКлиентам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЦенныеБумаги КАК втЦенныеБумаги
		|		ПО ВТ_СведенияПоКлиентам.ДоговорДУ = втЦенныеБумаги.ДоговорДУ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.НеРезидент,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ВидДеятельности,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ,
		|	втЦенныеБумаги.ЦеннаяБумага,
		|	втЦенныеБумаги.ISIN,
		|	втЦенныеБумаги.НомерГосРег,
		|	втЦенныеБумаги.CFI,
		|	ВТ_СведенияПоКлиентам.ТипКлиента,
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль,
		|	втЦенныеБумаги.КодТипаЦБ,
		|	ВТ_СведенияПоКлиентам.ДоговорДУ";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОтчетОбъект.КонецПериода));

	ВидАктиваКСУ = Новый Массив;
	ВидАктиваКСУ.Добавить(ПланыВидовХарактеристик.ВидыАктивов.КСУ_GC_Bonds);
	ВидАктиваКСУ.Добавить(ПланыВидовХарактеристик.ВидыАктивов.КСУ_OFZ);
	ВидАктиваКСУ.Добавить(ПланыВидовХарактеристик.ВидыАктивов.КСУ_Акции);
	ВидАктиваКСУ.Добавить(ПланыВидовХарактеристик.ВидыАктивов.КСУ_Все);
	ВидАктиваКСУ.Добавить(ПланыВидовХарактеристик.ВидыАктивов.КСУ_Мтл);
	Запрос.УстановитьПараметр("ВидАктиваКСУ", ВидАктиваКСУ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		
		Если ВРег(Выборка.КодТипаЦБ) = "SHS8" Тогда
			ИдентификаторЦБ = "000" + "_" + ?(ЗначениеЗаполнено(Выборка.ISIN), Выборка.ISIN, "000");	
			ИдентификаторЦБ = ИдентификаторЦБ + "_" + ?(ЗначениеЗаполнено(Выборка.CFI), Выборка.CFI, "000");
			ИдентификаторЦБ = ИдентификаторЦБ + "_" + ?(ЗначениеЗаполнено(Выборка.НомерГосРег), Выборка.НомерГосРег, "000");	
		Иначе
			ИдентификаторЦБ = ?(ЗначениеЗаполнено(Выборка.НомерГосРег), Выборка.НомерГосРег, "000"); 
			ИдентификаторЦБ = ИдентификаторЦБ + "_" + ?(ЗначениеЗаполнено(Выборка.ISIN), Выборка.ISIN, "000"); 
			ИдентификаторЦБ = ИдентификаторЦБ + "_" + ?(ЗначениеЗаполнено(Выборка.CFI), Выборка.CFI, "000"); 
		КонецЕсли;	
	
		НоваяСтрока = ОтчетОбъект.Раздел4.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);  
		НоваяСтрока.ИдентификаторЦеннойБумаги = ИдентификаторЦБ;
		
		НоваяСтрока.УровеньРиска = "Начальный (не присвоен)";		
						
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРаздел_7(ОтчетОбъект, МВТ)
	
	ПредварительныеДанныеПоВалютнымСделкам(ОтчетОбъект, МВТ); 
	ПредварительныеДанныеПоСделкамКромеРепо(ОтчетОбъект, МВТ);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияПараметровДоговораДУСрезПоследних.ДоговорДУ КАК ДоговорДУ
		|ПОМЕСТИТЬ втОтражатьКЗПоПрямомуРЕПО
		|ИЗ
		|	РегистрСведений.ЗначенияПараметровДоговораДУ.СрезПоследних(
		|			КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|			ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						втДоговорыДУ_Раздел7 КАК ДоговорыДУ)
		|				И Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПараметрыДоговораДУ.ОтражатьКредиторскуюЗадолженностьПоПрямомуРЕПО)) КАК ЗначенияПараметровДоговораДУСрезПоследних
		|ГДЕ
		|	ЗначенияПараметровДоговораДУСрезПоследних.Значение = ИСТИНА
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задолженности.ДоговорДУ КАК ДоговорДУ,
		|	ЕСТЬNULL(ПодменаБанкаВТБ.НаЧтоМеняем, ЕСТЬNULL(Задолженности.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))) КАК Контрагент,
		|	Задолженности.Задолженность КАК Задолженность,
		|	Задолженности.ТипДЗКЗ КАК ТипДЗКЗ,
		|	Задолженности.ЦК КАК ЦК,
		|	Задолженности.НаправлениеРЕПО КАК НаправлениеРЕПО,
		|	Задолженности.ЭтоНДФЛ КАК ЭтоНДФЛ,
		|	СУММА(Задолженности.Сумма) КАК Сумма,
		|	Задолженности.ИдентификаторТребованияОбязательства КАК ИдентификаторТребованияОбязательства,
		|	СУММА(Задолженности.КоличествоАктиваТребованияОбязательства) КАК Количество
		|ПОМЕСТИТЬ втЗадолженности
		|ИЗ
		|	(ВЫБРАТЬ
		|		Итоги_БУ.ДоговорДУ КАК ДоговорДУ,
		|		Итоги_БУ.Контрагент КАК Контрагент,
		|		Итоги_БУ.Задолженность КАК Задолженность,
		|		Итоги_БУ.ТипДЗКЗ КАК ТипДЗКЗ,
		|		Итоги_БУ.ЦК КАК ЦК,
		|		Итоги_БУ.НаправлениеРЕПО КАК НаправлениеРЕПО,
		|		Итоги_БУ.Сумма КАК Сумма,
		|		Итоги_БУ.ЭтоНДФЛ КАК ЭтоНДФЛ,
		|		ЕСТЬNULL(Итоги_БУ.Актив, """") КАК ИдентификаторТребованияОбязательства,
		|		ЕСТЬNULL(Итоги_БУ.КоличествоОстаток, 0) КАК КоличествоАктиваТребованияОбязательства
		|	ИЗ
		|		Итоги_БУ КАК Итоги_БУ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПроцентыПоСчетам.ДоговорДУ,
		|		ВЫРАЗИТЬ(ПроцентыПоСчетам.АналитическийСчет.СубъектМестаХранения КАК Справочник.Контрагенты),
		|		ВЫБОР
		|			КОГДА ПроцентыПоСчетам.СуммаОстаток < 0
		|				ТОГДА ""К""
		|			ИНАЧЕ ""Д""
		|		КОНЕЦ,
		|		""Прочая"",
		|		ЛОЖЬ,
		|		"""",
		|		ПроцентыПоСчетам.СуммаОстаток * ВЫБОР
		|			КОГДА ПроцентыПоСчетам.СуммаОстаток < 0
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ,
		|		ЛОЖЬ,
		|		"""",
		|		0
		|	ИЗ
		|		РегистрНакопления.НачисленныеПроцентыПоБанковскимСчетамУправленческий.Остатки(
		|				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						втДоговорыДУ_Раздел7 КАК ДоговорыДУ)) КАК ПроцентыПоСчетам
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Бух_Дефолты.ДоговорДУ,
		|		ВЫРАЗИТЬ(Бух_Дефолты.Субконто1 КАК Справочник.Контрагенты),
		|		""Д"",
		|		""Прочая"",
		|		ЛОЖЬ,
		|		"""",
		|		-1 * Бух_Дефолты.СуммаОстаток,
		|		ЛОЖЬ,
		|		"""",
		|		0
		|	ИЗ
		|		РегистрБухгалтерии.Хозрасчетный.Остатки(
		|				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДефолтПоТелу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДефолтПоКупону)),
		|				&Субконто_Контрагенты,
		|				ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						втДоговорыДУ_Раздел7 КАК ДоговорыДУ)) КАК Бух_Дефолты
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗадолженностьЭмитентаПоОблигациям.ДоговорДУ,
		|		ВЫРАЗИТЬ(ЗадолженностьЭмитентаПоОблигациям.Эмитент КАК Справочник.Контрагенты),
		|		ВЫБОР
		|			КОГДА ЗадолженностьЭмитентаПоОблигациям.СуммаОстаток < 0
		|				ТОГДА ""К""
		|			ИНАЧЕ ""Д""
		|		КОНЕЦ,
		|		""Прочая"",
		|		ЛОЖЬ,
		|		"""",
		|		ЗадолженностьЭмитентаПоОблигациям.СуммаОстаток * ВЫБОР
		|			КОГДА ЗадолженностьЭмитентаПоОблигациям.СуммаОстаток < 0
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ,
		|		ЛОЖЬ,
		|		"""",
		|		0
		|	ИЗ
		|		РегистрНакопления.ЗадолженностьЭмитентаПоОблигациямУУ.Остатки(
		|				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						втДоговорыДУ_Раздел7 КАК ДоговорыДУ
		|					ГДЕ
		|						ДоговорыДУ.ОбособленныйУчетЗадолженностиЭмитента = ИСТИНА)) КАК ЗадолженностьЭмитентаПоОблигациям
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗадолженностьЭмитентаПоКД.ДоговорДУ,
		|		ВЫРАЗИТЬ(ЗадолженностьЭмитентаПоКД.Эмитент КАК Справочник.Контрагенты),
		|		ВЫБОР
		|			КОГДА ЗадолженностьЭмитентаПоКД.СуммаОстаток < 0
		|				ТОГДА ""К""
		|			ИНАЧЕ ""Д""
		|		КОНЕЦ,
		|		""Прочая"",
		|		ЛОЖЬ,
		|		"""",
		|		ЗадолженностьЭмитентаПоКД.СуммаОстаток * ВЫБОР
		|			КОГДА ЗадолженностьЭмитентаПоКД.СуммаОстаток < 0
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ,
		|		ЛОЖЬ,
		|		"""",
		|		0
		|	ИЗ
		|		РегистрНакопления.ЗадолженностьЭмитентаПоКупонномуДоходуУУ.Остатки(
		|				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						втДоговорыДУ_Раздел7 КАК ДоговорыДУ
		|					ГДЕ
		|						ДоговорыДУ.ОбособленныйУчетЗадолженностиЭмитента = ИСТИНА)) КАК ЗадолженностьЭмитентаПоКД
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		НДФЛ_Остатки.ДоговорДУ,
		|		ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
		|		""К"",
		|		""Прочая"",
		|		ЛОЖЬ,
		|		"""",
		|		-1 * НДФЛ_Остатки.СуммаОстаток,
		|		ИСТИНА,
		|		"""",
		|		0
		|	ИЗ
		|		РегистрБухгалтерии.Хозрасчетный.Остатки(
		|				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДФЛ)),
		|				,
		|				ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						втДоговорыДУ_Раздел7 КАК ДоговорыДУ)) КАК НДФЛ_Остатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ОборотыНДФЛ.ДоговорДУ,
		|		ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
		|		""К"",
		|		""Прочая"",
		|		ЛОЖЬ,
		|		"""",
		|		-1 * ОборотыНДФЛ.СуммаОборот,
		|		ИСТИНА,
		|		"""",
		|		0
		|	ИЗ
		|		РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		|				НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				Регистратор,
		|				СчетДт В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВводВыводАктивовВИзДУ)),
		|				,
		|				СчетКт В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДФЛ)),
		|				,
		|				ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						втДоговорыДУ_Раздел7 КАК ДоговорыДУ)) КАК ОборотыНДФЛ
		|	ГДЕ
		|		ОборотыНДФЛ.Регистратор ССЫЛКА Документ.НачислениеЗадолженности
		|		И ВЫРАЗИТЬ(ОборотыНДФЛ.Регистратор КАК Документ.НачислениеЗадолженности).Комментарий ПОДОБНО ""Загружен из FIN %""
		|		И ИСТИНА = &ВычитатьВнешнийНДФЛ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РЕПО_Остатки.ДоговорДУ,
		|		ВЫРАЗИТЬ(РЕПО_Остатки.СделкаРЕПО.Контрагент КАК Справочник.Контрагенты),
		|		""Д"",
		|		""По сделкам РЕПО"",
		|		ВЫБОР
		|			КОГДА НЕ РЕПО_Остатки.СделкаРЕПО.ВнебиржеваяСделка
		|					И ПОДСТРОКА(РЕПО_Остатки.СделкаРЕПО.РежимТоргов.BoardId, 1, 4) В (&РежимыТоргов_РЕПО_ЦК)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА РЕПО_Остатки.СделкаРЕПО.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделкаРЕПО.ПрямойРЕПО)
		|				ТОГДА ""Прямое""
		|			КОГДА РЕПО_Остатки.СделкаРЕПО.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделкаРЕПО.ОбратныйРЕПО)
		|				ТОГДА ""Обратное""
		|			ИНАЧЕ """"
		|		КОНЕЦ,
		|		РЕПО_Остатки.СуммаОстаток,
		|		ЛОЖЬ,
		|		РЕПО_Остатки.Актив,
		|		РЕПО_Остатки.КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.СтоимостьАктивовПоСделкамРЕПОУправленческий.Остатки(
		|				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						втДоговорыДУ_Раздел7 КАК ДоговорыДУ)) КАК РЕПО_Остатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РЕПО_Остатки.ДоговорДУ,
		|		ВЫРАЗИТЬ(РЕПО_Остатки.СделкаРЕПО.Контрагент КАК Справочник.Контрагенты),
		|		""К"",
		|		""По сделкам РЕПО"",
		|		ВЫБОР
		|			КОГДА НЕ РЕПО_Остатки.СделкаРЕПО.ВнебиржеваяСделка
		|					И ПОДСТРОКА(РЕПО_Остатки.СделкаРЕПО.РежимТоргов.BoardId, 1, 4) В (&РежимыТоргов_РЕПО_ЦК)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА РЕПО_Остатки.СделкаРЕПО.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделкаРЕПО.ПрямойРЕПО)
		|				ТОГДА ""Прямое""
		|			КОГДА РЕПО_Остатки.СделкаРЕПО.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделкаРЕПО.ОбратныйРЕПО)
		|				ТОГДА ""Обратное""
		|			ИНАЧЕ """"
		|		КОНЕЦ,
		|		РЕПО_Остатки.СуммаОстаток,
		|		ЛОЖЬ,
		|		РЕПО_Остатки.Актив,
		|		РЕПО_Остатки.КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.СтоимостьАктивовПоСделкамРЕПОУправленческий.Остатки(
		|				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				Актив.ВидАктива В (&ВидАктиваКСУ)
		|					И ДоговорДУ В
		|						(ВЫБРАТЬ
		|							ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|						ИЗ
		|							втДоговорыДУ_Раздел7 КАК ДоговорыДУ)) КАК РЕПО_Остатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КупонРЕПО_Остатки.ДоговорДУ,
		|		ВЫРАЗИТЬ(КупонРЕПО_Остатки.СделкаРЕПО.Контрагент КАК Справочник.Контрагенты),
		|		""Д"",
		|		""По сделкам РЕПО"",
		|		ВЫБОР
		|			КОГДА НЕ КупонРЕПО_Остатки.СделкаРЕПО.ВнебиржеваяСделка
		|					И ПОДСТРОКА(КупонРЕПО_Остатки.СделкаРЕПО.РежимТоргов.BoardId, 1, 4) В (&РежимыТоргов_РЕПО_ЦК)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА КупонРЕПО_Остатки.СделкаРЕПО.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделкаРЕПО.ПрямойРЕПО)
		|				ТОГДА ""Прямое""
		|			КОГДА КупонРЕПО_Остатки.СделкаРЕПО.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделкаРЕПО.ОбратныйРЕПО)
		|				ТОГДА ""Обратное""
		|			ИНАЧЕ """"
		|		КОНЕЦ,
		|		КупонРЕПО_Остатки.СуммаОстаток,
		|		ЛОЖЬ,
		|		КупонРЕПО_Остатки.Облигация,
		|		0
		|	ИЗ
		|		РегистрНакопления.НачисленныйКупонныйДоходПоСделкамРЕПОУправленческий.Остатки(
		|				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						втДоговорыДУ_Раздел7 КАК ДоговорыДУ)) КАК КупонРЕПО_Остатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасчетыРЕПОКредиторскаяЗадолженностьПоТелуОстатки.ДоговорДУ,
		|		ВЫРАЗИТЬ(РасчетыРЕПОКредиторскаяЗадолженностьПоТелуОстатки.Контрагент КАК Справочник.Контрагенты),
		|		""К"",
		|		""По сделкам РЕПО"",
		|		ИСТИНА,
		|		""Прямое"",
		|		РасчетыРЕПОКредиторскаяЗадолженностьПоТелуОстатки.СуммаОстаток,
		|		ЛОЖЬ,
		|		РасчетыРЕПОКредиторскаяЗадолженностьПоТелуОстатки.БизнесПроцесс.Актив,
		|		РасчетыРЕПОКредиторскаяЗадолженностьПоТелуОстатки.БизнесПроцесс.Количество
		|	ИЗ
		|		РегистрНакопления.РасчетыРЕПОКредиторскаяЗадолженностьПоТелу.Остатки(
		|				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|				ДоговорДУ В
		|					(ВЫБРАТЬ
		|						КредиторкаПоРепо.ДоговорДУ
		|					ИЗ
		|						втОтражатьКЗПоПрямомуРЕПО КАК КредиторкаПоРепо)) КАК РасчетыРЕПОКредиторскаяЗадолженностьПоТелуОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_ОбязательстваНаВалРынке.ДоговорДУ,
		|		ВТ_ОбязательстваНаВалРынке.Контрагент,
		|		""К"",
		|		""Сделки с иностранной валютой"",
		|		ЛОЖЬ,
		|		"""",
		|		ВТ_ОбязательстваНаВалРынке.СуммаВВалютеРасчетов,
		|		ЛОЖЬ,
		|		ВТ_ОбязательстваНаВалРынке.Валюта,
		|		ВТ_ОбязательстваНаВалРынке.ВалютнаяСумма
		|	ИЗ
		|		ВТ_ОбязательстваНаВалРынке КАК ВТ_ОбязательстваНаВалРынке
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_ТребованияНаВалРынке.ДоговорДУ,
		|		ВТ_ТребованияНаВалРынке.Контрагент,
		|		""Д"",
		|		""Сделки с иностранной валютой"",
		|		ЛОЖЬ,
		|		"""",
		|		ВТ_ТребованияНаВалРынке.СуммаВВалютеРасчетов,
		|		ЛОЖЬ,
		|		ВТ_ТребованияНаВалРынке.Валюта,
		|		ВТ_ТребованияНаВалРынке.ВалютнаяСумма
		|	ИЗ
		|		ВТ_ТребованияНаВалРынке КАК ВТ_ТребованияНаВалРынке) КАК Задолженности
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПодменаБанкаВТБ КАК ПодменаБанкаВТБ
		|		ПО (ПодменаБанкаВТБ.ЧтоМеняем = Задолженности.Контрагент)
		|
		|СГРУППИРОВАТЬ ПО
		|	Задолженности.ДоговорДУ,
		|	ЕСТЬNULL(ПодменаБанкаВТБ.НаЧтоМеняем, ЕСТЬNULL(Задолженности.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))),
		|	Задолженности.Задолженность,
		|	Задолженности.ТипДЗКЗ,
		|	Задолженности.ЦК,
		|	Задолженности.НаправлениеРЕПО,
		|	Задолженности.ЭтоНДФЛ,
		|	Задолженности.ИдентификаторТребованияОбязательства
		|
		|ИМЕЮЩИЕ
		|	СУММА(Задолженности.Сумма) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ДоговорДУ КАК ДоговорДУ,
		|	ВложенныйЗапрос.Контрагент КАК Контрагент,
		|	ВложенныйЗапрос.Задолженность КАК Задолженность,
		|	ВложенныйЗапрос.ТипДЗКЗ КАК ТипДЗКЗ,
		|	ВложенныйЗапрос.ЦК КАК ЦК,
		|	ВложенныйЗапрос.НаправлениеРЕПО КАК НаправлениеРЕПО,
		|	ВложенныйЗапрос.ЭтоНДФЛ КАК ЭтоНДФЛ,
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
		|	ВложенныйЗапрос.ИдентификаторТребованияОбязательства КАК ИдентификаторТребованияОбязательства,
		|	СУММА(ВЫРАЗИТЬ(ВложенныйЗапрос.Количество КАК ЧИСЛО(17, 2))) КАК Количество
		|ПОМЕСТИТЬ втЗадолженностиИтог
		|ИЗ
		|	(ВЫБРАТЬ
		|		втЗадолженности.ДоговорДУ КАК ДоговорДУ,
		|		втЗадолженности.Контрагент КАК Контрагент,
		|		втЗадолженности.Задолженность КАК Задолженность,
		|		втЗадолженности.ТипДЗКЗ КАК ТипДЗКЗ,
		|		втЗадолженности.ЦК КАК ЦК,
		|		втЗадолженности.НаправлениеРЕПО КАК НаправлениеРЕПО,
		|		втЗадолженности.ЭтоНДФЛ КАК ЭтоНДФЛ,
		|		СУММА(втЗадолженности.Сумма) КАК Сумма,
		|		втЗадолженности.ИдентификаторТребованияОбязательства КАК ИдентификаторТребованияОбязательства,
		|		втЗадолженности.Количество КАК Количество
		|	ИЗ
		|		втЗадолженности КАК втЗадолженности
		|	ГДЕ
		|		втЗадолженности.Задолженность = ""Д""
		|	
		|	СГРУППИРОВАТЬ ПО
		|		втЗадолженности.Задолженность,
		|		втЗадолженности.ЦК,
		|		втЗадолженности.Контрагент,
		|		втЗадолженности.ТипДЗКЗ,
		|		втЗадолженности.ЭтоНДФЛ,
		|		втЗадолженности.ДоговорДУ,
		|		втЗадолженности.НаправлениеРЕПО,
		|		втЗадолженности.ИдентификаторТребованияОбязательства,
		|		втЗадолженности.Количество
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(втЗадолженности.Сумма) > 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		втЗадолженности.ДоговорДУ,
		|		втЗадолженности.Контрагент,
		|		втЗадолженности.Задолженность,
		|		втЗадолженности.ТипДЗКЗ,
		|		втЗадолженности.ЦК,
		|		втЗадолженности.НаправлениеРЕПО,
		|		втЗадолженности.ЭтоНДФЛ,
		|		СУММА(втЗадолженности.Сумма),
		|		втЗадолженности.ИдентификаторТребованияОбязательства,
		|		втЗадолженности.Количество
		|	ИЗ
		|		втЗадолженности КАК втЗадолженности
		|	ГДЕ
		|		втЗадолженности.Задолженность = ""К""
		|	
		|	СГРУППИРОВАТЬ ПО
		|		втЗадолженности.Задолженность,
		|		втЗадолженности.ЦК,
		|		втЗадолженности.Контрагент,
		|		втЗадолженности.ТипДЗКЗ,
		|		втЗадолженности.ЭтоНДФЛ,
		|		втЗадолженности.ДоговорДУ,
		|		втЗадолженности.НаправлениеРЕПО,
		|		втЗадолженности.ИдентификаторТребованияОбязательства,
		|		втЗадолженности.Количество
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(втЗадолженности.Сумма) > 0) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.НаправлениеРЕПО,
		|	ВложенныйЗапрос.Задолженность,
		|	ВложенныйЗапрос.ТипДЗКЗ,
		|	ВложенныйЗапрос.ДоговорДУ,
		|	ВложенныйЗапрос.ЦК,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.ЭтоНДФЛ,
		|	ВложенныйЗапрос.ИдентификаторТребованияОбязательства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора КАК КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента КАК СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ КАК КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент КАК НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента КАК КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС КАК ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента КАК ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ВидДеятельности КАК ВидДеятельности,
		|	втЗадолженностиИтог.ТипДЗКЗ КАК ТипТребованияОбязательства,
		|	втЗадолженностиИтог.НаправлениеРЕПО КАК ТипСделкиРЕПО,
		|	СУММА(втЗадолженностиИтог.Сумма) КАК СтоимостнаяОценкаНаОтчетнуюДату,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЕСТЬNULL(втЗадолженностиИтог.Контрагент.НаименованиеПолное, """") <> """"
		|				ТОГДА втЗадолженностиИтог.Контрагент.НаименованиеПолное
		|			ИНАЧЕ ВЫБОР
		|					КОГДА втЗадолженностиИтог.ЭтоНДФЛ = ИСТИНА
		|						ТОГДА ""Управление Федерального казначейства г.Москвы""
		|					ИНАЧЕ втЗадолженностиИтог.Контрагент.Наименование
		|				КОНЕЦ
		|		КОНЕЦ) КАК НаименованиеКонтрагента,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(втЗадолженностиИтог.Контрагент.ИНН, """") = """"
		|			ТОГДА ВЫБОР
		|					КОГДА втЗадолженностиИтог.Контрагент.НеРезидент = ИСТИНА
		|						ТОГДА ""000""
		|					КОГДА втЗадолженностиИтог.ЭтоНДФЛ = ИСТИНА
		|						ТОГДА ""7725074789""
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ втЗадолженностиИтог.Контрагент.ИНН
		|	КОНЕЦ КАК ИдентификаторКонтрагента,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии + ""_"" + ВЫРАЗИТЬ(ВТ_СведенияПоКлиентам.ДоговорДУ КАК Справочник.ДоговорДУ).Код КАК ИдентификаторСтратегии,
		|	ВТ_СведенияПоКлиентам.ТипКлиента КАК ТипКлиента,
		|	ВЫБОР
		|		КОГДА втЗадолженностиИтог.Задолженность = ""Д""
		|			ТОГДА ""Требование""
		|		КОГДА втЗадолженностиИтог.Задолженность = ""К""
		|			ТОГДА ""Обязательство""
		|	КОНЕЦ КАК ТребованияИлиОбязательства,
		|	МАКСИМУМ(втЗадолженностиИтог.Контрагент) КАК Контрагент,
		|	""Начальный (не присвоен)"" КАК УровеньРиска,
		|	втЗадолженностиИтог.ИдентификаторТребованияОбязательства КАК ИдентификаторТребованияОбязательстваСоставной,
		|	СУММА(втЗадолженностиИтог.Количество) КАК КоличествоАктиваТребованияОбязательства,
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль КАК ИнвестиционныйПрофиль
		|ИЗ
		|	втЗадолженностиИтог КАК втЗадолженностиИтог
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияПоКлиентам КАК ВТ_СведенияПоКлиентам
		|		ПО втЗадолженностиИтог.ДоговорДУ = ВТ_СведенияПоКлиентам.ДоговорДУ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ВидДеятельности,
		|	втЗадолженностиИтог.ТипДЗКЗ,
		|	втЗадолженностиИтог.НаправлениеРЕПО,
		|	ВТ_СведенияПоКлиентам.ТипКлиента,
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии,
		|	ВЫБОР
		|		КОГДА втЗадолженностиИтог.Задолженность = ""Д""
		|			ТОГДА ""Требование""
		|		КОГДА втЗадолженностиИтог.Задолженность = ""К""
		|			ТОГДА ""Обязательство""
		|	КОНЕЦ,
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(втЗадолженностиИтог.Контрагент.ИНН, """") = """"
		|			ТОГДА ВЫБОР
		|					КОГДА втЗадолженностиИтог.Контрагент.НеРезидент = ИСТИНА
		|						ТОГДА ""000""
		|					КОГДА втЗадолженностиИтог.ЭтоНДФЛ = ИСТИНА
		|						ТОГДА ""7725074789""
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ втЗадолженностиИтог.Контрагент.ИНН
		|	КОНЕЦ,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.ДоговорДУ,
		|	втЗадолженностиИтог.ИдентификаторТребованияОбязательства
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеКонтрагента,
		|	СтоимостнаяОценкаНаОтчетнуюДату,
		|	ИдентификаторСтратегии,
		|	ТребованияИлиОбязательства";
	
	Запрос.УстановитьПараметр("ВычитатьВнешнийНДФЛ", Ложь);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОтчетОбъект.КонецПериода));
	Запрос.УстановитьПараметр("РежимыТоргов_РЕПО_ЦК", ПолучитьРежимыТоргов_РЕПОЦК());
	Запрос.УстановитьПараметр("Субконто_Контрагенты", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты));

	ВидАктиваКСУ = Новый Массив;
	ВидАктиваКСУ.Добавить(ПланыВидовХарактеристик.ВидыАктивов.КСУ_GC_Bonds);
	ВидАктиваКСУ.Добавить(ПланыВидовХарактеристик.ВидыАктивов.КСУ_OFZ);
	ВидАктиваКСУ.Добавить(ПланыВидовХарактеристик.ВидыАктивов.КСУ_Акции);
	ВидАктиваКСУ.Добавить(ПланыВидовХарактеристик.ВидыАктивов.КСУ_Все);
	ВидАктиваКСУ.Добавить(ПланыВидовХарактеристик.ВидыАктивов.КСУ_Мтл);
	Запрос.УстановитьПараметр("ВидАктиваКСУ", ВидАктиваКСУ);

	ТЗРаздел7 = Запрос.Выполнить().Выгрузить();
	ТЗРаздел7.Колонки.Добавить("ИдентификаторТребованияОбязательства", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
	
	Для Каждого ТекСтрока Из ТЗРаздел7 Цикл 
		
		ИдентификаторЦБ = "";
		Актив = ТекСтрока.ИдентификаторТребованияОбязательстваСоставной; 
		
		Если ТипЗнч(Актив) = Тип("Строка")
			Или ТипЗнч(Актив) = Тип("СправочникСсылка.Контрагенты") 
			Или Не ЗначениеЗаполнено(Актив) Тогда    
				ТекСтрока.ИдентификаторТребованияОбязательства = ТекСтрока.ИдентификаторТребованияОбязательстваСоставной;
				Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Актив) = Тип("СправочникСсылка.Активы") Тогда
			Актив = Актив.Объект;  
		КонецЕсли;	

		
		Если ВРег(Актив.КодТипаЦБ) = "SHS8" Тогда
			ИдентификаторЦБ = "000" + "_" + ?(ЗначениеЗаполнено(Актив.ISIN), Актив.ISIN, "000");	
			ИдентификаторЦБ = ИдентификаторЦБ + "_" + ?(ЗначениеЗаполнено(Актив.CFI), Актив.CFI, "000");
			ИдентификаторЦБ = ИдентификаторЦБ + "_" + ?(ЗначениеЗаполнено(Актив.НомерГосРегистрацииВыпуска), Актив.НомерГосРегистрацииВыпуска, "000");	
		Иначе
			ИдентификаторЦБ = ?(ЗначениеЗаполнено(Актив.НомерГосРегистрацииВыпуска), Актив.НомерГосРегистрацииВыпуска, "000"); 
			ИдентификаторЦБ = ИдентификаторЦБ + "_" + ?(ЗначениеЗаполнено(Актив.ISIN), Актив.ISIN, "000"); 
			ИдентификаторЦБ = ИдентификаторЦБ + "_" + ?(ЗначениеЗаполнено(Актив.CFI), Актив.CFI, "000"); 
		КонецЕсли;
		
		ТекСтрока.ИдентификаторТребованияОбязательства = ИдентификаторЦБ;
		
	КонецЦикла;
	
	ТЗРаздел7.Свернуть("ВидДеятельности,      
						|ИдентификаторКонтрагента,
						|ИдентификаторСтратегии,
						|ИдентификаторТребованияОбязательства,
						|ИдентификаторТребованияОбязательстваСоставной,
						|КатегорияКлиента,
						|КвалификацияИнвестора,
						|КодПоОКАТОиОКСМ,
						|Контрагент,
						|НаименованиеКонтрагента,
						|НеРезидент,
						|ПравоИспользованияДСКлиента,
						|ПризнакИИС,
						|НеРезидент,
						|КатегорияКлиента,
						|ПризнакИИС,
						|СтатусКлиента,
						|ТипКлиента,
						|ТипСделкиРЕПО,   
						|ТипТребованияОбязательства,  
						|ТребованияИлиОбязательства,
					    |ИнвестиционныйПрофиль,
						|УровеньРиска" , "КоличествоАктиваТребованияОбязательства, СтоимостнаяОценкаНаОтчетнуюДату"); 
	
	
	ОтчетОбъект.Раздел7.Загрузить(ТЗРаздел7); 
	
	ОтчетОбъект.Раздел7.Свернуть("ВидДеятельности,      
						|ИдентификаторКонтрагента,
						|ИдентификаторСтратегии,
						|ИдентификаторТребованияОбязательства,
						|КатегорияКлиента,
						|КвалификацияИнвестора,
						|КодПоОКАТОиОКСМ,
						|НаименованиеКонтрагента,
						//|НеРезидент,
						|ПравоИспользованияДСКлиента,
						|ПризнакИИС,
						|СтатусКлиента,
						|ТипКлиента,
						|ТипСделкиРЕПО,   
						|ТипТребованияОбязательства,  
						|ТребованияИлиОбязательства,
					    |ИнвестиционныйПрофиль,
						|УровеньРиска" , "КоличествоАктиваТребованияОбязательства, СтоимостнаяОценкаНаОтчетнуюДату");
	
КонецПроцедуры   

Процедура ПредварительныеДанныеПоВалютнымСделкам(ОтчетОбъект, МВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст =  
		"ВЫБРАТЬ
		|	ОбязательстваПоДСОстатки.ДоговорДУ КАК ДоговорДУ,
		|	ОбязательстваПоДСОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
		|	ОбязательстваПоДСОстатки.Валюта КАК ВалютаКод,
		|	ОбязательстваПоДСОстатки.Основание КАК Основание,
		|	ОбязательстваПоДСОстатки.АналитическийСчет КАК АналитическийСчет
		|ПОМЕСТИТЬ ВТ_ОстаткиОбязательствНаВалРынке
		|ИЗ
		|	РегистрНакопления.ОбязательстваПоДС.Остатки(
		|			&КонецПериода,
		|			Основание ССЫЛКА Документ.СделкаНаВалютномРынке
		|				И Основание.РежимТоргов В (&РежимыТоргов)
		|				И ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						втДоговорыДУ_Раздел7 КАК ДоговорыДУ)) КАК ОбязательстваПоДСОстатки
		|ГДЕ
		|	ОбязательстваПоДСОстатки.ВалютнаяСуммаОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОбязательстваПоДС.ДоговорДУ КАК ДоговорДУ,
		|	ОбязательстваПоДС.АналитическийСчет КАК АналитическийСчет,
		|	ОбязательстваПоДС.Валюта КАК Валюта,
		|	ОбязательстваПоДС.Основание КАК Основание,
		|	ОбязательстваПоДС.ВалютнаяСумма КАК ВалютнаяСумма
		|ПОМЕСТИТЬ ВТ_ОткрытыеОбязательстваНаВалРынке
		|ИЗ
		|	РегистрНакопления.ОбязательстваПоДС КАК ОбязательстваПоДС
		|ГДЕ
		|	ОбязательстваПоДС.Основание В
		|			(ВЫБРАТЬ
		|				ВТ.Основание
		|			ИЗ
		|				ВТ_ОстаткиОбязательствНаВалРынке КАК ВТ)
		|	И (ОбязательстваПоДС.Основание.СуммаВБазовойВалюте = ОбязательстваПоДС.ВалютнаяСумма
		|			ИЛИ ОбязательстваПоДС.Основание.СуммаВВалютеРасчетов = ОбязательстваПоДС.ВалютнаяСумма)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОткрытыеОбязательстваНаВалРынке.ДоговорДУ КАК ДоговорДУ,
		|	ВТ_ОткрытыеОбязательстваНаВалРынке.АналитическийСчет КАК АналитическийСчет,
		|	ВТ_ОткрытыеОбязательстваНаВалРынке.Валюта.Код КАК Валюта,
		|	ВТ_ОткрытыеОбязательстваНаВалРынке.Основание КАК Основание,
		|	ВЫРАЗИТЬ(ВТ_ОткрытыеОбязательстваНаВалРынке.АналитическийСчет.СубъектМестаХранения КАК Справочник.Контрагенты) КАК Контрагент,
		|	ВТ_ОткрытыеОбязательстваНаВалРынке.ВалютнаяСумма КАК ВалютнаяСумма,
		|	ВТ_ОткрытыеОбязательстваНаВалРынке.Основание.СуммаВВалютеРасчетов КАК СуммаВВалютеРасчетов
		|ПОМЕСТИТЬ ВТ_ОбязательстваНаВалРынке
		|ИЗ
		|	ВТ_ОткрытыеОбязательстваНаВалРынке КАК ВТ_ОткрытыеОбязательстваНаВалРынке
		|ГДЕ
		|	ВТ_ОткрытыеОбязательстваНаВалРынке.ВалютнаяСумма <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТребованияПоДСОстатки.ДоговорДУ КАК ДоговорДУ,
		|	ТребованияПоДСОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
		|	ТребованияПоДСОстатки.Валюта КАК ВалютаКод,
		|	ТребованияПоДСОстатки.Основание КАК Основание,
		|	ТребованияПоДСОстатки.АналитическийСчет КАК АналитическийСчет
		|ПОМЕСТИТЬ ВТ_ОстаткиТребованийНаВалРынке
		|ИЗ
		|	РегистрНакопления.ТребованияПоДС.Остатки(
		|			&КонецПериода,
		|			Основание ССЫЛКА Документ.СделкаНаВалютномРынке
		|				И Основание.РежимТоргов В (&РежимыТоргов)
		|				И ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						втДоговорыДУ_Раздел7 КАК ДоговорыДУ)) КАК ТребованияПоДСОстатки
		|ГДЕ
		|	ТребованияПоДСОстатки.ВалютнаяСуммаОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТребованияПоДС.ДоговорДУ КАК ДоговорДУ,
		|	ТребованияПоДС.АналитическийСчет КАК АналитическийСчет,
		|	ТребованияПоДС.Валюта КАК Валюта,
		|	ТребованияПоДС.Основание КАК Основание,
		|	ТребованияПоДС.ВалютнаяСумма КАК ВалютнаяСумма
		|ПОМЕСТИТЬ ВТ_ОткрытыеТребованияНаВалРынке
		|ИЗ
		|	РегистрНакопления.ТребованияПоДС КАК ТребованияПоДС
		|ГДЕ
		|	ТребованияПоДС.Основание В
		|			(ВЫБРАТЬ
		|				ВТ.Основание
		|			ИЗ
		|				ВТ_ОстаткиТребованийНаВалРынке КАК ВТ)
		|	И (ТребованияПоДС.Основание.СуммаВБазовойВалюте = ТребованияПоДС.ВалютнаяСумма
		|			ИЛИ ТребованияПоДС.Основание.СуммаВВалютеРасчетов = ТребованияПоДС.ВалютнаяСумма)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОткрытыеТребованияНаВалРынке.ДоговорДУ КАК ДоговорДУ,
		|	ВТ_ОткрытыеТребованияНаВалРынке.АналитическийСчет КАК АналитическийСчет,
		|	ВТ_ОткрытыеТребованияНаВалРынке.Валюта.Код КАК Валюта,
		|	ВТ_ОткрытыеТребованияНаВалРынке.Основание КАК Основание,
		|	ВЫРАЗИТЬ(ВТ_ОткрытыеТребованияНаВалРынке.АналитическийСчет.СубъектМестаХранения КАК Справочник.Контрагенты) КАК Контрагент,
		|	ВТ_ОткрытыеТребованияНаВалРынке.ВалютнаяСумма КАК ВалютнаяСумма,
		|	ВТ_ОткрытыеТребованияНаВалРынке.Основание.СуммаВВалютеРасчетов КАК СуммаВВалютеРасчетов
		|ПОМЕСТИТЬ ВТ_ТребованияНаВалРынке
		|ИЗ
		|	ВТ_ОткрытыеТребованияНаВалРынке КАК ВТ_ОткрытыеТребованияНаВалРынке
		|ГДЕ
		|	ВТ_ОткрытыеТребованияНаВалРынке.ВалютнаяСумма <> 0";
	
	РежимыТоргов = Новый Массив;
	РежимыТоргов.Добавить(Перечисления.РежимТорговСделкаСВалютой.TOM);
	РежимыТоргов.Добавить(Перечисления.РежимТорговСделкаСВалютой.TMS);
	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОтчетОбъект.КонецПериода));
	Запрос.УстановитьПараметр("РежимыТоргов", РежимыТоргов);
	РезультатЗапроса = Запрос.Выполнить(); 
	
КонецПроцедуры	

Процедура ПредварительныеДанныеПоСделкамКромеРепо(ОтчетОбъект, МВТ)
    
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	Бух_Остатки.ДоговорДУ КАК ДоговорДУ,
	|	ВЫРАЗИТЬ(Бух_Остатки.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент
	|ПОМЕСТИТЬ ВТ_ДУПоСделкамКромеРЕПО
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыЦБПокупка)),
	|			&Субконто_Контрагенты,
	|			ДоговорДУ В
	|				(ВЫБРАТЬ
	|					ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
	|				ИЗ
	|					втДоговорыДУ_Раздел7 КАК ДоговорыДУ)) КАК Бух_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СведенияПоКлиентам КАК ПараметрыДУ
	|		ПО (ПараметрыДУ.ДоговорДУ = Бух_Остатки.ДоговорДУ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Бух_Остатки.ДоговорДУ КАК ДоговорДУ,
	|	ВЫРАЗИТЬ(Бух_Остатки.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Бух_Остатки.СуммаОстаток < 0
	|			ТОГДА ""К""
	|		ИНАЧЕ ""Д""
	|	КОНЕЦ КАК Задолженность,
	|	""Прочая"" КАК ТипДЗКЗ,
	|	ЛОЖЬ КАК ЦК,
	|	"""" КАК НаправлениеРЕПО,
	|	Бух_Остатки.СуммаОстаток * ВЫБОР
	|		КОГДА ЕСТЬNULL(ПараметрыДУ.ОбособленныйУчетЗадолженностиЭмитента, ЛОЖЬ) = ИСТИНА
	|				И Бух_Остатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям_ПогашениеТела))
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Бух_Остатки.СуммаОстаток < 0
	|					ТОГДА -1
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|	КОНЕЦ КАК Сумма,
	|	ЛОЖЬ КАК ЭтоНДФЛ,
	|	"""" КАК Актив,
	|	0 КАК КоличествоОстаток
	|ПОМЕСТИТЬ Итоги_БУ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоНачисленномуДоходу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеВзаиморасчеты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям_ПогашениеТела), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетВознаграждениеУКЗаУправление), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетВознаграждениеУКЗаУспех), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетВознаграждениеСД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВознаграждениеАудитора)),
	|			&Субконто_Контрагенты,
	|			ДоговорДУ В
	|				(ВЫБРАТЬ
	|					ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
	|				ИЗ
	|					втДоговорыДУ_Раздел7 КАК ДоговорыДУ)) КАК Бух_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СведенияПоКлиентам КАК ПараметрыДУ
	|		ПО (ПараметрыДУ.ДоговорДУ = Бух_Остатки.ДоговорДУ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Бух_Остатки.ДоговорДУ,
	|	ВЫРАЗИТЬ(Бух_Остатки.Субконто1 КАК Справочник.Контрагенты),
	|	ВЫБОР
	|		КОГДА Бух_Остатки.СуммаОстаток < 0
	|			ТОГДА ""К""
	|		ИНАЧЕ ""Д""
	|	КОНЕЦ,
	|	""По сделкам, кроме РЕПО"",
	|	ЛОЖЬ,
	|	"""",
	|	Бух_Остатки.СуммаОстаток * ВЫБОР
	|		КОГДА ЕСТЬNULL(ПараметрыДУ.ОбособленныйУчетЗадолженностиЭмитента, ЛОЖЬ) = ИСТИНА
	|				И Бух_Остатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям_ПогашениеТела))
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Бух_Остатки.СуммаОстаток < 0
	|					ТОГДА -1
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ВЫРАЗИТЬ(Бух_Остатки.Субконто1 КАК Справочник.Контрагенты),
	|	Бух_Остатки.СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыЦБПродажа), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БлокированиеДСПодСделку)),
	|			&Субконто_Контрагенты,
	|			ДоговорДУ В
	|				(ВЫБРАТЬ
	|					ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
	|				ИЗ
	|					втДоговорыДУ_Раздел7 КАК ДоговорыДУ)) КАК Бух_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СведенияПоКлиентам КАК ПараметрыДУ
	|		ПО (ПараметрыДУ.ДоговорДУ = Бух_Остатки.ДоговорДУ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Бух_Остатки.ДоговорДУ,
	|	ВЫРАЗИТЬ(Бух_Остатки.Субконто1 КАК Справочник.Контрагенты),
	|	ВЫБОР
	|		КОГДА Бух_Остатки.СуммаОстаток < 0
	|			ТОГДА ""К""
	|		ИНАЧЕ ""Д""
	|	КОНЕЦ,
	|	""По сделкам, кроме РЕПО"",
	|	ЛОЖЬ,
	|	"""",
	|	Бух_Остатки.СуммаОстаток * ВЫБОР
	|		КОГДА ЕСТЬNULL(ПараметрыДУ.ОбособленныйУчетЗадолженностиЭмитента, ЛОЖЬ) = ИСТИНА
	|				И Бух_Остатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям_ПогашениеТела))
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Бух_Остатки.СуммаОстаток < 0
	|					ТОГДА -1
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	Бух_Остатки.Субконто3.Актив,
	|	Бух_Остатки.Субконто3.Количество
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыЦБПокупка),
	|			,
	|			(ДоговорДУ, ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты)) В
	|					(ВЫБРАТЬ
	|						ВТ_ДУПоСделкамКромеРЕПО.ДоговорДУ КАК ДоговорДУ,
	|						ВТ_ДУПоСделкамКромеРЕПО.Контрагент КАК Контрагент
	|					ИЗ
	|						ВТ_ДУПоСделкамКромеРЕПО КАК ВТ_ДУПоСделкамКромеРЕПО)
	|				И (Субконто3 ССЫЛКА БизнесПроцесс.ВнебиржеваяСделка
	|					ИЛИ Субконто3 ССЫЛКА БизнесПроцесс.СделкиTn)) КАК Бух_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СведенияПоКлиентам КАК ПараметрыДУ
	|		ПО (ПараметрыДУ.ДоговорДУ = Бух_Остатки.ДоговорДУ)";	
	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОтчетОбъект.КонецПериода)); 
	Запрос.УстановитьПараметр("Субконто_Контрагенты", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты));
	РезультатЗапроса = Запрос.Выполнить();
	
КонецПроцедуры


Процедура ЗаполнитьРазделРеестрЦБ(ОтчетОбъект, МВТ)
	
	СписокКодовЦББезНоминала = Новый Соответствие;	
	СписокКодовЦББезНоминала.Вставить("DS1", "DS1 – депозитные сертификаты кредитных организаций–резидентов");
	СписокКодовЦББезНоминала.Вставить("DS2", "DS2 – депозитные сертификаты банков – нерезидентов");
	СписокКодовЦББезНоминала.Вставить("SS1", "SS1 – сберегательные сертификаты кредитных организаций–резидентов");
	СписокКодовЦББезНоминала.Вставить("SS2", "SS2 – сберегательные сертификаты банков – нерезидентов");
	СписокКодовЦББезНоминала.Вставить("SHS7","SHS7 – паи, доли инвестиционных фондов – нерезидентов");
	СписокКодовЦББезНоминала.Вставить("SHS8","SHS8 – паи, доли инвестиционных фондов – резидентов");
	СписокКодовЦББезНоминала.Вставить("DR", "DR – депозитарные расписки");
	СписокКодовЦББезНоминала.Вставить("CON", "CON – складское свидетельство");
	СписокКодовЦББезНоминала.Вставить("WTS", "WTS – варранты");
	СписокКодовЦББезНоминала.Вставить("OPN", "OPN – опционы эмитента");
	СписокКодовЦББезНоминала.Вставить("ENC", "ENC – закладные");
	СписокКодовЦББезНоминала.Вставить("OTHER","OTHER – иное (в том числе иностранные финансовые инструменты, не квалифицированные в качестве ценных бумаг)");
	СписокКодовЦББезНоминала.Вставить("ISU","ISU – ипотечные сертификаты участия");
	
	СписокВидовКСУ = Новый Массив;
	СписокВидовКСУ.Добавить(ПланыВидовХарактеристик.ВидыАктивов.КСУ_GC_Bonds);
	СписокВидовКСУ.Добавить(ПланыВидовХарактеристик.ВидыАктивов.КСУ_OFZ);
	СписокВидовКСУ.Добавить(ПланыВидовХарактеристик.ВидыАктивов.КСУ_Акции);
	СписокВидовКСУ.Добавить(ПланыВидовХарактеристик.ВидыАктивов.КСУ_Все);
	СписокВидовКСУ.Добавить(ПланыВидовХарактеристик.ВидыАктивов.КСУ_Мтл);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияПрофучастника.ИНН,
		|	СведенияПрофучастника.НаименованиеСокращенное
		|ИЗ
		|	РегистрСведений.СведенияПрофучастника КАК СведенияПрофучастника";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СправочникПрофучастника = РезультатЗапроса.Выгрузить();
	СправочникПрофучастника.Индексы.Добавить("ИНН");

#Область _Запрос	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("ТЗсписокКлиентов", ТЗсписокКлиентов);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокированныеЦБСрезПоследних.ДоговорДУ КАК ДоговорДУ,
		|	БлокированныеЦБСрезПоследних.СчетДЕПО КАК СчетДЕПО,
		|	БлокированныеЦБСрезПоследних.Актив КАК Актив,
		|	БлокированныеЦБСрезПоследних.ТипБлокировки КАК ТипБлокировки,
		|	БлокированныеЦБСрезПоследних.Количество КАК Количество,
		|	БлокированныеЦБСрезПоследних.Разблокированы КАК Разблокированы,
		|	БлокированныеЦБСрезПоследних.ДатаРазблокировки КАК ДатаРазблокировки,
		|	БлокированныеЦБСрезПоследних.Разблокированы = ЛОЖЬ
		|		ИЛИ БлокированныеЦБСрезПоследних.Разблокированы = ИСТИНА
		|			И БлокированныеЦБСрезПоследних.ДатаРазблокировки > &КонецОтчета КАК Действующие
		|ПОМЕСТИТЬ ВТ_БлокированныеЦБ
		|ИЗ
		|	РегистрСведений.БлокированныеЦБ.СрезПоследних(
		|			&КонецПериода,
		|			ДоговорДУ.УправляющаяКомпания = &УправляющаяКомпания
		|				И ДоговорДУ.ПометкаУдаления = ЛОЖЬ
		|				И ДоговорДУ.ТипКлиентаДУ В (&ТипыКлиентов)
		//
		|	и ДоговорДУ.Клиент В(&ТЗсписокКлиентов)						
		//
		|) КАК БлокированныеЦБСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.ДоговорДУ КАК ДоговорДУ,
		|	ХозрасчетныйОстатки.ДоговорДУ.ТипКлиентаДУ КАК ТипКлиентаДУ,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.АналитическиеСчета).МестоХранения.СчетВРегистраторе КАК АналитическийСчет,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.АналитическиеСчета).МестоХранения КАК МестоХранения,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.АналитическиеСчета).МестоХранения.Владелец КАК Депозитарий,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.АналитическиеСчета).МестоХранения.СчетВРегистраторе КАК СчетВРегистраторе,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Активы) КАК Актив,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Активы).Объект КАК АктивОбъект,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстатки.ДоговорДУ.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.СобственныеСредстваУК)
		|			ТОГДА ХозрасчетныйОстатки.КоличествоОстатокДт
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоВсего,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстатки.ДоговорДУ.ТипКлиентаДУ В (&ТипыКлиентов)
		|			ТОГДА ХозрасчетныйОстатки.КоличествоОстатокДт
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоИныеСчетаДУ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_БлокированныеЦБ.Действующие, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ВТ_БлокированныеЦБ.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЗаблокированныеЦБ_КоличествоВсего,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_БлокированныеЦБ.Действующие, ЛОЖЬ) = ИСТИНА
		|				И ЕСТЬNULL(ВТ_БлокированныеЦБ.ТипБлокировки, ЗНАЧЕНИЕ(Перечисление.ТипыБлокировкиЦБ.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыБлокировкиЦБ.БлокированоДляКорпоративныхДействий)
		|			ТОГДА ВТ_БлокированныеЦБ.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЗаблокированныеЦБ_КоличествоКорпДействия,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_БлокированныеЦБ.Действующие, ЛОЖЬ) = ИСТИНА
		|				И ЕСТЬNULL(ВТ_БлокированныеЦБ.ТипБлокировки, ЗНАЧЕНИЕ(Перечисление.ТипыБлокировкиЦБ.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыБлокировкиЦБ.БлокированоДляИсполненияАктовПредписанийОргановГосВласти)
		|			ТОГДА ВТ_БлокированныеЦБ.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЗаблокированныеЦБ_КоличествоЗапретОпераций,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_БлокированныеЦБ.Действующие, ЛОЖЬ) = ИСТИНА
		|				И ЕСТЬNULL(ВТ_БлокированныеЦБ.ТипБлокировки, ЗНАЧЕНИЕ(Перечисление.ТипыБлокировкиЦБ.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыБлокировкиЦБ.БлокированоПоАресту)
		|			ТОГДА ВТ_БлокированныеЦБ.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЗаблокированныеЦБ_КоличествоПодАрестом,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Активы).Объект.ФормаСуществования = ЗНАЧЕНИЕ(Перечисление.ФормаСуществования.Документарная)
		|			ТОГДА ХозрасчетныйОстатки.КоличествоОстатокДт
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПереданныеВДУ,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Активы).ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.ПаиПИФ)
		|				ИЛИ ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Активы).Объект.ФормаСуществования = ЗНАЧЕНИЕ(Перечисление.ФормаСуществования.Бездокументарная)
		|			ТОГДА ХозрасчетныйОстатки.КоличествоОстатокДт
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПраваПереданныеВДУ,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстатки.ДоговорДУ.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.СобственныеСредстваУК)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Собственные
		|ПОМЕСТИТЬ ВТ_ЦБСАналитикой
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&КонецПериода,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВУЦБ),
		|			,
		|			ДоговорДУ.УправляющаяКомпания = &УправляющаяКомпания
		//
		|	и ДоговорДУ.Клиент В(&ТЗсписокКлиентов)						
		//
		
		|				И ДоговорДУ.ПометкаУдаления = ЛОЖЬ
		|				И (ДоговорДУ.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.СобственныеСредстваУК)
		|					ИЛИ ДоговорДУ.ТипКлиентаДУ В (&ТипыКлиентов))
		|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.АналитическиеСчета).ВидАналитическогоСчета = ЗНАЧЕНИЕ(Перечисление.ВидыАналитическогоСчета.ЦенныеБумаги)) КАК ХозрасчетныйОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БлокированныеЦБ КАК ВТ_БлокированныеЦБ
		|		ПО ХозрасчетныйОстатки.ДоговорДУ = ВТ_БлокированныеЦБ.ДоговорДУ
		|			И (ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.АналитическиеСчета).МестоХранения = ВТ_БлокированныеЦБ.СчетДЕПО)
		|			И ХозрасчетныйОстатки.Субконто2 = ВТ_БлокированныеЦБ.Актив
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Бух_Остатки.ДоговорДУ,
		|	Бух_Остатки.ДоговорДУ.ТипКлиентаДУ,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.),
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ВЫРАЗИТЬ(Бух_Остатки.Субконто3.Актив КАК Справочник.Активы),
		|	ВЫРАЗИТЬ(Бух_Остатки.Субконто3.Актив КАК Справочник.Активы).Объект,
		|	ВЫБОР
		|		КОГДА Бух_Остатки.ДоговорДУ.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.СобственныеСредстваУК)
		|			ТОГДА Бух_Остатки.Субконто3.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Бух_Остатки.ДоговорДУ.ТипКлиентаДУ В (&ТипыКлиентов)
		|			ТОГДА Бух_Остатки.Субконто3.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	Бух_Остатки.Субконто3.Количество,
		|	Бух_Остатки.Субконто3.Количество,
		|	Бух_Остатки.Субконто3.Количество,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА Бух_Остатки.ДоговорДУ.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.СобственныеСредстваУК)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыЦБПокупка),
		|			,
		|			(ДоговорДУ, ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты)) В
		|					(ВЫБРАТЬ
		|						ВТ_ДУПоСделкамКромеРЕПО.ДоговорДУ КАК ДоговорДУ,
		|						ВТ_ДУПоСделкамКромеРЕПО.Контрагент КАК Контрагент
		|					ИЗ
		|						ВТ_ДУПоСделкамКромеРЕПО КАК ВТ_ДУПоСделкамКромеРЕПО)
		|				И (Субконто3 ССЫЛКА БизнесПроцесс.ВнебиржеваяСделка
		|					ИЛИ Субконто3 ССЫЛКА БизнесПроцесс.СделкиTn)) КАК Бух_Остатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЦБСАналитикой.Депозитарий КАК Депозитарий,
		|	ВТ_ЦБСАналитикой.СчетВРегистраторе КАК СчетВРегистраторе,
		|	ВТ_ЦБСАналитикой.Актив КАК Актив,
		|	ВТ_ЦБСАналитикой.АктивОбъект КАК АктивОбъект,
		|	СУММА(ВТ_ЦБСАналитикой.КоличествоВсего) КАК КоличествоВсего,
		|	СУММА(ВТ_ЦБСАналитикой.КоличествоИныеСчетаДУ) КАК КоличествоИныеСчетаДУ,
		|	СУММА(ВТ_ЦБСАналитикой.ЗаблокированныеЦБ_КоличествоВсего) КАК ЗаблокированныеЦБ_КоличествоВсего,
		|	СУММА(ВТ_ЦБСАналитикой.ЗаблокированныеЦБ_КоличествоКорпДействия) КАК ЗаблокированныеЦБ_КоличествоКорпДействия,
		|	СУММА(ВТ_ЦБСАналитикой.ЗаблокированныеЦБ_КоличествоЗапретОпераций) КАК ЗаблокированныеЦБ_КоличествоЗапретОпераций,
		|	СУММА(ВТ_ЦБСАналитикой.ЗаблокированныеЦБ_КоличествоПодАрестом) КАК ЗаблокированныеЦБ_КоличествоПодАрестом,
		|	ВТ_ЦБСАналитикой.Собственные КАК Собственные
		|ПОМЕСТИТЬ ВТ_СписокЦБ
		|ИЗ
		|	ВТ_ЦБСАналитикой КАК ВТ_ЦБСАналитикой
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЦБСАналитикой.Депозитарий,
		|	ВТ_ЦБСАналитикой.СчетВРегистраторе,
		|	ВТ_ЦБСАналитикой.Актив,
		|	ВТ_ЦБСАналитикой.АктивОбъект,
		|	ВТ_ЦБСАналитикой.Собственные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1 КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА ВТ_СписокЦБ.Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.ПаиПИФ)
		|			ТОГДА ВТ_СписокЦБ.АктивОбъект.Эмитент.Наименование
		|		КОГДА ВТ_СписокЦБ.Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.Векселя)
		|				И ВТ_СписокЦБ.АктивОбъект.Векселедатель.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
		|			ТОГДА ВТ_СписокЦБ.АктивОбъект.Векселедатель.НаименованиеСокращенное
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.НаименованиеСокращенное, ""#"")
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.Эмитент.НаименованиеСокращенное, """") <> """"
		|			ТОГДА ВТ_СписокЦБ.АктивОбъект.Эмитент.НаименованиеСокращенное
		|		ИНАЧЕ ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.Эмитент.Наименование, ""#"")
		|	КОНЕЦ КАК ЭмитентНаименование,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.ИНН, """") <> """"
		|						ТОГДА ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.ИНН
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.НеРезидент, ЛОЖЬ) = ИСТИНА
		|								ТОГДА ВЫБОР
		|										КОГДА ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
		|											ТОГДА ""000""
		|										ИНАЧЕ ""00000""
		|									КОНЕЦ
		|							ИНАЧЕ ВЫБОР
		|									КОГДА ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
		|										ТОГДА ""0000000000""
		|									ИНАЧЕ ""000000000000""
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.Эмитент.ИНН, """") <> """"
		|					ТОГДА ВТ_СписокЦБ.АктивОбъект.Эмитент.ИНН
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.Эмитент.НеРезидент, ЛОЖЬ) = ИСТИНА
		|							ТОГДА ВЫБОР
		|									КОГДА ВТ_СписокЦБ.АктивОбъект.Эмитент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
		|										ТОГДА ""000""
		|									ИНАЧЕ ""00000""
		|								КОНЕЦ
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВТ_СписокЦБ.АктивОбъект.Эмитент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
		|									ТОГДА ""0000000000""
		|								ИНАЧЕ ""000000000000""
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ЭмитентИНН,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.ОГРН, ""#"")
		|		ИНАЧЕ ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.Эмитент.ОГРН, ""#"")
		|	КОНЕЦ КАК ЭмитентОГРН,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.НеРезидент, ЛОЖЬ) = ЛОЖЬ
		|						ТОГДА ""643""
		|					ИНАЧЕ ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.Страна.Код
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.Эмитент.НеРезидент, ЛОЖЬ) = ЛОЖЬ
		|					ТОГДА ""643""
		|				ИНАЧЕ ВТ_СписокЦБ.АктивОбъект.Эмитент.Страна.Код
		|			КОНЕЦ
		|	КОНЕЦ КАК ЭмитентКодСтраны,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.КодТипаЦБ, """") <> """"
		|			ТОГДА ВТ_СписокЦБ.АктивОбъект.КодТипаЦБ
		|		ИНАЧЕ ""#""
		|	КОНЕЦ КАК КодТипаЦБ,
		|	ВЫБОР
		|		КОГДА ВТ_СписокЦБ.Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.ПаиПИФ)
		|			ТОГДА ВТ_СписокЦБ.АктивОбъект.РегНомерПравилФонда
		|		ИНАЧЕ ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.НомерГосРегистрацииВыпуска, """")
		|	КОНЕЦ КАК НомерГосРегистрацииВыпуска,
		|	ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ISIN, """") КАК ISIN,
		|	ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.CFI, """") КАК CFI,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|				ИЛИ ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БезНоминала, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ""#""
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ВалютаНоминальнойСтоимости.Код, """") <> """"
		|			ТОГДА ВТ_СписокЦБ.АктивОбъект.ВалютаНоминальнойСтоимости.Код
		|		ИНАЧЕ ""#""
		|	КОНЕЦ КАК КодВалютыЦБ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.НоминальнаяСтоимость, 0)
		|	КОНЕЦ КАК НоминальнаяСтоимость,
		|	СУММА(ВТ_СписокЦБ.КоличествоВсего + ВТ_СписокЦБ.КоличествоИныеСчетаДУ) КАК КоличествоВсего,
		|	СУММА(ВТ_СписокЦБ.КоличествоВсего) КАК КоличествоВСобственностиВсего,
		|	СУММА(ВТ_СписокЦБ.КоличествоВсего) КАК КоличествоБУ,
		|	СУММА(0) КАК КоличествоРЕПО,
		|	СУММА(0) КАК КоличествоЗаем,
		|	СУММА(0) КАК КоличествоОтсутствуютОбязательства,
		|	СУММА(0) КАК КоличествоБезнадежныеДолги,
		|	СУММА(0) КАК КоличествоОшибочнноЗачисленные,
		|	СУММА(0) КАК КоличествоДругие,
		|	СУММА(ВТ_СписокЦБ.КоличествоИныеСчетаДУ) КАК КоличествоИныеСчетаДУ,
		|	СУММА(0) КАК КоличествоИныеКазначейскиеСчета,
		|	СУММА(0) КАК КоличествоИныеСчетаЗалогодержателя,
		|	СУММА(0) КАК КоличествоИныеЭмиссионныеСчета,
		|	ЕСТЬNULL(ВТ_СписокЦБ.Депозитарий.Наименование, ""#"") КАК ДепозитарийНаименование,
		|	ВЫБОР
		|		КОГДА ВТ_СписокЦБ.СчетВРегистраторе = ИСТИНА
		|			ТОГДА ""Р""
		|		КОГДА ВТ_СписокЦБ.Депозитарий.НеРезидент = ИСТИНА
		|			ТОГДА ""И""
		|		КОГДА ВТ_СписокЦБ.Депозитарий.Депозитарий = ИСТИНА
		|				И ВТ_СписокЦБ.Депозитарий.Банк = ИСТИНА
		|			ТОГДА ""К""
		|		КОГДА ВТ_СписокЦБ.Депозитарий.Депозитарий = ИСТИНА
		|			ТОГДА ""Н""
		|		КОГДА ВТ_СписокЦБ.Депозитарий.Эмитент = ИСТИНА
		|			ТОГДА ""Э""
		|		ИНАЧЕ ""#""
		|	КОНЕЦ КАК ДепозитарийПризнак,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.Депозитарий.ИНН, """") <> """"
		|			ТОГДА ВТ_СписокЦБ.Депозитарий.ИНН
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(ВТ_СписокЦБ.Депозитарий.НеРезидент, ИСТИНА) = ИСТИНА
		|					ТОГДА ""000""
		|				ИНАЧЕ ""0000000000""
		|			КОНЕЦ
		|	КОНЕЦ КАК ДепозитарийИНН,
		|	ЕСТЬNULL(ВТ_СписокЦБ.Депозитарий.ОГРН, ""#"") КАК ДепозитарийОГРН,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.Депозитарий.НеРезидент, ЛОЖЬ) = ЛОЖЬ
		|			ТОГДА ""643""
		|		ИНАЧЕ ВТ_СписокЦБ.Депозитарий.Страна.Код
		|	КОНЕЦ КАК ДепозитарийКодСтраны,
		|	ВТ_СписокЦБ.ЗаблокированныеЦБ_КоличествоВсего КАК ЗаблокированныеЦБ_КоличествоВсего,
		|	ВТ_СписокЦБ.ЗаблокированныеЦБ_КоличествоКорпДействия КАК ЗаблокированныеЦБ_КоличествоКорпДействия,
		|	ВТ_СписокЦБ.ЗаблокированныеЦБ_КоличествоЗапретОпераций КАК ЗаблокированныеЦБ_КоличествоЗапретОпераций,
		|	ВТ_СписокЦБ.ЗаблокированныеЦБ_КоличествоПодАрестом КАК ЗаблокированныеЦБ_КоличествоПодАрестом,
		|	ВЫРАЗИТЬ(ВТ_СписокЦБ.АктивОбъект КАК Справочник.Облигации).Амортизационная КАК Амортизационная,
		|	ВЫРАЗИТЬ(ВТ_СписокЦБ.АктивОбъект КАК Справочник.Облигации).ИндексируемыйНоминал КАК ИндексируемыйНоминал,
		|	ВТ_СписокЦБ.АктивОбъект КАК АктивОбъект,
		|	ВТ_СписокЦБ.Актив.Наименование КАК АктивНаименование,
		|	ВТ_СписокЦБ.Актив.ВидАктива КАК ВидАктива,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.НомерГосРегистрацииВыпуска, ""#"")
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК БазовыйАктив_НомерГосРегистрацииВыпуска,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.ISIN, ""#"")
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК БазовыйАктив_ISIN,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.CFI, ""#"")
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК БазовыйАктив_CFI,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив) = ТИП(Справочник.Акции)
		|						ТОГДА ""Акции""
		|					КОГДА ТИПЗНАЧЕНИЯ(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив) = ТИП(Справочник.Облигации)
		|						ТОГДА ""Облигации""
		|					КОГДА ТИПЗНАЧЕНИЯ(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив) = ТИП(Справочник.ПаиПИФ)
		|						ТОГДА ""Паи""
		|					ИНАЧЕ ""Иное""
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДепРасписка_КлассБазовогоАктива,
		|	ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) КАК ДепРасписка
		|ИЗ
		|	ВТ_СписокЦБ КАК ВТ_СписокЦБ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.Депозитарий.ИНН, """") <> """"
		|			ТОГДА ВТ_СписокЦБ.Депозитарий.ИНН
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(ВТ_СписокЦБ.Депозитарий.НеРезидент, ИСТИНА) = ИСТИНА
		|					ТОГДА ""000""
		|				ИНАЧЕ ""0000000000""
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВТ_СписокЦБ.Депозитарий.Наименование, ""#""),
		|	ВЫРАЗИТЬ(ВТ_СписокЦБ.АктивОбъект КАК Справочник.Облигации).Амортизационная,
		|	ВЫРАЗИТЬ(ВТ_СписокЦБ.АктивОбъект КАК Справочник.Облигации).ИндексируемыйНоминал,
		|	ВТ_СписокЦБ.АктивОбъект,
		|	ЕСТЬNULL(ВТ_СписокЦБ.Депозитарий.ОГРН, ""#""),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.Депозитарий.НеРезидент, ЛОЖЬ) = ЛОЖЬ
		|			ТОГДА ""643""
		|		ИНАЧЕ ВТ_СписокЦБ.Депозитарий.Страна.Код
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.ИНН, """") <> """"
		|						ТОГДА ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.ИНН
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.НеРезидент, ЛОЖЬ) = ИСТИНА
		|								ТОГДА ВЫБОР
		|										КОГДА ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
		|											ТОГДА ""000""
		|										ИНАЧЕ ""00000""
		|									КОНЕЦ
		|							ИНАЧЕ ВЫБОР
		|									КОГДА ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
		|										ТОГДА ""0000000000""
		|									ИНАЧЕ ""000000000000""
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.Эмитент.ИНН, """") <> """"
		|					ТОГДА ВТ_СписокЦБ.АктивОбъект.Эмитент.ИНН
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.Эмитент.НеРезидент, ЛОЖЬ) = ИСТИНА
		|							ТОГДА ВЫБОР
		|									КОГДА ВТ_СписокЦБ.АктивОбъект.Эмитент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
		|										ТОГДА ""000""
		|									ИНАЧЕ ""00000""
		|								КОНЕЦ
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВТ_СписокЦБ.АктивОбъект.Эмитент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
		|									ТОГДА ""0000000000""
		|								ИНАЧЕ ""000000000000""
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_СписокЦБ.СчетВРегистраторе = ИСТИНА
		|			ТОГДА ""Р""
		|		КОГДА ВТ_СписокЦБ.Депозитарий.НеРезидент = ИСТИНА
		|			ТОГДА ""И""
		|		КОГДА ВТ_СписокЦБ.Депозитарий.Депозитарий = ИСТИНА
		|				И ВТ_СписокЦБ.Депозитарий.Банк = ИСТИНА
		|			ТОГДА ""К""
		|		КОГДА ВТ_СписокЦБ.Депозитарий.Депозитарий = ИСТИНА
		|			ТОГДА ""Н""
		|		КОГДА ВТ_СписокЦБ.Депозитарий.Эмитент = ИСТИНА
		|			ТОГДА ""Э""
		|		ИНАЧЕ ""#""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.ОГРН, ""#"")
		|		ИНАЧЕ ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.Эмитент.ОГРН, ""#"")
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.НеРезидент, ЛОЖЬ) = ЛОЖЬ
		|						ТОГДА ""643""
		|					ИНАЧЕ ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.Страна.Код
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.Эмитент.НеРезидент, ЛОЖЬ) = ЛОЖЬ
		|					ТОГДА ""643""
		|				ИНАЧЕ ВТ_СписокЦБ.АктивОбъект.Эмитент.Страна.Код
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.КодТипаЦБ, """") <> """"
		|			ТОГДА ВТ_СписокЦБ.АктивОбъект.КодТипаЦБ
		|		ИНАЧЕ ""#""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|				ИЛИ ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БезНоминала, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ""#""
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ВалютаНоминальнойСтоимости.Код, """") <> """"
		|			ТОГДА ВТ_СписокЦБ.АктивОбъект.ВалютаНоминальнойСтоимости.Код
		|		ИНАЧЕ ""#""
		|	КОНЕЦ,
		|	ВТ_СписокЦБ.ЗаблокированныеЦБ_КоличествоКорпДействия,
		|	ВТ_СписокЦБ.ЗаблокированныеЦБ_КоличествоЗапретОпераций,
		|	ВТ_СписокЦБ.ЗаблокированныеЦБ_КоличествоПодАрестом,
		|	ВТ_СписокЦБ.ЗаблокированныеЦБ_КоличествоВсего,
		|	ВТ_СписокЦБ.Актив.ВидАктива,
		|	ВТ_СписокЦБ.Актив.Наименование,
		|	ВЫБОР
		|		КОГДА ВТ_СписокЦБ.Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.ПаиПИФ)
		|			ТОГДА ВТ_СписокЦБ.АктивОбъект.Эмитент.Наименование
		|		КОГДА ВТ_СписокЦБ.Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.Векселя)
		|				И ВТ_СписокЦБ.АктивОбъект.Векселедатель.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
		|			ТОГДА ВТ_СписокЦБ.АктивОбъект.Векселедатель.НаименованиеСокращенное
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.Эмитент.НаименованиеСокращенное, ""#"")
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.Эмитент.НаименованиеСокращенное, """") <> """"
		|			ТОГДА ВТ_СписокЦБ.АктивОбъект.Эмитент.НаименованиеСокращенное
		|		ИНАЧЕ ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.Эмитент.Наименование, ""#"")
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.НомерГосРегистрацииВыпуска, ""#"")
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.ISIN, ""#"")
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив.CFI, ""#"")
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив) = ТИП(Справочник.Акции)
		|						ТОГДА ""Акции""
		|					КОГДА ТИПЗНАЧЕНИЯ(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив) = ТИП(Справочник.Облигации)
		|						ТОГДА ""Облигации""
		|					КОГДА ТИПЗНАЧЕНИЯ(ВТ_СписокЦБ.АктивОбъект.БазовыйАктив) = ТИП(Справочник.ПаиПИФ)
		|						ТОГДА ""Паи""
		|					ИНАЧЕ ""Иное""
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ISIN, """"),
		|	ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.CFI, """"),
		|	ВЫБОР
		|		КОГДА ВТ_СписокЦБ.Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.ПаиПИФ)
		|			ТОГДА ВТ_СписокЦБ.АктивОбъект.РегНомерПравилФонда
		|		ИНАЧЕ ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.НомерГосРегистрацииВыпуска, """")
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ) = ИСТИНА
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.НоминальнаяСтоимость, 0)
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВТ_СписокЦБ.АктивОбъект.ДепозитарнаяРасписка, ЛОЖЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭмитентНаименование";
	
	Запрос.УстановитьПараметр("КонецОтчета", НачалоДня(ОтчетОбъект.КонецПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОтчетОбъект.КонецПериода));
	Запрос.УстановитьПараметр("ТипыКлиентов", ТипыКлиентовДляРеестраЦБ());
	Запрос.УстановитьПараметр("УправляющаяКомпания", ОтчетОбъект.УправляющаяКомпания);

#КонецОбласти	
	
	ВыборкаДанных = Запрос.Выполнить().Выгрузить();
	Для Каждого ТекСтрока Из ВыборкаДанных Цикл 
		
		Если ВРег(ТекСтрока.КодТипаЦБ) = "SHS8" Тогда
			ИдентификаторЦБ = "000" + "_" + ?(ЗначениеЗаполнено(ТекСтрока.ISIN), ТекСтрока.ISIN, "000");	
			ИдентификаторЦБ = ИдентификаторЦБ + "_" + ?(ЗначениеЗаполнено(ТекСтрока.CFI), ТекСтрока.CFI, "000");
			ИдентификаторЦБ = ИдентификаторЦБ + "_" + ?(ЗначениеЗаполнено(ТекСтрока.НомерГосРегистрацииВыпуска), ТекСтрока.НомерГосРегистрацииВыпуска, "000");	
		Иначе
			ИдентификаторЦБ = ?(ЗначениеЗаполнено(ТекСтрока.НомерГосРегистрацииВыпуска), ТекСтрока.НомерГосРегистрацииВыпуска, "000"); 
			ИдентификаторЦБ = ИдентификаторЦБ + "_" + ?(ЗначениеЗаполнено(ТекСтрока.ISIN), ТекСтрока.ISIN, "000"); 
			ИдентификаторЦБ = ИдентификаторЦБ + "_" + ?(ЗначениеЗаполнено(ТекСтрока.CFI), ТекСтрока.CFI, "000"); 
		КонецЕсли;
		
		Если ОтчетОбъект.РеестрЦенныхБумаг.Найти(ИдентификаторЦБ, "ИдентификаторЦБ") = Неопределено Тогда
			
			Если ТекСтрока.Амортизационная = Истина ИЛИ ТекСтрока.ИндексируемыйНоминал = Истина Тогда
				ТекСтрока.НоминальнаяСтоимость = Справочники.Облигации.ПолучитьНоминальнуюСтоимость(ТекСтрока.АктивОбъект, КонецДня(ОтчетОбъект.КонецПериода));
			КонецЕсли;
	
			НоваяСтрока = ОтчетОбъект.РеестрЦенныхБумаг.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока); 
			
			НоваяСтрока.ИдентификаторЦБ = ИдентификаторЦБ;
			
			НайденныйКод = СписокКодовЦББезНоминала.Получить(НоваяСтрока.КодТипаЦБ);
			Если НайденныйКод <> Неопределено Тогда
				НоваяСтрока.КодВалютыЦБ = "#";
				НоваяСтрока.НоминальнаяСтоимость = 0;
			КонецЕсли;
		
			// Ищем сокр. наименование по ИНН в справочнике профучастников
			НайденнаяСтрока = СправочникПрофучастника.Найти(СокрЛП(ТекСтрока.ЭмитентИНН), "ИНН");
			Если НайденнаяСтрока <> Неопределено Тогда
				НоваяСтрока.ЭмитентНаименование = НайденнаяСтрока.НаименованиеСокращенное;
			КонецЕсли;
				
			Если ТипЗнч(ТекСтрока.АктивОбъект) = Тип("СправочникСсылка.ПаиПИФ")	ИЛИ СписокВидовКСУ.Найти(ТекСтрока.ВидАктива) <> Неопределено Тогда
				НоваяСтрока.ЭмитентНаименование = НоваяСтрока.ЭмитентНаименование + " (" + ТекСтрока.АктивНаименование + ")";
			КонецЕсли;
			
			Если ТекСтрока.ДепРасписка Тогда
				ИдентификаторДепРасписки = ?(ЗначениеЗаполнено(ТекСтрока.БазовыйАктив_НомерГосРегистрацииВыпуска), ТекСтрока.БазовыйАктив_НомерГосРегистрацииВыпуска, "000"); 
				ИдентификаторДепРасписки = ИдентификаторДепРасписки + "_" + ?(ЗначениеЗаполнено(ТекСтрока.БазовыйАктив_ISIN), ТекСтрока.БазовыйАктив_ISIN, "000"); 
				ИдентификаторДепРасписки = ИдентификаторДепРасписки + "_" + ?(ЗначениеЗаполнено(ТекСтрока.БазовыйАктив_CFI), ТекСтрока.БазовыйАктив_CFI, "000"); 
				НоваяСтрока.ДепРасписка_ИдентификаторЦББазовогоАктива = ИдентификаторДепРасписки;

				НоваяСтрокаДеп = ОтчетОбъект.РеестрЦенныхБумаг.Добавить();
				НоваяСтрокаДеп.ИдентификаторЦБ = ИдентификаторДепРасписки;
				НоваяСтрокаДеп.ЭмитентНаименование = НоваяСтрока.ЭмитентНаименование;
				НоваяСтрокаДеп.ЭмитентИНН = НоваяСтрока.ЭмитентИНН;
				НоваяСтрокаДеп.ЭмитентОГРН = НоваяСтрока.ЭмитентОГРН;
				НоваяСтрокаДеп.ЭмитентКодСтраны = НоваяСтрока.ЭмитентКодСтраны;
				НоваяСтрокаДеп.ЭмитентМестоНахождения = НоваяСтрока.ЭмитентМестоНахождения;
				НоваяСтрокаДеп.ЭмитентНомерТелефона = НоваяСтрока.ЭмитентНомерТелефона;
				НоваяСтрокаДеп.ФИОЛицаЕдиноличногоИсполнительногоОргана = НоваяСтрока.ФИОЛицаЕдиноличногоИсполнительногоОргана;
				НоваяСтрокаДеп.КодТипаЦБ = ТекСтрока.АктивОбъект.БазовыйАктив.КодТипаЦБ;
				НоваяСтрокаДеп.НомерГосРегистрацииВыпуска = ТекСтрока.БазовыйАктив_НомерГосРегистрацииВыпуска;
				НоваяСтрокаДеп.ISIN = ТекСтрока.БазовыйАктив_ISIN;
				НоваяСтрокаДеп.CFI = ТекСтрока.БазовыйАктив_CFI;
				НоваяСтрокаДеп.КодВалютыЦБ = ТекСтрока.АктивОбъект.БазовыйАктив.ВалютаНоминальнойСтоимости.Код;
				НоваяСтрокаДеп.НоминальнаяСтоимость = ТекСтрока.АктивОбъект.БазовыйАктив.НоминальнаяСтоимость;

			КонецЕсли;
		
		КонецЕсли;	
			
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьРежимыТоргов_РЕПОЦК()
	Перем МассивРежимов;
	
	МассивРежимов = Новый Массив();
	МассивРежимов.Добавить("EQRP");
	МассивРежимов.Добавить("EQWP");
	МассивРежимов.Добавить("EQMP");
	МассивРежимов.Добавить("EQTP");
	МассивРежимов.Добавить("EQRD");
	МассивРежимов.Добавить("EQWD");
	МассивРежимов.Добавить("EQMD");
	МассивРежимов.Добавить("EQTD");
	МассивРежимов.Добавить("EQRE");
	МассивРежимов.Добавить("EQWE");
	МассивРежимов.Добавить("EQME");
	МассивРежимов.Добавить("EQTE");
	МассивРежимов.Добавить("EQRY");
	МассивРежимов.Добавить("PSRP");
	МассивРежимов.Добавить("PSRD");
	МассивРежимов.Добавить("PSRE");
	МассивРежимов.Добавить("PSRY");
	
	Возврат МассивРежимов;
КонецФункции

Процедура ЗаполнитьРаздел_5(ОтчетОбъект, МВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Активы).Объект КАК ЦеннаяБумага,
		|	СтоимостьАктивовУправленческийОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	СтоимостьАктивовУправленческийОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ХозрасчетныйОстатки.ДоговорДУ КАК ДоговорДУ,
		|	ХозрасчетныйОстатки.Субконто2.Объект.НомерГосРегистрацииВыпуска КАК НомерГосРег,
		|	ХозрасчетныйОстатки.Субконто2.Объект.ISIN КАК ISIN,
		|	ХозрасчетныйОстатки.Субконто2.Объект.CFI КАК CFI,
		|	ХозрасчетныйОстатки.Субконто2.Объект.КодТипаЦБ КАК КодТипаЦБ
		|ПОМЕСТИТЬ ВТ_ЦБ
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&КонецПериода,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВУЦБ),
		|			,
		|			ДоговорДУ В
		|					(ВЫБРАТЬ
		|						ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|					ИЗ
		|						ВТ_ДействующиеДоговора КАК ДоговорыДУ)
		|				И Субконто2.Объект.КодТипаЦБ = ""OTHER""
		|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.АналитическиеСчета).ВидАналитическогоСчета = ЗНАЧЕНИЕ(Перечисление.ВидыАналитическогоСчета.ЦенныеБумаги)) КАК ХозрасчетныйОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьАктивовУправленческий.Остатки(
		|				&КонецПериода,
		|				ДоговорДУ В
		|						(ВЫБРАТЬ
		|							ДоговорыДУ.ДоговорДУ КАК ДоговорДУ
		|						ИЗ
		|							ВТ_ДействующиеДоговора КАК ДоговорыДУ)
		|					И Актив.Объект.КодТипаЦБ = ""OTHER"") КАК СтоимостьАктивовУправленческийОстатки
		|		ПО ХозрасчетныйОстатки.Субконто2 = СтоимостьАктивовУправленческийОстатки.Актив
		|			И ХозрасчетныйОстатки.ДоговорДУ = СтоимостьАктивовУправленческийОстатки.ДоговорДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора КАК КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента КАК СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ КАК КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент КАК НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента КАК КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС КАК ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента КАК ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ВидДеятельности КАК ВидДеятельности,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии + ""_"" + ВЫРАЗИТЬ(ВТ_СведенияПоКлиентам.ДоговорДУ КАК Справочник.ДоговорДУ).Код КАК ИдентификаторСтратегии,
		|	ВТ_ЦБ.НомерГосРег КАК НомерГосРег,
		|	ВТ_ЦБ.ISIN КАК ISIN,
		|	ВТ_ЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВТ_ЦБ.КоличествоОстаток КАК КоличествоЦенныхБумаг,
		|	ВТ_ЦБ.СуммаОстаток КАК СтоимостнаяОценкаНаОтчетнуюДату,
		|	ВТ_ЦБ.CFI КАК CFI,
		|	ВТ_СведенияПоКлиентам.ТипКлиента КАК ТипКлиента,
		|	""Прочее"" КАК ТипИмущества,
		|	ВТ_ЦБ.КодТипаЦБ КАК КодТипаЦБ,
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль КАК ИнвестиционныйПрофиль
		|ИЗ
		|	ВТ_СведенияПоКлиентам КАК ВТ_СведенияПоКлиентам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦБ КАК ВТ_ЦБ
		|		ПО ВТ_СведенияПоКлиентам.ДоговорДУ = ВТ_ЦБ.ДоговорДУ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.НеРезидент,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ВидДеятельности,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.ТипКлиента,
		|	ВТ_ЦБ.ЦеннаяБумага,
		|	ВТ_ЦБ.КоличествоОстаток,
		|	ВТ_ЦБ.ISIN,
		|	ВТ_ЦБ.CFI,
		|	ВТ_ЦБ.НомерГосРег,
		|	ВТ_ЦБ.СуммаОстаток,
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль,
		|	ВТ_ЦБ.КодТипаЦБ,
		|	ВТ_СведенияПоКлиентам.ДоговорДУ";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОтчетОбъект.КонецПериода));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		
		ИдентификаторЦБ = ?(ЗначениеЗаполнено(Выборка.НомерГосРег), Выборка.НомерГосРег, "000"); 
		ИдентификаторЦБ = ИдентификаторЦБ + "_" + ?(ЗначениеЗаполнено(Выборка.ISIN), Выборка.ISIN, "000"); 
		ИдентификаторЦБ = ИдентификаторЦБ + "_" + ?(ЗначениеЗаполнено(Выборка.CFI), Выборка.CFI, "000"); 	
	
		НоваяСтрока = ОтчетОбъект.Раздел5.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);  
		НоваяСтрока.ИдентификаторИногоИмущества = ИдентификаторЦБ; 
		НоваяСтрока.УровеньРиска = "Начальный (не присвоен)";		
	КонецЦикла;
	
КонецПроцедуры     

Процедура ЗаполнитьРаздел_6(ОтчетОбъект, МВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйОстаткиИОбороты.Счет КАК Счет,
		|	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК ПФИ,
		|	ХозрасчетныйОстаткиИОбороты.Субконто1.ПолныйКод КАК КодПрисвоенныйОрганизаторомТорговли,
		|	ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Субконто2,
		|	ХозрасчетныйОстаткиИОбороты.Субконто3 КАК Субконто3,
		|	ХозрасчетныйОстаткиИОбороты.ДоговорДУ КАК ДоговорДУ,
		|	ХозрасчетныйОстаткиИОбороты.Валюта КАК Валюта,
		|	ХозрасчетныйОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоПФИ,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.СрочныеКонтракты).ВидАктива = ЗНАЧЕНИЕ(планвидовхарактеристик.видыактивов.Опционы)
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.СрочныеКонтракты).Премиальный = ИСТИНА
		|						ТОГДА ОпционныеПремии.ВалютнаяСуммаОстаток
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОпционныеПремииСумма
		|ПОМЕСТИТЬ ВТ_СрочныеКонтракты
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(, &КонецПериода, , , Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВУОП), , Субконто1 ССЫЛКА Справочник.СрочныеКонтракты) КАК ХозрасчетныйОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОпционныеПремии.Остатки(&КонецПериода, ) КАК ОпционныеПремии
		|		ПО ХозрасчетныйОстаткиИОбороты.ДоговорДУ = ОпционныеПремии.ДоговорДУ
		|			И ХозрасчетныйОстаткиИОбороты.Субконто1 = ОпционныеПремии.Опцион
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СведенияПоКлиентам.КвалификацияИнвестора КАК КвалификацияИнвестора,
		|	ВТ_СведенияПоКлиентам.СтатусКлиента КАК СтатусКлиента,
		|	ВТ_СведенияПоКлиентам.КодПоОКАТОиОКСМ КАК КодПоОКАТОиОКСМ,
		|	ВТ_СведенияПоКлиентам.НеРезидент КАК НеРезидент,
		|	ВТ_СведенияПоКлиентам.КатегорияКлиента КАК КатегорияКлиента,
		|	ВТ_СведенияПоКлиентам.ПризнакИИС КАК ПризнакИИС,
		|	ВТ_СведенияПоКлиентам.ПравоИспользованияДСКлиента КАК ПравоИспользованияДСКлиента,
		|	ВТ_СведенияПоКлиентам.ВидДеятельности КАК ВидДеятельности,
		|	ВТ_СведенияПоКлиентам.ИдентификаторСтратегии + ""_"" + ВЫРАЗИТЬ(ВТ_СведенияПоКлиентам.ДоговорДУ КАК Справочник.ДоговорДУ).Код КАК ИдентификаторСтратегии,
		|	ВТ_СведенияПоКлиентам.ТипКлиента КАК ТипКлиента,
		|	ВТ_СрочныеКонтракты.КодПрисвоенныйОрганизаторомТорговли КАК КодПрисвоенныйОрганизаторомТорговли,
		|	ВТ_СрочныеКонтракты.ПФИ КАК ПФИ,
		|	ВТ_СрочныеКонтракты.КоличествоПФИ КАК КоличествоПФИ,
		|	ВЫБОР
		|		КОГДА ВТ_СрочныеКонтракты.КоличествоПФИ > 0
		|			ТОГДА ""Покупка""
		|		ИНАЧЕ ""Продажа""
		|	КОНЕЦ КАК НаправлениеСделки,
		|	ВТ_СрочныеКонтракты.ОпционныеПремииСумма КАК ОпционныеПремииСумма,
		|	ВТ_СведенияПоКлиентам.ИнвестиционныйПрофиль КАК ИнвестиционныйПрофиль,
		|	""На организованных торгах"" КАК МестоЗаключенияДоговораПФИ
		|ИЗ
		|	ВТ_СведенияПоКлиентам КАК ВТ_СведенияПоКлиентам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СрочныеКонтракты КАК ВТ_СрочныеКонтракты
		|		ПО ВТ_СведенияПоКлиентам.ДоговорДУ = ВТ_СрочныеКонтракты.ДоговорДУ";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОтчетОбъект.КонецПериода));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		ПФИ = Выборка.ПФИ;      
		
		Если ПФИ.ВидАктива = ПланыВидовХарактеристик.ВидыАктивов.Фьючерсы Тогда
			ВидПФИ = "фьючерс"; 
		ИначеЕсли ПФИ.ВидАктива = ПланыВидовХарактеристик.ВидыАктивов.Опционы Тогда
			ВидПФИ = "опцион";
		Иначе
			ВидПФИ = ПФИ.ВидАктива.Наименование;
		КонецЕсли;
		
		ОрганизаторТоргов = ?(ПФИ.БиржаЛистинга.Код = "ММВБ", "ПАО Московская Биржа", ПФИ.БиржаЛистинга.Наименование);
		
		НоваяСтрока = ОтчетОбъект.Раздел6.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.НаименованиеОрганизатораТорговли	=	ОрганизаторТоргов;
		НоваяСтрока.ИдентификаторПФИ 					=	ВидПФИ + "_" +  ПФИ.ПолныйКод;
		НоваяСтрока.НаименованиеПФИ                     =	ПФИ.ПолныйКод;
		НоваяСтрока.СтоимостьПФИ						=	Выборка.ОпционныеПремииСумма;
		НоваяСтрока.ВидПФИ = ВидПФИ;
		НоваяСтрока.УровеньРиска = "Начальный (не присвоен)";
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВСПОМОГАТЕЛЬНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ 

Функция КоличествоДнейВПериодеОтчёта(ДанныеДоходностиТабЗнач, КонецПериода)    
	
	ДнейВПериодеОтчёта = 0;
	
	Для Каждого СтрокаДанныеДоходности Из ДанныеДоходностиТабЗнач Цикл
		Если СтрокаДанныеДоходности.TWR_Бенчмарк <> 0 Тогда 
			ДнейВПериодеОтчёта = КалендарныеГрафикиПовтИсп.РазностьДатВКалендарныхДнях(СтрокаДанныеДоходности.Период, КонецПериода) +1;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ДнейВПериодеОтчёта;
	
КонецФункции

#КонецОбласти

// Получаем макет по имени
	ДвоичныеДанные = ПолучитьМакет("Макет");	 
	Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
	Текст = Новый ЧтениеТекста(Поток);
	Строка = Текст.Прочитать();
	ТЗсписокКлиентов = ЗначениеИзСтрокиВнутр(Строка).ВыгрузитьКолонку("Клиент");
	
	