&НаКлиенте
Процедура РеквизитыООПриИзменении(Элемент)
	Модифицированность	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыООПриАктивизацииЯчейки(Элемент)
	Если Элемент.ТекущийЭлемент.Имя = "РеквизитыООЗначение" Тогда
		Если Элемент.ТекущиеДанные.Тип = Новый ОписаниеТипов() Тогда
			Элемент.ТекущийЭлемент.ВыбиратьТип		= Истина;
		ИначеЕсли Элемент.ТекущиеДанные.Тип.Типы().Количество()>1 Тогда
			Элемент.ТекущийЭлемент.ВыбиратьТип		= Истина;
	        Элемент.ТекущийЭлемент.ОграничениеТипа	= Элемент.ТекущиеДанные.Тип;
		Иначе
			Элемент.ТекущийЭлемент.ВыбиратьТип		= Ложь;
			Элемент.ТекущийЭлемент.ОграничениеТипа	= Элемент.ТекущиеДанные.Тип;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	
	Если Элемент.Родитель.ТекущиеДанные.Тип = Новый ОписаниеТипов() Тогда
		Элемент.ВыбиратьТип		= Истина;
	ИначеЕсли Элемент.Родитель.ТекущиеДанные.Тип.Типы().Количество()>1 Тогда
		Элемент.ВыбиратьТип		= Истина;
        Элемент.ОграничениеТипа	= Элемент.Родитель.ТекущиеДанные.Тип;
	Иначе
		Элемент.ВыбиратьТип		= Ложь;
		Элемент.ОграничениеТипа	= Элемент.Родитель.ТекущиеДанные.Тип;
	КонецЕсли;
	
	СтандартнаяОбработка	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОбъектаПриИзменении(Элемент)
	Элемент.ВыбиратьТип		= Истина;
	Элемент.ОграничениеТипа	= Новый ОписаниеТипов();
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОбъектаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Не Элемент.ТекущийЭлемент = Неопределено Тогда
		Если Элемент.ТекущийЭлемент.Имя	= "Значение" Тогда
			РеквизитыОбъектаПриИзменении(Элемент.ТекущийЭлемент);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОбъектаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОбъектаПередУдалением(Элемент, Отказ)
	Отказ	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВыборОбъектовМетаданных" И Источник = УникальныйИдентификатор Тогда
		Запись.ОбъектМетаданных	= Параметр[0].Значение;
		ОбновитьОтображениеРеквизитовФормы();
		Если ОбъектМетаданныхИсходный <> Запись.ОбъектМетаданных Тогда
			Модифицированность	= Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектМетаданныхНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;

	ОбъектМетаданныхИсходный	= Запись.ОбъектМетаданных;
	
	ДоступныеМетаданные = Новый СписокЗначений;
	
	ДоступныеМетаданные.Добавить("Справочники");
	ДоступныеМетаданные.Добавить("Документы");
	ДоступныеМетаданные.Добавить("Отчеты");
	ДоступныеМетаданные.Добавить("Обработки");
	ДоступныеМетаданные.Добавить("БизнесПроцессы");
	ДоступныеМетаданные.Добавить("Задачи");

	Если Не Запись.ОбъектМетаданных = "<!!!НЕ ОПРЕДЕЛЕН!!!>" Тогда
		ИмяОбъектаМетаданных = Запись.ОбъектМетаданных;
	КонецЕсли;	
	
	СтруктураПараметров  = Новый Структура("КоллекцииВыбираемыхОбъектовМетаданных,УникальныйИдентификаторИсточник,ВыборЕдинственного,НачальноеЗначениеВыбора", 
										   ДоступныеМетаданные, УникальныйИдентификатор, Истина, ИмяОбъектаМетаданных);
	
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектовМетаданных", СтруктураПараметров, ЭтаФорма, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеРеквизитовФормы()
	
	Если НЕ Запись.ОбъектМетаданных	= "<!!!НЕ ОПРЕДЕЛЕН!!!>" Тогда
		Элементы.ГруппаНастройкиОбъекта.Видимость	= Истина;
		
		ЗаполнитьНастройкиОбъектаПоМетаданнымСервер();
		
	Иначе
		Элементы.ГруппаНастройкиОбъекта.Видимость	= Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Заполняем реквизиты при создании нового
	Если Не ЗначениеЗаполнено(Запись.ОбъектМетаданных) Тогда
		Запись.ОбъектМетаданных		= "<!!!НЕ ОПРЕДЕЛЕН!!!>";
    КонецЕсли;
	//---
	Если Запись.ОбъектМетаданных = "<!!!НЕ ОПРЕДЕЛЕН!!!>" Тогда
		Запись.Использование		= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбъектМетаданныхИсходный = Запись.ОбъектМетаданных;
	ОбновитьОтображениеРеквизитовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьНастройкиОбъектаПоМетаданнымСервер();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ОбъектМетаданных = "<!!!НЕ ОПРЕДЕЛЕН!!!>" Тогда
		ВызватьИсключение "Не указан объект настройки!";
		Отказ	= Истина;
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Настройка) Тогда
		ВызватьИсключение "Не указано имя настройки!";
		Отказ	= Истина;
	КонецЕсли; 
	// Запишем параметры настроен
	СоответствиеЗначения	= Новый Соответствие;
	// Общие реквизиты
	ТаблицаРеквизитов		= ДанныеФормыВЗначение(ЭтаФорма.РеквизитыОО, Тип("ТаблицаЗначений"));
	
	СоответствиеЗначения.Вставить("*Реквизиты*", ТаблицаРеквизитов);
	// Табличные части (реквизиты)
	Для Каждого РеквизитФормыИмя ИЗ ЭтаФорма.СписокИменТабличныхЧастей Цикл
		ТаблицаРО		= РеквизитФормыВЗначение(РеквизитФормыИмя.Значение, Тип("ТаблицаЗначений"));
		ТаблицаРОИмя	= СтрЗаменить(РеквизитФормыИмя.Значение,"ТЧ_", "");
		СоответствиеЗначения.Вставить(ТаблицаРОИмя, ТаблицаРО);
	КонецЦикла;
	//---
	ТекущийОбъект.Значения	= Новый ХранилищеЗначения(СоответствиеЗначения);
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьРеквизитыОбъекта(Команда=Неопределено, ЗадатьВопрос = Истина)
	
	Если ЗадатьВопрос Тогда
		Ответ	= Вопрос("Если есть старые настройки, то они будут очищены!
						|Перечитать данные?", РежимДиалогаВопрос.ДаНет);
	Иначе
		Ответ	= КодВозвратаДиалога.Да;
	КонецЕсли;
		
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОбъектМетаданныхИсходный	= "";
		ЗаполнитьНастройкиОбъектаПоМетаданнымСервер();
		Модифицированность	= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиОбъектаПоМетаданнымСервер()
	СчетчикТаблицРеквизитов	= 0;	// Максимум 15 таблиц реквизитов
	ТолькоОчистка			= Ложь;
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	// ЧИТАЕМ ДАННЫЕ ПО ОБЫЧНЫМ РЕКВИЗИТАМ И ТАБЛИЧНЫМ ЧАСТЯМ ОБЪЕКТА ОБРАБОТКИ/ОТЧЕТА ДЛЯ ЗАПОЛНЕНИЯ
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	ТекущаяЗапись			= РеквизитФормыВЗначение("Запись");
	
	Если ОбъектМетаданныхИсходный = Запись.ОбъектМетаданных Тогда
		СоответствиеЗначений	= ТекущаяЗапись.Значения.Получить();
	Иначе
		СоответствиеЗначений	= Неопределено;
	КонецЕсли;
	//---
	Если СоответствиеЗначений = Неопределено Тогда
		//---
		ОбъектМетаданных	= Метаданные.НайтиПоПолномуИмени(Запись.ОбъектМетаданных);
		Если ТипЗнч(ОбъектМетаданных) = Неопределено Тогда
			ТолькоОчистка	= Истина;
		Иначе
			//---
			// Инициируем необходимые объекты метаданных для нас
			МетаданныеОО_Реквизиты	= ОбъектМетаданных.Реквизиты;
			МетаданныеОО_ТЧ			= ОбъектМетаданных.ТабличныеЧасти;
			//---
			// Читаем данные о реквизитах объекта
			РеквизитыОО_Мета	= Новый ТаблицаЗначений;
			РеквизитыОО_Мета.Колонки.Добавить("ПроверкаЗаполнения");
			РеквизитыОО_Мета.Колонки.Добавить("ИД");
			РеквизитыОО_Мета.Колонки.Добавить("Тип");
			РеквизитыОО_Мета.Колонки.Добавить("Значение");
			РеквизитыОО_Мета.Колонки.Добавить("РежимПароля");
			//---
			Для каждого Реквизит Из МетаданныеОО_Реквизиты Цикл
				НовыйРеквизитОО	= РеквизитыОО_Мета.Добавить();
				
				НовыйРеквизитОО.ИД					= Реквизит.Имя;
				НовыйРеквизитОО.Тип					= Реквизит.Тип;
				НовыйРеквизитОО.ПроверкаЗаполнения	= Реквизит.ПроверкаЗаполнения;
				НовыйРеквизитОО.РежимПароля			= Реквизит.РежимПароля;
			КонецЦикла; 
			//---
			// Читаем данные о табличных частях объекта
			СоответствиеТЧ_Мета	= Новый Соответствие;
			//---
			Для каждого МетаТабличнаяЧасть Из МетаданныеОО_ТЧ Цикл
				ТабличнаяЧасть	= Новый ТаблицаЗначений;
				//---
				МетаданныеОО_ТЧ_Реквизиты	= МетаТабличнаяЧасть.Реквизиты;
				Для каждого МетаРеквизитТЧ Из МетаданныеОО_ТЧ_Реквизиты Цикл
					ТабличнаяЧасть.Колонки.Добавить(МетаРеквизитТЧ.Имя, МетаРеквизитТЧ.Тип);
				КонецЦикла; 
				//---
				НоваяСтрокаТЧ	= ТабличнаяЧасть.Добавить();
				// Запомним созданную ТЧ
				СоответствиеТЧ_Мета.Вставить(МетаТабличнаяЧасть.Имя, ТабличнаяЧасть);
			КонецЦикла; 
		КонецЕсли;
		//---
	Иначе
		РеквизитыОО_Мета		= СоответствиеЗначений["*Реквизиты*"];
		//---
		Если РеквизитыОО_Мета = Неопределено Тогда
			РеквизитыОО_Мета	= Новый ТаблицаЗначений;
			РеквизитыОО_Мета.Колонки.Добавить("ПроверкаЗаполнения");
			РеквизитыОО_Мета.Колонки.Добавить("ИД");
			РеквизитыОО_Мета.Колонки.Добавить("Тип");
			РеквизитыОО_Мета.Колонки.Добавить("Значение");
			РеквизитыОО_Мета.Колонки.Добавить("РежимПароля");
		Иначе
			СоответствиеЗначений.Удалить("*Реквизиты*");
		КонецЕсли;
		//---
		СоответствиеТЧ_Мета	 	= СоответствиеЗначений;
		//---
	КонецЕсли;
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	// ЗАПОЛНЯЕМ ОБЫЧНЫЕ РЕКВИЗИТЫ ОБЪЕКТА ОТЧЕТА/ОБРАБОТКИ И ДАННЫЕ ФОРМЫ НА ИХ ОСНОВАНИИ
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	// Создадим список удаления старых колонок чтобы перезаполнить ТЧ Реквизитов на форме
	Если Не РеквизитыОО_Мета = Неопределено Тогда
		Если Тип(РеквизитыОО_Мета) = Тип("ТаблицаЗначений") Тогда
			// Подготовим списки для удаления старых реквизитов и поудаляем старые элементы формы связанные с ними
			МассивУдаляемыхРеквизитов	= Новый Массив;
			
			КоллекцияКолонокРеквизитов	=	ПолучитьРеквизиты("РеквизитыОО");
			Для каждого РеквизитОО Из КоллекцияКолонокРеквизитов Цикл
				НайденныйЭлементРеквизитов	= Элементы.Найти("РеквизитыОО"+РеквизитОО.Имя);
				МассивУдаляемыхРеквизитов.Добавить("РеквизитыОО."+РеквизитОО.Имя);	
				Если Не НайденныйЭлементРеквизитов = Неопределено Тогда
					Элементы.Удалить(НайденныйЭлементРеквизитов);
				КонецЕсли;
			КонецЦикла; 
			// Удалим старые реквизиты ТЧ если есть перед заполнением
			ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов);
			//---
			// Если признак только очистки, то не заполняем реквизиты после удаления
			Если Не ТолькоОчистка Тогда
				// Заполним ТЧ Реквизитов
				МассивДобавляемыхРеквизитов	= Новый Массив;
				//---
				Для каждого Колонка Из РеквизитыОО_Мета.Колонки Цикл
					РеквизитФормы	= Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "РеквизитыОО", Колонка.Имя);
					МассивДобавляемыхРеквизитов.Добавить(РеквизитФормы);
				КонецЦикла; 
				//---
				ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
				//---
				Для каждого Колонка Из РеквизитыОО_Мета.Колонки Цикл
					Если Колонка.Имя = "ПроверкаЗаполнения" Тогда
						Продолжить;
					КонецЕсли;
					Элемент	= Элементы.Добавить("РеквизитыОО"+Колонка.Имя, Тип("ПолеФормы"), Элементы.РеквизитыОО);
					
					Элемент.Заголовок		= Колонка.Заголовок;
					Элемент.ПутьКДанным		= "РеквизитыОО."+Колонка.Имя;
					
					Если Колонка.Имя="Значение" Тогда
						Элемент.Вид				= ВидПоляФормы.ПолеВвода;
						Элемент.ТолькоПросмотр	= Ложь;
						Элемент.УстановитьДействие("НачалоВыбора", "РеквизитыОбъектаНачалоВыбора");
						Элемент.УстановитьДействие("ПриИзменении", "РеквизитыОбъектаПриИзменении");
					ИначеЕсли Колонка.Имя = "РежимПароля" Тогда
						Элемент.Видимость = Ложь;
					Иначе
						Элемент.Вид				= ВидПоляФормы.ПолеНадписи;
						Элемент.ТолькоПросмотр	= Истина;
					КонецЕсли;
				КонецЦикла;
				//---
				ЭтаФорма.РеквизитыОО.Загрузить(РеквизитыОО_Мета);
				// Включим раскраску для реквизитов
				ЭтаФорма.УсловноеОформление.Элементы.Очистить();
				//---
				ЭлементУсловногоОформления	= УсловноеОформление.Элементы.Добавить();
				ОформляемыеПоля				= ЭлементУсловногоОформления.Поля.Элементы;
				
				ОформляемоеПоле				= ОформляемыеПоля.Добавить();
				ОформляемоеПоле.Поле		= Новый ПолеКомпоновкиДанных("РеквизитыООИД");
				ОформляемоеПоле				= ОформляемыеПоля.Добавить();
				ОформляемоеПоле.Поле		= Новый ПолеКомпоновкиДанных("РеквизитыООТип");
				ОформляемоеПоле				= ОформляемыеПоля.Добавить();
				ОформляемоеПоле.Поле		= Новый ПолеКомпоновкиДанных("РеквизитыООЗначение");
				
				ЭлементОтбора				= ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("РеквизитыОО.ПроверкаЗаполнения");
				ЭлементОтбора.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение= ПроверкаЗаполнения.ВыдаватьОшибку;
				
				ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.АнтикБелый);
				
				// Для параметров с режимом пароля изменим оформление текста
				ЭлементУсловногоОформления	 = УсловноеОформление.Элементы.Добавить();
				ОформляемыеПоля				 = ЭлементУсловногоОформления.Поля.Элементы;
				
				ОформляемоеПоле				 = ОформляемыеПоля.Добавить();
				ОформляемоеПоле.Поле		 = Новый ПолеКомпоновкиДанных("РеквизитыООЗначение");
				
				ЭлементОтбора 				 = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение	 = Новый ПолеКомпоновкиДанных("РеквизитыОО.РежимПароля");
				ЭлементОтбора.ВидСравнения	 = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение = Истина;
				
				ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "************");
				//---
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	// ЗАПОЛНЯЕМ ТАБЛИЧНЫЕ ЧАСТИ ОБЪЕКТА ОТЧЕТА/ОБРАБОТКИ И ЗАПОЛНЯЕМ ДАННЫЕ ФОРМЫ НА ИХ ОСНОВАНИИ
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	Если Не СоответствиеТЧ_Мета = Неопределено Тогда
		Если Тип(СоответствиеТЧ_Мета) = Тип("Соответствие") Тогда
			//---
		    ТипыРеквизита = Новый Массив;
		    ТипыРеквизита.Добавить(Тип("ТаблицаЗначений"));
		    ОписаниеТиповДляТЧ = Новый ОписаниеТипов(ТипыРеквизита);
			//---
			МассивУдаляемыхРеквизитов	= Новый Массив;
			//---	
			Для Каждого РеквизитФормыИмя ИЗ ЭтаФорма.СписокИменТабличныхЧастей Цикл
				МассивУдаляемыхРеквизитов.Добавить(РеквизитФормыИмя.Значение);
				Элементы.Удалить(Элементы["Страница"+РеквизитФормыИмя.Значение]);
			КонецЦикла;
			//---
			ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов);
			//---
			СписокТабличныхЧастей		= Новый Массив;
			//---
			Если Не ТолькоОчистка Тогда
				// Создадим реквизиты формы
				МассивДобавляемыхРеквизитов	= Новый Массив;
				//---
				Для каждого ЭлементСоответствияТЧ Из СоответствиеТЧ_Мета Цикл
					ИмяТаблицы		= ЭлементСоответствияТЧ.Ключ;
					ТабличнаяЧасть	= ЭлементСоответствияТЧ.Значение;
					// Создаем реквизиты формы
					ТабличнаяЧастьРФ = Новый РеквизитФормы("ТЧ_"+ИмяТаблицы, ОписаниеТиповДляТЧ);
					//---
					МассивДобавляемыхРеквизитов.Добавить(ТабличнаяЧастьРФ);
					СписокТабличныхЧастей.Добавить("ТЧ_"+ИмяТаблицы);
					// Получим метаданные колонок тек. ТЧ
					МетаданныеКолонкиТЧ	= ТабличнаяЧасть.Колонки;
					//---
					Для Каждого КолонкаТЧ ИЗ МетаданныеКолонкиТЧ Цикл
						КолонкаТЧРФ	= Новый РеквизитФормы(КолонкаТЧ.Имя, КолонкаТЧ.ТипЗначения, "ТЧ_"+ИмяТаблицы, КолонкаТЧ.Имя, Ложь);
						//---
						МассивДобавляемыхРеквизитов.Добавить(КолонкаТЧРФ);
					КонецЦикла;
				КонецЦикла; 
				//---
				ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
				// Создадим объекты для отображения реквизитов формы
				Для каждого ЭлементСоответствияТЧ Из СоответствиеТЧ_Мета Цикл
					ИмяТаблицы		= ЭлементСоответствияТЧ.Ключ;
					ТабличнаяЧасть	= ЭлементСоответствияТЧ.Значение;
					// Создадим страницу для реквизитов ТЧ
					НовыйЭлементСтраница = Элементы.Добавить("СтраницаТЧ_"+ИмяТаблицы, Тип("ГруппаФормы"), Элементы.ГруппаСтраницыРеквизитовТЧ);
				    НовыйЭлементСтраница.Вид = ВидГруппыФормы.Страница;
					НовыйЭлементСтраница.Заголовок = ИмяТаблицы;
					// Создадим ТЧ на форме
					НовыйЭлементТаблица								= Элементы.Добавить("ТЧ_"+ИмяТаблицы, Тип("ТаблицаФормы"), НовыйЭлементСтраница);
					НовыйЭлементТаблица.Заголовок					= ИмяТаблицы;
					НовыйЭлементТаблица.ПутьКДанным					= "ТЧ_"+ИмяТаблицы;
					НовыйЭлементТаблица.Отображение					= ОтображениеТаблицы.Список;
					НовыйЭлементТаблица.ПоложениеКоманднойПанели	= ПоложениеКоманднойПанелиЭлементаФормы.Верх;
					НовыйЭлементТаблица.ТолькоПросмотр				= Ложь;
					//---
					СписокИменТабличныхЧастей.Добавить("ТЧ_"+ИмяТаблицы);
					// Получим метаданные колонок тек. ТЧ
					МетаданныеКолонкиТЧ	= ТабличнаяЧасть.Колонки;
					//---
					Для Каждого КолонкаТЧ ИЗ МетаданныеКолонкиТЧ Цикл
						// Создадим элемент формы колонка у ТЧ
						НовыйЭлементКолонкаТЧ				= Элементы.Добавить("ТЧ_"+ИмяТаблицы+КолонкаТЧ.Имя, Тип("ПолеФормы"), НовыйЭлементТаблица);
						НовыйЭлементКолонкаТЧ.Вид			= ВидПоляФормы.ПолеВвода;
						НовыйЭлементКолонкаТЧ.Заголовок		= КолонкаТЧ.Имя;
						НовыйЭлементКолонкаТЧ.ПутьКДанным	= "ТЧ_"+ИмяТаблицы+"."+КолонкаТЧ.Имя;
						НовыйЭлементКолонкаТЧ.ТолькоПросмотр= Ложь;
					КонецЦикла;
					//---
					ЭтаФорма["ТЧ_"+ИмяТаблицы].Загрузить(ТабличнаяЧасть);
					//---
				КонецЦикла;
				//---
			КонецЕсли;
			//---
			ЭтаФорма.СписокИменТабличныхЧастей.ЗагрузитьЗначения(СписокТабличныхЧастей);
			//---
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры



