
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//проверка на возможность создания документа на основании поручения
	Если Объект.Проверка Тогда
	    Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		 ЗаполнитьШапкуДокументаСервер();
	Иначе
	КонецЕсли;
	ВывестиРеквизитыДокументаОснования(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(Объект.ОтменяемоеПоручение) Тогда
		ОтменяемоеПоручениеПриИзмененииНадпись();
	КонецЕсли;
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	ВывестиРеквизитыДокументаОснования(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтменяемоеПоручениеПриИзменении(Элемент)
	ОтменяемоеПоручениеПриИзмененииНадпись(); 
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьШапкуДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ОбщегоНазначения.ЗаполнитьШапкуДокумента(ТекущийОбъект, ПараметрыСеанса.ТекущийПользователь);
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ПоискСвязанныхОперацийОбъектов()
	
	Если НЕ ЗначениеЗаполнено(Объект.ОтменяемоеПоручение) Тогда
		Возврат;
	КонецЕсли;
	ТаблицаЗначенийОбъектов  = Новый ТаблицаЗначений;
	ТаблицаЗначенийОбъектов.Колонки.Добавить("Объект");
	ТаблицаЗначенийОбъектов.Колонки.Добавить("Пометка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Выписка.Ссылка КАК Объект,
	|	Выписка.ПометкаУдаления,
	|	Выписка.ДокументОснование
	|ИЗ
	|	Документ.Выписка КАК Выписка
	|ГДЕ
	|	Выписка.ДокументОснование = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОткрытиеСчетаДепо.Ссылка,
	|	ОткрытиеСчетаДепо.ПометкаУдаления,
	|	ОткрытиеСчетаДепо.ДокументОснование
	|ИЗ
	|	Документ.ОткрытиеСчетаДепо КАК ОткрытиеСчетаДепо
	|ГДЕ
	|	ОткрытиеСчетаДепо.ДокументОснование = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОперацииЦБ.Ссылка,
	|	ОперацииЦБ.ПометкаУдаления,
	|	ОперацииЦБ.ДокументОснование
	|ИЗ
	|	Документ.ОперацииЦБ КАК ОперацииЦБ
	|ГДЕ
	|	ОперацииЦБ.ДокументОснование = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОткрытиеРазделаСчетаДепо.Ссылка,
	|	ОткрытиеРазделаСчетаДепо.ПометкаУдаления,
	|	ОткрытиеРазделаСчетаДепо.ДокументОснование
	|ИЗ
	|	Документ.ОткрытиеРазделаСчетаДепо КАК ОткрытиеРазделаСчетаДепо
	|ГДЕ
	|	ОткрытиеРазделаСчетаДепо.ДокументОснование = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеСчетаДепо.Ссылка,
	|	ЗакрытиеСчетаДепо.ПометкаУдаления,
	|	ЗакрытиеСчетаДепо.ДокументОснование
	|ИЗ
	|	Документ.ЗакрытиеСчетаДепо КАК ЗакрытиеСчетаДепо
	|ГДЕ
	|	ЗакрытиеСчетаДепо.ДокументОснование = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НазначениеПредставителяСчетаДепо.Ссылка,
	|	НазначениеПредставителяСчетаДепо.ПометкаУдаления,
	|	НазначениеПредставителяСчетаДепо.ДокументОснование
	|ИЗ
	|	Документ.НазначениеПредставителяСчетаДепо КАК НазначениеПредставителяСчетаДепо
	|ГДЕ
	|	НазначениеПредставителяСчетаДепо.ДокументОснование = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтменаПредставителяСчетаДепо.Ссылка,
	|	ОтменаПредставителяСчетаДепо.ПометкаУдаления,
	|	ОтменаПредставителяСчетаДепо.ДокументОснование
	|ИЗ
	|	Документ.ОтменаПредставителяСчетаДепо КАК ОтменаПредставителяСчетаДепо
	|ГДЕ
	|	ОтменаПредставителяСчетаДепо.ДокументОснование = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦБВПути.Ссылка,
	|	ЦБВПути.ПометкаУдаления,
	|	ЦБВПути.ДокументОснование
	|ИЗ
	|	Документ.ЦБВПути КАК ЦБВПути
	|ГДЕ
	|	ЦБВПути.ДокументОснование = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПогашениеЦБ.Ссылка,
	|	ПогашениеЦБ.ПометкаУдаления,
	|	ПогашениеЦБ.ДокументОснование
	|ИЗ
	|	Документ.ПогашениеЦБ КАК ПогашениеЦБ
	|ГДЕ
	|	ПогашениеЦБ.ДокументОснование = &ДокументОснование
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПогашениеЦБПолное.Ссылка,
	|	ПогашениеЦБПолное.ПометкаУдаления,
	|	ПогашениеЦБПолное.ДокументОснование
	|ИЗ
	|	Документ.ПогашениеЦБПолное КАК ПогашениеЦБПолное
	|ГДЕ
	|	ПогашениеЦБПолное.ДокументОснование = &ДокументОснование
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПогашениеЦБЧастичное.Ссылка,
	|	ПогашениеЦБЧастичное.ПометкаУдаления,
	|	ПогашениеЦБЧастичное.ДокументОснование
	|ИЗ
	|	Документ.ПогашениеЦБЧастичное КАК ПогашениеЦБЧастичное
	|ГДЕ
	|	ПогашениеЦБЧастичное.ДокументОснование = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПогашениеНКД.Ссылка,
	|	ПогашениеНКД.ПометкаУдаления,
	|	ПогашениеНКД.ДокументОснование
	|ИЗ
	|	Документ.ПогашениеНКД КАК ПогашениеНКД
	|ГДЕ
	|	ПогашениеНКД.ДокументОснование = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГлобальнаяОперация.Ссылка,
	|	ГлобальнаяОперация.ПометкаУдаления,
	|	ГлобальнаяОперация.ДокументОснование
	|ИЗ
	|	Документ.ГлобальнаяОперация КАК ГлобальнаяОперация
	|ГДЕ
	|	ГлобальнаяОперация.ДокументОснование = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонвертацияЦБ.Ссылка,
	|	КонвертацияЦБ.ПометкаУдаления,
	|	КонвертацияЦБ.ДокументОснование
	|ИЗ
	|	Документ.КонвертацияЦБ КАК КонвертацияЦБ
	|ГДЕ
	|	КонвертацияЦБ.ДокументОснование = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВводДивидендов.Ссылка,
	|	ВводДивидендов.ПометкаУдаления,
	|	ВводДивидендов.ДокументОснование
	|ИЗ
	|	Документ.ВводДивидендов КАК ВводДивидендов
	|ГДЕ
	|	ВводДивидендов.ДокументОснование = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГлобальнаяОперация.Ссылка,
	|	ГлобальнаяОперация.ПометкаУдаления,
	|	ГлобальнаяОперация.ДокументОснование
	|ИЗ
	|	Документ.ГлобальнаяОперация КАК ГлобальнаяОперация
	|ГДЕ
	|	ГлобальнаяОперация.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование",Объект.ОтменяемоеПоручение);
	
	Результат = Запрос.Выполнить();
	Выборка 	= Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока 			= ТаблицаЗначенийОбъектов.Добавить();
		НоваяСтрока.Объект 		= Выборка.Объект;
		НоваяСтрока.Пометка 	= Выборка.ПометкаУдаления;
	КонецЦикла; 		  
	Объект.СвязанныеОперации.Загрузить(ТаблицаЗначенийОбъектов);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиРеквизитыДокументаОснования(Форма)
	
	Объект = Форма.Объект;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Форма.КодОтмены		= Объект.ДокументОснование.КодОтмены;
		Форма.ПричинаОтмены	= Объект.ДокументОснование.ПричинаОтмены;
		Форма.НачислитьКомиссиюЗаОтмену = Объект.ДокументОснование.НачислитьКомиссиюЗаОтмену;
	Иначе
		Форма.КодОтмены		= ПредопределенноеЗначение("Справочник.КодыОтменыПоручений.ПустаяСсылка");
		Форма.ПричинаОтмены	= "";
		Форма.НачислитьКомиссиюЗаОтмену = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтменяемоеПоручениеПриИзмененииНадпись()
	
	Если ТипЗнч(Объект.ОтменяемоеПоручение) = Тип("ДокументСсылка.Поручение") Тогда
	
		ОперацияОтмена = Объект.ОтменяемоеПоручение.ВидОперацииД;
		ДепонентОтмена = Объект.ОтменяемоеПоручение.Инициатор;
		СчетДепоОтмена=  Объект.ОтменяемоеПоручение.СчетДепо;
	
	КонецЕсли; 
	ПоискСвязанныхОперацийОбъектов();

КонецПроцедуры

//#КонецОбласти
