//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 
		 
		УстановитьНомерДокументаСервер(); 
		ЗаполнитьШапкуДокументаСервер();
		
		Если ТипЗнч(Объект.СчетДепо) = Тип("СправочникСсылка.СчетаДепо") Тогда
			Объект.РазделСчетаДепо = Справочники.РазделыСчетаДепо.ПустаяСсылка();
		ИначеЕсли ТипЗнч(Объект.СчетДепо) = Тип("СправочникСсылка.СчетаДепоМХ") Тогда
			Объект.РазделСчетаДепо = Справочники.РазделыСчетаДепоМХ.ПустаяСсылка();
		КонецЕсли;

				
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.РазделСчетаДепо) Тогда 
		БлокировкаДокумента();
    КонецЕсли;
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	БлокировкаДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьСубклиента(ЭтаФорма);
	ОбновлениеОтображения(ЭтаФорма);
	
КонецПроцедуры


//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РазделСубклиентаПриИзменении(Элемент)

	УстановитьДоступностьСубклиента(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура СчетДепоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ТипЗнч(Объект.ВладелецСчета) = Тип("СправочникСсылка.Организации") Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.СчетаДепоМХ.ФормаВыбора", , Элемент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РазделСчетаДепоПриИзменении(Элемент)
	УстановитьДоступностьСубклиента(ЭтаФорма);
	ОбновлениеОтображения(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СчетДепоПриИзменении(Элемент)
	УстановитьДоступностьСубклиента(ЭтаФорма);
	ОбновлениеОтображения(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецСчетаПриИзменении(Элемент)
	ДоступныеТипы = Новый Массив;
	Если ТипЗнч(Объект.ВладелецСчета) = Тип("СправочникСсылка.Контрагенты") Тогда
		ДоступныеТипы.Добавить(Тип("СправочникСсылка.СчетаДепо"));
	ИначеЕсли ТипЗнч(Объект.ВладелецСчета) = Тип("СправочникСсылка.МестаХранения") Тогда
		ДоступныеТипы.Добавить(Тип("СправочникСсылка.СчетаДепоМХ"));
	КонецЕсли;
	Элементы.СчетДепо.ОграничениеТипа = Новый ОписаниеТипов(ДоступныеТипы);
КонецПроцедуры

&НаКлиенте
Процедура РазделСчетаДепоМХНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСДиалогамиКлиент.РазделСчетаДепоМХНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделСчетаДепоМХАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора = РаботаСДиалогамиКлиент.ДанныеВыбораСУчетомТипаРаздела(
	Объект.ТипРазделаСчетаДЕПО, ПараметрыПолученияДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипРазделаСчетаДЕПОПриИзменении(Элемент)
	
	РаботаСДиалогамиКлиент.ТипРазделаСчетаДЕПОПриИзменении(Элемент, ЭтотОбъект);
	
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьШапкуДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ОбщегоНазначения.ЗаполнитьШапкуДокумента(ТекущийОбъект, ПараметрыСеанса.ТекущийПользователь, , );
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура УстановитьНомерДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Дата) Тогда
		ТекущийОбъект.Дата = НачалоДня(ТекущаяДата());
	КонецЕсли;
	ТекущийОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура БлокировкаДокумента()
	Если Объект.Проведен Тогда

	КонецЕсли;
КонецПроцедуры // БлокировкаДокумента()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСубклиента(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если ТипЗнч(Объект.СчетДепо) = Тип("СправочникСсылка.СчетаДепо") Тогда
		
		Элементы.РазделСубклиента.Доступность = ТипыСчетаНоминальногоДержателя(ЗначениеРеквизитаНаСервере(Объект.СчетДепо,"ТипСчетаДепо")) <> Неопределено;
	Иначе                                       
		Элементы.РазделСубклиента.Доступность = Ложь;
	КонецЕсли;
	Элементы.Субклиент.Доступность = Объект.РазделСубклиента И Элементы.РазделСубклиента.Доступность;
	Элементы.Субклиент.ОтметкаНезаполненного = Объект.РазделСубклиента;
	Элементы.Субклиент.АвтоОтметкаНезаполненного = Объект.РазделСубклиента;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипыСчетаНоминальногоДержателя(ТипСчетаДепо)
	
	ТипыСчетаНоминальногоДержателя = Перечисления.ТипыСчетовДепо.НоминальныхДержателей();
	Возврат ТипыСчетаНоминальногоДержателя.Найти(ТипСчетаДепо) <> Неопределено;
	
КонецФункции


&НаКлиентеНаСервереБезКонтекста
Процедура ОбновлениеОтображения(Форма)
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если ЗначениеЗаполнено(Объект.РазделСчетаДепо)
		 И ( ТипЗнч(Объект.РазделСчетаДепо) = Тип("СправочникСсылка.РазделыСчетаДепоМХ")
		 	 ИЛИ ТипЗнч(Объект.РазделСчетаДепо) = Тип("СправочникСсылка.РазделыСчетаДепо") ) Тогда
		Элементы.НадписьКодаРазделаСчетаДепо.Заголовок = ЗначениеРеквизитаНаСервере(Объект.РазделСчетаДепо,"Код");
		
	Иначе
		Элементы.НадписьКодаРазделаСчетаДепо.Заголовок = "";
	КонецЕсли;
	
	Элементы.РазделСчетаДепоМХ.Видимость = ЗначениеЗаполнено(Объект.СчетДепо) И ТипЗнч(Объект.СчетДепо) = Тип("СправочникСсылка.СчетаДепо");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаНаСервере(Источник, ИмяРеквизита)
	Перем Результат;
	Если Источник <> Неопределено Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, ИмяРеквизита);
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции



//#КонецОбласти
