#Область ОписаниеПеременных

&НаСервере
Перем мТекущийОбъектНаСервере; // Реквизит формы "Объект", преобразованный в объект прикладного типа

#КонецОбласти
// BSLLS:LatinAndCyrillicSymbolInWord-off

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ТекущийОбъект());
	
	Объект.ДатаНачала = Дата(1, 1, 1);
	Объект.ДатаОкончания = Объект.ДатаНачала;
	
	Объект.ВидОперации = "Загрузка статики ценных бумаг по списку ISIN";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьБумагиВНеактуальномСтатусеПриИзменении(Элемент)
	Элементы.ГруппаДопСтатусы.Видимость = Не Объект.ОбновитьБумагиВНеактуальномСтатусе;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЦенныеБумаги

&НаКлиенте
Процедура ЦенныеБумагиПриИзменении(Элемент)
	
	Объект.ДополнительныеСтатусыДляЗагрузки = "";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбработчикиКомандФормы_Токен

&НаКлиенте
Процедура ТестAPI_Авторизация(Команда)
	
	ТестAPI_АвторизацияНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы_ЗагрузкаКотировок

&НаКлиенте
Процедура НаТекущийДень(Команда)
	НаТекущийДеньНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НаПредыдущийДень(Команда)
	НаПредыдущийДеньНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НаПредыдущийРабочийДень(Команда)
	НаПредыдущийРабочийДеньНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		// Лог загрузки
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
		ТабличныйДокумент.ОтображатьСетку = Ложь;
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		ВывестиШапку(ТабличныйДокумент);
		
		// Загрузка данных
		СписокОпераций = ПолучитьСписокОперацийДляВыполнения();
		ТекстСостояния = НСтр("ru = 'Выполняется загрузка данных из Внешнего сервиса'");
		Картинка = БиблиотекаКартинок.ЗапуститьОтдельныйСеансДляВыполненияРегламентныхЗаданий;
		
		ЗагрузитьДанныеПоОперации(ТабличныйДокумент, СписокОпераций, ТекстСостояния, Картинка);
		
		Состояние(ТекстСостояния, 100, , Картинка);
		
		// Вывести лог
		ТабличныйДокумент.Показать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеПоОперации(ТабличныйДокумент, СписокОпераций, ТекстСостояния, Картинка)
	
	ЧислоСто = 100;
	ТекЗначение = 0;
	МаксимальноеЗначение = СписокОпераций.Количество();
	
	Для каждого ТекОперация Из СписокОпераций Цикл
		ПараметрыЗагрузки = Новый Структура;
		Если СтрНайти(ТекОперация.Значение, "Загрузить") > 0 Тогда
			Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан период", , "Объект.ДатаНачала");
				Возврат;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан период", , "Объект.ДатаОкончания");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Если СтрНайти(ТекОперация.Значение, "ЗагрузкаСтатикиЦенныхБумагПоСпискуISIN") > 0 Тогда
			ЗагружатьСтатику = ЗагрузитьДанныеПоСтатике(ПараметрыЗагрузки);
			Если Не ЗагружатьСтатику Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Состояние(ТекстСостояния, Окр(ЧислоСто * ТекЗначение / МаксимальноеЗначение), ТекОперация.Представление, Картинка);
		ТекЗначение = ТекЗначение + 1;
		
		Выполнить(ТекОперация.Значение + "(ТабличныйДокумент, ПараметрыЗагрузки)");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЗагрузитьДанныеПоСтатике(ПараметрыЗагрузки)
	
	Если Объект.ЦенныеБумаги.Количество() = 0 Тогда
		ТекстВопроса = "Будут загружены все Ценные бумаги (Время загрузки: 2 - 3 часа). Продолжить операцию?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 60);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны ISIN", , "Объект.ЦенныеБумаги");
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	ПараметрыЗагрузки.Вставить("ДатаНачала"									, Объект.ДатаНачала);
	ПараметрыЗагрузки.Вставить("ДополнительныеСтатусыДляЗагрузки"			, Объект.ДополнительныеСтатусыДляЗагрузки);
	ПараметрыЗагрузки.Вставить("ОбновитьЭмитентовВсехЗагружаемыхЦБ"			, Объект.ОбновитьЭмитентовВсехЗагружаемыхЦБ);
	ПараметрыЗагрузки.Вставить("СоздатьОбновитьТолькоЭмитентов"				, Объект.СоздатьОбновитьТолькоЭмитентов);
	ПараметрыЗагрузки.Вставить("ЦенныеБумаги"								, Объект.ЦенныеБумаги);
	ПараметрыЗагрузки.Вставить("ОбновитьБумагиВНеактуальномСтатусе"			, Объект.ОбновитьБумагиВНеактуальномСтатусе);
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура Настройки(Команда)
	
	ПараметрыФормыНастроек = НовыеПараметрыФормыНастроек();
	
	ОткрытьФорму("Обработка.СервисыMarketDataAPI.Форма.ФормаНастроек", ПараметрыФормыНастроек, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы_ЗагрузкаЦенныхБумаг

&НаКлиенте
Процедура ЗаполнитьISIN(Команда)
	
	РезультатОтбора = ОткрытьФормуМодально("Обработка.СервисыMarketDataAPI.Форма.ФормаОтбораISIN", , ЭтотОбъект);
	
	ЗаполнитьISINНаСервере(РезультатОтбора);
	
	Объект.ДополнительныеСтатусыДляЗагрузки = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьISIN(Команда)
	РаботаСДиалогамиКлиент.ЗагрузитьВТабличнуюЧастьСписокЦБИзExcel(Объект.ЦенныеБумаги, "ISIN", ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОтчетОЦеннойБумагеИзRudataAPI(Команда)
	
	ТабличныйДокумент = ПолучитьОтчетОЦеннойБумагеИзRudataAPIНаСервере();
	Если ТабличныйДокумент = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет актуальных данных или произошла ошибка.");
	Иначе
		ТабличныйДокумент.Показать("Отчет о ценной бумаге из RuData API");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеСтатусы(Команда)
	
	Если Объект.ЦенныеБумаги.Количество() = 1 Тогда
		Статусы1 = "'Аннулирован','Готовится','Досрочно погашен','Не определено','Погашен',";
		Статусы2 = "'Прекращение','Приостановлен','Размещается','Размещен','Списан'";
		Объект.ДополнительныеСтатусыДляЗагрузки = Статусы1 + Статусы2;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы_ЗагрузкаКурсовВалют

&НаКлиенте
Процедура ЗаполнитьСписокВалют(Команда)
	
	СписокВалют.Очистить();
	
	ЗагружаемыеВалюты = ПолучитьСписокЗагружаемыхВалют();
	Для Каждого Валюта Из ЗагружаемыеВалюты Цикл
		НоваяСтрока = СписокВалют.Добавить();
		НоваяСтрока.Значение 	= Валюта;
		НоваяСтрока.Представление 	= ПредставлениеВалютыНаСервере(Валюта);
		НоваяСтрока.Пометка 	= Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокБазовыхВалют(Команда)
	
	СписокБазовыхВалют.Очистить();
	
	ЗагружаемыеВалюты = ПолучитьСписокБазовыхВалют();
	Для Каждого Валюта Из ЗагружаемыеВалюты Цикл
		НоваяСтрока = СписокБазовыхВалют.Добавить();
		НоваяСтрока.Значение 	= Валюта;
		НоваяСтрока.Пометка 	= Истина;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписокВалют(Команда)
	
	СписокВалют.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписокБазовыхВалют(Команда)
	
	СписокБазовыхВалют.Очистить();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция НовыеПараметрыФормыНастроек()
	
	ПараметрыФормыНастроек = Новый Структура;
	ПараметрыФормыНастроек.Вставить("ИмяНастроекСервиса", ИмяНастроекСервиса);
	
	Возврат ПараметрыФормыНастроек;
	
КонецФункции

&НаКлиенте
Процедура УстановитьИмяНастроекСервиса()
	
	ПредставлениеВидаОперации = Элементы.ВидОперации.СписокВыбора.НайтиПоЗначению(Объект.ВидОперации).Представление;
	Если СтрНайти(ПредставлениеВидаОперации, "RuData") > 0 Тогда
		ИмяНастроекСервиса = "НастройкиИнтерфакс";
		ИмяВнешнегоСервиса = "Интерфакс";
	ИначеЕсли СтрНайти(ПредставлениеВидаОперации, "NSD") > 0 Тогда
		ИмяНастроекСервиса = "НастройкиНРД";
		ИмяВнешнегоСервиса = "НРД";
	ИначеЕсли СтрНайти(ПредставлениеВидаОперации, "CBonds") > 0 Тогда
		ИмяНастроекСервиса = "НастройкиCBonds";
		ИмяВнешнегоСервиса = "CBonds";
	Иначе
		ИмяНастроекСервиса = Неопределено;
		ИмяВнешнегоСервиса = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекущийОбъект()
	
	Если мТекущийОбъектНаСервере = Неопределено Тогда
		мТекущийОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат мТекущийОбъектНаСервере;
	
КонецФункции

&НаКлиенте
Процедура УправлениеФормой()
	
	УстановитьИмяНастроекСервиса();
	
	СтраницаГруппаСтраницы = Элементы.ЗагрузкаСтатикиЦенныхБумагПоСпискуISIN;
	
	Элементы.Настройки.Видимость								 = Ложь;
	Элементы.ГруппаДополнительныхПараметровЗагрузки.Видимость	 = Ложь;
	Элементы.ГруппаДополнительныхКоманд.Видимость				 = Ложь;
	Элементы.ГруппаОтбораISINДляЗагрузкиЦенныхБумаг.Видимость	 = Истина;
	
	Настройки	= MarketData.НастройкиСервисаAPI(ИмяНастроекСервиса);
	ПериодИзНастройки = MarketData.ПериодОтчета(Неопределено, Настройки);
	
	Если Объект.ВидОперации = "Загрузка котировок за период" Тогда
		Элементы.ГруппаКотировки.Видимость = Истина;
		Элементы.ГруппаКотировкиCBonds.Видимость = Ложь;
		Элементы.ГруппаНКДCBonds.Видимость = Ложь;
		
		СтраницаГруппаСтраницы = Элементы.СтраницаЗагрузкиКотировок;
		Элементы.Настройки.Видимость = Истина;
		
		Объект.ДатаНачала = ПериодИзНастройки.ДатаНачала;
		Объект.ДатаОкончания = ПериодИзНастройки.ДатаОкончания;
		
	ИначеЕсли Объект.ВидОперации = "Загрузка статики ценных бумаг по списку ISIN" Тогда
		
		СтраницаГруппаСтраницы = Элементы.ЗагрузкаСтатикиЦенныхБумагПоСпискуISIN;
		Элементы.ГруппаДополнительныхПараметровЗагрузки.Видимость = Истина;
		Элементы.ГруппаДополнительныхКоманд.Видимость = Истина;
		
		Объект.ДатаНачала = Дата(1, 1, 1);
		Объект.ДатаОкончания = Объект.ДатаНачала;
		
	ИначеЕсли Объект.ВидОперации = "Загрузка курсов валют" Тогда
		
		СтраницаГруппаСтраницы = Элементы.ЗагрузкаКурсовВалют;
		Элементы.ГруппаОтбораISINДляЗагрузкиЦенныхБумаг.Видимость = Ложь;
		
		Объект.ДатаНачала = ПериодИзНастройки.ДатаНачала;
		Объект.ДатаОкончания = ПериодИзНастройки.ДатаОкончания;
		Объект.ЗагрузитьКурсыВалют = Истина;
		
	ИначеЕсли Объект.ВидОперации = "НРД Загрузка котировок за период" Тогда
		Элементы.ГруппаКотировки.Видимость = Ложь;
		Элементы.ГруппаКотировкиCBonds.Видимость = Ложь;
		Элементы.ГруппаНКДCBonds.Видимость = Ложь;
		
		СтраницаГруппаСтраницы = Элементы.СтраницаЗагрузкиКотировок;
		Элементы.Настройки.Видимость = Истина;
		
		Объект.ДатаНачала = ПериодИзНастройки.ДатаНачала;
		Объект.ДатаОкончания = ПериодИзНастройки.ДатаОкончания;
		
	ИначеЕсли Объект.ВидОперации = "CBonds Загрузка котировок за период" Тогда
		Элементы.ГруппаКотировки.Видимость = Ложь;
		Элементы.ГруппаКотировкиCBonds.Видимость = Истина;
		Элементы.ГруппаНКДCBonds.Видимость = Ложь;
		
		СтраницаГруппаСтраницы = Элементы.СтраницаЗагрузкиКотировок;
		Элементы.Настройки.Видимость = Истина;
		
		Объект.ДатаНачала = ПериодИзНастройки.ДатаНачала;
		Объект.ДатаОкончания = ПериодИзНастройки.ДатаОкончания;
		
	ИначеЕсли Объект.ВидОперации = "CBonds Загрузка НКД за период" Тогда
		Элементы.ГруппаКотировки.Видимость = Ложь;
		Элементы.ГруппаКотировкиCBonds.Видимость = Ложь;
		Элементы.ГруппаНКДCBonds.Видимость = Истина;
		
		СтраницаГруппаСтраницы = Элементы.СтраницаЗагрузкиКотировок;
		Элементы.Настройки.Видимость = Ложь;
		
		Объект.ДатаНачала = ПериодИзНастройки.ДатаНачала;
		Объект.ДатаОкончания = ПериодИзНастройки.ДатаОкончания;
		Объект.ЗагрузитьНКДCBonds = Истина;
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Страница " + Объект.ВидОперации + " не существует!");
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = СтраницаГруппаСтраницы;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокОперацийДляВыполнения()
	
	СписокОпераций = Новый СписокЗначений;
	
	Если Объект.ВидОперации = "Загрузка котировок за период" Тогда
		
		ПолучитьСписокОперацийДляВыполненияRuData(СписокОпераций);
		
	ИначеЕсли Объект.ВидОперации = "Загрузка статики ценных бумаг по списку ISIN" Тогда
		
		СписокОпераций.Добавить("ЗагрузкаСтатикиЦенныхБумагПоСпискуISIN", Объект.ВидОперации);
		
	ИначеЕсли Объект.ВидОперации = "Загрузка курсов валют" Тогда
		
		Если Объект.ЗагрузитьКурсыВалют Тогда
			СписокОпераций.Добавить("ЗагрузкаКурсовВалют", Объект.ВидОперации);
		КонецЕсли;
		
	ИначеЕсли Объект.ВидОперации = "НРД Загрузка котировок за период" Тогда
		
		СписокОпераций.Добавить("ЗагрузитьКотировкиТорговыхПлощадокНРД", "Загрузка котировок торговых площадок НРД.");
		
	ИначеЕсли Объект.ВидОперации = "CBonds Загрузка котировок за период" Тогда
		
		ПолучитьСписокОперацийДляВыполненияCBonds(СписокОпераций);
		
	ИначеЕсли Объект.ВидОперации = "CBonds Загрузка НКД за период" Тогда
		
		Если Объект.ЗагрузитьНКДCBonds Тогда
			СписокОпераций.Добавить("ЗагрузитьКупоныCBonds", Объект.ВидОперации);
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Операций " + Объект.ВидОперации + " не существует!");
		
	КонецЕсли;
	
	Возврат СписокОпераций;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьСписокОперацийДляВыполненияRuData(СписокОпераций)
	
	Если Объект.ЗагрузитьКотировкиТорговыхПлощадокСПБ Тогда
		СписокОпераций.Добавить("ЗагрузитьКотировкиТорговыхПлощадокСПБ", "Загрузка котировок торговых площадок СПБ.");
	КонецЕсли;
	
	Если Объект.ЗагрузитьКотировкиПрочихТорговыхПлощадок Тогда
		СписокОпераций.Добавить("ЗагрузитьКотировкиПрочихТорговыхПлощадок",
			"Загрузка котировок прочих торговых площадок.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокОперацийДляВыполненияCBonds(СписокОпераций)
	
	Если Объект.ЗагрузитьКотировкиТорговыхПлощадокИндикативныхКотировокCBonds Тогда
		СписокОпераций.Добавить("ЗагрузитьКотировкиТорговыхПлощадокИндикативныхКотировокCBonds",
			"Загрузка индикативных котировок торговых площадок CBonds.");
	КонецЕсли;
	
	Если Объект.ЗагрузитьКотировкиПрочихТорговыхПлощадокCBonds Тогда
		СписокОпераций.Добавить("ЗагрузитьКотировкиПрочихТорговыхПлощадокCBonds",
			"Загрузка биржевых котировок торговых площадок CBonds.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиШапку(ТабличныйДокумент)
	
	Макет = Обработки.СервисыMarketDataAPI.ПолучитьМакет("Лог");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ДатаЗагрузки = Формат(ТекущаяДатаСеанса(), "ДЛФ=DD");
	ОбластьШапка.Параметры.ВнешнийСервис = ИмяВнешнегоСервиса;
	ТабличныйДокумент.Вывести(ОбластьШапка, 0);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиВЛогеЗагрузкиИнформациюИзСервиса(ЛогПолученныхДанных, ТабличныйДокумент, Макет)
	
	Если ТипЗнч(ЛогПолученныхДанных) = Тип("ТекстовыйДокумент") Тогда
		
		ОбластьШапкаВнешнийСервис = Макет.ПолучитьОбласть("ШапкаСервис");
		ТабличныйДокумент.Вывести(ОбластьШапкаВнешнийСервис, 0);
		
		ОбластьГруппировки = Макет.ПолучитьОбласть("ОбластьГруппировки");
		ТабличныйДокумент.Вывести(ОбластьГруппировки, 1, , Ложь);
		
		Для НомерСтроки = 1 По ЛогПолученныхДанных.КоличествоСтрок() Цикл
			
			ТекущаяСтрока = ЛогПолученныхДанных.ПолучитьСтроку(НомерСтроки);
			
			ОбластьСтрокаВнешнийСервис = Макет.ПолучитьОбласть("СтрокаСервис");
			ОбластьОписаниеВнешнийСервис = Макет.ПолучитьОбласть("ОписаниеСервис");
			
			// Форматируем строку XML
			Если СтрНайти(ТекущаяСтрока, "<?xml") > 0 Тогда
				Попытка
					ЧтениеXML = Новый ЧтениеXML;
					ЧтениеXML.УстановитьСтроку(ТекущаяСтрока);
					
					ПостроительDOM = Новый ПостроительDOM;
					ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
					
					// Здесь как раз и содержится явное указание 1С отформатировать XML при записи
					ЗаписьXML = Новый ЗаписьXML;
					ЗаписьXML.УстановитьСтроку(Новый ПараметрыЗаписиXML(, , Истина, Ложь));
					
					ЗаписьDOM = Новый ЗаписьDOM;
					ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
					ОтформатированныйТекст = ЗаписьXML.Закрыть();
					
					ОбластьСтрокаВнешнийСервис.Параметры.СтрокаДанных = ОтформатированныйТекст;
					ТабличныйДокумент.Вывести(ОбластьСтрокаВнешнийСервис, 3, , Ложь);
				Исключение
					ОбластьСтрокаВнешнийСервис.Параметры.СтрокаДанных = ТекущаяСтрока;
					ТабличныйДокумент.Вывести(ОбластьСтрокаВнешнийСервис, 3, , Ложь);
				КонецПопытки;
			Иначе
				ОбластьОписаниеВнешнийСервис.Параметры.СтрокаДанных = ТекущаяСтрока;
				ТабличныйДокумент.Вывести(ОбластьОписаниеВнешнийСервис, 2);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции_Токен

&НаСервере
Процедура ТестAPI_АвторизацияНаСервере()
	
	ОписаниеОшибки = "";
	RuDataAPI.Подключить(ОписаниеОшибки);
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка подключения: " + ОписаниеОшибки);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПараметрыСеанса.ТокенRuDataAPI);
		Объект.ТокенАвторизации = ПараметрыСеанса.ТокенRuDataAPI;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_ЗагрузкаКотировок

&НаСервере
Процедура ЗагрузитьКотировки(ТабличныйДокумент, ВидИсточника, ИмяДействия, Комментарий)
	
	Отказ = Ложь;
	ТекстОтказа = "";
	Если ВыводитьПолученнуюИнформациюВЛогеЗагрузки Тогда
		ЛогПолученныхДанных = Новый ТекстовыйДокумент;
	Иначе
		ЛогПолученныхДанных = Неопределено;
	КонецЕсли;
	
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	
	// Лог загрузки
	Макет = Обработки.СервисыMarketDataAPI.ПолучитьМакет("Лог");
	ОбластьВидИнформации = Макет.ПолучитьОбласть("ВидИнформации");
	ПериодЗагрузки = Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy") + " - " + Формат(Объект.ДатаОкончания, "ДФ=dd.MM.yyyy");
	ОбластьВидИнформации.Параметры.ВидЗагружаемойИнформации = СтрШаблон(НСтр(Комментарий), ПериодЗагрузки);
	ТабличныйДокумент.Вывести(ОбластьВидИнформации, 0);
	
	////////////////////////////
	// Загрузка котировок
	
	Период = Новый СтандартныйПериод(Объект.ДатаНачала, Объект.ДатаОкончания);
	ПараметрыИсточника = Новый Структура;
	ПараметрыИсточника.Вставить("ИмяДействия"	, ИмяДействия);
	ПараметрыИсточника.Вставить("ВидИсточника"	, ВидИсточника);
	ПараметрыИсточника.Вставить("ТаблицаISIN"	, Объект.ЦенныеБумаги.Выгрузить());
	
	MarketData.ЗагрузитьКотировкиВнешнегоСервиса(ИмяНастроекСервиса, Период, ПараметрыИсточника,
		Отказ, ТекстОтказа, ТабличныйДокумент, ЛогПолученныхДанных);
	
	// Если отказ, то выводим ошибку.
	Если Отказ Тогда
		ОбластьОшибкаЗагрузки = Макет.ПолучитьОбласть("ОшибкаЗагрузки");
		ОбластьОшибкаЗагрузки.Параметры.ТекстОтказа = ТекстОтказа;
		ТабличныйДокумент.Вывести(ОбластьОшибкаЗагрузки);
	КонецЕсли;
	
	// Выводим информацию полученную из Внешнего сервиса
	Если ВыводитьПолученнуюИнформациюВЛогеЗагрузки Тогда
		ВывестиВЛогеЗагрузкиИнформациюИзСервиса(ЛогПолученныхДанных, ТабличныйДокумент, Макет);
	КонецЕсли;
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКотировкиТорговыхПлощадокСПБ(ТабличныйДокумент, ПараметрыЗагрузки = Неопределено)
	
	ЗагрузитьКотировки(ТабличныйДокумент, "ТорговыхПлощадокСПБ", "ЗагрузитьКотировкиСПБИнтерфакс",
		"ru ='Загрузка котировок торговых площадок СПБ за %1'");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКотировкиПрочихТорговыхПлощадок(ТабличныйДокумент, ПараметрыЗагрузки = Неопределено)
	
	ЗагрузитьКотировки(ТабличныйДокумент, "ПрочихТорговыхПлощадок", "ЗагрузитьКотировкиПрочихТорговыхПлощадокИнтерфакс",
		"ru ='Загрузка котировок прочих торговых площадок за %1'");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКотировкиТорговыхПлощадокНРД(ТабличныйДокумент, ПараметрыЗагрузки = Неопределено)
	
	ЗагрузитьКотировки(ТабличныйДокумент, "ТорговыхПлощадокНРД", "ЗагрузкаИтоговТорговЧерезNSDAPI",
		"ru ='Загрузка котировок торговых площадок НРД за %1'");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКотировкиТорговыхПлощадокИндикативныхКотировокCBonds(ТабличныйДокумент, ПараметрыЗагрузки = Неопределено)
	
	ЗагрузитьКотировки(ТабличныйДокумент, "ТорговыхПлощадокСПБ", "ЗагрузитьИндикативныеКотировкиCBonds",
		"ru ='Загрузка индикативных котировок торговых площадок CBonds за %1'");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКотировкиПрочихТорговыхПлощадокCBonds(ТабличныйДокумент, ПараметрыЗагрузки = Неопределено)
	
	ЗагрузитьКотировки(ТабличныйДокумент, "ПрочихТорговыхПлощадок", "ЗагрузитьБиржевыеКотировкиТорговыхПлощадокCBonds",
		"ru ='Загрузка биржевых котировок торговых площадок CBonds за %1'");
	
КонецПроцедуры

&НаСервере
Процедура НаТекущийДеньНаСервере()
	Объект.ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
	Объект.ДатаОкончания = Объект.ДатаНачала;
КонецПроцедуры

&НаСервере
Процедура НаПредыдущийДеньНаСервере()
	Объект.ДатаНачала = НачалоДня(НачалоДня(ТекущаяДатаСеанса()) - 1);
	Объект.ДатаОкончания = Объект.ДатаНачала;
КонецПроцедуры

&НаСервере
Процедура НаПредыдущийРабочийДеньНаСервере()
	Объект.ДатаНачала = ОбщегоНазначения.ПредыдущийРабочийДень(ТекущаяДатаСеанса());
	Объект.ДатаОкончания = Объект.ДатаНачала;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_ЗагрузкаЦенныхБумаг

&НаСервере
Процедура ЗаполнитьISINНаСервере(РезультатОтбора)
	
	Если РезультатОтбора = Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполнение ISIN отменено");
		
	Иначе
		
		КопироватьДанныеФормы(РезультатОтбора.ЦенныеБумаги, Объект.ЦенныеБумаги);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполнение ISIN произведено");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузкаСтатикиЦенныхБумагПоСпискуISIN(ТабличныйДокумент, ПараметрыЗагрузки)
	
	Объект_ДатаНачала									 = ПараметрыЗагрузки.ДатаНачала;
	Объект_ДополнительныеСтатусыДляЗагрузки				 = ПараметрыЗагрузки.ДополнительныеСтатусыДляЗагрузки;
	Объект_ОбновитьЭмитентовВсехЗагружаемыхЦБ			 = ПараметрыЗагрузки.ОбновитьЭмитентовВсехЗагружаемыхЦБ;
	Объект_СоздатьОбновитьТолькоЭмитентов				 = ПараметрыЗагрузки.СоздатьОбновитьТолькоЭмитентов;
	Объект_ЦенныеБумаги									 = ПараметрыЗагрузки.ЦенныеБумаги;
	Объект_ОбновитьБумагиВНеактуальномСтатусе			 = ПараметрыЗагрузки.ОбновитьБумагиВНеактуальномСтатусе;
	
	Макет = Обработки.СервисыMarketDataAPI.ПолучитьМакет("Лог");
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	ДатаЗагрузки = ?(Объект_ДатаНачала <> '00010101', Объект_ДатаНачала, ТекущаяДатаСеанса());
	
	ОбластьСтрокаСервис = Макет.ПолучитьОбласть("СтрокаСервис");
	ОбластьВидИнформации = Макет.ПолучитьОбласть("ВидИнформации");
	ПериодЗагрузки = Формат(ДатаЗагрузки, "ДФ=dd.MM.yyyy");
	ОбластьВидИнформации.Параметры.ВидЗагружаемойИнформации
		= СтрШаблон(НСтр("ru ='Загрузка статики ценных бумаг по списку ISIN по данным из сервисов Интерфакс на %1.'"),
			ПериодЗагрузки);
	ТабличныйДокумент.Вывести(ОбластьВидИнформации, 0);
	
	ФильтрСтатусов = RuDataAPI.ФильтрПоАктуальнымСтатусамЦБ();
	Если ЗначениеЗаполнено(Объект_ДополнительныеСтатусыДляЗагрузки) Тогда
		ФильтрСтатусов = ФильтрСтатусов + ", " + СокрЛП(Объект_ДополнительныеСтатусыДляЗагрузки);
	КонецЕсли;
	
	ВходныеПараметры = Новый Структура;
	ЦенныеБумаги = Объект_ЦенныеБумаги.Выгрузить(, "ISIN");
	ISINs = ЦенныеБумаги.ВыгрузитьКолонку("ISIN");
	ВходныеПараметры.Вставить("ISINs", ISINs);
	ВходныеПараметры.Вставить("ДатаВремяОбновленияДанных", Объект_ДатаНачала);
	ВходныеПараметры.Вставить("ОбновитьБумагиВНеактуальномСтатусе", Объект_ОбновитьБумагиВНеактуальномСтатусе);
	ВходныеПараметры.Вставить("ОбновитьЭмитентовВсехЗагружаемыхЦБ", Объект_ОбновитьЭмитентовВсехЗагружаемыхЦБ);
	ВходныеПараметры.Вставить("СоздатьОбновитьТолькоЭмитентов", Объект_СоздатьОбновитьТолькоЭмитентов);
	ВходныеПараметры.Вставить("ФильтрСтатусовЦБ", ФильтрСтатусов);
		
	ОбластьСтрокаСервис.Параметры.СтрокаДанных = "Начало: " + ТекущаяДатаСеанса();
	ТабличныйДокумент.Вывести(ОбластьСтрокаСервис);
	
	УспешноеСозданиеОбновлениеЦенныхБумагИЭмитентов = RuDataAPI.СозданиеОбновлениеЦенныхБумагИЭмитентов(ВходныеПараметры);
	
	Если Не УспешноеСозданиеОбновлениеЦенныхБумагИЭмитентов Тогда
		ОбластьОшибкаЗагрузки = Макет.ПолучитьОбласть("ОшибкаЗагрузки");
		ОбластьОшибкаЗагрузки.Параметры.ТекстОтказа = "Данные не загружены, или загружены с ошибкой (см. журнал регистрации)";
		ТабличныйДокумент.Вывести(ОбластьОшибкаЗагрузки);
	КонецЕсли;
	ОбластьСтрокаСервис.Параметры.СтрокаДанных =
		"Завершение: ?успех = [" + УспешноеСозданиеОбновлениеЦенныхБумагИЭмитентов + "] " + ТекущаяДатаСеанса();
	ТабличныйДокумент.Вывести(ОбластьСтрокаСервис);
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОтчетОЦеннойБумагеИзRudataAPIНаСервере()
	
	Если  Объект.ЦенныеБумаги.Количество() = 0 И Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите ISIN  и \ или Дату");
		Возврат Неопределено;
	КонецЕсли;
	
	ФильтрСтатусов = RuDataAPI.ФильтрПоАктуальнымСтатусамЦБ();
	Если ЗначениеЗаполнено(Объект.ДополнительныеСтатусыДляЗагрузки) Тогда
		ФильтрСтатусов = ФильтрСтатусов + ", " + СокрЛП(Объект.ДополнительныеСтатусыДляЗагрузки);
	КонецЕсли;
	
	ВходныеПараметры = Новый Структура;
	ЦенныеБумаги = Объект.ЦенныеБумаги.Выгрузить(, "ISIN");
	ISINs = ЦенныеБумаги.ВыгрузитьКолонку("ISIN");
	ВходныеПараметры.Вставить("ISINs", ISINs);
	ВходныеПараметры.Вставить("ДатаВремяОбновленияДанных", Объект.ДатаНачала);
	ВходныеПараметры.Вставить("ОбновитьБумагиВНеактуальномСтатусе", Объект.ОбновитьБумагиВНеактуальномСтатусе);
	ВходныеПараметры.Вставить("ФильтрСтатусовЦБ", ФильтрСтатусов);
	ВходныеПараметры.Вставить("ЭтоОтчет", Истина);
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Начало: "	 + ТекущаяДатаСеанса());
	ВыходныеПараметры = RuDataAPI.ДанныеДляСозданияОбновленияЦенныхБумаг(ВходныеПараметры);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Завершение: " + ТекущаяДатаСеанса());
	
	Если ЗначениеЗаполнено(ВыходныеПараметры.ТаблицаДанныхЦБ) Тогда
		
		ТабличныйДокумент = ОбщегоНазначения.ДанныеТаблицыЗначенийВТабличныйДокументСКД(ВыходныеПараметры.ТаблицаДанныхЦБ);
		Возврат ТабличныйДокумент;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_ЗагрузкаКурсовВалют

&НаСервереБезКонтекста
Функция ПредставлениеВалютыНаСервере(Валюта)
	
	СПолнымНаименованием = Истина;
	Возврат Справочники.Валюты.ПредставлениеВалюты(Валюта, СПолнымНаименованием);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокЗагружаемыхВалют()

	Возврат Справочники.Валюты.ЗагружаемыеВалюты();

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокБазовыхВалют()

	Возврат Справочники.Валюты.ПолучитьСписокБазовыхВалют();

КонецФункции

&НаСервере
Процедура ЗагрузкаКурсовВалют(ТабличныйДокумент, ПараметрыЗагрузки = Неопределено)
	
	Отказ = Ложь;
	ТекстОтказа = "";
	Если ВыводитьПолученнуюИнформациюВЛогеЗагрузки Тогда
		ЛогПолученныхДанных = Новый ТекстовыйДокумент;
	Иначе
		ЛогПолученныхДанных = Неопределено;
	КонецЕсли;
	
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок(); 
	
	// Лог загрузки
	Макет = Обработки.СервисыMarketDataAPI.ПолучитьМакет("Лог");
	ОбластьВидИнформации = Макет.ПолучитьОбласть("ВидИнформации");
	ПериодЗагрузки = Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy") + " - " + Формат(Объект.ДатаОкончания, "ДФ=dd.MM.yyyy");
	ОбластьВидИнформации.Параметры.ВидЗагружаемойИнформации = СтрШаблон(НСтр("ru ='Загрузка курсов валют за %1'"), ПериодЗагрузки);
	ТабличныйДокумент.Вывести(ОбластьВидИнформации, 0);
	
	////////////////////////////
	// Загрузка курсов валют
	
	МассивВалют = Новый Массив;
	Для Каждого ТекЭлемент Из СписокВалют Цикл
		Если ТекЭлемент.Пометка = Ложь Тогда
			Продолжить;
		КонецЕсли;
		МассивВалют.Добавить(ТекЭлемент.Значение);
	КонецЦикла;
	
	МассивБазовыхВалют = Новый Массив;
	Для Каждого ТекЭлемент Из СписокБазовыхВалют Цикл
		Если ТекЭлемент.Пометка = Ложь Тогда
			Продолжить;
		КонецЕсли;
		МассивБазовыхВалют.Добавить(ТекЭлемент.Значение);
	КонецЦикла;
	
	Период = Новый СтандартныйПериод(Объект.ДатаНачала, Объект.ДатаОкончания);
	MarketData.ЗагрузитьКурсыВалютИнтерфакс(Период,
		МассивБазовыхВалют, МассивВалют, Отказ, ТекстОтказа, ТабличныйДокумент, ЛогПолученныхДанных);
	
	// Если отказ, то выводим ошибку.
	Если Отказ Тогда
		ОбластьОшибкаЗагрузки = Макет.ПолучитьОбласть("ОшибкаЗагрузки");
		ОбластьОшибкаЗагрузки.Параметры.ТекстОтказа = ТекстОтказа;
		ТабличныйДокумент.Вывести(ОбластьОшибкаЗагрузки);
	КонецЕсли;
	
	// Выводим информацию полученную из Интерфакс
	Если ВыводитьПолученнуюИнформациюВЛогеЗагрузки Тогда
		ВывестиВЛогеЗагрузкиИнформациюИзСервиса(ЛогПолученныхДанных, ТабличныйДокумент, Макет);
	КонецЕсли;
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКупоныCBonds(ТабличныйДокумент, ПараметрыЗагрузки = Неопределено)
	
	ИмяДействия = "ЗагрузитьКупоныCBonds";
	ВидИсточника = ИмяДействия;
	Комментарий = "ru ='Загрузка НКД CBonds за %1'";
	
	Отказ = Ложь;
	ТекстОтказа = "";
	Если ВыводитьПолученнуюИнформациюВЛогеЗагрузки Тогда
		ЛогПолученныхДанных = Новый ТекстовыйДокумент;
	Иначе
		ЛогПолученныхДанных = Неопределено;
	КонецЕсли;
	
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	
	// Лог загрузки
	Макет = Обработки.СервисыMarketDataAPI.ПолучитьМакет("Лог");
	ОбластьВидИнформации = Макет.ПолучитьОбласть("ВидИнформации");
	ПериодЗагрузки = Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy") + " - " + Формат(Объект.ДатаОкончания, "ДФ=dd.MM.yyyy");
	ОбластьВидИнформации.Параметры.ВидЗагружаемойИнформации = СтрШаблон(НСтр(Комментарий), ПериодЗагрузки);
	ТабличныйДокумент.Вывести(ОбластьВидИнформации, 0);
	
	////////////////////////////
	// Загрузка котировок
	
	Период = Новый СтандартныйПериод(Объект.ДатаНачала, Объект.ДатаОкончания);
	ПараметрыИсточника = Новый Структура;
	ПараметрыИсточника.Вставить("ИмяДействия"	, ИмяДействия);
	ПараметрыИсточника.Вставить("ВидИсточника"	, ВидИсточника);
	ПараметрыИсточника.Вставить("ТаблицаISIN"	, Объект.ЦенныеБумаги.Выгрузить());
	
	MarketData.ЗагрузитьНКДВнешнегоСервиса(ИмяНастроекСервиса, Период, ПараметрыИсточника,
		Отказ, ТекстОтказа, ТабличныйДокумент, ЛогПолученныхДанных);
	
	// Если отказ, то выводим ошибку.
	Если Отказ Тогда
		ОбластьОшибкаЗагрузки = Макет.ПолучитьОбласть("ОшибкаЗагрузки");
		ОбластьОшибкаЗагрузки.Параметры.ТекстОтказа = ТекстОтказа;
		ТабличныйДокумент.Вывести(ОбластьОшибкаЗагрузки);
	КонецЕсли;
	
	// Выводим информацию полученную из Внешнего сервиса
	Если ВыводитьПолученнуюИнформациюВЛогеЗагрузки Тогда
		ВывестиВЛогеЗагрузкиИнформациюИзСервиса(ЛогПолученныхДанных, ТабличныйДокумент, Макет);
	КонецЕсли;
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиISINОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ISIN = Элементы.ЦенныеБумаги.ТекущиеДанные.ISIN;
	Если ЗначениеЗаполнено(ISIN) Тогда
		ЦБ = ЦеннаяБумагаПоISIN(ISIN);
		ПоказатьЗначение(, ЦБ);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦеннаяБумагаПоISIN(ISIN)
	Возврат Справочники.ЦенныеБумаги.ЦеннаяБумагаПоРегНомеруИISIN(ISIN, Неопределено, Ложь);
КонецФункции

#КонецОбласти

#КонецОбласти