
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ОбработкаУдаленияПроведения(Отказ);
	Для Индекс = 0 По СоставПоручения.Количество() - 1 Цикл
		Объект = Документы.ОперацииЦБ.СоздатьДокумент();
		Объект.НомерСтрокиОснования = Индекс;
		Объект.Заполнить(Ссылка);
		Объект.Дата = ДатаИсполнения;
		Объект.УстановитьНовыйНомер();
		Объект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Выборка = Документы.ОперацииЦБ.Выбрать(НачалоДня(Дата), КонецДня(Дата), Новый Структура("ДокументОснование", Ссылка));
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.ПолучитьОбъект();
		Объект.ПометкаУдаления = Истина;
		Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Если Дата >= Константы.ИспользоватьНовуюНумерациюС.Получить() Тогда
		Номер = НумераторыОбъектов.ПолучитьНомерДокументаВРазрезеМинуты(Ссылка, Формат(Дата, "ДФ=yyMMdd/HHmm-"), Дата, Префикс);
	Иначе
		Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаИсполнения) Тогда
		ДатаИсполнения = Дата;
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
	ВходящийНомерПоручения = Номер;
	
КонецПроцедуры
