Перем мКлючСвязиДанныхКДиЦБ;
Перем ИмяСобытия;
Перем ОбработкаНРД Экспорт;
Перем МассивВхНомеров;

Процедура ИнициироватьСоединение(Параметры = Неопределено) Экспорт
	ВнешниеДанные.ИнициироватьСоединение(ОбработкаНРД, "ФайлыНРД", Параметры);
КонецПроцедуры

// Читает данные из файлового шлюза в табличную часть обработки
//
// Параметры:
//  ФайлыFCDR_2017_02	 - Массив, Неопределено - массив структур, в которых содержатся данные файлов FCDR
//  (см. ПолучитьДанныеИзФайла)
//
Процедура ПрочитатьФайлы(ФайлыFCDR_2017_02 = Неопределено) Экспорт
	ДанныеКорпоративныхДействий.Очистить();
	ВопросыКГолосованию.Очистить();
	ЦенныеБумаги.Очистить();
	ВариантыУчастия.Очистить();
	
	Если ВышестоящийДепозитарий = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияБЭБ") Тогда
		ОбработатьФайлыБЭБ();
	ИначеЕсли ВышестоящийДепозитарий = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияРДЦ") Тогда
		ОбработатьФайлыРДЦ();
	Иначе
		ОбработатьISOФайл(ФайлыFCDR_2017_02);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьISOФайл(ФайлыFCDR_2017_02=Неопределено)
	Если ОбработкаНРД = Неопределено Тогда
		ИнициироватьСоединение();
	КонецЕсли;
	
	ФайлыFCDR_2017_02 = Новый Массив;
	ВременныеФайлыСтруктура = ОбработкаНРД.ВременныеФайлыНРД(ПутьККаталогу);
	ВременныеФайлы = ВременныеФайлыСтруктура.Файлы;
	Для Каждого ВременныйФайл Из ВременныеФайлы Цикл
		// Обработать файл
		ОписаниеДанных = ПолучитьДанныеИзФайла(ВременныйФайл.ИмяВременногоФайлаXML, ВременныйФайл.ИсходноеИмяФайла,
												ВременныйФайл.Каталог, ФайлыFCDR_2017_02);
		ОбработатьДанные(ОписаниеДанных);
		
		// Удалить xml-файл из временного каталога
		Попытка
			УдалитьФайлы(ВременныйФайл.ИмяВременногоФайлаXML);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	КаталогиКвитанцийКУдалению = ВременныеФайлыСтруктура.КаталогиКвитанцийКУдалению;
	Для Каждого ИнформацияДляАрхивации Из КаталогиКвитанцийКУдалению Цикл
		АрхивироватьВыпискиОтРегистраторов(ИнформацияДляАрхивации.ИмяРегистратора, "W", ИнформацияДляАрхивации.КаталогW);
		ПеренестиКаталогВАрхив("W", ИнформацияДляАрхивации.КаталогW);
	КонецЦикла;
	
	ДанныеКорпоративныхДействий.Сортировать("ВходящийДокументДата,КодОтчета");
КонецПроцедуры

Процедура ОбработатьФайлыБЭБ()
	КаталогБЭБ = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(СокрЛП(ПутьККаталогу));
	МаскиИмениФайла = Новый Массив;
	МаскиИмениФайла.Добавить("corp_*.xml");
	
	ТекДата = ПериодНачало;
	СекундВСутках = ОбщегоНазначенияПовтИсп.СекундВСутках();
	Пока ТекДата <= ПериодКонец Цикл
		КаталогБЭБЗаДату = КаталогБЭБ + Формат(ТекДата, "ДФ=yyyy_MM_dd");
		Для Каждого Маска Из МаскиИмениФайла Цикл
			ИнфоСообщенияБЭБЗаДату = НайтиФайлы(КаталогБЭБЗаДату, Маска);
			Для Каждого Файл Из ИнфоСообщенияБЭБЗаДату Цикл
				ОписаниеДанных = ПолучитьДанныеИзФайла(Файл.ПолноеИмя);
				Если ТипЗнч(ОписаниеДанных.ДанныеФайла) = Тип("Структура") Тогда
					ОписаниеДанных.ДанныеФайла.Вставить("ПолноеИмяФайла", Файл.ПолноеИмя);
				КонецЕсли;
				ОбработатьДанные(ОписаниеДанных);
			КонецЦикла;
		КонецЦикла;
		ТекДата = ТекДата + СекундВСутках;
	КонецЦикла;
КонецПроцедуры

// Находит и обрабатывает файлы КД РДЦ
//
Процедура ОбработатьФайлыРДЦ()
	
	КаталогРДЦ = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(СокрЛП(ПутьККаталогу));
	ТекДата = ПериодНачало;
	
	СекундВСутках = ОбщегоНазначенияПовтИсп.СекундВСутках();
	
	Пока ТекДата <= ПериодКонец Цикл
		
		КаталогРДЦЗаДату = КаталогРДЦ + Формат(ТекДата, "ДФ=yyyy_MM_dd");
		ИнфоСообщенияРДЦЗаДату = НайтиФайлы(КаталогРДЦЗаДату, "*.xml");
		
		Для Каждого Файл Из ИнфоСообщенияРДЦЗаДату Цикл
			ОписаниеДанных = ПолучитьДанныеИзФайла(Файл.ПолноеИмя);
			Если ТипЗнч(ОписаниеДанных.ДанныеФайла) = Тип("Структура") Тогда
				ОписаниеДанных.ДанныеФайла.Вставить("ПолноеИмяФайла", Файл.ПолноеИмя);
				Если Не ЗначениеЗаполнено(ЗначениеСвойства(ОписаниеДанных.ДанныеФайла, "КодОтчета")) Тогда
					ОписаниеДанных.ДанныеФайла.Вставить("КодОтчета", КодОтчетаПоНаименованиюФайла(Файл.Имя));
				КонецЕсли;
			КонецЕсли;
			ОбработатьДанные(ОписаниеДанных);
		КонецЦикла;
		
		ТекДата = ТекДата + СекундВСутках;
		
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////
// Работа с ISO файлами

Процедура ОбработатьДанные(ОписаниеДанных)
	Если ОписаниеДанных.ДанныеФайла = Неопределено Тогда
		Возврат;
		
	ИначеЕсли ОписаниеДанных.Обработка = "ОбработатьДанныеИзФайлаISO" Тогда
		ОбработатьДанныеИзФайлаISO(ОписаниеДанных.ДанныеФайла, "");
		
	ИначеЕсли ОписаниеДанных.Обработка = "ОбработатьДанныеCorporateActionNotification" Тогда
		ОбработатьДанныеCorporateActionNotification(ОписаниеДанных.ДанныеФайла, "");
		
	ИначеЕсли ОписаниеДанных.Обработка = "ОбработатьДанныеMeetingInstructionStatus" Тогда
		ОбработатьДанныеMeetingInstructionStatus(ОписаниеДанных.ДанныеФайла, "");
		
	ИначеЕсли ОписаниеДанных.Обработка = "ОбработатьДанныеCorporateActionCancellationAdvice" Тогда
		ОбработатьДанныеCorporateActionCancellationAdvice(ОписаниеДанных.ДанныеФайла);
	КонецЕсли;
КонецПроцедуры

// BSLLS:LatinAndCyrillicSymbolInWord-off

Функция ПолучитьДанныеИзФайла(ПолныйПутьФайла, ИсходноеИмяФайлаСПутем = Неопределено, Каталог = Неопределено, 
								ФайлыFCDR_2017_02 = Неопределено)
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПолныйПутьФайла,,, "windows-1251");
	Результат = Новый Структура("ДанныеФайла,Обработка");
	Пока ЧтениеXML.Прочитать() Цикл
		ЭтоФормат2017 = ЧтениеXML.Имя = "DISCLOSURE_CANCELLATION_REQUEST"
			Или ЧтениеXML.Имя = "DISCLOSURE_REQUEST"
			Или ЧтениеXML.Имя = "REGISTER_OF_SHAREHOLDERS_STATUS_ADVICE"
			Или ЧтениеXML.Имя = "STATEMENT_OF_HOLDINGS";
		
		Если ЧтениеXML.Имя = "xml-stylesheet" Тогда
			Продолжить;
		ИначеЕсли ЧтениеXML.Имя = "MeetingNotification" Тогда
			Результат.Вставить("ДанныеФайла", ОбработатьMeetingNotification(ЧтениеXML));
			Результат.Вставить("Обработка", "ОбработатьДанныеИзФайлаISO");
			
		ИначеЕсли ЧтениеXML.Имя = "MeetingCancellation" Тогда 
			Результат.Вставить("ДанныеФайла", ОбработатьMeetingCancelation(ЧтениеXML));
			Результат.Вставить("Обработка", "ОбработатьДанныеИзФайлаISO");
			
		ИначеЕсли ЧтениеXML.Имя = "MeetingResultDissemination" Тогда
			Результат.Вставить("ДанныеФайла", ОбработатьMeetingResultDissemination(ЧтениеXML));
			Результат.Вставить("Обработка", "ОбработатьДанныеИзФайлаISO");
			
		ИначеЕсли ЧтениеXML.Имя = "CorporateActionNotification" Тогда
			Результат.Вставить("ДанныеФайла", ОбработатьCorporateActionNotification(ЧтениеXML));
			Результат.Вставить("Обработка", "ОбработатьДанныеCorporateActionNotification");
			
		ИначеЕсли ЧтениеXML.Имя = "MeetingInstructionStatus" Тогда
			Результат.Вставить("ДанныеФайла", ОбработатьMeetingInstructionStatus(ЧтениеXML));
			Результат.Вставить("Обработка", "ОбработатьДанныеMeetingInstructionStatus");
			
		ИначеЕсли ЧтениеXML.Имя = "CorporateActionCancellationAdvice" Тогда
			Результат.Вставить("ДанныеФайла", ОбработатьCorporateActionCancellationAdvice(ЧтениеXML));
			Результат.Вставить("Обработка", "ОбработатьДанныеCorporateActionCancellationAdvice");
			
		ИначеЕсли ЭтоФормат2017 Тогда
			ЧтениеXML.Закрыть();
			Файл = Новый ЧтениеТекста(ПолныйПутьФайла,"windows-1251");
			Текст = Файл.Прочитать();
			Файл.Закрыть();
			Результат.Вставить("ДанныеФайла", Текст);
			Результат.Вставить("Обработка", "FCDR_2017_02");
			ФайлыFCDR_2017_02.Добавить(Результат);
		ИначеЕсли ЧтениеXML.Имя = "SRDIIMessages" Тогда
			Результат = РезультатОбработкиSRDIIMessages(ЧтениеXML);
		КонецЕсли;
		
		Прервать;
	КонецЦикла;
	
	Результат.Вставить("ПолныйПутьФайла", ПолныйПутьФайла);
	Результат.Вставить("ИсходноеИмяФайлаСПутем", ИсходноеИмяФайлаСПутем);
	Результат.Вставить("Каталог", Каталог);
	
	Возврат Результат;
КонецФункции
// BSLLS:LatinAndCyrillicSymbolInWord-on

Функция РезультатОбработкиSRDIIMessages(Чтение)
	Результат = Новый Структура("ДанныеФайла,Обработка");
	Результат.Обработка = "ОбработатьДанныеИзФайлаISO";
	
	Документ = СтруктураДокументаXML(Чтение);
	ТипСообщения = ЗначениеСвойства(Документ, "AppHdr.MsgDefIdr");
	Если ТипСообщения = "seev.001.001.10" Тогда
		Результат.ДанныеФайла = РезультатОбработкиMeetingNotificationSRDII(Документ);
	КонецЕсли;
	Если ТипСообщения = "seev.002.001.09" Тогда
		Результат.ДанныеФайла = РезультатОбработкиMeetingCancelationSRDII(Документ);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция РезультатОбработкиMeetingNotificationSRDII(Документ)
	ПараметрыКД	= Новый Структура;
	
	ПараметрыКД.Вставить("ВходящийДокументНомер", ЗначениеСвойства(Документ, "AppHdr.BizMsgIdr"));
	
	ВходящийДокументДата = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ, "AppHdr.CreDt"));
	ПараметрыКД.Вставить("ВходящийДокументДата", ВходящийДокументДата + СмещениеСтандартногоВремени(ЧасовойПояс()));
	
	ПараметрыКД.Вставить("КДРеференсВходящий",	ЗначениеСвойства(Документ, "Document.MtgNtfctn.Mtg.MtgId"));
	ПараметрыКД.Вставить("ТипСобрания",	ЗначениеСвойства(Документ, "Document.MtgNtfctn.Mtg.TP"));
	ПараметрыКД.Вставить("КодОтчета",	ЗначениеСвойства(Документ, "AppHdr.BizSvc"));
	
	ТипУведомленияКод = ЗначениеСвойства(Документ, "Document.MtgNtfctn.NtfctnGnlInf.NtfctnTp");
	ТипУведомления = Справочники.ТипыУведомления.НайтиПоКоду(ТипУведомленияКод);
	ПараметрыКД.Вставить("ТипУведомления", ТипУведомления);
	
	КлассСобрания = ЗначениеСвойства(Документ, "Document.MtgNtfctn.Mtg.Clssfctn.Cd");
	Если КлассСобрания <> Неопределено Тогда
		ПараметрыКД.Вставить("КлассСобрания", КлассСобрания);
	КонецЕсли;
	
	ПараметрыКД.Вставить("Комментарий", ЗначениеСвойства(Документ, "Document.MtgNtfctn.Vote.AddtlVtngRqrmnts"));
	
	ДатаСтрокой = ЗначениеСвойства(Документ,
		"Document.MtgNtfctn.Vote.VoteDdln.DtOrDtTm.Dt",
		"Document.MtgNtfctn.Vote.VoteDdln.DtOrDtTm.DtTm",
		"Document.MtgNtfctn.Vote.VoteMktDdln.DtOrDtTm.Dt",
		"Document.MtgNtfctn.Vote.VoteMktDdln.DtOrDtTm.DtTm");
	ДатаОкончанияПриемаИнструкцийНРД = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаСтрокой);
	ПараметрыКД.Вставить("ДатаОкончанияПриемаИнструкцийНРД", ДатаОкончанияПриемаИнструкцийНРД);
	
	ДатаСтрокой = ЗначениеСвойства(Документ,
			"Document.MtgNtfctn.Vote.VoteMktDdln.DtOrDtTm.Dt",
			"Document.MtgNtfctn.Vote.VoteMktDdln.DtOrDtTm.DtTm");
	ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаСтрокой);
	ПараметрыКД.Вставить("ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента", ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента);
	
	ДатаОкончанияПриемаИнструкцийВТБКБ = Документы.УведомлениеКлиентам.ДобавитьРабочийДень(ДатаОкончанияПриемаИнструкцийНРД, -2);
	СкопироватьВремя(ДатаОкончанияПриемаИнструкцийВТБКБ, ДатаОкончанияПриемаИнструкцийНРД);
	ПараметрыКД.Вставить("ДатаОкончанияПриемаИнструкцийВТБКБ", ДатаОкончанияПриемаИнструкцийВТБКБ);
	
	ДатаСтрокой = ЗначениеСвойства(Документ,
		"Document.MtgNtfctn.Mtg.EntitlmntFxgDt.Dt.Dt",
		"Document.MtgNtfctn.Mtg.EntitlmntFxgDt.Dt.DtCd");
	ПараметрыКД.Вставить("ДатаФиксации", СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаСтрокой));
	
	ПараметрыКД.Вставить("АдресВСетиИнтернет", ЗначениеСвойства(Документ, "Document.MtgNtfctn.Mtg.AddtlDcmnttnURLAdr"));
	МестоПроведенияСобрания = ЗначениеСвойства(Документ, "Document.MtgNtfctn.MtgDtls.Lctn.Adr.AdrLine");
	ПараметрыКД.Вставить("МестоПроведенияСобрания", МестоПроведенияСобрания);
	
	ДатаСтрокой = ЗначениеСвойства(Документ,
		"Document.MtgNtfctn.MtgDtls.DtAndTm.DtOrDtTm.Dt",
		"Document.MtgNtfctn.MtgDtls.DtAndTm.DtOrDtTm.DtTm",
		"Document.MtgNtfctn.MtgDtls.DtAndTm.DtCd");
	ПараметрыКД.Вставить("ДатаПроведенияСобрания", СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаСтрокой));
		
	УзелScty = ЗначениеСвойства(Документ, "Document.MtgNtfctn.Scty");
	FinInstrmId_Desc = "FinInstrmId.Desc";
	СтруктураПолей = Новый Структура("ISIN,Desc,КодНРД,ГосРегНомер,НомерСчетаДепо,FaceAmnt,Unit,BalTp,Dt,SfkpgPlc");
	СтруктураПолей.ISIN = "FinInstrmId.ISIN";
	СтруктураПолей.Desc = "FinInstrmId.Desc";
	СтруктураПолей.FaceAmnt = "Bal.Qty.FaceAmnt";
	СтруктураПолей.Unit = "Bal.Qty.Unit";
	СтруктураПолей.КодНРД = FinInstrmId_Desc;
	СтруктураПолей.ГосРегНомер = FinInstrmId_Desc;
	ПараметрыКД.Вставить("МассивИнформацииОЦБ", МассивИнформацииОЦБ(УзелScty, СтруктураПолей));
	
	Вопросы = ЗначениеСвойства(Документ, "Document.MtgNtfctn.Rsltn");
	НормальныеВопросы = Новый Массив;
	Если Вопросы <> Неопределено Тогда
		Для Каждого Вопрос Из Вопросы Цикл
			
			// BSLLS:Typo-off
			СтрВопроса = Новый Структура(
				"НомерВопроса, ДляИнформации, КуммулятивныйВопрос, ТекстВопроса, Коэффициент, ВариантыГолосования");
			// BSLLS:Typo-on
			СтрВопроса.НомерВопроса = Вопрос.IssrLabl;
			СтрВопроса.ТекстВопроса = "";
			СтрВопроса.ДляИнформации = Вопрос.ForInfOnly;
			// BSLLS:Typo-off
			СтрВопроса.КуммулятивныйВопрос = Ложь;
			// BSLLS:Typo-on
			СтрВопроса.Коэффициент = 1;
			ОбработатьВложенныйТегКоллекции(Вопрос.Desc, "Desc", СтрВопроса.ТекстВопроса);
			
			СтрокиВариантовГолосования = ВариантыГолосованияВСтрокиДляSRDII(Вопрос);
			СтрВопроса.ВариантыГолосования = ИзДвоичнойВДесятичную(ДвоичнаяСтрокаВариантов(СтрокиВариантовГолосования));
			НормальныеВопросы.Добавить(СтрВопроса);
		КонецЦикла;
	КонецЕсли;
	ПараметрыКД.Вставить("ВариантыГолосования", НормальныеВопросы);
	
	ДобавитьДополнительнуюИнформацию_SRDII(Документ, ПараметрыКД);
	
	Если ПараметрыКД.МассивИнформацииОЦБ.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат ПараметрыКД;
	КонецЕсли;
КонецФункции

Функция РезультатОбработкиMeetingCancelationSRDII(Документ)
	ПараметрыКД	= Новый Структура;
	
	ПараметрыКД.Вставить("ВходящийДокументНомер", ЗначениеСвойства(Документ, "AppHdr.BizMsgIdr"));
	
	ВходящийДокументДата = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ, "AppHdr.CreDt"));
	ПараметрыКД.Вставить("ВходящийДокументДата", ВходящийДокументДата + СмещениеСтандартногоВремени(ЧасовойПояс()));
	
	ПараметрыКД.Вставить("КДРеференсВходящий",	ЗначениеСвойства(Документ, "Document.MtgCxl.MtgRef.MtgId"));
	ПараметрыКД.Вставить("КодОтчета",	ЗначениеСвойства(Документ, "AppHdr.BizSvc"));
	ПараметрыКД.Вставить("ТипСобрания",	ЗначениеСвойства(Документ, "Document.MtgCxl.MtgRef.TP"));
	
	КлассСобрания = ЗначениеСвойства(Документ, "Document.MtgCxl.MtgRef.Clssfctn.Cd");
	Если КлассСобрания <> Неопределено Тогда
		ПараметрыКД.Вставить("КлассСобрания", КлассСобрания);
	КонецЕсли;
	
	КодПричиныОтмены = ЗначениеСвойства(Документ, "Document.MtgCxl.Rsn.CxlRsnCd.Cd");
	ПричинаОтмена = Справочники.ПричиныОтмены.НайтиПоКоду(КодПричиныОтмены);
	Если Не ЗначениеЗаполнено(ПричинаОтмена) И ЗначениеЗаполнено(КодПричиныОтмены) Тогда
		ПричинаОтменаОбъект = Справочники.ПричиныОтмены.СоздатьЭлемент();
		ПричинаОтменаОбъект.Код = КодПричиныОтмены;
		ПричинаОтменаОбъект.Наименование = КодПричиныОтмены;
		ПричинаОтменаОбъект.Записать();
		ПричинаОтмена = ПричинаОтменаОбъект.Ссылка;
	КонецЕсли;
	ПараметрыКД.Вставить("ПричинаОтмены", ПричинаОтмена);
	
	УзелScty = ЗначениеСвойства(Документ, "Document.MtgCxl.Scty");
	СтруктураПолей = Новый Структура("КодНРД,НомерСчетаДепо,Unit,BalTp,Dt");
	СтруктураПолей.КодНРД = "FinInstrmId.Desc";
	СтруктураПолей.Unit = "Bal.Qty.Unit";
	ПараметрыКД.Вставить("МассивИнформацииОЦБ", МассивИнформацииОЦБ(УзелScty, СтруктураПолей));
	
	ДобавитьДополнительнуюИнформацию_SRDII(Документ, ПараметрыКД);
	
	Возврат ПараметрыКД;
КонецФункции

Функция ВариантыГолосованияВСтрокиДляSRDII(Вопрос)
	Результат = Новый Массив;
	VoteInstrTp = ЗначениеСвойства(Вопрос, "VoteInstrTp");
	Если ТипЗнч(VoteInstrTp) = Тип("Массив") Тогда
		Для Каждого Элемент Из VoteInstrTp Цикл
			Tp = ЗначениеСвойства(Элемент, "VoteInstrTpCd.Tp");
			Результат.Добавить(Tp);
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура ДобавитьДополнительнуюИнформацию_SRDII(Документ, ПараметрыКД)
	
	ПараметрыКД.Вставить("ДополнительнаяИнформация", "");
	
	ТегКоллекция = ЗначениеСвойства(Документ, "Document.MtgNtfctn.AddtlInf.Dsclmr");
	ОбработатьВложенныйТегКоллекции(ТегКоллекция, "AddtlInf", ПараметрыКД.ДополнительнаяИнформация);
	
	ТегКоллекция = ЗначениеСвойства(Документ, "Document.MtgNtfctn.SplmtryData");
	ОбработатьВложенныйТегКоллекции(ТегКоллекция, "PlcAndNm", ПараметрыКД.ДополнительнаяИнформация);
	
	ТегКоллекция = ЗначениеСвойства(Документ, "Document.MtgCxl.SplmtryData");
	ОбработатьВложенныйТегКоллекции(ТегКоллекция, "PlcAndNm", ПараметрыКД.ДополнительнаяИнформация);
	
	Если ЗначениеЗаполнено(ПараметрыКД.ДополнительнаяИнформация) Тогда
		ДобавитьФиксированныеСтрокиВДополнительнуюИнформацию(ПараметрыКД);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьВложенныйТегКоллекции(ТегКоллекция, ИмяВложенногоТега, ПараметрДляОбновления)
	
	ЗначениеВложенногоТега = "";
	Если ТипЗнч(ТегКоллекция) = Тип("Массив") Тогда
		Для Каждого ТребуемыйЭлемент Из ТегКоллекция Цикл
			ДополнительнаяИнформацияИзФайла = ЗначениеСвойства(ТребуемыйЭлемент, ИмяВложенногоТега);
			Если ЗначениеЗаполнено(ДополнительнаяИнформацияИзФайла) Тогда
				ЗначениеВложенногоТега = ЗначениеВложенногоТега + ?(ЗначениеЗаполнено(ЗначениеВложенногоТега), Символы.ПС, "")
					+ ДополнительнаяИнформацияИзФайла;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ТегКоллекция) = Тип("Структура") Тогда
		ЗначениеВложенногоТега = ЗначениеСвойства(ТегКоллекция, ИмяВложенногоТега);
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеВложенногоТега) Тогда
		ПараметрДляОбновления = ПараметрДляОбновления + ?(ЗначениеЗаполнено(ПараметрДляОбновления), Символы.ПС, "")
			+ ЗначениеВложенногоТега;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьДанныеИзФайлаISO(ДанныеФайла, ФайлZIP)
	// Создание строки по раскрытию
	НоваяСтрока	= ДанныеКорпоративныхДействий.Добавить();
	НоваяСтрока.ПолноеИмяФайла = ЗначениеСвойства(ДанныеФайла, "ПолноеИмяФайла");
	НоваяСтрока.Обрабатывать						= Истина;
	НоваяСтрока.Организация							= Константы.ОрганизацияПоУмолчанию.Получить();
	НоваяСтрока.Инициатор							= ВышестоящийДепозитарий;
	НоваяСтрока.ВходящийДокументДата				= ЗначениеСвойства(ДанныеФайла,"ВходящийДокументДата");
	НоваяСтрока.ВходящийДокументНомер				= ЗначениеСвойства(ДанныеФайла,"ВходящийДокументНомер");
	НоваяСтрока.КДРеференсВходящий					= ЗначениеСвойства(ДанныеФайла,"КДРеференсВходящий");
	НоваяСтрока.Комментарий							= ЗначениеСвойства(ДанныеФайла,"Комментарий");
	НоваяСтрока.АдресВСетиИнтернет					= ЗначениеСвойства(ДанныеФайла,"АдресВСетиИнтернет");
	НоваяСтрока.АдресВСетиИнтернетОтмена			= ЗначениеСвойства(ДанныеФайла,"АдресВСетиИнтернетОтмена");
	НоваяСтрока.МестоПроведенияСобрания				= ЗначениеСвойства(ДанныеФайла,"МестоПроведенияСобрания");
	НоваяСтрока.ДатаОкончанияПриемаИнструкцийНРД	= ЗначениеСвойства(ДанныеФайла,"ДатаОкончанияПриемаИнструкцийНРД");
	НоваяСтрока.ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента = ЗначениеСвойства(ДанныеФайла,
		"ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента");
	НоваяСтрока.ДатаОкончанияПриемаИнструкцийВТБКБ	= ЗначениеСвойства(ДанныеФайла,"ДатаОкончанияПриемаИнструкцийВТБКБ");
	НоваяСтрока.КодОтчета 							= ЗначениеСвойства(ДанныеФайла,"КодОтчета"); 
	НоваяСтрока.ПричинаОтмены 						= ЗначениеСвойства(ДанныеФайла,"ПричинаОтмены"); 
	НоваяСтрока.ДатаФиксации                        = ЗначениеСвойства(ДанныеФайла,"ДатаФиксации"); 
	НоваяСтрока.ТипУведомления 						= ЗначениеСвойства(ДанныеФайла, "ТипУведомления");

	// Определим вид КД
	КодТипСобрания	= СокрЛП(ЗначениеСвойства(ДанныеФайла,"ТипСобрания"));
	ТипСобрания		= Справочники.РСВ_ТипСобрания.НайтиПоКоду(КодТипСобрания);
	Если Не ЗначениеЗаполнено(ТипСобрания) И ЗначениеЗаполнено(КодТипСобрания) Тогда
		ТипСобранияОбъект				= Справочники.РСВ_ТипСобрания.СоздатьЭлемент();
		ТипСобранияОбъект.Код			= КодТипСобрания;
		ТипСобранияОбъект.Наименование	= КодТипСобрания;
		ТипСобранияОбъект.Записать();
		
		ТипСобрания	= ТипСобранияОбъект.Ссылка;
	КонецЕсли;
	НоваяСтрока.ТипСобрания	= ТипСобрания;
	
	КодКлассСобрания = СокрЛП(ЗначениеСвойства(ДанныеФайла,"КлассСобрания"));
	Если Не КодКлассСобрания = Неопределено Тогда
		КлассСобрания = Справочники.РСВ_КлассСобрания.НайтиПоКоду(КодКлассСобрания);
		Если Не ЗначениеЗаполнено(КлассСобрания) И ЗначениеЗаполнено(КодКлассСобрания) Тогда
			КлассСобранияОбъект					= Справочники.РСВ_КлассСобрания.СоздатьЭлемент();
			КлассСобранияОбъект.Код				= КодКлассСобрания;
			КлассСобранияОбъект.Наименование	= КодКлассСобрания;
			КлассСобранияОбъект.Записать();
			
			КлассСобрания = КлассСобранияОбъект.Ссылка;
		КонецЕсли;
		НоваяСтрока.КлассСобрания = КлассСобрания;
	КонецЕсли;
	
	Если КодТипСобрания = "GMET" Тогда
		Если КодКлассСобрания = "AMET" Или КодКлассСобрания = Неопределено Тогда
			ВидКДКод = "MEET";
		ИначеЕсли КодКлассСобрания = "OMET" Тогда
			ВидКДКод = "OMET";
		Иначе
			ВидКДКод	= "BMET";
		КонецЕсли;
	ИначеЕсли КодТипСобрания = "XMET" Тогда
		Если КодКлассСобрания = "CORT" Тогда
			ВидКДКод = "CMET";
		Иначе
			ВидКДКод = "XMET";
		КонецЕсли;
	Иначе
		ВидКДКод = "XMET";
	КонецЕсли;
	
	ВидКД = Справочники.ВидыКорпоративныхДействий.НайтиПоКоду(ВидКДКод);
	Если Не ЗначениеЗаполнено(ВидКД) И ЗначениеЗаполнено(ВидКДКод) Тогда
		ВидКДОбъект				= Справочники.ВидыКорпоративныхДействий.СоздатьЭлемент();
		ВидКДОбъект.Код			= ВидКДКод;
		ВидКДОбъект.Наименование= ВидКДКод;
		ВидКДОбъект.Записать();
		
		ВидКД	= ВидКДОбъект.Ссылка;
	КонецЕсли;
	НоваяСтрока.ВидКД	= ВидКД;
	// Обработаем даты проведения собраний
	НоваяСтрока.ДатаПроведенияСобрания	= ЗначениеСвойства(ДанныеФайла,"ДатаПроведенияСобрания");
	// Обработаем данные по ЦБ и заполним на основании их поля таблицы
	МассивИнформацииЦБ	= ЗначениеСвойства(ДанныеФайла,"МассивИнформацииОЦБ");
	Если МассивИнформацииЦБ <> Неопределено Тогда
		Для Каждого ИнформацияЦБ Из МассивИнформацииЦБ Цикл
			ЦеннаяБумага		= ЦеннаяБумагаПоКодуЗагрузкиНДЦ(ИнформацияЦБ.КодНРД, ТекущаяДатаСеанса());
			Если Не ЗначениеЗаполнено(ЦеннаяБумага) Тогда 
				ВызватьИсключение "При загрузке корпоративного действия не удалось определить ценную бумагу по коду загрузки - " + ИнформацияЦБ.КодНРД;
			КонецЕсли;
			НомерСчетаДепо		= ИнформацияЦБ.ПараметрыЦБНаСчетах.НомерСчетаДепо;
			ЗаполнитьСчетДепоИРеференс(НоваяСтрока, НомерСчетаДепо);
			ОтключитьОбработкуСобственныхСчетов(НоваяСтрока, НомерСчетаДепо);
			
			ДанныеПоСчету = ИнформацияЦБ.ПараметрыЦБНаСчетах.ДанныеПоСчету;
			Если ДанныеПоСчету <> Неопределено Тогда
				Если ДанныеПоСчету.Количество()>0 Тогда
					КоличествоЦБ = ДанныеПоСчету[0].Unit;
				Иначе
					КоличествоЦБ = 0;
				КонецЕсли;
			Иначе
				КоличествоЦБ = 0;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(НоваяСтрока.ЦеннаяБумага1) Тогда
				НоваяСтрока.Эмитент					= ЦеннаяБумага.Эмитент;
				НоваяСтрока.ЦеннаяБумага1			= ЦеннаяБумага;
				НоваяСтрока.ЦеннаяБумага1Остаток	= КоличествоЦБ;
			Иначе
				Если НоваяСтрока.ЦеннаяБумага1.Эмитент <> ЦеннаяБумага.Эмитент Тогда
					ВызватьИсключение "При формирова списка 'Раскрытие списка владельцев' - по входящему №"+НоваяСтрока.ВходящийДокументНомер+" от: "+НоваяСтрока.ВходящийДокументДата+" - определены ЦБ с разными 'Эмитентами'";
				КонецЕсли;
				НоваяСтрока.ЦеннаяБумага2			= ЦеннаяБумага;
				НоваяСтрока.ЦеннаяБумага2Остаток	= КоличествоЦБ;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Вопросы = ЗначениеСвойства(ДанныеФайла, "ВариантыГолосования");
	Если Вопросы <> Неопределено Тогда
		Для Каждого Вопрос Из Вопросы Цикл
			НовыйВопрос = ВопросыКГолосованию.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйВопрос, Вопрос);
			НовыйВопрос.ВходящийДокументНомер = ЗначениеСвойства(ДанныеФайла,"ВходящийДокументНомер");
		КонецЦикла;
	КонецЕсли;
	
	ВариантыУчастияФайла = ЗначениеСвойства(ДанныеФайла, "ВариантыУчастия");
	Если ВариантыУчастияФайла <> Неопределено Тогда
		Для Каждого Вариант Из ВариантыУчастияФайла Цикл
			НовыйВариант = ВариантыУчастия.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйВариант, Вариант);
		КонецЦикла;
	КонецЕсли;
	
	НоваяСтрока.ДокументКД = Документы.КорпоративноеДействие_Новый.КДПоВходящемуРеференсуИСчетуДепо(
		НоваяСтрока.КДРеференсВходящий, НоваяСтрока.СчетДЕПО);
		
	НоваяСтрока.ДополнительнаяИнформация = ЗначениеСвойства(ДанныеФайла, "ДополнительнаяИнформация");
КонецПроцедуры

// Переносит загруженные файлы в архивный каталог
//
// Параметры:
//  ВхНомераFCDR2017 - Массив - входящие номера документов FCDR
//
Процедура ПеренестиВАрхив(ВхНомераFCDR2017) Экспорт
	Если ВышестоящийДепозитарий = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияПоУмолчанию") Тогда
		ПеренестиВАрхивФайлыНРД(ВхНомераFCDR2017);
	ИначеЕсли ВышестоящийДепозитарий = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияБЭБ") Тогда
		ПеренестиФайлыВАрхивПоДатам(ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзБЭБКаталогАрхив);
	ИначеЕсли ВышестоящийДепозитарий = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияРДЦ") Тогда
		ПеренестиФайлыВАрхивПоДатам(ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзРДЦКаталогАрхив);
	КонецЕсли;
КонецПроцедуры

Процедура ПеренестиФайлыВАрхивПоДатам(ВнешнийИсточникАрхив)
	КаталогАрхива = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточникАрхив).Папка;
	Если Не ЗначениеЗаполнено(КаталогАрхива) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось получить параметры внешнего источника """ + ВнешнийИсточникАрхив + """");
		Возврат;
	КонецЕсли;
	ПолныйПутьАрхива = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(СокрЛП(КаталогАрхива));
	
	ИмяСобытия = "Архивация файлов КД";
	Если ВышестоящийДепозитарий = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияБЭБ") Тогда
		ИмяСобытия = ИмяСобытия + " от БЭБ";
	ИначеЕсли ВышестоящийДепозитарий = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияРДЦ") Тогда
		ИмяСобытия = ИмяСобытия + " от РДЦ";
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ДанныеКорпоративныхДействий Цикл
		Если МассивВхНомеров.Найти(СтрокаТаблицы.ВходящийДокументНомер) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		// Из полного имени файла нужно получить имя каталога с датой вида '2021_05_14'
		// Полное имя файла выглядит как ПутьККаталогу + '\' + '2021_05_14' + ИмяФайла
		НаДату = Сред(СтрЗаменить(СтрокаТаблицы.ПолноеИмяФайла, ПутьККаталогу, ""), 2, 10);
		ПолныйПутьАрхиваНаДату = ПолныйПутьАрхива + НаДату;
		ФайлАрхив = Новый Файл(ПолныйПутьАрхиваНаДату);
		Если Не ФайлАрхив.Существует() Тогда
			СоздатьКаталог(ПолныйПутьАрхиваНаДату);
		КонецЕсли;
		ПолноеИмяФайлаВАрхиве = СтрЗаменить(СтрокаТаблицы.ПолноеИмяФайла, ПутьККаталогу, ПолныйПутьАрхива);
		ПереместитьФайл(СтрокаТаблицы.ПолноеИмяФайла, ПолноеИмяФайлаВАрхиве);
		ЗаписьЖурналаРегистрации(ИмяСобытия,
			УровеньЖурналаРегистрации.Информация,
			Метаданные.Обработки.ЗагрузкаКДИзДепозитария,
			,
			"Файл перемещен: " + СтрокаТаблицы.ПолноеИмяФайла + " => " + ПолноеИмяФайлаВАрхиве);
	КонецЦикла;
КонецПроцедуры

Процедура ПеренестиВАрхивФайлыНРД(ВхНомераFCDR2017)
	
	ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИменахФайлов(ВхНомераFCDR2017, "_");
	
	// Найти все каталоги с именем, начинающимся на "Q"
	КаталогиInboxQ = НайтиФайлы(ПутьККаталогу + "\inbox", "Q*");
	Для Каждого КаталогInboxQ ИЗ КаталогиInboxQ Цикл
		Если НЕ КаталогInboxQ.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		АрхивироватьФайл = Истина;
		ФайлыZIP = НайтиФайлы(КаталогInboxQ.ПолноеИмя,"*.zip",Истина);
		Для Каждого ФайлZIP Из ФайлыZIP Цикл
				НайденныйНомер = МассивВхНомеров.Найти(СокрЛП(ФайлZIP.ИмяБезРасширения));
				НайденныйНомерFCDR2017 = ВхНомераFCDR2017.Найти(СокрЛП(ФайлZIP.ИмяБезРасширения));
				Если НайденныйНомер = Неопределено И НайденныйНомерFCDR2017 = Неопределено Тогда
					АрхивироватьФайл = Ложь;
				КонецЕсли;
		КонецЦикла;
		
		Если Не АрхивироватьФайл Тогда
			Продолжить;
		КонецЕсли;
		
		ПеренестиКаталогВАрхив("Q", КаталогInboxQ);
		
	КонецЦикла;
	
	КаталогиInboxW = НайтиФайлы(ПутьККаталогу + "\inbox", "W*");
	Для Каждого КаталогInboxW Из КаталогиInboxW Цикл
		Если НЕ КаталогInboxW.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		АрхивироватьФайл = Ложь;
		ФайлыXML = НайтиФайлы(КаталогInboxW.ПолноеИмя, "*.xml", Истина);
		Для Каждого ФайлXML Из ФайлыXML Цикл
			Если АрхивироватьФайл Тогда
				Прервать;
			КонецЕсли;
			Для Каждого ВхНомер Из ВхНомераFCDR2017 Цикл
				Если АрхивироватьФайл Тогда
					Прервать;
				КонецЕсли;
				Если СтрНайти(ФайлXML.ИмяБезРасширения, ВхНомер) > 0 Тогда
					АрхивироватьФайл = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если Не АрхивироватьФайл Тогда
			Продолжить;
		КонецЕсли;
		
		ПеренестиКаталогВАрхив("W", КаталогInboxW);
		
	КонецЦикла;
КонецПроцедуры

Процедура ПеренестиКаталогВАрхив(ВидОтчета, КаталогInbox)
	ПолныйПутьАрхива = ПутьККаталогу + "\Archive";
	ПолныйПутьАрхиваНаТекущуюДату = Обработки.ЗагрузкаКДИзДепозитария.ОбщийКаталогПеремещаемогоФайлаВАрхив(ПолныйПутьАрхива, ВидОтчета);
	
	// Перенос каждого Q/W*-каталога:
	// Пройти по дереву от корня и создать каталоги в папке архива
	КаталогАрхива = ПолныйПутьАрхиваНаТекущуюДату + "\" + КаталогInbox.Имя;
	СоздатьКаталог(КаталогАрхива);
	КлонироватьСтруктуруКаталоговВНовойПапке(КаталогInbox, КаталогАрхива);
	
	// Пройти по дереву от корня: перенести файлы в архив
	ПеренестиФайлыВСтруктуреКаталогов(КаталогInbox, КаталогАрхива);
	
	ЗаписьЖурналаРегистрации("Архивация файлов входящих пакетов (" + ВидОтчета + ")", УровеньЖурналаРегистрации.Информация,
	Метаданные.Обработки.ЗагрузкаКДИзДепозитария,,
	"Каталог " + КаталогInbox.Имя + " перемещен: " + КаталогInbox.ПолноеИмя + " => " + КаталогАрхива);
	
	// Удалить старый каталог и все вложенные каталоги и файлы
	Попытка
		УдалитьФайлы(КаталогInbox.ПолноеИмя);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПеренестиФайлыВСтруктуреКаталогов(ИсходныйКаталог, ИмяНовогоКаталога, УдалятьВИсточнике = Истина)
	Файлы = НайтиФайлы(ИсходныйКаталог.ПолноеИмя, "*.*");
	Для Каждого Файл Из Файлы Цикл
		Если Файл.ЭтоФайл() Тогда
			Если УдалятьВИсточнике Тогда
				ПереместитьФайл(Файл.ПолноеИмя, ИмяНовогоКаталога + "\" + Файл.Имя);
			Иначе
				КопироватьФайл(Файл.ПолноеИмя, ИмяНовогоКаталога + "\" + Файл.Имя);
			КонецЕсли;
		ИначеЕсли Файл.ЭтоКаталог() Тогда
			ПеренестиФайлыВСтруктуреКаталогов(Файл, ИмяНовогоКаталога + "\" + Файл.Имя)
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура КлонироватьСтруктуруКаталоговВНовойПапке(ИсходныйКаталог, ИмяНовогоКаталога)
	Каталоги = НайтиФайлы(ИсходныйКаталог.ПолноеИмя, "*.*");
	Для Каждого Каталог Из Каталоги Цикл
		Если Каталог.ЭтоКаталог() Тогда
			ИмяВложенногоКаталога = ИмяНовогоКаталога + "\" + Каталог.Имя;
			СоздатьКаталог(ИмяВложенногоКаталога);
			КлонироватьСтруктуруКаталоговВНовойПапке(Каталог, ИмяВложенногоКаталога);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура АрхивироватьВыпискиОтРегистраторов(ИмяРегистратора, ВидОтчета, КаталогInbox)
	
	Если Не ЗначениеЗаполнено(ИмяРегистратора) Тогда
		Возврат;
	КонецЕсли;
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.КаталогВыписокОтРегистраторов;
	ПараметрыИсточника = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник);
	Если ПараметрыИсточника.Папка <> "" Тогда
		ПолныйПутьАрхива = ПараметрыИсточника.Папка + "\" + ИмяРегистратора;
		ТолькоКаталогАрхиваНаДату = Истина;
		ПолныйПутьАрхиваНаТекущуюДату = Обработки.ЗагрузкаКДИзДепозитария.ОбщийКаталогПеремещаемогоФайлаВАрхив(ПолныйПутьАрхива,
											ВидОтчета, ТолькоКаталогАрхиваНаДату);
		КаталогАрхива = ПолныйПутьАрхиваНаТекущуюДату + "\" + КаталогInbox.Имя;
		СоздатьКаталог(КаталогАрхива);
		КлонироватьСтруктуруКаталоговВНовойПапке(КаталогInbox, КаталогАрхива);
		УдалятьВИсточнике = Ложь;
		ПеренестиФайлыВСтруктуреКаталогов(КаталогInbox, КаталогАрхива, УдалятьВИсточнике);
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////
// Работа с XML данными

Функция ОбработатьMeetingNotification(Чтение)
	Документ = СтруктураДокументаXML(Чтение);
	ПараметрыКД	= Новый Структура;
	
	// Параметры документа раскрытия
	// Параметры уведомления
	ПараметрыКД.Вставить("ВходящийДокументНомер", ЗначениеСвойства(Документ, "AppHdr.BizMsgIdr"));
	
	ВходящийДокументДата = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ, "AppHdr.CreDt"));
	ПараметрыКД.Вставить("ВходящийДокументДата", ВходящийДокументДата + СмещениеСтандартногоВремени(ЧасовойПояс()));
	
	ПараметрыКД.Вставить("КДРеференсВходящий",	ЗначениеСвойства(Документ, "Document.MtgNtfctn.Mtg.MtgId"));
	ПараметрыКД.Вставить("ТипСобрания",	ЗначениеСвойства(Документ, "Document.MtgNtfctn.Mtg.TP"));
	ПараметрыКД.Вставить("КодОтчета",	ЗначениеСвойства(Документ, "AppHdr.BizSvc"));
	
	КлассСобрания = ЗначениеСвойства(Документ, "Document.MtgNtfctn.Mtg.Clssfctn.Cd");
	Если КлассСобрания <> Неопределено Тогда
		ПараметрыКД.Вставить("КлассСобрания", КлассСобрания);
	КонецЕсли;
	
	ПараметрыКД.Вставить("ДатаПроведенияСобрания",	Дата(1,1,1));
	ПараметрыКД.Вставить("ДатаОкончания",			Дата(1,1,1));
	ПараметрыКД.Вставить("Комментарий",				"");
	
	ДатаОкончанияПриемаИнструкцийНРД = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ,
		"Document.MtgNtfctn.Vote.VoteDdln.Dt",
		"Document.MtgNtfctn.Vote.VoteDdln.DtTm"));
	ПараметрыКД.Вставить("ДатаОкончанияПриемаИнструкцийНРД", ДатаОкончанияПриемаИнструкцийНРД);
	
	Xtnsn = ЗначениеСвойства(Документ, "Document.MtgNtfctn.Xtnsn");
	Если ЗначениеЗаполнено(Xtnsn) И ТипЗнч(Xtnsn) = Тип("Массив") И Xtnsn.Количество() > 0 Тогда
		ЗаполнитьДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента(Документ.Document.MtgNtfctn.Xtnsn[0], ПараметрыКД);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаОкончанияПриемаИнструкцийНРД)
		И ПараметрыКД.Свойство("ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента")
		И ЗначениеЗаполнено(ПараметрыКД.ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента) Тогда
		ДатаОкончанияПриемаИнструкцийНРД = ПараметрыКД.ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента; 
	КонецЕсли;
	
	ДатаОкончанияПриемаИнструкцийВТБКБ = Документы.УведомлениеКлиентам.ДобавитьРабочийДень(ДатаОкончанияПриемаИнструкцийНРД, -2);
	СкопироватьВремя(ДатаОкончанияПриемаИнструкцийВТБКБ, ДатаОкончанияПриемаИнструкцийНРД);
	ПараметрыКД.Вставить("ДатаОкончанияПриемаИнструкцийВТБКБ", ДатаОкончанияПриемаИнструкцийВТБКБ);
	
	ПараметрыКД.Вставить("Комментарий", ЗначениеСвойства(Документ, "Document.MtgNtfctn.Vote.AddtlVtngRqrmnts"));
	
	ПараметрыКД.Вставить("ДатаФиксации", СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ,
		"Document.MtgNtfctn.EntitlmntSpcfctn.EntitlmntFxgDt.Dt",
		"Document.MtgNtfctn.EntitlmntSpcfctn.EntitlmntFxgDt.DtTm")));
		
	ПараметрыКД.Вставить("АдресВСетиИнтернет", АдресВСетиИнтернет(Документ, "Document.MtgNtfctn.Xtnsn"));
	МестоПроведенияСобрания = ЗначениеСвойства(Документ, "Document.MtgNtfctn.MtgDtls.Lctn.Adr.AdrLine");
	ПараметрыКД.Вставить("МестоПроведенияСобрания", МестоПроведенияСобрания);
	
	ПараметрыКД.Вставить("ДатаПроведенияСобрания", СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ,
		"Document.MtgNtfctn.MtgDtls.DtAndTm.Dt",
		"Document.MtgNtfctn.MtgDtls.DtAndTm.DtTm")));
		
	УзелScty = ЗначениеСвойства(Документ, "Document.MtgNtfctn.Scty");
	СтруктураПолей = Новый Структура("ISIN,Desc,КодНРД,ГосРегНомер,НомерСчетаДепо,FaceAmnt,Unit,BalTp,Dt,SfkpgPlc");
	ПараметрыКД.Вставить("МассивИнформацииОЦБ", МассивИнформацииОЦБ(УзелScty, СтруктураПолей));
	
	// Заполним вопросы
	Вопросы = ЗначениеСвойства(Документ, "Document.MtgNtfctn.Rsltn");
	Расширения = ЗначениеСвойства(Документ, "Document.MtgNtfctn.Xtnsn");
	НормальныеВопросы = Новый Массив;
	Если Вопросы <> Неопределено Тогда
		Для Каждого Вопрос Из Вопросы Цикл
			СтрВопроса = Новый Структура(
				"НомерВопроса, ДляИнформации, КуммулятивныйВопрос, ТекстВопроса, Коэффициент, ВариантыГолосования");
			СтрВопроса.НомерВопроса = Вопрос.IssrLabl;
			СтрВопроса.ТекстВопроса = Вопрос.Desc;
			СтрВопроса.ДляИнформации = Вопрос.ForInfOnly;
			СтрВопроса.КуммулятивныйВопрос = Ложь;
			СтрВопроса.Коэффициент = 1;
			
			//Определим кумулятивные вопросы
			Для Каждого Расширение Из Расширения Цикл
				СписокКум = ЗначениеСвойства(Расширение, "XtnsnEnvlp.XtnsnDt.VtAddRqrmnts");
				Если СписокКум <> Неопределено Тогда
					Для Каждого Вопр Из СписокКум Цикл
						Если Вопр.IssrLabl = Вопрос.IssrLabl Тогда
							// Нашли вопрос, берем признак кумулятивности
							СтрВопроса.КуммулятивныйВопрос = Булево(Вопр.CmltvVtngIndctr);
							Коэффициент = ЗначениеСвойства(Вопр, "MltplcFctr");
							Если Коэффициент <> Неопределено Тогда
								СтрВопроса.Коэффициент = Число(Коэффициент);
							КонецЕсли;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			СтрВопроса.ВариантыГолосования = ИзДвоичнойВДесятичную(ДвоичнаяСтрокаВариантов(Вопрос.VoteInstrTp));
			НормальныеВопросы.Добавить(СтрВопроса);
		КонецЦикла;
	КонецЕсли;
	ПараметрыКД.Вставить("ВариантыГолосования",НормальныеВопросы);
	
	Для Каждого Расширение Из Расширения Цикл
		ВариантыГолосования = ЗначениеСвойства(Расширение, "XtnsnEnvlp.XtnsnDt.CorpActnOptnDtls");
		Если ВариантыГолосования = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДополнитьВариантыУчастияВКД(ВариантыГолосования, ПараметрыКД);
	КонецЦикла;
	
	ДобавитьДополнительнуюИнформацию(Xtnsn, ПараметрыКД);
	DocumentMtgNtfctn = ЗначениеСвойства(Документ, "Document.MtgNtfctn");
	ДобавитьДополнительнуюИнформацию(DocumentMtgNtfctn, ПараметрыКД);
	ДобавитьФиксированныеСтрокиВДополнительнуюИнформацию(ПараметрыКД);
	
	Если ПараметрыКД.МассивИнформацииОЦБ.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат ПараметрыКД;
	КонецЕсли;
КонецФункции

Функция ОбработатьMeetingCancelation(Чтение)
	Документ = СтруктураДокументаXML(Чтение);
	ПараметрыКД	= Новый Структура;
	
	// Параметры документа раскрытия
	// Параметры уведомления
	ПараметрыКД.Вставить("ВходящийДокументНомер", ЗначениеСвойства(Документ, "AppHdr.BizMsgIdr"));
	
	ВходящийДокументДата = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ, "AppHdr.CreDt"));
	ПараметрыКД.Вставить("ВходящийДокументДата", ВходящийДокументДата + СмещениеСтандартногоВремени(ЧасовойПояс()));
	
	ПараметрыКД.Вставить("КДРеференсВходящий",	ЗначениеСвойства(Документ, "Document.MtgCxl.MtgRef.MtgId"));
	ПараметрыКД.Вставить("КодОтчета",	ЗначениеСвойства(Документ, "AppHdr.BizSvc"));
	
	КодПричиныОтмены = ЗначениеСвойства(Документ, "Document.MtgCxl.Rsn.CxlRsnCd.Cd");
	ПараметрыКД.Вставить("ПричинаОтмены", Справочники.ПричиныОтмены.НайтиПоКоду(КодПричиныОтмены));
	
	УзелScty = ЗначениеСвойства(Документ, "Document.MtgCxl.Scty");
	СтруктураПолей = Новый Структура("КодНРД,НомерСчетаДепо,Unit,BalTp,Dt");
	ПараметрыКД.Вставить("МассивИнформацииОЦБ", МассивИнформацииОЦБ(УзелScty, СтруктураПолей));
	
	ВариантыГолосования = Новый Массив;
	ПараметрыКД.Вставить("ВариантыГолосования", ВариантыГолосования);
	
	ПараметрыКД.Вставить("АдресВСетиИнтернет", АдресВСетиИнтернет(Документ, "Document.MtgCxl.Xtnsn"));
	
	Расширения = ЗначениеСвойства(Документ, "Document.MtgCxl.Xtnsn");
	Для Каждого Расширение Из Расширения Цикл
		ВариантыДляГолосования = ЗначениеСвойства(Расширение, "XtnsnEnvlp.XtnsnDt.CorpActnOptnDtls");
		Если ВариантыДляГолосования = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДополнитьВариантыУчастияВКД(ВариантыДляГолосования, ПараметрыКД);
	КонецЦикла;
	
	ДобавитьДополнительнуюИнформацию(Расширения, ПараметрыКД);
	ДобавитьФиксированныеСтрокиВДополнительнуюИнформацию(ПараметрыКД);
	
	Возврат ПараметрыКД;
КонецФункции

Функция ОбработатьMeetingResultDissemination(Чтение)
	Документ = СтруктураДокументаXML(Чтение);
	ПараметрыКД	= Новый Структура;
	
	// Параметры документа раскрытия
	// Параметры уведомления
	ПараметрыКД.Вставить("ВходящийДокументНомер", ЗначениеСвойства(Документ, "AppHdr.BizMsgIdr"));
	
	ВходящийДокументДата = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ, "AppHdr.CreDt"));
	ПараметрыКД.Вставить("ВходящийДокументДата", ВходящийДокументДата + СмещениеСтандартногоВремени(ЧасовойПояс()));
	
	ПараметрыКД.Вставить("КДРеференсВходящий",	ЗначениеСвойства(Документ, "Document.MtgRsltDssmntn.MtgRef.MtgId"));
	ПараметрыКД.Вставить("КодОтчета",	ЗначениеСвойства(Документ, "AppHdr.BizSvc"));
	
	ПараметрыКД.Вставить("АдресВСетиИнтернет", АдресВСетиИнтернет(Документ, "Document.MtgRsltDssmntn.Xtnsn"));

	УзелScty = ЗначениеСвойства(Документ, "Document.MtgRsltDssmntn.Scty");
	СтруктураПолей = Новый Структура("КодНРД,НомерСчетаДепо,Unit,BalTp,Dt");
	ПараметрыКД.Вставить("МассивИнформацииОЦБ", МассивИнформацииОЦБ(УзелScty, СтруктураПолей));
	
	ПараметрыВариантов = ПараметрыВариантовГолосования(Документ, "Document.MtgRsltDssmntn.Xtnsn", ПараметрыКД.КДРеференсВходящий);
	ВариантыГолосования = Новый Массив;
	Вопросы = ЗначениеСвойства(Документ, "Document.MtgRsltDssmntn.VoteRslt");
	Если Вопросы <> Неопределено Тогда
		Для Каждого Вопрос Из Вопросы Цикл
			СтрВопроса = Новый Структура("НомерВопроса,За,Против,Воздержался,Принято,
				|КуммулятивныйВопрос,Коэффициент,ТекстВопроса,ДляИнформации,ВариантыГолосования");
			СтрВопроса.НомерВопроса	= ЗначениеСвойства(Вопрос, "IssrLabl");
			СтрВопроса.Принято		= ЗначениеСвойства(Вопрос, "Accptd");
			СтрВопроса.За			= ЗначениеСвойства(Вопрос, "For");
			СтрВопроса.Против		= ЗначениеСвойства(Вопрос, "Agnst");
			СтрВопроса.Воздержался	= ЗначениеСвойства(Вопрос, "Abstn");
			СтрВопроса.КуммулятивныйВопрос = Ложь;
			СтрВопроса.Коэффициент = 1;
			
			Строка = ПараметрыВариантов.Найти(СтрВопроса.НомерВопроса, "НомерВопроса");
			Если Строка = Неопределено Тогда
				СтрВопроса.ТекстВопроса = "";
				СтрВопроса.ДляИнформации = Ложь;
				СтрВопроса.ВариантыГолосования = 0;
			Иначе
				ЗаполнитьЗначенияСвойств(СтрВопроса, Строка, "ТекстВопроса, ДляИнформации, ВариантыГолосования");
			КонецЕсли;
			
			ВариантыГолосования.Добавить(СтрВопроса);
		КонецЦикла; 
	КонецЕсли;
	
	ПараметрыКД.Вставить("ВариантыГолосования", ВариантыГолосования);
	
	Расширения = ЗначениеСвойства(Документ, "Document.MtgRsltDssmntn.Xtnsn");
	Для Каждого Расширение Из Расширения Цикл
		ВариантыДляГолосования = ЗначениеСвойства(Расширение, "XtnsnEnvlp.XtnsnDt.CorpActnOptnDtls");
		Если ВариантыДляГолосования = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДополнитьВариантыУчастияВКД(ВариантыДляГолосования, ПараметрыКД);
	КонецЦикла;
	
	ДобавитьДополнительнуюИнформацию(Расширения, ПараметрыКД);
	DocumentMtgRsltDssmntn = ЗначениеСвойства(Документ, "Document.MtgRsltDssmntn");
	ДобавитьДополнительнуюИнформацию(DocumentMtgRsltDssmntn, ПараметрыКД);
	ДобавитьФиксированныеСтрокиВДополнительнуюИнформацию(ПараметрыКД);
	
	Возврат ПараметрыКД;
КонецФункции

Функция МассивИнформацииОЦБ(УзелScty, СтруктураПолей)
	Результат = Новый Массив;
	
	Если УзелScty = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТегIdDesc = "Id.Desc";
	
	Для Каждого ЗаписьСхемыXDTO Из УзелScty Цикл
		ПараметрыЦБ	= Новый Структура;
		
		Если СтруктураПолей.Свойство("ISIN") Тогда
			ТегISIN = ТегИзСтруктурыИлиПоУмолчанию(СтруктураПолей.ISIN, "Id.Id.ISIN");
			ПараметрыЦБ.Вставить("ISIN", ЗначениеСвойства(ЗаписьСхемыXDTO, ТегISIN));
		КонецЕсли;
		
		Если СтруктураПолей.Свойство("Desc") Тогда
			ТегDesc = ТегИзСтруктурыИлиПоУмолчанию(СтруктураПолей.Desc, ТегIdDesc);
			ПараметрыЦБ.Вставить("Desc", ЗначениеСвойства(ЗаписьСхемыXDTO, ТегDesc));
		КонецЕсли;
			
		Если СтруктураПолей.Свойство("КодНРД") Тогда
			ТегDesc = ТегИзСтруктурыИлиПоУмолчанию(СтруктураПолей.КодНРД, ТегIdDesc);
			ОбработатьКодНРД(ЗаписьСхемыXDTO, ТегDesc, ПараметрыЦБ);
		КонецЕсли;
		
		Если СтруктураПолей.Свойство("ГосРегНомер") Тогда
			ТегDesc = ТегИзСтруктурыИлиПоУмолчанию(СтруктураПолей.ГосРегНомер, ТегIdDesc);
			ОстатокСтроки = Сред(ЗначениеСвойства(ЗаписьСхемыXDTO, ТегDesc),
				СтрНайти(ЗначениеСвойства(ЗаписьСхемыXDTO, ТегDesc), "#") + 1);
			ОстатокСтроки = Сред(ОстатокСтроки, СтрНайти(ОстатокСтроки, "#") + 1);
			ГосРегНомер = Лев(ОстатокСтроки, СтрНайти(ОстатокСтроки, "#") - 1);
			ПараметрыЦБ.Вставить("ГосРегНомер", ГосРегНомер);
		КонецЕсли;
		
		// Получим данные по ЦБ на счетах ДЕПО
		ПараметрыЦБНаСчетах	= Новый Структура;
		Если ЗаписьСхемыXDTO.Pos <> Неопределено Тогда
			Для Каждого ЗаписьPOSСхемыXDTO Из ЗаписьСхемыXDTO.Pos Цикл
				ТаблицаПоЦБ	= СоздатьТаблицуДляЦБ();
				
				Если СтруктураПолей.Свойство("НомерСчетаДепо") Тогда
					ПараметрыЦБНаСчетах.Вставить("НомерСчетаДепо", ЗаписьPOSСхемыXDTO.AcctId);
				КонецЕсли;
				
				ОбработатьУзелHldgBal(ЗаписьPOSСхемыXDTO, ТаблицаПоЦБ, СтруктураПолей);
				ПараметрыЦБНаСчетах.Вставить("ДанныеПоСчету", ТаблицаПоЦБ);
			КонецЦикла;
		КонецЕсли;
		ПараметрыЦБ.Вставить("ПараметрыЦБНаСчетах", ПараметрыЦБНаСчетах);
		Результат.Добавить(ПараметрыЦБ);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Процедура ОбработатьУзелHldgBal(ЗаписьPOS, ТаблицаПоЦБ, СтруктураПолей)
	УзелHldgBal = ЗначениеСвойства(ЗаписьPOS, "HldgBal");
	Если ТипЗнч(УзелHldgBal) = Тип("Массив") Тогда
		// Создадим структуру данных о количестве
		Для Каждого ЗаписьHldgBal Из УзелHldgBal Цикл
			НовСтр = ТаблицаПоЦБ.Добавить();
			ЗаполнитьСтрокуТаблицыПоЦБ(НовСтр, ЗаписьHldgBal, СтруктураПолей, "FaceAmnt", "Bal.FaceAmt");
			ЗаполнитьСтрокуТаблицыПоЦБ(НовСтр, ЗаписьHldgBal, СтруктураПолей, "Unit", "Bal.Unit");
			ЗаполнитьСтрокуТаблицыПоЦБ(НовСтр, ЗаписьHldgBal, СтруктураПолей, "BalTp", "BalTp");
			ЗаполнитьСтрокуТаблицыПоЦБ(НовСтр, ЗаписьHldgBal, СтруктураПолей, "Dt", "Dt");
			ЗаполнитьСтрокуТаблицыПоЦБ(НовСтр, ЗаписьHldgBal, СтруктураПолей, "SfkpgPlc", "SfkpgPlc");
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьКодНРД(ЗаписьСхемыXDTO, ТегDesc, ПараметрыЦБ)
	КодНРД = "";
	УзелСКодомНРД = ЗначениеСвойства(ЗаписьСхемыXDTO, ТегDesc);
	Если ТипЗнч(УзелСКодомНРД) = Тип("Строка") Тогда
		ПозицияРазделителя = СтрНайти(УзелСКодомНРД, "#");
		КодНРД = Лев(УзелСКодомНРД, ПозицияРазделителя - 1);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КодНРД) Тогда
		УзелOthrId = ЗначениеСвойства(ЗаписьСхемыXDTO, "FinInstrmId.OthrId");
		Если ТипЗнч(УзелOthrId) = Тип("Массив") Тогда
			Для Каждого Элемент Из УзелOthrId Цикл
				ТипИдентификатора = ЗначениеСвойства(Элемент, "Tp.Prtry");
				Если ТипИдентификатора = "NSDR" Тогда
					КодНРД = ЗначениеСвойства(Элемент, "Id");
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	ПараметрыЦБ.Вставить("КодНРД", КодНРД);
КонецПроцедуры

Функция ТегИзСтруктурыИлиПоУмолчанию(ТегИзСтруктуры, ТегПоУмолчанию)
	Возврат ?(ЗначениеЗаполнено(ТегИзСтруктуры), ТегИзСтруктуры, ТегПоУмолчанию);
КонецФункции

Процедура ЗаполнитьСтрокуТаблицыПоЦБ(СтрокаТаблицы, ЗаписьHldgBal, СтруктураПолей, ИмяТегаИзСтруктурыПолей, ИмяТегаПоУмолчанию)
	Если СтруктураПолей.Свойство(ИмяТегаИзСтруктурыПолей) Тогда
		ИмяТега = ТегИзСтруктурыИлиПоУмолчанию(СтруктураПолей[ИмяТегаИзСтруктурыПолей], ИмяТегаПоУмолчанию);
		СтрокаТаблицы[ИмяТегаИзСтруктурыПолей] = ЗначениеСвойства(ЗаписьHldgBal, ИмяТега);
	КонецЕсли;
КонецПроцедуры

Функция ПараметрыВариантовГолосования(Документ, УзелXtnsn, КДРеференсВходящий)
	ПараметрыВариантов = Новый ТаблицаЗначений;
	ПараметрыВариантов.Колонки.Добавить("НомерВопроса");
	ПараметрыВариантов.Колонки.Добавить("ТекстВопроса");
	ПараметрыВариантов.Колонки.Добавить("ДляИнформации");
	ПараметрыВариантов.Колонки.Добавить("ВариантыГолосования");
	
	Xtnsns = ЗначениеСвойства(Документ, УзелXtnsn);
	Если Xtnsns <> Неопределено И ТипЗнч(Xtnsns) = Тип("Массив") Тогда
		Для Каждого Xtnsn Из Xtnsns Цикл
			MtgId = ЗначениеСвойства(Xtnsn, "XtnsnEnvlp.XtnsnDt.Mtg.MtgId");
			Если MtgId = КДРеференсВходящий Тогда
				Rsltns = ЗначениеСвойства(Xtnsn, "XtnsnEnvlp.XtnsnDt.Rsltn");
				Если Rsltns <> Неопределено И ТипЗнч(Rsltns) = Тип("Массив") Тогда
					Для Каждого Rsltn Из Rsltns Цикл
						НоваяСтрока = ПараметрыВариантов.Добавить();
						НоваяСтрока.НомерВопроса = ЗначениеСвойства(Rsltn, "IssrLabl");
						НоваяСтрока.ТекстВопроса = ЗначениеСвойства(Rsltn, "Desc");
						НоваяСтрока.ДляИнформации = ?(ВРЕГ(ЗначениеСвойства(Rsltn, "ForInfOnly")) = "FALSE", Ложь, Истина);
						
						VoteInstrTp = ЗначениеСвойства(Rsltn, "VoteInstrTp");
						Если VoteInstrTp <> Неопределено И ТипЗнч(VoteInstrTp) = Тип("Массив") Тогда
							НоваяСтрока.ВариантыГолосования = ИзДвоичнойВДесятичную(ДвоичнаяСтрокаВариантов(VoteInstrTp));
						Иначе
							НоваяСтрока.ВариантыГолосования = 0;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПараметрыВариантов;
КонецФункции

Функция ДвоичнаяСтрокаВариантов(Варианты)
	Результат = "000";
	
	Для Каждого Вариант ИЗ Варианты Цикл
		Если Вариант = "CFOR" Тогда
			Результат = "1" + Прав(Результат, 2);
		ИначеЕсли Вариант = "CAGS" Тогда
			Результат = Лев(Результат, 1) + "1" + Прав(Результат, 1);
		ИначеЕсли Вариант = "ABST" Тогда
			Результат = Лев(Результат, 2) + "1";
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

// Считывает узел XML CorporateActionNotification в таблицу значений
//
// Возвращаемое значение:
//  структура для заполнения таблицы значений ДанныеКорпоративныхДействий
Функция ОбработатьCorporateActionNotification(Чтение)
	Документ = СтруктураДокументаXML(Чтение);
	ПараметрыКД	= Новый Структура;
	ПараметрыКД.Вставить("КодОтчета", ЗначениеСвойства(Документ, "AppHdr.BizSvc"));
	
	// Параметры документа раскрытия
	// Параметры уведомления
	ПараметрыКД.Вставить("ВходящийДокументНомер", ЗначениеСвойства(Документ, "AppHdr.BizMsgIdr"));
	
	ВходящийДокументДата = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ, "AppHdr.CreDt"));
	ПараметрыКД.Вставить("ВходящийДокументДата", ВходящийДокументДата + СмещениеСтандартногоВремени(ЧасовойПояс()));
	
	ТипУведомленияКод = ЗначениеСвойства(Документ, "Document.CorpActnNtfctn.NtfctnGnlInf.NtfctnTp");
	ПараметрыКД.Вставить("ТипУведомления", Справочники.ТипыУведомления.НайтиПоКоду(ТипУведомленияКод));
	
	ПараметрыКД.Вставить("КДРеференсВходящий", ЗначениеСвойства(Документ,
		"Document.CorpActnNtfctn.CorpActnGnlInf.CorpActnEvtId"));
	
	ПараметрыКД.Вставить("ВидКД", ЗначениеСвойства(Документ, "Document.CorpActnNtfctn.CorpActnGnlInf.EvtTp.Cd"));
	
	ИндексЭлементаМассиваEvtsLkg = ?(ПараметрыКД.ВидКД = "WTRC", 1, 0);
	ПараметрыКД.Вставить("КДРеференсСвязанный", ЗначениеСвойстваИзСтруктурыМассива(Документ,
		"Document.CorpActnNtfctn.EvtsLkg.EvtId.LkdCorpActnId", ИндексЭлементаМассиваEvtsLkg));
	
	КодПризнакаОбязательности = ЗначениеСвойства(Документ, "Document.CorpActnNtfctn.CorpActnGnlInf.MndtryVlntryEvtTp.Cd");
	Признаки = Справочники.ПризнакиОбязательностиКорпоративныхДействий.ПризнакиПоКоду(КодПризнакаОбязательности);
	Если ЗначениеЗаполнено(Признаки) Тогда
		ПараметрыКД.Вставить("ВидВыкупа", Признаки.ТипКорпоративногоДействия);
		ПараметрыКД.Вставить("ПризнакОбязательностиКД", Признаки.ПризнакОбязательностиКД);
	КонецЕсли;
		
	ПараметрыКД.Вставить("НомерСчетаДепо", ЗначениеСвойства(Документ,
		"Document.CorpActnNtfctn.AcctDtls.AcctsListAndBalDtls.SfkpgAcct"));
		
	ISIN = ЗначениеСвойства(Документ, "Document.CorpActnNtfctn.CorpActnGnlInf.UndrlygScty.FinInstrmId.ISIN");
	ПараметрыКД.Вставить("ISINДляПоискаЭмитента", ISIN);
	
	// Узлы OthrId
	// Найдем КодЗагрузкиНДЦ
	OthrId = ЗначениеСвойства(Документ, "Document.CorpActnNtfctn.CorpActnGnlInf.UndrlygScty.FinInstrmId.OthrId");
	Если OthrId <> Неопределено Тогда
		OthrId = Документ.Document.CorpActnNtfctn.CorpActnGnlInf.UndrlygScty.FinInstrmId.OthrId;
		Если ТипЗнч(OthrId) = Тип("Массив") Тогда
			Для Каждого Стр ИЗ OthrId Цикл
				ПрочитатьУзелOthrId(Стр, ПараметрыКД);
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(OthrId) = Тип("Структура") Тогда
			ПрочитатьУзелOthrId(OthrId, ПараметрыКД);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыКД.Вставить("ЦеннаяБумага1Остаток", СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьЧислоИзСтроки(ЗначениеСвойства(Документ,
		"Document.CorpActnNtfctn.AcctDtls.AcctsListAndBalDtls.Bal.TtlElgblBal.QtyChc.SgndQty.Qty.Unit",
		"Document.CorpActnNtfctn.AcctDtls.AcctsListAndBalDtls.Bal.SttlmPosBal.Bal.QtyChc.Qty.Unit")));
	
	ПараметрыКД.Вставить("МинимальноеКодичествоДляУчастияВКД", СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьЧислоИзСтроки(ЗначениеСвойства(Документ,
		"Document.CorpActnNtfctn.CorpActnDtls.SctiesQty.MinExrcblQty.Utit")));
		
	ДатаНачалаПриемаЗаявокНаВыкуп = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ,
		"Document.CorpActnNtfctn.CorpActnDtls.PrdDtls.PricClctnPrd.Prd.StartDt",
		"Document.CorpActnNtfctn.CorpActnDtls.PrdDtls.PricClctnPrd.Prd.StartDtTm"));
	Если ЗначениеЗаполнено(ДатаНачалаПриемаЗаявокНаВыкуп) Тогда
		ПараметрыКД.Вставить("ДатаНачалаПриемаЗаявокНаВыкуп", ДатаНачалаПриемаЗаявокНаВыкуп);
	КонецЕсли;
	
	ДатаОкончанияПриемаЗаявокНаВыкуп = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ,
		"Document.CorpActnNtfctn.CorpActnDtls.PrdDtls.PricClctnPrd.Prd.EndDt",
		"Document.CorpActnNtfctn.CorpActnDtls.PrdDtls.PricClctnPrd.Prd.EndDtTm"));
	Если ЗначениеЗаполнено(ДатаОкончанияПриемаЗаявокНаВыкуп) Тогда
		ПараметрыКД.Вставить("ДатаОкончанияПриемаЗаявокНаВыкуп", ДатаОкончанияПриемаЗаявокНаВыкуп);
	КонецЕсли;
	
	// Узлы CorpActnOptnDtls
	// Найти выплату на 1 ЦБ, валюту и др. параметры
	CorpActnOptnDtls = ЗначениеСвойства(Документ, "Document.CorpActnNtfctn.CorpActnOptnDtls");
	Если CorpActnOptnDtls <> Неопределено Тогда
		CorpActnOptnDtls = Документ.Document.CorpActnNtfctn.CorpActnOptnDtls;
		Если ТипЗнч(CorpActnOptnDtls) = Тип("Массив") Тогда
			Для каждого Стр Из CorpActnOptnDtls Цикл
				ПрочитатьУзелCorpActnOptnDtls(Стр, ПараметрыКД);
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(CorpActnOptnDtls) = Тип("Структура") Тогда
			ПрочитатьУзелCorpActnOptnDtls(CorpActnOptnDtls, ПараметрыКД);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПараметрыКД.Свойство("СтавкаКупонногоДоходаГодовых") Тогда
		СтавкаКупонногоДоходаГодовыхСтр = ЗначениеСвойства(Документ,
			"Document.CorpActnNtfctn.CorpActnDtls.RateAndAmtDtls.Intrst.Rate");
		Если ЗначениеЗаполнено(СтавкаКупонногоДоходаГодовыхСтр) Тогда
			ПараметрыКД.Вставить("СтавкаКупонногоДоходаГодовых", СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьЧислоИзСтроки(СтавкаКупонногоДоходаГодовыхСтр));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПараметрыКД.Свойство("КоличествоДнейВКупонномПериоде") Тогда
		КоличествоДнейВКупонномПериодеСтр = ЗначениеСвойства(Документ,
			"Document.CorpActnNtfctn.CorpActnDtls.IntrstAcrdNbOfDays");
		Если ЗначениеЗаполнено(КоличествоДнейВКупонномПериодеСтр) Тогда
			ПараметрыКД.Вставить("КоличествоДнейВКупонномПериоде", СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьЧислоИзСтроки(КоличествоДнейВКупонномПериодеСтр));
		КонецЕсли;
	КонецЕсли;
	
	ДатаФиксацииСтр = ЗначениеСвойства(Документ,
		"Document.CorpActnNtfctn.CorpActnDtls.DtDtls.RcrdDt.Dt.Dt",
		"Document.CorpActnNtfctn.CorpActnDtls.DtDtls.RcrdDt.Dt.DtTm");
	ПараметрыКД.Вставить("ДатаФиксации", СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаФиксацииСтр));
	ПараметрыКД.Вставить("ДатаФиксацииНеизвестна", (ДатаФиксацииСтр = "UNWN"));
		
	ПараметрыКД.Вставить("Комментарий", "");
	
	// Узлы SplmtryData
	// Найти АдресВСетиИнтернет, КоэффициентКонвертации, НомерСтатьи
	SplmtryData = ЗначениеСвойства(Документ, "Document.CorpActnNtfctn.SplmtryData");
	Если SplmtryData <> Неопределено Тогда
		SplmtryData = Документ.Document.CorpActnNtfctn.SplmtryData;
		Если ТипЗнч(SplmtryData) = Тип("Массив") Тогда
			Для Каждого Стр Из SplmtryData Цикл
				ПрочитатьУзелSplmtryData(Стр, ПараметрыКД);
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(SplmtryData) = Тип("Структура") Тогда
			ПрочитатьУзелSplmtryData(SplmtryData, ПараметрыКД);
		КонецЕсли;
	КонецЕсли;
	
	// Узлы CorpActnDtls.AddtlInf
	// Найти ИнициаторВыкупа
	AddtlInf = ЗначениеСвойства(Документ, "Document.CorpActnNtfctn.CorpActnDtls.AddtlInf");
	Если AddtlInf <> Неопределено Тогда
		AddtlInf = Документ.Document.CorpActnNtfctn.CorpActnDtls.AddtlInf;
		Если ТипЗнч(AddtlInf) = Тип("Массив") Тогда
			Для Каждого Стр Из AddtlInf Цикл
				ПрочитатьУзелCorpActnDtls_AddtlInf(Стр, ПараметрыКД);
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(AddtlInf) = Тип("Структура") Тогда
			ПрочитатьУзелCorpActnDtls_AddtlInf(AddtlInf, ПараметрыКД);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыКД.Вставить("ХДивДата", СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ,
		"Document.CorpActnNtfctn.CorpActnDtls.DtDtls.ExDvddDt.Dt.Dt",
		"Document.CorpActnNtfctn.CorpActnDtls.DtDtls.ExDvddDt.Dt.DtTm")));
	
	ПараметрыКД.Вставить("ДатаНачалаКупонногоПериода", СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ,
		"Document.CorpActnNtfctn.CorpActnDtls.PrdDtls.IntrstPrd.Prd.StartDt.Dt.Dt",
		"Document.CorpActnNtfctn.CorpActnDtls.PrdDtls.IntrstPrd.Prd.StartDt.Dt.DtTm")));
		
	ПараметрыКД.Вставить("ДатаОкончанияКупонногоПериода", СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ,
		"Document.CorpActnNtfctn.CorpActnDtls.PrdDtls.IntrstPrd.Prd.EndDt.Dt.Dt",
		"Document.CorpActnNtfctn.CorpActnDtls.PrdDtls.IntrstPrd.Prd.EndDt.Dt.DtTm")));
		
	ДатаКДПланСтр = ЗначениеСвойства(Документ, "Document.CorpActnNtfctn.CorpActnDtls.DtDtls.RcrdDt.Dt.Dt");
	Если ПараметрыКД.ВидКД = "WTRC" И ЗначениеЗаполнено(ДатаКДПланСтр) Тогда
		ПараметрыКД.Вставить("ДатаКДПлан",
			СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаКДПланСтр));
	КонецЕсли;
	
	ПараметрыКД.Вставить("ПоследнийСрокПодачиИнструкцийПоНалоговымЛьготам",
		СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ,
			"Document.CorpActnNtfctn.CorpActnDtls.DtDtls.DdlnForTaxBrkdwnInstr.Dt.Dt",
			"Document.CorpActnNtfctn.CorpActnDtls.DtDtls.DdlnForTaxBrkdwnInstr.Dt.DtTm")));
	
	Если ПараметрыКД.ВидКД = "TREC" Тогда
		ПоследнийСрокСертификации = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(
			ЗначениеСвойства(Документ, "Document.CorpActnNtfctn.CorpActnDtls.DtDtls.CertfctnDdln.Dt.Dt"));
			
		Если НЕ ЗначениеЗаполнено(ПоследнийСрокСертификации) Тогда
			ПоследнийСрокСертификации = ДатаФиксацииИзТекста(
				ЗначениеСвойства(Документ, "Document.CorpActnNtfctn.AddtlInf.AddtlTxt.AddtlInf"));
		КонецЕсли;
			
		ПараметрыКД.Вставить("ДатаФиксации", ПоследнийСрокСертификации);
	КонецЕсли;
	
	ВариантыГолосования = ЗначениеСвойства(Документ, "Document.CorpActnNtfctn.CorpActnOptnDtls");
	Если ВариантыГолосования <> Неопределено Тогда
		ДополнитьВариантыУчастияВКД(ВариантыГолосования, ПараметрыКД);
	КонецЕсли;
	CorpActnNtfctn = ЗначениеСвойства(Документ, "Document.CorpActnNtfctn");
	ДобавитьДополнительнуюИнформацию(CorpActnNtfctn, ПараметрыКД);
	ДобавитьФиксированныеСтрокиВДополнительнуюИнформацию(ПараметрыКД);
	
	Возврат ПараметрыКД;
КонецФункции

Функция ДатаФиксацииИзТекста(Текст)
	Метка = "Дата фиксации списка владельцев";
	ДатаВозврата = Дата(1, 1, 1);
	Если Текст <> Неопределено Тогда
		ПозицияМетки = Найти(Текст, Метка);
		Если ПозицияМетки > 0 Тогда
			Блок = Сред(Текст, ПозицияМетки);
			ПозицияПС = Найти(Блок, Символы.ПС);
			Если ПозицияПС > 0 Тогда
				Блок = Лев(Блок, ПозицияПС-1);
			КонецЕсли;
			ДатаВозврата = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаИзСтрокиПрописью(Блок);
		КонецЕсли;
	КонецЕсли;
	Возврат ДатаВозврата;
КонецФункции

Процедура ЗагрузитьКоэффициентКонвертацииПоФормату2(Стр, ПараметрыКД)
	ИменаБлоковИсточников = Новый Массив;
	ИменаБлоковИсточников.Добавить("Envlp.XtnsnDt.XtnsnCorpActnOptnDtls.SctiesMvmntDtls.RateDtls.NewToOdFrctn");
	ИменаБлоковИсточников.Добавить("Envlp.XtnsnDt.XtnsnCorpActnOptnDtls.SctiesMvmntDtls.RateDtls.AddtlQtyForExstgSctiesFrctn");
	
	Для Каждого ИмяИсточника Из ИменаБлоковИсточников Цикл
		Колво1Коэф1	= ЗначениеСвойства(Стр, ИмяИсточника + ".Ratio1.Qty1");
		Колво2Коэф1	= ЗначениеСвойства(Стр, ИмяИсточника + ".Ratio1.Qty2");
		Колво1Коэф2	= ЗначениеСвойства(Стр, ИмяИсточника + ".Ratio2.Qty1");
		Колво2Коэф2	= ЗначениеСвойства(Стр, ИмяИсточника + ".Ratio2.Qty2");
		Если ЗначениеЗаполнено(Колво1Коэф1)
			И ЗначениеЗаполнено(Колво2Коэф1)
			И ЗначениеЗаполнено(Колво1Коэф2)
			И ЗначениеЗаполнено(Колво2Коэф2) Тогда
			ПараметрыКД.Вставить("КоэффициентКонвертации",
				Колво1Коэф1 + ":" + Колво2Коэф1 + "/" + Колво1Коэф2 + ":" + Колво2Коэф2);
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Считывает узел XML MeetingInstructionStatus в таблицу значений
//
// Возвращаемое значение:
//  структура для заполнения таблицы значений ДанныеКорпоративныхДействий
Функция ОбработатьMeetingInstructionStatus(Чтение)
	BizSvc = "AppHdr.BizSvc";
	Rltd_BizMsgIdr = "AppHdr.Rltd.BizMsgIdr";
	Rltd_BizSvc = "AppHdr.Rltd.BizSvc";
	BizMsgIdr = "AppHdr.BizMsgIdr";
	CreDt = "AppHdr.CreDt";
	MtgId = "Document.MtgInstrSts.MtgRef.MtgId";
	Sts = "Document.MtgInstrSts.InstrTpSts.InstrSts.GblInstrSts.PrcgSts.Sts";
	
	Документ = СтруктураДокументаXML(Чтение);
	
	ПараметрыКД	= Новый Структура;
	ПараметрыКД.Вставить("КодОтчета", ЗначениеСвойства(Документ, BizSvc));
	
	// Параметры документа раскрытия
	// Параметры уведомления
	ПараметрыКД.Вставить("ИсходныйДокументНомер",	ЗначениеСвойства(Документ, Rltd_BizMsgIdr));
	ПараметрыКД.Вставить("RltdBizSvc",				ЗначениеСвойства(Документ, Rltd_BizSvc));
	ПараметрыКД.Вставить("ВходящийДокументНомер",	ЗначениеСвойства(Документ, BizMsgIdr));
	
	ВходящийДокументДата = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ, CreDt));
	ПараметрыКД.Вставить("ВходящийДокументДата", ВходящийДокументДата + СмещениеСтандартногоВремени(ЧасовойПояс()));
	
	ПараметрыКД.Вставить("КДРеференсВходящий", ЗначениеСвойства(Документ, MtgId));
	ПараметрыКД.Вставить("Статус", ЗначениеСвойства(Документ, Sts));
	
	СодержимоеФайла = Новый Структура;
	СодержимоеФайла.Вставить("AppHdr_BizSvc", ЗначениеСвойства(Документ, BizSvc));
	СодержимоеФайла.Вставить("AppHdr_Rltd_BizMsgIdr", ЗначениеСвойства(Документ, Rltd_BizMsgIdr));
	СодержимоеФайла.Вставить("AppHdr_Rltd_BizSvc", ЗначениеСвойства(Документ, Rltd_BizSvc));
	СодержимоеФайла.Вставить("AppHdr_BizMsgIdr", ЗначениеСвойства(Документ, BizMsgIdr));
	СодержимоеФайла.Вставить("AppHdr_CreDt", ЗначениеСвойства(Документ, CreDt));
	СодержимоеФайла.Вставить("Document_MtgInstrSts_MtgRef_MtgId", ЗначениеСвойства(Документ, MtgId));
	СодержимоеФайла.Вставить("Document_MtgInstrSts_InstrTpSts_InstrSts_GblInstrSts_PrcgSts_Sts", ЗначениеСвойства(Документ, Sts));
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, СодержимоеФайла);
	СодержимоеФайлаТекст = Запись.Закрыть();
	ПараметрыКД.Вставить("СодержимоеФайла", СодержимоеФайлаТекст);
	
	Возврат ПараметрыКД;
КонецФункции

// Считывает узел XML CorporateActionCancellationAdvice
//
// Возвращаемое значение:
//  структура для заполнения таблицы значений ДанныеКорпоративныхДействий
Функция ОбработатьCorporateActionCancellationAdvice(Чтение)
	Документ = СтруктураДокументаXML(Чтение);
	ПараметрыКД	= Новый Структура;
	ПараметрыКД.Вставить("КодОтчета", ЗначениеСвойства(Документ, "AppHdr.BizSvc"));
	ПараметрыКД.Вставить("ВходящийДокументНомер", ЗначениеСвойства(Документ, "AppHdr.BizMsgIdr"));
	ВходящийДокументДата = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Документ, "AppHdr.CreDt"));
	ПараметрыКД.Вставить("ВходящийДокументДата", ВходящийДокументДата + СмещениеСтандартногоВремени(ЧасовойПояс()));
	ПараметрыКД.Вставить("КДРеференсВходящий", ЗначениеСвойства(Документ, "Document.CorpActnCxlAdvc.CorpActnGnlInf.CorpActnEvtId"));
	КодПричиныОтмены = ЗначениеСвойства(Документ, "Document.CorpActnCxlAdvc.CxlAdvcGnlInf.CxlRsnCd");
	ПараметрыКД.Вставить("ПричинаОтмены", Справочники.ПричиныОтмены.НайтиПоКоду(КодПричиныОтмены));
	ПараметрыКД.Вставить("НомерСчетаДепо", ЗначениеСвойства(Документ, "Document.CorpActnCxlAdvc.AcctsDtls.AcctsList.SfkpgAcct"));
	ПараметрыКД.Вставить("АдресВСетиИнтернетОтмена", АдресВСетиИнтернет(Документ, "Document.CorpActnCxlAdvc.SplmtryData",
		"Envlp"));
	
	CorpActnCxlAdvc = ЗначениеСвойства(Документ, "Document.CorpActnCxlAdvc");
	ДобавитьДополнительнуюИнформацию(CorpActnCxlAdvc, ПараметрыКД);
	ДобавитьФиксированныеСтрокиВДополнительнуюИнформацию(ПараметрыКД);
	
	Возврат ПараметрыКД;
КонецФункции

Процедура ПрочитатьУзелOthrId(УзелИсточник, ПараметрыПриемник)
	Prtry = ЗначениеСвойства(УзелИсточник, "Tp.Prtry");
	Если СокрЛП(ВРег(Prtry)) = "NSDR" Тогда
		ПараметрыПриемник.Вставить("КодЗагрузкиНДЦ", ЗначениеСвойства(УзелИсточник,	"Id"));
	КонецЕсли;
КонецПроцедуры

Процедура ПрочитатьУзелCorpActnOptnDtls(УзелИсточник, ПараметрыПриемник)
	OptnNb = ЗначениеСвойства(УзелИсточник, "OptnNb");
	Если OptnNb = "001" Тогда
		
		УзлыВыплатыНа1ЦБ = Новый Массив;
		УзлыВыплатыНа1ЦБ.Добавить("CshMvmntDtls.PricDtls.GncCshPricRcvdPerPdct.AmtPric.PricVal");
		УзлыВыплатыНа1ЦБ.Добавить("CshMvmntDtls.PricDtls.GncCshPricPdPerPdct.AmtPric.PricVal");
		УзлыВыплатыНа1ЦБ.Добавить("CshMvmntDtls.RateAndAmtDtls.IntrstRateUsdForPmt.Amt");
		УзлыВыплатыНа1ЦБ.Добавить("CshMvmntDtls.RateAndAmtDtls.GrssDvddRate.Amt");
		
		Для Каждого УзелВыплатыНа1ЦБ Из УзлыВыплатыНа1ЦБ Цикл
			СтрВыплатаНа1ЦБ = ЗначениеСвойстваИзСтруктурыМассива(УзелИсточник, УзелВыплатыНа1ЦБ);
			Если ЗначениеЗаполнено(СтрВыплатаНа1ЦБ) Тогда
				ПараметрыПриемник.Вставить("ВыплатаНа1ЦБ", СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьЧислоИзСтроки(СтрВыплатаНа1ЦБ));
				ПараметрыПриемник.Вставить("НаименованиеВалюты",
					СокрЛП(ЗначениеСвойстваИзСтруктурыМассива(УзелИсточник, УзелВыплатыНа1ЦБ + "_Attribute_Ccy")));
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ДатаОкончанияПриемаИнструкцийНРД = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(УзелИсточник,
			"DtDtls.RspnDdln.Dt.Dt",
			"DtDtls.RspnDdln.Dt.DtTm"));
		ПараметрыПриемник.Вставить("ДатаОкончанияПриемаИнструкцийНРД", ДатаОкончанияПриемаИнструкцийНРД);
		
		ДатаОкончанияПриемаИнструкцийВТБКБ = Документы.УведомлениеКлиентам.ДобавитьРабочийДень(ДатаОкончанияПриемаИнструкцийНРД, -2);
		СкопироватьВремя(ДатаОкончанияПриемаИнструкцийВТБКБ, ДатаОкончанияПриемаИнструкцийНРД);
		ПараметрыПриемник.Вставить("ДатаОкончанияПриемаИнструкцийВТБКБ", ДатаОкончанияПриемаИнструкцийВТБКБ);
		
		ДатаВалютированияСтрокой = ЗначениеСвойства(УзелИсточник,
			"CshMvmntDtls.DtDtls.ValDt.Dt.Dt",
			"CshMvmntDtls.DtDtls.ValDt.Dt.DtTm");
		ДатаВалютирования = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаВалютированияСтрокой);
		
		ДатаПроведенияСтрокой = ЗначениеСвойства(УзелИсточник,
			"CshMvmntDtls.DtDtls.PmtDt.Dt.Dt",
			"CshMvmntDtls.DtDtls.PmtDt.Dt.DtTm");
		ДатаПроведения = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаПроведенияСтрокой);
		
		Если ЗначениеЗаполнено(ДатаВалютирования) Тогда
			ПараметрыПриемник.Вставить("ДатаВыплатыНеПозднее", ДатаВалютирования);
			ПараметрыПриемник.Вставить("ДатаПроведенияСобрания", ДатаВалютирования);
		Иначе
			ПараметрыПриемник.Вставить("ДатаВыплатыНеПозднее", ДатаПроведения);
			ПараметрыПриемник.Вставить("ДатаПроведенияСобрания", ДатаПроведения);
		КонецЕсли;
			
		ПараметрыПриемник.Вставить("ПоследнийСрокРынка", СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(УзелИсточник,
			"DtDtls.MktDdln.Dt.DtTm")));
			
		ПараметрыПриемник.Вставить("СтавкаНалога", СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьЧислоИзСтроки(ЗначениеСвойства(УзелИсточник,
			"CshMvmntDtls.RateAndAmtDtls.WhldgTaxRate.Rate")));
		
		ПараметрыПриемник.Вставить("ЧистаяСтавкаДивидендов", СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьЧислоИзСтроки(ЗначениеСвойства(УзелИсточник,
			"CshMvmntDtls.RateAndAmtDtls.NetDvddRate.Amt")));
		
		ПараметрыПриемник.Вставить("ВалютаЧистойСтавкиДивидендов", ВалютаПоНаименованию(ЗначениеСвойства(УзелИсточник,
			"CshMvmntDtls.RateAndAmtDtls.NetDvddRate.Amt_Attribute_Ccy")));
			
		ПараметрыПриемник.Вставить("ВалютаПлатежа", ВалютаПоНаименованию(ЗначениеСвойства(УзелИсточник, "CcyOptn")));
			
		ПараметрыПриемник.Вставить("Период", ЗначениеСвойства(УзелИсточник,	"AddtlInf.AddtlTxt.AddtlInf"));
		
		ПараметрыПриемник.Вставить("ПогашаемаяЧасть", СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьЧислоИзСтроки(ЗначениеСвойства(УзелИсточник,
			"CshMvmntDtls.RateAndAmtDtls.AplblRate.Rate")));
			
		ПараметрыПриемник.Вставить("РазмерПогашаемойЧасти", СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьЧислоИзСтроки(ЗначениеСвойства(УзелИсточник,
			"CshMvmntDtls.PricDtls.GncCshPricRcvdPerPdct.AmtPric.PricVal")));
			
		СтавкаКупонногоДоходаГодовыхСтр = ЗначениеСвойства(УзелИсточник, "CshMvmntDtls.RateAndAmtDtls.Intrst.Rate");
		Если ЗначениеЗаполнено(СтавкаКупонногоДоходаГодовыхСтр) Тогда
			ПараметрыПриемник.Вставить("СтавкаКупонногоДоходаГодовых", СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьЧислоИзСтроки(СтавкаКупонногоДоходаГодовыхСтр));
		КонецЕсли;
			
		КоличествоДнейВКупонномПериодеСтр = ЗначениеСвойства(УзелИсточник,
			"CshMvmntDtls.RateAndAmtDtls.IntrstAcrdNbOfDays");
		Если ЗначениеЗаполнено(КоличествоДнейВКупонномПериодеСтр) Тогда
			ПараметрыПриемник.Вставить("КоличествоДнейВКупонномПериоде", СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьЧислоИзСтроки(КоличествоДнейВКупонномПериодеСтр));
		КонецЕсли;
		
		ДатаКДПланСтрокой = ЗначениеСвойства(УзелИсточник,
			"CshMvmntDtls.DtDtls.EarlstPmtDt.Dt.Dt",
			"CshMvmntDtls.DtDtls.EarlstPmtDt.Dt.DtTm");
		ДатаКДПлан = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаКДПланСтрокой);
		Если ЗначениеЗаполнено(ДатаВалютирования) Тогда
			ПараметрыПриемник.Вставить("ДатаКДПлан", ДатаВалютирования);
		ИначеЕсли ЗначениеЗаполнено(ДатаКДПлан) Тогда
			ПараметрыПриемник.Вставить("ДатаКДПлан", ДатаКДПлан);
		Иначе
			ПараметрыПриемник.Вставить("ДатаКДПлан", ДатаПроведения);
		КонецЕсли;
	
		SctiesMvmntDtls = ЗначениеСвойства(УзелИсточник, "SctiesMvmntDtls");
		Если SctiesMvmntDtls <> Неопределено Тогда
			SctiesMvmntDtls = УзелИсточник.SctiesMvmntDtls;
			Если ТипЗнч(SctiesMvmntDtls) = Тип("Массив") Тогда
				Для каждого Стр из SctiesMvmntDtls Цикл
					ПрочитатьУзелSctiesMvmntDtls(Стр, ПараметрыПриемник);
				КонецЦикла;
				
			ИначеЕсли ТипЗнч(SctiesMvmntDtls) = Тип("Структура") Тогда
				ПрочитатьУзелSctiesMvmntDtls(SctiesMvmntDtls, ПараметрыПриемник);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ПараметрыПриемник.Свойство("ЦенаРазмещения") Тогда
			ПараметрыПриемник.Вставить("ЦенаРазмещения", СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьЧислоИзСтроки(ЗначениеСвойства(УзелИсточник,
				"CshMvmntDtls.PricDtls.GncCshPricPdPerPdct.AmtPric.PricVal")));
			ПараметрыПриемник.Вставить("ВалютаЦеныРазмещения", ВалютаПоНаименованию(ЗначениеСвойства(УзелИсточник,
				"CshMvmntDtls.PricDtls.GncCshPricPdPerPdct.AmtPric.PricVal_Attribute_Ccy")));
		КонецЕсли;
		
		Если НЕ ПараметрыПриемник.Свойство("ДатаНачалаПриемаЗаявокНаВыкуп") Тогда
			ПараметрыПриемник.Вставить("ДатаНачалаПриемаЗаявокНаВыкуп", СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(УзелИсточник,
				"PrdDtls.ActnPrd.Prd.StartDt.Dt.Dt",
				"PrdDtls.ActnPrd.Prd.StartDt.Dt.DtTm")));
		КонецЕсли;
		
		Если НЕ ПараметрыПриемник.Свойство("ДатаОкончанияПриемаЗаявокНаВыкуп") Тогда
			ПараметрыПриемник.Вставить("ДатаОкончанияПриемаЗаявокНаВыкуп", СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(УзелИсточник,
				"PrdDtls.ActnPrd.Prd.EndDt.Dt.Dt",
				"PrdDtls.ActnPrd.Prd.EndDt.Dt.DtTm")));
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Процедура ПрочитатьУзелSctiesMvmntDtls(УзелИсточник, ПараметрыПриемник)
	ДатаКДРеестрСтр = ЗначениеСвойства(УзелИсточник,
		"DtDtls.PmtDt.Dt.Dt",
		"DtDtls.PmtDt.Dt.DtTm");
	Если ЗначениеЗаполнено(ДатаКДРеестрСтр) Тогда
		ПараметрыПриемник.Вставить("ДатаКДРеестр", СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаКДРеестрСтр));
	КонецЕсли;
	ПараметрыПриемник.Вставить("ДатаКДРеестрНеизвестна", (ДатаКДРеестрСтр = "UKWN"));
	
	ДатаКДНРДСтр = ЗначениеСвойства(УзелИсточник,
		"DtDtls.EarlstPmtDt.Dt.Dt",
		"DtDtls.EarlstPmtDt.Dt.DtTm");
	Если ЗначениеЗаполнено(ДатаКДНРДСтр) Тогда
		ПараметрыПриемник.Вставить("ДатаКДНРД", СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаКДНРДСтр));
	КонецЕсли;
	ПараметрыПриемник.Вставить("ДатаКДНРДНеизвестна", (ДатаКДНРДСтр = "UKWN"));
	
	ЦенаРазмещения = ЗначениеСвойства(УзелИсточник, "SctyDtls.IssePric");
	Если ЦенаРазмещения <> Неопределено Тогда
		ПараметрыПриемник.Вставить("ЦенаРазмещения", СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьЧислоИзСтроки(ЦенаРазмещения));
		ПараметрыПриемник.Вставить("ВалютаЦеныРазмещения", ВалютаПоНаименованию(ЗначениеСвойства(УзелИсточник,
			"SctyDtls.IssePric_Attribute_Ccy")));
	КонецЕсли;
		
	Числитель	= ЗначениеСвойства(УзелИсточник, "RateDtls.NewToOd.QtyToQty.Qty1");
	Знаменатель	= ЗначениеСвойства(УзелИсточник, "RateDtls.NewToOd.QtyToQty.Qty2");
	Если ЗначениеЗаполнено(Числитель) И ЗначениеЗаполнено(Знаменатель) Тогда
		ПараметрыПриемник.Вставить("КоэффициентКонвертации", Числитель + "/" + Знаменатель);
	КонецЕсли;
		
	// Заполнить ценные бумаги
	ISIN = ЗначениеСвойства(УзелИсточник, "SctyDtls.FinInstrmId.ISIN");
	CdtDbtInd = ЗначениеСвойства(УзелИсточник, "CdtDbtInd");
	Если ЗначениеЗаполнено(ISIN) И ЗначениеЗаполнено(CdtDbtInd) Тогда
		ОписаниеЦБ = Новый Структура("ЦеннаяБумага,ДтКт",
			Справочники.ЦенныеБумаги.НайтиПоРеквизиту("ISIN", ISIN), CdtDbtInd);
		
		// Обновить массив ЦенныеБумаги в структуре описания документа
		Если ПараметрыПриемник.Свойство("ЦенныеБумаги") Тогда
			мЦенныеБумаги = ПараметрыПриемник.ЦенныеБумаги;
		Иначе
			мЦенныеБумаги = Новый Массив;
		КонецЕсли;
		мЦенныеБумаги.Добавить(ОписаниеЦБ);
		ПараметрыПриемник.Вставить("ЦенныеБумаги", мЦенныеБумаги);
	КонецЕсли;
КонецПроцедуры

Процедура ПрочитатьУзелSplmtryData(УзелИсточник, ПараметрыПриемник)
	Если Не ПараметрыПриемник.Свойство("АдресВСетиИнтернет") Тогда
		UpdDesc = ЗначениеСвойства(УзелИсточник, "Envlp.XtnsnDt.AddtlInf.AddtlTxt.UpdDesc");
		Если ВРег(UpdDesc) = ВРег("FtpFile") Тогда
			AddtlInf = ЗначениеСвойства(УзелИсточник, "Envlp.XtnsnDt.AddtlInf.AddtlTxt.AddtlInf");
			ПозицияРешеток = Найти(AddtlInf,"##");
			Если ПозицияРешеток > 0 Тогда
				AddtlInf = Прав(AddtlInf, СтрДлина(AddtlInf) - ПозицияРешеток - 1); 
				ПараметрыПриемник.Вставить("АдресВСетиИнтернет", AddtlInf);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПараметрыПриемник.Свойство("КоэффициентКонвертации") Тогда
		ЗагрузитьКоэффициентКонвертацииПоФормату2(УзелИсточник, ПараметрыПриемник);
	КонецЕсли;
	
	Если Не ПараметрыПриемник.Свойство("НомерСтатьи") Тогда
		ПараметрыПриемник.Вставить("НомерСтатьи", ЗначениеСвойства(УзелИсточник,
			"Envlp.XtnsnDt.RgltrRprtng.LwsInPlc.LwsInPlcCd"));
	КонецЕсли;
	
	Если Не ПараметрыПриемник.Свойство("ВыплатаНа1ЦБ") Тогда
		
		AddtlInf = ЗначениеСвойства(УзелИсточник, "Envlp.XtnsnDt.XtnsnCorpActnOptnDtls");
		Если AddtlInf <> Неопределено Тогда
			
			Если ТипЗнч(AddtlInf) = Тип("Массив") Тогда
				Для Каждого Стр Из AddtlInf Цикл
					ПрочитатьУзелXtnsnCorpActnOptnDtls(Стр, ПараметрыПриемник);
				КонецЦикла;
				
			ИначеЕсли ТипЗнч(AddtlInf) = Тип("Структура") Тогда
				ПрочитатьУзелXtnsnCorpActnOptnDtls(AddtlInf, ПараметрыПриемник);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьУзелXtnsnCorpActnOptnDtls(УзелИсточник, ПараметрыПриемник)
	OptnNb = ЗначениеСвойства(УзелИсточник, "OptnNb");
	Если OptnNb = "001" Тогда
		
		УзлыВыплатыНа1ЦБ = Новый Массив;
		УзлыВыплатыНа1ЦБ.Добавить("CshMvmntDtls.PricDtls.GncCshPricRcvdPerPdct.AmtPric.PricVal");
		УзлыВыплатыНа1ЦБ.Добавить("CshMvmntDtls.PricDtls.GncCshPricPdPerPdct.AmtPric.PricVal");
		УзлыВыплатыНа1ЦБ.Добавить("CshMvmntDtls.RateAndAmtDtls.IntrstRateUsdForPmt.Amt");
		УзлыВыплатыНа1ЦБ.Добавить("CshMvmntDtls.RateAndAmtDtls.GrssDvddRate.Amt");
		
		Для Каждого УзелВыплатыНа1ЦБ Из УзлыВыплатыНа1ЦБ Цикл
			СтрВыплатаНа1ЦБ = ЗначениеСвойстваИзСтруктурыМассива(УзелИсточник, УзелВыплатыНа1ЦБ);
			Если ЗначениеЗаполнено(СтрВыплатаНа1ЦБ) Тогда
				ПараметрыПриемник.Вставить("ВыплатаНа1ЦБ", СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьЧислоИзСтроки(СтрВыплатаНа1ЦБ)); 
				ПараметрыПриемник.Вставить("НаименованиеВалюты",
					СокрЛП(ЗначениеСвойстваИзСтруктурыМассива(УзелИсточник, УзелВыплатыНа1ЦБ + "_Attribute_Ccy"))); 
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

Процедура ПрочитатьУзелCorpActnDtls_AddtlInf(УзелИсточник, ПараметрыПриемник)
	Если Не ПараметрыПриемник.Свойство("ИнициаторВыкупа") Тогда
		Если ТипЗнч(ЗначениеСвойства(УзелИсточник, "Offerr")) = Тип("Структура") Тогда
			UpdDesc = ЗначениеСвойства(УзелИсточник, "Offerr.UpdDesc");
			Если ВРЕГ(UpdDesc) = ВРЕГ("Name") Тогда
				AddtlInf = ЗначениеСвойства(УзелИсточник, "Offerr.AddtlInf");
				ПараметрыПриемник.Вставить("ИнициаторВыкупа", AddtlInf);
			КонецЕсли;
		ИначеЕсли ТипЗнч(ЗначениеСвойства(УзелИсточник, "Offerr")) = Тип("Массив") Тогда
			UpdDesc = ЗначениеСвойстваИзСтруктурыМассива(УзелИсточник, "Offerr.UpdDesc");
			Если ВРЕГ(UpdDesc) = ВРЕГ("Name") Тогда
				AddtlInf = ЗначениеСвойстваИзСтруктурыМассива(УзелИсточник, "Offerr.AddtlInf");
				ПараметрыПриемник.Вставить("ИнициаторВыкупа", AddtlInf);
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента(УзелXtnsn0, ПараметрыКД)
	Перем Дата;
	Дата = "";
	ИмяСвойства = "DtDtls.RspnDdln.Dt.DtTm";
	
	CorpActnOptnDtls = ЗначениеСвойства(УзелXtnsn0, "XtnsnEnvlp.XtnsnDt.CorpActnOptnDtls");
	Если CorpActnOptnDtls <> Неопределено Тогда
		CorpActnOptnDtls = УзелXtnsn0.XtnsnEnvlp.XtnsnDt.CorpActnOptnDtls;
		Если ТипЗнч(CorpActnOptnDtls) = Тип("Массив") Тогда
			Для Каждого Стр Из CorpActnOptnDtls Цикл
				DtTm = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(Стр, ИмяСвойства));
				Если ЗначениеЗаполнено(DtTm) Тогда
					Если ЗначениеЗаполнено(Дата) Тогда
						Дата = Мин(Дата, DtTm);
					Иначе
						Дата = DtTm;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(CorpActnOptnDtls) = Тип("Структура") Тогда
			DtTm = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ЗначениеСвойства(CorpActnOptnDtls, ИмяСвойства));
			Если ЗначениеЗаполнено(DtTm) Тогда
				Дата = DtTm;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Дата) Тогда
		ПараметрыКД.Вставить("ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента", Дата);
	КонецЕсли;
КонецПроцедуры

// Заполняет таблицу значений ДанныеКорпоративныхДействий из структуры ДанныеФайла
Процедура ОбработатьДанныеCorporateActionNotification(ДанныеФайла, ФайлZIP)
	// Создание строки по раскрытию
	НоваяСтрока	= ДанныеКорпоративныхДействий.Добавить();
	
	// Перенос значений одноименных реквизитов
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеФайла);
	
	// Перенос остальных полей
	НоваяСтрока.Обрабатывать	= Истина;
	НоваяСтрока.Организация		= Константы.ОрганизацияПоУмолчанию.Получить();
	НоваяСтрока.Инициатор		= ВышестоящийДепозитарий;
	
	// Определить ВидКД
	ВидКДКод = ЗначениеСвойства(ДанныеФайла, "ВидКД");
	ВидКД = Справочники.ВидыКорпоративныхДействий.НайтиПоКоду(ВидКДКод);
	Если Не ЗначениеЗаполнено(ВидКД) И ЗначениеЗаполнено(ВидКДКод) Тогда
		ВидКДОбъект = Справочники.ВидыКорпоративныхДействий.СоздатьЭлемент();
		ВидКДОбъект.Код = ВидКДКод;
		ВидКДОбъект.Наименование = ВидКДКод;
		ВидКДОбъект.Записать();
		ВидКД = ВидКДОбъект.Ссылка;
	КонецЕсли;
	НоваяСтрока.ВидКД = ВидКД;
	
	// Определить СчетДЕПО
	НомерСчетаДепо = ЗначениеСвойства(ДанныеФайла, "НомерСчетаДепо");
	ЗаполнитьСчетДепоИРеференс(НоваяСтрока, НомерСчетаДепо);
	ОтключитьОбработкуСобственныхСчетов(НоваяСтрока, НомерСчетаДепо);
	
	НоваяСтрока.ДокументКД = Документы.КорпоративноеДействие_Новый.КДПоВходящемуРеференсуИСчетуДепо(
		НоваяСтрока.КДРеференсВходящий, НоваяСтрока.СчетДЕПО);
	Если ЗначениеЗаполнено(НоваяСтрока.КДРеференсСвязанный) Тогда
		НоваяСтрока.КДРеференсСвязанныйСсылка = СвязанноеКД(НоваяСтрока.КДРеференсСвязанный, НоваяСтрока.СчетДЕПО);
	КонецЕсли;
	
	// Найти ЦБ и эмитента
	НоваяСтрока.ЦеннаяБумага1 = ЦеннаяБумагаПоКодуЗагрузкиНДЦ(ЗначениеСвойства(ДанныеФайла, "КодЗагрузкиНДЦ"),
		НоваяСтрока.ВходящийДокументДата);
	Если ЗначениеЗаполнено(НоваяСтрока.ЦеннаяБумага1) Тогда
		НоваяСтрока.Эмитент = НоваяСтрока.ЦеннаяБумага1.Эмитент;
	Иначе
		ЦБ = Справочники.ЦенныеБумаги.НайтиПоРеквизиту("ISIN", ЗначениеСвойства(ДанныеФайла, "ISINДляПоискаЭмитента"));
		НоваяСтрока.Эмитент = ЦБ.Эмитент;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НоваяСтрока.КДРеференсСвязанныйСсылка) И НужноИскатьСвязанноеКД(ВидКДКод) Тогда
		НоваяСтрока.КДРеференсСвязанныйСсылка = СвязанноеКДПоПервымСимволамРеференсаИСчетуДепо(
			НоваяСтрока.КДРеференсСвязанный, НоваяСтрока.СчетДЕПО, ВидКДКод);
		Если ВидКДКод = "WTRC" И Не ЗначениеЗаполнено(НоваяСтрока.КДРеференсСвязанныйСсылка) Тогда
			Если ЗначениеЗаполнено(НоваяСтрока.ЦеннаяБумага1) Тогда
				ISIN = НоваяСтрока.ЦеннаяБумага1.ISIN;
			Иначе
				ISIN = ЗначениеСвойства(ДанныеФайла, "ISINДляПоискаЭмитента");
			КонецЕсли;
			ОтправитьУведомлениеОНеопределенномСвязанномКДДляWTRC(НоваяСтрока.ВидКД, НоваяСтрока.КДРеференс,
			НоваяСтрока.Эмитент, ISIN);
		КонецЕсли;
	КонецЕсли;
	
	Если ВидКДКод = "WTRC" // Подтверждение освобождения от налогов
		И НЕ Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(НоваяСтрока.ЦеннаяБумага1) Тогда
		НоваяСтрока.ДатаОкончанияПриемаИнструкцийНРД = ДанныеФайла.ПоследнийСрокПодачиИнструкцийПоНалоговымЛьготам;
		НоваяСтрока.ДатаОкончанияПриемаИнструкцийВТБКБ = Документы.УведомлениеКлиентам.ДобавитьРабочийДень(
			НоваяСтрока.ДатаОкончанияПриемаИнструкцийНРД, -2);
		ОбщегоНазначения.СкопироватьВремя(НоваяСтрока.ДатаОкончанияПриемаИнструкцийВТБКБ,
			НоваяСтрока.ДатаОкончанияПриемаИнструкцийНРД);
	КонецЕсли;
	
	Валюта = ВалютаПоНаименованию(ЗначениеСвойства(ДанныеФайла, "НаименованиеВалюты"));
	НоваяСтрока.ВалютаДивидендаКупона = Валюта;
	НоваяСтрока.БанковскийСчет = ПолучитьБанковскийСчет(НоваяСтрока.Организация, Валюта);
	
	НоваяСтрока.КлючЦенныеБумаги = НовыйКлючСвязиДанныхКДиЦБ();
	
	// Заполнение строк с ценными бумагами для данного документа КД
	Если ДанныеФайла.Свойство("ЦенныеБумаги") Тогда
		Для каждого Строка Из ДанныеФайла.ЦенныеБумаги Цикл
			НоваяСтрокаЦБ = ЦенныеБумаги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаЦБ, Строка);
			НоваяСтрокаЦБ.КлючДанныеКорпоративныхДействий = НоваяСтрока.КлючЦенныеБумаги;
		КонецЦикла;
	КонецЕсли;
	
	ДанныеВариантыУчастия = ЗначениеСвойства(ДанныеФайла, "ВариантыУчастия");
	Если ДанныеВариантыУчастия <> Неопределено Тогда
		Для Каждого Вариант Из ДанныеВариантыУчастия Цикл
			НовыйВариант = ВариантыУчастия.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйВариант, Вариант);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет таблицу значений ДанныеКорпоративныхДействий из структуры ДанныеФайла
Процедура ОбработатьДанныеMeetingInstructionStatus(ДанныеФайла, ФайлZIP)
	// Создание строки по раскрытию
	НоваяСтрока	= ДанныеКорпоративныхДействий.Добавить();
	НоваяСтрока.ПолноеИмяФайла = ЗначениеСвойства(ДанныеФайла, "ПолноеИмяФайла");
	НоваяСтрока.Обрабатывать				= Истина;
	НоваяСтрока.Организация					= Константы.ОрганизацияПоУмолчанию.Получить();
	НоваяСтрока.Инициатор					= ВышестоящийДепозитарий;
	НоваяСтрока.КодОтчета					= ЗначениеСвойства(ДанныеФайла, "КодОтчета");
	НоваяСтрока.ВходящийДокументДата		= ЗначениеСвойства(ДанныеФайла, "ВходящийДокументДата");
	НоваяСтрока.ВходящийДокументНомер		= ЗначениеСвойства(ДанныеФайла, "ВходящийДокументНомер");
	НоваяСтрока.ИсходныйДокументНомер		= ЗначениеСвойства(ДанныеФайла, "ИсходныйДокументНомер");
	НоваяСтрока.КДРеференсВходящий			= ЗначениеСвойства(ДанныеФайла, "КДРеференсВходящий");
	НоваяСтрока.НеСоздаватьНовоеКД = Истина;
	НоваяСтрока.ДополнительнаяИнформация = ЗначениеСвойства(ДанныеФайла, "СодержимоеФайла");
	
	// Определить СчетДЕПО
	НомерСчетаДепо = ЗначениеСвойства(ДанныеФайла, "НомерСчетаДепо");
	ЗаполнитьСчетДепоИРеференс(НоваяСтрока, НомерСчетаДепо);
	ОтключитьОбработкуСобственныхСчетов(НоваяСтрока, НомерСчетаДепо);
	
	ДокументКД = Неопределено;
	СвязанныйДокументПоКарточкеКД = Неопределено;
	ЗаполнитьДокументыКДПоСообщениюКД(НоваяСтрока.ИсходныйДокументНомер, ДокументКД, СвязанныйДокументПоКарточкеКД);
	Если Не ЗначениеЗаполнено(ДокументКД) Тогда
		ДокументКД = Документы.КорпоративноеДействие_Новый.КДПоВходящемуРеференсуИСчетуДепо(
			НоваяСтрока.КДРеференсВходящий, НоваяСтрока.СчетДЕПО);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СвязанныйДокументПоКарточкеКД) Тогда
		СвязанныйДокументПоКарточкеКД = ПолучитьРаскрытиеСпискаВладельцев(НоваяСтрока.ИсходныйДокументНомер,
			ДокументКД, ЗначениеСвойства(ДанныеФайла, "RltdBizSvc"), НоваяСтрока.КДРеференсВходящий);
	КонецЕсли;
	НоваяСтрока.ДокументКД = ДокументКД;
	НоваяСтрока.СвязанныйДокументПоКарточкеКД = СвязанныйДокументПоКарточкеКД;
	Если ЗначениеЗаполнено(СвязанныйДокументПоКарточкеКД) Тогда
		СтатусСтрока = ВРЕГ(СокрЛП(ЗначениеСвойства(ДанныеФайла, "Статус")));
		Если ЗначениеЗаполнено(СтатусСтрока) Тогда
			Если СтатусСтрока = "CAND" Тогда
				НоваяСтрока.СвязанныйДокументПоКарточкеКДСтатус = Перечисления.СтатусыРаскрытияСписковВладельцев.Отменено;
			ИначеЕсли СтатусСтрока = "PACK" Тогда
				НоваяСтрока.СвязанныйДокументПоКарточкеКДСтатус = Перечисления.СтатусыРаскрытияСписковВладельцев.Принято;
			ИначеЕсли СтатусСтрока = "COMP" Тогда
				НоваяСтрока.СвязанныйДокументПоКарточкеКДСтатус = Перечисления.СтатусыРаскрытияСписковВладельцев.ОбработкаЗавершена;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Текст = "В регистре сведений 'Этапы КД' не найден документ КД 'Раскрытие списка владельцев'"
			+ " по номеру отправленного сообщения " + НоваяСтрока.ВходящийДокументНомер;
		#Если Клиент Тогда
			Сообщить(Текст, СтатусСообщения.Внимание);
		#Иначе
			ЗаписьЖурналаРегистрации("Загрузка 'Корпоративных действий'", УровеньЖурналаРегистрации.Информация,,, Текст);
		#КонецЕсли
		ОтправитьУведомлениеОНеопределенномРСВ(НоваяСтрока.КДРеференсВходящий);
	КонецЕсли;
КонецПроцедуры

// Заполняет таблицу значений ДанныеКорпоративныхДействий из структуры ДанныеФайла
Процедура ОбработатьДанныеCorporateActionCancellationAdvice(ДанныеФайла)
	// Создание строки по раскрытию
	НоваяСтрока	= ДанныеКорпоративныхДействий.Добавить();
	
	// Перенос значений одноименных реквизитов
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеФайла);
	
	// Перенос остальных полей
	НоваяСтрока.Обрабатывать	= Истина;
	НоваяСтрока.Организация		= Константы.ОрганизацияПоУмолчанию.Получить();
	НоваяСтрока.Инициатор		= ВышестоящийДепозитарий;
	
	// Определить СчетДЕПО
	НомерСчетаДепо = ЗначениеСвойства(ДанныеФайла, "НомерСчетаДепо");
	ЗаполнитьСчетДепоИРеференс(НоваяСтрока, НомерСчетаДепо);
	ОтключитьОбработкуСобственныхСчетов(НоваяСтрока, НомерСчетаДепо);
	
	НоваяСтрока.ДокументКД = Документы.КорпоративноеДействие_Новый.КДПоВходящемуРеференсуИСчетуДепо(
		НоваяСтрока.КДРеференсВходящий, НоваяСтрока.СчетДЕПО);
	Если ЗначениеЗаполнено(НоваяСтрока.КДРеференсСвязанный) Тогда
		НоваяСтрока.КДРеференсСвязанныйСсылка = СвязанноеКД(НоваяСтрока.КДРеференсСвязанный, НоваяСтрока.СчетДЕПО);
	КонецЕсли;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////
// Работа с данными

Функция ПолучитьБанковскийСчет(Организация, Валюта)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	НЕ БанковскиеСчета.ПометкаУдаления
	|	И БанковскиеСчета.ВалютаДенежныхСредств = &ВалютаДенежныхСредств
	|	И БанковскиеСчета.ТипНазначения = &ТипНазначения
	|	И БанковскиеСчета.Владелец = &Организация
	|	И (БанковскиеСчета.ДатаЗакрытия > &ТекущаяДата
	|			ИЛИ БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))");

	Запрос.УстановитьПараметр("Организация"				, Организация);
	Запрос.УстановитьПараметр("ВалютаДенежныхСредств"	, Валюта);
	Запрос.УстановитьПараметр("ТипНазначения"			, ?(Валюта = Константы.ВалютаРегламентированногоУчета.Получить(), Перечисления.ТипыНазначенияБанковскихСчетов.Депозитарный, Перечисления.ТипыНазначенияБанковскихСчетов.ДепозитарныйТранзит));
	Запрос.УстановитьПараметр("ТекущаяДата"				, ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество()>0 Тогда
		Возврат Результат[0].Ссылка;
	Иначе
		Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;
КонецФункции

// Функция - Получить раскрытие списка владельцев
// Ищет РСВ по КДРеференс, если более 1, то берет самое последее по этапам КД по номеру сообщения
// Если RltdBizSvc = "CA044" (на раскрытие списка получили раскрытие списка), то поиск продолжается:
// берется последнее РСВ с указанным КД Референс по данному КД
// Параметры:
//  НомерСообщенияОтправленного	 - Строка - Номер сообщения отправленного
//  КД							 - ДокументСсылка.КорпоративноеДействие_Новый - Ссылка на КД
//  RltdBizSvc					 - Строка - Код формы
//  КДРеференс					 - Строка - КД референс РСВ
// 
// Возвращаемое значение:
//  - ДокументСсылка.РаскрытиеСпискаВладельцев
//
Функция ПолучитьРаскрытиеСпискаВладельцев(НомерСообщенияОтправленного, КД, RltdBizSvc, КДРеференс)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РаскрытиеСпискаВладельцев.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|ГДЕ
	|	РаскрытиеСпискаВладельцев.КДРеференс = &КДРеференс";
	Запрос.УстановитьПараметр("КДРеференс", КДРеференс);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка.Количество() = 1 Тогда
		Возврат Выгрузка[0].Ссылка;
	ИначеЕсли Выгрузка.Количество() > 1 Тогда
		ДокументыРСВ = Выгрузка.ВыгрузитьКолонку("Ссылка");
	Иначе
		Возврат Документы.РаскрытиеСпискаВладельцев.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭтапыКД.ДокументКД КАК ДокументКД
	|ИЗ
	|	РегистрСведений.ЭтапыКД КАК ЭтапыКД
	|ГДЕ
	|	ЭтапыКД.НомерСообщения = &НомерСообщения
	|	И ЭтапыКД.ДокументКД В(&ДокументыРСВ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапыКД.Период УБЫВ";
	Запрос.УстановитьПараметр("НомерСообщения", СокрЛП(НомерСообщенияОтправленного));
	Запрос.УстановитьПараметр("ДокументыРСВ", ДокументыРСВ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДокументКД;
	КонецЕсли;
	
	Если СокрЛП(RltdBizSvc) = "CA044" Тогда
		// На раскрытие списка получили раскрытие списка: берется последнее РСВ по данному КД
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭтапыКД.ДокументКД КАК ДокументКД,
		|	ЭтапыКД.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЭтапыКД КАК ЭтапыКД
		|ГДЕ
		|	ЭтапыКД.КД = &КД
		|	И ЭтапыКД.ДокументКД ССЫЛКА Документ.РаскрытиеСпискаВладельцев
		|	И ЭтапыКД.ДокументКД В(&ДокументыРСВ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		Запрос.УстановитьПараметр("КД", КД);
		Запрос.УстановитьПараметр("ДокументыРСВ", ДокументыРСВ);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ДокументКД;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Документы.РаскрытиеСпискаВладельцев.ПустаяСсылка();
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////
// Формирование документов

// Создает/перезаписывает документ "Корпоративное действие новый"
//
Процедура СформироватьДокументы() Экспорт
	ИмяСобытия	= "Загрузка 'Корпоративных действий'";
	Сообщение	= Новый СообщениеПользователю();
	МассивВхНомеров = Новый Массив;
	НачатьТранзакцию();
	Для Каждого Строка Из ДанныеКорпоративныхДействий Цикл
		
		Если Не Строка.Обрабатывать Тогда
			Продолжить;
		КонецЕсли;
		
		ОтключитьОбработкуСобственныхСчетов(Строка);
		
		Если Не Строка.Обрабатывать Тогда
			Продолжить;
		КонецЕсли;
		
		МассивВхНомеров.Добавить(СокрЛП(Строка.ВходящийДокументНомер));
		
		Если Не ЗначениеЗаполнено(Строка.ДокументКД) Тогда
			Строка.ДокументКД = Документы.КорпоративноеДействие_Новый.КДПоВходящемуРеференсуИСчетуДепо(
				Строка.КДРеференсВходящий, Строка.СчетДЕПО);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Строка.ДокументКД) Тогда
			Строка.ДокументКД = Документы.КорпоративноеДействие_Новый.КДПоВходящемуРеференсуИСчетуДепо(
				Строка.КДРеференсВходящий, Справочники.СчетаДепоМХ.ПустаяСсылка());
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.ДокументКД) Тогда
			КД = Строка.ДокументКД.ПолучитьОбъект();
		ИначеЕсли Строка.НеСоздаватьНовоеКД Тогда
			Если ЗначениеЗаполнено(Строка.СвязанныйДокументПоКарточкеКД) Тогда
				РСВ = Строка.СвязанныйДокументПоКарточкеКД.ПолучитьОбъект();
				РСВ.Статус = Строка.СвязанныйДокументПоКарточкеКДСтатус;
				РСВ.Записать(?(РСВ.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
				МЗ = РегистрыСведений.ЭтапыКД.СоздатьМенеджерЗаписи();
				МЗ.Активность				= Истина;
				МЗ.Период					= Строка.ВходящийДокументДата;
				МЗ.ЭтапКД					= Справочники.ЭтапыКД.НайтиПоКоду(Строка.КодОтчета);
				МЗ.КодОтчета				= Строка.КодОтчета;
				МЗ.НомерСообщения			= Строка.ВходящийДокументНомер;
				МЗ.НомерСообщенияИсходный	= Строка.ИсходныйДокументНомер;
				МЗ.ТипУведомления			= Строка.ТипУведомления;
				МЗ.Исходящее				= Ложь;
				МЗ.КД = Строка.СвязанныйДокументПоКарточкеКД;
				МЗ.ДокументКД = Строка.СвязанныйДокументПоКарточкеКД;
				МЗ.ВозможноФормированиеУведомленияКлиентам = Истина;
				МЗ.Записать();
				СоздатьДокументыФайловогоШлюзаПоСтатусуРСВ(РСВ, Строка);
			КонецЕсли;
			
			Продолжить;
		Иначе
			КД = Документы.КорпоративноеДействие_Новый.СоздатьДокумент();
			КД.Дата = ТекущаяДатаСеанса();
		КонецЕсли;
		ЭтоНовыйКД = КД.ЭтоНовый();
		
		Этап = Справочники.ЭтапыКД.НайтиПоКоду(Строка.КодОтчета);
		Если Этап.Пустая() Тогда
			ТекстСообщения = "Строка " + Строка.НомерСтроки
				+ " не загружена. В справочнике 'Этапы КД' не найден этап с кодом " + Строка.КодОтчета;
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьСвойстваКД(КД, Строка, Этап);
		
		// Изменим статус документа раскрытия списка владельцев
		Если (Строка.КодОтчета = "CA061") // Статус обработки инструкции
			И ЗначениеЗаполнено(Строка.СвязанныйДокументПоКарточкеКД)
			И ТипЗнч(Строка.СвязанныйДокументПоКарточкеКД) = Тип("ДокументСсылка.РаскрытиеСпискаВладельцев") Тогда
			
			мОбъект = Строка.СвязанныйДокументПоКарточкеКД.ПолучитьОбъект();
			ЕстьИзменения = Ложь;
			
			СоздатьДокументыФайловогоШлюзаПоСтатусуРСВ(мОбъект, Строка);
			
			Если ЗначениеЗаполнено(Строка.СвязанныйДокументПоКарточкеКДСтатус)
				И Строка.СвязанныйДокументПоКарточкеКД.Статус <> Строка.СвязанныйДокументПоКарточкеКДСтатус Тогда
				мОбъект.Статус = Строка.СвязанныйДокументПоКарточкеКДСтатус;
				ЕстьИзменения = Истина;
			КонецЕсли;
			Если Строка.СвязанныйДокументПоКарточкеКДСтатус = Перечисления.СтатусыРаскрытияСписковВладельцев.ОбработкаЗавершена И Не ЗначениеЗаполнено(мОбъект.ДатаИсполнения) Тогда
				мОбъект.ДатаИсполнения = Строка.ВходящийДокументДата;
				мОбъект.REPORT_ID = Строка.ВходящийДокументНомер;
				ЕстьИзменения = Истина;
			КонецЕсли; 
			Если ЕстьИзменения Тогда
				Попытка
					мОбъект.Записать();
				Исключение
					ТекстСообщения = "Не удалось записать документ с новым статусом.";
					ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , Строка.СвязанныйДокументПоКарточкеКД, ТекстСообщения);
					Сообщение.Текст = ТекстСообщения + " " + Строка.СвязанныйДокументПоКарточкеКДСтатус;
					Сообщение.Сообщить();
				КонецПопытки;
			КонецЕсли; 
			
		КонецЕсли;
		
		// Запишем ЭтапКД
		МЗ = РегистрыСведений.ЭтапыКД.СоздатьМенеджерЗаписи();
		МЗ.Активность				= Истина;
		МЗ.Период					= Строка.ВходящийДокументДата;
		МЗ.ЭтапКД					= Этап;
		МЗ.КодОтчета				= Строка.КодОтчета;
		МЗ.НомерСообщения			= Строка.ВходящийДокументНомер;
		МЗ.НомерСообщенияИсходный	= Строка.ИсходныйДокументНомер;
		МЗ.ТипУведомления			= Строка.ТипУведомления;
		МЗ.Исходящее				= Ложь;
		
		ОбновитьЭтап = Истина;
		Если Не ЭтоНовыйКД Тогда
			СрезЭтапов = РегистрыСведений.ЭтапыКД.СрезПоследних(ТекущаяДатаСеанса(), Новый Структура("КД", КД.Ссылка));
			Если СрезЭтапов.Количество() > 0 Тогда
				Если СрезЭтапов.Получить(0).ЭтапКД = Этап
					И СрезЭтапов.Получить(0).КодОтчета = Строка.КодОтчета
					И СрезЭтапов.Получить(0).НомерСообщения = Строка.ВходящийДокументНомер Тогда
					ОбновитьЭтап = Ложь;
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;
		
		// КД с видом "Выплата дивидендов в виде денежных средств" должно быть проведено
		Если СокрЛП(КД.ВидКД.Код) = "DVCA" Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		Иначе
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		
		// Запись документа КорпоративноеДействие_Новый
		Попытка
			КД.Записать(РежимЗаписи);
		Исключение
			ТекстСообщения = "Не удалось записать документ.";
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, ,КД.Ссылка, ТекстСообщения);
			Сообщение.Текст = ТекстСообщения + " " + КД.Ссылка;
			Сообщение.Сообщить();
			Продолжить;
		КонецПопытки;
		
		// Проверить КД на наличие текста Экономически связанная организация
		Если СтрНайти(Строка.ДополнительнаяИнформация, "Экономически значимая организация") > 0 Тогда
			ОтправитьУведомлениеОЗагруженномКДсЭЗО(КД.Дата, КД.КДРеференс);
		КонецЕсли;
		
		ОбновитьСвязанныйКДРеференс(КД);
		
		Если ОбновитьЭтап Тогда
			МЗ.КД = КД.Ссылка;
			Если Строка.КодОтчета = "CA061" И ЗначениеЗаполнено(Строка.СвязанныйДокументПоКарточкеКД) Тогда
				МЗ.ДокументКД = Строка.СвязанныйДокументПоКарточкеКД;
			Иначе
				МЗ.ДокументКД = КД.Ссылка;
			КонецЕсли;
			
			Если ЭтоПодтверждениеОсвобожденияОтНалогов(КД.Ссылка) Тогда
				Если ЭтоНовыйКД Тогда
					МЗ.БПОбработкиWTRCСообщения = НовыйБизнесПроцессОбработкиСообщенияWTRC(МЗ.Период, КД,
						ИмяСобытия);
				Иначе
					МЗ.БПОбработкиWTRCСообщения = БизнесПроцессОбработкиСообщенияWTRCИзЭтаповКД(ТекущаяДатаСеанса(),
						КД.Ссылка);
				КонецЕсли;
			КонецЕсли;
			
			МЗ.ВозможноФормированиеУведомленияКлиентам = Истина;
			// Для НЕ американских ЦБ, формирование всех уведомлений полностью в зоне ответственности БП.
			// Для американских ЦБ формирование уведомлений в зоне ответственности БП начиная с даты указанной в константе ДатаВводаСхемыУведомленийWTRC_QI
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КД.ВидКД, "Код") = "WTRC" Тогда
				Если Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(КД.ЦеннаяБумага1) И Не WTRCСообщенияQI.ИспользоватьСхемуУведомленийWTRC_QI(КД.Дата) Тогда 
					РегистрыСведений.ДокументыДляФормированияУведомлений.ДобавитьКорпоративноеДействие(КД.Ссылка, Ложь);	
				КонецЕсли;
			Иначе 
				РегистрыСведений.ДокументыДляФормированияУведомлений.ДобавитьКорпоративноеДействие(КД.Ссылка, Ложь);
			КонецЕсли;
			
			Попытка
				МЗ.Записать();
			Исключение
				ТекстСообщения = "Не удалось сохранить запись в регистре сведений 'ЭтапыКД'";
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , КД.Ссылка, ТекстСообщения);
				Сообщение.Текст = ТекстСообщения + " " + КД.Ссылка;
				Сообщение.Сообщить();
				Продолжить;
			КонецПопытки;
			
		КонецЕсли;
		
		Если Не ЭтоНовыйКД Тогда 
			ОбновитьДатыВСвязанныхДокументах(КД.Ссылка, Строка);
		КонецЕсли;
				
		ТекстСообщения = "Документ " + ?(ЭтоНовыйКД, "создан", "изменен");
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , КД.Ссылка, ТекстСообщения);
		Сообщение.Текст = ТекстСообщения + " " + КД.Ссылка;
		Сообщение.Сообщить();
		
		Строка.Обрабатывать	= Ложь;
		Строка.ДокументКД	= КД.Ссылка;
	КонецЦикла;
	ЗафиксироватьТранзакцию();
КонецПроцедуры

Процедура ОбновитьДатыВСвязанныхДокументах(КорпоративноеДействиеСсылка, СтрокаДанныхКорпоративныхДействий)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаскрытиеСпискаВладельцев.Ссылка КАК Ссылка,
	|	""РаскрытиеСпискаВладельцев"" КАК ИмяОбъекта,
	|	РаскрытиеСпискаВладельцев.ДатаФиксации КАК ДатаФиксации
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|ГДЕ
	|	РаскрытиеСпискаВладельцев.КарточкаКД = &КорпоративноеДействиеСсылка
	|	И НЕ РаскрытиеСпискаВладельцев.ПометкаУдаления
	|	И (РаскрытиеСпискаВладельцев.ДатаФиксации <> &ДатаФиксации
	|			ИЛИ РаскрытиеСпискаВладельцев.ДатаОкончанияПриема <> &ДатаОкончанияПриемаИнструкцийНРД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбработкаWTRCСообщения.Ссылка,
	|	""ОбработкаWTRCСообщения"",
	|	ОбработкаWTRCСообщения.ДатаФиксации
	|ИЗ
	|	БизнесПроцесс.ОбработкаWTRCСообщения КАК ОбработкаWTRCСообщения
	|ГДЕ
	|	ОбработкаWTRCСообщения.КД = &КорпоративноеДействиеСсылка
	|	И НЕ ОбработкаWTRCСообщения.ПометкаУдаления
	|	И НЕ ОбработкаWTRCСообщения.Завершен
	|	И (ОбработкаWTRCСообщения.ДатаФиксации <> &ДатаФиксации
	|			ИЛИ ОбработкаWTRCСообщения.ДатаОкончанияРаскрытия <> &ДатаОкончанияПриемаИнструкцийНРД)";
	
	Запрос.УстановитьПараметр("КорпоративноеДействиеСсылка", КорпоративноеДействиеСсылка);
	Запрос.УстановитьПараметр("ДатаФиксации", СтрокаДанныхКорпоративныхДействий.ДатаФиксации);
	Запрос.УстановитьПараметр("ДатаОкончанияПриемаИнструкцийНРД", СтрокаДанныхКорпоративныхДействий.ДатаОкончанияПриемаИнструкцийНРД);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДанныеЗаполнения = Новый Структура();
		Если ВыборкаДетальныеЗаписи.ИмяОбъекта = "ОбработкаWTRCСообщения" Тогда
			ДанныеЗаполнения.Вставить("ДатаФиксации", СтрокаДанныхКорпоративныхДействий.ДатаФиксации);
			ДанныеЗаполнения.Вставить("ДатаОкончанияРаскрытия", СтрокаДанныхКорпоративныхДействий.ДатаОкончанияПриемаИнструкцийНРД);
		ИначеЕсли ВыборкаДетальныеЗаписи.ИмяОбъекта = "РаскрытиеСпискаВладельцев"
			И (СтрокаДанныхКорпоративныхДействий.ВидКД = Справочники.ВидыКорпоративныхДействий.WTRC()
			Или Документы.КорпоративноеДействие_Новый.ЭтоВидКДВыкупа(СтрокаДанныхКорпоративныхДействий.ВидКД)
			Или Документы.КорпоративноеДействие_Новый.ЭтоВидКДСобрания(СтрокаДанныхКорпоративныхДействий.ВидКД)) Тогда
			ДанныеЗаполнения.Вставить("ДатаФиксации", СтрокаДанныхКорпоративныхДействий.ДатаФиксации);
			ДанныеЗаполнения.Вставить("ДатаОкончанияПриема",СтрокаДанныхКорпоративныхДействий.ДатаОкончанияПриемаИнструкцийНРД);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
			СвязанныйОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(СвязанныйОбъект, ДанныеЗаполнения);
			СвязанныйОбъект.Записать();
			
			Сообщение	= Новый СообщениеПользователю();
			ТекстСообщения = СтрШаблон("У связанного объекта %1 изменена дата фиксации и дата окончания приема инструкций НРД", СвязанныйОбъект.Ссылка);
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,, СвязанныйОбъект.Ссылка, ТекстСообщения);
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтоПодтверждениеОсвобожденияОтНалогов(КД)
	Возврат ЗначениеЗаполнено(КД)
			И ТипЗнч(КД) = Тип("ДокументСсылка.КорпоративноеДействие_Новый")
			И СокрЛП(КД.ВидКД.Код) = "WTRC";
КонецФункции

Функция НовыйБизнесПроцессОбработкиСообщенияWTRC(ДатаСообщения, КД, ИмяСобытия)
	Сообщение = Новый СообщениеПользователю();
	
	БП = БизнесПроцессы.ОбработкаWTRCСообщения.СоздатьБизнесПроцесс();
	БП.Дата				= ТекущаяДата();
	БП.КД				= КД.Ссылка;
	БП.КДРеференс		= КД.КДРеференс;
	БП.СчетДепоМХ		= КД.СчетДЕПО;
	БП.ЦеннаяБумага1	= КД.ЦеннаяБумага1;
	БП.ЦеннаяБумага2	= КД.ЦеннаяБумага2;
	БП.ДатаКДПлан		= КД.ДатаКДПлан;
	БП.ДатаФиксации		= КД.ДатаФиксации;
	БП.ДатаОкончанияРаскрытия = КД.ДатаОкончанияПриемаИнструкцийНРД;
	
	БП.ДатаОкончанияПриемаФормыW8		= Документы.КорпоративноеДействие_Новый.WTRC_ДатаОкончанияПриемаФормыW8(КД.Ссылка);
	БП.ДатаОкончанияПриемаПоручений1_5	= Документы.КорпоративноеДействие_Новый.WTRC_ДатаОкончанияПриемаПоручений1_5(КД.Ссылка);
	БП.ДатаОкончанияПриемаПоручений1_10	= Документы.КорпоративноеДействие_Новый.WTRC_ДатаОкончанияПриемаПоручений1_10(КД.Ссылка);
	
	БП.ИспользоватьСхемуУсловногоДлящегосяПоручения = Истина; // Все БП, созданные после обновления, работают по этой схеме
	БП.ДатаСообщения = ДатаСообщения;
	БП.ЗаполнитьТаблицуДепонентов();
	
	Попытка
		БП.Записать();
	Исключение
		ТекстСообщения = "Не удалось записать бизнес-процесс 'ОбработкаWTRCСообщения'";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, БП.Ссылка, ТекстСообщения);
		Сообщение.Текст = ТекстСообщения + " " + БП.Ссылка;
		Сообщение.Сообщить();
		Возврат БизнесПроцессы.ОбработкаWTRCСообщения.ПустаяСсылка();
	КонецПопытки;
	
	ТекстСообщения = "Создан новый бизнес-процесс";
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,, БП.Ссылка, ТекстСообщения);
	Сообщение.Текст = ТекстСообщения + " " + БП.Ссылка;
	Сообщение.Сообщить();
	
	Возврат БП.Ссылка;
КонецФункции

Функция БизнесПроцессОбработкиСообщенияWTRCИзЭтаповКД(ДатаСреза, КД)
	СрезЭтапов = РегистрыСведений.ЭтапыКД.СрезПоследних(ДатаСреза, Новый Структура("КД", КД));
	Если СрезЭтапов.Количество() > 0 Тогда
		Возврат СрезЭтапов.Получить(0).БПОбработкиWTRCСообщения;
	Иначе
		Возврат БизнесПроцессы.ОбработкаWTRCСообщения.ПустаяСсылка();
	КонецЕсли; 
КонецФункции

Процедура ЗаполнитьСвойстваКД(КД, Строка, Этап)
	ЗаполнятьСвойства		= Истина;
	СвойстваДляЗаполнения	= Неопределено;
	ИсключаяСвойства		= Неопределено;
	
	Если Строка.КодОтчета = "CA021" 			// Сообщение об отмене собрания
		Или Строка.КодОтчета = "ME021" Тогда 	// Сообщение об отмене собрания (SRDII)
		СвойстваДляЗаполнения = "ПричинаОтмены, КДРеференс, КДРеференсВходящий, АдресВСетиИнтернет";
		
	ИначеЕсли Строка.КодОтчета = "CA011"			// Сообщение о собрании по существенному факту
			Или Строка.КодОтчета = "CA012"			// Сообщение о собрании
			Или Строка.КодОтчета = "ME011"			// Сообщение о собрании (SRDII)
			Или Строка.КодОтчета = "CA014" Тогда	// Информация из бюллетеня
		ИсключаяСвойства = "ПричинаОтмены";
		
		ЗаполнитьСвойстваТабЧастиВопросыКГолосованию(КД, Строка.ВходящийДокументНомер,
			"ДляИнформации,КуммулятивныйВопрос,ТекстВопроса,Коэффициент,ВариантыГолосования,НомерВопроса");
		
	ИначеЕсли Строка.КодОтчета = "CA081"			// Сообщение об итогах собрания по существенному факт
			Или Строка.КодОтчета = "CA082" Тогда	// Сообщение об итогах собрания
		СвойстваДляЗаполнения = "КДРеференс, КДРеференсВходящий, АдресВСетиИнтернет";
		
		ЗаполнитьСвойстваТабЧастиВопросыКГолосованию(КД, Строка.ВходящийДокументНомер,
			"За,Против,Воздержался,Принято,НомерВопроса,
			|ДляИнформации,КуммулятивныйВопрос,ТекстВопроса,Коэффициент,ВариантыГолосования");
		
	ИначеЕсли Строка.КодОтчета = "CA061" Тогда	// Статус обработки инструкции (MeetingInstructionStatus). Ничего не заполнять. Только факт в РС.
		ЗаполнятьСвойства = Ложь;
		
	ИначеЕсли Строка.КодОтчета = "CA391" Тогда	// Сообщение об отмене корпоративного действия. Ничего не заполнять. Только факт в РС.
		ЗаполнитьЗначенияСвойств(КД, Строка, "АдресВСетиИнтернетОтмена");
		ЗаполнятьСвойства = Ложь;
	КонецЕсли;
	
	Если ЗаполнятьСвойства Тогда
		Если ЗначениеЗаполнено(ИсключаяСвойства) Тогда
			ИсключаяСвойства = "ДополнительнаяИнформация, " + ИсключаяСвойства;
		Иначе
			ИсключаяСвойства = "ДополнительнаяИнформация";
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(КД, Строка, СвойстваДляЗаполнения, ИсключаяСвойства);
		
		КД.Этап = Этап;
		
		// Заполнение таб.части ЦенныеБумаги данного документа КД
		КД.ЦенныеБумаги.Очистить();
		Отбор = Новый Структура("КлючДанныеКорпоративныхДействий", Строка.КлючЦенныеБумаги);
		Строки = ЦенныеБумаги.НайтиСтроки(Отбор);
		Для Каждого СтрокаЦБ Из Строки Цикл
			НоваяСтрокаЦБ = КД.ЦенныеБумаги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаЦБ, СтрокаЦБ);
		КонецЦикла;
		
		ОтборПоНомеру = Новый Структура("ВходящийДокументНомер", Строка.ВходящийДокументНомер);
		ВариантыУчастияФайла = ВариантыУчастия.НайтиСтроки(ОтборПоНомеру);
		КД.ВариантыУчастия.Очистить();
		Для Каждого Вариант Из ВариантыУчастияФайла Цикл
			СтрокаВариант = КД.ВариантыУчастия.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВариант, Вариант);
		КонецЦикла;
		
		КД.ДополнительнаяИнформация = Строка.ДополнительнаяИнформация;
		
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьСвойстваТабЧастиВопросыКГолосованию(КД, ВходящийДокументНомер, СвойстваДляЗаполненияТЧ)
	ВопросыПоНомеруСообщения = ВопросыКГолосованию.НайтиСтроки(Новый Структура("ВходящийДокументНомер", ВходящийДокументНомер));
	КД.ВопросыКГолосованию.Очистить();
	Для Каждого Вопрос Из ВопросыПоНомеруСообщения Цикл
		СтрокаВопрос = КД.ВопросыКГолосованию.Найти(Вопрос.НомерВопроса, "НомерВопроса");
		Если СтрокаВопрос = Неопределено Тогда
			СтрокаВопрос = КД.ВопросыКГолосованию.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаВопрос, Вопрос, СвойстваДляЗаполненияТЧ);
	КонецЦикла;
КонецПроцедуры

Функция НовыйКлючСвязиДанныхКДиЦБ()
	мКлючСвязиДанныхКДиЦБ = мКлючСвязиДанныхКДиЦБ + 1;
	Возврат мКлючСвязиДанныхКДиЦБ;
КонецФункции

// Пакетно загружает документы КД из файлов
//
Процедура ЗагрузитьДокументыКДИзФайлов() Экспорт
	УстановитьПутьККаталогу();
	Если Не ЗначениеЗаполнено(ПутьККаталогу) Тогда
		Возврат;
	КонецЕсли;
	
	ФайлыFCDR_2017_02 = Неопределено;
	ПрочитатьФайлы(ФайлыFCDR_2017_02);
	
	ТребуетсяЗагрузкаFCDR = (ВышестоящийДепозитарий = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияПоУмолчанию"));
	ФайлыFCDRЗагружены = Ложь;
	ВходящиеНомераДокументов = Новый Массив;
	
	Если ТребуетсяЗагрузкаFCDR Тогда
		РезультатFCDR = Обработки.РаскрытиеСписковВладельцевFCDR_2017_02.ЗагрузитьВходящиеДокументы(ФайлыFCDR_2017_02);
		ФайлыFCDRЗагружены = РезультатFCDR.Успех;
		ВходящиеНомераДокументов = РезультатFCDR.ВходящиеНомераДокументов;
	КонецЕсли;
	
	СформироватьДокументы();
	Если Не ТребуетсяЗагрузкаFCDR Или ФайлыFCDRЗагружены Тогда
		ПеренестиВАрхив(ВходящиеНомераДокументов);
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьДокументыФайловогоШлюзаПоСтатусуРСВ(РаскрытиеСпискаВладельцевОбъект, СтрокаДанных)
	
	Если ТипЗнч(РаскрытиеСпискаВладельцевОбъект) <> Тип("ДокументОбъект.РаскрытиеСпискаВладельцев")
		Или СтрокаДанных.КодОтчета <> "CA061" Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТехническаяОперация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ТехническаяОперация КАК ТехническаяОперация
	|ГДЕ
	|	ТехническаяОперация.ДокументОснование = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТехническаяОперация.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ДокументОснование", РаскрытиеСпискаВладельцевОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда	// По входящему пакету из файлового шлюза сопоставлен документ ""Техническая операция"
		ТехническаяОперация = Выборка.Ссылка;
		ВходящийПакет = Документы.ВходящийПакетИзФайловогоШлюза.СоздатьДокумент();
		ВходящийПакет.ДокументОснование = ТехническаяОперация;
		ВходящийПакет.Дата = ТекущаяДатаСеанса();
		Если ЗначениеЗаполнено(СтрокаДанных.ДополнительнаяИнформация) Тогда
			Чтение = Новый ЧтениеJSON;
			Чтение.УстановитьСтроку(СтрокаДанных.ДополнительнаяИнформация);
			СодержимоеФайла = ПрочитатьJSON(Чтение);
			Чтение.Закрыть();
			Если ТипЗнч(СодержимоеФайла) = Тип("Структура") Тогда
				Для Каждого Элемент Из СодержимоеФайла Цикл
					ПолныйПутьТега = СтрЗаменить(Элемент.Ключ, "_", ".");
					НоваяСтрока = ВходящийПакет.СодержимоеФайла.Добавить();
					НоваяСтрока.Элемент = ПолныйПутьТега;
					НоваяСтрока.Значение = Элемент.Значение;
				КонецЦикла;
				ВходящийПакет.СодержимоеФайла.Сортировать("Элемент");
			КонецЕсли;
		КонецЕсли;
		ВходящийПакет.Записать();
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

Процедура ОтправитьУведомлениеОНеопределенномСвязанномКДДляWTRC(ВидКД, Знач КДРеференс, Знач Эмитент, Знач ISIN)
	ПВХ = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОНеопределенномСвязанномКДДляWTRC;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПВХ).Настройка;
	Если НастройкиОбмена = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось получить параметры внешнего источника """ + ПВХ + """");
		Возврат;
	КонецЕсли;
	
	НайденнаяСтрока = НастройкиОбмена.Параметры.Найти("Тема письма", "Наименование");
	Если НайденнаяСтрока = Неопределено Тогда
		ТемаПисьма = "<Без темы>";
	Иначе
		ТемаПисьма = НайденнаяСтрока.Значение;
	КонецЕсли;
	
	КДРеференс	= ?(ЗначениеЗаполнено(КДРеференс), СокрЛП(КДРеференс), "нет данных");
	Эмитент		= ?(ЗначениеЗаполнено(Эмитент), СокрЛП(Эмитент), "нет данных");
	ISIN		= ?(ЗначениеЗаполнено(ISIN), СокрЛП(ISIN), "нет данных");
	ТекстУведомления = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"Для КД '%1' КД Референс '%2' (ЦБ '%3' ISIN '%4') не удалось автоматически определить связанное КД. "
		+ "Необходимо ввести данные вручную.", СокрЛП(ВидКД.Наименование), КДРеференс, Эмитент, ISIN);

	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстУведомления);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
КонецПроцедуры

Функция СтруктураДокументаXML(ЧтениеXML, Знач ИмяУзла = "")
	СтрУровень = Новый Структура;
	
	Пока ЧтениеXML.Прочитать() И Не ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			СтрУровень = ЧтениеXML.Значение;
			Если ИмяУзла = "AddtlInf" Тогда
				СтрУровень = СтрУровень + Символы.ПС;
			КонецЕсли;
			
		ИначеЕсли Не ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			// Добавить атрибуты тега
			Если ЧтениеXML.КоличествоАтрибутов() > 0 Тогда
				Владелец = ЧтениеXML.Имя;
				Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
					ИмяАтрибута = Владелец + "_Attribute_" + ЧтениеXML.Имя; // Формат обращения к атрибуту тега
					СтрУровень.Вставить(ИмяАтрибута, ЧтениеXML.Значение);
				КонецЦикла;
			КонецЕсли;
			
			ВложУровень = СтруктураДокументаXML(ЧтениеXML, ЧтениеXML.Имя);
			
			Если Не СтрУровень.Свойство(ЧтениеXML.Имя) Тогда
				Если ЧтениеXML.Имя = "Scty"
					Или ЧтениеXML.Имя = "Rsltn" 
					Или ЧтениеXML.Имя = "Xtnsn" 
					Или ЧтениеXML.Имя = "Pos"
					Или ЧтениеXML.Имя = "HldgBal"
					Или ЧтениеXML.Имя = "VoteInstrTp"
					Или ЧтениеXML.Имя = "VoteRslt"
					Или ЧтениеXML.Имя = "VtAddRqrmnts"
					Тогда
					СвойствоМассив = Новый Массив;
					СвойствоМассив.Добавить(ВложУровень);
					СтрУровень.Вставить(ЧтениеXML.Имя,СвойствоМассив);
				Иначе
					СтрУровень.Вставить(ЧтениеXML.Имя,ВложУровень);
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(СтрУровень[ЧтениеXML.Имя]) = Тип("Структура") Тогда
				// Заменить структуру на массив и из структуры перекинуть в массив
				СвойствоМассив = Новый Массив;
				СвойствоМассив.Добавить(СтрУровень[ЧтениеXML.Имя]);
				СвойствоМассив.Добавить(ВложУровень);
				СтрУровень.Вставить(ЧтениеXML.Имя, СвойствоМассив);
				
			ИначеЕсли ТипЗнч(СтрУровень[ЧтениеXML.Имя]) = Тип("Массив") Тогда 
				СтрУровень[ЧтениеXML.Имя].Добавить(ВложУровень);
				
			ИначеЕсли ТипЗнч(СтрУровень[ЧтениеXML.Имя]) = Тип("Строка") Тогда
				СтрУровень[ЧтениеXML.Имя] = СтрУровень[ЧтениеXML.Имя] + ВложУровень;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрУровень;
КонецФункции

Функция СоздатьТаблицуДляЦБ()
	ТаблицаПоЦБ	= Новый ТаблицаЗначений;
	ТаблицаПоЦБ.Колонки.Добавить("FaceAmnt");
	ТаблицаПоЦБ.Колонки.Добавить("Unit");
	ТаблицаПоЦБ.Колонки.Добавить("BalTp");
	ТаблицаПоЦБ.Колонки.Добавить("Dt");
	ТаблицаПоЦБ.Колонки.Добавить("SfkpgPlc");
	Возврат ТаблицаПоЦБ;
КонецФункции

// Возвращает значение свойства ИмяСвойства из исходной структуры.
// Если имя свойства содержит точки, то возвращается значение самого глубокого вложенного свойства.
Функция ЗначениеСвойстваИзСтруктуры(ИсходнаяСтруктура, ИмяСвойства)
	Если ТипЗнч(ИсходнаяСтруктура) = Тип("Структура") Тогда
		ПоложениеТочки = Найти(ИмяСвойства, ".");
		Если ПоложениеТочки > 0 Тогда
			ИмяВложеннойСтруктуры = Лев(ИмяСвойства, ПоложениеТочки-1);
			ВложеннаяСтруктура = ?(ИсходнаяСтруктура.Свойство(ИмяВложеннойСтруктуры),
				ИсходнаяСтруктура[ИмяВложеннойСтруктуры], Неопределено);
			ИмяВложенногоСвойства = Прав(ИмяСвойства, СтрДлина(ИмяСвойства)- ПоложениеТочки);
			Возврат ЗначениеСвойства(ВложеннаяСтруктура, ИмяВложенногоСвойства);
		Иначе
			Возврат ?(ИсходнаяСтруктура.Свойство(ИмяСвойства), ИсходнаяСтруктура[ИмяСвойства], Неопределено);
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Возвращает первое непустое значение из перечисленных свойств
Функция ЗначениеСвойства(ИсходнаяСтруктура, ИмяСвойства1, ИмяСвойства2 = "", ИмяСвойства3 = "", ИмяСвойства4 = "")
	ЗначениеСвойства = ЗначениеСвойстваИзСтруктуры(ИсходнаяСтруктура, ИмяСвойства1);
	
	Если ЗначениеСвойства = Неопределено И ЗначениеЗаполнено(ИмяСвойства2) Тогда
		ЗначениеСвойства = ЗначениеСвойстваИзСтруктуры(ИсходнаяСтруктура, ИмяСвойства2);
	КонецЕсли;
	
	Если ЗначениеСвойства = Неопределено И ЗначениеЗаполнено(ИмяСвойства3) Тогда
		ЗначениеСвойства = ЗначениеСвойстваИзСтруктуры(ИсходнаяСтруктура, ИмяСвойства3);
	КонецЕсли;
	
	Если ЗначениеСвойства = Неопределено И ЗначениеЗаполнено(ИмяСвойства4) Тогда
		ЗначениеСвойства = ЗначениеСвойстваИзСтруктуры(ИсходнаяСтруктура, ИмяСвойства4);
	КонецЕсли;
	
	Возврат ЗначениеСвойства;
КонецФункции

// Возвращает значение свойства ИмяСвойства из исходной структуры или первое значение из массива ИсходныеДанные.
// Если имя свойства содержит точки, то возвращается значение самого глубокого вложенного свойства.
Функция ЗначениеСвойстваИзСтруктурыМассива(ИсходныеДанные, ИмяСвойства, ИндексЗаполненногоЭлемента = 0)
	ПоложениеТочки = Найти(ИмяСвойства, ".");
	Если ПоложениеТочки > 0 Тогда
		ИмяВложенныхДанных = Лев(ИмяСвойства, ПоложениеТочки - 1);
		ИмяВложенногоСвойства = Прав(ИмяСвойства, СтрДлина(ИмяСвойства) - ПоложениеТочки);
	КонецЕсли;
	
	Если ТипЗнч(ИсходныеДанные) = Тип("Массив") Тогда
		ТекущииЗаполненныйЭлемент = 0;
		Для Каждого ЭлементИсходныхДанных Из ИсходныеДанные Цикл
			Если ПоложениеТочки > 0 Тогда
				ВложенныеДанные = ?(ЭлементИсходныхДанных.Свойство(ИмяВложенныхДанных),
					ЭлементИсходныхДанных[ИмяВложенныхДанных], Неопределено);
				ЗначениеСвойства = ЗначениеСвойстваИзСтруктурыМассива(ВложенныеДанные, ИмяВложенногоСвойства,
					ИндексЗаполненногоЭлемента);
			Иначе
				ЗначениеСвойства = ?(ЭлементИсходныхДанных.Свойство(ИмяСвойства),
					ЭлементИсходныхДанных[ИмяСвойства], Неопределено);
			КонецЕсли;
			Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
				Если ТекущииЗаполненныйЭлемент = ИндексЗаполненногоЭлемента Тогда
					Возврат ЗначениеСвойства;
				Иначе
					ТекущииЗаполненныйЭлемент = ТекущииЗаполненныйЭлемент + 1;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ИсходныеДанные) = Тип("Структура") Тогда
		Если ПоложениеТочки > 0 Тогда
			ВложенныеДанные = ?(ИсходныеДанные.Свойство(ИмяВложенныхДанных), ИсходныеДанные[ИмяВложенныхДанных], Неопределено);
			Возврат ЗначениеСвойстваИзСтруктурыМассива(ВложенныеДанные, ИмяВложенногоСвойства,
				ИндексЗаполненногоЭлемента);
		Иначе
			Возврат ?(ИсходныеДанные.Свойство(ИмяСвойства), ИсходныеДанные[ИмяСвойства], Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция ИзДвоичнойВДесятичную(Двоичное)
	//"000"
	МассивБитов = Новый Массив;
	
	Для НомерБита = 0 По СтрДлина(Двоичное)-1 Цикл
		СтрБита = Новый Структура("Значение, Разряд");
		Бит = Сред(Двоичное,СтрДлина(Двоичное) - НомерБита,1);
		СтрБита.Значение	= Бит;
		СтрБита.Разряд		= СтрДлина(Двоичное)-1 - НомерБита;
		МассивБитов.Добавить(СтрБита);
	КонецЦикла;
	
	Итог = 0;
	Для Каждого Бит ИЗ МассивБитов  Цикл
		Итог = Итог + Бит.Значение * Pow(2, Бит.Разряд);
	КонецЦикла;
	Возврат Итог;
КонецФункции

Функция АдресВСетиИнтернет(Документ, ИмяСвойства, Конверт = "XtnsnEnvlp")
	СтрАдрес = "";
	СвойстваСАдресом = ЗначениеСвойства(Документ, ИмяСвойства);
	Если СвойстваСАдресом <> Неопределено Тогда
		Если ТипЗнч(СвойстваСАдресом) = Тип("Массив") Тогда
			Для Каждого Стр Из СвойстваСАдресом Цикл
				СтрАдрес = АдресВСетиИнтернетИзСвойства(Стр, Конверт);
				Если ЗначениеЗаполнено(СтрАдрес) Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(СвойстваСАдресом) = Тип("Структура") Тогда
			СтрАдрес = АдресВСетиИнтернетИзСвойства(СвойстваСАдресом, Конверт);
		КонецЕсли;
	КонецЕсли;
	Возврат СтрАдрес;
КонецФункции

Функция АдресВСетиИнтернетИзСвойства(Свойство, Конверт)
	СтрАдрес = "";
	СтрПризнак = ЗначениеСвойства(Свойство, Конверт + ".XtnsnDt.AddtlInf.AddtlTxt.UpdDesc");
	Если ВРЕГ(СтрПризнак) = ВРЕГ("FtpFile") Тогда
		СтрАдрес = ЗначениеСвойства(Свойство, Конверт + ".XtnsnDt.AddtlInf.AddtlTxt.AddtlInf");
		ПозицияРешеток = Найти(СтрАдрес, "##");
		Если ПозицияРешеток > 0 Тогда
			СтрАдрес = Прав(СтрАдрес, СтрДлина(СтрАдрес)-ПозицияРешеток-1); 
		КонецЕсли;
	КонецЕсли;
	Возврат СтрАдрес;
КонецФункции

Процедура СкопироватьВремя(Приемник, Источник)
	Приемник = Дата(Год(Приемник), Месяц(Приемник), День(Приемник), Час(Источник), Минута(Источник), Секунда(Источник));
КонецПроцедуры

Функция ЦеннаяБумагаПоКодуЗагрузкиНДЦ(КодЗагрузкиНДЦ, ДатаОтбора)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НДЦ", Константы.КлассификаторЗагрузкиНДЦ.Получить());
	Запрос.УстановитьПараметр("Код", Сокрлп(КодЗагрузкиНДЦ));
	Запрос.УстановитьПараметр("ДатаОтбора", ДатаОтбора);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫРАЗИТЬ(КодыЗагрузки.Владелец КАК Справочник.ЦенныеБумаги).Ссылка КАК ЦеннаяБумага
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	ВЫРАЗИТЬ(КодыЗагрузки.Биржа КАК Справочник.КлассификаторыЗагрузки).Ссылка = &НДЦ
	|	И КодыЗагрузки.Код = &Код
	|	И КодыЗагрузки.Владелец ССЫЛКА Справочник.ЦенныеБумаги
	|	И НЕ КодыЗагрузки.ПометкаУдаления	
	|	И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1,1,1)
	|		ИЛИ КодыЗагрузки.ДатаОкончанияДействия >= КОНЕЦПЕРИОДА(&ДатаОтбора, ДЕНЬ))";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЦеннаяБумага;
	Иначе
		Возврат Справочники.ЦенныеБумаги.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция ВалютаПоНаименованию(НаименованиеВалюты)
	Если ВРЕГ(НаименованиеВалюты) = "RUB" Тогда
		НаименованиеДляПоиска = "SUR";
	Иначе
		НаименованиеДляПоиска = ВРЕГ(НаименованиеВалюты);
	КонецЕсли;
	Возврат Справочники.Валюты.НайтиПоНаименованию(НаименованиеДляПоиска, Истина);
КонецФункции

// Ищет связанный документ "Корпоративное действие новый" по счету Депо
// и переданному референсу в КДРеференс и КДРеференсВходящий
//
// Параметры:
//  КДРеференсСвязанный	 - Строка - референс, по которому осуществляется поиск связанного КД
//  СчетДЕПО			 - СправочникСсылка.СчетаДепоМХ - Счет ДЕПО
// 
// Возвращаемое значение:
//  ДокументСсылка.КорпоративноеДействие_Новый - ссылка на найденный документ
//
Функция СвязанноеКД(КДРеференсСвязанный, СчетДЕПО) Экспорт
	КД = Документы.КорпоративноеДействие_Новый.НайтиПоРеференсуИСчетуДепо(КДРеференсСвязанный, СчетДЕПО);
	
	Если Не ЗначениеЗаполнено(КД) И ЗначениеЗаполнено(КДРеференсСвязанный) И ЗначениеЗаполнено(СчетДЕПО) Тогда
		КД = Документы.КорпоративноеДействие_Новый.КДПоВходящемуРеференсуИСчетуДепо(КДРеференсСвязанный, СчетДЕПО);
	КонецЕсли;
	
	Возврат КД;
КонецФункции

Функция СвязанноеКДПоПервымСимволамРеференсаИСчетуДепо(Референс, СчетДЕПО, ВидКДКод)
	
	Если Не ЗначениеЗаполнено(Референс) Тогда
		Возврат Документы.КорпоративноеДействие_Новый.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорпоративноеДействие_Новый.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый КАК КорпоративноеДействие_Новый
	|ГДЕ
	|	НЕ КорпоративноеДействие_Новый.ПометкаУдаления
	|	И КорпоративноеДействие_Новый.СчетДЕПО = &СчетДЕПО
	|	И ПОДСТРОКА(КорпоративноеДействие_Новый.КДРеференс, 1, 6) = ПОДСТРОКА(&СтрокаПоиска, 1, 6)
	|	И КорпоративноеДействие_Новый.ВидКД.Код <> &ВидКДКод";
	
	Запрос.УстановитьПараметр("ВидКДКод", ВидКДКод);
	Запрос.УстановитьПараметр("СтрокаПоиска", Лев(Референс, 6));
	Запрос.УстановитьПараметр("СчетДЕПО", СчетДЕПО);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Документы.КорпоративноеДействие_Новый.ПустаяСсылка();
	КонецЕсли;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	Иначе
		Возврат Документы.КорпоративноеДействие_Новый.ПустаяСсылка();
	КонецЕсли;
		
КонецФункции

Функция НужноИскатьСвязанноеКД(ВидКДКод)
	Возврат СтрНайти("WTRC,INTR,DVCA,CAPG,MCAL", ВРег(ВидКДКод)) > 0;
КонецФункции

Процедура ОбновитьСвязанныйКДРеференс(КорпоративноеДействиеОбъект)
	
	Если Не ЗначениеЗаполнено(КорпоративноеДействиеОбъект.КДРеференсСвязанныйСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	КорпоративноеДействиеСвязанныйСсылка = КорпоративноеДействиеОбъект.КДРеференсСвязанныйСсылка;
	КорпоративноеДействиеСвязанныйОбъект = КорпоративноеДействиеСвязанныйСсылка.ПолучитьОбъект();
	КорпоративноеДействиеСвязанныйОбъект.КДРеференсСвязанный = КорпоративноеДействиеОбъект.КДРеференс;
	КорпоративноеДействиеСвязанныйОбъект.КДРеференсСвязанныйСсылка = КорпоративноеДействиеОбъект.Ссылка;
	
	Попытка
		КорпоративноеДействиеСвязанныйОбъект.ОбменДанными.Загрузка = Истина;
		КорпоративноеДействиеСвязанныйОбъект.Записать();
	Исключение
		ТекстСообщения = "Не удалось изменить референс связанного корпоративного действия в " + КорпоративноеДействиеСвязанныйСсылка;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Предупреждение,, КорпоративноеДействиеСвязанныйСсылка, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьСчетДепоИРеференс(СтрокаТаблицы, НомерСчетаДепо)
	
	СтрокаТаблицы.КДРеференс = СокрЛП(СтрокаТаблицы.КДРеференсВходящий);
	
	Если НомерСчетаДепо <> Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетаДепоМХ.Ссылка КАК СчетДепоМХ,
		|	СчетаДепоМХ.КраткийКод КАК КраткийКод
		|ИЗ
		|	Справочник.СчетаДепоМХ КАК СчетаДепоМХ
		|ГДЕ
		|	СчетаДепоМХ.Код = &НомерСчетаДепо";
		
		Запрос.УстановитьПараметр("НомерСчетаДепо", СокрЛП(НомерСчетаДепо));
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			СтрокаТаблицы.СчетДЕПО = Выборка.СчетДепоМХ;
			СтрокаТаблицы.КДРеференс = СтрокаТаблицы.КДРеференс + СокрЛП(Выборка.КраткийКод);
		КонецЕсли;
		
	Иначе
		
		КраткийКодСчетаДепо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДЕПО_ПоУмолчанию, "КраткийКод");
		СтрокаТаблицы.СчетДЕПО = СчетДЕПО_ПоУмолчанию;
		СтрокаТаблицы.КДРеференс = СтрокаТаблицы.КДРеференс + СокрЛП(КраткийКодСчетаДепо);
		
	КонецЕсли;
	
КонецПроцедуры

// Определяет код отчета из наименования файла по фрагменту между вторым и третьим нижним подчеркиванием
//
// Параметры:
//  Имяфайла - Строка - имя файла, например, 007600000N_64571659_MN_MEET_ref_689032.xml
// 
// Возвращаемое значение:
//  Строка - код отчета
//
Функция КодОтчетаПоНаименованиюФайла(Имяфайла)
	
	ПоляИмениФайла = СтрРазделить(ИмяФайла, "_", Истина);
	Если ПоляИмениФайла.Количество() < 3 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МаркерКодаОтчета = ПоляИмениФайла[2];
	
	Если МаркерКодаОтчета = "MN" Тогда
		Возврат "CA012";
	ИначеЕсли МаркерКодаОтчета = "MC" Тогда
		Возврат "CA021";
	ИначеЕсли МаркерКодаОтчета = "MRD" Тогда
		Возврат "CA081";
	ИначеЕсли МаркерКодаОтчета = "CANO" Тогда
		Возврат "CA311";
	ИначеЕсли МаркерКодаОтчета = "CACN" Тогда
		Возврат "CA391";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Устанавливает пусть к файловому шлюзу в зависимости от выбранного депозитария
//
Процедура УстановитьПутьККаталогу() Экспорт
	МестоХраненияНРД = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияПоУмолчанию");
	МестоХраненияБЭБ = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияБЭБ");
	МестоХраненияРДЦ = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияРДЦ");
	Если ВышестоящийДепозитарий = МестоХраненияНРД Тогда
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ШлюзНРД;
	ИначеЕсли ВышестоящийДепозитарий = МестоХраненияБЭБ Тогда
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзБЭБКаталогВходящих;
	ИначеЕсли ВышестоящийДепозитарий = МестоХраненияРДЦ Тогда
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзРДЦКаталогВходящих;
	Иначе
		ТекстСообщения = СтрШаблон("Для вышестоящего депозитария '%1' загрузка не предусмотрена!", ВышестоящийДепозитарий);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ЗаписьЖурналаРегистрации("Загрузка корпоративных действий", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыВИ = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник);
	Если Не ЗначениеЗаполнено(ПараметрыВИ.Папка) Тогда
		ТекстСообщения = СтрШаблон("Не указан каталог во внешнем источнике '%1'!", ВнешнийИсточник);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ЗаписьЖурналаРегистрации("Загрузка корпоративных действий", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		Возврат;
	КонецЕсли;
	ПутьККаталогу = ПараметрыВИ.Папка;
КонецПроцедуры

Процедура ДополнитьВариантыУчастияВКД(ВариантыГолосования, ПараметрыКД)
	Если ПараметрыКД.Свойство("ВариантыУчастия") Тогда
		ВариантыУчастияПоДокументу = ПараметрыКД.ВариантыУчастия;
	Иначе
		ВариантыУчастияПоДокументу = Новый Массив;
	КонецЕсли;
	
	Если ТипЗнч(ВариантыГолосования) = Тип("Структура") Тогда
		ВариантыДляГолосования = Новый Массив;
		ВариантыДляГолосования.Добавить(ВариантыГолосования);
		ВариантыГолосования = ВариантыДляГолосования;
	КонецЕсли;
	
	Для Каждого Вариант Из ВариантыГолосования Цикл
		СпособыПодачиТребования = ЗначениеСвойства(Вариант, "OptnFeatrs");
		Если ТипЗнч(СпособыПодачиТребования) <> Тип("Массив") Тогда
			СпособыПодачиТребований = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СпособыПодачиТребования);
		Иначе
			СпособыПодачиТребований = СпособыПодачиТребования;
		КонецЕсли;
		Для каждого СпособПодачи Из СпособыПодачиТребований Цикл
			ДанныеВарианта = Новый Структура(
			"НомерВариантаУчастияКД, КодВариантаУчастияКД, КраткоеОписаниеВариантаУчастияКД, ИнструкцияДляУчастия,
			|КодСпособаПодачиТребования, КраткоеОписаниеСпособаПодачиТребования, ВходящийДокументНомер");
			ДанныеВарианта.НомерВариантаУчастияКД = ЗначениеСвойства(Вариант, "OptnNb");
			ДанныеВарианта.КодВариантаУчастияКД = ЗначениеСвойства(Вариант, "OptnTp.Cd");
			КраткоеОписаниеВариантаУчастияКД = Справочники.ВариантыУчастияВКД.НайтиПоКоду(ДанныеВарианта.КодВариантаУчастияКД).КраткоеОписание;
			ДанныеВарианта.КраткоеОписаниеВариантаУчастияКД = КраткоеОписаниеВариантаУчастияКД;
			ИнструкцияДляУчастия = ЗначениеСвойства(Вариант, "DfltPrcgOrStgInstr.DfltOptnInd");
			// Это не ошибка, по задаче false = Требуется
			ДанныеВарианта.ИнструкцияДляУчастия = ?(ИнструкцияДляУчастия = "false", "Требуется", "Не требуется");
			Если СпособПодачи <> Неопределено И СпособПодачи.Свойство("Prtry") Тогда
				ДанныеВарианта.КодСпособаПодачиТребования = СпособПодачи.Prtry.Id;
				КраткоеОписаниеСпособаПодачиТребования = 
					Справочники.СпособыПодачиТребований.НайтиПоКоду(ДанныеВарианта.КодСпособаПодачиТребования).КраткоеОписание;
				ДанныеВарианта.КраткоеОписаниеСпособаПодачиТребования = КраткоеОписаниеСпособаПодачиТребования;
			КонецЕсли;
			ДанныеВарианта.ВходящийДокументНомер = ПараметрыКД.ВходящийДокументНомер;
			ВариантыУчастияПоДокументу.Добавить(ДанныеВарианта);
		КонецЦикла;
	КонецЦикла;
	ПараметрыКД.Вставить("ВариантыУчастия",ВариантыУчастияПоДокументу);
КонецПроцедуры

// Обработчики дополнительной информации КД

Процедура ОбработатьСодержимоеСообщения(Сообщение, ДополнительнаяИнформация)
	
	Если Не ЗначениеЗаполнено(Сообщение) Тогда
		Возврат;
	КонецЕсли;
	
	UpdDesc = ЗначениеСвойства(Сообщение, "UpdDesc");
	Обрабатывать = Истина;
	Если UpdDesc <> Неопределено И UpdDesc <> "FtpFile" Тогда
		РасшифровкаUpdDesc = СоответствиеРасшифровкиUpdDesc();
		ЗначениеUpdDesc = ?(РасшифровкаUpdDesc[UpdDesc] = Неопределено, UpdDesc, РасшифровкаUpdDesc[UpdDesc]);
		
		Если UpdDesc <> "" Тогда
			ДополнительнаяИнформация = ДополнительнаяИнформация + Символы.ПС + ЗначениеUpdDesc + ":" + Символы.ПС;
		КонецЕсли;
	ИначеЕсли UpdDesc = Неопределено Тогда
		Обрабатывать = Истина;
	Иначе
		Обрабатывать = Ложь;
	КонецЕсли;
	
	Если Обрабатывать Тогда
		AddtlInf = ЗначениеСвойства(Сообщение, "AddtlInf");
		Если ЗначениеЗаполнено(AddtlInf) Тогда
			Если ТипЗнч(AddtlInf) = Тип("Массив") И AddtlInf.Количество() > 0 Тогда
				Для Каждого ПунктAddtlInf Из AddtlInf Цикл
					ДополнительнаяИнформация = ДополнительнаяИнформация + Символы.ПС + ПунктAddtlInf + Символы.ПС;
				КонецЦикла;
			Иначе
				ДополнительнаяИнформация = ДополнительнаяИнформация + Символы.ПС + AddtlInf + Символы.ПС;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция СоответствиеРасшифровкиUpdDesc()
	РасшифровкаUpdDesc = Новый Соответствие;
	РасшифровкаUpdDesc.Вставить("agenda", "Повестка дня");
	РасшифровкаUpdDesc.Вставить("RSLTN", "Структура Повестка дня + проекты решений");
	РасшифровкаUpdDesc.Вставить("AddInform", "Дополнительная информация");
	РасшифровкаUpdDesc.Вставить("RecordDateInform", "Предупреждение, что остатки будут взяты на утро следующего дня после ДФ");
	РасшифровкаUpdDesc.Вставить("CHAN_Comment", "Описание параметров для российских CHAN ");
	РасшифровкаUpdDesc.Вставить("resolution", "Решения собрания");
	РасшифровкаUpdDesc.Вставить("IssONGO", "Пояснения о причине приостановке размещения");
	РасшифровкаUpdDesc.Вставить("ETYP", "Сведения по налоговым льготам");
	РасшифровкаUpdDesc.Вставить("PRPR", "Описание порядка определения цены/ price procedure");
	РасшифровкаUpdDesc.Вставить("comment", "Уточнение результатов голосования с учетом дробного количества");
	РасшифровкаUpdDesc.Вставить("LwsInPlcInf", "Описание основания повлекшее возникновение/прекращение КД");
	РасшифровкаUpdDesc.Вставить("Name", "Наименование (ФИО) выкупающего лица");
	РасшифровкаUpdDesc.Вставить("Date", "Дата подачи обязательного/добровольного предложения выкупающим лицом в общество");
	
	Возврат РасшифровкаUpdDesc;

КонецФункции

Процедура ОбработатьПунктДополнительнаяИнформация(ПунктДопИнфо, ДополнительнаяИнформация)
	
	Если ЗначениеЗаполнено(ЗначениеСвойства(ПунктДопИнфо, "XtnsnEnvlp")) Тогда
		ТребуемыйТег = ЗначениеСвойства(ПунктДопИнфо, "XtnsnEnvlp");
	ИначеЕсли ЗначениеЗаполнено(ЗначениеСвойства(ПунктДопИнфо, "SplmtryData")) Тогда
		ТребуемыйТег = ЗначениеСвойства(ПунктДопИнфо, "SplmtryData");
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТребуемыйТег) = Тип("Массив") Тогда
		Для Каждого ТребуемыйЭлемент Из ТребуемыйТег Цикл
			Если ЗначениеЗаполнено(ЗначениеСвойства(ТребуемыйЭлемент, "XtnsnDt")) Тогда
				ТребуемыйПодпункт = ЗначениеСвойства(ТребуемыйЭлемент, "XtnsnDt");
			ИначеЕсли ЗначениеЗаполнено(ЗначениеСвойства(ТребуемыйЭлемент, "Envlp.XtnsnDt")) Тогда
				ТребуемыйПодпункт = ЗначениеСвойства(ТребуемыйЭлемент, "Envlp.XtnsnDt");
			Иначе
				Продолжить;
			КонецЕсли;
			ОбработатьТегДополнительнойИнформации(ТребуемыйПодпункт, ДополнительнаяИнформация);
		КонецЦикла;
	Иначе
		Если ЗначениеЗаполнено(ЗначениеСвойства(ТребуемыйТег, "XtnsnDt")) Тогда
			ТребуемыйПодпункт = ЗначениеСвойства(ТребуемыйТег, "XtnsnDt");
			ОбработатьТегДополнительнойИнформации(ТребуемыйПодпункт, ДополнительнаяИнформация);
		ИначеЕсли ЗначениеЗаполнено(ЗначениеСвойства(ТребуемыйТег, "Envlp.XtnsnDt")) Тогда
			ТребуемыйПодпункт = ЗначениеСвойства(ТребуемыйТег, "Envlp.XtnsnDt");
			ОбработатьТегДополнительнойИнформации(ТребуемыйПодпункт, ДополнительнаяИнформация);
		Иначе
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойства(ПунктДопИнфо, "AddtlInf")) Тогда
		ОбработатьТегДополнительнойИнформации(ПунктДопИнфо, ДополнительнаяИнформация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойства(ПунктДопИнфо, "CorpActnOptnDtls.AddtlInf")) Тогда
		ОбработатьТегДополнительнойИнформации(ЗначениеСвойства(ПунктДопИнфо, "CorpActnOptnDtls"), ДополнительнаяИнформация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойства(ПунктДопИнфо, "CorpActnDtls.AddtlInf")) Тогда
		ОбработатьТегДополнительнойИнформации(ЗначениеСвойства(ПунктДопИнфо, "CorpActnDtls"), ДополнительнаяИнформация);
	КонецЕсли;
	
	
	ДополнительнаяИнформация = СтрЗаменить(ДополнительнаяИнформация, "Направляем Вам поступившие в НКО АО НРД итоги общего"
	+ " собрания акционеров с целью доведения указанной информации до лиц, имеющих право на участие в данном корпоративном действии.*", "");
	ДополнительнаяИнформация = СтрЗаменить(ДополнительнаяИнформация, "* НРД не отвечает за полноту и достоверность информации, "
	+ "полученной от третьих лиц.", "");
	
КонецПроцедуры

Процедура ОбработатьТегДополнительнойИнформации(ТребуемыйПодпункт, ДополнительнаяИнформация)
	
	Если ЗначениеЗаполнено(ЗначениеСвойства(ТребуемыйПодпункт, "AddtlInf")) Тогда
		AddtlTxt = ЗначениеСвойства(ТребуемыйПодпункт, "AddtlInf.AddtlTxt");
		ОбработатьСодержимоеСообщения(AddtlTxt, ДополнительнаяИнформация);
		
		NrrtvVrsn = ЗначениеСвойства(ТребуемыйПодпункт, "AddtlInf.NrrtvVrsn");
		ОбработатьСодержимоеСообщения(NrrtvVrsn, ДополнительнаяИнформация);
		
		InfConds = ЗначениеСвойства(ТребуемыйПодпункт, "AddtlInf.InfConds");
		ОбработатьСодержимоеСообщения(InfConds, ДополнительнаяИнформация);
		
		InfToCmplyWth = ЗначениеСвойства(ТребуемыйПодпункт, "AddtlInf.InfToCmplyWth");
		ОбработатьСодержимоеСообщения(InfToCmplyWth, ДополнительнаяИнформация);
		
		TaxtnConds = ЗначениеСвойства(ТребуемыйПодпункт, "AddtlInf.TaxtnConds");
		ОбработатьСодержимоеСообщения(TaxtnConds, ДополнительнаяИнформация);
		
		Dsclmr = ЗначениеСвойства(ТребуемыйПодпункт, "AddtlInf.Dsclmr");
		ОбработатьСодержимоеСообщения(Dsclmr, ДополнительнаяИнформация);
		
		DclrtnDtls = ЗначениеСвойства(ТребуемыйПодпункт, "AddtlInf.DclrtnDtls");
		ОбработатьСодержимоеСообщения(DclrtnDtls, ДополнительнаяИнформация);
		
		RegnDtls = ЗначениеСвойства(ТребуемыйПодпункт, "AddtlInf.RegnDtls");
		ОбработатьСодержимоеСообщения(RegnDtls, ДополнительнаяИнформация);
		
		BsktOrIndxInf = ЗначениеСвойства(ТребуемыйПодпункт, "AddtlInf.BsktOrIndxInf");
		ОбработатьСодержимоеСообщения(BsktOrIndxInf, ДополнительнаяИнформация);
		
		Offerr = ЗначениеСвойства(ТребуемыйПодпункт, "AddtlInf.Offerr");
		ОбработатьСодержимоеСообщения(Offerr, ДополнительнаяИнформация);
	Иначе
		Если ЗначениеЗаполнено(ЗначениеСвойства(ТребуемыйПодпункт , "SbLwsInPlc")) Тогда
			AddtlInf = ЗначениеСвойства(ТребуемыйПодпункт, "SbLwsInPlc.AddtlInf");
			ОбработатьСодержимоеСообщения(AddtlInf, ДополнительнаяИнформация);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьДополнительнуюИнформацию(Xtnsn, ПараметрыКД)
	
	ОбрабатыватьКД = НеобходимоОбрабатыватьКД(ПараметрыКД.КодОтчета);
	ШапкаДополнительнойИнформации = ЗначениеСвойства(ПараметрыКД, "ДополнительнаяИнформация");
	
	ДополнительнаяИнформация = "";
	Если ОбрабатыватьКД Тогда
		Если ЗначениеЗаполнено(Xtnsn) Тогда
			Если ТипЗнч(Xtnsn) = Тип("Массив") И Xtnsn.Количество() > 0 Тогда
				Для Каждого ПунктДопИнфо Из Xtnsn Цикл
					ОбработатьПунктДополнительнаяИнформация(ПунктДопИнфо, ДополнительнаяИнформация);
				КонецЦикла;
			Иначе
				ОбработатьПунктДополнительнаяИнформация(Xtnsn, ДополнительнаяИнформация);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ШапкаДополнительнойИнформации) Тогда
			ДополнительнаяИнформация = ШапкаДополнительнойИнформации
				+ ?(ЗначениеЗаполнено(ДополнительнаяИнформация), Символы.ПС + ДополнительнаяИнформация, "");
		КонецЕсли;
	КонецЕсли;
	ПараметрыКД.Вставить("ДополнительнаяИнформация", ДополнительнаяИнформация);
КонецПроцедуры

Функция НеобходимоОбрабатыватьКД(КодОтчета)
	ПодходящиеКодыОтчета = Новый Соответствие;
	ПодходящиеКодыОтчета.Вставить("CA011", Истина);
	ПодходящиеКодыОтчета.Вставить("CA012", Истина);
	ПодходящиеКодыОтчета.Вставить("CA013", Истина);
	ПодходящиеКодыОтчета.Вставить("CA014", Истина);
	ПодходящиеКодыОтчета.Вставить("CA021", Истина);
	ПодходящиеКодыОтчета.Вставить("CA081", Истина);
	ПодходящиеКодыОтчета.Вставить("CA082", Истина);
	ПодходящиеКодыОтчета.Вставить("CA311", Истина);
	ПодходящиеКодыОтчета.Вставить("CA312", Истина);
	ПодходящиеКодыОтчета.Вставить("CA313", Истина);
	ПодходящиеКодыОтчета.Вставить("CA391", Истина);
	
	Возврат ПодходящиеКодыОтчета[КодОтчета] <> Неопределено;
	
КонецФункции

Процедура ЗаполнитьДокументыКДПоСообщениюКД(ВходящийДокументНомер, ДокументКД, СвязанныйДокументПоКарточкеКД)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЭтапыКДСрезПоследних.КД) = ТИП(Документ.РаскрытиеСпискаВладельцев)
	|			ТОГДА ЭтапыКДСрезПоследних.КД.КарточкаКД
	|		ИНАЧЕ ЭтапыКДСрезПоследних.КД
	|	КОНЕЦ КАК КД,
	|	ЭтапыКДСрезПоследних.ДокументКД КАК ДокументКД
	|ИЗ
	|	РегистрСведений.ЭтапыКД КАК ЭтапыКДСрезПоследних
	|ГДЕ
	|	ЭтапыКДСрезПоследних.НомерСообщения = &НомерСообщения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапыКДСрезПоследних.Период УБЫВ";
	Запрос.УстановитьПараметр("НомерСообщения", ВходящийДокументНомер);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументКД = Выборка.КД;
		СвязанныйДокументПоКарточкеКД = Выборка.ДокументКД;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьУведомлениеОНеопределенномРСВ(РеференсКД)
	ПВХ = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОНеопределенномСвязанномКД;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПВХ).Настройка;
	
	ТемаПисьма = "Ошибка. Не удалось загрузить статус РСВ (Референс КД " + РеференсКД + ")";
	ТекстУведомления = "При обработке файла статуса собрания:
	|Референс КД " + РеференсКД;
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстУведомления);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
КонецПроцедуры

Процедура ДобавитьФиксированныеСтрокиВДополнительнуюИнформацию(ПараметрыКД)
	
	ДополнительнаяИнформация = ЗначениеСвойства(ПараметрыКД, "ДополнительнаяИнформация");
	Если ЗначениеЗаполнено(ДополнительнаяИнформация) Тогда
		ОрганизацияПоУмолчанию = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ОрганизацияПоУмолчанию");
		ШапкаДопИнфо = "В адрес Депозитария " + ОрганизацияПоУмолчанию + " поступило следующее сообщение:";
		ДополнительнаяИнформация = ШапкаДопИнфо + Символы.ПС + ДополнительнаяИнформация;
		ПараметрыКД.Вставить("ДополнительнаяИнформация", ДополнительнаяИнформация);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтключитьОбработкуСобственныхСчетов(Строка, НомерСчетаДепо = Неопределено)
	
	Если ВышестоящийДепозитарий = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияПоУмолчанию") Тогда
		
		Если НомерСчетаДепо = Неопределено Тогда
			НомерСчетаДепо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.СчетДЕПО, "Код");
		КонецЕсли;
		
		Если НомерСчетаДепо <> Неопределено И Не ЗначениеЗаполнено(Справочники.СчетаДепоМХ.НайтиПоКоду(НомерСчетаДепо)) Тогда
			Строка.Обрабатывать = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьУведомлениеОЗагруженномКДсЭЗО(КДДата, Знач КДРеференс)
	ПВХ = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОЗагруженномКДсЭЗО;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПВХ).Настройка;
	Если НастройкиОбмена = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось получить параметры внешнего источника """ + ПВХ + """");
		Возврат;
	КонецЕсли;
	
	ТемаПисьма = "КД по Экономически значимой организации";
	
	КДРеференс	= ?(ЗначениеЗаполнено(КДРеференс), СокрЛП(КДРеференс), "нет данных");
	ТекстУведомления = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"Внимание! Поступила информация об Экономически значимой организации." + Символы.ВК 
		+ "Входящий документ ""Корпоративное действие Новый"" КД Референс '%1', '%2'." + Символы.ВК
		+ "Необходимо ввести данные вручную!", КДРеференс, КДДата);
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстУведомления);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мКлючСвязиДанныхКДиЦБ = 0;
ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
ИмяСобытия	= "Загрузка 'Корпоративных действий'";
