
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Строка Из ЭтотОбъект Цикл
		Если (Строка.СчетДепо.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.Закрыт И Строка.СчетДепо.ДатаЗакрытияСчета <= Строка.Период)
			//ИЛИ Строка.СчетДепо.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.НеОткрыт
		Тогда
			//ОбщегоНазначения.СообщитьОбОшибке("Вы пытаетесь провести документ по закрытому или не открытому 'Счету ДЕПО' - "+СокрЛП(Строка.СчетДепо.Код)+" ("+СокрЛП(Строка.СчетДепо.Владелец)+")", Отказ);
			ОбщегоНазначения.СообщитьОбОшибке("Вы пытаетесь провести документ по закрытому 'Счету ДЕПО' - "+СокрЛП(Строка.СчетДепо.Код)+" ("+СокрЛП(Строка.СчетДепо.Владелец)+")", Отказ);
			Возврат;
		КонецЕсли;
			
		Если (Строка.РазделСчетаДепо.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.Закрыт И Строка.РазделСчетаДепо.ДатаЗакрытияСчета <= Строка.Период)
			//ИЛИ Строка.РазделСчетаДепо.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.НеОткрыт
		Тогда
			//ОбщегоНазначения.СообщитьОбОшибке("Вы пытаетесь провести документ по закрытому или не открытому 'Разделу счета ДЕПО' - "+СокрЛП(Строка.РазделСчетаДепо.Код)+" ("+СокрЛП(Строка.РазделСчетаДепо.Владелец.Код)+" / "+СокрЛП(Строка.РазделСчетаДепо.Владелец.Владелец.Наименование)+")", Отказ);
			ОбщегоНазначения.СообщитьОбОшибке("Вы пытаетесь провести документ по закрытому 'Разделу счета ДЕПО' - "+СокрЛП(Строка.РазделСчетаДепо.Код)+" ("+СокрЛП(Строка.РазделСчетаДепо.Владелец.Код)+" / "+СокрЛП(Строка.РазделСчетаДепо.Владелец.Владелец.Наименование)+")", Отказ);
			Возврат;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры
