// Возвращает категорию роли клиента на указанную дату
//
// Параметры:
//  Клиент	 - СправочникСсылка.Контрагенты
//  Дата	 - Дата
// 
// Возвращаемое значение:
//  СправочникСсылка.КатегорииРолейКлиентовСогласноУказов81и95 - Категория роли клиента на дату
//
Функция КатегорияРолиКлиента(Клиент, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КатегорииРолейКлиентовСогласноУказов81и95СрезПоследних.КатегорияРоли КАК КатегорияРоли
	|ИЗ
	|	РегистрСведений.КатегорииРолейКлиентовСогласноУказов81и95.СрезПоследних(
	|			&Дата,
	|			ЮрФизЛицо В
	|				(ВЫБРАТЬ
	|					Контрагенты.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица
	|				ИЗ
	|					Справочник.Контрагенты КАК Контрагенты
	|				ГДЕ
	|					Контрагенты.Ссылка = &Клиент)) КАК КатегорииРолейКлиентовСогласноУказов81и95СрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.КатегорияРоли;
	КонецЕсли;
	
КонецФункции