
&НаКлиенте
Процедура ОтправитьВыделенныеСообщения(Команда)
	Для Каждого Сообщение Из Элементы.Список.ВыделенныеСтроки Цикл
		ОтправитьВыделенныеСообщенияНаСервере(Сообщение);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОтправитьВыделенныеСообщенияНаСервере(Сообщение)
    СтруктураПоиска = Новый Структура("Идентификатор", Сообщение.Идентификатор);
	Данные = РегистрыСведений.ЖурналИсходящихСообщенийKafka.Выбрать(СтруктураПоиска);
    Если Данные.Следующий() Тогда
		КафкаКлиент = Обработки.KafkaClient.Создать();
		Ответ = КафкаКлиент.РезультатОтправкиСообщенияПоВнешнемуИсточнику(Данные);
		ДатаОтправки = ТекущаяДатаСеанса();
		МенеджерЗаписи = Данные.ПолучитьМенеджерЗаписи();
		МенеджерЗаписи.Прочитать();
		Если Ответ = "Persisted" Тогда
			МенеджерЗаписи.Отправлено = Истина;
			МенеджерЗаписи.ПериодОтправкиСообщения = ДатаОтправки;
		Иначе
			МенеджерЗаписи.ОшибкаОтправки = Истина;
			МенеджерЗаписи.ОписаниеОшибки = Ответ;
		КонецЕсли;
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры
