
Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение") Тогда
		Если Основание.ВидОперацииД = Справочники.ВидыОпераций.ОтменаПоручения Тогда
			Если ЭтоНовый() Тогда
				ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, ПараметрыСеанса.ТекущийПользователь, , );
			КонецЕсли;
			ДокументОснование	= Основание.Ссылка;					
			ОтменяемоеПоручение	= Основание.ОтменяемоеПоручение;
			Дата				= ОбщегоНазначения.ДатаДокумента(Основание);
		Иначе	                      
			Проверка = Истина;
			Сообщить("На основании данного вида поручения нельзя создать документ Отмена поручения !!!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// Пометка на удаление выбранного поручения и всех связанных с ним операций.
	Если ЗначениеЗаполнено(ОтменяемоеПоручение) Тогда
		Для Каждого ТекущаяСтрока Из СвязанныеОперации Цикл
			ТекущаяСтрока.Объект.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
			Сообщить(Строка(ТекущаяСтрока.Объект) + " Помечен на удаление!");
		КонецЦикла;
		
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("В " + Ссылка + " не выбрано поручение для отмены.", Отказ);
		Возврат;
	КонецЕсли;
	
	Если ДокументОснование.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("В " + Ссылка + " не выбран документ-основание.", Отказ);
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ОтменяемоеПоручение.СчетДЕПО) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("В документе " + ОтменяемоеПоручение + " не выбран счет ДЕПО.", Отказ);
		Возврат;
	КонецЕсли;
	
	Если ДокументОснование.НачислитьКомиссиюЗаОтмену Тогда
		Договор = ДействующийДоговорДепонента(ОтменяемоеПоручение.СчетДепо.Владелец, Дата);
		Услуга = Новый Структура("Операция, МестоХранения1, МестоХранения2", Справочники.ВидыОпераций.ОтменаПоручения,
			Неопределено, Неопределено);
		РасчетныеПараметры = РасчетТарифов.РасчетСтоимостиУслуги(Дата, Договор, Услуга);
		
		Если РасчетныеПараметры <> Неопределено Тогда
			Движение = Движения.УслугиДепозитария.ДобавитьПриход();
			Движение.Период			= Дата;
			Движение.Инициатор		= Договор;
			Движение.Услуга			= РасчетныеПараметры.Услуга;
			Движение.СтавкаНДС		= Перечисления.СтавкиНДС.НДС18_118;
			Движение.Валюта			= РасчетныеПараметры.Валюта;
			Движение.Сумма			= РасчетныеПараметры.Сумма;
			Движение.СуммаВВалюте	= Конвертации.КонвертацияВалюты(Дата, Движение.Сумма, РасчетныеПараметры.Валюта);
			Движение.СуммаНДС		= РасчетТарифов.РТ_РасчетНДС(Движение.СтавкаНДС, Движение.Сумма);
			Движение.СуммаВсего		= РасчетТарифов.РТ_ОбщаяСумма(Движение.СтавкаНДС, Движение.Сумма, Движение.СуммаНДС);
			Движение.Сумма			= Движение.СуммаВсего - Движение.СуммаНДС;
			Движение.ТипТарифа		= РасчетныеПараметры.ТипТарифа;
			Движение.Тариф			= РасчетныеПараметры.Тариф;
			Движения.УслугиДепозитария.Записать();
		КонецЕсли; 	
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

Функция ДействующийДоговорДепонента(Депонент, ДатаПоручения)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Договоры.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Договоры
	|ГДЕ
	|	Договоры.Владелец = &Депонент
	|	И Договоры.ДатаНачалоДействия <= НАЧАЛОПЕРИОДА(&ДатаПоручения, ДЕНЬ)
	|	И (Договоры.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|		ИЛИ Договоры.ДатаОкончанияДействия > НАЧАЛОПЕРИОДА(&ДатаПоручения, ДЕНЬ))
	|	И НЕ Договоры.ПометкаУдаления");
	Запрос.УстановитьПараметр("Депонент", Депонент);
	Запрос.УстановитьПараметр("ДатаПоручения", ДатаПоручения);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Договор;
	Иначе
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	Конецесли;
КонецФункции
