#Область ПрограммныйИнтерфейс

// Функция - ЦБКлиента учитываются на счете типа С
// Проверяет учитываются ли ЦБ клиента на счете типа С
// Параметры:
//  Дата	 - Дата - Дата на которую проверяем клиента
//  Клиент	 - СправочникСсылка.Контрагенты - Проверяемый клиент
// 
// Возвращаемое значение:
//   Булево
//
Функция ЦБКлиентаУчитываютсяНаСчетеТипаС(Дата, Клиент) Экспорт 
	ИмеетСчетаТипаЦ = Ложь;
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлиентыСУчетомНаСчетахТипаCСрезПоследних.ФлагАктивности КАК ФлагАктивности
		|ИЗ
		|	РегистрСведений.КлиентыСУчетомНаСчетахТипаC.СрезПоследних(&Дата, Клиент = &Клиент) КАК КлиентыСУчетомНаСчетахТипаCСрезПоследних
		|ГДЕ
		|	КлиентыСУчетомНаСчетахТипаCСрезПоследних.ФлагАктивности";
		Запрос.УстановитьПараметр("Клиент", Клиент);
		Запрос.УстановитьПараметр("Дата", Дата);
		Выборка = Запрос.Выполнить().Выбрать();
		ИмеетСчетаТипаЦ = Выборка.Следующий();
	КонецЕсли;

	Возврат ИмеетСчетаТипаЦ;
КонецФункции

#КонецОбласти