
#Область ОписаниеПеременных

Перем Отказ Экспорт;
Перем ТекстОтказа Экспорт;

#КонецОбласти 

#Область DevOps

Функция ПолучитьСсылкуСправочникаПриемникаДляЗагрузки() Экспорт
	
	Возврат Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка()
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

// IMAPPS-25828 ++
// Функция СформироватьТекстЗапросаДляРаспределенияСделокСЦБ()
// IMAPPS-25575 ++
// Функция СформироватьТекстЗапросаДляРаспределенияСделокСЦБ(СделкиСВалютой = Неопределено)
Функция СформироватьТекстЗапросаДляРаспределенияСделокСЦБ(СделкиСВалютой = Неопределено, АктивыСВалютой = Неопределено)
// IMAPPS-25575 --
// IMAPPS-25828 --
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Активы.Ссылка КАК Актив,
	               |	Активы.Объект КАК Объект,
	               |	ВЫБОР
	               |		КОГДА Активы.Объект ССЫЛКА Справочник.Акции
	               |			ТОГДА Акции.ВалютаНоминальнойСтоимости
	               |		КОГДА Активы.Объект ССЫЛКА Справочник.ДепозитарныеРасписки
	               |			ТОГДА ДепозитарныеРасписки.ВалютаНоминальнойСтоимости
	               |		КОГДА Активы.Объект ССЫЛКА Справочник.КлиринговыеСертификатыУчастия
	               |			ТОГДА КлиринговыеСертификатыУчастия.ВалютаНоминальнойСтоимости
	               |		КОГДА Активы.Объект ССЫЛКА Справочник.Облигации
	               |			ТОГДА Облигации.ВалютаНоминальнойСтоимости
	               |		КОГДА Активы.Объект ССЫЛКА Справочник.ПаиПИФ
	               |			ТОГДА ПаиПИФ.ВалютаНоминальнойСтоимости
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	               |	КОНЕЦ КАК ВалютаНоминальнойСтоимости
	               |ПОМЕСТИТЬ втАктивы
	               |ИЗ
	               |	Справочник.Активы КАК Активы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
	               |		ПО Активы.Объект = Акции.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитарныеРасписки КАК ДепозитарныеРасписки
	               |		ПО Активы.Объект = ДепозитарныеРасписки.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлиринговыеСертификатыУчастия КАК КлиринговыеСертификатыУчастия
	               |		ПО Активы.Объект = КлиринговыеСертификатыУчастия.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
	               |		ПО Активы.Объект = Облигации.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПаиПИФ КАК ПаиПИФ
	               |		ПО Активы.Объект = ПаиПИФ.Ссылка
	               |ГДЕ
	               |	НЕ Активы.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СделкаЦБ.Ссылка) КАК КоличествоЗадач,
	               |	СделкаЦБ.ПИФ КАК ПИФ,
	               |	ПРЕДСТАВЛЕНИЕ(СделкаЦБ.ПИФ) КАК ПредставлениеПИФ,
	               |	СделкаЦБ.Актив КАК Актив,
	               |	ПРЕДСТАВЛЕНИЕ(СделкаЦБ.Актив) КАК ПредставлениеАктив
	               |ИЗ
	               |	Документ.СделкаЦБ КАК СделкаЦБ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАктивы КАК втАктивы
				   |		ПО СделкаЦБ.Актив = втАктивы.Актив
	               |ГДЕ
	               |	СделкаЦБ.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И СделкаЦБ.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ СделкаЦБ.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |	И &Условие1
	               |	И &Условие2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаЦБ.ПИФ,
	               |	СделкаЦБ.Актив
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СделкаЦБ.Ссылка) УБЫВ";
	
	// IMAPPS-25828 ++
	// Если Не ВалютныеСделки = Неопределено Тогда  
	//	Если ВалютныеСделки Тогда 
	Если Не СделкиСВалютой = Неопределено Тогда  
		Если СделкиСВалютой Тогда 
	// IMAPPS-25828 --
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&Условие1","НЕ СделкаЦБ.ВалютаДокумента = ЗНАЧЕНИЕ(Справочник.Валюты.RUB)");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&Условие1","СделкаЦБ.ВалютаДокумента = ЗНАЧЕНИЕ(Справочник.Валюты.RUB)");
		КонецЕсли;	
	Иначе 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&Условие1","Истина");
	КонецЕсли;
	
	// IMAPPS-25575 ++
	Если Не АктивыСВалютой = Неопределено Тогда  
		Если АктивыСВалютой Тогда 
			ТекстУсловия_2 = "НЕ (втАктивы.ВалютаНоминальнойСтоимости = ЗНАЧЕНИЕ(Справочник.Валюты.RUB)
								| ИЛИ втАктивы.ВалютаНоминальнойСтоимости = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))";
		Иначе
			ТекстУсловия_2 = "(втАктивы.ВалютаНоминальнойСтоимости = ЗНАЧЕНИЕ(Справочник.Валюты.RUB)
								| ИЛИ втАктивы.ВалютаНоминальнойСтоимости = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))";
		КонецЕсли;	
	Иначе 
		ТекстУсловия_2 = "Истина";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие2", ТекстУсловия_2);
	// IMAPPS-25575 --
	
	Возврат ТекстЗапроса;
КонецФункции

// IMAPPS-25828 ++
// Функция СформироватьТекстЗапросаДляРаспределенияДокументов58()
// IMAPPS-25575 ++
//Функция СформироватьТекстЗапросаДляРаспределенияДокументов58(СделкиСВалютой = Неопределено)
Функция СформироватьТекстЗапросаДляРаспределенияДокументов58(СделкиСВалютой = Неопределено, АктивыСВалютой = Неопределено)
// IMAPPS-25575 --
// IMAPPS-25828 --
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Активы.Ссылка КАК Актив,
	               |	Активы.Объект КАК Объект,
	               |	ВЫБОР
	               |		КОГДА Активы.Объект ССЫЛКА Справочник.Акции
	               |			ТОГДА Акции.ВалютаНоминальнойСтоимости
	               |		КОГДА Активы.Объект ССЫЛКА Справочник.ДепозитарныеРасписки
	               |			ТОГДА ДепозитарныеРасписки.ВалютаНоминальнойСтоимости
	               |		КОГДА Активы.Объект ССЫЛКА Справочник.КлиринговыеСертификатыУчастия
	               |			ТОГДА КлиринговыеСертификатыУчастия.ВалютаНоминальнойСтоимости
	               |		КОГДА Активы.Объект ССЫЛКА Справочник.Облигации
	               |			ТОГДА Облигации.ВалютаНоминальнойСтоимости
	               |		КОГДА Активы.Объект ССЫЛКА Справочник.ПаиПИФ
	               |			ТОГДА ПаиПИФ.ВалютаНоминальнойСтоимости
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	               |	КОНЕЦ КАК ВалютаНоминальнойСтоимости
	               |ПОМЕСТИТЬ втАктивы
	               |ИЗ
	               |	Справочник.Активы КАК Активы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
	               |		ПО Активы.Объект = Акции.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитарныеРасписки КАК ДепозитарныеРасписки
	               |		ПО Активы.Объект = ДепозитарныеРасписки.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлиринговыеСертификатыУчастия КАК КлиринговыеСертификатыУчастия
	               |		ПО Активы.Объект = КлиринговыеСертификатыУчастия.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
	               |		ПО Активы.Объект = Облигации.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПаиПИФ КАК ПаиПИФ
	               |		ПО Активы.Объект = ПаиПИФ.Ссылка
	               |ГДЕ
	               |	НЕ Активы.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка КАК Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента КАК Валюта,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ КАК ПИФ,
	               |	ТЧ.ЦБ КАК Актив
	               |ПОМЕСТИТЬ втДокументыДляГруппировки
	               |ИЗ
	               |	Документ.СделкаРЕПО_Удалить КАК ПсевдонимЗаданнойТаблицы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО_Удалить.ЦенныеБумаги КАК ТЧ
				   |		ПО ПсевдонимЗаданнойТаблицы.Ссылка = ТЧ.Ссылка 
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	NULL,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	ТЧ.Облигация КАК Актив
	               |ИЗ
	               |	Документ.ДефолтнаяОперация КАК ПсевдонимЗаданнойТаблицы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДефолтнаяОперация.Облигации КАК ТЧ
				   |		ПО ПсевдонимЗаданнойТаблицы.Ссылка = ТЧ.Ссылка 
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	NULL
	               |ИЗ
	               |	Документ.ДисконтированиеЗадолженности КАК ПсевдонимЗаданнойТаблицы
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	NULL
	               |ИЗ
	               |	Документ.ДисконтированиеПлановыхДоходов КАК ПсевдонимЗаданнойТаблицы
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	NULL
	               |ИЗ
	               |	Документ.ДокументРасчетовСКонтрагентом КАК ПсевдонимЗаданнойТаблицы
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	ТЧ.Актив КАК Актив
	               |ИЗ
	               |	Документ.КонвертацияАктивов КАК ПсевдонимЗаданнойТаблицы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонвертацияАктивов.СписокОбъектов КАК ТЧ
				   |		ПО ПсевдонимЗаданнойТаблицы.Ссылка = ТЧ.Ссылка 
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	NULL
	               |ИЗ
	               |	Документ.НачислениеПроцентовПоБанковскимСчетам КАК ПсевдонимЗаданнойТаблицы
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	NULL,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	NULL
	               |ИЗ
	               |	Документ.ОперацияБух КАК ПсевдонимЗаданнойТаблицы
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	ПсевдонимЗаданнойТаблицы.Актив
	               |ИЗ
	               |	Документ.ОперацияПоУчетуДоходовИВыплат КАК ПсевдонимЗаданнойТаблицы
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	ТЧ.Актив
	               |ИЗ
	               |	Документ.ОперацияСАналитическимиСчетами КАК ПсевдонимЗаданнойТаблицы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОперацияСАналитическимиСчетами.Активы КАК ТЧ
				   |		ПО ПсевдонимЗаданнойТаблицы.Ссылка = ТЧ.Ссылка 
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	ТЧ.Актив
	               |ИЗ
	               |	Документ.ОперацияСоСчетомДЕПО КАК ПсевдонимЗаданнойТаблицы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОперацияСАналитическимиСчетами.Активы КАК ТЧ
				   |		ПО ПсевдонимЗаданнойТаблицы.Ссылка = ТЧ.Ссылка 
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	ТЧ.Актив
	               |ИЗ
	               |	Документ.ПереоценкаАктивов КАК ПсевдонимЗаданнойТаблицы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаАктивов.АктивыПереоценки КАК ТЧ
				   |		ПО ПсевдонимЗаданнойТаблицы.Ссылка = ТЧ.Ссылка 
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	ТЧ.Актив
	               |ИЗ
	               |	Документ.ПоступлениеАктивов КАК ПсевдонимЗаданнойТаблицы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеАктивов.ЦенныеБумаги КАК ТЧ
				   |		ПО ПсевдонимЗаданнойТаблицы.Ссылка = ТЧ.Ссылка 
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	ТЧ.Актив
	               |ИЗ
	               |	Документ.ПоступлениеДопРасходов КАК ПсевдонимЗаданнойТаблицы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеДопРасходов.Активы КАК ТЧ
				   |		ПО ПсевдонимЗаданнойТаблицы.Ссылка = ТЧ.Ссылка 
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	NULL,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	ТЧ.Актив
	               |ИЗ
	               |	Документ.ПринятиеКУчетуАктиваПоОценочнойСтоимости КАК ПсевдонимЗаданнойТаблицы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуАктиваПоОценочнойСтоимости.Активы КАК ТЧ
				   |		ПО ПсевдонимЗаданнойТаблицы.Ссылка = ТЧ.Ссылка 
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	ТЧ.ОбъектНФА
	               |ИЗ
	               |	Документ.ПринятиекУчетуНФА КАК ПсевдонимЗаданнойТаблицы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиекУчетуНФА.СписокОбъектов КАК ТЧ
				   |		ПО ПсевдонимЗаданнойТаблицы.Ссылка = ТЧ.Ссылка 
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	ТЧ.Актив
	               |ИЗ
	               |	Документ.ПродажаАктивов КАК ПсевдонимЗаданнойТаблицы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПродажаАктивов.ЦенныеБумаги КАК ТЧ
				   |		ПО ПсевдонимЗаданнойТаблицы.Ссылка = ТЧ.Ссылка 
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	NULL
	               |ИЗ
	               |	Документ.РеестрОплатПоДенежнымТребованиям КАК ПсевдонимЗаданнойТаблицы
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	ПсевдонимЗаданнойТаблицы.Контракт
	               |ИЗ
	               |	Документ.СделкаНаСрочномРынке КАК ПсевдонимЗаданнойТаблицы
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	ПсевдонимЗаданнойТаблицы.Актив
	               |ИЗ
	               |	Документ.СделкаРЕПОЧасть2 КАК ПсевдонимЗаданнойТаблицы
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	ПсевдонимЗаданнойТаблицы.Актив
	               |ИЗ
	               |	Документ.СделкаРЕПОЧасть1 КАК ПсевдонимЗаданнойТаблицы
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПсевдонимЗаданнойТаблицы.Ссылка,
	               |	ПсевдонимЗаданнойТаблицы.ВалютаДокумента,
	               |	ПсевдонимЗаданнойТаблицы.ПИФ,
	               |	ТЧ.Актив
	               |ИЗ
	               |	Документ.СнятиеСУчетаАктива КАК ПсевдонимЗаданнойТаблицы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СнятиеСУчетаАктива.СписокНедвижимости КАК ТЧ
				   |		ПО ПсевдонимЗаданнойТаблицы.Ссылка = ТЧ.Ссылка 
	               |ГДЕ
	               |	ПсевдонимЗаданнойТаблицы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	               |	И ПсевдонимЗаданнойТаблицы.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеПИФы
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПсевдонимЗаданнойТаблицы.ПИФ В (&ПИФы)
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втДокументыДляГруппировки.Ссылка) КАК КоличествоЗадач,
	               |	втДокументыДляГруппировки.ПИФ КАК ПИФ,
	               |	ПРЕДСТАВЛЕНИЕ(втДокументыДляГруппировки.ПИФ) КАК ПредставлениеПИФ
	               |ИЗ
	               |	втДокументыДляГруппировки КАК втДокументыДляГруппировки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втАктивы КАК втАктивы
				   |		ПО втДокументыДляГруппировки.Актив = втАктивы.Актив
	               |ГДЕ 
				   | &Условие1
				   | И &Условие2
				   //|	НЕ втДокументыДляГруппировки.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.RUB)
				   //|			И втДокументыДляГруппировки.Валюта = NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втДокументыДляГруппировки.ПИФ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втДокументыДляГруппировки.Ссылка) УБЫВ";
				   
	// IMAPPS-25828 ++
	// Если Не ВалютныеСделки = Неопределено Тогда  
	//	Если ВалютныеСделки Тогда 
	//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&Условие1","НЕ (втДокументыДляГруппировки.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.RUB) И НЕ втДокументыДляГруппировки.Валюта = NULL)");
	//	Иначе
	//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&Условие1","втДокументыДляГруппировки.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.RUB) ИЛИ втДокументыДляГруппировки.Валюта = NULL");
	//	КонецЕсли;	
	Если Не СделкиСВалютой = Неопределено Тогда  
		Если СделкиСВалютой Тогда 
			Текст_Условие1	= "НЕ (втДокументыДляГруппировки.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.RUB) 
							|		ИЛИ ЕСТЬNULL(втДокументыДляГруппировки.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) 
							|	ИЛИ втДокументыДляГруппировки.Ссылка ССЫЛКА Документ.ПереоценкаАктивов"
		Иначе
			Текст_Условие1	= "(втДокументыДляГруппировки.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.RUB) 
							|	ИЛИ ЕСТЬNULL(втДокументыДляГруппировки.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) 
							|	ИЛИ втДокументыДляГруппировки.Ссылка ССЫЛКА Документ.ПереоценкаАктивов)"
		КонецЕсли;	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие1", Текст_Условие1);
	// IMAPPS-25828 --
	Иначе 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&Условие1","Истина");
	КонецЕсли;

	// IMAPPS-25575 ++
	Если Не АктивыСВалютой = Неопределено Тогда  
		Если АктивыСВалютой Тогда 
			ТекстУсловия_2 = "НЕ (ЕСТЬNULL(втАктивы.ВалютаНоминальнойСтоимости, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Валюты.RUB)
								| ИЛИ ЕСТЬNULL(втАктивы.ВалютаНоминальнойСтоимости, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))";
		Иначе
			ТекстУсловия_2 = "(ЕСТЬNULL(втАктивы.ВалютаНоминальнойСтоимости, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Валюты.RUB)
								| ИЛИ ЕСТЬNULL(втАктивы.ВалютаНоминальнойСтоимости, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))";
		КонецЕсли;	
	Иначе 
		ТекстУсловия_2 = "Истина";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие2", ТекстУсловия_2);
	// IMAPPS-25575 --
	
	Возврат ТекстЗапроса;
КонецФункции	

Функция ОпределитьНаименееЗагруженныйПоток(Потоки)
	Потоки.Сортировать("ТекущаяЗагрузка ВОЗР");
	Возврат Потоки[0];
КонецФункции

Функция РаспределитьЗадачиПоПотокам(ТекстЗапроса, ГруппировкаПоАктиву = Истина,СделкиПоВалюте = Неопределено)
	Потоки = Новый ТаблицаЗначений;                                                                         
	Потоки.Колонки.Добавить("НомерПотока");
	Потоки.Колонки.Добавить("ТекущаяЗагрузка");
	Потоки.Колонки.Добавить("ТаблицаКлючей");
	
	//Инициализация
	Для Сч = 0 По КоличествоПотоков - 1 Цикл
		НовыйПоток = Потоки.Добавить();
		НовыйПоток.НомерПотока = Сч;
		НовыйПоток.ТекущаяЗагрузка = 0;
		НовыйПоток.ТаблицаКлючей = Новый ТаблицаЗначений;
		НовыйПоток.ТаблицаКлючей.Колонки.Добавить("Пиф", Новый ОписаниеТипов("СправочникСсылка.ПИФ"));
		КвалификаторСтроки = Новый КвалификаторыСтроки(250);
		НовыйПоток.ТаблицаКлючей.Колонки.Добавить("ПредставлениеПИФ", Новый ОписаниеТипов("Строка",,,,КвалификаторСтроки));
		НовыйПоток.ТаблицаКлючей.Колонки.Добавить("Актив", Новый ОписаниеТипов("СправочникСсылка.Активы"));
		НовыйПоток.ТаблицаКлючей.Колонки.Добавить("ПредставлениеАктив", Новый ОписаниеТипов("Строка",,,,КвалификаторСтроки));
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Если Фонды.Количество() = 0 Тогда
		Запрос.УстановитьПараметр("ВсеПИФы", Истина);
		Запрос.УстановитьПараметр("ПИФы", Справочники.ПИФ.ПустаяСсылка());
	Иначе
		Запрос.УстановитьПараметр("ВсеПИФы", ЛОЖЬ);
		Запрос.УстановитьПараметр("ПИФы", Фонды.ВыгрузитьКолонку("ПИФ"));
	КонецЕсли;
	
	СписокЗадач = Запрос.Выполнить().Выгрузить();
	// Перебираем задачи-грузы. На каждой итерации цикла ищем наименее загруженный вагон-поток
	// Самые тяжелые задачи-грузы упаковываем в наименее загруженный вагон-поток
	Для Каждого ТекущаяЗадача Из СписокЗадач Цикл
		НаименееЗагруженныйПоток = ОпределитьНаименееЗагруженныйПоток(Потоки);
		НаименееЗагруженныйПоток.ТекущаяЗагрузка = НаименееЗагруженныйПоток.ТекущаяЗагрузка + ТекущаяЗадача.КоличествоЗадач;
		НоваяСтрока = НаименееЗагруженныйПоток.ТаблицаКлючей.Добавить();
		НоваяСтрока.Пиф = ТекущаяЗадача.ПИФ;
		НоваяСтрока.ПредставлениеПИФ = ТекущаяЗадача.ПредставлениеПИФ;
		Если ГруппировкаПоАктиву Тогда
			НоваяСтрока.Актив = ТекущаяЗадача.Актив;
			НоваяСтрока.ПредставлениеАктив = ТекущаяЗадача.ПредставлениеАктив;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Потоки;
КонецФункции

Функция ОжидатьВыполненияЗаданий(МассивЗаданий)
	ВсеЗаданияВыполнены = Ложь;
	МассивСообщенийИзЗадания = Новый Массив;
	Комментарий = "";
	
	Пока ВсеЗаданияВыполнены = Ложь Цикл
		МассивУдалить = Новый Массив;
		Для Каждого Элемент из МассивЗаданий Цикл
			ТекущееЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Элемент);
			Если ТекущееЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				Продолжить;
			Иначе
				МассивУдалить.Добавить(Элемент);
				СообщенияЗадания = ТекущееЗадание.ПолучитьСообщенияПользователю(Истина);
				тмпСообщенияЗадания = Новый Массив(СообщенияЗадания);
				Для Каждого Элемент Из тмпСообщенияЗадания Цикл
					МассивСообщенийИзЗадания.Добавить(Элемент.Текст);	
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;				
		
		Для Каждого Элемент из МассивУдалить Цикл
			Индекс = МассивЗаданий.Найти(Элемент);
			МассивЗаданий.Удалить(Индекс);	
		КонецЦикла;	
		
		ВсеЗаданияВыполнены = МассивЗаданий.Количество() = 0;
	КонецЦикла;			
	
	Для Каждого Элемент из МассивСообщенийИзЗадания Цикл
		Комментарий = Комментарий + Символы.ПС + Элемент;	
	КонецЦикла;	
	
	Комментарий = Комментарий + Символы.ПС + "Все фоновые задания выполнены";
	Отказ = СтрНайти(Комментарий, "ОШИБКА:") > 0;
	
	Возврат Комментарий;
КонецФункции

// IMAPPS-25575 ++
// Функция ПерепровестиДокументыМногопоточно(ЕстьОшибки,СделкиСВалютой = Неопределено) Экспорт
Функция ПерепровестиДокументыМногопоточно(ЕстьОшибки, СделкиСВалютой = Неопределено, АктивыСВалютой = Неопределено, ДатаЗапуска = Неопределено) Экспорт
// IMAPPS-25575 --
	// IMAPPS-25828 ++
	// Если Не  СделкиСВалютой = Неопределено Тогда 
	//	ВалютныеСделки =  СделкиСВалютой
	// КонецЕсли;
	// IMAPPS-25828 ++
	ПараметрыЗадания = Новый Структура;
	ТекДата = КонецДня(ДатаНачала);
	Потоки = Новый ТаблицаЗначений;
	МассивЗаданий = Новый Массив;
	МассивАдресовВХранилище = Новый Массив;
	
	Пока ТекДата <= КонецДня(ДатаОкончания) Цикл
		
		ПререпроводитьАктивыСВалютой = Неопределено;
		Если ДатаЗапуска <> Неопределено
				И НачалоДня(ТекДата) = ДатаЗапуска
				И АктивыСВалютой Тогда
			ПререпроводитьАктивыСВалютой = Истина;
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("ПререпроводитьАктивыСВалютой", УровеньЖурналаРегистрации.Информация, , , ПререпроводитьАктивыСВалютой);
		
		ПараметрыЗадания.Вставить("ДатаНачала", НачалоДня(ТекДата)); 
		ПараметрыЗадания.Вставить("ДатаОкончания", КонецДня(ТекДата));
		
		// Многопоточное проведение сделок с ЦБ, задачи распределяются по грануле ПИФ, Актив         
		// IMAPPS-25828 ++
		// Потоки = РаспределитьЗадачиПоПотокам(СформироватьТекстЗапросаДляРаспределенияСделокСЦБ(),Истина);
		// IMAPPS-25575 ++
		// Потоки = РаспределитьЗадачиПоПотокам(СформироватьТекстЗапросаДляРаспределенияСделокСЦБ(СделкиСВалютой),Истина);
		Потоки = РаспределитьЗадачиПоПотокам(СформироватьТекстЗапросаДляРаспределенияСделокСЦБ(СделкиСВалютой, ПререпроводитьАктивыСВалютой), Истина);
		// IMAPPS-25575 --
		// IMAPPS-25828 --
		
		Для Сч = 0 по КоличествоПотоков - 1 Цикл
			Если Потоки[Сч].ТекущаяЗагрузка = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НаименованиеЗадания = "№ " + Строка(сч) + " Групповое перепроведение сделок цб за период с " + Формат(НачалоДня(ТекДата), "ДФ=dd.MM.yyyy") + " по " + Формат(КонецДня(ТекДата), "ДФ=dd.MM.yyyy");
			ПараметрыЗадания.Вставить("ТаблицаКлючей", Потоки[Сч].ТаблицаКлючей);
			ПараметрыЗадания.Вставить("Наименование", НаименованиеЗадания);
			// IMAPPS-25828 ++
			// ПараметрыЗадания.Вставить("ВалютныеСделки", ВалютныеСделки);
            Если СделкиСВалютой <> Неопределено Тогда
				ПараметрыЗадания.Вставить("ВалютныеСделки", СделкиСВалютой)
			КонецЕсли;
			// IMAPPS-25828 --
			// IMAPPS-25575 ++
			Если ПререпроводитьАктивыСВалютой <> Неопределено Тогда
				ПараметрыЗадания.Вставить("АктивыСВалютой", ПререпроводитьАктивыСВалютой)
			КонецЕсли;
			// IMAPPS-25575 --
			
			АдресВХранилище = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());
			ПараметрыЗадания.Вставить("АдресВХранилище", АдресВХранилище);
			МассивАдресовВХранилище.Добавить(АдресВХранилище);
			
			Сообщить("Старт задания");
			ПараметрыФоновогоЗадания = Новый Массив;
			ПараметрыФоновогоЗадания.Добавить(ПараметрыЗадания);
			
			Задание = ФоновыеЗадания.Выполнить("ВТБ_МодульФоновыхЗаданий.ПерепровестиСделкиЦБвПотоке"
			, ПараметрыФоновогоЗадания
			, Новый УникальныйИдентификатор
			, НаименованиеЗадания);
			
			МассивЗаданий.Добавить(Задание.УникальныйИдентификатор);
		КонецЦикла;
		//
		ЛогПерепроведенияСделкиЦБ = ОжидатьВыполненияЗаданий(МассивЗаданий);
		
		// Многопоточное проведение остальных документов. Задачи распределяются по грануле ПИФ
		Потоки.Очистить();
		МассивЗаданий.Очистить();
		
		// IMAPPS-25828 ++
		// Потоки = РаспределитьЗадачиПоПотокам(СформироватьТекстЗапросаДляРаспределенияДокументов58(), Ложь,СделкиСВалютой);
		// IMAPPS-25575 ++
		// Потоки = РаспределитьЗадачиПоПотокам(СформироватьТекстЗапросаДляРаспределенияДокументов58(СделкиСВалютой), Ложь,СделкиСВалютой);
		Потоки = РаспределитьЗадачиПоПотокам(СформироватьТекстЗапросаДляРаспределенияДокументов58(СделкиСВалютой, ПререпроводитьАктивыСВалютой), Ложь, СделкиСВалютой);
		// IMAPPS-25575 --
		// IMAPPS-25828 --
		Для Сч = 0 по КоличествоПотоков - 1 Цикл
			Если Потоки[Сч].ТекущаяЗагрузка = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НаименованиеЗадания = "№ " + Строка(сч) + " Групповое перепроведение документов счета 58 за период с " + Формат(НачалоДня(ТекДата), "ДФ=dd.MM.yyyy") + " по " + Формат(КонецДня(ТекДата), "ДФ=dd.MM.yyyy");
			ПараметрыЗадания.Вставить("ТаблицаКлючей", Потоки[Сч].ТаблицаКлючей);
			ПараметрыЗадания.Вставить("Наименование", НаименованиеЗадания); 
			// IMAPPS-25828 ++
			// ПараметрыЗадания.Вставить("ВалютныеСделки", ВалютныеСделки);
            Если СделкиСВалютой <> Неопределено Тогда
				ПараметрыЗадания.Вставить("ВалютныеСделки", СделкиСВалютой)
			КонецЕсли;
			// IMAPPS-25828 --
			// IMAPPS-25575 ++
			Если ПререпроводитьАктивыСВалютой <> Неопределено Тогда
				ПараметрыЗадания.Вставить("АктивыСВалютой", ПререпроводитьАктивыСВалютой)
			КонецЕсли;
			// IMAPPS-25575 --
			
			АдресВХранилище = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());
			ПараметрыЗадания.Вставить("АдресВХранилище", АдресВХранилище);
			МассивАдресовВХранилище.Добавить(АдресВХранилище);
			
			Сообщить("Старт задания");
			ПараметрыФоновогоЗадания = Новый Массив;
			ПараметрыФоновогоЗадания.Добавить(ПараметрыЗадания);
			Задание = ФоновыеЗадания.Выполнить("ВТБ_МодульФоновыхЗаданий.ПерепровестиДокументы58вПотоке"
			, ПараметрыФоновогоЗадания
			, Новый УникальныйИдентификатор
			, НаименованиеЗадания);
			
			МассивЗаданий.Добавить(Задание.УникальныйИдентификатор);
		КонецЦикла;
		
		ЛогПерепроведенияОстальныеДокументы = ОжидатьВыполненияЗаданий(МассивЗаданий);
		
		ТекДата = КонецДня(ТекДата + 24 * 60 * 60); 
		Потоки.Очистить();
		МассивЗаданий.Очистить();
	КонецЦикла;	
	
	ЛогПерепроведенияОбщий = Новый ТаблицаЗначений;
	ЛогПерепроведенияОбщий.Колонки.Добавить("Дата");
	ЛогПерепроведенияОбщий.Колонки.Добавить("ПредставлениеСсылки");
	ЛогПерепроведенияОбщий.Колонки.Добавить("СтрокаОшибок");
	ЕстьОшибки = Ложь;
	Для Каждого ТекАдрес ИЗ МассивАдресовВХранилище Цикл
		ЛогПерепроведения = ПолучитьИзВременногоХранилища(ТекАдрес);
		Если ТипЗнч(ЛогПерепроведения) = Тип("ТаблицаЗначений") Тогда
			Для Каждого ТекСтрокаЛога Из ЛогПерепроведения Цикл
				НоваяСтрокаЛога = ЛогПерепроведенияОбщий.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаЛога, ТекСтрокаЛога);
				Если НЕ ЕстьОшибки И НЕ ПустаяСтрока(ТекСтрокаЛога.СтрокаОшибок) Тогда
					ЕстьОшибки = Истина;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;
	
	ЛогПерепроведенияОбщий.Сортировать("Дата");
	Возврат ЛогПерепроведенияОбщий;
КонецФункции

Процедура ФоноваяОбработка() Экспорт
	//ПрочитатьНастройки();
		
КонецПроцедуры 


#КонецОбласти 


#Область ДополнительныеОтчетыИОбработки

Функция СведенияОВнешнейОбработке() Экспорт
	
	МетаОбъект = ЭтотОбъект.Метаданные();
	 
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();		
	ПараметрыРегистрации.Наименование = МетаОбъект.Синоним;
	ПараметрыРегистрации.Версия = "1.06";	
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Информация = МетаОбъект.Комментарий;
	//ПараметрыРегистрации.ВерсияКонфигурации = "1.1.6.3";		
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = МетаОбъект.Синоним;	
	Команда.Идентификатор = МетаОбъект.Имя;	
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ВариантЗапускаОткрытиеФормы();		
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = "Фоновое перепроведение по 58 счету";	
	Команда.Идентификатор = "ФоновоеПерепроведение58";	
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ВариантЗапускаВызовСерверногоМетода();		
		
	Возврат ПараметрыРегистрации;
    
КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ЭтотОбъект.ПараметрыОбработки = ПараметрыВыполненияКоманды;
	Если ИдентификаторКоманды = "ФоновоеПерепроведение58" Тогда
		ФоноваяОбработка();		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область ФоновоеЗадание_ГрупповоеПроведение

Функция ПолучитьРегламентноеЗадание(Знач Идентификатор) 
	
	Если ТипЗнч(Идентификатор) = Тип("РегламентноеЗадание") Тогда
		Идентификатор = Идентификатор.УникальныйИдентификатор;
	КонецЕсли;
	
	Если ТипЗнч(Идентификатор) = Тип("Строка") Тогда
		Идентификатор = Новый УникальныйИдентификатор(Идентификатор);
	КонецЕсли;
	
	Если ТипЗнч(Идентификатор) = Тип("ОбъектМетаданных") Тогда
		РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Идентификатор);
	Иначе
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	КонецЕсли;
	
	Если РегламентноеЗадание = Неопределено Тогда
		ВызватьИсключение( НСтр("ru = 'Регламентное задание не найдено.
		                              |Возможно, оно удалено другим пользователем.'") );
	КонецЕсли;
	
	Возврат РегламентноеЗадание;
	
КонецФункции

Функция ИдентификаторРегламентногоЗаданияПроведения()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ПроведениеДокументовРегламентное); 
	
	ИдентификаторРегламентногоЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор)[0].УникальныйИдентификатор;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ИдентификаторРегламентногоЗадания;
	
КонецФункции

#КонецОбласти 

