
Процедура Заполнить() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Уведомление.Ссылка КАК ДокументУведомления,
	|	Уведомление.ЦеннаяБумага1 КАК ЦеннаяБумага,
	|	Уведомление.ДокументОснование.СчетДЕПО КАК СчетДепоМХ
	|ПОМЕСТИТЬ втЦенныеБумаги
	|ИЗ
	|	Документ.УведомлениеКлиентам КАК Уведомление
	|ГДЕ
	|	НЕ Уведомление.ПометкаУдаления
	|	И Уведомление.ВидКД.Код В(&ВидыКД)
	|	И Уведомление.ФормаСообщенияКК В (&ОПроведенииКД_CвязанногоСВыплатой)
	|	И Уведомление.Статус = &Отправлено
	|	И (Уведомление.ДатаФиксации = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ Уведомление.ДатаФиксации > &ДатаОстатков)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.СчетДепо.Владелец КАК Клиент,
	|	Договоры.Ссылка КАК Договор,
	|	Остатки.СчетДепо КАК СчетДепо,
	|	Остатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	Остатки.ЦБ КАК ЦеннаяБумага,
	|	Остатки.КоличествоОстаток КАК Количество,
	|	КодыЗагрузкиКлиента.Код КАК ClientId,
	|	ЦенныеБумаги.ДокументУведомления КАК ДокументУведомления
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&ДатаОстатков,
	|			СчетДепо.Владелец.Субброкер
	|				И РазделСчетаДепо.РазделСубклиента) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО Остатки.СчетДепо.Владелец = Договоры.Владелец
	|			И Остатки.СчетДепо.Владелец.Код = Договоры.Код
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиКлиента
	|		ПО Остатки.СчетДепо.Владелец = КодыЗагрузкиКлиента.Владелец
	|			И (НЕ КодыЗагрузкиКлиента.ПометкаУдаления)
	|			И ((ВЫРАЗИТЬ(КодыЗагрузкиКлиента.Биржа КАК Справочник.КлассификаторыЗагрузки)) = &КлассификаторыЗагрузкиКлиенты)
	|			И (КодыЗагрузкиКлиента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузкиКлиента.ДатаОкончанияДействия > &ДатаОстатков)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЦенныеБумаги КАК ЦенныеБумаги
	|		ПО (ЦенныеБумаги.ЦеннаяБумага = Остатки.ЦБ)
	|			И (ЦенныеБумаги.СчетДепоМХ = Остатки.СчетДепоМХ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК ОтправленныеУведомления
	|		ПО ((ВЫРАЗИТЬ(ОтправленныеУведомления.КД КАК Документ.УведомлениеКлиентам)) = ЦенныеБумаги.ДокументУведомления)
	|			И (ОтправленныеУведомления.Клиент = Остатки.СчетДепо.Владелец)
	|			И (ОтправленныеУведомления.Договор = Договоры.Ссылка)
	|			И (ОтправленныеУведомления.СчетДепо = Остатки.СчетДепо)
	|			И (ОтправленныеУведомления.РазделСчетаДепо = Остатки.РазделСчетаДепо)
	|			И (ОтправленныеУведомления.ЦеннаяБумага = ЦенныеБумаги.ЦеннаяБумага)
	|			И (ОтправленныеУведомления.Количество > 0)
	|ГДЕ
	|	ОтправленныеУведомления.Клиент ЕСТЬ NULL ");
	ВидыКД = Новый Массив;
	ВидыКД.Добавить("DVCA");
	ВидыКД.Добавить("INTR");
	
	Запрос.УстановитьПараметр("ВидыКД", ВидыКД);

	ОПроведенииКДСвязанногоСВыплатой = Новый Массив;
	ОПроведенииКДСвязанногоСВыплатой.Добавить(Перечисления.ФормыСообщенийКК.ОПроведенииКД_CвязанногоСВыплатой);
	ОПроведенииКДСвязанногоСВыплатой.Добавить(Перечисления.ФормыСообщенийКК.ОПроведенииКД_CвязанногоСВыплатой_PRED_REDM_MCAL_others);
	ОПроведенииКДСвязанногоСВыплатой.Добавить(Перечисления.ФормыСообщенийКК.ОПроведенииКД_CвязанногоСВыплатой_INTR_PRII);
	
	Запрос.УстановитьПараметр("ОПроведенииКД_CвязанногоСВыплатой", ОПроведенииКДСвязанногоСВыплатой);
	Запрос.УстановитьПараметр("Отправлено", Перечисления.СтатусыУведомленийКлиентам.Отправлено);	
	Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КлассификаторыЗагрузкиКлиенты", Справочники.КлассификаторыЗагрузки.Клиенты);
	Субброкеры.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

Процедура Отправить() Экспорт
	ДокументыУведомления = Субброкеры.Выгрузить(, "ДокументУведомления");
	ДокументыУведомления.Свернуть("ДокументУведомления");
	Для Каждого СтрокаУведомления Из ДокументыУведомления Цикл
		Отбор = Новый Структура("ДокументУведомления", СтрокаУведомления.ДокументУведомления);
		СтрокиСубброкера = Субброкеры.НайтиСтроки(Отбор);
		Клиенты = Субброкеры.ВыгрузитьКолонки();
		Для Каждого СтрокаСубброкера Из СтрокиСубброкера Цикл
			НоваяСтрока = Клиенты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСубброкера);
		КонецЦикла;
		
		ДокОбъект = СтрокаУведомления.ДокументУведомления.ПолучитьОбъект();
		ДокОбъект.ДоотправитьУведомлениеСубброкерам(Клиенты);
	КонецЦикла;
КонецПроцедуры

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
