
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Макет	= Справочники.Валюты.ПолучитьМакет("КлассификаторВалют");
	Макет.Параметры.Расшифровка = Истина; // чтобы работала расшифровка

	ТабличныйДокумент = ПолеТабличногоДокумента;

	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Макет);

	ТабличныйДокумент.ФиксацияСверху = ТабличныйДокумент.Области.ОбластьРасшифровки.Верх - 1;

	ТабличныйДокумент.ОтображатьЗаголовки	= Ложь;
	ТабличныйДокумент.ОтображатьСетку		= Ложь;
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте                                                                               
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Получение значений полей выбранной строки.
	
	ТабличныйДокумент	= ПолеТабличногоДокумента;
	ТекущаяОбласть		= ТабличныйДокумент.ТекущаяОбласть;
	
	ОбластьКодЧисловой			= ТабличныйДокумент.Области.КодЧисловой;
	ОбластьНаименованиеКраткое	= ТабличныйДокумент.Области.НаименованиеКраткое;
	ОбластьНаименованиеПолное	= ТабличныйДокумент.Области.НаименованиеПолное;
	
	КодЧисловой			= ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьКодЧисловой.        Лево, ТекущаяОбласть.Низ, ОбластьКодЧисловой.        Право).Текст;
	НаименованиеКраткое	= ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеКраткое.Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеКраткое.Право).Текст;
	НаименованиеПолное	= ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеПолное. Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеПолное. Право).Текст;
	
	//// Проверка наличия выбранной валюты.
	
	Ссылка = ВалютаПоКоду(КодЧисловой);
	
	Если НЕ Ссылка.Пустая() Тогда
		Вопрос = "В справочнике ""Валюты"" уже существует элемент с кодом """ + КодЧисловой + """! Открыть существующий?";
		Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена, );
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ОткрытьЗначение(Ссылка);
			Возврат;
			
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("Код"					, КодЧисловой);
	ДанныеЗаполнения.Вставить("Наименование"		, НаименованиеКраткое);
	ДанныеЗаполнения.Вставить("НаименованиеПолное"	, НаименованиеПолное);
	
	
	ФормаНовойВалюты	= ПолучитьФорму("Справочник.Валюты.ФормаОбъекта");
	ОбъектНовойВалюты	= ФормаНовойВалюты.Объект;
	ЗаполнитьНовуюВалюту(ОбъектНовойВалюты, ДанныеЗаполнения);
	КопироватьДанныеФормы(ОбъектНовойВалюты, ФормаНовойВалюты.Объект);
	ФормаНовойВалюты.Модифицированность = Истина;
	ФормаНовойВалюты.Открыть();
	
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВалютаПоКоду(КодЧисловой)
	
	Возврат Справочники.Валюты.НайтиПоКоду(КодЧисловой);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьНовуюВалюту(ОбъектФормы, ДанныеЗаполнения)
	СправочникОбъект = ДанныеФормыВЗначение(ОбъектФормы, Тип("СправочникОбъект.Валюты"));
	ЗаполнитьЗначенияСвойств(СправочникОбъект, ДанныеЗаполнения);
	ЗначениеВДанныеФормы(СправочникОбъект, ОбъектФормы);
КонецПроцедуры

//#КонецОбласти