Процедура ДобавитьКорпоративноеДействие(КД, Отказ) Экспорт
	ОбработатьКорпоративноеДействие(Истина, КД, Отказ);
КонецПроцедуры

Процедура УдалитьКорпоративноеДействие(КД, Отказ) Экспорт
	ОбработатьКорпоративноеДействие(Ложь, КД, Отказ);
КонецПроцедуры

	
Процедура ОбработатьКорпоративноеДействие(ЭтоКомандаЗаписать, КД, Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КД) ИЛИ ТипЗнч(КД) <> Тип("ДокументСсылка.КорпоративноеДействие_Новый") Тогда
		Возврат;
	КонецЕсли;
			
	НачатьТранзакцию();
	МенеджерЗаписи = РегистрыСведений.ДокументыДляФормированияУведомлений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = КД;
	
	Попытка
		Если ЭтоКомандаЗаписать Тогда
			МенеджерЗаписи.Записать(Истина);
		Иначе
			МенеджерЗаписи.Удалить();
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось %Действие% документ %Ссылка% %ВСписок% для формирования уведомлений клиентам по причине: %Причина%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Действие%", ?(ЭтоКомандаЗаписать, "добавить", "удалить"));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВСписок%", ?(ЭтоКомандаЗаписать, "в список", "из списка"));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", КД);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации("Обработка списка документов для формирования уведомлений", УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Документы.КорпоративноеДействие_Новый, КД, ТекстСообщения);
		Отказ = Истина;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	
КонецПроцедуры
