
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.Организация = Константы.ОрганизацияПоУмолчанию.Получить();
	Отчет.ПолучатьЦеныИзBQ = Ложь;
	Элементы.ПолучатьЦеныИзBQ.Видимость = РольДоступна("ПолныеПраваДляDEV");
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОчиститьОтчет();
КонецПроцедуры


&НаКлиенте
Процедура ОтчетныйПериодПриИзменении(Элемент)
	ОчиститьОтчет();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетСервер();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьXML(Команда)
	Перем ПроверкиУспешны;
	
	СформироватьНаСервереXML(ПроверкиУспешны);
	
	Если Не ПроверкиУспешны Тогда
		ТекстСообщения = "Невозможно сформировать файл xml, так как не все данные заполнены в отчете - см. закладку ""Найденные ошибки""";
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРыночныеЦены(Команда)
	ПоказатьРыночныеЦеныНаКлиенте();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчетСервер()
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Отчет.ОписаниеОшибок = "";
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ПолучитьДанные();
	
	Макет = ОтчетОбъект.ПолучитьМакет("МакетРаздела_2");
	ТабДок_2 = РегуляторнаяОтчетность.ЗаполненныйДаннымиМакетПодраздела(Макет, ОтчетОбъект.ДанныеРаздела_2);
	
	ЗначениеВРеквизитФормы(ОтчетОбъект, "Отчет");
	Элементы.ФормаСохранитьXML.Доступность = Истина;
	
	Элементы.НайденныеОшибки.Видимость = Не ПустаяСтрока(Отчет.ОписаниеОшибок);
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("РегуляторнаяОтчетностьПоФорме0409404_Формирование", ВремяНачалаЗамера);
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервереXML(ПроверкиУспешны)
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ВыгрузитьВXML(Отчет.ОписаниеОшибок, ПроверкиУспешны);
	
	Элементы.НайденныеОшибки.Видимость = Не ПустаяСтрока(Отчет.ОписаниеОшибок);
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("РегуляторнаяОтчетностьПоФорме0409404_ВыгрузкаВXML", ВремяНачалаЗамера);
КонецПроцедуры

&НаСервере
Процедура ОчиститьОтчет()
	ТабДок_2.Очистить();
	Отчет.ОписаниеОшибок = "";
	Элементы.ФормаСохранитьXML.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРыночныеЦеныНаКлиенте()
	
	ОтборПоПериоду = Новый Структура("Период", Отчет.ОтчетныйПериод);
	ПараметрыФормыРегистра = Новый Структура("Отбор", ОтборПоПериоду);
	ОткрытьФорму("РегистрСведений.РыночныеЦеныЦенныхБумаг.ФормаСписка", ПараметрыФормыРегистра, ЭтотОбъект, Отчет.ОтчетныйПериод);
	
КонецПроцедуры

#КонецОбласти