
// Добавляет в регистр документ, по которому требуется начислить услугу
//
// Параметры:
//  Документ - ДокументСсылка.Поручение, СправочникСсылка.ФормыW8
//
Процедура Добавить(Документ) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ДокументыКНачислениюКомиссииДепо.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Удаляет из регистра  запись с документом, по которому не требуется начислять услугу
//
// Параметры:
//  Документ - ДокументСсылка.Поручение, СправочникСсылка.ФормыW8
//
Процедура Удалить(Документ) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ДокументыКНачислениюКомиссииДепо.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры

// Возвращает необходимость начисления комиссии по документу
//
// Параметры:
//  Документ - ДокументСсылка.Поручение, СправочникСсылка.ФормыW8
// 
// Возвращаемое значение:
//  Булево - необходимость начисления комиссии по наличию записи в регистре
//
Функция НеобходимоНачислитьКомиссию(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКНачислениюКомиссииДепо.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.ДокументыКНачислениюКомиссииДепо КАК ДокументыКНачислениюКомиссииДепо
	|ГДЕ
	|	ДокументыКНачислениюКомиссииДепо.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// Добавляет или удаляет запись из регистра, в зависимости от значения, которое необходимо установить
//
// Параметры:
//  Документ - ДокументСсылка.Поручение, СправочникСсылка.ФормыW8
//  Значение - Булево - Признак необходимости начисления комиссии
//
Процедура УстановитьЗначение(Документ, Значение) Экспорт
	
	Если Значение = Истина Тогда
		Добавить(Документ);
	Иначе
		Удалить(Документ);
	КонецЕсли;
	
КонецПроцедуры