#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Депонент) И Объект.Депонент.Субброкер Тогда
		ДобавитьКомандуОтправкиОтчетаПоСчетуДепо();
	КонецЕсли;
	
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
	УстановитьВидимостьИДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	УстановитьВидимостьИДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура СчетДепоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура("Владелец", Объект.Депонент);
	мПараметры = Новый Структура("Отбор", ПараметрыОтбора);
	ОткрытьФорму("Справочник.СчетаДепо.ФормаВыбора", мПараметры, Элементы.СчетДепо);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьКомандуОтправкиОтчетаПоСчетуДепо()
	
	ИмяКнопки = "ОтправитьОтчетПоСчетуДепоВФорматеXLS";
	КомандаФормы = Команды.Добавить(ИмяКнопки);
	КомандаФормы.Действие = ИмяКнопки;
	
	КнопкаОтправки = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), КоманднаяПанель);
	КнопкаОтправки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КнопкаОтправки.Заголовок = "Отправить отчет по счету депо";
	КнопкаОтправки.ИмяКоманды = ИмяКнопки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтчетПоСчетуДепоВФорматеXLS()
	
	ОтправитьОтчетПоСчетуСубброкераВФорматеXLSНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьОтчетПоСчетуСубброкераВФорматеXLSНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Поручения = Новый ТаблицаЗначений;
		Поручения.Колонки.Добавить("Поручение", Новый ОписаниеТипов("ДокументСсылка.Поручение"));
		Поручения.Колонки.Добавить("ВнешнийИсточникДляРСВПоСубклиентам", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВнешниеИсточники"));
		
		Строка = Поручения.Добавить();
		Строка.Поручение = Объект.ДокументОснование;
		Строка.ВнешнийИсточникДляРСВПоСубклиентам = Объект.Депонент.ВнешнийИсточникДляРСВПоСубклиентам;
				
		СформироватьИОтправитьОтчеты(Поручения, НачалоДня(Объект.ДокументОснование.ДатаКонПериода));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьИОтправитьОтчеты(Поручения, ДатаОтчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Поручения", Поручения);
	Запрос.Текст = ТекстЗапросаДляВыборкиВыписок();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТаблицаОтчетов = ТаблицаОтчетовВыпискаОбОперацияхПоСчетамДепо(Выборка);

		Если ТаблицаОтчетов = Неопределено Тогда
			Текст = "Данные для формирования отчета не обнаружены. "
					+ СокрЛП(Выборка.ВладелецСчета) + " за " + Формат(Выборка.ДатаОтчета, "ДФ=dd.MM.yyyy");
			ОбщегоНазначения.СообщитьОбОшибке(Текст);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.ВнешнийИсточникДляРСВПоСубклиентам) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не заполнен ВнешнийИсточникДляРСВПоСубклиентам " + СокрЛП(Выборка.ВладелецСчета));	// BSLLS:Typo-off
		Иначе
			СведенияДляОтправки = Новый Структура("ТаблицаОтчетов, СчетДепо, ДатаОтчета, ВнешнийИсточникДляРСВПоСубклиентам");	// BSLLS:Typo-off
			СведенияДляОтправки.ТаблицаОтчетов = ТаблицаОтчетов;
			СведенияДляОтправки.СчетДепо = Выборка.СчетДепо;
			СведенияДляОтправки.ДатаОтчета = ДатаОтчета;
			СведенияДляОтправки.ВнешнийИсточникДляРСВПоСубклиентам = Выборка.ВнешнийИсточникДляРСВПоСубклиентам;	// BSLLS:Typo-off
			
			ОтправитьОтчетыВФорматXLS(СведенияДляОтправки);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ТекстЗапросаДляВыборкиВыписок()
	
	Возврат "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзПоручения.Поручение КАК Документ.Поручение) КАК Поручение,
	|	тзПоручения.ВнешнийИсточникДляРСВПоСубклиентам КАК ВнешнийИсточникДляРСВПоСубклиентам
	|ПОМЕСТИТЬ втПоручения
	|ИЗ
	|	&Поручения КАК тзПоручения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПоручения.Поручение КАК Поручение,
	|	втПоручения.Поручение.ДатаНачПериода КАК ДатаНачПериода,
	|	втПоручения.Поручение.ДатаКонПериода КАК ДатаКонПериода,
	|	втПоручения.ВнешнийИсточникДляРСВПоСубклиентам КАК ВнешнийИсточникДляРСВПоСубклиентам,
	|	ДокВыписка.Ссылка КАК Выписка,
	|	ДокВыписка.МХУведомление КАК МХУведомление,
	|	ДокВыписка.ВладелецСчета как ВладелецСчета,
	|	ДокВыписка.СчетДепо как СчетДепо,
	|	ДокВыписка.ЦБУведомление как ЦБУведомление,
	|	ДокВыписка.ЭмитентУведомление как ЭмитентУведомление
	|ИЗ
	|	втПоручения КАК втПоручения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка КАК ДокВыписка
	|		ПО втПоручения.Поручение = ДокВыписка.ДокументОснование";
	
КонецФункции

&НаСервере
Функция ТаблицаОтчетовВыпискаОбОперацияхПоСчетамДепо(Выборка)
	
	ВыпискаОбОперациях = Отчеты.ВыпискаОбОперацияхСчетамДепо_Новая.Создать();
	ВыпискаОбОперациях.НачПериода = Выборка.ДатаНачПериода;
	ВыпискаОбОперациях.КонПериода = Выборка.ДатаКонПериода;
	ВыпискаОбОперациях.Выписка = Истина;
	ВыпискаОбОперациях.Документооборот = Истина;
	ВыпискаОбОперациях.ВыпискаДокумент = Выборка.Выписка;
	ВыпискаОбОперациях.МХОтбор = Выборка.МХУведомление;
	ВыпискаОбОперациях.МХПоУмолчанию = Ложь;
	ВыпискаОбОперациях.ВидОтчета.Добавить(Перечисления.ВидыОтчетов.ОтчетОбОперацияхПоСчетуДЕПО);
	ВыпискаОбОперациях.ВыводитьФаксимилеВОтчетах = Истина;
	
	ОтборыОтчета = Новый Структура("Клиенты,СчетаДепо", Выборка.ВладелецСчета, Выборка.СчетДепо);
	Для Каждого ЭлементОтбора Из ОтборыОтчета Цикл
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ВыпискаОбОперациях.КомпоновщикНастроек.Настройки.Отбор,
																ЭлементОтбора.Ключ, ВидСравненияКомпоновкиДанных.Равно, ЭлементОтбора.Значение);
	КонецЦикла;
	ОтборыОтчета = Новый Структура("Эмитенты,ЦенныеБумаги", Справочники.Контрагенты.ПустаяСсылка(), Справочники.ЦенныеБумаги.ПустаяСсылка());
	Для Каждого ЭлементОтбора Из ОтборыОтчета Цикл
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ВыпискаОбОперациях.КомпоновщикНастроек.Настройки.Отбор,
																ЭлементОтбора.Ключ, ВидСравненияКомпоновкиДанных.Равно, ЭлементОтбора.Значение, , Ложь);
	КонецЦикла;														
	
	ТаблицаОтчетов = ВыпискаОбОперациях.ПолучитьПечатныеФормы();

	Если ТаблицаОтчетов <> Неопределено Тогда
		Для Каждого Строка Из ТаблицаОтчетов Цикл
			НовыйДляЭДО	= ВыпискаОбОперациях.ДокументыКЭДО.Добавить();
			НовыйДляЭДО.Клиент			= Строка.Клиент;
			НовыйДляЭДО.СчетДепо		= Строка.СчетДепо;
			НовыйДляЭДО.Основание		= Строка.Основание;
			НовыйДляЭДО.Документ		= Строка.Основание;
			НовыйДляЭДО.АдресТаблицы	= ПоместитьВоВременноеХранилище(Строка.ТабличныйДокумент);
			НовыйДляЭДО.ActionType		= "INS";
		КонецЦикла;
		
		ВыпискаОбОперациях.ПоместитьОтчетыВЭдо();
	КонецЕсли;
	
	Возврат ТаблицаОтчетов;

КонецФункции

&НаСервере
Процедура ОтправитьОтчетыВФорматXLS(СведенияДляОтправки)
	
	ТекстПисьма = "Отчет об операциях по счету ДЕПО " + СокрЛП(СведенияДляОтправки.СчетДепо)
					+ " за " + Формат(СведенияДляОтправки.ДатаОтчета, "ДФ=dd.MM.yyyy");
	
	Для Каждого Строка Из СведенияДляОтправки.ТаблицаОтчетов Цикл
		ИмяФайлОтчета = ПолучитьИмяВременногоФайла("XLS");
		Строка.ТабличныйДокумент.Записать(ИмяФайлОтчета, ТипФайлаТабличногоДокумента.XLS);
		
		СписокВложений = Новый Соответствие;
		СписокВложений.Вставить(ТекстПисьма + ".xls", Новый ДвоичныеДанные(ИмяФайлОтчета));
	
		Попытка
			УдалитьФайлы(ИмяФайлОтчета);
		Исключение
			ИмяСобытия = "Отправка выписки по счету ДЕПО в формате XLS";
			СообщениеВЖурнал = "Не удалось удалить файл " + ИмяФайлОтчета + " после отправки";
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , СообщениеВЖурнал);
		КонецПопытки;
	КонецЦикла;
	
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(СведенияДляОтправки.ВнешнийИсточникДляРСВПоСубклиентам).Настройка;
		
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("Вложения",			СписокВложений);
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			"Отчет об операциях по счету");
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементов()
	Элементы.ПоСостояниюНа.Видимость = Документы.Поручение.ЭтоПериодическиеВыпискиОСостоянииСчетаДЕПО(Объект.ДокументОснование);
КонецПроцедуры

#КонецОбласти