
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ДатаС) Тогда
		ДатаС = ДобавитьМесяц(ТекущаяДата(),-1);
	КонецЕсли;
	Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
	
	ОбновитьСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхЗаполнятьПриИзменении(Элемент)
	
	ПересчетИтогов();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда = Неопределено)
	
	ОбновитьСервер();
	ПересчетИтогов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетИтогов()
	
	ВсегоОбъектов = 0;
	Для Каждого СтрокаТаблицы Из ОбъектыМетаданных Цикл
		Если СтрокаТаблицы.Заполнять Тогда
			ВсегоОбъектов = ВсегоОбъектов + СтрокаТаблицы.ЧислоОбъектов;
		КонецЕсли;
	КонецЦикла;
	Элементы.ОбъектыМетаданныхЧислоОбъектов.ТекстПодвала = Строка(ВсегоОбъектов);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиВерсионированияОбъектов.ТипОбъекта,
	|	НастройкиВерсионированияОбъектов.Вариант КАК ВариантВерсионирования
	|ИЗ
	|	РегистрСведений.НастройкиВерсионированияОбъектов КАК НастройкиВерсионированияОбъектов
	|ГДЕ
	|	НастройкиВерсионированияОбъектов.Использовать
	|	И НастройкиВерсионированияОбъектов.Вариант <> &ВариантИсключить";
	Запрос.УстановитьПараметр("ВариантИсключить",Перечисления.ВариантыВерсионированияОбъектов.НеВерсионировать);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗапросПодсчет = Новый Запрос;
	ЗапросПодсчет.Текст=
	"ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК ТипОбъекта,
	|	0 КАК ЧислоОбъектов";
	
	Пока Выборка.Следующий() Цикл
		Отбор = Новый Структура("ТипОбъекта",Выборка.ТипОбъекта);
		НайденныеСтроки = ОбъектыМетаданных.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаТаблицы = ОбъектыМетаданных.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Отбор);
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтрокаТаблицы.ТипОбъекта);
			СтрокаТаблицы.СинонимНаименованияОбъекта = МенеджерОбъекта.ПустаяСсылка().Метаданные().Представление();
			СтрокаТаблицы.Заполнять = Истина;
		Иначе
			СтрокаТаблицы = НайденныеСтроки[0];
		КонецЕсли;
		СтрокаТаблицы.ВариантВерсионирования = Выборка.ВариантВерсионирования;
		
		ПодсчетТип = Неопределено;
		Если Найти(СтрокаТаблицы.ТипОбъекта, "Справочник.")<>0 Тогда
			ПодсчетТип = "Справочник";
		ИначеЕсли Найти(СтрокаТаблицы.ТипОбъекта, "Документ.")<>0 Тогда
			ПодсчетТип = "Документ";
		КонецЕсли;

		Если ЗначениеЗаполнено(ПодсчетТип) Тогда
			Если Найти(СтрокаТаблицы.ТипОбъекта, "Справочник.") <> 0 Тогда
				Текст =
				"ОБЪЕДИНИТЬ ВСЕ
				|ВЫБРАТЬ
				|	""Справочник.Контрагенты"" КАК ТипОбъекта,
				|	СУММА(1) КАК ЧислоОбъектов
				|ИЗ
				|	Справочник.Контрагенты КАК Справочник
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
				|		ПО Справочник.Ссылка = ВерсииОбъектов.Объект
				|ГДЕ
				|	ВерсииОбъектов.Объект ЕСТЬ NULL";
				Текст = СтрЗаменить(Текст, "Справочник.Контрагенты", СтрокаТаблицы.ТипОбъекта);
				ЗапросПодсчет.Текст = ЗапросПодсчет.Текст + Символы.ПС + Текст;
			ИначеЕсли Найти(СтрокаТаблицы.ТипОбъекта, "Документ.") <> 0 Тогда
				Текст =
				"ОБЪЕДИНИТЬ ВСЕ
				|ВЫБРАТЬ
				|	""Документ.Поручение"" КАК ТипОбъекта,
				|	СУММА(1) КАК ЧислоОбъектов
				|ИЗ
				|	Документ.Поручение КАК Документ
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
				|		ПО Документ.Ссылка = ВерсииОбъектов.Объект
				|ГДЕ
				|	Документ.Дата >= &ДатаС
				|	И Документ.Проведен
				|	И ВерсииОбъектов.Объект ЕСТЬ NULL";
				Текст = СтрЗаменить(Текст, "Документ.Поручение", СтрокаТаблицы.ТипОбъекта);
				Если СтрокаТаблицы.ВариантВерсионирования = Перечисления.ВариантыВерсионированияОбъектов.ВерсионироватьПриЗаписи Тогда
					Текст = СтрЗаменить(Текст, "И Документ.Проведен", "");
				КонецЕсли;
				ЗапросПодсчет.Текст = ЗапросПодсчет.Текст + Символы.ПС + Текст;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	УдалитьСтроки = Новый Массив;
	Для каждого Строка Из ОбъектыМетаданных Цикл
		Выборка.Сбросить();
		Если НЕ Выборка.НайтиСледующий(Новый Структура("ТипОбъекта",Строка.ТипОбъекта)) Тогда
			УдалитьСтроки.Вставить(0,Строка);
		КонецЕсли;
	КонецЦикла;
	Для каждого Строка Из УдалитьСтроки Цикл
		ОбъектыМетаданных.Удалить(Строка);
	КонецЦикла;
	ОбъектыМетаданных.Сортировать("СинонимНаименованияОбъекта");
	
	ЗапросПодсчет.УстановитьПараметр("ДатаС",НачалоДня(ДатаС));
	ВыборкаПодсчет = ЗапросПодсчет.Выполнить().Выбрать();
	Для каждого СтрокаТаблицы Из ОбъектыМетаданных Цикл
		ВыборкаПодсчет.Сбросить();
		Если ВыборкаПодсчет.НайтиСледующий(Новый Структура("ТипОбъекта",СтрокаТаблицы.ТипОбъекта)) Тогда
			ЧислоОбъектов = ВыборкаПодсчет.ЧислоОбъектов;
		Иначе
			ЧислоОбъектов = 0;
		КонецЕсли;
		СтрокаТаблицы.ЧислоОбъектов = ЧислоОбъектов;
		СтрокаТаблицы.Заполнять = (СтрокаТаблицы.ЧислоОбъектов<>0);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачальныеВерсии(Команда)
	
	ЗаполнитьНачальныеВерсииСервер();
	ПодключитьОбработчикОжидания("ЗаданиеСтатусОбновить", 1, Истина);
	
КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьНачальныеВерсииСервер()
	
	ТаблицаОбъектов = РеквизитФормыВЗначение("ОбъектыМетаданных");
	ТаблицаОбъектов = ТаблицаОбъектов.Скопировать(Новый Структура("Заполнять", Истина));
	ТаблицаОбъектов.Колонки.Добавить("ДатаС",Новый ОписаниеТипов("Дата"));
	ТаблицаОбъектов.ЗаполнитьЗначения(ДатаС,"ДатаС");
	
	ПараметрыВызоваМассив = Новый Массив;
	ПараметрыВызова = Новый Структура("ТаблицаОбъектов", ТаблицаОбъектов);
	ПараметрыВызоваМассив.Добавить(ПараметрыВызова);
	Попытка
		Задание = ФоновыеЗадания.Выполнить("ВерсионированиеОбъектов.ВыполнитьНачальноеЗаполнениеИстории", ПараметрыВызоваМассив, , "Начальное заполнения версий объектов");
		ЗаданиеИд = Задание.УникальныйИдентификатор;
		Если Задание.ИнформацияОбОшибке <> Неопределено Тогда
			Сообщение = "Ошибка выполнения: " + ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
			Возврат;
		КонецЕсли;
	Исключение
		ВерсионированиеОбъектов.ВыполнитьНачальноеЗаполнениеИстории(ПараметрыВызова);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеСтатусОбновить() Экспорт
	Если ПустаяСтрока(ЗаданиеИд) Тогда
		Возврат;
	КонецЕсли;
	Статус = ЗаданиеСтатус(ЗаданиеИд);
	Состояние = Статус.Состояние;
	Если ЗначениеЗаполнено(Статус.Конец) Тогда
		ТочкаВремени = Статус.Конец;
	Иначе
		ТочкаВремени = ТекущаяДата();
	КонецЕсли;
	Время = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2сек (начало в %3)", Статус.Состояние, ТочкаВремени - Статус.Начало, Статус.Начало);
	Если Статус.Сообщение <> Неопределено Тогда
		Сообщение = Статус.Сообщение;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Статус.Конец) Тогда
		ПодключитьОбработчикОжидания("ЗаданиеСтатусОбновить", 1, Истина);
	Иначе
		ОбновитьСервер();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаданиеСтатус(знач ЗаданиеИд)
	Статус = Новый Структура("Состояние, Начало, Конец, Сообщение");
	Идентификатор = Новый УникальныйИдентификатор(ЗаданиеИд);
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	Если Задание = Неопределено Тогда
		ВызватьИсключение "Фоновое задание не найдено";
	КонецЕсли;
	Статус.Состояние = Строка(Задание.Состояние);
	Если Задание.ИнформацияОбОшибке <> Неопределено Тогда
		Статус.Сообщение = "Ошибка выполнения: " + ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
	КонецЕсли;
	Статус.Начало = Задание.Начало;
	Статус.Конец = Задание.Конец;
	Сообщения = Задание.ПолучитьСообщенияПользователю(Истина);
	Если Сообщения = Неопределено Тогда
		Сообщения = Новый Массив;
	ИначеЕсли Сообщения.Количество()>0 Тогда
		Статус.Сообщение = Сообщения[Сообщения.ВГраница()].Текст;
	КонецЕсли;
	Возврат Статус;
КонецФункции

&НаКлиенте
Процедура ЗаданиеПрервать(Команда)
	ЗаданиеПрерватьСервер();
	ЗаданиеСтатусОбновить();
КонецПроцедуры

&НаСервере
Процедура ЗаданиеПрерватьСервер()
	
	Идентификатор = Новый УникальныйИдентификатор(ЗаданиеИд);
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	Если Задание <> Неопределено Тогда
		Задание.Отменить();
	КонецЕсли;
	
КонецПроцедуры
 