
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПредФизЛицо = Запись.ФизЛицо;
	РегистрыСведений.ПаспортныеДанныеФизЛиц.УстановитьЗаголовокФормы(ЭтаФорма, Запись.ФизЛицо);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ФизическиеЛицаКлиент.ОповеститьПослеРедактирования(Запись.ФизЛицо, "УдостоверениеЛичности");
	Если ПредФизЛицо <> Запись.ФизЛицо Тогда
		ФизическиеЛицаКлиент.ОповеститьПослеРедактирования(ПредФизЛицо, "УдостоверениеЛичности");		
	КонецЕсли; 
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ТекДата = НачалоДня(ТекущаяДата());
	Если Запись.Период > ТекДата Тогда
		Ответ = Вопрос("Вы действительно хотите ввести данные" + 
		Символы.ПС + "об удостоверении личности физлица на будущую дату?"
		, РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Запись.Период = ТекДата;
		КонецЕсли;		
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	ФизЛицоПриИзмененииНаСервере();
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ФизЛицоПриИзмененииНаСервере()
	РегистрыСведений.ПаспортныеДанныеФизЛиц.УстановитьЗаголовокФормы(ЭтаФорма, Запись.ФизЛицо);
КонецПроцедуры

//#КонецОбласти
