#Область ПрограммныйИнтерфейс

// Процедура выполняет отправку в Кафка сообщения с вложенным файлом списка КД
//
Процедура ВыполнитьОтправку() Экспорт
	
	ТабличныйДокумент = ТабличныйДокументСпискаКД();
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ОтправкаСпискаКДвДепозитарииКлиентскиеЦБ;
	ПараметрыИсточника = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник);
	Email = ПараметрыИсточника.Настройка.АдресПолучателя;
	УИДСообщения = Строка(Новый УникальныйИдентификатор);
	ТекстJSON = СформироватьJSON(ТабличныйДокумент, Email, УИДСообщения);
	Топик = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaEmailGen;
	Сущность = "EmailGen";
	
	Попытка
		Кафка.ПоместитьСообщениеВРегистрКОтправке(Топик, Сущность, ТекстJSON, УИДСообщения);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ЗаписьЖурналаРегистрации("ОтправкаСпискаКДвДепозитарииКлиентскиеЦБ", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТабличныйДокументСпискаКД()
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("МакетСпискаКД");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорпоративноеДействие_Новый.Дата КАК Дата,
	|	КорпоративноеДействие_Новый.Ссылка КАК Ссылка,
	|	КорпоративноеДействие_Новый.КДРеференс КАК КДРеференс,
	|	КорпоративноеДействие_Новый.ВидКД КАК ВидКД,
	|	КорпоративноеДействие_Новый.СчетДЕПО КАК СчетДЕПО,
	|	КорпоративноеДействие_Новый.ДатаОкончанияПриемаИнструкцийНРД КАК ДатаОкончанияПриемаИнструкцийНРД,
	|	КорпоративноеДействие_Новый.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	|	КорпоративноеДействие_Новый.Эмитент КАК Эмитент,
	|	КорпоративноеДействие_Новый.ЦеннаяБумага1.ISIN КАК ЦеннаяБумага1ISIN,
	|	КорпоративноеДействие_Новый.ДатаФиксации КАК ДатаФиксации,
	|	КорпоративноеДействие_Новый.ДатаКДПлан КАК ДатаКДПлан,
	|	КорпоративноеДействие_Новый.ВыплатаНа1ЦБ КАК ВыплатаНа1ЦБ,
	|	КорпоративноеДействие_Новый.ВалютаПлатежа КАК ВалютаПлатежа
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый КАК КорпоративноеДействие_Новый
	|ГДЕ
	|	НЕ КорпоративноеДействие_Новый.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	КорпоративноеДействие_Новый.Дата,
	|	КорпоративноеДействие_Новый.Номер";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы.Параметры, Выборка);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция СформироватьJSON(ТабличныйДокумент, Email, УИДСообщения)
	
	FileData = ДанныеFileData(ТабличныйДокумент);
	
	file = Новый Структура("fileName, fileExt, fileBody");
	ЗаполнитьЗначенияСвойств(file, FileData);
	attachments = Новый Массив;
	attachments.Добавить(Новый Структура("file", file));
	
	Data = ДанныеData(attachments, Email);
	
	MessageInfo = ОбменДаннымиКафка.ТиповыеДанныеMessageInfo("EmailGen", "INS", "1.0.0", УИДСообщения);
	
	ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	Возврат ТекстJSON;
	
КонецФункции

Функция ДанныеFileData(ТабличныйДокумент)
	
	ФайлПриемник = ПолучитьИмяВременногоФайла("XLSX");
	ТабличныйДокумент.Записать(ФайлПриемник, ТипФайлаТабличногоДокумента.XLSX);
	ДанныеФайла = Новый ДвоичныеДанные(ФайлПриемник);
	FileBody = Base64Строка(ДанныеФайла);
	УдалитьФайлы(ФайлПриемник);
	
	FileData = Новый Структура;
	FileData.Вставить("FileName", ТемаПисьма());
	FileData.Вставить("FileExt", "XLSX");
	FileData.Вставить("FileBody", FileBody);
	
	Возврат FileData;
	
КонецФункции

Функция ДанныеData(attachments, Email)
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Email", Email);
	ДанныеДокумента.Вставить("MailTemplateId", Неопределено);
	ДанныеДокумента.Вставить("MailTemplateTitle", "ВнутренняяРассылкаОтчетовДепозитария");
	
	ReplaceFields = Новый Структура;
	ReplaceFields.Вставить("ЗаголовокСообщения", ТемаПисьма());
	
	ДанныеДокумента.Вставить("ReplaceFields", ReplaceFields);
	ДанныеДокумента.Вставить("Attachments", attachments);
	Возврат ДанныеДокумента;
	
КонецФункции

Функция ТемаПисьма()
	Возврат "Список КД в Депозитарии (клиентские ЦБ)";
КонецФункции

#КонецОбласти

#Область Инициализация

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);

#КонецОбласти