
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("Клиент") Тогда
		КлиентИзОтбора = Параметры.Отбор.Клиент;
	Иначе
		КлиентИзОтбора = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если ЗначениеЗаполнено(КлиентИзОтбора) Тогда
		Отказ = Истина;
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("Клиент", КлиентИзОтбора);
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ПараметрыЗаполнения);
		ОткрытьФорму("РегистрСведений.СчетаДляВыплатыКД.ФормаЗаписи", ПараметрыОткрытия, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

