
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("КодСША", "840");
	Список.Параметры.УстановитьЗначениеПараметра("ДепозитарнаяРасписка", Перечисления.ТипыЦБ.ДепозитарнаяРасписка);
	
	УстановитьУсловноеОформление();
		
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Дата = БизнесПроцессы.ОбработкаWTRCСообщения.ДатаСкорогоОкончанияПриемаИнструкцийНРД(ТекущаяДатаСеанса());
	
	Список.УсловноеОформление.Элементы.Очистить();
	Оформление = Список.УсловноеОформление.Элементы.Добавить();
	
	Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаОкончанияРаскрытия");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	Отбор.ПравоеЗначение = НачалоДня(Дата);
	Отбор.Использование = Истина;
	
	Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаОкончанияРаскрытия");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	Отбор.ПравоеЗначение = КонецДня(Дата);
	Отбор.Использование = Истина;
	
	Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦБПодпадаетПодНалоговоеРегулированиеСША");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Ложь;
	Отбор.Использование = Истина;
	
	ЦветФона = Оформление.Оформление.Элементы.Найти("ЦветФона");
	ЦветФона.Значение = WebЦвета.СветлоРозовый;
	ЦветФона.Использование = Истина;
	
КонецПроцедуры



