#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		// Должно обязательно отработать в обработчике даже в режиме загрузки, чтобы изменения были выгружены в бэкофис (BQ)
		РегистрацияИзмененийДляВыгрузки.ЗапомнитьОбъектыИзУдаляемыхЗаписей(ЭтотОбъект, Отказ, Замещение, "ЮридическоеЛицо");
			
		Возврат;
	КонецЕсли;

	ТекстШаблонаКомментария = "Изменено [%1] пользователем: %2";
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.Комментарий = СтрШаблон(ТекстШаблонаКомментария, ТекущаяДатаСеанса(), ПараметрыСеанса.ТекущийПользователь);
	КонецЦикла;
	
	РегистрацияИзмененийДляВыгрузки.ЗапомнитьОбъектыИзУдаляемыхЗаписей(ЭтотОбъект, Отказ, Замещение, "ЮридическоеЛицо");
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		// Должно обязательно отработать последним в обработчике
		РегистрацияИзмененийДляВыгрузки.ОтметитьИзмененияВРегистреСведений(ЭтотОбъект, Отказ, Замещение, "ЮридическоеЛицо");
		
		Возврат;
	КонецЕсли;
	
	// Должно обязательно отработать последним в обработчике
	РегистрацияИзмененийДляВыгрузки.ОтметитьИзмененияВРегистреСведений(ЭтотОбъект, Отказ, Замещение, "ЮридическоеЛицо");
КонецПроцедуры

#КонецОбласти