#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ПараметрыВладелец;
	Если Параметры.Свойство("ПараметрыВыбора",ПараметрыВладелец)  Тогда
		Если ПараметрыВладелец.Свойство("Владелец") Тогда
			Объект.Владелец = ПараметрыВладелец.Владелец;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьОтбор();
	УправлениеДоступностью(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаписатьНаборЗаписейНаСервере("Тарифы", "Услуга", ТекущийОбъект.Ссылка, Отказ);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УправлениеДоступностью(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипРасчетаПриИзменении(Элемент)
	УправлениеДоступностью(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРасчетаПриИзменении(Элемент)
	
	Если Объект.ПериодРасчета = ПредопределенноеЗначение("Перечисление.ВариантыНачисленияКомиссий.ПоПоручению") Тогда
		Объект.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаУслуги.ПустаяСсылка");
	КонецЕсли;
	УправлениеДоступностью(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура МестоХранения1ПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.МестоХранения1) И Объект.ОтборПоМХ.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеПредупрежденияОбОчисткеТЧ", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, "Табличная часть ""Отбор по МХ"" будет очищена");
	КонецЕсли;
	
	Элементы.ОтборПоМХ.Доступность = ЗначениеЗаполнено(Объект.МестоХранения1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПредупрежденияОбОчисткеТЧ(Параметры) Экспорт
	
	Объект.ОтборПоМХ.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТарифы


&НаКлиенте
Процедура ТарифыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.Тарифы.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			
			ТекущиеДанные.Период = ТекущаяДата();
			СтруктураТарифа = СтруктураТарифа(Объект.Ссылка);
			ТекущиеДанные.ТипТарифа  = СтруктураТарифа.ТипТарифа;
			ТекущиеДанные.Тариф      = СтруктураТарифа.Тариф;
			
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	Объект = Форма.Объект;
	ЭлементыФормы.ТипРасчета.Доступность = НЕ (Объект.ПериодРасчета = ПредопределенноеЗначение("Перечисление.ВариантыНачисленияКомиссий.ПоПоручению"));
	ЭлементыФормы.Тарифы.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	ЭлементыФормы.ОтборПоМХ.Доступность = ЗначениеЗаполнено(Объект.МестоХранения1);
	ЭлементыФормы.СтраницаОтборПоВидуЦБ.Видимость = ДоступенОтборПоВидуЦББанкаРоссии(Объект.ТипРасчета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураТарифа(Ссылка)
	
	Возврат  РегистрыСведений.Тарифы.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Услуга",Ссылка));
КонецФункции

&НаСервере
Процедура УстановитьОтбор()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		Набор = РеквизитФормыВЗначение("Тарифы");
		Набор.Отбор.Услуга.Установить(Объект.Ссылка);
		Набор.Прочитать();
		ЗначениеВРеквизитФормы(Набор, "Тарифы");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаборЗаписейНаСервере(ИмяЭлемента, ИмяПоля, ЗначениеОтбора, Отказ)
	
	Если Отказ Тогда
		Возврат;		
	КонецЕсли; 
	
	НаборЗначение = РеквизитФормыВЗначение(ИмяЭлемента);
	НаборЗначение.Отбор[ИмяПоля].Установить(ЗначениеОтбора);
	Для каждого ЗаписьНабора Из НаборЗначение Цикл
		ЗаписьНабора[ИмяПоля] = ЗначениеОтбора;		
	КонецЦикла; 
	
	Попытка
		НаборЗначение.Записать();
	Исключение
		МетаНабор = НаборЗначение.Метаданные();
		
		ОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки
			, Отказ
			, "Элемент """ + СокрЛП(ЗначениеОтбора) + """ не записан. Не записан набор "+ МетаНабор.Синоним +".");			
	КонецПопытки;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступенОтборПоВидуЦББанкаРоссии(ТипРасчета)
	Возврат РасчетТарифов.ДоступенОтборПоВидуЦББанкаРоссии(ТипРасчета);
КонецФункции


#КонецОбласти