Перем ПространствоИмен;

Функция ЭтоСписокXDTO(Элемент)
	Возврат ТипЗнч(Элемент)=Тип("СписокXDTO");
КонецФункции

Функция НовыйОбъектСхемыFCDR(ИмяТипа)
	Тип = ФабрикаXDTO.Тип(ПространствоИмен, ИмяТипа);
	Возврат ФабрикаXDTO.Создать(Тип);
КонецФункции
Функция НовыйОбъектСхемыFCDRИзСвойств(ИмяТипа,ИмяСвойства)
	Тип = ФабрикаXDTO.Тип(ПространствоИмен, ИмяТипа).Свойства.Получить(ИмяСвойства).Тип;
	Результат = ФабрикаXDTO.Создать(Тип);
	Возврат Результат;
КонецФункции

Функция НовыйРегистрационныеДанныеДля_party_identification2_V02_t(Идентификатор, ТипИдентификатора, ОписаниеТипаИдентификатораПрочее=Неопределено)
	Возврат Новый Структура("Идентификатор, ТипИдентификатора, ОписаниеТипаИдентификатораПрочее",Идентификатор, ТипИдентификатора, ОписаниеТипаИдентификатораПрочее);
КонецФункции
Функция НовыйИдентификаторыДля_id_V02_t(Идентификатор, ВладелецИдентификатораИлиСхема=Неопределено, ЗарегистрированSWIFT=Ложь)
	Возврат Новый Структура("Идентификатор, ВладелецИдентификатораИлиСхема, ЗарегистрированSWIFT", Идентификатор, ВладелецИдентификатораИлиСхема, ЗарегистрированSWIFT);	
КонецФункции

Функция НовыйДанныеДокументаДля_organization_document_t(ТипКода,НаименованиеТипа=Неопределено,Серия=Неопределено,Номер=Неопределено,СерияИНомер=Неопределено,Дата=Неопределено,ОрганРегистрации=Неопределено)
	Возврат Новый Структура("ТипКода,НаименованиеТипа,Серия,Номер,СерияИНомер,Дата,ОрганРегистрации, ДатаРегистрации",ТипКода,НаименованиеТипа,Серия,Номер,СерияИНомер,Дата,ОрганРегистрации);
КонецФункции
Функция НовыйДанныеДокументаДля_person_document_t(Тип,ОписаниеТипа=Неопределено,Серия=Неопределено,Номер=Неопределено,СерияИНомер=Неопределено,ДатаВыдачи=Неопределено,КемВыдан=Неопределено,МестоВыдачи=Неопределено)
	Возврат Новый Структура("Тип,ОписаниеТипа,Серия,Номер,СерияИНомер,ДатаВыдачи,КемВыдан,МестоВыдачи", Тип,ОписаниеТипа,Серия,Номер,СерияИНомер,ДатаВыдачи,КемВыдан,МестоВыдачи);
КонецФункции

Функция НовыйДанныеОбОрганизации(ЮрФизЛицо, ТипКодаДокумента,НомерДокумента,ДатаДокумента,РегистрирующийОрган, Страна, ДатаРегистрации, ДатаОснования = Неопределено)
	Возврат Новый Структура("ЮрФизЛицо, ТипКодаДокумента,НомерДокумента,ДатаДокумента,РегистрирующийОрган, Страна, ДатаРегистрации, ДатаОснования",ЮрФизЛицо, ТипКодаДокумента,НомерДокумента,ДатаДокумента,РегистрирующийОрган, Страна, ДатаРегистрации, ДатаОснования);
КонецФункции
Функция НовыйДанныеОФизЛице(ДокументТип, ДокументСерия,ДокументНомер,ДокументДатаВыдачи,ДокументКемВыдан, ДатаРождения,МестоРождения,Гражданство,ИНН = "")
	Возврат Новый Структура("ДокументТип, ДокументСерия,ДокументНомер,ДокументДатаВыдачи,ДокументКемВыдан, ДатаРождения,МестоРождения,Гражданство,ИНН",ДокументТип, ДокументСерия,ДокументНомер,ДокументДатаВыдачи,ДокументКемВыдан, ДатаРождения,МестоРождения,Гражданство,ИНН);
КонецФункции

Функция ЭтоПрочее(Значение)
	Возврат ВРЕГ(Значение)="OTHR";
КонецФункции

//ПРОСТЫЕ ТИПЫ
Функция date_t(Данные)
	Возврат Данные;
КонецФункции
Функция datetime_t(Данные)
	Возврат Данные;
КонецФункции

Функция string2(Данные)
	Возврат Данные;
КонецФункции
Функция string6(Данные)
	Возврат Данные;
КонецФункции
Функция string10(Данные)
	Возврат Данные;
КонецФункции
Функция string14(Данные)
	Возврат Данные;
КонецФункции
Функция string20(Данные)
	Возврат Данные;
КонецФункции
Функция string35(Данные)
	Возврат Данные;
КонецФункции
Функция string140(Данные)
	Возврат Данные;
КонецФункции
Функция string150(Данные)
	Возврат Данные;
КонецФункции
Функция string210(Данные)
	Возврат Данные;
КонецФункции
Функция string254(Данные)
	Возврат Данные;
КонецФункции
Функция string255(Данные)
	Возврат Данные;
КонецФункции
Функция string350(Данные)
	Возврат Данные;
КонецФункции
Функция string512(Данные)
	Возврат Данные;
КонецФункции
Функция string4000(Данные)
	Возврат Данные;
КонецФункции

Функция text_t(Данные)
	Возврат Данные;
КонецФункции

Функция string_exact_2(Данные)
	Возврат Данные;
КонецФункции

Функция Новый_security_classification_et(ТипЦБ)
	Если ТипЦБ=Перечисления.ТипыЦБ.Акция Тогда
		Результат = "SHAR";
	ИначеЕсли ТипЦБ=Перечисления.ТипыЦБ.Облигация Тогда
		Результат = "BOND";
	ИначеЕсли ТипЦБ=Перечисления.ТипыЦБ.Пай Тогда
		Результат = "MFUN";
	ИначеЕсли ТипЦБ=Перечисления.ТипыЦБ.ДепозитарнаяРасписка Тогда
		Результат = "RDRP";
	Иначе
		ВызватьИсключение "Ошибка преобразования типа акции "+ТипЦБ;
	КонецЕсли;    
	Возврат Результат;
КонецФункции
Функция Новый_security_category_et(ВидЦБ)
	Если ВидЦБ=Перечисления.ВидыАкций.Обыкновенная Тогда
		Результат = "ORDN";
	ИначеЕсли ВидЦБ=Перечисления.ВидыАкций.Привилегированная Тогда
		Результат = "PREF";
	Иначе
		ВызватьИсключение "Ошибка преобразования вида акции "+ВидЦБ;
	КонецЕсли;    
	Возврат Результат;
КонецФункции

Функция yes_no_t(ДаНет)
	Возврат Формат(ДаНет,"БЛ=No; БИ=Yes");
КонецФункции

Функция scheme_name_et(Данные)
	Возврат Данные;
КонецФункции

Функция list_message_function_et(ЭтоДораскрытие)
	Если ЭтоДораскрытие Тогда
		Возврат "AMND";
	Иначе
		Возврат "NEWM";
	КонецЕсли;
КонецФункции

Функция ВерсияФорматаFCDR()
	Возврат "FCDR_17_02";
КонецФункции

//ОБЪЕКТЫ
Функция Новый_header_t(НомерРаскрытия, ДанныеЗаголовок)
	Результат = НовыйОбъектСхемыFCDR("header_t");
	
	Результат.doc_num = string35(НомерРаскрытия);
	Результат.doc_date = Новый_date_or_datetime_t(ДанныеЗаголовок.ДатаРаскрытия);
	
	РегистрационныеДанные = НовыйРегистрационныеДанныеДля_party_identification2_V02_t(ДанныеЗаголовок.ОтправительИдентификатор, ДанныеЗаголовок.ОтправительТипИдентификатора, ДанныеЗаголовок.ВладелецИдентификатораОтправителя);
	Результат.from = Новый_party_identification2_V02_t(РегистрационныеДанные);
	
	РегистрационныеДанные = НовыйРегистрационныеДанныеДля_party_identification2_V02_t(ДанныеЗаголовок.ПолучательИдентификатор, ДанныеЗаголовок.ПолучательТипИдентификатора, ДанныеЗаголовок.ВладелецИдентификатораПолучателя);
	Результат.to = Новый_party_identification2_V02_t(РегистрационныеДанные);
	Возврат Результат;
КонецФункции

Функция Новый_date_or_datetime_t(Дата=Неопределено,ВключаяВремя=Ложь)
	Результат = НовыйОбъектСхемыFCDR("date_or_datetime_t");
	
	Если ВключаяВремя Тогда
		Результат.datetime = datetime_t(Дата);
	Иначе
		Результат.date = date_t(Дата);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_id_type_V02_t(РегистрационныеДанные)
	Результат = НовыйОбъектСхемыFCDR("id_type_V02_t");
	
	Результат.id = string35(СокрЛП(РегистрационныеДанные.Идентификатор));

	Результат.id_type = РегистрационныеДанные.ТипИдентификатора;

	Если ЭтоПрочее(РегистрационныеДанные.ТипИдентификатора) Тогда
		Результат.narrative = string150(РегистрационныеДанные.ОписаниеТипаИдентификатораПрочее);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_party_identification2_V02_t(РегистрационныеДанные, Наименование=Неопределено,ПочтовыйАдрес=Неопределено,КонтактнаяИнформация=Неопределено)
	
	Результат = НовыйОбъектСхемыFCDR("party_identification2_V02_t");
	
	Если ТипЗнч(РегистрационныеДанные)=Тип("Массив") Тогда
		Для Каждого Эл Из РегистрационныеДанные Цикл
			Результат.id_2.Добавить(Новый_id_type_V02_t(Эл));
		КонецЦикла;
	Иначе
		Результат.id_2.Добавить(Новый_id_type_V02_t(РегистрационныеДанные));
	КонецЕсли;

	//Результат.name = string512(ДанныеНаименование);

	//Результат.postal_address = Новый_address_V03_t(ДанныеПочтовыйАдрес);

	//Результат.party_contacts = Новый_party_contacts_V02_t(ДанныеКонтактнаяИнформация);

	Возврат Результат;
КонецФункции

Функция Новый_id_V02_t(Идентификатор,ВладелецИдентификатораИлиСхема=Неопределено,ЗарегистрированSWIFT=Ложь)
	Результат = НовыйОбъектСхемыFCDR("id_V02_t");
	Результат.id = string35(СокрЛП(Идентификатор));
	Если ЗначениеЗаполнено(ВладелецИдентификатораИлиСхема) Тогда
		Если ЗарегистрированSWIFT Тогда
			//Наименование схемы кодировки – для организаций, зарегистрированных SWIFT
			Результат.scheme_name = scheme_name_et(ВладелецИдентификатораИлиСхема);
		Иначе
			//Указывается код Организации, ведущей справочник идентификационных кодов, не зарегистрированная SWIFTом (NSDR – НКО НРД), 
			//если иное правило заполнения поля не задано выше лежащими блоками XSD-схемы. 
			Результат.issuer = string35(ВладелецИдентификатораИлиСхема);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_party_id_name_V2_t(ИдентификаторыV02, Наименование=Неопределено)
	Результат = НовыйОбъектСхемыFCDR("party_id_name_V2_t");
	Если ТипЗнч(ИдентификаторыV02)=Тип("Массив") Тогда
		Для Каждого Эл Из ИдентификаторыV02 Цикл
			Результат.id.Добавить(Новый_id_V02_t(Эл.Идентификатор, Эл.ВладелецИдентификатораИлиСхема, Эл.ЗарегистрированSWIFT));
		КонецЦикла;
	Иначе
		Результат.id.Добавить(Новый_id_V02_t(ИдентификаторыV02.Идентификатор, ИдентификаторыV02.ВладелецИдентификатораИлиСхема, ИдентификаторыV02.ЗарегистрированSWIFT));
	КонецЕсли;
	Если ЗначениеЗаполнено(Наименование) Тогда 
		Результат.name = string512(Наименование);
	КонецЕСли;
	Возврат Результат;
КонецФункции

Функция Новый_request_identification_t(ДанныеЗапроса)
	
	Результат = НовыйОбъектСхемыFCDR("request_identification_t");
	
	Результат.request_doc_num = string35(ДанныеЗапроса.НомерЗапроса);
	Результат.request_date = Новый_date_or_datetime_t(ДанныеЗапроса.ДатаЗапроса);
	НРД = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияПоУмолчанию");
	КодНРД = Справочники.КодыЗагрузки.НайтиПоВладельцуИБирже(НРД, Справочники.КлассификаторыЗагрузки.НДЦ());
	Идентификаторы = НовыйИдентификаторыДля_id_V02_t(КодНРД, ДанныеЗапроса.ВладелецИдентификатораПолучателя);
	Результат.request_issuer = Новый_party_id_name_V2_t(Идентификаторы);

	Возврат Результат;
КонецФункции

Функция Новый_document_ser_num_t(Серия,Номер);
	Результат = НовыйОбъектСхемыFCDR("document_ser_num_t");
	Результат.doc_ser = string6(Серия);
	Результат.doc_num = string10(Номер);
	Возврат Результат;
КонецФункции

Функция Новый_document_details_choice_t(СтруктураСерияНомер)
	Результат = НовыйОбъектСхемыFCDR("document_details_choice_t");
	
	Серия = Неопределено;
	Номер = Неопределено;
	СерияИНомер = Неопределено;
	СтруктураСерияНомер.Свойство("Серия",Серия);
	СтруктураСерияНомер.Свойство("Номер",Номер);
	СтруктураСерияНомер.Свойство("СерияИНомер",СерияИНомер);
	
	Если ЗначениеЗаполнено(Серия) И ЗначениеЗаполнено(Номер) Тогда
		Результат.dtls_apart = Новый_document_ser_num_t(Серия,Номер);
	ИначеЕсли ЗначениеЗаполнено(СерияИНомер) Тогда
		Результат.dtls_together = string20(СерияИНомер);
	Иначе
		Результат.doc_num = string35(?(ЗначениеЗаполнено(Номер), Номер, "UKWN"));
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_organization_document_t(Документ)
	
	Результат = НовыйОбъектСхемыFCDR("organization_document_t");
	
	Результат.organization_code_type = Документ.ТипКода;
	
	Если  ЭтоПрочее(Документ.ТипКода) Тогда
		Результат.narrative = string254(Документ.НаименованиеТипа);
	КонецЕсли;
	
	Результат.org_doc_num = Новый_document_details_choice_t(Документ);
	
	Если ЗначениеЗаполнено(Документ.Дата) Тогда
		Результат.doc_date = date_t(Документ.Дата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Документ.ОрганРегистрации) Тогда
		Результат.reg_org = string254(Документ.ОрганРегистрации);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_organization_id_t(Документ, ЮрФизЛицо=Неопределено,Страна=Неопределено,ДатаРегистрации=Неопределено,Наименование=Неопределено)
	
	Результат = НовыйОбъектСхемыFCDR("organization_id_t");
	
	Если Тип(Документ)=Тип("Массив") Тогда
		Для Каждого Стр Из Документ Цикл
			Результат.organization_id.Добавить(Новый_organization_document_t(Стр));
		КонецЦИкла;
	Иначе
		Результат.organization_id.Добавить(Новый_organization_document_t(Документ));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЮрФизЛицо) Тогда
		Результат.legal_entity_indicator = yes_no_t(ЮрФизЛицо=Перечисления.ЮрФизЛицо.ЮрЛицо);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Страна) Тогда
		Результат.country_of_incorporation = string2(Страна);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаРегистрации) Тогда
		Результат.date_of_incorporation = date_t(ДатаРегистрации);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		Результат.short_name = string350(Наименование);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_address_partad_V02_t(Страна, Индекс, Адрес)
	Результат = НовыйОбъектСхемыFCDR("address_partad_V02_t");
	Результат.country = string_exact_2(Страна);
	Если ЗначениеЗаполнено(Индекс) Тогда
		Результат.index = text_t(Индекс);
	КонецЕсли;
	Результат.address = string350(Адрес);
	
	Возврат Результат;
КонецФункции

Функция Новый_postal_address_t(АдресСтруктура)
	ВызватьИсключение "Адрес postal_address_t пока не поддерживается";
	
	Результат = НовыйОбъектСхемыFCDR("postal_address_t");
	
	Возврат Результат;
КонецФункции

Функция Новый_address_V2_t(Адрес_partad=Неопределено, Адрес_plain=Неопределено, АдресСтруктура=Неопределено)
	Результат = НовыйОбъектСхемыFCDR("address_V2_t");
	Если ЗначениеЗаполнено(Адрес_partad) Тогда
		Результат.partad = Новый_address_partad_V02_t(Адрес_partad.Страна, Адрес_partad.Индекс, Адрес_partad.Адрес);
	ИначеЕсли ЗначениеЗаполнено(Адрес_plain) Тогда 
		Результат.plain = string350(Адрес_plain);
	ИначеЕсли ЗначениеЗаполнено(АдресСтруктура) Тогда 
		Результат.Adr = Новый_postal_address_t(АдресСтруктура);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_address_V03_t(Адрес_partad=Неопределено, Адрес_plain=Неопределено)
	Результат = НовыйОбъектСхемыFCDR("address_V03_t");
	
	Если ЗначениеЗаполнено(Адрес_partad) Тогда
		Результат.partad = Новый_address_partad_V02_t(Адрес_partad.Страна, Адрес_partad.Индекс, Адрес_partad.Адрес);
	ИначеЕсли ЗначениеЗаполнено(Адрес_plain) Тогда 
		Результат.plain = string350(Адрес_plain);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_party_contacts_V02_t(КонтактнаяИнформация)
	ВызватьИсключение "Объект party_contacts_V02_t не реализован";
	Результат = НовыйОбъектСхемыFCDR("party_contacts_V02_t");

	Возврат Результат;
КонецФункции

Функция НовыйБанковскиеРеквизиты(НаименованиеПолучателя,АнглНаименованиеПолучателя, ИННПолучателя=Неопределено,АнглАдресПолучателя,НомерСчета,
				БанкНаименование,БанкГород,
				БИК,SWIFT,КорСчет,Валюта,ДопРеквизитыДляНазначенияПлатежа=Неопределено)
	Возврат Новый Структура("НаименованиеПолучателя,АнглНаименованиеПолучателя,ИННПолучателя,АнглАдресПолучателя,НомерСчета, БанкНаименование,БанкГород, БИК,SWIFT,КорСчет,Валюта,ДопРеквизитыДляНазначенияПлатежа",
				НаименованиеПолучателя,АнглНаименованиеПолучателя,ИННПолучателя,АнглАдресПолучателя,НомерСчета,
				БанкНаименование,БанкГород,
				БИК,SWIFT,КорСчет,Валюта,ДопРеквизитыДляНазначенияПлатежа);
КонецФункции

Функция Новый_cash_rub_dtls_V02_t(БанковскиеРеквизиты)
	Результат = НовыйОбъектСхемыFCDR("cash_rub_dtls_V02_t");
	Результат.account = Новый_id_V02_t(БанковскиеРеквизиты.НомерСчета);
	Результат.bank_name = string140(БанковскиеРеквизиты.БанкНаименование);
	Результат.bank_city = string35(БанковскиеРеквизиты.БанкГород);
	Результат.ruic = string35(БанковскиеРеквизиты.БИК);
	Результат.bank_corr = Новый_id_V02_t(БанковскиеРеквизиты.КорСчет);

	Возврат Результат;
КонецФункции

Функция Новый_bank_prop_rub_V02_t(БанковскиеРеквизиты)
	Результат = НовыйОбъектСхемыFCDR("bank_prop_rub_V02_t");

	Результат.pay_name = string150(БанковскиеРеквизиты.НаименованиеПолучателя);
	Если ЗначениеЗаполнено(БанковскиеРеквизиты.ИННПолучателя) Тогда
		Результат.inn = string14(БанковскиеРеквизиты.ИННПолучателя)
	КонецЕсли;
	Результат.cash_rub_dtls = Новый_cash_rub_dtls_V02_t(БанковскиеРеквизиты);
	
	Если ЗначениеЗаполнено(БанковскиеРеквизиты.ДопРеквизитыДляНазначенияПлатежа) Тогда
		Результат.pay_add_info = string210(БанковскиеРеквизиты.ДопРеквизитыДляНазначенияПлатежа)
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_legal_entity_details_t(Наименование,ДокументОрганизации,АдресМестонахождения=Неопределено,ЛицоДляКорреспонденции=Неопределено,КонтактнаяИнформация=Неопределено,БанковскиеРеквизиты=Неопределено)
	
	Результат = НовыйОбъектСхемыFCDR("legal_entity_details_t");
	
	Результат.legal_entity_name = string512(Наименование);
	
	Результат.legal_entity_id = Новый_organization_id_t(ДокументОрганизации);
	
	Если ЗначениеЗаполнено(АдресМестонахождения) Тогда
		Результат.legal_entity_address = Новый_address_V2_t(АдресМестонахождения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛицоДляКорреспонденции) Тогда
		Тип_postal_name = НовыйОбъектСхемыFCDRИзСвойств("legal_entity_details_t","postal_name");
		Результат.postal_name = ФабрикаXDTO.Создать(Тип_postal_name);
		Результат.postal_name.name = string512(ЛицоДляКорреспонденции.Имя);
		Результат.postal_name.address = Новый_address_V03_t(ЛицоДляКорреспонденции.Адрес_partad, ЛицоДляКорреспонденции.Адрес);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
		Результат.legal_entity_contacts = Новый_party_contacts_V02_t(КонтактнаяИнформация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскиеРеквизиты) Тогда
		Результат.bank_prop_rub = Новый_bank_prop_rub_V02_t(БанковскиеРеквизиты);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_party_account_type_t(ТипСчета, ТектовоеОписаниеТипаOTHER=Неопределено)
	Результат = НовыйОбъектСхемыFCDR("party_account_type_t");
	
	Результат.party_account_type_code = ТипСчета;
	
	Если ТипСчета = "OTHER" Тогда
		Результат.narrative = string254(ТектовоеОписаниеТипаOTHER);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_safekeeping_place_t(МестоХранения)
	
	Результат = НовыйОбъектСхемыFCDR("safekeeping_place_t");
	Результат.id = string35(МестоХранения.ИдентификаторДепозитария);

	Результат.id_type = МестоХранения.ТипИдентификатораДепозитария;
	
	Если МестоХранения.ТипИдентификатораДепозитария = "OTHER" Тогда
		Результат.narrative = string254(МестоХранения.ТектовоеОписаниеТипаДепозитарияOTHER);
	КонецЕсли;

	Возврат Результат;
КонецФункции

Функция Новый_account_dtls_v03_t(Данные)
	
	Результат = НовыйОбъектСхемыFCDR("account_dtls_v03_t");
	
	Результат.account_id = Новый_id_V02_t(Данные.СчетДепоКлиента);

	Результат.safekeeping_place = Новый_safekeeping_place_t(Данные);

	//Результат.account_counter = ВДокументацииНеУказанТип
	
	Возврат Результат;
КонецФункции

Функция Новый_party_dtls_V02_t(Наименование, ЮрФизЛицо,ДанныеОбЮрФизЛице,СтруктураАдреса)
	
	Результат = НовыйОбъектСхемыFCDR("party_dtls_V02_t");
	
	Результат.name = string512(Наименование);

	Если ЗначениеЗаполнено(СтруктураАдреса.Адрес) И ЗначениеЗаполнено(СтруктураАдреса.Страна) Тогда
		Результат.address = Новый_address_V2_t(СтруктураАдреса);
	ИначеЕсли ЗначениеЗаполнено(СтруктураАдреса.Адрес) Тогда
		Результат.address = Новый_address_V2_t(,СтруктураАдреса.Адрес);
	КонецЕсли;

	Результат.identification_information = Новый_party_id_choice_t(ЮрФизЛицо, ДанныеОбЮрФизЛице);
	
	Возврат Результат;
КонецФункции

Функция Новый_unknown_t(ПричинаОтсутствияИнформации)
	Результат = НовыйОбъектСхемыFCDR("unknown_t");
	
	Если ЗначениеЗаполнено(ПричинаОтсутствияИнформации) Тогда
		Результат.narrative	= string254(ПричинаОтсутствияИнформации);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_organization_dtls_t(Данные)

	ДанныеЕстьИдентификационнаяИнформация = ЗначениеЗаполнено(Данные.НомерДокумента);
	ДанныеПричинаОтсутствияИДентификационнойИнформации = "Не предоставлена";
	
	Результат = НовыйОбъектСхемыFCDR("organization_dtls_t");
	
	Если ДанныеЕстьИдентификационнаяИнформация Тогда
		Документ = НовыйДанныеДокументаДля_organization_document_t(Данные.ТипКодаДокумента,,,Данные.НомерДокумента,,Данные.ДатаДокумента,Данные.РегистрирующийОрган);
		Результат.organization_info = Новый_organization_id_t(Документ,Данные.ЮрФизЛицо,Данные.Страна,Данные.ДатаОснования);
	Иначе
		Результат.unknown = Новый_unknown_t(ДанныеПричинаОтсутствияИДентификационнойИнформации);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_person_dtls_t(Данные)
	ДанныеЕстьИдентификационнаяИнформация = ЗначениеЗаполнено(Данные.ДокументНомер);
	ДанныеПричинаОтсутствияИДентификационнойИнформации = "Не предоставлена";
	
	Результат = НовыйОбъектСхемыFCDR("person_dtls_t");
	
	Если ДанныеЕстьИдентификационнаяИнформация Тогда
		ДокументыФизЛица = Новый Массив;
		ДокументыФизЛица.Добавить(НовыйДанныеДокументаДля_person_document_t(Данные.ДокументТип,, Данные.ДокументСерия,Данные.ДокументНомер,, Данные.ДокументДатаВыдачи,Данные.ДокументКемВыдан));
		Если ЗначениеЗаполнено(Данные.ИНН) Тогда
			ДокументыФизЛица.Добавить(НовыйДанныеДокументаИННДля_person_document_t(Данные.ИНН));
		КонецЕсли;
		Результат.person_info = Новый_person_id_t(ДокументыФизЛица,Данные.ДатаРождения,Данные.МестоРождения,Данные.Гражданство);
	Иначе
		Результат.unknown = Новый_unknown_t(ДанныеПричинаОтсутствияИДентификационнойИнформации);
	КонецЕсли;

	Возврат Результат;
КонецФункции

Функция Новый_person_id_t(Документы,ДатаРождения,МестоРождения,Гражданство)
	
	ДанныеДокументы = Новый Массив;
	ДанныеГражданство = "Гражданство";
	ДанныеДатаРождения = Дата("19771201");
	ДанныеМестоРождения = "г. МестоРождения";
	
	Результат = НовыйОбъектСхемыFCDR("person_id_t");
	
	Если ТипЗнч(Документы)=Тип("Массив") Тогда
		Для Каждого Док Из Документы Цикл
			Результат.person_id.Добавить(Новый_person_document_t(Док));
		КонецЦикла;
	Иначе
		Результат.person_id.Добавить(Новый_person_document_t(Документы));
	КонецЕсли;

	Если ЗначениеЗаполнено(Гражданство) Тогда
		Результат.nationality = string150(Гражданство);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаРождения) Тогда
		Результат.birthday = date_t(ДатаРождения);
	КонецЕсли;
	Если ЗначениеЗаполнено(МестоРождения) Тогда
		Результат.birthplace = string150(МестоРождения);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_person_document_t(Документ)
	Результат = НовыйОбъектСхемыFCDR("person_document_t");
	
	Результат.person_document_type_code	= Документ.Тип;

	Если Документ.Тип="00" Тогда
		Результат.narrative	= string254(Документ.ОписаниеТипа);
	КонецЕсли;

	Результат.person_doc_num = Новый_document_details_choice_t(Документ);

	Если ЗначениеЗаполнено(Документ.ДатаВыдачи) Тогда
		Результат.doc_date = date_t(Документ.ДатаВыдачи);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Документ.КемВыдан) Тогда
		Результат.org = string150(Документ.КемВыдан);
	КонецЕсли;

	Если ЗначениеЗаполнено(Документ.МестоВыдачи) Тогда
		Результат.place = string150(Документ.МестоВыдачи)
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_party_id_choice_t(ЮрФизЛицо, ДанныеОЮрФизЛице)
	
	Результат = НовыйОбъектСхемыFCDR("party_id_choice_t");
	
	Если ЮрФизЛицо=Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		Результат.organization = Новый_organization_dtls_t(ДанныеОЮрФизЛице);
	Иначе
		Результат.person = Новый_person_dtls_t(ДанныеОЮрФизЛице);
	КонецЕсли;

	Возврат Результат;
КонецФункции

Функция Новый_tax_category_V02_t(Статус, ТипНерезидента=Неопределено, НаличиеЛьготы=Неопределено, ОснованиеЛьготы=Неопределено)
	
	Результат = НовыйОбъектСхемыFCDR("tax_category_V02_t");
	
	Результат.tax_status_code = Статус;

	Если ЗначениеЗаполнено(ТипНерезидента) Тогда
		Результат.nonresident_type = ТипНерезидента;
	КонецЕсли;

	//Если НаличиеЛьготы<>Неопределено Тогда
		Результат.tax_exempt_indicator = yes_no_t(НаличиеЛьготы);
		Если ЗначениеЗаполнено(ОснованиеЛьготы) Тогда
			Результат.narrative	= string255(ОснованиеЛьготы);
		КонецЕсли;
	//КонецЕсли;

	Если ЗначениеЗаполнено(ОснованиеЛьготы) Тогда
		Результат.narrative	= string255(ОснованиеЛьготы);
	КонецЕсли;

	
	Возврат Результат;
КонецФункции

Функция Новый_quantity_choice_t(Количество)
	
	Результат = НовыйОбъектСхемыFCDR("quantity_choice_t");
	
	Результат.qty_units = НовыйОбъектСхемыFCDRИзСвойств("quantity_choice_t","qty_units");
	Результат.qty_units.units = Количество;

	Возврат Результат;
КонецФункции

Функция Новый_account_type_V03_t (Данные)
	Результат = НовыйОбъектСхемыFCDR("account_type_V03_t");
	
	Если ТипЗнч(Данные.ТипСчетаЛучКлиента)=Тип("ПеречислениеСсылка.ТипыСчетовДепо") Тогда
		Результат.account_type_code = Справочники.СчетаДепо.КодТипаСчетаДЕПО(Данные.ТипСчетаЛучКлиента);
	Иначе
		Результат.account_type_code = Данные.ТипСчетаЛучКлиента;
	КонецЕсли;
	//Если Результат.account_type_code="13" Тогда
	//	Результат.narrative = string70(Данные.ОписаниеТипаСчетаЛучКлиента);
	//КонецЕсли;

	Возврат Результат;
КонецФункции

Функция Новый_account_dtls_v05_t(Данные)
	Результат = НовыйОбъектСхемыFCDR("account_dtls_v05_t");
	
	Результат.account_id = Новый_id_V02_t(Данные.СчетДепоКлиента);
	Результат.account_type = Новый_account_type_V03_t(Данные);

	Возврат Результат;
КонецФункции

Функция Новый_block_type_V03_t(Данные)
	Результат = НовыйОбъектСхемыFCDR("block_type_V03_t");
	Результат.block_type_code = Данные.ВидОбременения;
	Если ЭтоПрочее(Результат.block_type_code) Тогда
		Результат.narrative = string254(Данные.ОписаниеВидаОбременения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.СведенияОбОбременении) Тогда
		Результат.restrictions = string512(Данные.СведенияОбОбременении);
	КонецЕсли;
	
	Если Результат.block_type_code = "COLO" Тогда
		СведенияОЗалоге = НовыйОбъектСхемыFCDRИзСвойств("block_type_V03_t","pledgee_info");
		//ТипСведенийОЗалоге = ФабрикаXDTO.Тип("block_type_V03_t").Свойства.Получить("pledgee_info").Тип;
		
		СведенияОЗалоге.account_dtls_v02 = Новый_account_dtls_v05_t(Данные);
		
		АдресЗалогодержателя = НовыйСтруктураАдреса(Данные.ЗалогодержательАдресПоле1,Данные.ЗалогодержательАдресПоле2,Данные.ЗалогодержательАдресПоле3,Данные.ЗалогодержательАдресПоле4,Данные.ЗалогодержательАдресПоле5,Данные.ЗалогодержательАдресПоле6,Данные.ЗалогодержательАдресПоле7,Данные.ЗалогодержательАдресПоле8,Данные.ЗалогодержательАдресПоле9,
				Данные.ЗалогодержательАдрес,Данные.ЗалогодержательСтранаИностранногоАдреса,Данные.Россия);
				
		Если Данные.ЗалогодержательЮрФизЛицо=Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			ДанныеОбЮрФизЛице = НовыйДанныеОбОрганизации(Данные.ЗалогодержательЮрФизЛицо, Данные.ЗалогодержательТипКодаДокумента,Данные.ЗалогодержательНомерДокумента,Данные.ЗалогодержательДатаДокумента,Данные.ЗалогодержательРегистрирующийОрган, Данные.ЗалогодержательСтрана, Данные.ЗалогодержательДатаРегистрации);
		Иначе
			ДанныеОбЮрФизЛице = НовыйДанныеОФизЛице(Данные.ЗалогодержательФЛДокументТип,Данные.ЗалогодержательФЛДокументСерия,Данные.ЗалогодержательФЛДокументНомер,Данные.ЗалогодержательФЛДокументДатаВыдачи,Данные.ЗалогодержательФЛДокументКемВыдан, Данные.ЗалогодержательФЛДатаРождения,Данные.ЗалогодержательФЛМестоРождения,Данные.ЗалогодержательФЛГражданство);
		КонецЕсли;
		СведенияОЗалоге.pledgee = Новый_party_dtls_V02_t(Данные.ЗалогодержательНаименование, Данные.ЗалогодержательЮрФизЛицо, ДанныеОбЮрФизЛице, АдресЗалогодержателя);
		
		Если ЗначениеЗаполнено(Данные.ОписаниеУсловийЗалога) Тогда
			СведенияОЗалоге.pledgee_narrative = string4000(Данные.ОписаниеУсловийЗалога);
		КонецЕсли;
		
		Результат.pledgee_info = СведенияОЗалоге;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_security_info_V3_t(Данные)
	Результат = НовыйОбъектСхемыFCDR("security_info_V3_t");
	
	Результат.security_classification  = Новый_security_classification_et(Данные.ТипЦБ);

	//Результат.security_classification_CFI = string6(ДанныеCFI);

	//Результат.financial_instrument_type = Новый_financial_instrument_type_et();

	Если Данные.ТипЦБ=Перечисления.ТипыЦБ.Акция Тогда
		Результат.security_category = Новый_security_category_et(Данные.ВидЦБ);
	КонецЕсли;

	//Результат.security_type = string150();

	//Результат.nominal_value = Новый_currency_and_amount_t();

	//Результат.state_reg_num = string35();

	//Результат.state_reg_date = date_t();

	Если ЗначениеЗаполнено(Данные.ISIN) Тогда
		Результат.ISIN_identifier = Данные.ISIN;
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.КодЦБ) Тогда
		Результат.proprietary_security_code = Новый_id_V02_t(Данные.КодЦБ, Данные.ВладелецКодаЦБ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.НомерРегистрации) Тогда
		Результат.state_reg_num = Данные.НомерРегистрации;
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.ДатаГосРег) Тогда
		Результат.state_reg_date = Данные.ДатаГосРег;
	КонецЕсли;

	//Результат.description = string150();

	//Результат.COAF = string35();

	//Результат.security_evt_id = string35();

	//Результат.security_evt_lnk_id.Добавить(Новый_events_linkage_V02_t());

	Возврат Результат;
КонецФункции

Функция Новый_security_info_V2_t(Данные)
	Результат = НовыйОбъектСхемыFCDR("security_info_V2_t");
	
	Результат.security_classification = Новый_security_classification_et(Данные.ТипЦБ);

	//Результат.security_classification_CFI = string6(ДанныеCFI);

	//Результат.financial_instrument_type = Новый_financial_instrument_type_et();

	Если Данные.ТипЦБ=Перечисления.ТипыЦБ.Акция Тогда
		Результат.security_category = Новый_security_category_et(Данные.ВидЦБ);
	КонецЕсли;

	//Результат.security_type	= string150();

	//Результат.nominal_value = Новый_currency_and_amount_t();

	//Результат.state_reg_num = string35();

	//Результат.state_reg_date = date_t();
	Если ЗначениеЗаполнено(Данные.ISIN) Тогда
		Результат.ISIN_identifier = Данные.ISIN;
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.КодЦБ) Тогда
		Результат.proprietary_security_code = Новый_id_V02_t(Данные.КодЦБ, Данные.ВладелецКодаЦБ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.НомерРегистрации) Тогда
		Результат.state_reg_num = Данные.НомерРегистрации;
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.ДатаГосРег) Тогда
		Результат.state_reg_date = Данные.ДатаГосРег;
	КонецЕсли;

	//Результат.description = string150();
	
	Возврат Результат;
КонецФункции

Процедура ДобавитьЦБВЗалоге(ВыборкаЦБВЗалоге, РаскрытиеXDTO, ТипОбъектаБлокировки)
	Если ВыборкаЦБВЗалоге.КоличествоВЗалоге>0 Тогда
		Блокировка = ФабрикаXDTO.Создать(ТипОбъектаБлокировки);
		Блокировка.quantity = Новый_quantity_choice_t(ВыборкаЦБВЗалоге.КоличествоВЗалоге);
		Блокировка.block_type.Добавить(Новый_block_type_V03_t(ВыборкаЦБВЗалоге));
		РаскрытиеXDTO.blocked.Добавить(Блокировка);
	КонецЕсли;
КонецПроцедуры

Функция Новый_security_balance_t_v03(Данные)
	ДанныеЕстьБлокировкаЦБ = Ложь;
	ДанныеБлокировкиЦБ = "";
	
	Результат = НовыйОбъектСхемыFCDR("security_balance_t_v03");
	
	Результат.security = Новый_security_info_V3_t(Данные);

	Результат.total = Новый_quantity_choice_t(Данные.Количество);
	
	Если Данные.КоличествоВЗалоге>0 Тогда
		ТипОбъектаБлокировки = ФабрикаXDTO.Тип(ПространствоИмен,"security_balance_t_v03").Свойства.Получить("blocked").Тип;
		Если ВключатьБенефициаров Тогда
			ВыборкаЦБ = Данные.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЦБ.Следующий() Цикл
				ВыборкаЦБВЗалоге = ВыборкаЦБ.Выбрать();
				Пока ВыборкаЦБВЗалоге.Следующий() Цикл
					ДобавитьЦБВЗалоге(ВыборкаЦБВЗалоге, Результат, ТипОбъектаБлокировки);
				КонецЦикла;
			КонецЦикла;
		Иначе
			ВыборкаЦБВЗалоге = Данные.Выбрать();
			Пока ВыборкаЦБВЗалоге.Следующий() Цикл
				ДобавитьЦБВЗалоге(ВыборкаЦБВЗалоге, Результат, ТипОбъектаБлокировки);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;


	Возврат Результат;
КонецФункции

Функция НовыйСтруктураАдреса(АдресПоле1,АдресПоле2,АдресПоле3,АдресПоле4,АдресПоле5,АдресПоле6,АдресПоле7,АдресПоле8,АдресПоле9,ПредставлениеАдреса,СтранаИностранногоАдреса,СтранаРоссия)
	ЗаписьАдреса = Новый Структура("Поле1,Поле2,Поле3,Поле4,Поле5,Поле6,Поле7,Поле8,Поле9",
		АдресПоле1,АдресПоле2,АдресПоле3,АдресПоле4,АдресПоле5,АдресПоле6,АдресПоле7,АдресПоле8,АдресПоле9);
		
	АдресСтрана = Неопределено;
	ПроизвольныйАдрес = (КонтактнаяИнформация.ПолучитьПредставлениеАдреса(ЗаписьАдреса) <> ПредставлениеАдреса);		
	Если ПроизвольныйАдрес Тогда
		АдресСтрана = СтранаИностранногоАдреса;
		АдресИндекс = "";
	Иначе
		АдресСтрана = СтранаРоссия;
		АдресИндекс = АдресПоле1;
	КонецЕсли; 	
	Возврат Новый Структура("Страна,Индекс,Адрес", АдресСтрана,АдресИндекс,ПредставлениеАдреса);
КонецФункции

Функция payment_from_nominee(Значение)
	 Возврат "payment_from_nominee="+Формат(Значение,"БЛ=N; БИ=Y");
КонецФункции
 
Функция Новый_shareholder_dtls_t(Данные, ВключатьБенефициаров, БанковскиеРеквизиты, ЗначениеPaymentFromNominee, ОписаниеОшибки, УКБезВыгодоприобретателей)
	Результат = НовыйОбъектСхемыFCDR("shareholder_dtls_t");
	
	Результат.shareholder_id = string35(СокрЛП(Данные.КодКлиента));
	
	Результат.party_account_type = Новый_party_account_type_t(Данные.ТипСчетаКлиента, Данные.ТектовоеОписаниеТипаOTHER);
	Результат.account_dtls = Новый_account_dtls_v03_t(Данные);

	Если Данные.ЭтоСубброкер Тогда  
		АдресКлиента = Новый Структура("Страна,Индекс,Адрес", Данные.ДанныеСубброкераАдресСтрана,Данные.ДанныеСубброкераАдресИндекс,Данные.ДанныеСубброкераАдрес);
		ПочтовыйАдресКлиента = Новый Структура("Страна,Индекс,Адрес",Данные.ДанныеСубброкераПочтовыйАдресСтрана,Данные.ДанныеСубброкераПочтовыйАдресИндекс,Данные.ДанныеСубброкераПочтовыйАдрес) ;
	Иначе
		АдресКлиента = НовыйСтруктураАдреса(Данные.КлиентАдресПоле1,Данные.КлиентАдресПоле2,Данные.КлиентАдресПоле3,Данные.КлиентАдресПоле4,Данные.КлиентАдресПоле5,Данные.КлиентАдресПоле6,Данные.КлиентАдресПоле7,Данные.КлиентАдресПоле8,Данные.КлиентАдресПоле9,
				Данные.КлиентАдрес,Данные.КлиентСтранаИностранногоАдреса,Данные.Россия);
		ПочтовыйАдресКлиента = НовыйСтруктураАдреса(Данные.КлиентПочтовыйАдресПоле1,Данные.КлиентПочтовыйАдресПоле2,Данные.КлиентПочтовыйАдресПоле3,Данные.КлиентПочтовыйАдресПоле4,Данные.КлиентПочтовыйАдресПоле5,Данные.КлиентПочтовыйАдресПоле6,Данные.КлиентПочтовыйАдресПоле7,Данные.КлиентПочтовыйАдресПоле8,Данные.КлиентПочтовыйАдресПоле9,
				Данные.КлиентПочтовыйАдрес,Данные.КлиентСтранаИностранногоПочтовогоАдреса,Данные.Россия);
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ПочтовыйАдресКлиента.Адрес) Тогда
		ПочтовыйАдресКлиента = АдресКлиента;
	КонецЕсли;			
				
	Если Данные.ТипСчетаКлиента = "JNRH" Тогда
		//joint_owners.Добавить(Новый_joint_owner_t(Данные));
	Иначе
		Если Данные.КлиентЮрФизЛицо=Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			ДанныеОбЮрФизЛице = НовыйДанныеОбОрганизации(Данные.КлиентЮрФизЛицо, Данные.КлиентТипКодаДокумента,Данные.КлиентНомерДокумента,Данные.КлиентДатаДокумента,Данные.КлиентРегистрирующийОрган, Данные.КлиентСтрана, Данные.КлиентДатаРегистрации, Данные.КлиентФЛДатаРождения);
		Иначе
			ДанныеОбЮрФизЛице = НовыйДанныеОФизЛице(Данные.КлиентФЛДокументТип,Данные.КлиентФЛДокументСерия,Данные.КлиентФЛДокументНомер,Данные.КлиентФЛДокументДатаВыдачи,Данные.КлиентФЛДокументКемВыдан, Данные.КлиентФЛДатаРождения,Данные.КлиентФЛМестоРождения,Данные.КлиентФЛГражданство,Данные.КлиентИНН);
		КонецЕсли;
		
		Результат.party_dtls = Новый_party_dtls_V02_t(Данные.КлиентНаименование,Данные.КлиентЮрФизЛицо,ДанныеОбЮрФизЛице,АдресКлиента);
	КонецЕсли;
	
	Результат.postal_name = НовыйОбъектСхемыFCDRИзСвойств("shareholder_dtls_t","postal_name");
	Результат.postal_name.name = string512(Данные.КлиентПочтовоеНаименование);
	
	Если ЗначениеЗаполнено(ПочтовыйАдресКлиента.Адрес) И ЗначениеЗаполнено(ПочтовыйАдресКлиента.Страна) Тогда
		Результат.postal_name.address = Новый_address_V03_t(ПочтовыйАдресКлиента);
	ИначеЕсли ЗначениеЗаполнено(ПочтовыйАдресКлиента.Адрес) Тогда
		Результат.postal_name.address = Новый_address_V03_t(,ПочтовыйАдресКлиента.Адрес);
	КонецЕсли;
	
	//Результат.shareholder_contacts = Новый_party_contacts_V02_t(Данные);
	
	Если ЗначениеЗаполнено(Данные.КлиентСтрана) Тогда
		Результат.country_location = string2(Данные.КлиентСтрана);
	КонецЕсли;
	
	Результат.tax_category = Новый_tax_category_V02_t(Данные.КлиентНеРезидент,,Данные.НаличиеЛьготы);
	
	Если ЗначениеЗаполнено(БанковскиеРеквизиты) Тогда
		Результат.bank_prop_rub = Новый_bank_prop_rub_V02_t(БанковскиеРеквизиты);
	КонецЕсли;
	
	//Результат.authorization_info = string512(Данные);
	Если ВключатьБенефициаров Тогда
		ВыборкаЦБ = Данные.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ЦеннаяБумага");
	Иначе
		ВыборкаЦБ = Данные.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	Пока ВыборкаЦБ.Следующий() Цикл
		Результат.security_balance.Добавить(Новый_security_balance_t_v03(ВыборкаЦБ));
	КонецЦикла;
		
	Если ВключатьБенефициаров И Данные.ЭтоУК Тогда
		ВыборкаБенефициаров = Данные.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ТекОшибка = "";
		Результат.beneficiary = Новый_beneficiary_dtls_t(ВыборкаБенефициаров,,ТекОшибка,УКБезВыгодоприобретателей);
		Если ЗначениеЗаполнено(ТекОшибка) Тогда
			ОписаниеОшибки = ОписаниеОшибки+Символы.ПС + "Ошибки заполнения выгодоприобретателей"+ТекОшибка;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ЗначениеPaymentFromNominee) Тогда
		Результат.shareholder_add_info.Добавить(payment_from_nominee(ЗначениеPaymentFromNominee));
	КонецЕсли;

	Если ЗначениеЗаполнено(Данные.ДополнительнаяИнформация) Тогда
		Результат.shareholder_add_info.Добавить(Данные.ДополнительнаяИнформация);
	КонецЕсли;

	//Результат.attch.Добавить(Новый_attachment_t(Данные));
	
	Возврат Результат;
КонецФункции

Функция Новый_register_list_dtls_t(ДанныеГруппировкаКлиент, ВключатьБенефициаров, ЭтоДораскрытие, БанковскиеРеквизиты, ЗначениеPaymentFromNominee, ОписаниеОшибки,УКБезВыгодоприобретателей)
	
	Результат = НовыйОбъектСхемыFCDR("register_list_dtls_t");
	
	//Выборка по клиентам
	Пока ДанныеГруппировкаКлиент.Следующий() Цикл
		//Выборка по кодам клиента. Необходимо для разделения субклиентов представленных строкой ФИО
		// т.к. бывают случаи полного совпадения ФИО, различен только НомерСчетаДепо
		Данные = ДанныеГруппировкаКлиент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Данные.Следующий() Цикл
			ТекОшибка = "";
			Если Данные.ЭтоСубброкер Тогда
				Если НЕ ЗначениеЗаполнено(Данные.ОтветНаРСВ) Тогда
					ТекОшибка = ОшибкаДокументНеГотов("Нет ответа субброкера.");
				ИначеЕсли НЕ Данные.ЕстьОтветСубброкера Тогда
					ТекОшибка = ОшибкаДокументНеГотов("В ответе "+Данные.ОтветНаРСВ+" не найдена строка данных по клиенту.");
				КонецЕсли;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ТекОшибка) Тогда
				Попытка
					КлиентXDTO = Новый_shareholder_dtls_t(Данные,ВключатьБенефициаров, БанковскиеРеквизиты, ЗначениеPaymentFromNominee, ТекОшибка,УКБезВыгодоприобретателей);
					КлиентXDTO.Проверить();
					Результат.shareholder.Добавить(КлиентXDTO);
				Исключение
					ТекОшибка = ОписаниеОшибки();
				КонецПопытки;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекОшибка) Тогда
				ОписаниеОшибки = ОписаниеОшибки + Символы.ПС
					+ ?(Данные.ЭтоСубброкер, "Субклиент ", "Клиент ")
					+ Данные.Клиент + ?(ЗначениеЗаполнено(Данные.КодКлиента), " (код: " + СокрЛП(Данные.КодКлиента) + "): ", ": ")
					+ ТекОшибка;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	
	Возврат Результат;
КонецФункции

Функция Новый_corporate_action_reference_t_v03(Данные)
	Результат = НовыйОбъектСхемыFCDR("corporate_action_reference_t_v03");
	Результат.corp_actn_evt_id = string35(Данные.КДРеференс);
	Результат.corporate_action_code	= Данные.КодТипаКД;
	Возврат Результат;
КонецФункции

Функция Новый_account_dtls_v04_t(НомерСчета, ТипСчета)
	Результат = НовыйОбъектСхемыFCDR("account_dtls_v04_t");
	Результат.account_id = Новый_id_V02_t(НомерСчета);
	Результат.account_type = Новый_account_type_V02_t(Справочники.СчетаДепо.КодТипаСчетаДЕПО(ТипСчета));
	Возврат Результат;

КонецФункции

Функция Новый_account_type_V02_t(ТипКода, ОписаниеТипаКода=Неопределено)
	Результат = НовыйОбъектСхемыFCDR("account_type_V02_t");
	Результат.account_type_code = ТипКода;

	Если ЗначениеЗаполнено(ОписаниеТипаКода) ИЛИ ТипКода="13" Тогда
		Результат.narrative = string254(ОписаниеТипаКода);
	КонецЕсли;	
	Возврат Результат;
КонецФункции

Функция Новый_party_id_name_V03_t(Наименование, ИдентификаторыV02)
	Результат = НовыйОбъектСхемыFCDR("party_id_name_V03_t");
	Если ТипЗнч(ИдентификаторыV02)=Тип("Массив") Тогда
		Для Каждого Эл Из ИдентификаторыV02 Цикл
			Результат.id.Добавить(Новый_id_V02_t(Эл.Идентификатор, Эл.ВладелецИдентификатораИлиСхема, Эл.ЗарегистрированSWIFT));
		КонецЦикла;
	Иначе
		Результат.id.Добавить(Новый_id_V02_t(ИдентификаторыV02.Идентификатор, ИдентификаторыV02.ВладелецИдентификатораИлиСхема, ИдентификаторыV02.ЗарегистрированSWIFT));
	КонецЕсли;
	Результат.name = string512(Наименование);

	Возврат Результат;
КонецФункции

Функция Новый_information_type_V02_t(ТипСписка, ПредоставитьБанковскиеРеквизиты, Шаблон, ОписаниеТипаСписка=Неопределено)
	Результат = НовыйОбъектСхемыFCDR("information_type_V02_t");
	
	Результат.information_type_code = ТипСписка;

	Результат.request_bank_details = yes_no_t(ПредоставитьБанковскиеРеквизиты);

	Результат.disclosure_template = Шаблон;

	Если ЭтоПрочее(ТипСписка) И ЗначениеЗаполнено(ОписаниеТипаСписка) Тогда
		Результат.narrative = string254(ОписаниеТипаСписка);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_any_t()
	Возврат НовыйОбъектСхемыFCDR("any_t");
КонецФункции

Функция Новый_bank_prop_curr_ndc_t(КодКлиента, БанковскиеРеквизиты)
	Результат = НовыйОбъектСхемыFCDR("bank_prop_curr_ndc_t");
	Результат.shareholder_id = СокрЛП(КодКлиента);
	Результат.ccy_code = БанковскиеРеквизиты.Валюта;
	Результат.ow_acc = БанковскиеРеквизиты.НомерСчета;
	НаименованиеПолучателя = БанковскиеРеквизиты.АнглНаименованиеПолучателя;
	Результат.ow_acc_n1 = Лев(НаименованиеПолучателя, 35);
	Если СтрДлина(НаименованиеПолучателя) > 35 Тогда
		Результат.ow_acc_n2 = Сред(НаименованиеПолучателя, 36, 35);
	КонецЕсли; 
	АдресПолучателя = БанковскиеРеквизиты.АнглАдресПолучателя;
	Результат.ow_addr1 = Лев(АдресПолучателя, 35);
	Если СтрДлина(АдресПолучателя) > 35 Тогда
		Результат.ow_addr2 = Сред(АдресПолучателя, 36, 35);
	КонецЕсли; 
	Результат.ow_b_swift = БанковскиеРеквизиты.SWIFT;
	
	Возврат Результат;
КонецФункции

Функция Новый_XtnsnDt(ВыборкаКлиенты,БанковскиеРеквизиты)
	Результат = НовыйОбъектСхемыFCDR("XtnsnDt");
	
	Пока ВыборкаКлиенты.Следующий() Цикл
		Результат.bank_prop_curr.Добавить(Новый_bank_prop_curr_ndc_t(ВыборкаКлиенты.КодКлиента, БанковскиеРеквизиты));
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

//Бенефициары
Функция Новый_beneficiary_dtls_t(ВыборкаБенефициары=Неопределено, ВыборкаВложения=Неопределено, ОписаниеОшибки="",УКБезВыгодоприобретателей=Неопределено)
	Результат = НовыйОбъектСхемыFCDR("beneficiary_dtls_t");
	Если ВыборкаБенефициары<>Неопределено Тогда
		Пока ВыборкаБенефициары.Следующий() Цикл
			ТекОшибка = "";
			Если НЕ ЗначениеЗаполнено(ВыборкаБенефициары.Бенефициар) Тогда
				Если УКБезВыгодоприобретателей=Неопределено Тогда
					УКБезВыгодоприобретателей = "";
				КонецЕсли;
				УКБезВыгодоприобретателей = УКБезВыгодоприобретателей + Символы.ПС + СокрЛП(ВыборкаБенефициары.КодКлиента) + ": " + ВыборкаБенефициары.КлиентНаименование;
			Иначе
				Попытка
					Результат.beneficiaries.Добавить(Новый_beneficiaries_t(ВыборкаБенефициары, ТекОшибка));
					Результат.Проверить();
				Исключение
					ТекОшибка = ОписаниеОшибки();
				КонецПопытки;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекОшибка) Тогда
				ОписаниеОшибки = ОписаниеОшибки+Символы.ПС+"выгодоприобретатель "+ВыборкаБенефициары.Бенефициар+": "+ТекОшибка;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Пока ВыборкаВложения.Следующий() Цикл
			Результат.attch.Добавить(Новый_attachment_t(ВыборкаВложения));
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция Новый_beneficiaries_t(Данные,ОписаниеОшибки="")
	Результат = НовыйОбъектСхемыFCDR("beneficiaries_t");
	
	Результат.party_account_type = Новый_party_account_type_t(Данные.ТипСчетаБенефициара, Данные.ТектовоеОписаниеТипаOTHERБенефициара);

	//Результат.beneficiary_account_dtls = Новый_account_dtls_beneficiary_t(Данные);

	Если Данные.ТипСчетаКлиента = "JNRH" Тогда
		//joint_owners.Добавить(Новый_joint_owner_t(Данные));
	Иначе
		АдресКлиента = НовыйСтруктураАдреса(Данные.КлиентУКАдресПоле1,Данные.КлиентУКАдресПоле2,Данные.КлиентУКАдресПоле3,Данные.КлиентУКАдресПоле4,Данные.КлиентУКАдресПоле5,Данные.КлиентУКАдресПоле6,Данные.КлиентУКАдресПоле7,Данные.КлиентУКАдресПоле8,Данные.КлиентУКАдресПоле9,
						Данные.КлиентУКАдрес,Данные.КлиентУКСтранаИностранногоАдреса,Данные.Россия);
		
		Если Данные.БенефициарЮрФизЛицо=Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			ДанныеОбЮрФизЛице = НовыйДанныеОбОрганизации(Данные.БенефициарЮрФизЛицо, Данные.БенефициарТипКодаДокумента,Данные.БенефициарНомерДокумента,Данные.БенефициарДатаДокумента,Данные.БенефициарРегистрирующийОрган, Данные.БенефициарСтрана, Неопределено); //Данные.БенефициарДатаРегистрации);
			Если НЕ ЗначениеЗаполнено(Данные.БенефициарНомерДокумента) И НЕ ЗначениеЗаполнено(АдресКлиента.Адрес) Тогда
				ОписаниеОшибки = "Нет идентификационной информации";
			КонецЕсли;
		Иначе
			ДанныеОбЮрФизЛице = НовыйДанныеОФизЛице(Данные.БенефициарФЛДокументТип,Данные.БенефициарФЛДокументСерия,Данные.БенефициарФЛДокументНомер,Данные.БенефициарФЛДокументДатаВыдачи,Данные.БенефициарФЛДокументКемВыдан, Данные.БенефициарФЛДатаРождения,Данные.БенефициарФЛМестоРождения,Данные.БенефициарФЛГражданство,Данные.БенефициарИНН);
			Если НЕ ЗначениеЗаполнено(Данные.БенефициарФЛДокументНомер) И НЕ ЗначениеЗаполнено(АдресКлиента.Адрес) Тогда
				ОписаниеОшибки = "Нет идентификационной информации";
			КонецЕсли;
		КонецЕсли;
		
		Результат.beneficiary_info = Новый_party_dtls_V02_t(Данные.БенефициарНаименование,Данные.БенефициарЮрФизЛицо,ДанныеОбЮрФизЛице,АдресКлиента);
	КонецЕсли;

	//Если ЗначениеЗаполнено(Данные.Контакты) Тогда
	//	Результат.beneficiary_contacts = Новый_party_contacts_V02_t(Данные.Контакты);
	//КонецЕсли;
	
	Выборка = Данные.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		Результат.beneficiary_security_balance.Добавить(Новый_security_balance_bnfr_t(Выборка));
	КонецЦикла;

	//Результат.beneficiary_add_info.Добавить(string255(Данные.БенефициарыДопИнфо));

	Возврат Результат;
КонецФункции

Функция Новый_security_balance_bnfr_t(ЦББенефициара)
	Результат = НовыйОбъектСхемыFCDR("security_balance_bnfr_t");
	
	Результат.security = Новый_security_info_V2_t(ЦББенефициара);

	Результат.total = Новый_quantity_choice_t(ЦББенефициара.Количество);

	Возврат Результат;
КонецФункции

Функция Новый_attachment_t(Выборка)
	ВызватьИсключение "Тип attachment_t не реализован";
	Результат = НовыйОбъектСхемыFCDR("attachment_t");
	Возврат Результат;
КонецФункции

//ВЫГРУЗКА СПИСКА
Функция ТипТехническойОперации()
	Возврат "RF005";
КонецФункции
Функция КодТехническойОперации()
	Возврат "62";
КонецФункции
Функция НовыйСтрокаТаблицыКодовТиповСчетов(тзн,КодЛуч,КодFCDR)
	Результат = тзн.Добавить();
	Результат.КодЛуч = КодЛуч;
	Результат.КодFCDR = КодFCDR;
	Возврат Результат;
КонецФункции
Функция ТаблицаКодовТиповСчетов()
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("КодЛуч",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(2)));
	Результат.Колонки.Добавить("КодFCDR",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(4)));
	НовыйСтрокаТаблицыКодовТиповСчетов(Результат,"01","OWNE");
	НовыйСтрокаТаблицыКодовТиповСчетов(Результат,"20","OWNE");
	НовыйСтрокаТаблицыКодовТиповСчетов(Результат,"03","TRUS");
	НовыйСтрокаТаблицыКодовТиповСчетов(Результат,"21","FTRS");
	Возврат Результат;
КонецФункции
Функция ТекстЗапросаСписокРаскрытия()
	Возврат
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РСВ.Клиент.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица,
	|	РСВ.Клиент.ЮрФизЛицо КАК ЮрФизЛицо
	|ПОМЕСТИТЬ ВТ_ЮрФизЛицаДокумента
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев.СписокВладельцев КАК РСВ
	|ГДЕ
	|	РСВ.Ссылка = &ДокументРСВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РСВ.РазделСчетаДепо.Залогодержатель.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица,
	|	РСВ.РазделСчетаДепо.Залогодержатель.ЮрФизЛицо КАК ЮрФизЛицо
	|ПОМЕСТИТЬ ВТ_ЗалогодержателиДокумента
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев.СписокВладельцев КАК РСВ
	|ГДЕ
	|	РСВ.Ссылка = &ДокументРСВ
	|	И РСВ.РазделСчетаДепо.Залогодержатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Субклиенты.Клиент КАК ЮридическиеФизическиеЛица,
	|	ВЫБОР
	|		КОГДА Субклиенты.Клиент ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|	КОНЕЦ КАК ЮрФизЛицо
	|ПОМЕСТИТЬ ВТ_ЮрФизЛицаДокументаУК
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев.СписокВладельцев КАК РСВ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Субклиенты КАК Субклиенты
	|		ПО (Субклиенты.Объект = РСВ.Клиент)
	|ГДЕ
	|	РСВ.Ссылка = &ДокументРСВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тзн.КодЛуч КАК КодЛуч,
	|	тзн.КодFCDR КАК КодFCDR
	|ПОМЕСТИТЬ ВТ_ТипыСчетовЛуч
	|ИЗ
	|	&тзнТипыСчетовЛуч КАК тзн
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПоляБанковскихРеквизитов КАК ПоляБанковскихРеквизитов,
	|	РСВ.Проведен КАК Проведен,
	|	РСВ.Номер КАК НомерРаскрытия,
	|	РСВ.Дата КАК ДатаРаскрытия,
	|	РСВ.Организация.ЮридическоеЛицо.Наименование КАК ОтправительНаименование,
	|	КодыОтправителя.Код КАК ОтправительИдентификатор,
	|	&Прочее КАК ОтправительТипИдентификатора,
	|	&NSDR КАК ВладелецИдентификатораОтправителя,
	|	КодыПолучателя.Код КАК ПолучательИдентификатор,
	|	&Прочее КАК ПолучательТипИдентификатора,
	|	&NSDR КАК ВладелецИдентификатораПолучателя,
	|	РСВ.ВходящийДокументНомер КАК НомерЗапроса,
	|	РСВ.ВходящийДокументДата КАК ДатаЗапроса,
	|	РСВ.Эмитент.ЮридическиеФизическиеЛица.ПолноеНаименование КАК ЭмитентНаименование,
	|	РСВ.Эмитент.ЮридическиеФизическиеЛица.ОГРН КАК ЭмитентНомер,
	|	""OGRN"" КАК ЭмитентТипНомера,
	|	РСВ.Эмитент2Наименование КАК Эмитент2Наименование,
	|	РСВ.Эмитент2Номер КАК Эмитент2Номер,
	|	РСВ.Эмитент2ТипНомера КАК Эмитент2ТипНомера,
	|	РСВ.КДРеференс КАК КДРеференс,
	|	РСВ.ВидКорпоративногоДействия.Код КАК КодТипаКД,
	|	РСВ.ДатаФиксации КАК ДатаФиксации,
	|	РСВ.СчетДЕПО.Код КАК СчетДЕПО,
	|	РСВ.СчетДЕПО.ТипСчета КАК ТипСчетаДЕПО,
	|	РСВ.ТипСписка.Код КАК ТипСписка,
	|	ЛОЖЬ КАК ПредоставитьБанковскиеРеквизиты,
	|	РСВ.ШаблонFCDR_2017_02 КАК Шаблон
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев КАК РСВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.КлассификаторЗагрузкиНДЦ КАК КлассификаторЗагрузкиНДЦ
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ДепозитарийПоУмолчанию КАК ДепозитарийПоУмолчанию
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыОтправителя
	|		ПО (КодыОтправителя.Владелец = РСВ.Организация.ЮридическоеЛицо)
	|			И (КодыОтправителя.Биржа = КлассификаторЗагрузкиНДЦ.Значение)
	|			И (КодыОтправителя.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыОтправителя.ДатаОкончанияДействия > &Дата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыПолучателя
	|		ПО (КодыПолучателя.Владелец = РСВ.Инициатор)
	|			И (КодыПолучателя.Биржа = КлассификаторЗагрузкиНДЦ.Значение)
	|			И (КодыПолучателя.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыПолучателя.ДатаОкончанияДействия > &Дата),
	|	&ИсточникиБанковскихРеквизитов КАК ИсточникиБанковскихРеквизитов
	|ГДЕ
	|	РСВ.Ссылка = &ДокументРСВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПоляБенефициаров КАК ПоляБенефициаров,
	|	РСВ.ЦеннаяБумага КАК ЦеннаяБумага,
	|	РСВ.ЦеннаяБумага.ТипЦБ КАК ТипЦБ,
	|	ВЫБОР
	|		КОГДА РСВ.ЦеннаяБумага.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Акция)
	|			ТОГДА РСВ.ЦеннаяБумага.ВидЦБ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВидЦБ,
	|	РСВ.Количество КАК Количество,
	|	РСВ.КоличествоВЗалоге КАК КоличествоВЗалоге,
	|	КодыЦБ.Код КАК КодЦБ,
	|	&NSDR КАК ВладелецКодаЦБ,
	|	РСВ.ЦеннаяБумага.ISIN КАК ISIN,
	|	РСВ.ЦеннаяБумага.НомерРегистрации КАК НомерРегистрации,
	|	РСВ.ЦеннаяБумага.ДатаГосРег КАК ДатаГосРег,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА РСВ.Выгодоприобретатель
	|		ИНАЧЕ РСВ.Клиент
	|	КОНЕЦ КАК Клиент,
	|	РСВ.Клиент.Субброкер КАК ЭтоСубброкер,
	|	РСВ.Клиент.УправляющаяКомпания КАК ЭтоУК,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.НомерСчетаДепоКлиента
	|		ИНАЧЕ РСВ.Договор.Код
	|	КОНЕЦ КАК КодКлиента,
	|	ВЫБОР
	|		КОГДА ДанныеСубброкера.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОтветСубброкера,
	|	РСВ.ОтветНаРСВ КАК ОтветНаРСВ,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ТипСчета
	|		ИНАЧЕ РСВ.СчетДепо.ТипСчетаДепо
	|	КОНЕЦ КАК ТипСчетаЛучКлиента,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ЕСТЬNULL(ВТ_ТипыСчетовЛуч.КодFCDR, ДанныеСубброкера.ТипСчета)
	|		ИНАЧЕ РСВ.СчетДепо.ТипСчетаДепоFCDR_2017_02.Код
	|	КОНЕЦ КАК ТипСчетаКлиента,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА """"
	|		ИНАЧЕ РСВ.СчетДепо.ОписаниеТипаСчетаДепоFCDR_2017_02
	|	КОНЕЦ КАК ТектовоеОписаниеТипаOTHER,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.LEIКодСубброкера
	|		ИНАЧЕ РСВ.LEIОрганизации
	|	КОНЕЦ КАК ИдентификаторДепозитария,
	|	""LEIC"" КАК ТипИдентификатораДепозитария,
	|	РСВ.СчетДепо.Код КАК СчетДепоКлиента,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ПолноеНаименованиеЮЛФЛСубклиента
	|		КОГДА РСВ.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА РСВ.Клиент.ЮридическиеФизическиеЛица.ПолноеНаименование
	|		ИНАЧЕ РСВ.Клиент.ЮридическиеФизическиеЛица.Наименование
	|	КОНЕЦ КАК КлиентПочтовоеНаименование,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ПолноеНаименованиеЛица
	|		КОГДА РСВ.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА РСВ.Клиент.ЮридическиеФизическиеЛица.ПолноеНаименование
	|		ИНАЧЕ РСВ.Клиент.ЮридическиеФизическиеЛица.Наименование
	|	КОНЕЦ КАК КлиентНаименование,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ДокументВладельцаТип.Код
	|		КОГДА РСВ.Клиент.Резидент
	|			ТОГДА &ИдентификаторНерезидента
	|		ИНАЧЕ &ИдентификаторРезидента
	|	КОНЕЦ КАК КлиентТипКодаДокумента,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ДокументВладельцаДатаВыдачи
	|		КОГДА РСВ.Клиент.Резидент = ИСТИНА
	|			ТОГДА РСВ.Клиент.ЮридическиеФизическиеЛица.ДатаГосРегистрации
	|		КОГДА РСВ.Клиент.ЮридическиеФизическиеЛица.ДатаВнесенияВЕГРЮЛ = ДАТАВРЕМЯ(1, 1, 1)
	|				И РСВ.Клиент.ЮридическиеФизическиеЛица.ДатаГосРегистрации >= ДАТАВРЕМЯ(2002, 7, 1)
	|			ТОГДА РСВ.Клиент.ЮридическиеФизическиеЛица.ДатаГосРегистрации
	|		ИНАЧЕ РСВ.Клиент.ЮридическиеФизическиеЛица.ДатаВнесенияВЕГРЮЛ
	|	КОНЕЦ КАК КлиентДатаДокумента,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ДокументВладельцаНомер
	|		ИНАЧЕ РСВ.Клиент.ЮридическиеФизическиеЛица.ОГРН
	|	КОНЕЦ КАК КлиентНомерДокумента,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ДокументВладельцаОрганВыдачи
	|		ИНАЧЕ РСВ.Клиент.ЮридическиеФизическиеЛица.РегистрирующийОрган
	|	КОНЕЦ КАК КлиентРегистрирующийОрган,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ДатаРожденияФЛ
	|		ИНАЧЕ РСВ.Клиент.ЮридическиеФизическиеЛица.ДатаРождения
	|	КОНЕЦ КАК КлиентФЛДатаРождения,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА """"
	|		ИНАЧЕ РСВ.Клиент.ЮридическиеФизическиеЛица.МестоРождения
	|	КОНЕЦ КАК КлиентФЛМестоРождения,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ДокументВладельцаТип.КодИМНС
	|		ИНАЧЕ Паспорт.ДокументВид.КодИМНС
	|	КОНЕЦ КАК КлиентФЛДокументТип,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ДокументВладельцаСерия
	|		ИНАЧЕ Паспорт.ДокументСерия
	|	КОНЕЦ КАК КлиентФЛДокументСерия,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ДокументВладельцаНомер
	|		ИНАЧЕ Паспорт.ДокументНомер
	|	КОНЕЦ КАК КлиентФЛДокументНомер,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ДокументВладельцаДатаВыдачи
	|		ИНАЧЕ Паспорт.ДокументДатаВыдачи
	|	КОНЕЦ КАК КлиентФЛДокументДатаВыдачи,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ДокументВладельцаОрганВыдачи
	|		ИНАЧЕ Паспорт.ДокументКемВыдан
	|	КОНЕЦ КАК КлиентФЛДокументКемВыдан,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ГражданствоФЛ.КодАльфа2
	|		ИНАЧЕ Гражданство.Страна.КодАльфа2
	|	КОНЕЦ КАК КлиентФЛГражданство,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА РСВ.Выгодоприобретатель.ЮридическиеФизическиеЛица.ИНН
	|		ИНАЧЕ РСВ.Клиент.ЮридическиеФизическиеЛица.ИНН
	|	КОНЕЦ КАК КлиентИНН,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ПризнакЮЛФЛ
	|		ИНАЧЕ РСВ.Клиент.ЮрФизЛицо
	|	КОНЕЦ КАК КлиентЮрФизЛицо,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.АдресМестонахожденияРегистрацииСтрана.КодАльфа2
	|		КОГДА РСВ.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА РСВ.Клиент.ЮридическиеФизическиеЛица.Страна.КодАльфа2
	|		ИНАЧЕ Гражданство.Страна.КодАльфа2
	|	КОНЕЦ КАК КлиентСтрана,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА ДанныеСубброкера.ДокументВладельцаДатаВыдачи
	|		ИНАЧЕ РСВ.Клиент.ЮридическиеФизическиеЛица.ДатаГосРегистрации
	|	КОНЕЦ КАК КлиентДатаРегистрации,
	|	ДанныеСубброкера.АдресМестонахожденияРегистрацииАдрес КАК ДанныеСубброкераАдрес,
	|	ДанныеСубброкера.АдресМестонахожденияРегистрацииИндекс КАК ДанныеСубброкераАдресИндекс,
	|	ДанныеСубброкера.АдресМестонахожденияРегистрацииСтрана.КодАльфа2 КАК ДанныеСубброкераАдресСтрана,
	|	ДанныеСубброкера.АдресПочтовыйАдрес КАК ДанныеСубброкераПочтовыйАдрес,
	|	ДанныеСубброкера.АдресПочтовыйИндекс КАК ДанныеСубброкераПочтовыйАдресИндекс,
	|	ДанныеСубброкера.АдресПочтовыйСтрана.КодАльфа2 КАК ДанныеСубброкераПочтовыйАдресСтрана,
	|	ЕСТЬNULL(КонтактнаяИнформацияЮрАдрес.Представление, КонтактнаяИнформация.Представление) КАК КлиентАдрес,
	|	ЕСТЬNULL(КонтактнаяИнформацияЮрАдрес.Поле1, КонтактнаяИнформация.Поле1) КАК КлиентАдресПоле1,
	|	ЕСТЬNULL(КонтактнаяИнформацияЮрАдрес.Поле2, КонтактнаяИнформация.Поле2) КАК КлиентАдресПоле2,
	|	ЕСТЬNULL(КонтактнаяИнформацияЮрАдрес.Поле3, КонтактнаяИнформация.Поле3) КАК КлиентАдресПоле3,
	|	ЕСТЬNULL(КонтактнаяИнформацияЮрАдрес.Поле4, КонтактнаяИнформация.Поле4) КАК КлиентАдресПоле4,
	|	ЕСТЬNULL(КонтактнаяИнформацияЮрАдрес.Поле5, КонтактнаяИнформация.Поле5) КАК КлиентАдресПоле5,
	|	ЕСТЬNULL(КонтактнаяИнформацияЮрАдрес.Поле6, КонтактнаяИнформация.Поле6) КАК КлиентАдресПоле6,
	|	ЕСТЬNULL(КонтактнаяИнформацияЮрАдрес.Поле7, КонтактнаяИнформация.Поле7) КАК КлиентАдресПоле7,
	|	ЕСТЬNULL(КонтактнаяИнформацияЮрАдрес.Поле8, КонтактнаяИнформация.Поле8) КАК КлиентАдресПоле8,
	|	ЕСТЬNULL(КонтактнаяИнформацияЮрАдрес.Поле9, КонтактнаяИнформация.Поле9) КАК КлиентАдресПоле9,
	|	ЕСТЬNULL(КонтактнаяИнформацияПочтовыйАдресКлиента.Представление, ЕСТЬNULL(КонтактнаяИнформацияФактическийАдресКлиента.Представление, КонтактнаяИнформация.Представление)) КАК КлиентПочтовыйАдрес,
	|	ЕСТЬNULL(КонтактнаяИнформацияПочтовыйАдресКлиента.Поле1, ЕСТЬNULL(КонтактнаяИнформацияФактическийАдресКлиента.Поле1, КонтактнаяИнформация.Поле1)) КАК КлиентПочтовыйАдресПоле1,
	|	ЕСТЬNULL(КонтактнаяИнформацияПочтовыйАдресКлиента.Поле2, ЕСТЬNULL(КонтактнаяИнформацияФактическийАдресКлиента.Поле2, КонтактнаяИнформация.Поле2)) КАК КлиентПочтовыйАдресПоле2,
	|	ЕСТЬNULL(КонтактнаяИнформацияПочтовыйАдресКлиента.Поле3, ЕСТЬNULL(КонтактнаяИнформацияФактическийАдресКлиента.Поле3, КонтактнаяИнформация.Поле3)) КАК КлиентПочтовыйАдресПоле3,
	|	ЕСТЬNULL(КонтактнаяИнформацияПочтовыйАдресКлиента.Поле4, ЕСТЬNULL(КонтактнаяИнформацияФактическийАдресКлиента.Поле4, КонтактнаяИнформация.Поле4)) КАК КлиентПочтовыйАдресПоле4,
	|	ЕСТЬNULL(КонтактнаяИнформацияПочтовыйАдресКлиента.Поле5, ЕСТЬNULL(КонтактнаяИнформацияФактическийАдресКлиента.Поле5, КонтактнаяИнформация.Поле5)) КАК КлиентПочтовыйАдресПоле5,
	|	ЕСТЬNULL(КонтактнаяИнформацияПочтовыйАдресКлиента.Поле6, ЕСТЬNULL(КонтактнаяИнформацияФактическийАдресКлиента.Поле6, КонтактнаяИнформация.Поле6)) КАК КлиентПочтовыйАдресПоле6,
	|	ЕСТЬNULL(КонтактнаяИнформацияПочтовыйАдресКлиента.Поле7, ЕСТЬNULL(КонтактнаяИнформацияФактическийАдресКлиента.Поле7, КонтактнаяИнформация.Поле7)) КАК КлиентПочтовыйАдресПоле7,
	|	ЕСТЬNULL(КонтактнаяИнформацияПочтовыйАдресКлиента.Поле8, ЕСТЬNULL(КонтактнаяИнформацияФактическийАдресКлиента.Поле8, КонтактнаяИнформация.Поле8)) КАК КлиентПочтовыйАдресПоле8,
	|	ЕСТЬNULL(КонтактнаяИнформацияПочтовыйАдресКлиента.Поле9, ЕСТЬNULL(КонтактнаяИнформацияФактическийАдресКлиента.Поле9, КонтактнаяИнформация.Поле9)) КАК КлиентПочтовыйАдресПоле9,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|				И ДанныеСубброкера.СтатусНалогоплательщика = ""1""
	|			ТОГДА 1
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА 2
	|		КОГДА РСВ.Клиент.НеРезидент = ИСТИНА
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КлиентНеРезидент,
	|	ВЫРАЗИТЬ(ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.РОССИЯ) КАК Справочник.КлассификаторСтранМира).КодАльфа2 КАК Россия,
	|	СпрСтраны.КодАльфа2 КАК КлиентСтранаИностранногоАдреса,
	|	СпрСтраныПочтовогоАдреса.КодАльфа2 КАК КлиентСтранаИностранногоПочтовогоАдреса,
	|	ЛОЖЬ КАК НаличиеЛьготы,
	|	NULL КАК ОписаниеУсловийЗалога,
	|	NULL КАК СведенияОбОбременении,
	|	&ВидОбременения КАК ВидОбременения,
	|	ВЫБОР
	|		КОГДА РСВ.Залогодержатель.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА РСВ.Залогодержатель.ЮридическиеФизическиеЛица.ПолноеНаименование
	|		ИНАЧЕ РСВ.Залогодержатель.ЮридическиеФизическиеЛица.Наименование
	|	КОНЕЦ КАК ЗалогодержательНаименование,
	|	ВЫБОР
	|		КОГДА РСВ.Залогодержатель.Резидент
	|			ТОГДА &ИдентификаторНерезидента
	|		ИНАЧЕ &ИдентификаторРезидента
	|	КОНЕЦ КАК ЗалогодержательТипКодаДокумента,
	|	ВЫБОР
	|		КОГДА РСВ.Залогодержатель.Резидент = ИСТИНА
	|			ТОГДА РСВ.Залогодержатель.ЮридическиеФизическиеЛица.ДатаГосРегистрации
	|		КОГДА РСВ.Залогодержатель.ЮридическиеФизическиеЛица.ДатаВнесенияВЕГРЮЛ = ДАТАВРЕМЯ(1, 1, 1)
	|				И РСВ.Залогодержатель.ЮридическиеФизическиеЛица.ДатаГосРегистрации >= ДАТАВРЕМЯ(2002, 7, 1)
	|			ТОГДА РСВ.Залогодержатель.ЮридическиеФизическиеЛица.ДатаГосРегистрации
	|		ИНАЧЕ РСВ.Залогодержатель.ЮридическиеФизическиеЛица.ДатаВнесенияВЕГРЮЛ
	|	КОНЕЦ КАК ЗалогодержательДатаДокумента,
	|	РСВ.Залогодержатель.ЮридическиеФизическиеЛица.ОГРН КАК ЗалогодержательНомерДокумента,
	|	РСВ.Залогодержатель.ЮридическиеФизическиеЛица.РегистрирующийОрган КАК ЗалогодержательРегистрирующийОрган,
	|	РСВ.Залогодержатель.ЮридическиеФизическиеЛица.ДатаРождения КАК ЗалогодержательФЛДатаРождения,
	|	РСВ.Залогодержатель.ЮридическиеФизическиеЛица.МестоРождения КАК ЗалогодержательФЛМестоРождения,
	|	ЗалогодержательПаспорт.ДокументВид.КодИМНС КАК ЗалогодержательФЛДокументТип,
	|	ЗалогодержательПаспорт.ДокументСерия КАК ЗалогодержательФЛДокументСерия,
	|	ЗалогодержательПаспорт.ДокументНомер КАК ЗалогодержательФЛДокументНомер,
	|	ЗалогодержательПаспорт.ДокументДатаВыдачи КАК ЗалогодержательФЛДокументДатаВыдачи,
	|	ЗалогодержательПаспорт.ДокументКемВыдан КАК ЗалогодержательФЛДокументКемВыдан,
	|	ЗалогодержательГражданство.Страна.КодАльфа2 КАК ЗалогодержательФЛГражданство,
	|	РСВ.Залогодержатель.ЮрФизЛицо КАК ЗалогодержательЮрФизЛицо,
	|	ВЫБОР
	|		КОГДА РСВ.Залогодержатель.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА РСВ.Залогодержатель.ЮридическиеФизическиеЛица.Страна.КодАльфа2
	|		ИНАЧЕ ЗалогодержательГражданство.Страна.КодАльфа2
	|	КОНЕЦ КАК ЗалогодержательСтрана,
	|	РСВ.Залогодержатель.ЮридическиеФизическиеЛица.ДатаГосРегистрации КАК ЗалогодержательДатаРегистрации,
	|	ЗалогодержательКонтактнаяИнформация.Представление КАК ЗалогодержательАдрес,
	|	ЗалогодержательКонтактнаяИнформация.Поле1 КАК ЗалогодержательАдресПоле1,
	|	ЗалогодержательКонтактнаяИнформация.Поле2 КАК ЗалогодержательАдресПоле2,
	|	ЗалогодержательКонтактнаяИнформация.Поле3 КАК ЗалогодержательАдресПоле3,
	|	ЗалогодержательКонтактнаяИнформация.Поле4 КАК ЗалогодержательАдресПоле4,
	|	ЗалогодержательКонтактнаяИнформация.Поле5 КАК ЗалогодержательАдресПоле5,
	|	ЗалогодержательКонтактнаяИнформация.Поле6 КАК ЗалогодержательАдресПоле6,
	|	ЗалогодержательКонтактнаяИнформация.Поле7 КАК ЗалогодержательАдресПоле7,
	|	ЗалогодержательКонтактнаяИнформация.Поле8 КАК ЗалогодержательАдресПоле8,
	|	ЗалогодержательКонтактнаяИнформация.Поле9 КАК ЗалогодержательАдресПоле9,
	|	СпрСтранаЗалогодержателя.КодАльфа2 КАК ЗалогодержательСтранаИностранногоАдреса,
	|	РСВ.ДополнительнаяИнформация КАК ДополнительнаяИнформация
	|ИЗ
	|	(ВЫБРАТЬ
	|		Док.Ссылка.Организация.LEI КАК LEIОрганизации,
	|		Док.Клиент КАК Клиент,
	|		СУММА(Док.Количество) КАК Количество,
	|		СУММА(ВЫБОР
	|				КОГДА Док.РазделСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоВЗалоге)
	|					ТОГДА Док.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК КоличествоВЗалоге,
	|		Док.Договор КАК Договор,
	|		Док.ЦеннаяБумага КАК ЦеннаяБумага,
	|		Док.Выгодоприобретатель КАК Выгодоприобретатель,
	|		Док.ОтветНаРСВ КАК ОтветНаРСВ,
	|		Док.СчетДепо КАК СчетДепо,
	|		ВЫБОР
	|			КОГДА Док.РазделСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоВЗалоге)
	|				ТОГДА Док.РазделСчетаДепо.Залогодержатель
	|			ИНАЧЕ NULL
	|		КОНЕЦ КАК Залогодержатель,
	|		Док.НомерСчетаДепоКлиентаОтвета КАК НомерСчетаДепоКлиентаОтвета,
	|		Док.ДополнительнаяИнформация КАК ДополнительнаяИнформация
	|	ИЗ
	|		Документ.РаскрытиеСпискаВладельцев.СписокВладельцев КАК Док
	|	ГДЕ
	|		Док.Ссылка = &ДокументРСВ
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Док.Ссылка.Организация.LEI,
	|		Док.Клиент,
	|		Док.Договор,
	|		Док.ЦеннаяБумага,
	|		Док.Выгодоприобретатель,
	|		Док.ОтветНаРСВ,
	|		Док.СчетДепо,
	|		ВЫБОР
	|			КОГДА Док.РазделСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоВЗалоге)
	|				ТОГДА Док.РазделСчетаДепо.Залогодержатель
	|			ИНАЧЕ NULL
	|		КОНЕЦ,
	|		Док.НомерСчетаДепоКлиентаОтвета,
	|		Док.ДополнительнаяИнформация) КАК РСВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтветСубброкераНаРаскрытие.ДанныеСубброкера КАК ДанныеСубброкера
	|		ПО (РСВ.Клиент.Субброкер)
	|			И (НЕ РСВ.Клиент.УправляющаяКомпания)
	|			И (ДанныеСубброкера.Ссылка = РСВ.ОтветНаРСВ)
	|			И (ДанныеСубброкера.Выгодоприобретатель = РСВ.Выгодоприобретатель)
	|			И (ДанныеСубброкера.НомерСчетаДепоКлиента = РСВ.НомерСчетаДепоКлиентаОтвета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТипыСчетовЛуч КАК ВТ_ТипыСчетовЛуч
	|		ПО (ВТ_ТипыСчетовЛуч.КодЛуч = ДанныеСубброкера.ТипСчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&Дата,
	|				(Объект, Тип, Вид) В
	|					(ВЫБРАТЬ
	|						ВТ_ЮрФизЛицаДокумента.ЮридическиеФизическиеЛица,
	|						ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес),
	|						ВЫБОР
	|							КОГДА ВТ_ЮрФизЛицаДокумента.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|								ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресЮрЛица)
	|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица)
	|						КОНЕЦ
	|					ИЗ
	|						ВТ_ЮрФизЛицаДокумента)) КАК КонтактнаяИнформация
	|		ПО (КонтактнаяИнформация.Объект = РСВ.Клиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&Дата,
	|				(Объект, Тип, Вид) В
	|					(ВЫБРАТЬ
	|						ВТ_ЮрФизЛицаДокумента.ЮридическиеФизическиеЛица,
	|						ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес),
	|						ВЫБОР
	|							КОГДА ВТ_ЮрФизЛицаДокумента.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|								ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресЮрЛица)
	|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица)
	|						КОНЕЦ
	|					ИЗ
	|						ВТ_ЮрФизЛицаДокумента)) КАК КонтактнаяИнформацияЮрАдрес
	|		ПО (КонтактнаяИнформацияЮрАдрес.Объект = РСВ.Клиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&Дата,
	|				(Объект, Тип, Вид) В
	|					(ВЫБРАТЬ
	|						ВТ_ЮрФизЛицаДокумента.ЮридическиеФизическиеЛица,
	|						ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес),
	|						ВЫБОР
	|							КОГДА ВТ_ЮрФизЛицаДокумента.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|								ТОГДА &ПочтовыйАдресЮрлица
	|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ИнформАдресФизЛица)
	|						КОНЕЦ
	|					ИЗ
	|						ВТ_ЮрФизЛицаДокумента)) КАК КонтактнаяИнформацияПочтовыйАдресКлиента
	|		ПО (КонтактнаяИнформацияПочтовыйАдресКлиента.Объект = РСВ.Клиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&Дата,
	|				(Объект, Тип, Вид) В
	|					(ВЫБРАТЬ
	|						ВТ_ЮрФизЛицаДокумента.ЮридическиеФизическиеЛица,
	|						ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес),
	|						ВЫБОР
	|							КОГДА ВТ_ЮрФизЛицаДокумента.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|								ТОГДА &ПочтовыйАдресЮрлица
	|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресФизЛица)
	|						КОНЕЦ
	|					ИЗ
	|						ВТ_ЮрФизЛицаДокумента)) КАК КонтактнаяИнформацияФактическийАдресКлиента
	|		ПО (КонтактнаяИнформацияФактическийАдресКлиента.Объект = РСВ.Клиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.КлассификаторЗагрузкиНДЦ КАК КлассификаторЗагрузкиНДЦ
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЦБ
	|		ПО (КодыЦБ.Владелец = РСВ.ЦеннаяБумага)
	|			И (КодыЦБ.Биржа = КлассификаторЗагрузкиНДЦ.Значение)
	|			И (КодыЦБ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЦБ.ДатаОкончанияДействия > &ДатаФиксации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК СпрСтраны
	|		ПО (СпрСтраны.Наименование = КонтактнаяИнформация.Поле1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК СпрСтраныПочтовогоАдреса
	|		ПО (СпрСтраныПочтовогоАдреса.Наименование = КонтактнаяИнформацияПочтовыйАдресКлиента.Поле1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(
	|				&Дата,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_ЮрФизЛицаДокумента.ЮридическиеФизическиеЛица
	|					ИЗ
	|						ВТ_ЮрФизЛицаДокумента)) КАК Паспорт
	|		ПО РСВ.Клиент.ЮридическиеФизическиеЛица = Паспорт.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(
	|				&Дата,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_ЮрФизЛицаДокумента.ЮридическиеФизическиеЛица
	|					ИЗ
	|						ВТ_ЮрФизЛицаДокумента)) КАК Гражданство
	|		ПО РСВ.Клиент.ЮридическиеФизическиеЛица = Гражданство.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(
	|				&Дата,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_ЗалогодержателиДокумента.ЮридическиеФизическиеЛица
	|					ИЗ
	|						ВТ_ЗалогодержателиДокумента)) КАК ЗалогодержательПаспорт
	|		ПО РСВ.Залогодержатель.ЮридическиеФизическиеЛица = ЗалогодержательПаспорт.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(
	|				&Дата,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_ЗалогодержателиДокумента.ЮридическиеФизическиеЛица
	|					ИЗ
	|						ВТ_ЗалогодержателиДокумента)) КАК ЗалогодержательГражданство
	|		ПО РСВ.Залогодержатель.ЮридическиеФизическиеЛица = ЗалогодержательГражданство.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&Дата,
	|				(Объект, Тип, Вид) В
	|					(ВЫБРАТЬ
	|						ВТ_ЗалогодержателиДокумента.ЮридическиеФизическиеЛица,
	|						ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес),
	|						ВЫБОР
	|							КОГДА ВТ_ЗалогодержателиДокумента.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|								ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресЮрЛица)
	|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица)
	|						КОНЕЦ
	|					ИЗ
	|						ВТ_ЗалогодержателиДокумента)) КАК ЗалогодержательКонтактнаяИнформация
	|		ПО (ЗалогодержательКонтактнаяИнформация.Объект = РСВ.Залогодержатель.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК СпрСтранаЗалогодержателя
	|		ПО (СпрСтранаЗалогодержателя.Наименование = ЗалогодержательКонтактнаяИнформация.Поле1),
	|	ИсточникиБенефициаров КАК ИсточникиБенефициаров
	|ИТОГИ
	|	&ИтогиБенефициаров КАК ПоляБенефициаров,
	|	МАКСИМУМ(ТипЦБ),
	|	МАКСИМУМ(ВидЦБ),
	|	СУММА(Количество),
	|	СУММА(КоличествоВЗалоге),
	|	МАКСИМУМ(КодЦБ),
	|	МАКСИМУМ(ВладелецКодаЦБ),
	|	МАКСИМУМ(ISIN),
	|	МАКСИМУМ(ЭтоСубброкер),
	|	МАКСИМУМ(ЭтоУК),
	|	МАКСИМУМ(ЕстьОтветСубброкера),
	|	МАКСИМУМ(ОтветНаРСВ),
	|	МАКСИМУМ(ТипСчетаЛучКлиента),
	|	МАКСИМУМ(ТипСчетаКлиента),
	|	МАКСИМУМ(ТектовоеОписаниеТипаOTHER),
	|	МАКСИМУМ(ИдентификаторДепозитария),
	|	МАКСИМУМ(ТипИдентификатораДепозитария),
	|	МАКСИМУМ(СчетДепоКлиента),
	|	МАКСИМУМ(КлиентПочтовоеНаименование),
	|	МАКСИМУМ(КлиентНаименование),
	|	МАКСИМУМ(КлиентТипКодаДокумента),
	|	МАКСИМУМ(КлиентДатаДокумента),
	|	МАКСИМУМ(КлиентНомерДокумента),
	|	МАКСИМУМ(КлиентРегистрирующийОрган),
	|	МАКСИМУМ(КлиентФЛДатаРождения),
	|	МАКСИМУМ(КлиентФЛМестоРождения),
	|	МАКСИМУМ(КлиентФЛДокументТип),
	|	МАКСИМУМ(КлиентФЛДокументСерия),
	|	МАКСИМУМ(КлиентФЛДокументНомер),
	|	МАКСИМУМ(КлиентФЛДокументДатаВыдачи),
	|	МАКСИМУМ(КлиентФЛДокументКемВыдан),
	|	МАКСИМУМ(КлиентФЛГражданство),
	|	МАКСИМУМ(КлиентИНН),
	|	МАКСИМУМ(КлиентЮрФизЛицо),
	|	МАКСИМУМ(КлиентСтрана),
	|	МАКСИМУМ(КлиентДатаРегистрации),
	|	МАКСИМУМ(ДанныеСубброкераАдрес),
	|	МАКСИМУМ(ДанныеСубброкераАдресИндекс),
	|	МАКСИМУМ(ДанныеСубброкераАдресСтрана),
	|	МАКСИМУМ(ДанныеСубброкераПочтовыйАдрес),
	|	МАКСИМУМ(ДанныеСубброкераПочтовыйАдресИндекс),
	|	МАКСИМУМ(ДанныеСубброкераПочтовыйАдресСтрана),
	|	МАКСИМУМ(КлиентАдрес),
	|	МАКСИМУМ(КлиентАдресПоле1),
	|	МАКСИМУМ(КлиентАдресПоле2),
	|	МАКСИМУМ(КлиентАдресПоле3),
	|	МАКСИМУМ(КлиентАдресПоле4),
	|	МАКСИМУМ(КлиентАдресПоле5),
	|	МАКСИМУМ(КлиентАдресПоле6),
	|	МАКСИМУМ(КлиентАдресПоле7),
	|	МАКСИМУМ(КлиентАдресПоле8),
	|	МАКСИМУМ(КлиентАдресПоле9),
	|	МАКСИМУМ(КлиентПочтовыйАдрес),
	|	МАКСИМУМ(КлиентПочтовыйАдресПоле1),
	|	МАКСИМУМ(КлиентПочтовыйАдресПоле2),
	|	МАКСИМУМ(КлиентПочтовыйАдресПоле3),
	|	МАКСИМУМ(КлиентПочтовыйАдресПоле4),
	|	МАКСИМУМ(КлиентПочтовыйАдресПоле5),
	|	МАКСИМУМ(КлиентПочтовыйАдресПоле6),
	|	МАКСИМУМ(КлиентПочтовыйАдресПоле7),
	|	МАКСИМУМ(КлиентПочтовыйАдресПоле8),
	|	МАКСИМУМ(КлиентПочтовыйАдресПоле9),
	|	МАКСИМУМ(КлиентНеРезидент),
	|	МАКСИМУМ(Россия),
	|	МАКСИМУМ(КлиентСтранаИностранногоАдреса),
	|	МАКСИМУМ(КлиентСтранаИностранногоПочтовогоАдреса),
	|	МАКСИМУМ(НаличиеЛьготы),
	|	МАКСИМУМ(ДополнительнаяИнформация)
	|ПО
	|	Клиент,
	|	КодКлиента,
	|	&ГруппировкиИтоговБенефициаров,
	|	ЦеннаяБумага";

КонецФункции
Процедура ВставитьПоляБенефициара(ТекстЗапроса,ВключатьБенефициаров)
	ПоляБенефициаров = "Истина КАК ЗаглушкаПоляБенефициаров,";
	ИсточникиБенефициаров = "(ВЫБРАТЬ Истина) КАК ЗаглушкаИсточникиБенефициаров";
	ИтогиБенефициаров = "";
	ГруппировкиИтоговБенефициаров = "";
	Если ВключатьБенефициаров Тогда
			
		ПоляБенефициаров =
		"	СубклиентыУК.Клиент КАК Бенефициар,
		|	СубклиентыУК.Клиент.ИНН КАК БенефициарИНН,
		|	ВЫБОР
		|		КОГДА СубклиентыУК.Клиент ССЫЛКА Справочник.ЮридическиеЛица ТОГДА ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
		|	КОНЕЦ КАК БенефициарЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА СубклиентыУК.Клиент.НеРезидент ТОГДА &ИдентификаторНерезидента
		|		ИНАЧЕ &ИдентификаторРезидента
		|	КОНЕЦ КАК БенефициарТипКодаДокумента,
		
		|	ВЫБОР
		|		КОГДА СубклиентыУК.Клиент ССЫЛКА Справочник.ЮридическиеЛица ТОГДА СубклиентыУК.Клиент.Страна.КодАльфа2
		|		ИНАЧЕ ГражданствоУК.Страна.КодАльфа2
		|	КОНЕЦ КАК БенефициарСтрана,
		|	ВЫБОР
		|		КОГДА СубклиентыУК.Клиент.НеРезидент = ИСТИНА ТОГДА СубклиентыУК.Клиент.ДатаГосРегистрации
		|		КОГДА СубклиентыУК.Клиент.ДатаВнесенияВЕГРЮЛ = ДАТАВРЕМЯ(1,1,1) И СубклиентыУК.Клиент.ДатаГосРегистрации >= ДАТАВРЕМЯ(2002,7,1) ТОГДА СубклиентыУК.Клиент.ДатаГосРегистрации
		|		ИНАЧЕ СубклиентыУК.Клиент.ДатаВнесенияВЕГРЮЛ
		|	КОНЕЦ КАК БенефициарДатаДокумента,
		|	СубклиентыУК.Клиент.ОГРН КАК БенефициарНомерДокумента,
		|	СубклиентыУК.Клиент.РегистрирующийОрган КАК БенефициарРегистрирующийОрган,
		|	СубклиентыУК.Клиент.ДатаРождения КАК БенефициарФЛДатаРождения,
		|	СубклиентыУК.Клиент.МестоРождения КАК БенефициарФЛМестоРождения,
		|	ПаспортУК.ДокументВид.КодИМНС КАК БенефициарФЛДокументТип,
		|	ПаспортУК.ДокументСерия КАК БенефициарФЛДокументСерия,
		|	ПаспортУК.ДокументНомер КАК БенефициарФЛДокументНомер,
		|	ПаспортУК.ДокументДатаВыдачи КАК БенефициарФЛДокументДатаВыдачи,
		|	ПаспортУК.ДокументКемВыдан КАК БенефициарФЛДокументКемВыдан,
		|	ГражданствоУК.Страна.КодАльфа2 КАК БенефициарФЛГражданство,
		|	ЕСТЬNULL(РСВ.СчетДепо.ТипСчетаБенефициараFCDR_2017_02.Код,&ПустойТипСчетаБенефициара) КАК ТипСчетаБенефициара,
		|	"""" КАК ТектовоеОписаниеТипаOTHERБенефициара,
		|	ВЫБОР
		|		КОГДА СубклиентыУК.Клиент ССЫЛКА Справочник.ЮридическиеЛица ТОГДА СубклиентыУК.Клиент.ПолноеНаименование
		|		ИНАЧЕ СубклиентыУК.Клиент.Наименование
		|	КОНЕЦ КАК БенефициарНаименование,
		|	КонтактнаяИнформацияУК.Представление КАК КлиентУКАдрес,
		|	КонтактнаяИнформацияУК.Поле1 КАК КлиентУКАдресПоле1,
		|	КонтактнаяИнформацияУК.Поле2 КАК КлиентУКАдресПоле2,
		|	КонтактнаяИнформацияУК.Поле3 КАК КлиентУКАдресПоле3,
		|	КонтактнаяИнформацияУК.Поле4 КАК КлиентУКАдресПоле4,
		|	КонтактнаяИнформацияУК.Поле5 КАК КлиентУКАдресПоле5,
		|	КонтактнаяИнформацияУК.Поле6 КАК КлиентУКАдресПоле6,
		|	КонтактнаяИнформацияУК.Поле7 КАК КлиентУКАдресПоле7,
		|	КонтактнаяИнформацияУК.Поле8 КАК КлиентУКАдресПоле8,
		|	КонтактнаяИнформацияУК.Поле9 КАК КлиентУКАдресПоле9,
		|	СпрСтраныУК.КодАльфа2 КАК КлиентУКСтранаИностранногоАдреса,
		|";
		
		ИсточникиБенефициаров =
		"	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Субклиенты КАК СубклиентыУК
		|	ПО РСВ.Клиент.УправляющаяКомпания И НЕ РСВ.Клиент.Субброкер
		|	И СубклиентыУК.Объект = РСВ.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(&Дата, 
	|			(Объект,Тип,Вид) В
	|				(ВЫБРАТЬ
	|					ЮридическиеФизическиеЛица,
	|					ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес),
	|					ВЫБОР
	|						КОГДА ЮрФизЛицо=ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо) ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресЮрЛица)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица)
	|					КОНЕЦ
	|				ИЗ ВТ_ЮрФизЛицаДокументаУК)) КАК КонтактнаяИнформацияУК
	|		ПО (КонтактнаяИнформацияУК.Объект = СубклиентыУК.Клиент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК СпрСтраныУК
	|		ПО СпрСтраныУК.Наименование = КонтактнаяИнформацияУК.Поле1
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&Дата, ФизЛицо В (ВЫБРАТЬ ЮридическиеФизическиеЛица ИЗ ВТ_ЮрФизЛицаДокументаУК)) КАК ПаспортУК
	|		ПО СубклиентыУК.Клиент = ПаспортУК.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&Дата, ФизЛицо В (ВЫБРАТЬ ЮридическиеФизическиеЛица ИЗ ВТ_ЮрФизЛицаДокументаУК)) КАК ГражданствоУК
	|		ПО СубклиентыУК.Клиент = ГражданствоУК.ФизЛицо";

		ИтогиБенефициаров =
		"	МАКСИМУМ(БенефициарЮрФизЛицо),
		|	МАКСИМУМ(БенефициарИНН),
		|	МАКСИМУМ(БенефициарТипКодаДокумента),
		|	МАКСИМУМ(БенефициарДатаДокумента),
		|	МАКСИМУМ(БенефициарНомерДокумента),
		|	МАКСИМУМ(БенефициарРегистрирующийОрган),
		|	МАКСИМУМ(БенефициарФЛДатаРождения),
		|	МАКСИМУМ(БенефициарФЛМестоРождения),
		|	МАКСИМУМ(БенефициарФЛДокументТип),
		|	МАКСИМУМ(БенефициарФЛДокументСерия),
		|	МАКСИМУМ(БенефициарФЛДокументНомер),
		|	МАКСИМУМ(БенефициарФЛДокументДатаВыдачи),
		|	МАКСИМУМ(БенефициарФЛДокументКемВыдан),
		|	МАКСИМУМ(БенефициарФЛГражданство),
		
		|	МАКСИМУМ(КлиентУКАдрес),
		|	МАКСИМУМ(КлиентУКАдресПоле1),
		|	МАКСИМУМ(КлиентУКАдресПоле2),
		|	МАКСИМУМ(КлиентУКАдресПоле3),
		|	МАКСИМУМ(КлиентУКАдресПоле4),
		|	МАКСИМУМ(КлиентУКАдресПоле5),
		|	МАКСИМУМ(КлиентУКАдресПоле6),
		|	МАКСИМУМ(КлиентУКАдресПоле7),
		|	МАКСИМУМ(КлиентУКАдресПоле8),
		|	МАКСИМУМ(КлиентУКАдресПоле9),
		|	МАКСИМУМ(КлиентУКСтранаИностранногоАдреса),
		
		|	МАКСИМУМ(ТипСчетаБенефициара),
		|	МАКСИМУМ(ТектовоеОписаниеТипаOTHERБенефициара),
		|	МАКСИМУМ(БенефициарНаименование),";
		
		ГруппировкиИтоговБенефициаров = 
		"	Бенефициар,";

	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ПоляБенефициаров КАК ПоляБенефициаров,",ПоляБенефициаров);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИсточникиБенефициаров КАК ИсточникиБенефициаров",ИсточникиБенефициаров);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ИтогиБенефициаров КАК ПоляБенефициаров,",ИтогиБенефициаров);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ГруппировкиИтоговБенефициаров,",ГруппировкиИтоговБенефициаров);
КонецПроцедуры
Процедура ВставитьПоляБанковскихРеквизитов(ТекстЗапроса,ВключатьБанковскиеРеквизиты)
	ПоляБанковскихРеквизитов = "";
	ИсточникиБанковскихРеквизитов = "";
	Если ВключатьБанковскиеРеквизиты Тогда
		ПоляБанковскихРеквизитов = 
		"	РСВ.БанковскийСчет.Владелец.Наименование КАК БанкРеквНаименованиеПолучателя,
		|	РСВ.БанковскийСчет.Владелец.АнглийскоеНаименование КАК БанкРеквАнглНаименованиеПолучателя,
		|	АдресОрганизации.Представление КАК БанкРеквАнглАдресПолучателя,
		|	РСВ.БанковскийСчет.Владелец.ИНН КАК БанкРеквИННПолучателя,
		|	РСВ.БанковскийСчет.НомерСчета КАК БанкРеквНомерСчета,
		|	РСВ.БанковскийСчет.Банк.Наименование КАК БанкРеквБанкНаименование,
		|	РСВ.БанковскийСчет.Банк.Город КАК БанкРеквБанкГород,
		|	РСВ.БанковскийСчет.Банк.Код КАК БанкРеквБИК,
		|	РСВ.БанковскийСчет.Банк.SWIFT КАК БанкРеквSWIFT,
		|	РСВ.БанковскийСчет.Банк.КоррСчет КАК БанкРеквКорСчет,
		|	РСВ.БанковскийСчет.ВалютаДенежныхСредств.Наименование КАК БанкРеквВалюта,
		|	ВЫБОР КОГДА ВалютаРегламентированногоУчета.Значение=РСВ.БанковскийСчет.ВалютаДенежныхСредств ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК БанкРеквРублевый,
		|";
		
		ИсточникиБанковскихРеквизитов =
		"
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(&Дата, 
		|			(Объект, Тип, Вид) В 
		|				(ВЫБРАТЬ Организация, ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизацииEng)
		|				ИЗ Документ.РаскрытиеСпискаВладельцев ГДЕ Ссылка = &ДокументРСВ)
		|		) КАК АдресОрганизации
		|		ПО АдресОрганизации.Объект = РСВ.Организация";

	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ПоляБанковскихРеквизитов КАК ПоляБанковскихРеквизитов,",ПоляБанковскихРеквизитов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,",
	|	&ИсточникиБанковскихРеквизитов КАК ИсточникиБанковскихРеквизитов",ИсточникиБанковскихРеквизитов);
КонецПроцедуры

Функция ОпределитьШаблонРаскрытия(ОписаниеОшибки) Экспорт
	Шаблон = ДокументРСВ.ШаблонFCDR_2017_02;
	Результат = Истина;
	Если Шаблон = "0001" Тогда
		ВключатьБенефициаров = Ложь;
		ВключатьБанковскиеРеквизиты = Ложь;
		НеобходимостьПредоставленияБанковскихРеквизитов = Ложь;
		ВыплатаЧерезНоминальногоВладельца = Ложь;
	ИначеЕсли Шаблон = "0002" Тогда
		ВключатьБенефициаров = Ложь;
		ВключатьБанковскиеРеквизиты = Ложь;
		НеобходимостьПредоставленияБанковскихРеквизитов = Истина;
		ВыплатаЧерезНоминальногоВладельца = Истина;
	ИначеЕсли Шаблон = "0003" Тогда
		ВключатьБенефициаров = Истина;
		ВключатьБанковскиеРеквизиты = Ложь;
		НеобходимостьПредоставленияБанковскихРеквизитов = Ложь;
		ВыплатаЧерезНоминальногоВладельца = Ложь;
	ИначеЕсли Шаблон = "0010" Тогда
		ВключатьБенефициаров = Ложь;
		ВключатьБанковскиеРеквизиты = Истина;
		НеобходимостьПредоставленияБанковскихРеквизитов = Истина;
		ВыплатаЧерезНоминальногоВладельца = Ложь;
	ИначеЕсли Шаблон = "0012" Тогда
		ВключатьБенефициаров = Ложь;
		ВключатьБанковскиеРеквизиты = Истина;
		НеобходимостьПредоставленияБанковскихРеквизитов = Истина;
		ВыплатаЧерезНоминальногоВладельца = Ложь;
	ИначеЕсли Шаблон = "0013" Тогда
		ВключатьБенефициаров = Истина;
		ВключатьБанковскиеРеквизиты = Истина;
		НеобходимостьПредоставленияБанковскихРеквизитов = Истина;
		ВыплатаЧерезНоминальногоВладельца = Ложь;
	ИначеЕсли Шаблон = "0014" Тогда
		ВключатьБенефициаров = Истина;
		ВключатьБанковскиеРеквизиты = Истина;
		НеобходимостьПредоставленияБанковскихРеквизитов = Истина;
		ВыплатаЧерезНоминальногоВладельца = Ложь;
	Иначе
		ОписаниеОшибки = "Не определен шаблон раскрытия";
		Результат = Ложь;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция ОшибкаДокументНеГотов(ТекущаяОшибка)
	Возврат ТекущаяОшибка+" Файл раскрытия не может быть сформирован";
КонецФункции

Функция ВыгрузитьРаскрытиеСписка_FCDR_17_02(ОписаниеОшибки,УКБезВыгодоприобретателей=Неопределено) Экспорт
	ПространствоИмен = "FCDR_2017_02(2019v3)";
	
	Запрос = Новый Запрос;
	ТекстЗапроса = ТекстЗапросаСписокРаскрытия();
	ВставитьПоляБенефициара(ТекстЗапроса, ВключатьБенефициаров);
	ВставитьПоляБанковскихРеквизитов(ТекстЗапроса, ВключатьБанковскиеРеквизиты);
	 
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ДокументРСВ", ДокументРСВ);
	Запрос.УстановитьПараметр("Дата", ДокументРСВ.Дата);
	Запрос.УстановитьПараметр("ДатаФиксации", ДокументРСВ.ДатаФиксации);
	Запрос.УстановитьПараметр("Прочее", "OTHR");
	Запрос.УстановитьПараметр("NSDR", ЗначениеКодНРД());
	Запрос.УстановитьПараметр("ИдентификаторРезидента", "OGRN");
	Запрос.УстановитьПараметр("ИдентификаторНерезидента", "INCR");
	Запрос.УстановитьПараметр("ВидОбременения", "COLO");
	Запрос.УстановитьПараметр("ПочтовыйАдресЮрлица", Константы.ВидАдресаПочтовыйДляРаскрытияСпискаFCDR_2017_02.Получить());
	Запрос.УстановитьПараметр("тзнТипыСчетовЛуч", ТаблицаКодовТиповСчетов());
	Запрос.УстановитьПараметр("ПустойТипСчетаБенефициара", "");
	
	Если ВключатьБенефициаров Тогда
		Запрос.УстановитьПараметр("ТипСчетаTRSR", "TRSR");
	КонецЕсли;
	 
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	Выборка = РезультатыЗапросов[4].Выбрать();
	Выборка.Следующий();
	
	Если НЕ Выборка.Проведен Тогда
		ОписаниеОшибки = ОшибкаДокументНеГотов("Документ " + ДокументРСВ + " не проведен.");
	КонецЕсли;
	
	НомерРаскрытия = СтрЗаменить(ОбщегоНазначенияКлиентСервер.Транслит(СокрЛП(Выборка.НомерРаскрытия)), "-", "");
	Результат = Новый Структура("Номер,Дата,ТекстДокумента,Шаблон", НомерРаскрытия, Выборка.ДатаРаскрытия, "", Выборка.Шаблон);
	
	ТипРаскрытие = ФабрикаXDTO.Пакеты.Получить(ПространствоИмен).КорневыеСвойства.Получить("REGISTER_OF_SHAREHOLDERS_V02").Тип;
	РаскрытиеXDTO = ФабрикаXDTO.Создать(ТипРаскрытие);
	
	
	ЭтоДораскрытие = Ложь;
	
	РаскрытиеXDTO.version = ВерсияФорматаFCDR();
	РаскрытиеXDTO.header = Новый_header_t(НомерРаскрытия, Выборка);
	
	//Если ТипЗнч(ДанныеИдентификацииЗапроса) = ТипМассив Тогда
	//	Для Каждого Эл Из ДанныеИдентификацииЗапроса Цикл
	//		РаскрытиеXDTO.request_identification.Добавить(Новый_request_identification_t(Эл));
	//	КонецЦикла;
	//Иначе
		РаскрытиеXDTO.request_identification.Добавить(Новый_request_identification_t(Выборка));
	//КонецЕсли;
	//РаскрытиеXDTO.doc_link.Добавить();
	
	ДокументЭмитента = НовыйДанныеДокументаДля_organization_document_t(Выборка.ЭмитентТипНомера, Неопределено, Неопределено, Выборка.ЭмитентНомер);
	АдресЭмитента = Неопределено;
	РаскрытиеXDTO.issuer.Добавить(Новый_legal_entity_details_t(Выборка.ЭмитентНаименование, ДокументЭмитента, АдресЭмитента));
	Если ЗначениеЗаполнено(Выборка.Эмитент2Номер) ИЛИ ЗначениеЗаполнено(Выборка.Эмитент2Наименование) Тогда
		ДокументЭмитента = НовыйДанныеДокументаДля_organization_document_t(Выборка.Эмитент2ТипНомера, Неопределено, Неопределено, Выборка.Эмитент2Номер);
		РаскрытиеXDTO.issuer.Добавить(Новый_legal_entity_details_t(Выборка.Эмитент2Наименование, ДокументЭмитента, АдресЭмитента));
	КонецЕсли;
	
	РаскрытиеXDTO.corporate_action_reference = Новый_corporate_action_reference_t_v03(Выборка);
	//РаскрытиеXDTO.events_linkage.Добавить();
	РаскрытиеXDTO.record_date = date_t(Выборка.ДатаФиксации);
	РаскрытиеXDTO.message_function = list_message_function_et(ЭтоДораскрытие);
	РаскрытиеXDTO.account_dtls = Новый_account_dtls_v04_t(Выборка.СчетДЕПО, Выборка.ТипСчетаДЕПО);
	
	ИдентификаторыV02 = НовыйИдентификаторыДля_id_V02_t(Выборка.ОтправительИдентификатор, Выборка.ВладелецИдентификатораОтправителя);
	РаскрытиеXDTO.account_holder = Новый_party_id_name_V03_t(Выборка.ОтправительНаименование, ИдентификаторыV02);
	РаскрытиеXDTO.information_indicator = Новый_information_type_V02_t(Выборка.ТипСписка, НеобходимостьПредоставленияБанковскихРеквизитов, Выборка.Шаблон);
	//РаскрытиеXDTO.total_security_balance.Добавить();
	
	Если ВключатьБанковскиеРеквизиты Тогда
		
		БанковскиеРеквизиты = НовыйБанковскиеРеквизиты(Выборка.БанкРеквНаименованиеПолучателя, Выборка.БанкРеквАнглНаименованиеПолучателя, Выборка.БанкРеквИННПолучателя, Выборка.БанкРеквАнглАдресПолучателя, Выборка.БанкРеквНомерСчета,
								Выборка.БанкРеквБанкНаименование, Выборка.БанкРеквБанкГород,
								Выборка.БанкРеквБИК, Выборка.БанкРеквSWIFT, Выборка.БанкРеквКорСчет, Выборка.БанкРеквВалюта);
							
		Если Выборка.БанкРеквРублевый = Истина Тогда
			БанковскиеРеквизитыРуб = БанковскиеРеквизиты;
		ИначеЕсли Выборка.БанкРеквРублевый = Ложь Тогда
			БанковскиеРеквизитыВал = БанковскиеРеквизиты;
		КонецЕсли;
		
	Иначе
		БанковскиеРеквизитыРуб = Неопределено;
		БанковскиеРеквизитыВал = Неопределено;
	КонецЕсли;
	
	РезультатЗарпосаПоТаблице = РезультатыЗапросов[5];
	Если РезультатЗарпосаПоТаблице.Пустой() Тогда
		ОписаниеОшибки = ОшибкаДокументНеГотов("Документ " + ДокументРСВ + " не заполнен.");
		Возврат Неопределено;
	КонецЕсли;
	Выборка = РезультатЗарпосаПоТаблице.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТекОшибка = "";
	Если ВыплатаЧерезНоминальногоВладельца Тогда
		ЗначениеPaymentFromNominee = Истина;
	Иначе
		ЗначениеPaymentFromNominee = Неопределено;
	КонецЕсли;
	РаскрытиеXDTO.register_list.Добавить(Новый_register_list_dtls_t(Выборка, ВключатьБенефициаров, ЭтоДораскрытие, БанковскиеРеквизитыРуб, ЗначениеPaymentFromNominee, ТекОшибка, УКБезВыгодоприобретателей));
	Если ЗначениеЗаполнено(ТекОшибка) Тогда
		ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "Ошибки заполнения списка клиентов:" + ТекОшибка;
		ЗаписьЖурналаРегистрации("Выгрузка 'Раскрытия списка владельцев FCDR_2017_02'", УровеньЖурналаРегистрации.Ошибка, , ДокументРСВ, ОписаниеОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
	//РаскрытиеXDTO.list_add_info = ;
	//РаскрытиеXDTO.pagination = ;
	//РаскрытиеXDTO.attch.Добавить();
	//РаскрытиеXDTO.signature = ;
	Если БанковскиеРеквизитыВал<>Неопределено Тогда
		ДопИнфо = Новый_any_t();
		Выборка.Сбросить();
		ДопИнфо.Добавить(ФормаXML.Элемент, ПространствоИмен, "XtnsnDt", Новый_XtnsnDt(Выборка, БанковскиеРеквизитыВал));
		РаскрытиеXDTO.add_info = ДопИнфо;
	КонецЕсли;
	//РаскрытиеXDTO.add_info = ;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("Windows-1251");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, РаскрытиеXDTO, "REGISTER_OF_SHAREHOLDERS_V02");
	
	ТекстДокумента = ЗаписьXML.Закрыть();
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "<REGISTER_OF_SHAREHOLDERS_V02 xmlns=""FCDR_2017_02(2019v3)"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"">", "<REGISTER_OF_SHAREHOLDERS_V02>");
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "xmlns="""" xmlns:d2p1=""FCDR_2017_02(2019v3)""", "");
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "d2p1:", "");
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "xsi:type=""xs:string""", "");
	Результат.ТекстДокумента = СтрЗаменить(ТекстДокумента, "xmlns=""""", "");
	
	Возврат Результат;
	
КонецФункции

Функция РезультатФормированияПакета_ФШ(СообщениеВФШНРД,УКБезВыгодоприобретателей) Экспорт
	
	Если СообщениеВФШНРД.Шаблон="0013" Тогда
		Ошибка = Новый Структура("СообщениеПользователю, СообщениеВЖурнал, Данные");
		Ошибка.СообщениеПользователю = "Сообщение в файловый шлюз не может быть сформировано для раскрытий по шаблону 0013. Воспользуйтесь выгрузкой в файл и отредактируйте его в «WEB-кабинете КД»";
		Возврат Ошибка;
	КонецЕсли;
	Если ВключатьБенефициаров Тогда
		Если ЗначениеЗаполнено(УКБезВыгодоприобретателей) Тогда
			Ошибка = Новый Структура("СообщениеПользователю, СообщениеВЖурнал, Данные");
			Ошибка.СообщениеПользователю = "Сообщение в файловый шлюз не может быть сформировано. Найдены Управляющие компании без Выгодоприобретателей:"+УКБезВыгодоприобретателей;
			Возврат Ошибка;
		КонецЕсли;
	КонецЕсли;
	
	
	ИсходящийНомер = Обработки.ЭкспортПорученийВЛуч.ФорматИсходящегоНомера(СообщениеВФШНРД.Номер);
	                                                                                                                        
	Ошибка = Обработки.ЭкспортПорученийВЛуч.СформироватьИсходящийПакетВФайловыйШлюз(ИсходящийНомер, СообщениеВФШНРД.Дата, ТипТехническойОперации(), КодТехническойОперации(), ДокументРСВ, СообщениеВФШНРД.ТекстДокумента);
	
	Если Ошибка = Неопределено Тогда
		УстановитьСтатусДокументаРСВ(Перечисления.СтатусыРаскрытияСписковВладельцев.Выгружено);
	КонецЕсли;
	
	Возврат Ошибка;
	
КонецФункции
Функция УстановитьСтатусДокументаРСВ(Статус) Экспорт
	Если ДокументРСВ.Статус <> Статус Тогда
		ДокументОбъект = ДокументРСВ.ПолучитьОбъект();
		ДокументОбъект.Статус = Статус;
		ДокументОбъект.Записать();
	КонецЕсли;
КонецФункции
Функция ВыгрузитьВФайлПоУмолчанию(СообщениеВФШНРД) Экспорт
	
	ИсходящийНомер = Обработки.ЭкспортПорученийВЛуч.ФорматИсходящегоНомера(СообщениеВФШНРД.Номер);
	
	ВнешнийИсточникФайл = ПланыВидовХарактеристик.ВнешниеИсточники.КаталогФайловРаскрытияСпискаВладельцевFCDR;	
	ПутьДляВыгрузки = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточникФайл).Папка;
	
	Ошибка = Новый Структура("СообщениеПользователю, СообщениеВЖурнал, Данные");
	Если НЕ ЗначениеЗаполнено(ПутьДляВыгрузки) Тогда
		Ошибка.СообщениеВЖурнал = "Не указан внешний источник";
		Ошибка.Данные = ВнешнийИсточникФайл;
		Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал + " " + ВнешнийИсточникФайл;
		Возврат Ошибка;
	КонецЕсли;
	
	Папка = Новый Файл(ПутьДляВыгрузки);
	Если НЕ Папка.Существует() ИЛИ НЕ Папка.ЭтоКаталог() Тогда
		Ошибка.СообщениеВЖурнал = "Каталог " + ПутьДляВыгрузки + " не существует";
		Ошибка.Данные = ВнешнийИсточникФайл;
		Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал + " " + ВнешнийИсточникФайл;
		Возврат Ошибка;
	КонецЕсли;	
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ПутьДляВыгрузки+"\"+ИсходящийНомер+".xml", "windows-1251");
	ЗаписьXML.ЗаписатьБезОбработки(СообщениеВФШНРД.ТекстДокумента);
	ЗаписьXML.Закрыть();
	
	УстановитьСтатусДокументаРСВ(Перечисления.СтатусыРаскрытияСписковВладельцев.Выгружено);
	
	Возврат Неопределено;
КонецФункции

Функция ВизуализацияHTML(СообщениеВФШНРД) Экспорт
	Макет = ПолучитьМакет("ПреобразованиеXSL").ПолучитьТекст();
	Преобразование = Новый ПреобразованиеXSL;
	Преобразование.ЗагрузитьИзСтроки(Макет);
	Возврат Преобразование.ПреобразоватьИзСтроки(СообщениеВФШНРД.ТекстДокумента);
КонецФункции

// ЗАГРУЗКА. Идентификация типа документа
// Параметры:
//   ТекстДокумента - Строка - данные файла xml.
//   СообщениеОбОшибке - Строка - данные об ошибках обработки файла.
//   Регламент - Булево - показатель запуска загрузки РСВ регламентом.
//   ДокументСоздан - Булево - показатель успешности создания документа РСВ в 1С для помещения входящего файла в архив
//   ИмяКаталога - Строка
Процедура ЗагрузитьВходящийДокументИзТекста(ТекстДокумента, СообщениеОбОшибке, Регламент = Ложь, ДокументСоздан = Ложь,
											ИмяКаталога = Неопределено) Экспорт
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстДокумента);
	ЗагрузитьВходящийДокументXML(ЧтениеXML, СообщениеОбОшибке, Регламент, ДокументСоздан, ИмяКаталога);
КонецПроцедуры

Процедура ЗагрузитьВходящийДокументXML(ЧтениеXML, СообщениеОбОшибке, Регламент = Ложь, ДокументСоздан = Ложь,
										ИмяКаталога = Неопределено) Экспорт
	Если ЧтениеXML.Прочитать() Тогда
		ИмяОбъекта = ВРЕГ(ЧтениеXML.Имя);
		Если ИмяОбъекта = "DISCLOSURE_REQUEST" Тогда
			СформироватьДокументЗапросНаРаскрытие(ЧтениеXML, СообщениеОбОшибке, Регламент, ДокументСоздан);
		ИначеЕсли ИмяОбъекта = "REGISTER_OF_SHAREHOLDERS_STATUS_ADVICE" Тогда
			СформироватьДокументОтчетОСтатусеРСВ(ЧтениеXML, СообщениеОбОшибке);
		ИначеЕсли ИмяОбъекта = "STATEMENT_OF_HOLDINGS" Тогда
			СформироватьВыпискуИзРеестра(ЧтениеXML, ИмяКаталога, СообщениеОбОшибке, Регламент, ДокументСоздан);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//ЗАГРУЗКА ЗАПРОСА
Функция ПолучитьБулево(YesNo)
	Возврат ВРег(YesNo)="YES";
КонецФункции
Функция ПолучитьДату(СтрокаДата)
	Возврат XMLЗначение(Тип("Дата"),СтрокаДата);
КонецФункции
Процедура ПолучитьРеквизитыЗаголовкаСообщения(header, Номер, Дата, КодПолучателя, СообщениеОбОшибке)
	Номер = header.doc_num;
	Дата = ПолучитьДату(header.doc_date.date);
	
	КодПолучателя = Неопределено;
	Ид = header.to.id_2;
	Если ЭтоСписокXDTO(Ид) Тогда
		Для Каждого Эл Из ИД Цикл
			Если ЭтоКодНРД(Эл) Тогда
				КодПолучателя = Эл.id;
				Прервать;
			КонецЕсли;
		КонецЦикла
	Иначе
		Если ЭтоКодНРД(Ид) Тогда
			КодПолучателя = Ид.id;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(КодПолучателя) Тогда
		СообщениеОбОшибке = СообщениеОбОшибке+Символы.ПС+"Не заполнен код получателя";
	КонецЕсли;
КонецПроцедуры
Функция ЗначениеКодНРД()
	Возврат "NSDR";
КонецФункции
Функция ЭтоКодНРД(Элемент)
	Возврат  ЭтоПрочее(Элемент.id_type) И Элемент.narrative=ЗначениеКодНРД();
КонецФункции
Функция ЭтоОГРН(Документ)
	Возврат Документ.organization_code_type = "OGRN" Или Документ.organization_code_type = "REGN";
КонецФункции
Функция ЭтоИД_ПИФ_ИСУ(Документ)
	Возврат Документ.organization_code_type="TMRL" ИЛИ Документ.organization_code_type="MMRL";
КонецФункции

Процедура ПолучитьЦеннуюБумагу(ЦеннаяБумага, ДанныеЦБ)
	СвойстваЦБ = ЦеннаяБумага.security.Свойства();
	КодНРД = Неопределено;
	ISIN = Неопределено;
	НомерРегистрации = Неопределено;
	ДатаГосРег = Неопределено;
	Количество = 0;
	Если СвойстваЦБ.Получить("proprietary_security_code")<>Неопределено Тогда
		Если ЦеннаяБумага.security.proprietary_security_code.issuer = ЗначениеКодНРД() Тогда
			КодНРД = ЦеннаяБумага.security.proprietary_security_code.id;
		КонецЕсли;
	КонецЕсли;
	Если СвойстваЦБ.Получить("ISIN_identifier")<>Неопределено Тогда
		ISIN = ЦеннаяБумага.security.ISIN_identifier;
	КонецЕсли;
	
	Если СвойстваЦБ.Получить("state_reg_num") <> Неопределено Тогда
		НомерРегистрации = ЦеннаяБумага.security.state_reg_num;
	КонецЕсли;
	Если СвойстваЦБ.Получить("state_reg_date") <> Неопределено Тогда
		ДатаГосРег = ПолучитьДату(ЦеннаяБумага.security.state_reg_date);
	КонецЕсли;
	
	Количество = ЦеннаяБумага.total.qty_units.units;
	
	Если ЗначениеЗаполнено(ДанныеЦБ.КодНРД1) ИЛИ ЗначениеЗаполнено(ДанныеЦБ.ISIN1) Тогда
		ДанныеЦБ.ISIN2 = ISIN;
		ДанныеЦБ.КодНРД2 = КодНРД;
		ДанныеЦБ.НомерРегистрации2 = НомерРегистрации;
		ДанныеЦБ.ДатаГосРег2 = ДатаГосРег;
		ДанныеЦБ.Остаток2 = Количество;
	Иначе
		ДанныеЦБ.ISIN1 = ISIN;
		ДанныеЦБ.КодНРД1 = КодНРД;
		ДанныеЦБ.НомерРегистрации1 = НомерРегистрации;
		ДанныеЦБ.ДатаГосРег1 = ДатаГосРег;
		ДанныеЦБ.Остаток1 = Количество;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьСписокЦенныхБумаг(СписокЦБ, ДанныеЦБ, Отказ, СообщениеОбОшибке)
	
	Если ЭтоСписокXDTO(СписокЦБ) Тогда
		Для Каждого ЦБ Из СписокЦБ Цикл
			ПолучитьЦеннуюБумагу(ЦБ, ДанныеЦБ);
		КонецЦикла;
	Иначе
		ПолучитьЦеннуюБумагу(СписокЦБ, ДанныеЦБ);
	КонецЕсли;
		
	ЕстьДанныеДляОпределенияЦБ = ЗначениеЗаполнено(ДанныеЦБ.ISIN1) Или ЗначениеЗаполнено(ДанныеЦБ.КодНРД1)
	Или (ЗначениеЗаполнено(ДанныеЦБ.НомерРегистрации1) И ЗначениеЗаполнено(ДанныеЦБ.ДатаГосРег1));
	
	Если Не ЕстьДанныеДляОпределенияЦБ Тогда
		СообщениеОбОшибке = СообщениеОбОшибке + Символы.ПС
		+ "Не заполнены ISIN, код НРД, номер регистрации и дата гос регистрации ценной бумаги для запроса по счету "
		+ ДанныеЦБ.СчетДепо;
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
Функция ПолучитьДанныеЭмитента(Эмитент,ДокументЭмитента,ОГРНЭмитента,Эмитент2Наименование,Эмитент2Номер,Эмитент2ТипНомера)
	Если ЭтоОГРН(ДокументЭмитента) Тогда
		Если НЕ ДокументЭмитента.Свойства().Получить("org_doc_num") = Неопределено Тогда
			ОГРНЭмитента = ДокументЭмитента.org_doc_num.doc_num;
		КонецЕсли;
		Результат = Истина;
	ИначеЕсли ЭтоИД_ПИФ_ИСУ(ДокументЭмитента) Тогда
		Эмитент2Наименование = Эмитент.legal_entity_name;
		Эмитент2Номер = ДокументЭмитента.org_doc_num.doc_num;
		Эмитент2ТипНомера = ДокументЭмитента.organization_code_type;
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция ПолучитьЭмитента(Эмитент,ОГРНЭмитента,Эмитент2Наименование,Эмитент2Номер,Эмитент2ТипНомера)
	Результат = Ложь;
	ИдентификаторыЭмитента = Эмитент.legal_entity_id;
	Если ЭтоСписокXDTO(ИдентификаторыЭмитента.organization_id) Тогда
		Для Каждого Документ ИЗ ИдентификаторыЭмитента.organization_id Цикл
			Если ПолучитьДанныеЭмитента(Эмитент, Документ, ОГРНЭмитента, Эмитент2Наименование, Эмитент2Номер, Эмитент2ТипНомера) Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Результат = ПолучитьДанныеЭмитента(Эмитент, ИдентификаторыЭмитента.organization_id, ОГРНЭмитента, Эмитент2Наименование, Эмитент2Номер, Эмитент2ТипНомера);
	КонецЕсли;
	Возврат Результат;
КонецФункции
Процедура ПолучитьЭмитентовСообщения(issuer, ОГРНЭмитента,Эмитент2Наименование,Эмитент2Номер,Эмитент2ТипНомера,СообщениеОбОшибке)
	Если ЭтоСписокXDTO(issuer) Тогда
		Для Каждого Эмитент Из issuer Цикл
			ПолучитьЭмитента(Эмитент,ОГРНЭмитента,Эмитент2Наименование,Эмитент2Номер,Эмитент2ТипНомера);
		КонецЦикла;
	Иначе
		ПолучитьЭмитента(issuer,ОГРНЭмитента,Эмитент2Наименование,Эмитент2Номер,Эмитент2ТипНомера);
	КонецЕсли;
КонецПроцедуры
Функция ИнициаторПоКодуЗагрузки(КодЗагрузки)
	МхПоУмолчанию = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияПоУмолчанию");
	Если ЗначениеЗаполнено(КодЗагрузки) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КодыЗагрузки.Владелец КАК Владелец
		|ИЗ
		|	Справочник.КодыЗагрузки КАК КодыЗагрузки
		|ГДЕ
		|	КодыЗагрузки.Код = &Код
		|	И КодыЗагрузки.Биржа = &Биржа
		|	И КодыЗагрузки.Владелец ССЫЛКА Справочник.МестаХранения
		|	И НЕ КодыЗагрузки.ПометкаУдаления
		|	И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ КодыЗагрузки.ДатаОкончанияДействия < &ТекущаяДата)");
		Запрос.УстановитьПараметр("Код", КодЗагрузки);
		Запрос.УстановитьПараметр("Биржа", Справочники.КлассификаторыЗагрузки.НДЦ());
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат МхПоУмолчанию;
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Возврат Выборка.Владелец;
		КонецЕсли;
	Иначе
		Возврат МхПоУмолчанию;
	КонецЕсли;
КонецФункции

Функция НовыйТипСписка(Код)
	ТипСпискаОбъект	= Справочники.РСВ_ТипСписка.СоздатьЭлемент();
	ТипСпискаОбъект.Код = Код;
	ТипСпискаОбъект.Записать();
	Возврат ТипСпискаОбъект.Ссылка;
КонецФункции

Процедура ТектовоеПредставлениеЭлемента(Элемент, Результат, НачалоЗначения="")
	ТипОбъектXDTO = Тип("ОбъектXDTO");
	ТипСписокXDTO = Тип("СписокXDTO");
	СвойстваЭлемента = Элемент.Свойства();
	Для Каждого Свойство Из СвойстваЭлемента Цикл
		
		Если Свойство.ВерхняяГраница=1 Тогда
			ВложенныйЭлемент = Элемент.Получить(Свойство);
		Иначе
			ВложенныйЭлемент = Элемент.ПолучитьСписок(Свойство);
		КонецЕсли;
		ТипЗнчЭлемент = ТипЗнч(ВложенныйЭлемент);
		
		ТекСтрока = НачалоЗначения+Свойство.Имя;
		
		Если ТипЗнчЭлемент=ТипОбъектXDTO Тогда
			ТекСтрока = ТекСтрока+"/";
			ТектовоеПредставлениеЭлемента(ВложенныйЭлемент, Результат, ТекСтрока);
			
		ИначеЕсли ТипЗнчЭлемент=ТипСписокXDTO Тогда
			Инд=0;
			Для Каждого Эл Из ВложенныйЭлемент Цикл
				Инд = Инд+1;
				ТекСтрокаСписка = ТекСтрока+"["+Формат(Инд,"ЧГ=")+"]";
				Если ТипЗнч(Эл)= ТипОбъектXDTO Тогда
					ТектовоеПредставлениеЭлемента(Эл, Результат, ТекСтрокаСписка);
				Иначе
					Если Результат<>"" Тогда
						Результат = Результат+Символы.ПС;
					КонецЕсли;
					Результат = Результат + ТекСтрокаСписка+": "+Эл;
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			Если Результат<>"" Тогда
				Результат = Результат+Символы.ПС;
			КонецЕсли;
			Результат = Результат + ТекСтрока+": "+ВложенныйЭлемент;
		КонецЕсли;
			
	КонецЦикла;
КонецПроцедуры

Функция ЗагрузитьЗапросНаРаскрытиеИзФайла(ИмяФайлаЗапроса, СообщениеОбОшибке) Экспорт
	СообщениеОбОшибке = "";
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайлаЗапроса);

	Возврат СформироватьДокументЗапросНаРаскрытие(ЧтениеXML, СообщениеОбОшибке)
КонецФункции
Функция ЗагрузитьЗапросНаРаскрытиеИзТекста(ТекстЗапроса, СообщениеОбОшибке) Экспорт
	СообщениеОбОшибке = "";
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстЗапроса);

	Возврат СформироватьДокументЗапросНаРаскрытие(ЧтениеXML, СообщениеОбОшибке)
КонецФункции
Функция СформироватьДокументЗапросНаРаскрытие(XMLЗапросНРД, СообщениеОбОшибке, Регламент = Ложь, ДокументСоздан = Ложь) Экспорт
	Отказ = Ложь;
	ПространствоИмен = "FCDR_2017_02(2019v3)";
	
	ТипXDTO = ФабрикаXDTO.Тип(ПространствоИмен, "DISCLOSURE_REQUEST");
	ЗапросНРД = ФабрикаXDTO.ПрочитатьXML(XMLЗапросНРД, ТипXDTO);
	
	ДатаДокумента = ТекущаяДатаСеанса();
	Попытка
		КодЗагрузкиИнициатора = ЗапросНРД.header.from.id_2.id;
	Исключение
		ЗаписьЖурналаРегистрации(
			"Загрузка Раскрытия списков владельцев в формате FCDR 2017 02",
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КодЗагрузкиИнициатора = Неопределено;
	КонецПопытки;
	Инициатор = ИнициаторПоКодуЗагрузки(КодЗагрузкиИнициатора);
	
	ВходящийДокументНомер = "";
	ВходящийДокументДата = "";
	КодПолучателя = "";
	ПолучитьРеквизитыЗаголовкаСообщения(ЗапросНРД.header, ВходящийДокументНомер, ВходящийДокументДата, КодПолучателя, СообщениеОбОшибке);
	
	КДРеференс = ЗапросНРД.corporate_action_reference.corp_actn_evt_id;
	ВидКД = ЗапросНРД.corporate_action_reference.corporate_action_code;
	ДатаФиксации = ПолучитьДату(ЗапросНРД.record_date);
	ДатаОкончанияПриема = ПолучитьДату(ЗапросНРД.response_deadline);
	
	ПредоставитьБанковскиеРеквизиты = ПолучитьБулево(ЗапросНРД.information_indicator.request_bank_details);
	Шаблон = ЗапросНРД.information_indicator.disclosure_template;
	ТипСпискаКод = ЗапросНРД.information_indicator.information_type_code;
	
	REPORT_ID = ЗапросНРД.header.doc_num;
	ОснованиеЗапросаСтрокой = ЗапросНРД.basis_of_request.laws_in_place_code;
	ИнициаторЗапросаСтрокой = ЗапросНРД.initiator_request.initiator_request_type_code;
	ИнициаторЗапроса = Справочники.ТипыИнициатораЗапросаFCDR_2017_02.НайтиПоКоду(ИнициаторЗапросаСтрокой);
	ОснованиеЗапроса = Справочники.КодыСоответствияЗаконодательномуАктуFCDR_2017_02.НайтиПоКоду(ОснованиеЗапросаСтрокой);
	ОснованиеЗапросаОписание = ОснованиеЗапроса.Описание;
	ВыгрузкаPARTADВCоответствииCоCтатьей8_6_1 = (ОснованиеЗапросаСтрокой = "OWNS");
	СвойстваBasis = ЗапросНРД.basis_of_request.Свойства();
	Если СвойстваBasis.Получить("subordinate_legislation") <> Неопределено Тогда
		ПодзаконныйАкт = ЗапросНРД.basis_of_request.subordinate_legislation;
	КонецЕсли;

	ДополнительноеОписаниеОснованияЗапроса = "";
	Если ОснованиеЗапросаСтрокой = "OTHR" ИЛИ СвойстваBasis.Получить("narrative") <> Неопределено Тогда
		ДополнительноеОписаниеОснованияЗапроса = ЗапросНРД.basis_of_request.narrative;
	КонецЕсли;
	ДатаПоступленияЗапроса = ТекущаяДатаСеанса();
	
	СвойстваЗапроса = ЗапросНРД.Свойства();
	Комментарий = "";
	Если СвойстваЗапроса.Получить("add_info") <> Неопределено Тогда
		ТектовоеПредставлениеЭлемента(ЗапросНРД.add_info, Комментарий);
	КонецЕсли;
	
	ОГРНЭмитента = Неопределено;
	Эмитент2Наименование = Неопределено;
	Эмитент2Номер = Неопределено;
	Эмитент2ТипНомера = Неопределено;
	ПолучитьЭмитентовСообщения(ЗапросНРД.issuer, ОГРНЭмитента, Эмитент2Наименование, Эмитент2Номер, Эмитент2ТипНомера, СообщениеОбОшибке);
	
	ТипНомерСчета = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(20));
	ТипКодISIN = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	ТипНомерРегистрации = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ТипДатаГосРег = Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ТипОстатокЦБ = Метаданные.ОпределяемыеТипы.КоличествоЦБ.Тип;
	СчетаДепоИЦБ = Новый ТаблицаЗначений;
	СчетаДепоИЦБ.Колонки.Добавить("СчетДепо", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(17)));
	СчетаДепоИЦБ.Колонки.Добавить("ISIN1", ТипКодISIN);
	СчетаДепоИЦБ.Колонки.Добавить("ISIN2", ТипКодISIN);
	СчетаДепоИЦБ.Колонки.Добавить("КодНРД1", ТипКодISIN);
	СчетаДепоИЦБ.Колонки.Добавить("КодНРД2", ТипКодISIN);
	СчетаДепоИЦБ.Колонки.Добавить("Остаток1", ТипОстатокЦБ);
	СчетаДепоИЦБ.Колонки.Добавить("Остаток2", ТипОстатокЦБ);
	СчетаДепоИЦБ.Колонки.Добавить("НомерРегистрации1", ТипНомерРегистрации);
	СчетаДепоИЦБ.Колонки.Добавить("ДатаГосРег1", ТипДатаГосРег);
	СчетаДепоИЦБ.Колонки.Добавить("НомерРегистрации2", ТипНомерРегистрации);
	СчетаДепоИЦБ.Колонки.Добавить("ДатаГосРег2", ТипДатаГосРег);
	СчетаДепоИЦБ.Колонки.Добавить("НомерСчета", ТипНомерСчета);
	
	Если ЭтоСписокXDTO(ЗапросНРД.registered_shareholders) Тогда
		Для Каждого Эл Из ЗапросНРД.registered_shareholders Цикл
			НовСтр = СчетаДепоИЦБ.Добавить();
			НовСтр.СчетДепо = Эл.account_dtls.account_id.id;
			ПолучитьСписокЦенныхБумаг(Эл.security_balance, НовСтр, Отказ, СообщениеОбОшибке);
			ПолучитьНомерБанковскогоСчета(Эл, НовСтр, ПредоставитьБанковскиеРеквизиты);
		КонецЦикла;
	Иначе
		НовСтр = СчетаДепоИЦБ.Добавить();
		НовСтр.СчетДепо = ЗапросНРД.registered_shareholders.account_dtls.account_id.id;
		ПолучитьСписокЦенныхБумаг(ЗапросНРД.registered_shareholders.security_balance, НовСтр, Отказ, СообщениеОбОшибке);
		ПолучитьНомерБанковскогоСчета(ЗапросНРД.registered_shareholders, НовСтр, ПредоставитьБанковскиеРеквизиты);
	КонецЕсли;

	Если Отказ И НЕ Регламент Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныхДляРСВ();
	Запрос.Параметры.Вставить("КодПолучателя", КодПолучателя);
	Запрос.Параметры.Вставить("КДРеференс", КДРеференс);
	Запрос.Параметры.Вставить("ОГРНЭмитента", ОГРНЭмитента);
	Запрос.Параметры.Вставить("ТипСписка", ТипСпискаКод);
	Запрос.Параметры.Вставить("ВидКД", ВидКД);
	Запрос.Параметры.Вставить("тзн", СчетаДепоИЦБ);
	Запрос.Параметры.Вставить("Дата", ВходящийДокументДата);
	Запрос.Параметры.Вставить("ДатаФиксации", ДатаФиксации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ТипСписка = Неопределено;
	Если Выборка.Следующий() Тогда
		
		Если НЕ ЗначениеЗаполнено(Выборка.Организация) И ЗначениеЗаполнено(КодПолучателя) Тогда
			СообщениеОбОшибке = СообщениеОбОшибке + Символы.ПС + "Неизвестный получатель запроса «" + КодПолучателя + "»";
			Отказ = Истина;
		Иначе
		
			Если НЕ ЗначениеЗаполнено(Выборка.ВидКорпоративногоДействия) Тогда
				СообщениеОбОшибке = СообщениеОбОшибке + Символы.ПС + "Неизвестный вид КД";
				Отказ = Истина;
			Иначе
				
				ТипСписка = Выборка.ТипСписка;
				Если НЕ ЗначениеЗаполнено(ТипСписка) И ЗначениеЗаполнено(ТипСпискаКод) Тогда
					ТипСписка = НовыйТипСписка(ТипСпискаКод);
				КонецЕсли;
		
				Если НЕ ЗначениеЗаполнено(Выборка.Эмитент) И ЗначениеЗаполнено(ОГРНЭмитента) Тогда
					СообщениеОбОшибке = СообщениеОбОшибке + Символы.ПС + "Не найден эмитент с ОГРН «" + ОГРНЭмитента + "»";
					Отказ = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Выборка.ЦеннаяБумага1) Тогда
				СообщениеОбОшибке = СообщениеОбОшибке + Символы.ПС + "Не удалось обнаружить ценную бумагу «" + Выборка.ISIN1 + "»";
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Не Отказ ИЛИ Регламент Тогда
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл
			
			Док = Документы.РаскрытиеСпискаВладельцев.СоздатьДокумент();
			
			Док.ШаблонFCDR_2017_02 = Шаблон;
			Док.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.FCDR_2017_02;
			Док.Дата = ДатаДокумента;
			Док.ВходящийДокументНомер = ВходящийДокументНомер;
			Док.ВходящийДокументДата = ВходящийДокументДата;
			Док.Инициатор = Инициатор;
			Док.КДРеференс = КДРеференс;
			Док.ДатаФиксации = ДатаФиксации;
			Док.ДатаОкончанияПриема = ДатаОкончанияПриема;
			Док.Эмитент2Наименование = Эмитент2Наименование;
			Док.Эмитент2Номер = Эмитент2Номер;
			Док.Эмитент2ТипНомера = Эмитент2ТипНомера;
			Док.Комментарий = Комментарий;
			Остаток1 = 0;
			Остаток2 = 0;
			
			Док.REPORT_ID = REPORT_ID;
			Док.ОснованиеЗапроса = ОснованиеЗапросаОписание;
			Док.ИнициаторЗапроса = ИнициаторЗапроса;
			Док.КодОснованияЗапроса = ОснованиеЗапроса;
			Док.ВыгрузкаPARTADВCоответствииCоCтатьей8_6_1 = ВыгрузкаPARTADВCоответствииCоCтатьей8_6_1;
			Док.ДатаПоступленияЗапроса = ДатаПоступленияЗапроса;
			Док.ПодзаконныйАкт = ПодзаконныйАкт;
			Док.ДополнительноеОписаниеОснованияЗапроса = ДополнительноеОписаниеОснованияЗапроса;
			Док.ПредоставитьБанковскиеРеквизиты = ПредоставитьБанковскиеРеквизиты;

			
			ЗаполнитьЗначенияСвойств(Док, Выборка);
			Док.Эмитент = Док.ЦеннаяБумага1.Эмитент;
			
			ОГРНЦБЭмитента = СокрЛП(Док.ЦеннаяБумага1.Эмитент.ЮридическиеФизическиеЛица.ОГРН);
			Если ОГРНРазличается(ОГРНЭмитента, ОГРНЦБЭмитента) Тогда
				СообщениеОбОшибке = СообщениеОбОшибке + Символы.ПС + "ОГРН указанного эмитента в раскрытии «" + ОГРНЭмитента + "» 
					|не совпадает с ОГРН по эмитенту в ЦБ «" + ОГРНЦБЭмитента + "»";
				Отказ = Истина;
				Прервать;
			КонецЕсли;
			Док.ТипСписка = ТипСписка;
			
			Если ПредоставитьБанковскиеРеквизиты Тогда
				Док.БанковскийСчет = Выборка.БанковскийСчетИзФайла;
			КонецЕсли;
			
			Док.Записать();
		КонецЦикла;
		ДокументСоздан = Не Отказ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда 
		СообщениеОбОшибке = "Ошибки загрузки DISCLOSURE REQUEST " + ВходящийДокументНомер + ": " + СообщениеОбОшибке;
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

Функция ТекстЗапросаДанныхДляРСВ()
	Возврат
	"ВЫБРАТЬ
	|	тзнЗапросНРД.СчетДепо КАК СчетДепо,
	|	тзнЗапросНРД.КодНРД1 КАК КодНРД1,
	|	тзнЗапросНРД.КодНРД2 КАК КодНРД2,
	|	тзнЗапросНРД.ISIN1 КАК ISIN1,
	|	тзнЗапросНРД.ISIN2 КАК ISIN2,
	|	тзнЗапросНРД.Остаток1 КАК Остаток1,
	|	тзнЗапросНРД.Остаток2 КАК Остаток2,
	|	тзнЗапросНРД.НомерРегистрации1 КАК НомерРегистрации1,
	|	тзнЗапросНРД.ДатаГосРег1 КАК ДатаГосРег1,
	|	тзнЗапросНРД.НомерРегистрации2 КАК НомерРегистрации2,
	|	тзнЗапросНРД.ДатаГосРег2 КАК ДатаГосРег2,
	|	тзнЗапросНРД.НомерСчета КАК НомерСчета
	|ПОМЕСТИТЬ ВТ_ЗапросНРД
	|ИЗ
	|	&тзн КАК тзнЗапросНРД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗапросНРД.НомерРегистрации1 КАК НомерРегистрации,
	|	ВТ_ЗапросНРД.ДатаГосРег1 КАК ДатаГосРег,
	|	МАКСИМУМ(ЕСТЬNULL(ЦБпоНомеруИДатеРегистрации.Ссылка, ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка))) КАК ЦеннаяБумага
	|ПОМЕСТИТЬ ЦБпоНомеруИДатеРегистрации1
	|ИЗ
	|	ВТ_ЗапросНРД КАК ВТ_ЗапросНРД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦБпоНомеруИДатеРегистрации
	|		ПО (ВТ_ЗапросНРД.НомерРегистрации1 <> """")
	|			И ВТ_ЗапросНРД.НомерРегистрации1 = ЦБпоНомеруИДатеРегистрации.НомерРегистрации
	|			И ВТ_ЗапросНРД.ДатаГосРег1 = ЦБпоНомеруИДатеРегистрации.ДатаГосРег
	|			И (НЕ ЦБпоНомеруИДатеРегистрации.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗапросНРД.НомерРегистрации1,
	|	ВТ_ЗапросНРД.ДатаГосРег1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗапросНРД.НомерРегистрации2 КАК НомерРегистрации,
	|	ВТ_ЗапросНРД.ДатаГосРег2 КАК ДатаГосРег,
	|	МАКСИМУМ(ЕСТЬNULL(ЦБпоНомеруИДатеРегистрации.Ссылка, ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка))) КАК ЦеннаяБумага
	|ПОМЕСТИТЬ ЦБпоНомеруИДатеРегистрации2
	|ИЗ
	|	ВТ_ЗапросНРД КАК ВТ_ЗапросНРД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦБпоНомеруИДатеРегистрации
	|		ПО (ВТ_ЗапросНРД.НомерРегистрации2 <> """")
	|			И ВТ_ЗапросНРД.НомерРегистрации2 = ЦБпоНомеруИДатеРегистрации.НомерРегистрации
	|			И ВТ_ЗапросНРД.ДатаГосРег2 = ЦБпоНомеруИДатеРегистрации.ДатаГосРег
	|			И (НЕ ЦБпоНомеруИДатеРегистрации.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗапросНРД.НомерРегистрации2,
	|	ВТ_ЗапросНРД.ДатаГосРег2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Таб.Организация) КАК Организация,
	|	МАКСИМУМ(Таб.КарточкаКД) КАК КарточкаКД,
	|	МАКСИМУМ(Таб.Эмитент) КАК Эмитент,
	|	МАКСИМУМ(Таб.ТипСписка) КАК ТипСписка,
	|	ЕСТЬNULL(ЕСТЬNULL(КодыЦБ1.Владелец, СпрЦБ1.Ссылка), ЦБпоНомеруИДатеРегистрации1.ЦеннаяБумага) КАК ЦеннаяБумага1,
	|	ЕСТЬNULL(ЕСТЬNULL(КодыЦБ2.Владелец, СпрЦБ2.Ссылка), ЦБпоНомеруИДатеРегистрации2.ЦеннаяБумага) КАК ЦеннаяБумага2,
	|	ЗапросНРД.ISIN1 КАК ISIN1,
	|	ЗапросНРД.ISIN2 КАК ISIN2,
	|	ЗапросНРД.КодНРД1 КАК КодНРД1,
	|	ЗапросНРД.КодНРД2 КАК КодНРД2,
	|	ЗапросНРД.Остаток1 КАК ЦеннаяБумага1Остаток,
	|	ЗапросНРД.Остаток2 КАК ЦеннаяБумага2Остаток,
	|	МАКСИМУМ(Таб.ВидКорпоративногоДействия) КАК ВидКорпоративногоДействия,
	|	СчетаМХ.Ссылка КАК СчетДепо,
	|	МАКСИМУМ(БанковскиеСчета.Ссылка) КАК БанковскийСчет,
	|	МАКСИМУМ(ЕСТЬNULL(БанковскиеСчетаИзФайла.Ссылка, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка))) КАК БанковскийСчетИзФайла
	|ИЗ
	|	ВТ_ЗапросНРД КАК ЗапросНРД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.КлассификаторЗагрузкиНДЦ КАК КлассификаторЗагрузкиНДЦ
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДепоМХ КАК СчетаМХ
	|		ПО (СчетаМХ.Код = ЗапросНРД.СчетДепо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЦБ1
	|		ПО (КодыЦБ1.Код = ЗапросНРД.КодНРД1)
	|			И (КодыЦБ1.Биржа = КлассификаторЗагрузкиНДЦ.Значение)
	|			И (КодыЦБ1.Владелец ССЫЛКА Справочник.ЦенныеБумаги)
	|			И (НЕ КодыЦБ1.ПометкаУдаления)
	|			И (КодыЦБ1.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЦБ1.ДатаОкончанияДействия > &ДатаФиксации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК СпрЦБ1
	|		ПО (СпрЦБ1.ISIN = ЗапросНРД.ISIN1)
	|			И (ЗапросНРД.КодНРД1 = """")
	|			И (ЗапросНРД.ISIN1 <> """")
	|			И (НЕ СпрЦБ1.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЦБ2
	|		ПО (КодыЦБ2.Код = ЗапросНРД.КодНРД2)
	|			И (КодыЦБ2.Биржа = КлассификаторЗагрузкиНДЦ.Значение)
	|			И (КодыЦБ1.Владелец ССЫЛКА Справочник.ЦенныеБумаги)
	|			И (НЕ КодыЦБ2.ПометкаУдаления)
	|			И (КодыЦБ2.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЦБ2.ДатаОкончанияДействия > &ДатаФиксации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК СпрЦБ2
	|		ПО (СпрЦБ2.ISIN = ЗапросНРД.ISIN2)
	|			И (ЗапросНРД.КодНРД2 = """")
	|			И (ЗапросНРД.ISIN2 <> """")
	|			И (НЕ СпрЦБ2.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦБпоНомеруИДатеРегистрации1 КАК ЦБпоНомеруИДатеРегистрации1
	|		ПО (ЗапросНРД.НомерРегистрации1 <> """")
	|			И ЗапросНРД.НомерРегистрации1 = ЦБпоНомеруИДатеРегистрации1.НомерРегистрации
	|			И ЗапросНРД.ДатаГосРег1 = ЦБпоНомеруИДатеРегистрации1.ДатаГосРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦБпоНомеруИДатеРегистрации2 КАК ЦБпоНомеруИДатеРегистрации2
	|		ПО (ЗапросНРД.НомерРегистрации2 <> """")
	|			И ЗапросНРД.НомерРегистрации2 = ЦБпоНомеруИДатеРегистрации2.НомерРегистрации
	|			И ЗапросНРД.ДатаГосРег2 = ЦБпоНомеруИДатеРегистрации2.ДатаГосРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Таб.Организация КАК Организация,
	|			Таб.КарточкаКД КАК КарточкаКД,
	|			Таб.Эмитент КАК Эмитент,
	|			Таб.ТипСписка КАК ТипСписка,
	|			Таб.ВидКорпоративногоДействия КАК ВидКорпоративногоДействия
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Таб.Ссылка КАК Организация,
	|				NULL КАК КарточкаКД,
	|				NULL КАК Эмитент,
	|				NULL КАК ТипСписка,
	|				NULL КАК ВидКорпоративногоДействия
	|			ИЗ
	|				Справочник.КодыЗагрузки КАК СпрКоды
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Таб
	|					ПО (Таб.ЮридическоеЛицо = СпрКоды.Владелец)
	|			ГДЕ
	|				СпрКоды.Код = &КодПолучателя
	|				И НЕ СпрКоды.ПометкаУдаления
	|				И СпрКоды.Владелец ССЫЛКА Справочник.ЮридическиеЛица
	|				И (СпрКоды.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|						ИЛИ СпрКоды.ДатаОкончанияДействия > &Дата)
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				NULL,
	|				Таб.Ссылка,
	|				NULL,
	|				NULL,
	|				NULL
	|			ИЗ
	|				Документ.КорпоративноеДействие_Новый КАК Таб
	|			ГДЕ
	|				Таб.КДРеференс = &КДРеференс
	|				И НЕ Таб.ПометкаУдаления
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				NULL,
	|				NULL,
	|				Таб.Ссылка,
	|				NULL,
	|				NULL
	|			ИЗ
	|				Справочник.Контрагенты КАК Таб
	|			ГДЕ
	|				Таб.ЮридическиеФизическиеЛица.ОГРН = &ОГРНЭмитента
	|				И НЕ Таб.ПометкаУдаления
	|				И Таб.Родитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.Эмитенты)
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				NULL,
	|				NULL,
	|				NULL,
	|				Таб.Ссылка,
	|				NULL
	|			ИЗ
	|				Справочник.РСВ_ТипСписка КАК Таб
	|			ГДЕ
	|				Таб.Код = &ТипСписка
	|				И НЕ Таб.ПометкаУдаления
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				NULL,
	|				NULL,
	|				NULL,
	|				NULL,
	|				Таб.Ссылка
	|			ИЗ
	|				Справочник.ВидыКорпоративныхДействий КАК Таб
	|			ГДЕ
	|				Таб.Код = &ВидКД) КАК Таб) КАК Таб
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегл
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО (БанковскиеСчета.Владелец = Таб.Организация)
	|			И (НЕ БанковскиеСчета.ПометкаУдаления)
	|			И (БанковскиеСчета.ВалютаДенежныхСредств = КодыЦБ1.Владелец.ВалютаНоминала)
	|			И (БанковскиеСчета.ТипНазначения = ЗНАЧЕНИЕ(Перечисление.ТипыНазначенияБанковскихСчетов.Депозитарный))
	|			И (СчетаМХ.Владелец.НомерГосударственнойРегистрации = БанковскиеСчета.Банк.ОГРН)
	|			И (БанковскиеСчета.ДатаОткрытия <= &Дата)
	|			И (БанковскиеСчета.ДатаЗакрытия > &Дата
	|				ИЛИ БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчетаИзФайла
	|		ПО ЗапросНРД.НомерСчета = БанковскиеСчетаИзФайла.НомерСчета
	|			И (СОКРЛП(ЗапросНРД.НомерСчета) <> """")
	|			И (НЕ БанковскиеСчетаИзФайла.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапросНРД.КодНРД1,
	|	ЗапросНРД.КодНРД2,
	|	ЗапросНРД.ISIN1,
	|	ЗапросНРД.ISIN2,
	|	ЗапросНРД.НомерРегистрации1,
	|	ЗапросНРД.НомерРегистрации2,
	|	ЗапросНРД.Остаток1,
	|	ЗапросНРД.Остаток2,
	|	СчетаМХ.Ссылка,
	|	ЕСТЬNULL(ЕСТЬNULL(КодыЦБ1.Владелец, СпрЦБ1.Ссылка), ЦБпоНомеруИДатеРегистрации1.ЦеннаяБумага),
	|	ЕСТЬNULL(ЕСТЬNULL(КодыЦБ2.Владелец, СпрЦБ2.Ссылка), ЦБпоНомеруИДатеРегистрации2.ЦеннаяБумага)";

КонецФункции

Функция ОГРНРазличается(ОГРНЭмитента, ОГРНЦБЭмитента)
	Возврат ОГРНЭмитента <> ОГРНЦБЭмитента И НЕ (ПустаяСтрока(ОГРНЭмитента) И ПустаяСтрока(ОГРНЦБЭмитента));
КонецФункции

Процедура ПолучитьНомерБанковскогоСчета(registered_shareholders, НовСтр, ПредоставитьБанковскиеРеквизиты)
	Если ПредоставитьБанковскиеРеквизиты Тогда
		ДоступныеСвойства = registered_shareholders.Свойства();
		Если ДоступныеСвойства.Получить("bank_prop_rub") <> Неопределено Тогда
			НовСтр.НомерСчета = registered_shareholders.bank_prop_rub.cash_rub_dtls.account.id;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//ЗАГРУЗКА СТАТУСОВ

Функция ВосстановитьНомерРСВ(НомерРСВ, ДатаРСВ)
	ЭкземплярДокументаРаскрытия = Документы.РаскрытиеСпискаВладельцев.СоздатьДокумент();
	ЭкземплярДокументаРаскрытия.Дата = ?(ДатаРСВ = Неопределено, ТекущаяДатаСеанса(), ДатаРСВ);
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭкземплярДокументаРаскрытия);
	ПрефиксТранслит = ОбщегоНазначенияКлиентСервер.Транслит(Префикс);
	
	Если СтрНайти(НомерРСВ,ПрефиксТранслит)>0 Тогда
		Результат = СтрЗаменить(НомерРСВ, ПрефиксТранслит, Префикс);
	Иначе
		Результат = НомерРСВ;
	КонецЕсли;
	
	Если СтрДлина(Результат)<12 Тогда
		Результат = Лев(Результат,8)+"-"+Сред(Результат,9);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьЭлементВоВходящийПакет(ДокСодержимоеФайла,ИмяЭлемента,Элемент,НомерСтроки)
	ТипЗнчЭлемент = ТипЗнч(Элемент);
	Если ТипЗнчЭлемент=Тип("ОбъектXDTO") Тогда
		СвойстваЭлемента = Элемент.Свойства();
		Для Каждого Свойство Из СвойстваЭлемента Цикл
			Если Свойство.ВерхняяГраница=1 Тогда
				ВложенныйЭлемент = Элемент.Получить(Свойство);
			Иначе
				ВложенныйЭлемент = Элемент.ПолучитьСписок(Свойство);
			КонецЕсли;
			ИмяВложенногоЭлемента = ИмяЭлемента;
			Если ИмяВложенногоЭлемента<>"" Тогда
				ИмяВложенногоЭлемента = ИмяВложенногоЭлемента+".";
			КонецЕсли;
			ИмяВложенногоЭлемента = ВРег(ИмяВложенногоЭлемента+Свойство.Имя);
			ДобавитьЭлементВоВходящийПакет(ДокСодержимоеФайла,ИмяВложенногоЭлемента,ВложенныйЭлемент,НомерСтроки);
		КонецЦикла;
	ИначеЕсли ТипЗнчЭлемент=Тип("СписокXDTO") Тогда
		НомерТекущейСтроки = 1;
		Для Каждого Эл Из Элемент Цикл
			СвойстваЭлемента = Эл.Свойства();
			Для Каждого Свойство Из СвойстваЭлемента Цикл
				ИмяВложенногоЭлемента = ИмяЭлемента;
				Если ИмяВложенногоЭлемента<>"" Тогда
					ИмяВложенногоЭлемента = ИмяВложенногоЭлемента+".";
				КонецЕсли;
				ИмяВложенногоЭлемента = ВРег(ИмяВложенногоЭлемента+Свойство.Имя);
				ДобавитьЭлементВоВходящийПакет(ДокСодержимоеФайла,ИмяВложенногоЭлемента,Эл.Получить(Свойство),НомерТекущейСтроки);
			КонецЦикла;
			НомерТекущейСтроки = НомерТекущейСтроки+1;
		КонецЦикла;
	Иначе
		НовСтр = ДокСодержимоеФайла.Добавить();
		НовСтр.Элемент = ИмяЭлемента;
		НовСтр.Значение = Элемент;
		НовСтр.НомерСтрокиФайла = НомерСтроки;
	КонецЕсли;
КонецПроцедуры
Функция СформироватьДокументОтчетОСтатусеРСВ(XMLОтчетНРД, СообщениеОбОшибке) Экспорт
	
	Отказ = Ложь;
	ПространствоИмен = "FCDR_2017_02(2019v3)";
	
	ТипXDTO = ФабрикаXDTO.Тип(ПространствоИмен,"REGISTER_OF_SHAREHOLDERS_STATUS_ADVICE");
	ОтчетНРД = ФабрикаXDTO.ПрочитатьXML(XMLОтчетНРД,ТипXDTO);
	
	НовыйВходящийПакет = Документы.ВходящийПакетИзФайловогоШлюза.СоздатьДокумент();
	ДобавитьЭлементВоВходящийПакет(НовыйВходящийПакет.СодержимоеФайла,"",ОтчетНРД,0);
	СтрНомерРСВ = НовыйВходящийПакет.СодержимоеФайла.Найти("DOC_LINK.DOC_NUM","Элемент");
	НачатьТранзакцию();
	Если СтрНомерРСВ<>Неопределено Тогда
		НомерРСВ = СокрЛП(СтрНомерРСВ.Значение);
		СтрДатаРСВ = НовыйВходящийПакет.СодержимоеФайла.Найти("DOC_LINK.DOC_DATE.DATE","Элемент");
		Если СтрДатаРСВ<>Неопределено Тогда
			ДатаРСВ = ПолучитьДату(СтрДатаРСВ.Значение);
		Иначе
			ДатаРСВ = Неопределено;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Док.Ссылка КАК Ссылка,
		|	Док.Дата КАК Дата
		|ИЗ
		|	Документ.РаскрытиеСпискаВладельцев КАК Док
		|ГДЕ
		|	Док.Номер = &НомерРСВ
		|	И НЕ Док.ПометкаУдаления
		|	И &УсловиеДатаРСВ";
		Запрос.УстановитьПараметр("НомерРСВ",ВосстановитьНомерРСВ(НомерРСВ, ДатаРСВ));
		Если ЗначениеЗаполнено(ДатаРСВ) Тогда
			УсловиеДатаРСВ = "НАЧАЛОПЕРИОДА(Док.Дата,ДЕНЬ) = &ДатаРСВ";
			Запрос.УстановитьПараметр("ДатаРСВ", НачалоДня(ДатаРСВ));
		Иначе
			УсловиеДатаРСВ = "ИСТИНА";
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДатаРСВ", УсловиеДатаРСВ);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДокументОснование = Выборка.Ссылка;
			ДатаДокументаОснования = Выборка.Дата;
		Иначе
			ДокументОснование = Неопределено;
			ДатаДокументаОснования = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			ТехОперация = Документы.ТехническаяОперация.НайтиДокумент(Новый Структура("ДокументОснование",ДокументОснование));
		Иначе
			ТехОперация = Неопределено;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТехОперация) Тогда
			ДокументОбъект = Документы.ТехническаяОперация.СоздатьДокумент();
			ДокументОбъект.НомерДокументаОснования = НомерРСВ;
			
			ТекущаяДата = ТекущаяДатаСеанса();
			НовыйПорядковыйНомер = Документы.ТехническаяОперация.НовыйПорядковыйНомерВТечениеДня(ТекущаяДата);
			
			ДокументОбъект = Документы.ТехническаяОперация.СоздатьДокумент();
			ДокументОбъект.Дата = ТекущаяДатаСеанса();
			ДокументОбъект.НомерДокументаОснования = НомерРСВ;
			ДокументОбъект.ДатаДокументаОснования = ДатаДокументаОснования;
			ДокументОбъект.ТипОперации = ТипТехническойОперации();
			ДокументОбъект.КодОперации = КодТехническойОперации();
			ДокументОбъект.ДокументОснование = ДокументОснование;
			ДокументОбъект.ПорядковыйНомерВнутриДня = НовыйПорядковыйНомер;
			ДокументОбъект.Комментарий = "Загрузка входящего пакета REGISTER_OF_SHAREHOLDERS_STATUS_ADVICE";
			ДокументОбъект.УстановитьНовыйНомер();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			ТехОперация = ДокументОбъект.Ссылка;
		КонецЕсли;
	КонецЕсли;
	НовыйВходящийПакет.ДокументОснование = ?(ЗначениеЗаполнено(ТехОперация), ТехОперация, Неопределено);
	НовыйВходящийПакет.Дата = ТекущаяДата();
	НовыйВходящийПакет.Записать();
	
	СтрГлобальныйСтатусПроцессинг = НовыйВходящийПакет.СодержимоеФайла.Найти("REGISTER_LIST_STATUS.GLOBAL_STATUS.PROCESSING_STATUS.STATUS.STATUS_CODE","Элемент");
	СтрГлобальныйСтатусОтказКод 			= НовыйВходящийПакет.СодержимоеФайла.Найти("REGISTER_LIST_STATUS.GLOBAL_STATUS.REJECTION_STATUS.REASON.STATUS_CODE","Элемент");
	СтрГлобальныйСтатусОтказСобственныйКод  = НовыйВходящийПакет.СодержимоеФайла.Найти("REGISTER_LIST_STATUS.GLOBAL_STATUS.REJECTION_STATUS.REASON.PROPRIETARY.ID","Элемент");
	Если СтрГлобальныйСтатусПроцессинг<>Неопределено ИЛИ СтрГлобальныйСтатусОтказКод<>Неопределено ИЛИ СтрГлобальныйСтатусОтказСобственныйКод<>Неопределено Тогда
		Обработки.РаскрытиеСписковВладельцевFCDR_2017_02.ОбновитьГлобальныйСтатусДокумента(ДокументОснование);
	Иначе
		Обработки.РаскрытиеСписковВладельцевFCDR_2017_02.ОбновитьДетальныйСтатусДокумента(ДокументОснование);
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецФункции
Функция НовыйДанныеДокументаИННДля_person_document_t(ИНН)
	Возврат Новый Структура("Тип,ОписаниеТипа,Номер,ДатаВыдачи,КемВыдан,МестоВыдачи", "00","TXID",СокрЛП(ИНН),Дата("19000101"),"UKWN","");
КонецФункции

Процедура СформироватьВыпискуИзРеестра(XMLОтчетНРД, ИмяКаталога, СообщениеОбОшибке, Регламент = Ложь, ДокументСоздан = Ложь)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ИмяРеквизитаЭлемент = "Элемент";
	
	Если Регламент Тогда
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ШлюзНРД;
		ПараметрыИсточника = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник);
		ПутьАрхива = ПараметрыИсточника.Папка + "\Archive";
		СоздаватьКаталоги = Ложь;
		ПолныйПутьАрхива = Обработки.ЗагрузкаКДИзДепозитария.ОбщийКаталогПеремещаемогоФайлаВАрхив(ПутьАрхива, "W", , СоздаватьКаталоги);
	Иначе
		ПолныйПутьАрхива = Неопределено;
	КонецЕсли;
		
	ТипXDTO = ФабрикаXDTO.Тип(ПространствоИмен, "STATEMENT_OF_HOLDINGS");
	ОтчетНРД = ФабрикаXDTO.ПрочитатьXML(XMLОтчетНРД, ТипXDTO);
	
	НовыйВходящийПакет = Документы.ВходящийПакетИзФайловогоШлюза.СоздатьДокумент();
	ДобавитьЭлементВоВходящийПакет(НовыйВходящийПакет.СодержимоеФайла, "", ОтчетНРД, 0);
	
	ИтогиПоКоличеству = Новый Структура(ИмяРеквизитаЭлемент, "SECURITY_BALANCE.TOTAL.UNITS");
	СтрокиСИтогом = НовыйВходящийПакет.СодержимоеФайла.НайтиСтроки(ИтогиПоКоличеству);
	Для Каждого СтрокаСИтогом Из СтрокиСИтогом Цикл
		СтрокаСИтогом.Значение = СтроковыеФункцииКлиентСервер.ЧислоИзСтроки(СтрокаСИтогом.Значение);
		СтрокаСИтогом.Тип = "N";
	КонецЦикла;
	
	ДатаОстаткаИзВыписки = '00010101';
	ДатыКПреобразованию = Новый Структура(ИмяРеквизитаЭлемент, "STATEMENT_DATE");
	СтрокиСДатами = НовыйВходящийПакет.СодержимоеФайла.НайтиСтроки(ДатыКПреобразованию);
	Для Каждого СтрокаСДатами Из СтрокиСДатами Цикл
		СтрокаСДатами.Значение = XMLЗначение(Тип("Дата"), СтрокаСДатами.Значение);
		СтрокаСДатами.Тип = "D";
		ДатаОстаткаИзВыписки = СтрокаСДатами.Значение;
	КонецЦикла;
	
	СтрокаРегистраторОГРН = НовыйВходящийПакет.СодержимоеФайла.Найти("REGISTRAR.PARTY_DTLS.OGRN", ИмяРеквизитаЭлемент);
	ОГРНРегистратора = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(СтрокаРегистраторОГРН.Значение, "_");
	НомерГосударственнойРегистрации = СокрЛП(ОГРНРегистратора);
	Если ЗначениеЗаполнено(НомерГосударственнойРегистрации) Тогда
		МХ = Справочники.МестаХранения.НайтиПоРеквизиту("НомерГосударственнойРегистрации", НомерГосударственнойРегистрации);
	КонецЕсли;
	Если ЗначениеЗаполнено(МХ) Тогда
		ИмяРегистратора = СокрЛП(МХ.Наименование);
	Иначе
		СтрокаРегистратор = НовыйВходящийПакет.СодержимоеФайла.Найти("REGISTRAR.PARTY_DTLS.NAME", ИмяРеквизитаЭлемент);
		ИмяРегистратора = СтрокаРегистратор.Значение;
	КонецЕсли;
	
	СтрокаНомерВходящегоДокумента = НовыйВходящийПакет.СодержимоеФайла.Найти("HEADER.DOC_NUM", ИмяРеквизитаЭлемент);
	НомерВходящегоДокумента = СтрокаНомерВходящегоДокумента.Значение;
	НовыйВходящийПакет.НомерВходящегоДокумента = НомерВходящегоДокумента;
	СтрокаДатаВходящегоДокумента = НовыйВходящийПакет.СодержимоеФайла.Найти("HEADER.DOC_DATE.DATE", ИмяРеквизитаЭлемент);
	ДатаВходящегоДокумента = ПолучитьДату(СтрокаДатаВходящегоДокумента.Значение);
	НовыйВходящийПакет.ДатаВходящегоДокумента = ДатаВходящегоДокумента;
	СтрокаДанныеНаДату = НовыйВходящийПакет.СодержимоеФайла.Найти("STATEMENT_DATE", ИмяРеквизитаЭлемент);
	ДанныеНаДату = СтрокаДанныеНаДату.Значение;
	
	СтруктураОтбора = Новый Структура("НомерВходящегоДокумента, ДатаВходящегоДокумента, КодОперации",
		НовыйВходящийПакет.НомерВходящегоДокумента, НовыйВходящийПакет.ДатаВходящегоДокумента, "5RESTR03");
	ВходящийПакетПоИсходящемуНомеру = Документы.ВходящийПакетИзФайловогоШлюза.НайтиДокумент(СтруктураОтбора);
	Если ЗначениеЗаполнено(ВходящийПакетПоИсходящемуНомеру) Тогда
		ИмяСобытия = "Загрузка отчета STATEMENT_OF_HOLDINGS";
		УровеньОшибки = УровеньЖурналаРегистрации.Предупреждение;
		ШаблонСообщения = "Входящий пакет из файлового шлюза [Код операции = 5RESTR03] вх.№ %1 от %2 уже загружен.";
		ТекстСообщения = СтрШаблон(ШаблонСообщения,
			НовыйВходящийПакет.НомерВходящегоДокумента, Формат(НовыйВходящийПакет.ДатаВходящегоДокумента, "ДЛФ=D"));
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньОшибки, Метаданные(), , ТекстСообщения);
	Иначе
		НовыйВходящийПакет.КодОперации = "5RESTR03";
		НовыйВходящийПакет.Дата = ТекущаяДата;
		НовыйВходящийПакет.Комментарий = "Создан автоматически в " + Формат(ТекущаяДата, "ДЛФ=DT");
		НовыйВходящийПакет.ПутьАрхив = ПолныйПутьАрхива;
		НовыйВходящийПакет.ОтносительныйПуть = ИмяКаталога;
		
		НовыйВходящий = Документы.Входящий.СоздатьДокумент();
		НовыйВходящий.ДатаОтправления = ДатаВходящегоДокумента;
		НовыйВходящий.Депонент = ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию();
		НовыйВходящий.Исполнитель = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ПользовательРобот");
		НовыйВходящий.ИсходящийНомер = НомерВходящегоДокумента;
		СтрокаНомерСчета = НовыйВходящийПакет.СодержимоеФайла.Найти("ACCOUNT_DTLS.ACCOUNT_ID.ID", ИмяРеквизитаЭлемент);
		НовыйВходящий.Комментарий = "Номер счета МХ: " + СтрокаНомерСчета.Значение;
		НовыйВходящий.ЛицоНаправившееДокумент = ИмяРегистратора;
		НовыйВходящий.НаименованиеДокументаИлиКомплекта = "Выписка на дату " + Формат(ДанныеНаДату, "ДФ=""дд.ММ.гггг""");
		НовыйВходящий.Дата = ТекущаяДата;
		
		НачатьТранзакцию();
		Попытка
			НовыйВходящийПакет.Записать(РежимЗаписиДокумента.Проведение);
			НовыйВходящий.ДокументОснование = НовыйВходящийПакет.Ссылка;
			НовыйВходящий.Записать(РежимЗаписиДокумента.Проведение);
			ДокументСоздан = Истина;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			СообщениеОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Возврат;
		КонецПопытки;
		
		ОтправитьУведомлениеОПоступленииВыписокОтРегистраторов(ИмяРегистратора, СтрокаНомерСчета.Значение, ДатаОстаткаИзВыписки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьУведомлениеОПоступленииВыписокОтРегистраторов(ИмяРегистратора, НомерСчетаМХ, ДатаОстаткаИзВыписки)
	
	ПВХ = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОПоступленииВыписокОтРегистраторов;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПВХ).Настройка;
	
	ТемаПисьма = "Выписка из реестра / Справка на дату / Справка о наличии [" + Формат(ДатаОстаткаИзВыписки, "ДФ=dd.MM.yyyy") + "]";
	ТекстУведомления = "Выписка от регистратора: [" + ИмяРегистратора + "]
	| по счету МХ: [" + НомерСчетаМХ + "]
	| получена.";
	
	ПС = "<br>";
	ОтчетHTML = "<html><BODY>" + Символы.ПС + ТекстУведомления + ПС + Символы.ПС + ПС + Символы.ПС;
	ОтчетHTML = ОтчетHTML + "</BODY></html>";
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ОтчетHTML);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.HTML);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
	
КонецПроцедуры

ПространствоИмен = "FCDR_2017_02(2019v3)";
