#Область СлужебныйПрограммныйИнтерфейс

// Экспортные функции данного модуля вызываются главным образом из обработки СервисыMarketDataAPI, синоним
// "Загрузка данных из сервисов MarketData [API]"

// Подключает источник RuData API, записывает Токен авторизации в параметры сеанса
//
// Параметры:
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  СлужебныйВызов	 - Булево	 - Признак вызова из служебной процедуры (по - умолчанию)
//  Сессия			 - Структура - Кеш соединения
// 
// Возвращаемое значение:
//   - HTTPСоединение- HTTP Соединение
//
Функция Подключить(ОписаниеОшибки, СлужебныйВызов = Истина, Сессия = Неопределено) Экспорт
	
	ОписаниеОшибки = "";
	
	НастройкиСоединения = ПараметрыИсточника();
	
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		
		ПараметрыСеанса.ТокенRuDataAPI = API_AccountLogin(НастройкиСоединения, ОписаниеОшибки, Сессия);
		
	Иначе
		
		ПараметрыСеанса.ТокенRuDataAPI = "";
		
		ОписаниеОшибки = "Не заполнены настройки для подключения внешнего источника RuDataAPI.";
		
	КонецЕсли;
	
	Если Не СлужебныйВызов И ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		
	КонецЕсли;
	
	Если ОписаниеОшибки = "" И Не ТестированиеVanessa.ЭтоТест() Тогда
		Для Каждого Пул Из Сессия.СлужебныеДанные.ПулСоединений Цикл
			Возврат Пул.Значение;
		КонецЦикла;
		ОписаниеОшибки = "Нет HTTP Соединения";
		Возврат Неопределено;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает таблицу Info \ Securities
//
// Параметры:
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
//    Обязательные поля:
//     * ДатаВремяОбновленияДанных	 - Дата		 - дата \ время начала выборки обновлений (пустая дата - по всем датам изменений)
//    Необязательные поля:
//     * fintoolids					 - Массив	 - массив fintoolid (пустой массив - отбор по fintoolid не нужен)
//     * ISINs						 - Массив	 - массив isin (пустой массив - по всем ЦБ), если присутствуют и fintoolids и ISINs,
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  Сессия			 - Строка	 - Кеш сессии HTTP
//													то ISINs - игнорируется (даже если fintoolids - пустой массив).
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Info/Securities)
//
Функция ДанныеЦенныхБумагПоПараметрам(ВходныеПараметры, ОписаниеОшибки, Сессия = Неопределено) Экспорт
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементСтруктурыПриОтсутствии(ВходныеПараметры, "ОбновитьБумагиВНеактуальномСтатусе", Ложь);
	ОписаниеОшибки = "";
	
	ЕстьСвойствоFintoolids = ВходныеПараметры.Свойство("fintoolids");
	
	Если ЕстьСвойствоFintoolids И ЗначениеЗаполнено(ВходныеПараметры.fintoolids) Тогда
		ТаблицаInfoSecurities = InfoSecuritiesWithCodes(ВходныеПараметры, "fintoolids", ОписаниеОшибки, Сессия);
	ИначеЕсли Не ЕстьСвойствоFintoolids И СвойствоЗаполнено(ВходныеПараметры, "ISINs") Тогда
		ТаблицаInfoSecurities = InfoSecuritiesWithCodes(ВходныеПараметры, "isins", ОписаниеОшибки, Сессия);
	Иначе
		ТаблицаInfoSecurities = InfoSecurities(ОписаниеОшибки, Сессия, ВходныеПараметры);
	КонецЕсли;
	
	Возврат ТаблицаInfoSecurities;
КонецФункции

// Возвращает таблицу Info \ Securities
//
// Параметры:
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  Сессия			 - Строка	 - Кеш сессии HTTP
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
//    Обязательные поля:
//     * ISINs						 - Массив	 - массив isin (пустой массив - по всем ЦБ)
//     * ДатаВремяОбновленияДанных	 - Дата		 - дата \ время начала выборки обновлений (пустая дата - по всем датам изменений)
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Info/Securities)
//
Функция InfoSecurities(ОписаниеОшибки, Сессия = Неопределено, ВходныеПараметры = Неопределено) Экспорт
	
	ТаблицаSecurities = Неопределено;
	
	МаксимальноеКоличествоСтраниц = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("101.МаксимальноеКоличествоСтраниц", 10000);
	
	ОписаниеОшибки = "";
	
	ЧисловыеРеквизиты = ЧисловыеРеквизитыТаблицRuDataAPI();
	
	НастройкиСоединения = ПараметрыИсточника();
	
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		
		Если ВходныеПараметры = Неопределено Тогда
			ВходныеПараметры = Новый Структура;
			ВходныеПараметры.Вставить("ISINs"						, Новый Массив);
			ВходныеПараметры.Вставить("ДатаВремяОбновленияДанных"	,
				ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("101.RuData_ДатаВремяПоследнегоОбновленияДанных", Дата(1, 1, 1)));
			ВходныеПараметры.Вставить("ФильтрСтатусовЦБ"			, Неопределено);
		КонецЕсли;
		ВходныеПараметры.Вставить("НомерПачки"						, 0);
		ВходныеПараметры.Вставить("pageNum"							, "");
		ВходныеПараметры.Вставить("pageSize"						, 100);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементСтруктурыПриОтсутствии(ВходныеПараметры, "ОбновитьБумагиВНеактуальномСтатусе", Ложь);
		
		Для НомерСтраницы = 1 По МаксимальноеКоличествоСтраниц Цикл
			ВходныеПараметры.НомерПачки = "" + НомерСтраницы;
			ВходныеПараметры.pageNum = НомерСтраницы;
			
			Результат = API_ПолучитьОтветМетода("InfoSecurities", "/Info/Securities",
				ВходныеПараметры, НастройкиСоединения, ОписаниеОшибки, Сессия);
			
			Если Не ЗначениеЗаполнено(Результат) Тогда
				Прервать;
			КонецЕсли;
			ВременнаяТаблица = ПреобразоватьМассивВТаблицуЗначений(Результат, ЧисловыеРеквизиты);
			ТаблицаSecurities = КонкатенацияТаблицЗначений(ТаблицаSecurities, ВременнаяТаблица);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаSecurities;
	
КонецФункции

// Возвращает таблицу Info \ Securities, ранее называлась InfoSecuritiesWithISINs
//
// Параметры:
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
//    Обязательные поля:
//     * ISINs						 - Массив	 - массив isin, обязателен, если параметр ВидКодов = "isins"
//     * fintoolids					 - fintoolids	 - массив fintoolid (коды RuData), обязателен, если параметр ВидКодов = "fintoolids"
//     * ДатаВремяОбновленияДанных	 - Дата		 - дата \ время начала выборки обновлений (пустая дата - по всем датам изменений)
//  ВидКодов		 - Строка	 - "isins" или "fintoolids", если значение не задано, то "isins"
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  Сессия			 - Строка	 - Кеш сессии HTTP
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Info/Securities)
//
Функция InfoSecuritiesWithCodes(ВходныеПараметры, Знач ВидКодов, ОписаниеОшибки, Сессия = Неопределено) Экспорт
	ВидКодовISINs = "isins";
	Если Не ЗначениеЗаполнено(ВидКодов) Тогда
		ВидКодов = ВидКодовISINs;
	КонецЕсли;
	
	КлючНенужногоЭлемента = ?(ВидКодов = ВидКодовISINs, "fintoolids", ВидКодовISINs);
	
	ТаблицаSecurities = Неопределено;
	ОписаниеОшибки = "";
	НастройкиСоединения = ПараметрыИсточника();
	НомерПачки = 0;
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		ОграничениеПоКоличествуЦБ = 100; // Ограничения RuData по объему запрашиваемых данных
		//
		КодыЦБДляТекущейПачки = Новый Массив;
		//
		ФильтрСтатусовЦБ = "";
		ВходныеПараметры.Свойство("ФильтрСтатусовЦБ", ФильтрСтатусовЦБ);
		
		ИмяПоляСМассивом = ?(ВидКодов = ВидКодовISINs, "ISINs", ВидКодов);
		ВсеКодыЦБДляОтбора = ВходныеПараметры[ИмяПоляСМассивом];
		ПоследнийИндекс = ВсеКодыЦБДляОтбора.ВГраница();
		Для Индекс = 0 По ПоследнийИндекс Цикл
			КодыЦБДляТекущейПачки.Добавить(ВсеКодыЦБДляОтбора[Индекс]);
			Группировать = (Индекс + 1) % ОграничениеПоКоличествуЦБ;
			Если Группировать = 0 Или Индекс = ПоследнийИндекс Тогда
				НомерПачки = НомерПачки + 1;
				ВходящиеИдентификаторы = НовыеВходящиеИдентификаторы();
				ВходящиеИдентификаторы.Вставить(ВидКодов, КодыЦБДляТекущейПачки);
				ВходныеПараметрыГруппа = НовыеВходныеПараметрыГруппы(НомерПачки, ВходныеПараметры.ДатаВремяОбновленияДанных,
					ВходящиеИдентификаторы, ФильтрСтатусовЦБ, КлючНенужногоЭлемента);
				ОбщегоНазначенияКлиентСервер.ДобавитьЭлементСтруктуры(ВходныеПараметрыГруппа, ВходныеПараметры,
																		"ОбновитьБумагиВНеактуальномСтатусе", Ложь);
				ВременнаяТаблица =
					ТаблицаДанныхМетода("InfoSecurities", НастройкиСоединения, ОписаниеОшибки, Сессия, ВходныеПараметрыГруппа);
				//
				КодыЦБДляТекущейПачки = Новый Массив;
				//
				Если ЗначениеЗаполнено(ВременнаяТаблица) Тогда
					ТаблицаSecurities = КонкатенацияТаблицЗначений(ТаблицаSecurities, ВременнаяТаблица);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаSecurities;
КонецФункции

// Возвращает таблицу Info \ FintoolReferenceData
//
// Параметры:
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  Сессия			 - Строка	 - Кеш сессии HTTP
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
//    Обязательные поля:
//     * fintoolids					 - Массив	 - массив fintoolid (обязательное поле - идентификатор ЦБ в RuData)
//     * ДатаВремяОбновленияДанных	 - Дата		 - дата \ время начала выборки обновлений (пустая дата - по всем датам изменений)
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Info/FintoolReferenceData)
//
Функция InfoFintoolReferenceData(ОписаниеОшибки, Сессия = Неопределено, ВходныеПараметры = Неопределено) Экспорт
	ИмяFintoolids = "fintoolids";
	
	Если ВходныеПараметры = Неопределено Тогда
		ВходныеПараметры = Новый Структура;
		ВходныеПараметры.Вставить(ИмяFintoolids, Новый Массив);
		ВходныеПараметры.Вставить("ДатаВремяОбновленияДанных", ДАТА(1, 1, 1));
	КонецЕсли;
	
	ТаблицаFintoolReferenceData = Неопределено;
	ОписаниеОшибки = "";
	НуженОтборПоFintoolids = ЗначениеЗаполнено(ВходныеПараметры.fintoolids);
	НастройкиСоединения = ПараметрыИсточника();
	НомерПачки = 0;
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		ОграничениеПоКоличествуЦБ = 100; // Ограничения RuData по объему запрашиваемых данных
		fintoolids = Новый Массив;
		ПоследнийИндекс = ПоследнийИндексДляЦикла(ВходныеПараметры, ИмяFintoolids);
		Для Индекс = 0 По ПоследнийИндекс Цикл
			Если НуженОтборПоFintoolids Тогда
				fintoolids.Добавить(ВходныеПараметры.fintoolids[Индекс]);
			КонецЕсли;
			Группировать = (Индекс + 1) % ОграничениеПоКоличествуЦБ;
			Если Группировать = 0 Или Индекс = ПоследнийИндекс Тогда
				НомерПачки = НомерПачки + 1;
				
				ВходящиеИдентификаторы = НовыеВходящиеИдентификаторы();
				ВходящиеИдентификаторы.Вставить(ИмяFintoolids, fintoolids);
				ВходныеПараметрыГруппа = НовыеВходныеПараметрыГруппы(НомерПачки, ВходныеПараметры.ДатаВремяОбновленияДанных, ВходящиеИдентификаторы);
				ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ВходныеПараметрыГруппа, ВходныеПараметры, "ТолькоFintoolid");
				ВременнаяТаблица =
					ТаблицаДанныхМетода("InfoFintoolReferenceData", НастройкиСоединения, ОписаниеОшибки, Сессия, ВходныеПараметрыГруппа);
				
				fintoolids = Новый Массив;
				
				Если ЗначениеЗаполнено(ВременнаяТаблица) Тогда
					ТаблицаFintoolReferenceData = КонкатенацияТаблицЗначений(ТаблицаFintoolReferenceData, ВременнаяТаблица);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаFintoolReferenceData;
КонецФункции

// Возвращает таблицу Nsd \ CommonData
//
// Параметры:
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  Сессия			 - Строка	 - Кеш сессии HTTP
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
//    Обязательные поля:
//     * nrdcodes					 - Массив	 - массив nrdcodes (обязательное поле - идентификатор ЦБ в НРД)
//     * ДатаВремяОбновленияДанных	 - Дата		 - дата \ время начала выборки обновлений (пустая дата - по всем датам изменений)
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Nsd/CommonData)
//
Функция NsdCommonData(ОписаниеОшибки, Сессия = Неопределено, ВходныеПараметры = Неопределено) Экспорт
	
	ТаблицаCommonData = Неопределено;	
	ОписаниеОшибки = "";
	НуженОтборПоNrdcodes = ЗначениеЗаполнено(ВходныеПараметры.nrdcodes);
	
	НастройкиСоединения = ПараметрыИсточника();
	
	НомерПачки = 0;
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		ОграничениеПоКоличествуЦБ = 100; // Ограничения RuData по объему запрашиваемых данных
		//
		nrdcodes = Новый Массив;
		//
		ПоследнийИндекс = ПоследнийИндексДляЦикла(ВходныеПараметры, "nrdcodes");
		Для Индекс = 0 По ПоследнийИндекс Цикл
			Если НуженОтборПоNrdcodes Тогда
				nrdcodes.Добавить(ВходныеПараметры.nrdcodes[Индекс]);
			КонецЕсли;
			Группировать = (Индекс + 1) % ОграничениеПоКоличествуЦБ;
			Если Группировать = 0 Или Индекс = ПоследнийИндекс Тогда
				НомерПачки = НомерПачки + 1;
				
				ВходящиеИдентификаторы = НовыеВходящиеИдентификаторы();
				ВходящиеИдентификаторы.Вставить("nrdcodes", nrdcodes);
				ВходныеПараметрыГруппа = НовыеВходныеПараметрыГруппы(НомерПачки, ВходныеПараметры.ДатаВремяОбновленияДанных,
					ВходящиеИдентификаторы); 
				ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ВходныеПараметрыГруппа, ВходныеПараметры, "filter");
				
				ВременнаяТаблица =
					ТаблицаДанныхМетода("NsdCommonData", НастройкиСоединения, ОписаниеОшибки, Сессия, ВходныеПараметрыГруппа);
				//
				nrdcodes = Новый Массив;
				//
				Если ЗначениеЗаполнено(ВременнаяТаблица) Тогда
					ТаблицаCommonData = КонкатенацияТаблицЗначений(ТаблицаCommonData, ВременнаяТаблица);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаCommonData;
	
КонецФункции

// Возвращает таблицу Emitent \ List
//
// Параметры:
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  Сессия			 - Строка	 - Кеш сессии HTTP
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
//    Обязательные поля:
//     * fininstids					 - Массив	 - массив fininstid (обязательное поле - идентификатор Эмитента в RuData)
//     * ДатаВремяОбновленияДанных	 - Дата		 - дата \ время начала выборки обновлений (пустая дата - по всем датам изменений)
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Emitent/List)
//
Функция EmitentList(ОписаниеОшибки, Сессия = Неопределено, ВходныеПараметры = Неопределено) Экспорт
	
	ТаблицаEmitentList = Неопределено;
	
	ОписаниеОшибки = "";
	
	НастройкиСоединения = ПараметрыИсточника();
	
	НомерПачки = 0;
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		ОграничениеПоКоличествуЦБ = 100; // Ограничения RuData по объему запрашиваемых данных
		//
		fininstids = Новый Массив;
		//
		ПоследнийИндекс = ВходныеПараметры.fininstids.ВГраница();
		Для Индекс = 0 По ПоследнийИндекс Цикл
			fininstids.Добавить(ВходныеПараметры.fininstids[Индекс]);
			Группировать = (Индекс + 1) % ОграничениеПоКоличествуЦБ;
			Если Группировать = 0 Или Индекс = ПоследнийИндекс Тогда
				НомерПачки = НомерПачки + 1;
				
				ВходящиеИдентификаторы = НовыеВходящиеИдентификаторы();
				ВходящиеИдентификаторы.Вставить("fininstids", fininstids);
				ВходныеПараметрыГруппа = НовыеВходныеПараметрыГруппы(НомерПачки, ВходныеПараметры.ДатаВремяОбновленияДанных,
					ВходящиеИдентификаторы);
				
				ВременнаяТаблица =
					ТаблицаДанныхМетода("EmitentList", НастройкиСоединения, ОписаниеОшибки, Сессия, ВходныеПараметрыГруппа);
				//
				fininstids = Новый Массив;
				//
				Если ЗначениеЗаполнено(ВременнаяТаблица) Тогда
					ТаблицаEmitentList = КонкатенацияТаблицЗначений(ТаблицаEmitentList, ВременнаяТаблица);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаEmitentList;
	
КонецФункции

// Возвращает таблицу Dictionary \ Countries
//
// Параметры:
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  Сессия			 - Строка	 - Кеш сессии HTTP
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Dictionary/Countries)
//
Функция DictionaryCountries(ОписаниеОшибки, Сессия = Неопределено, ВходныеПараметры = Неопределено) Экспорт
	
	ТаблицаDictionaryCountries = Новый ТаблицаЗначений;
	
	ОписаниеОшибки = "";
	
	ЧисловыеРеквизиты = ЧисловыеРеквизитыТаблицRuDataAPI();
	
	НастройкиСоединения = ПараметрыИсточника();
	
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		
		Если ВходныеПараметры = Неопределено Тогда
			ВходныеПараметры = Новый Структура;
		КонецЕсли;
		ВходныеПараметры.Вставить("НомерПачки"						, 0);
		
		Результат = API_ПолучитьОтветМетода("DictionaryCountries", "/Dictionary/Countries",
			ВходныеПараметры, НастройкиСоединения, ОписаниеОшибки, Сессия);
			
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Возврат ТаблицаDictionaryCountries;
		КонецЕсли;
		ВременнаяТаблица = ПреобразоватьМассивВТаблицуЗначений(Результат, ЧисловыеРеквизиты);
		ТаблицаDictionaryCountries = КонкатенацияТаблицЗначений(ТаблицаDictionaryCountries, ВременнаяТаблица);
		
	КонецЕсли;
	ТаблицаDictionaryCountries.Колонки.Добавить("Страна1С" , Новый ОписаниеТипов("СправочникСсылка.КлассификаторСтранМира"));
	
	Возврат ТаблицаDictionaryCountries;
	
КонецФункции

// Возвращает таблицу Info \ Currencies
//
// Параметры:
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  Сессия			 - Строка	 - Кеш сессии HTTP
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Info/Currencies)
//
Функция InfoCurrencies(ОписаниеОшибки, Сессия = Неопределено, ВходныеПараметры = Неопределено) Экспорт
	
	ТаблицаInfoCurrencies = Новый ТаблицаЗначений;
	
	ОписаниеОшибки = "";
	
	ЧисловыеРеквизиты = ЧисловыеРеквизитыТаблицRuDataAPI();
	
	НастройкиСоединения = ПараметрыИсточника();
	
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		
		Если ВходныеПараметры = Неопределено Тогда
			ВходныеПараметры = Новый Структура;
		КонецЕсли;
		ВходныеПараметры.Вставить("НомерПачки", 0);
		
		Результат = API_ПолучитьОтветМетода("InfoCurrencies", "/Info/Currencies",
			ВходныеПараметры, НастройкиСоединения, ОписаниеОшибки, Сессия);
			
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Возврат ТаблицаInfoCurrencies;
		КонецЕсли;
		ВременнаяТаблица = ПреобразоватьМассивВТаблицуЗначений(Результат, ЧисловыеРеквизиты);
		ТаблицаInfoCurrencies = КонкатенацияТаблицЗначений(ТаблицаInfoCurrencies, ВременнаяТаблица);
		
	КонецЕсли;
	
	Возврат ТаблицаInfoCurrencies;
	
КонецФункции

// Возвращает таблицу Bond \ TimeTable
//
// Параметры:
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  Сессия			 - Строка	 - Кеш сессии HTTP
//  ВходныеПараметры - Структура - Структура входных параметров
//  Обязательные поля:
//  * eventTypes					 - Массив	 - массив eventTypes (обязательное поле - идентификатор типа события в RuData)
//  * ids							 - Массив	 - массив isin (обязательное поле - идентификатор ЦБ в RuData)
//  * ДатаВремяОбновленияДанных		 - Дата		 - дата \ время начала выборки обновлений (пустая дата - по всем датам изменений)
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Bond/TimeTable)
//
Функция BondTimeTable(ОписаниеОшибки, Сессия = Неопределено, ВходныеПараметры = Неопределено) Экспорт
	
	ТаблицаTimeTable = Неопределено;
	
	ОписаниеОшибки = "";
	
	НастройкиСоединения = ПараметрыИсточника();
	
	НомерПачки = 0;
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		ОграничениеПоКоличествуЦБ = 100; // Ограничения RuData по объему запрашиваемых данных
		//
		ids = Новый Массив;
		//
		ПоследнийИндекс = ВходныеПараметры.ids.ВГраница();
		Для Индекс = 0 По ПоследнийИндекс Цикл
			ids.Добавить(ВходныеПараметры.ids[Индекс]);
			Группировать = (Индекс + 1) % ОграничениеПоКоличествуЦБ;
			Если Группировать = 0 Или Индекс = ПоследнийИндекс Тогда
				НомерПачки = НомерПачки + 1;
				
				ВходящиеИдентификаторы = НовыеВходящиеИдентификаторы();
				ВходящиеИдентификаторы.Вставить("ids", ids);
				ВходныеПараметрыГруппа = НовыеВходныеПараметрыГруппы(НомерПачки, ВходныеПараметры.ДатаВремяОбновленияДанных,
					ВходящиеИдентификаторы);
				ВходныеПараметрыГруппа.Вставить("eventTypes", ВходныеПараметры.eventTypes);
				
				ВременнаяТаблица =
					ТаблицаДанныхМетода("BondTimeTable", НастройкиСоединения, ОписаниеОшибки, Сессия, ВходныеПараметрыГруппа);
				//
				ids = Новый Массив;
				//
				Если ЗначениеЗаполнено(ВременнаяТаблица) Тогда
					ТаблицаTimeTable = КонкатенацияТаблицЗначений(ТаблицаTimeTable, ВременнаяТаблица);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаTimeTable;
	
КонецФункции

// Возвращает таблицу Info \ emitent-category-value
//
// Параметры:
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  Сессия			 - Строка	 - Кеш сессии HTTP
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Info/emitent-category-value)
//
Функция InfoEmitentCategoryValue(ОписаниеОшибки, Сессия = Неопределено, ВходныеПараметры = Неопределено) Экспорт
	
	ТаблицаEmitentCategoryValue = Новый ТаблицаЗначений;
	
	ОписаниеОшибки = "";
	
	ЧисловыеРеквизиты = ЧисловыеРеквизитыТаблицRuDataAPI();
	
	НастройкиСоединения = ПараметрыИсточника();
	
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		
		Если ВходныеПараметры = Неопределено Тогда
			ВходныеПараметры = Новый Структура;
		КонецЕсли;
		
		МаксимальноеКоличествоСтраниц = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("101.МаксимальноеКоличествоСтраниц", 999);
		Для НомерПачки = 1 По МаксимальноеКоличествоСтраниц Цикл
			ВходныеПараметры.Вставить("НомерПачки", НомерПачки);
			
			Результат = API_ПолучитьОтветМетода("InfoEmitentCategoryValue", "/Info/emitent-category-value",
				ВходныеПараметры, НастройкиСоединения, ОписаниеОшибки, Сессия);
				
			Если Не ЗначениеЗаполнено(Результат) Тогда
				Возврат ТаблицаEmitentCategoryValue;
			КонецЕсли;
			ВременнаяТаблица = ПреобразоватьМассивВТаблицуЗначений(Результат, ЧисловыеРеквизиты);
			ТаблицаEmitentCategoryValue = КонкатенацияТаблицЗначений(ТаблицаEmitentCategoryValue, ВременнаяТаблица);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаEmitentCategoryValue;
	
КонецФункции

// Возвращает таблицу Info \ EmitentClassification
//
// Параметры:
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  Сессия			 - Строка	 - Кеш сессии HTTP
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Info/EmitentClassification)
//
Функция InfoEmitentClassification(ОписаниеОшибки, Сессия = Неопределено, ВходныеПараметры = Неопределено) Экспорт
	
	ТаблицаEmitentClassification = Новый ТаблицаЗначений;
	
	ОписаниеОшибки = "";
	
	ЧисловыеРеквизиты = ЧисловыеРеквизитыТаблицRuDataAPI();
	
	НастройкиСоединения = ПараметрыИсточника();
	
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		
		Если ВходныеПараметры = Неопределено Тогда
			ВходныеПараметры = Новый Структура;
		КонецЕсли;
		
		МаксимальноеКоличествоСтраниц = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("101.МаксимальноеКоличествоСтраниц", 999);
		Для НомерПачки = 1 По МаксимальноеКоличествоСтраниц Цикл
			ВходныеПараметры.Вставить("НомерПачки", НомерПачки);
			
			Результат = API_ПолучитьОтветМетода("InfoEmitentClassification", "/Info/EmitentClassification",
				ВходныеПараметры, НастройкиСоединения, ОписаниеОшибки, Сессия);
				
			Если Не ЗначениеЗаполнено(Результат) Тогда
				Возврат ТаблицаEmitentClassification;
			КонецЕсли;
			ВременнаяТаблица = ПреобразоватьМассивВТаблицуЗначений(Результат, ЧисловыеРеквизиты);
			ТаблицаEmitentClassification = КонкатенацияТаблицЗначений(ТаблицаEmitentClassification, ВременнаяТаблица);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаEmitentClassification;
	
КонецФункции

// Возвращает таблицу Info \ FintoolClassification
//
// Параметры:
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  Сессия			 - Строка	 - Кеш сессии HTTP
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
//    Обязательные поля:
//     * fintoolids					 - Массив	 - массив fintoolid (обязательное поле - идентификатор ЦБ в RuData)
//     * ДатаВремяОбновленияДанных	 - Дата		 - дата \ время начала выборки обновлений (пустая дата - по всем датам изменений)
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Info/FintoolClassification)
Функция InfoFintoolClassification(ОписаниеОшибки, Сессия = Неопределено, ВходныеПараметры = Неопределено) Экспорт
	ИмяFintoolids = "fintoolids";
	Если ВходныеПараметры = Неопределено Тогда
		ВходныеПараметры = Новый Структура;
		ВходныеПараметры.Вставить(ИмяFintoolids, Новый Массив);
		ВходныеПараметры.Вставить("ДатаВремяОбновленияДанных", ДАТА(1, 1, 1));
	КонецЕсли;
	
	ТаблицаFintoolClassification = Новый ТаблицаЗначений;
	ОписаниеОшибки = "";
	НуженОтборПоFintoolids = ЗначениеЗаполнено(ВходныеПараметры.fintoolids);
	НастройкиСоединения = ПараметрыИсточника();
	НомерПачки = 0;
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		ОграничениеПоКоличествуЦБ = 100; // Ограничения RuData по объему запрашиваемых данных
		fintoolids = Новый Массив;
		ПоследнийИндекс = ПоследнийИндексДляЦикла(ВходныеПараметры, ИмяFintoolids);
		Для Индекс = 0 По ПоследнийИндекс Цикл
			Если НуженОтборПоFintoolids Тогда
				fintoolids.Добавить(ВходныеПараметры.fintoolids[Индекс]);
			КонецЕсли;
			Группировать = (Индекс + 1) % ОграничениеПоКоличествуЦБ;
			Если Группировать = 0 Или Индекс = ПоследнийИндекс Тогда
				НомерПачки = НомерПачки + 1;
				
				ВходящиеИдентификаторы = НовыеВходящиеИдентификаторы();
				ВходящиеИдентификаторы.Вставить(ИмяFintoolids, fintoolids);
				ВходныеПараметрыГруппа = НовыеВходныеПараметрыГруппы(НомерПачки, ВходныеПараметры.ДатаВремяОбновленияДанных, ВходящиеИдентификаторы);
				ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ВходныеПараметрыГруппа, ВходныеПараметры, "filter");
				ВременнаяТаблица =
					ТаблицаДанныхМетода("InfoFintoolClassification", НастройкиСоединения, ОписаниеОшибки, Сессия, ВходныеПараметрыГруппа);
				
				fintoolids = Новый Массив;
				
				Если ЗначениеЗаполнено(ВременнаяТаблица) Тогда
					ТаблицаFintoolClassification = КонкатенацияТаблицЗначений(ТаблицаFintoolClassification, ВременнаяТаблица);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаFintoolClassification;
КонецФункции

// Возвращает таблицу Info \ FintoolReferenceData (nominaltype)
//
// Параметры:
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  Сессия			 - Строка	 - Кеш сессии HTTP
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Info/FintoolReferenceData)
//
Функция InfoFintoolReferenceData_nominaltype(ОписаниеОшибки, Сессия = Неопределено, ВходныеПараметры = Неопределено) Экспорт
	
	ТаблицаFintoolReferenceData_nominaltype = Новый ТаблицаЗначений;
	
	ОписаниеОшибки = "";
	
	ЧисловыеРеквизиты = ЧисловыеРеквизитыТаблицRuDataAPI();
	
	НастройкиСоединения = ПараметрыИсточника();
	
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		
		Если ВходныеПараметры = Неопределено Тогда
			ВходныеПараметры = Новый Структура;
		КонецЕсли;
		
		МаксимальноеКоличествоСтраниц = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("101.МаксимальноеКоличествоСтраниц", 999);
		Для НомерПачки = 1 По МаксимальноеКоличествоСтраниц Цикл
			ВходныеПараметры.Вставить("НомерПачки", НомерПачки);
			
			Результат = API_ПолучитьОтветМетода("InfoFintoolReferenceData_nominaltype", "/Info/FintoolReferenceData",
				ВходныеПараметры, НастройкиСоединения, ОписаниеОшибки, Сессия);
				
			Если Не ЗначениеЗаполнено(Результат) Тогда
				Возврат ТаблицаFintoolReferenceData_nominaltype;
			КонецЕсли;
			ВременнаяТаблица = ПреобразоватьМассивВТаблицуЗначений(Результат, ЧисловыеРеквизиты);
			ТаблицаFintoolReferenceData_nominaltype = КонкатенацияТаблицЗначений(ТаблицаFintoolReferenceData_nominaltype, ВременнаяТаблица);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаFintoolReferenceData_nominaltype;
	
КонецФункции

// Возвращает таблицу Bond \ Amortizations (не путать с /Bond/{Fintoolid}/Amortizations)
//
// Параметры:
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  Сессия			 - Строка	 - Кеш сессии HTTP
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
//    Обязательные поля:
//     * fintoolids					 - Массив	 - массив fintoolid (обязательное поле - идентификатор ЦБ в RuData),
//													может быть пустым, тогда отбора по fintoolid не будет
//     * ДатаВремяОбновленияДанных	 - Дата		 - дата \ время начала выборки обновлений (пустая дата - по всем датам изменений)
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Bond/Amortizations)
Функция BondAmortizations(ОписаниеОшибки, Сессия = Неопределено, ВходныеПараметры = Неопределено) Экспорт
	ИмяFintoolids = "fintoolids";
	Если ВходныеПараметры = Неопределено Тогда
		ВходныеПараметры = Новый Структура;
		ВходныеПараметры.Вставить(ИмяFintoolids, Новый Массив);
		ВходныеПараметры.Вставить("ДатаВремяОбновленияДанных", ДАТА(1, 1, 1));
	КонецЕсли;
	
	ТаблицаBondAmortizations = Неопределено;
	ОписаниеОшибки = "";
	НуженОтборПоFintoolids = ЗначениеЗаполнено(ВходныеПараметры.fintoolids);
	НастройкиСоединения = ПараметрыИсточника();
	НомерПачки = 0;
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		ОграничениеПоКоличествуЦБ = 100; // Ограничения RuData по объему запрашиваемых данных
		fintoolids = Новый Массив; 
		ПоследнийИндекс = ПоследнийИндексДляЦикла(ВходныеПараметры, ИмяFintoolids);
		Для Индекс = 0 По ПоследнийИндекс Цикл
			Если НуженОтборПоFintoolids Тогда
				fintoolids.Добавить(ВходныеПараметры.fintoolids[Индекс]);
			КонецЕсли;
			Группировать = (Индекс + 1) % ОграничениеПоКоличествуЦБ;
			Если Группировать = 0 Или Индекс = ПоследнийИндекс Тогда
				НомерПачки = НомерПачки + 1;
				
				ВходящиеИдентификаторы = НовыеВходящиеИдентификаторы();
				ВходящиеИдентификаторы.Вставить(ИмяFintoolids, fintoolids);
				ВходныеПараметрыГруппа = НовыеВходныеПараметрыГруппы(НомерПачки, ВходныеПараметры.ДатаВремяОбновленияДанных, ВходящиеИдентификаторы);
				ВременнаяТаблица =
					ТаблицаДанныхМетода("BondAmortizations", НастройкиСоединения, ОписаниеОшибки, Сессия, ВходныеПараметрыГруппа);
				
				fintoolids = Новый Массив;
				
				Если ЗначениеЗаполнено(ВременнаяТаблица) Тогда
					ТаблицаBondAmortizations = КонкатенацияТаблицЗначений(ТаблицаBondAmortizations, ВременнаяТаблица);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаBondAmortizations;
КонецФункции

// Возвращает данные (реквизиты) для создания и \ или обновления ЦБ в справочнике 1С
//
// Параметры:
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
//    Обязательные поля:
//     * ISINs						 - Массив	 - массив isin (пустой массив - по всем ЦБ)
//     * ДатаВремяОбновленияДанных	 - Дата		 - дата \ время начала выборки обновлений (пустая дата - по всем датам изменений)
//    Необязательные поля:
//     * ОбновитьБумагиВНеактуальномСтатусе - Булево - если Истина, то будут загружаться бумаги во всех статусах, но бумаги в
//  												неактуальных статусах будут загружаться только если бумага в справочнике ЦБ
//  												есть и и ее статус изменился
//     * ОбновитьЭмитентовВсехЗагружаемыхЦБ - Булево - если Истина, то будут загружаться эмитенты всех загружаемых ЦБ,
//  												Если же Ложь, то только эмитенты новых ЦБ (то есть ЦБ, которых еще не было
//  												в справочнике ЦБ и эмитенты тех загружаемых ЦБ у которых не был известен 
//  												эмитент (юридическое лицо).
//     * ЭтоОтчет - Булево - если Истина, то данные будут использованы для построения отчета, не нужно подгружать эмитентов ЦБ
//  												даже если указана дата \ время начала выборки обновлений (ДатаВремяОбновленияДанных)
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с колонками, соответствующими реквизитам справочника ЦенныеБумаги
//
Функция ДанныеДляСозданияОбновленияЦенныхБумаг(Знач ВходныеПараметры) Экспорт
	
	ВремяНачалаФормирования = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ТаблицаДанныхЦБ				 = Новый ТаблицаЗначений;
	ТаблицаДанныхЭмитентов		 = Новый ТаблицаЗначений;
	ТаблицаDictionaryCountries	 = Новый ТаблицаЗначений;
	ТаблицаInfoCurrencies		 = Новый ТаблицаЗначений;
	
	
	ИмяПараметраПериод = "ДатаВремяОбновленияДанных";
	
	ОписаниеОшибки = "";
	Сессия = Неопределено;
	
	ТаблицаЭмитентовЗагружаемыхЦБ = Неопределено;
		
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементСтруктурыПриОтсутствии(ВходныеПараметры, "ОбновитьЭмитентовВсехЗагружаемыхЦБ", Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементСтруктурыПриОтсутствии(ВходныеПараметры, "ОбновитьБумагиВНеактуальномСтатусе", Ложь);
	
	ПолучитьInfoSecurities = Истина;
	
	ВходныеПараметрыInfoSecurities = Новый Структура;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВходныеПараметрыInfoSecurities, ВходныеПараметры, Ложь);
	Если СвойствоЗаполнено(ВходныеПараметры, ИмяПараметраПериод) Тогда
		fintoolids = FintoolidsПоВсемИзменениям(ВходныеПараметры, ОписаниеОшибки, Сессия);
		ПолучитьInfoSecurities = ЗначениеЗаполнено(fintoolids);
		ВходныеПараметрыInfoSecurities[ИмяПараметраПериод] = ДАТА(1, 1, 1);
		ВходныеПараметрыInfoSecurities.Вставить("fintoolids", fintoolids);
	КонецЕсли;
	
	ТаблицаInfoSecurities = Неопределено;
	Если ПолучитьInfoSecurities Тогда
		ТаблицаInfoSecurities = ДанныеЦенныхБумагПоПараметрам(ВходныеПараметрыInfoSecurities, ОписаниеОшибки, Сессия);
	КонецЕсли;
	
	БылаОшибкаПодключения = Не ОписаниеОшибки = "";
	
	Если ЗначениеЗаполнено(ТаблицаInfoSecurities) Тогда
		
		ВходныеПараметрыDictionaryCountries = Новый Структура;
		ОписаниеОшибки = "";
		Сессия = Неопределено;
		ТаблицаDictionaryCountries = DictionaryCountries(ОписаниеОшибки, Сессия, ВходныеПараметрыDictionaryCountries);
		
		ВходныеПараметрыInfoCurrencies = Новый Структура;
		ОписаниеОшибки = "";
		Сессия = Неопределено;
		ТаблицаInfoCurrencies = InfoCurrencies(ОписаниеОшибки, Сессия, ВходныеПараметрыInfoCurrencies);
		
		ТаблицаInfoFintoolReferenceData =
			ТаблицаСозданияОбновленияЦенныхБумаг("InfoFintoolReferenceData", ИмяПараметраПериод, ТаблицаInfoSecurities);
		
		ТаблицаNsdCommonData =
			ТаблицаСозданияОбновленияЦенныхБумаг("NsdCommonData", ИмяПараметраПериод, ТаблицаInfoSecurities);
			
		ТаблицаДопущенныхКТоргамЦБ = ЦБДопущенныеКТоргамВРФ(ТаблицаInfoSecurities);
		
		ТаблицаДанныхЦБ = СтатикаЦенныхБумаг(ТаблицаInfoSecurities, ТаблицаInfoFintoolReferenceData, ТаблицаNsdCommonData, 
												ТаблицаДопущенныхКТоргамЦБ, ВходныеПараметры);
		ЗаполнитьПодвидГосОблигаций(ОписаниеОшибки, Сессия, ТаблицаДанныхЦБ);
												
		ВходныеПараметрыДляПолученияЭмитентов = Новый Структура;
		ВходныеПараметрыДляПолученияЭмитентов.Вставить("ОбновитьЭмитентовВсехЗагружаемыхЦБ", ВходныеПараметры.ОбновитьЭмитентовВсехЗагружаемыхЦБ);
		ТаблицаЭмитентовЗагружаемыхЦБ = ТаблицаЭмитентовЗагружаемыхЦБ(ТаблицаДанныхЦБ, ВходныеПараметрыДляПолученияЭмитентов);
	КонецЕсли;
	
	ВходныеПараметрыДляПолученияЭмитентов = Новый Структура;
	ВходныеПараметрыДляПолученияЭмитентов.Вставить(ИмяПараметраПериод, ВходныеПараметры.ДатаВремяОбновленияДанных);
	
	ТаблицаИзменившихсяЭмитентов =  ТаблицаИзменившихсяЭмитентов(ВходныеПараметры);
	ТаблицаДанныхЭмитентов = СтатикаЭмитентов(ТаблицаЭмитентовЗагружаемыхЦБ, ТаблицаИзменившихсяЭмитентов);
	
	ВесЗамера = ТаблицаДанныхЦБ.Количество() + ТаблицаДанныхЭмитентов.Количество();
	ОценкаПроизводительности.ЗакончитьЗамерВремени("RudataAPI.ПолучениеДанныхИзAPI", ВремяНачалаФормирования, ВесЗамера);
	
	ВыходныеПараметры = Новый Структура;
	Если БылаОшибкаПодключения Тогда
		ВыходныеПараметры.Вставить("ТаблицаДанныхЦБ", Неопределено);
		ВыходныеПараметры.Вставить("ТаблицаДанныхЭмитентов", Неопределено);
		ВыходныеПараметры.Вставить("ТаблицаСтран", Неопределено);
		ВыходныеПараметры.Вставить("ТаблицаВалют", Неопределено);
	Иначе
		ВыходныеПараметры.Вставить("ТаблицаДанныхЦБ", ТаблицаДанныхЦБ);
		ВыходныеПараметры.Вставить("ТаблицаДанныхЭмитентов", ТаблицаДанныхЭмитентов);
		ВыходныеПараметры.Вставить("ТаблицаСтран", ТаблицаDictionaryCountries);
		ВыходныеПараметры.Вставить("ТаблицаВалют", ТаблицаInfoCurrencies);
	КонецЕсли;
	
	Возврат ВыходныеПараметры;
	
КонецФункции

// Процедура - Создание обновление ценных бумаг и эмитентов
//
// Параметры:
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
//  Обязательные поля:
//  * ISINs						 - Массив	 - массив isin (пустой массив - по всем ЦБ)
//  * ДатаВремяОбновленияДанных	 - Дата		 - дата \ время начала выборки обновлений (пустая дата - по всем датам изменений)
//  Необязательные поля:
//  * ОбновитьБумагиВНеактуальномСтатусе - Булево - Если Истина, то будут загружаться бумаги во всех статусах, но бумаги в
//  												неактуальных статусах будут загружаться только если бумага в справочнике ЦБ
//  												есть и и ее статус изменился
//  * ОбновитьЭмитентовВсехЗагружаемыхЦБ - Булево - Если Истина, то будут загружаться эмитенты всех загружаемых ЦБ,
//  												Если же Ложь, то только эмитенты новых ЦБ (то есть ЦБ, которых еще не было
//  												в справочнике ЦБ и эмитенты тех загружаемых ЦБ у которых не был известен 
//  												эмитент (юридическое лицо).
//  * СоздатьОбновитьТолькоЭмитентов	 - Булево - Если истина то в базу будут созданы или обновлены только эмитенты
//  												(юридические лица). ЦБ в процессе будут читаться из RuData, но на конечном
//  												этапе создание/обновление ЦБ производится не будет.
//  * ФильтрСтатусовЦБ					 - Строка - Список статусов ЦБ которые нужно загружать в формате фильтра для запросов RuData,
//  												(через запятую в одинарных кавычках. Например: 'Погашен', 'Приостановлен'). Если
//  												передается пустая строка ("") - это означает что фильтр по статусам устанавливать
//  												не нужно. Если поле отсутствует или значение равно неопредлено устанваливается
//  												фильтр по умолчанию - см. функцию ФильтрПоАктуальнымСтатусамЦБ().
// 
// Возвращаемое значение:
//   - Булево - статус завершения
//
Функция СозданиеОбновлениеЦенныхБумагИЭмитентов(ВходныеПараметры) Экспорт
	
	ИмяСобытия = "RuDataAPI";
	
	ТаблицаОшибок = Новый ТаблицаЗначений;

	Попытка
		ВыходныеПараметры = ДанныеДляСозданияОбновленияЦенныхБумаг(ВходныеПараметры);
		
		Если ВыходныеПараметры.ТаблицаДанныхЦБ = Неопределено Тогда
			ТекстОшибки = "Нет подключения к RuDataAPI, см. журнал регистрации вызовов";
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
			Возврат Ложь;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВыходныеПараметры.ТаблицаДанныхЦБ) Тогда
			ШаблонТекстаОшибки = "Нет данных о ЦБ в RuDataAPI по заданным параметрам: ДатаС = [%1] ISINs = [%2]";
			ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки,
				?(ЗначениеЗаполнено(ВходныеПараметры.ДатаВремяОбновленияДанных), ВходныеПараметры.ДатаВремяОбновленияДанных, "Без учета периода"),
				?(ЗначениеЗаполнено(ВходныеПараметры.ISINs), СтрСоединить(ВходныеПараметры.ISINs), "По всем ЦБ"));
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Предупреждение, , , ТекстОшибки);
		КонецЕсли;
		
		ВидОбъекта = Перечисления.ВидыОбъектовКонтактнойИнформации.ЮридическиеЛица;
		ТипАдрес = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ТипТелефон = Перечисления.ТипыКонтактнойИнформации.Телефон;
		ТипАдресЭлектроннойПочты = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		ПараметрыКИ = Новый Структура;
		ПараметрыКИ.Вставить("Период"					, Дата("20000101"));
		ПараметрыКИ.Вставить("ВидОбъекта"				, ВидОбъекта);
		ПараметрыКИ.Вставить("ТипАдрес"					, ТипАдрес);
		ПараметрыКИ.Вставить("ТипТелефон"				, ТипТелефон);
		ПараметрыКИ.Вставить("ТипАдресЭлектроннойПочты"	, ТипАдресЭлектроннойПочты);
		ПараметрыКИ.Вставить("ВидЮридическийАдрес", КонтактнаяИнформация.ВидыКонтактнойИнформации(ВидОбъекта, ТипАдрес, "Юридический")[0]);
		ПараметрыКИ.Вставить("ВидФактическийАдрес", КонтактнаяИнформация.ВидыКонтактнойИнформации(ВидОбъекта, ТипАдрес, "Фактический")[0]);
		ПараметрыКИ.Вставить("ВидТелефон", КонтактнаяИнформация.ВидыКонтактнойИнформации(ВидОбъекта, ТипТелефон, "Телефон")[0]);
		ПараметрыКИ.Вставить("ВидАдресЭлектроннойПочты",
		КонтактнаяИнформация.ВидыКонтактнойИнформации(ВидОбъекта, ТипАдресЭлектроннойПочты, "mail")[0]);
		
		ВремяНачалаФормирования = ОценкаПроизводительности.НачатьЗамерВремени();
		КоличествоЭмитентов = ВыходныеПараметры.ТаблицаДанныхЭмитентов.Количество();
		
		Если КоличествоЭмитентов > 0 Тогда
			КредитныеОрганизации = ЭмитентыКредитныеОрганизации();
			КодыРегистрации = ЭмитентыКодыРегистрации();
		КонецЕсли;
		
		Для Каждого ДанныеЮрЛица Из ВыходныеПараметры.ТаблицаДанныхЭмитентов Цикл
			
			СоздатьОбновитьЮрлицоЭмитента(ДанныеЮрЛица, ПараметрыКИ, КредитныеОрганизации, КодыРегистрации);
			
		КонецЦикла;
		ОценкаПроизводительности.ЗакончитьЗамерВремени("RudataAPI.СозданиеОбновлениеЮрлицЭмитентов", ВремяНачалаФормирования, // BSLLS:Typo-off
			КоличествоЭмитентов);
		
		Если (ВходныеПараметры.Свойство("СоздатьОбновитьТолькоЭмитентов") И ВходныеПараметры.СоздатьОбновитьТолькоЭмитентов)
				Или Не ЗначениеЗаполнено(ВыходныеПараметры.ТаблицаДанныхЦБ) Тогда
				MarketData.ИзменитьПризнакЭмитентаМеждународнаяКомпанияПоДаннымRuData();
				Если Не ВходныеПараметры.Свойство("СоздатьОбновитьТолькоЭмитентов") Или Не ВходныеПараметры.СоздатьОбновитьТолькоЭмитентов Тогда
					ЗагрузитьНКД(ВходныеПараметры.ДатаВремяОбновленияДанных, ВходныеПараметры.ISINs);
					ЗагрузитьДанныеПоОбращаемостиЦБ(ВходныеПараметры.ДатаВремяОбновленияДанных, ВходныеПараметры.ISINs);
				КонецЕсли;
			Возврат Истина;
		КонецЕсли;
		
		
		ПараметрыКИ = Новый Структура;
		ПараметрыКИ.Вставить("Период"					, НачалоДня(ТекущаяДатаСеанса()));
		
		ВремяНачалаФормирования = ОценкаПроизводительности.НачатьЗамерВремени();
		
		FintoolidAmortisedmty = Новый Массив;
		
		КупонныеОблигации = Новый ТаблицаЗначений; 
		КупонныеОблигации.Колонки.Добавить("fintoolid"		, Новый ОписаниеТипов("Число"));
		КупонныеОблигации.Колонки.Добавить("isin"			, Новый ОписаниеТипов("Строка"));
		КупонныеОблигации.Колонки.Добавить("ЦеннаяБумага"	, Новый ОписаниеТипов("СправочникСсылка.ЦенныеБумаги"));
		
		ПараметрыОпределения = Новый Структура;
		
		Для Каждого ДанныеЦБ Из ВыходныеПараметры.ТаблицаДанныхЦБ Цикл
			
			ПараметрыОпределения.Вставить("ДанныеЦБ" , ДанныеЦБ);
		
			ЦеннаяБумага = СоздатьОбновитьЦеннуюБумагу(ДанныеЦБ, ПараметрыКИ, ТаблицаОшибок, ВыходныеПараметры);
			
			ПараметрыОпределения.Вставить("ЦеннаяБумага", ЦеннаяБумага);
			
			ОпределитьЦенныеБумагиДляДополнительныхЗапросов(ПараметрыОпределения, FintoolidAmortisedmty, КупонныеОблигации);
			
		КонецЦикла;
		
		ОценкаПроизводительности.ЗакончитьЗамерВремени("RudataAPI.СозданиеОбновлениеЦенныхБумаг", ВремяНачалаФормирования,
			ВыходныеПараметры.ТаблицаДанныхЦБ.Количество());
		
		Если Не ВходныеПараметры.Свойство("СоздатьОбновитьТолькоЭмитентов") Или Не ВходныеПараметры.СоздатьОбновитьТолькоЭмитентов Тогда
			
			СозданиеОбновлениеОстаточнойАмортизацииЦенныхБумаг(FintoolidAmortisedmty);
			
			СозданиеОбновлениеИндексацииНоминалаЦенныхБумаг();
			
			СозданиеОбновлениеКупоновЦенныхБумаг(КупонныеОблигации);
			
			ЗагрузитьНКД(ВходныеПараметры.ДатаВремяОбновленияДанных, ВходныеПараметры.ISINs);
			
			ЗагрузитьДанныеПоОбращаемостиЦБ(ВходныеПараметры.ДатаВремяОбновленияДанных, ВходныеПараметры.ISINs);
			
		КонецЕсли;
		
		КоличествоОшибок = ТаблицаОшибок.Количество();
		
		Если НеобходимоОтправитьПисьмоОРезультатахЗагрузкиСтатики(ВходныеПараметры, КоличествоОшибок) Тогда
			
			ВремяНачалаФормирования = ОценкаПроизводительности.НачатьЗамерВремени();
			
			ОтправитьУведомлениеОбОшибкахЗагрузкиЦБизRuDataAPI(ТаблицаОшибок, "Загрузка завершена.");
			
			ОценкаПроизводительности.ЗакончитьЗамерВремени("RudataAPI.УведомлениеОбОшибкахЗагрузки", ВремяНачалаФормирования,
				КоличествоОшибок);
			
		КонецЕсли;
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ОтправитьУведомлениеОбОшибкахЗагрузкиЦБизRuDataAPI(ТаблицаОшибок, ТекстОшибки);
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		
		Возврат Ложь;
		
	КонецПопытки;
	
	MarketData.ИзменитьПризнакЭмитентаМеждународнаяКомпанияПоДаннымRuData();
	Возврат Истина;
	
КонецФункции

// Процедура - Создать обновить код загрузки
//
// Параметры:
//  Владелец						 - СправочникСсылка	 - Владелец кода загрузки
//  КлассификаторЗагрузки			 - СправочникСсылка	 - КлассификаторыЗагрузки
//  Код								 - Строка			 - Код загрузки
//  ТолькоСоздать					 - Булево			 - Истина - создавать, не проверяя есть ли такой код
//  ДатаНачалаДействия				 - Дата				 - ДатаНачалаДействия
//  ДатаОкончанияДействия			 - Дата				 - ДатаОкончанияДействия
//  УчестьДатуДействияКодаЗагрузки	 - Булево			 - Признак того, что при поиске кода загрузки учитывать дату окончания действия
//
Процедура СоздатьОбновитьКодЗагрузки(Владелец, КлассификаторЗагрузки, Код, ТолькоСоздать,
	ДатаНачалаДействия = Неопределено, ДатаОкончанияДействия = Неопределено, УчестьДатуДействияКодаЗагрузки = Ложь) Экспорт
	
	Создаем = Истина;
	
	Если Не ТолькоСоздать Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КодыЗагрузки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КодыЗагрузки КАК КодыЗагрузки
		|ГДЕ
		|	КодыЗагрузки.Владелец = &Владелец
		|	И КодыЗагрузки.Биржа = &КлассификаторЗагрузки
		|	И КодыЗагрузки.Код = &Код
		|	И НЕ КодыЗагрузки.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА НЕ &УчестьДатуДействияКодаЗагрузки
		|				ТОГДА ИСТИНА
		|			КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ КодыЗагрузки.ДатаОкончанияДействия > НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|		КОНЕЦ";
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("КлассификаторЗагрузки", КлассификаторЗагрузки);
		Запрос.УстановитьПараметр("Код", Код);
		Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("УчестьДатуДействияКодаЗагрузки", УчестьДатуДействияКодаЗагрузки);
		Результат = Запрос.Выполнить();
		Создаем = Результат.Пустой();
	КонецЕсли;
	
	Если Создаем Тогда
		
		КодЗагрузки = Справочники.КодыЗагрузки.СоздатьЭлемент();
		КодЗагрузки.ДополнительныеСвойства.Вставить("КомментарийДляИсторииДанных", "ЗагрузкаСтатикиИзAPIRuData");
		КодЗагрузки.Владелец = Владелец;
		КодЗагрузки.Биржа = КлассификаторЗагрузки;
		КодЗагрузки.Код = Код;
		Если ЗначениеЗаполнено(ДатаНачалаДействия) Тогда
			КодЗагрузки.ДатаНачалаДействия = ДатаНачалаДействия;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДатаОкончанияДействия) Тогда
			КодЗагрузки.ДатаОкончанияДействия = ДатаОкончанияДействия;
		КонецЕсли;
		КодЗагрузки.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает признак прекращения действия прочих кодов загрузки (и прекращает их действие)
//
// Параметры:
//  Владелец				 - СправочникСсылка	 - Владелец кода загрузки
//  КлассификаторЗагрузки	 - СправочникСсылка	 - КлассификаторыЗагрузки
//  ТекущийКод				 - Строка			 - Проверяемый код загрузки
//  ДатаОкончанияДействия	 - Дата				 - ДатаОкончанияДействия
// 
// Возвращаемое значение:
//   - Булево - Истина, если предыдущий код загрузки прекратил свое действие
//
Функция ПрекратитьДействиеПрочихКодовЗагрузки(Владелец, КлассификаторЗагрузки, ТекущийКод, ДатаОкончанияДействия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КодыЗагрузки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	КодыЗагрузки.Владелец = &Владелец
	|	И КодыЗагрузки.Биржа = &КлассификаторЗагрузки
	|	И КодыЗагрузки.Код <> &Код
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|	И КодыЗагрузки.ДатаНачалаДействия <= &ДатаОкончанияДействия
	|	И КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("КлассификаторЗагрузки", КлассификаторЗагрузки);
	Запрос.УстановитьПараметр("Код", ТекущийКод);
	Запрос.УстановитьПараметр("ДатаОкончанияДействия", ДатаОкончанияДействия);
	Результат = Запрос.Выполнить();
	ПрекратитьДействие = Не Результат.Пустой();
	Если ПрекратитьДействие Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		КодЗагрузки = Выборка.Ссылка.ПолучитьОбъект();
		КодЗагрузки.ДатаОкончанияДействия = ДатаОкончанияДействия;
		КодЗагрузки.ОбменДанными.Загрузка = Истина;
		КодЗагрузки.Записать();
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

// Процедура для вызова из регламентного задания ЗагрузкаСтатикиПогашенныхЦБНаОстатках
Процедура ВыполнитьОбновлениеПогашенныхЦБ() Экспорт

	СписокISIN = СписокПогашенныхЦБСОстатками();
	Если СписокISIN.Количество() Тогда
		ЗагрузитьЦБЭмитенты(СписокISIN);
	КонецЕсли;

КонецПроцедуры

// Процедура - Создание обновление остаточной амортизации ценных бумаг
//
// Параметры:
//  FintoolidAmortisedmty	 - Массив	 - Массив параметров {isin, fintoolid, ЦеннаяБумага}
//
Процедура СозданиеОбновлениеОстаточнойАмортизацииЦенныхБумаг(FintoolidAmortisedmty) Экспорт
	
	ВремяНачалаФормирования = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Если Не ЗначениеЗаполнено(FintoolidAmortisedmty) Или ТестированиеVanessa.ЭтоТест() Тогда
		Возврат;
	КонецЕсли;
	
	Соединение	 = Неопределено;
	Токен		 = Неопределено;
	Сессия		 = Неопределено;
	ЛогПолученныхДанных = Неопределено;
	ОставитьЗаписьВЖурналеРегистрацииВызовов			 = Ложь;
	ДопустимыйТекстОтказа = "позднее даты";
	
	СлужебныйВызов = Ложь;
	Отказ		 = Ложь;
	ТекстОтказа	 = "";
	ПодключитьсяКСервису(Соединение, Токен, Отказ, ТекстОтказа, СлужебныйВызов, Сессия);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура();
	ПараметрыМетода.Вставить("count", 9999999);
	
	Для Каждого ПараметрыАмортизацииЦБ Из FintoolidAmortisedmty Цикл 
		
		ПараметрыМетода.Вставить("Fintoolid", ПараметрыАмортизацииЦБ.Fintoolid);
		
		ДополнительныйКомментарийВЖурналеРегистрацииВызовов = "";
		Отказ			 = Ложь;
		ТекстОтказа		 = "";
		ПолученныеДанные =
			RuDataAPI.ДанныеМетода_V2_Bond_Amortizations(ПараметрыМетода, Отказ, ТекстОтказа,
				ЛогПолученныхДанных, Сессия, ОставитьЗаписьВЖурналеРегистрацииВызовов, ДополнительныйКомментарийВЖурналеРегистрацииВызовов);
		Если Отказ Или ЗначениеЗаполнено(ТекстОтказа) Тогда
			ВызватьИсключение ТекстОтказа;
		КонецЕсли;
		
		Для Каждого СтрокаДанных Из ПолученныеДанные Цикл
			
			ПараметрыМетода.Вставить("id",				 ПараметрыАмортизацииЦБ.isin);
			ПараметрыМетода.Вставить("date",			 СтрокаДанных.mty_date);
			ПараметрыМетода.Вставить("isCloseRegister",	 Истина);
			ПараметрыМетода.Вставить("isPercent",		 Ложь);
			
			ДатаИзмененияОстаточногоНоминала = ОбщегоНазначенияКлиентСервер.ПолучитьДатуИзJSON(СтрокаДанных.mty_date);
			
			ШаблонКомментария = "ISIN: [%1], на дату номинала: [%2]";
			ДополнительныйКомментарийВЖурналеРегистрацииВызовов = СтрШаблон(ШаблонКомментария, ПараметрыМетода.id, ПараметрыМетода.date);
			Отказ			 = Ложь;
			ТекстОтказа		 = "";
			ОстаточныйНоминал =
				RuDataAPI.ДанныеМетода_V2_Info_ResidualFaceValue(ПараметрыМетода, Отказ, ТекстОтказа,
					ЛогПолученныхДанных, Сессия, ОставитьЗаписьВЖурналеРегистрацииВызовов, ДополнительныйКомментарийВЖурналеРегистрацииВызовов);
			
			ОбновитьОстаточныйНоминал = Не Отказ И (Не ЗначениеЗаполнено(ТекстОтказа) Или СтрНайти(ТекстОтказа, ДопустимыйТекстОтказа) > 0);
			Если ОбновитьОстаточныйНоминал Тогда
				ОбновитьОстаточныйНоминалЦеннойБумаги(ПараметрыАмортизацииЦБ.ЦеннаяБумага, ДатаИзмененияОстаточногоНоминала, ОстаточныйНоминал);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Отказ			 = Ложь;
	ТекстОтказа		 = "";
	ВыйтиИзСервиса(Соединение, Отказ, ТекстОтказа);
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("RudataAPI.СозданиеОбновлениеОстаточнойАмортизацииЦенныхБумаг", ВремяНачалаФормирования,
		FintoolidAmortisedmty.Количество());
	
КонецПроцедуры

// Процедура - Создание обновление индексации номинала  ценных бумаг
//
Процедура СозданиеОбновлениеИндексацииНоминалаЦенныхБумаг() Экспорт
	
	Если ТестированиеVanessa.ЭтоТест() Тогда
		Возврат;
	КонецЕсли;
	
	ВремяНачалаФормирования = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ИндексируемыеНоминалы = ИндексируемыеНоминалыЦенныхБумаг();
	КомментарийЗамера = "[" + ИндексируемыеНоминалы.Количество() + "] - строк данных получено";
	ВесЗамера = 0;
	Для Каждого ИндексируемыйНоминал Из ИндексируемыеНоминалы Цикл
		НоминалНовый = ИндексируемыйНоминал.currentfacevalue_nrd;
		Если НоминалНовый <> ИндексируемыйНоминал.facevalue Тогда
			КодЗагрузкиRuData = Формат(ИндексируемыйНоминал.fintoolid, "ЧГ=0");
			НоминалТекущий = РегистрыСведений.НоминалЦБ.НоминалЦеннойБумагиПоКодуRuData(КодЗагрузкиRuData);
			Если НоминалТекущий <> 0 И НоминалНовый <> НоминалТекущий Тогда
				РегистрыСведений.НоминалЦБ.УстановитьНоминалЦеннойБумагиПоКодуRuData(НоминалНовый, КодЗагрузкиRuData);
				ВесЗамера = ВесЗамера + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("RudataAPI.СозданиеОбновлениеИндексацииНоминалаЦенныхБумаг",
		ВремяНачалаФормирования, ВесЗамера, КомментарийЗамера);
	
КонецПроцедуры

// Процедура - Создание обновление купонов ценных бумаг
//
// Параметры:
//  КупонныеОблигации	 - ТаблицаЗначений	 - Таблица с колонками {fintoolid, isin, ЦеннаяБумага}
//
Процедура СозданиеОбновлениеКупоновЦенныхБумаг(КупонныеОблигации) Экспорт
	
	Если Не ЗначениеЗаполнено(КупонныеОблигации) Или ТестированиеVanessa.ЭтоТест() Тогда
		Возврат;
	КонецЕсли;
	
	ВремяНачалаФормирования = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ИмяПараметраПериод = "ДатаВремяОбновленияДанных";
	ВходныеПараметры = Новый Структура();
	ВходныеПараметры.Вставить("eventTypes", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("CPN"));
	
	ТаблицаBondTimeTableCPN =
		ТаблицаСозданияОбновленияЦенныхБумаг("BondTimeTable", ИмяПараметраПериод, КупонныеОблигации, ВходныеПараметры);
	
	ПолученыДанные = ЗначениеЗаполнено(ТаблицаBondTimeTableCPN);
	Если ПолученыДанные Тогда
		ВесЗамера = ТаблицаBondTimeTableCPN.Количество();
	Иначе
		ВесЗамера = 0;
	КонецЕсли;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("RudataAPI.ПолучениеКупоновЦенныхБумаг", ВремяНачалаФормирования, ВесЗамера);
	
	ВремяНачалаФормирования = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Если ПолученыДанные Тогда
		ТаблицаBondTimeTableCPN.Индексы.Добавить("fintoolid");
		ЗаполнитьКупоныЦенныхБумаг(ТаблицаBondTimeTableCPN, КупонныеОблигации);
	КонецЕсли;
	
	ВесЗамера = КупонныеОблигации.Количество();
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("RudataAPI.ЗаполнениеКупоновЦенныхБумаг", ВремяНачалаФормирования, ВесЗамера);
	
КонецПроцедуры

// Функция возвращает статусы ЦБ, которые считаются актуальными
//
// Возвращаемое значение:
//	- Массив - Массив строк с названиями статусов актуальных бумаг
Функция СтатусыАктуальныхЦБ() Экспорт
	Статусы = Новый Массив;
	Статусы.Добавить("В обращении");
	Статусы.Добавить("Дефолт");
	Статусы.Добавить("Размещается");
	
	Возврат Статусы;
КонецФункции

// Функция возвращает статусы ЦБ, которые считаются актуальными в формате фильтра для запросов RuData,
// например: "'В обращении', 'Дефолт', 'Размещается'"
// Возвращаемое значение:
//   - Строка - в формате фильтра для запросов RuData
Функция ФильтрПоАктуальнымСтатусамЦБ() Экспорт
	СтрокаДляФильтра = "";
	Статусы = СтатусыАктуальныхЦБ();
	Для Каждого Статус Из Статусы Цикл
		Если Не ПустаяСтрока(СтрокаДляФильтра) Тогда
			СтрокаДляФильтра = СтрокаДляФильтра + ", ";
		КонецЕсли;
		СтрокаДляФильтра = СтрокаДляФильтра + "'" + Статус + "'";
	КонецЦикла;
	
	Возврат СтрокаДляФильтра;
КонецФункции

// Процедура - Обновить остаточный номинал ценной бумаги
//
// Параметры:
//  ЦеннаяБумага					 - СправочникСсылка.ЦенныеБумаги - Ценная бумага
//  ДатаИзмененияОстаточногоНоминала - Дата							 - Дата начала действия остаточного номинала
//  ОстаточныйНоминал				 - Число						 - Остаточный номинал
//
Процедура ОбновитьОстаточныйНоминалЦеннойБумаги(ЦеннаяБумага, ДатаИзмененияОстаточногоНоминала, ОстаточныйНоминал) Экспорт
	
	Если ЗначениеЗаполнено(ДатаИзмененияОстаточногоНоминала) И ТипЗнч(ДатаИзмененияОстаточногоНоминала) = Тип("Дата") Тогда
		НаборЗаписей = РегистрыСведений.НоминалЦБ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ДатаИзмененияОстаточногоНоминала);
		НаборЗаписей.Отбор.ЦеннаяБумага.Установить(ЦеннаяБумага);
		
		НовЗапись = НаборЗаписей.Добавить();
		НовЗапись.Период		 = ДатаИзмененияОстаточногоНоминала;
		НовЗапись.ЦеннаяБумага	 = ЦеннаяБумага;
		НовЗапись.Сумма			 = ОстаточныйНоминал;
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Загрузить НКД
//
// Параметры:
//  Дата - Дата - Дата на которую требуется загрузить НКД
//  Isins - Массив - Массив ISIN ценных бумаг
//
Процедура ЗагрузитьНКД(Дата = Неопределено, Isins = Неопределено) Экспорт
	НачалоДняТекущаяДатаСеанса = НачалоДня(ТекущаяДатаСеанса());
	Если ЗначениеЗаполнено(Дата) Тогда
		ТекущаяДата = НачалоДня(Дата);
	Иначе
		ТекущаяДата = НачалоДняТекущаяДатаСеанса;
	КонецЕсли;
	Сутки = ОбщегоНазначенияПовтИсп.СекундВСутках();
	Пока ТекущаяДата < НачалоДняТекущаяДатаСеанса Цикл
		ОсновнойАлгоритмЗагрузкиНКД(ТекущаяДата, Isins);
		ТекущаяДата = ТекущаяДата + Сутки;
	КонецЦикла;
	ОсновнойАлгоритмЗагрузкиНКД(НачалоДняТекущаяДатаСеанса, Isins);
	
КонецПроцедуры

// Процедура загружает данные по обращаемости ЦБ с учетом заданных параметров
//
// Параметры:
//  ДатаВремяОбновленияДанных - Дата - Дата на которую загружается обращаемость
//  Isins - Строка - Строка со списоком Isins
//
Процедура ЗагрузитьДанныеПоОбращаемостиЦБ(ДатаВремяОбновленияДанных, Isins) Экспорт
	
	Сутки = ОбщегоНазначенияПовтИсп.СекундВСутках();
	
	Если ЗначениеЗаполнено(ДатаВремяОбновленияДанных) Тогда
		Если НачалоДня(ДатаВремяОбновленияДанных) = НачалоДня(ТекущаяДатаСеанса()) Тогда
			ДатаНачалаОбработки = НачалоДня(ДатаВремяОбновленияДанных) - Сутки ;
		Иначе
			ДатаНачалаОбработки = НачалоДня(ДатаВремяОбновленияДанных);
		КонецЕсли;
		НачалоДняТекущаяДатаСеанса = НачалоДня(ТекущаяДатаСеанса()) - Сутки;
	Иначе
		ДатаНачалаОбработки = НачалоДня(ТекущаяДатаСеанса()) - Сутки;
		НачалоДняТекущаяДатаСеанса = ДатаНачалаОбработки;
	КонецЕсли;
	
	Соединение = Неопределено;
	Токен = Неопределено;
	Сессия = Неопределено;
	
	СлужебныйВызов = Ложь;
	Отказ = Ложь;
	ТекстОтказа = "";
	ПодключитьсяКСервису(Соединение, Токен, Отказ, ТекстОтказа, СлужебныйВызов, Сессия);
	
	Если Не Отказ Тогда
		ПараметрыСессии = Новый Структура();
		ПараметрыСессии.Вставить("Отказ", Отказ);
		ПараметрыСессии.Вставить("ТекстОтказа", ТекстОтказа);
		ПараметрыСессии.Вставить("Сессия", Сессия);
		
		Пока ДатаНачалаОбработки <= НачалоДняТекущаяДатаСеанса Цикл
			ЗагрузитьДанныеПоОбращаемостиЦБНаДату(ПараметрыСессии, ДатаНачалаОбработки, Isins);
			ДатаНачалаОбработки = ДатаНачалаОбработки + Сутки;
		КонецЦикла;  
	КонецЕсли;
	
КонецПроцедуры

// BSLLS:LatinAndCyrillicSymbolInWord-off

#Область ЗагрузкаКотировок_МетодыAPI
// Функция - Данные метода загрузить НКД
//
// Параметры:
//  СписокБумаг	 - Массив - Код ЦБ Rudata
//  ТекущаяДата	 - Дата - Текущая дата
// 
// Возвращаемое значение:
//   - Массив - Массив с данными по НКД
//
Функция ДанныеМетодаЗагрузитьНКД(СписокБумаг, ТекущаяДата) Экспорт
	
	ИмяМетода = "AccruedInterestOnDate";
	Токен = ТокенАвторизации();
	Если Не ЗначениеЗаполнено(Токен) Тогда // нет возможности дальше продолжать
		Возврат Неопределено;
	КонецЕсли;
	НастройкиСоединения = ПараметрыИсточника();
	ПутьКМетоду = "/AccruedInterest/AccruedInterestOnDate";
	URL = "https://" + НастройкиСоединения.HTTPСервисАдресСервера + НастройкиСоединения.HTTPСервисАдресРесурса + ПутьКМетоду;
	Сессия = Неопределено;
	Таймаут = 30;
	
	СтруктураДляJSON = Новый Структура();
	СтруктураДляJSON.Вставить("fintoolIds", СписокБумаг);
	СтруктураДляJSON.Вставить("cashFlowCalcDate", ТекущаяДата);
	СтруктураДляJSON.Вставить("shiftDays", 0);
	СтруктураДляJSON.Вставить("shiftTypeSource", 0);
	СтруктураДляJSON.Вставить("useRounding", Истина);
	
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Authorization", Токен);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Заголовки", Заголовки);
	ДополнительныеПараметры.Вставить("Таймаут", Таймаут);
	ДополнительныеПараметры.Вставить("ПараметрыПреобразованияJSON", Новый Структура("ПрочитатьВСоответствие", Ложь));
	Если НастройкиСоединения.ПроксиСерверИспользовать Тогда
		ПроксиСервер = Новый ИнтернетПрокси;
		ПроксиСервер.Установить("https", НастройкиСоединения.ПроксиСерверАдрес, НастройкиСоединения.ПроксиСерверПорт);
		ДополнительныеПараметры.Вставить("Прокси", ПроксиСервер);
	КонецЕсли;
	ВходныеПараметры = Новый Структура();
	ВходныеПараметры.Вставить("НомерПачки", 0);
	
	HTTPОтвет = API_ВыполнитьЗапрос(ИмяМетода, ВходныеПараметры, НастройкиСоединения, URL, СтруктураДляJSON,
	ДополнительныеПараметры, Сессия);
	
	Возврат HTTPОтвет;
	
КонецФункции

// Метод /v2/Bond/{Fintoolid}/Amortizations (не путать с Bond \ Amortizations). Получить даты амортизации
//
// Параметры:
//  ВхПараметры								 - Строка	 - Входные параметры метода
//  Отказ									 - Булево	 - Признак отказа
//  ТекстОтказа								 - Строка	 - Описание ошибки
//  ЛогПолученныхДанных						 - ТекстовыйДокумент - Логирование
//  Сессия									 - Стркутура		 - Кеш соединения
//  ОставитьЗаписьВЖурналеРегистрацииВызовов - Булево			 - Делать запись в журнале регистрации вызовов
//  Комментарий								 - Строка			 - Комментарий в журнале регистрации вызовов
// 
// Возвращаемое значение:
//   - Массив - Периоды амортизации для торговых инструментов
//
Функция ДанныеМетода_V2_Bond_Amortizations(
	ВхПараметры,
	Отказ,
	ТекстОтказа,
	ЛогПолученныхДанных,
	Сессия = Неопределено,
	ОставитьЗаписьВЖурналеРегистрацииВызовов = Истина,
	Комментарий = "") Экспорт
	
	СвойстваМетода = "";
	
	ПараметрыURLЗапроса = Новый Структура;
	ДобавитьОбщиеПараметрыURLЗапроса(ПараметрыURLЗапроса, ВхПараметры, СвойстваМетода);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ПараметрыURLЗапроса, ВхПараметры, СвойстваМетода);
	
	АдресСервиса = "/v2/Bond/" + ВхПараметры.Fintoolid + "/Amortizations";
	
	СлужебныйВызов = Ложь;
	
	Возврат ПолучитьДанныеИзСервиса_V2(АдресСервиса, ПараметрыURLЗапроса, Отказ, ТекстОтказа, ЛогПолученныхДанных, СлужебныйВызов, Сессия,
		ОставитьЗаписьВЖурналеРегистрацииВызовов, Комментарий);
	
КонецФункции

// Метод /v2/Info/ResidualFaceValue. Получить сумму остаточной стоиомсти номинала
//
// Параметры:
//  ВхПараметры								 - Строка	 - Входные параметры метода
//  Отказ									 - Булево	 - Признак отказа
//  ТекстОтказа								 - Строка	 - Описание ошибки
//  ЛогПолученныхДанных						 - ТекстовыйДокумент - Логирование
//  Сессия									 - Стркутура		 - Кеш соединения
//  ОставитьЗаписьВЖурналеРегистрацииВызовов - Булево			 - Делать запись в журнале регистрации вызовов
//  Комментарий								 - Строка			 - Комментарий в журнале регистрации вызовов
// 
// Возвращаемое значение:
//   - Число - Сумма остаточной стоимости номинала
//
Функция ДанныеМетода_V2_Info_ResidualFaceValue(
	ВхПараметры,
	Отказ,
	ТекстОтказа,
	ЛогПолученныхДанных,
	Сессия = Неопределено,
	ОставитьЗаписьВЖурналеРегистрацииВызовов = Истина,
	Комментарий = "") Экспорт
	
	СвойстваМетода = "id,date,isCloseRegister,isPercent";
	
	ПараметрыURLЗапроса = Новый Структура;
	ДобавитьОбщиеПараметрыURLЗапроса(ПараметрыURLЗапроса, ВхПараметры, СвойстваМетода);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ПараметрыURLЗапроса, ВхПараметры, СвойстваМетода);
	
	АдресСервиса = "/v2/Info/ResidualFaceValue";
	
	СлужебныйВызов = Ложь;
	
	ResidualFaceValues
		= ПолучитьДанныеИзСервиса_V2(АдресСервиса, ПараметрыURLЗапроса, Отказ, ТекстОтказа, ЛогПолученныхДанных, СлужебныйВызов, Сессия,
			ОставитьЗаписьВЖурналеРегистрацииВызовов, Комментарий);
	
	Если Отказ Или ResidualFaceValues.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	ResidualFaceValue = ResidualFaceValues[0];
	Если ЗначениеЗаполнено(ResidualFaceValue.error) Тогда
		ТекстОтказа = СокрЛП(ResidualFaceValue.error);
		Возврат 0;
	КонецЕсли;
	
	Возврат ResidualFaceValue.faceValue;
	
КонецФункции

// Метод /v2/Archive/CurrencyRate. Получить кросс-курс двух валют.
//
// Параметры:
//  ВхПараметры			 - Строка			 - Входные параметры метода
//  Отказ				 - Булево			 - Признак отказа
//  ТекстОтказа			 - Строка			 - Описание ошибки
//  ЛогПолученныхДанных	 - ТекстовыйДокумент - Логирование
//  Сессия				 - Стркутура		 - Кеш соединения
// 
// Возвращаемое значение:
//   - Массив - Кросс-курсы
//
Функция ДанныеМетода_V2_Archive_CurrencyRate(
	ВхПараметры,
	Отказ,
	ТекстОтказа,
	ЛогПолученныхДанных = Неопределено,
	Сессия = Неопределено) Экспорт
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СвойстваМетода = "from,to,date";
	
	ПараметрыURLЗапроса = Новый Структура;
	ДобавитьОбщиеПараметрыURLЗапроса(ПараметрыURLЗапроса, ВхПараметры, СвойстваМетода);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ПараметрыURLЗапроса, ВхПараметры, СвойстваМетода);
	
	АдресСервиса	= "/v2/Archive/CurrencyRate";
	
	СлужебныйВызов = Истина;
	ОставитьЗаписьВЖурналеРегистрацииВызовов = Ложь;
	
	Возврат ПолучитьДанныеИзСервиса_V2(АдресСервиса, ПараметрыURLЗапроса, Отказ, ТекстОтказа, ЛогПолученныхДанных, СлужебныйВызов, Сессия,
		ОставитьЗаписьВЖурналеРегистрацииВызовов);
	
КонецФункции

// Метод /v2/Info/ExchangeTree. Получить иерархию торговых площадок/источников, используемых Интерфакс.
//
// Параметры:
//  ВхПараметры			 - Строка			 - Входные параметры метода
//  Отказ				 - Булево			 - Признак отказа
//  ТекстОтказа			 - Строка			 - Описание ошибки
//  ЛогПолученныхДанных	 - ТекстовыйДокумент - Логирование
//  Сессия				 - Стркутура		 - Кеш соединения
// 
// Возвращаемое значение:
//   - Массив - Тороговые площадки
//
Функция ДанныеМетода_V2_Info_ExchangeTree(
	ВхПараметры,
	Отказ,
	ТекстОтказа,
	ЛогПолученныхДанных = Неопределено,
	Сессия = Неопределено) Экспорт
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СвойстваМетода = "filter,pageNum,pageSize";
	
	ПараметрыURLЗапроса	= Новый Структура;
	ДобавитьОбщиеПараметрыURLЗапроса(ПараметрыURLЗапроса, ВхПараметры, СвойстваМетода);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ПараметрыURLЗапроса, ВхПараметры, СвойстваМетода);
	
	АдресСервиса	= "/v2/Info/ExchangeTree";
	
	СлужебныйВызов = Истина;
	
	Возврат ПолучитьДанныеИзСервиса_V2(АдресСервиса, ПараметрыURLЗапроса, Отказ, ТекстОтказа, ЛогПолученныхДанных, СлужебныйВызов, Сессия);
	
КонецФункции

// Метод /v2/Info/Fields. Получить справочник по полям данных Для торговых инструментов.
//  {fininstId} Идентификатор компании в БД Интерфакс.
//
// Параметры:
//  ВхПараметры			 - Строка			 - Входные параметры метода
//  Отказ				 - Булево			 - Признак отказа
//  ТекстОтказа			 - Строка			 - Описание ошибки
//  ЛогПолученныхДанных	 - ТекстовыйДокумент - Логирование
// 
// Возвращаемое значение:
//   - Массив - Поля данных для торговых инструментов
//
Функция ДанныеМетода_V2_Info_Fields(
	ВхПараметры,
	Отказ,
	ТекстОтказа,
	ЛогПолученныхДанных = Неопределено) Экспорт
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СвойстваМетода = "filter,parameters";
	
	ПараметрыURLЗапроса	= Новый Структура;
	ДобавитьОбщиеПараметрыURLЗапроса(ПараметрыURLЗапроса, ВхПараметры, СвойстваМетода);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ПараметрыURLЗапроса, ВхПараметры, СвойстваМетода);
	
	АдресСервиса	= "/v2/Info/Fields";
	
	СлужебныйВызов = Ложь;
	
	Возврат ПолучитьДанныеИзСервиса_V2(АдресСервиса, ПараметрыURLЗапроса, Отказ, ТекстОтказа, ЛогПолученныхДанных, СлужебныйВызов);
	
КонецФункции

// Метод /v2/Archive/EndOfDayOnExchanges. Получить данные по результатам торгов на заданную дату.
//  Дату (параметр date) следует указывать в формате без временной зоны. Например, «2016-10-17T00:00:00.0000000Z».
//
// Параметры:
//  ВхПараметры								 - Строка	 - Входные параметры метода
//  Отказ									 - Булево	 - Признак отказа
//  ТекстОтказа								 - Строка	 - Описание ошибки
//  ЛогПолученныхДанных						 - ТекстовыйДокумент - Логирование
//  Сессия									 - Стркутура		 - Кеш соединения
//  ОставитьЗаписьВЖурналеРегистрацииВызовов - Булево			 - Делать запись в журнале регистрации вызовов
//  Комментарий								 - Строка			 - Комментарий в журнале регистрации вызовов
// 
// Возвращаемое значение:
//   - Массив - Котировки
//
Функция ДанныеМетода_v2_Archive_EndOfDayOnExchanges(
	ВхПараметры,
	Отказ,
	ТекстОтказа,
	ЛогПолученныхДанных,
	Сессия = Неопределено,
	ОставитьЗаписьВЖурналеРегистрацииВызовов = Истина,
	Комментарий = "") Экспорт
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СвойстваМетода =
	"issIds,codes,fintoolIds,tradeSites,boardIds,dateFrom,dateTo,fields,official,useDefaultTradeSite,pageNum,pageSize";
	
	ПараметрыURLЗапроса	= Новый Структура;
	ДобавитьОбщиеПараметрыURLЗапроса(ПараметрыURLЗапроса, ВхПараметры, СвойстваМетода);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ПараметрыURLЗапроса, ВхПараметры, СвойстваМетода);
	
	АдресСервиса	= "/v2/Archive/EndOfDayOnExchanges";
	
	СлужебныйВызов = Истина;
	
	Возврат ПолучитьДанныеИзСервиса_V2(АдресСервиса, ПараметрыURLЗапроса, Отказ, ТекстОтказа, ЛогПолученныхДанных, СлужебныйВызов, Сессия,
		ОставитьЗаписьВЖурналеРегистрацииВызовов, Комментарий);
	
КонецФункции

// Метод /v2/Risk/RiskGroupParam. Получить признак обращаемости ценной бумаги на заданную дату.
//
// Параметры:
//  ВхПараметры								 - Строка	 - Входные параметры метода
//  Отказ									 - Булево	 - Признак отказа
//  ТекстОтказа								 - Строка	 - Описание ошибки
//  ЛогПолученныхДанных						 - ТекстовыйДокумент - Логирование
//  Сессия									 - Структура		 - Кеш соединения
//  ОставитьЗаписьВЖурналеРегистрацииВызовов - Булево			 - Делать запись в журнале регистрации вызовов
//  Комментарий								 - Строка			 - Комментарий в журнале регистрации вызовов
// 
// Возвращаемое значение:
//   - Число - Признак обращаемости ценной бумаги
//
Функция ДанныеМетода_V2_Risk_RiskGroupParams(
	ВхПараметры,
	Отказ,
	ТекстОтказа,
	ЛогПолученныхДанных,
	Сессия = Неопределено,
	ОставитьЗаписьВЖурналеРегистрацииВызовов = Истина,
	Комментарий = "") Экспорт
	
	СвойстваМетода = "isin,date,params";
	
	ПараметрыURL = Новый Структура;
	ДобавитьОбщиеПараметрыURLЗапроса(ПараметрыURL, ВхПараметры, СвойстваМетода);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ПараметрыURL, ВхПараметры, СвойстваМетода);
	
	АдресСервиса = "/v2/Risk/RiskGroupParams";
	СлужебныйВызов = Ложь;
	
	RiskGroupParams = ПолучитьДанныеИзСервиса_V2(АдресСервиса, ПараметрыURL, Отказ, ТекстОтказа, ЛогПолученныхДанных, СлужебныйВызов, Сессия,
			ОставитьЗаписьВЖурналеРегистрацииВызовов, Комментарий);
	
	Если Отказ Или RiskGroupParams.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	RiskGroupParam = RiskGroupParams[0];
	Если ЗначениеЗаполнено(RiskGroupParam.error) Тогда
		ТекстОтказа = СокрЛП(RiskGroupParam.error);
		Возврат 0;
	КонецЕсли;
	
	Возврат RiskGroupParam.param;
	
КонецФункции

// Метод /v2/Risk/FintoolsRiskGroupParams . Получить признак обращаемости ценной бумаги на заданную дату.
//
// Параметры:
//  ВхПараметры								 - Строка	 - Входные параметры метода
//  Отказ									 - Булево	 - Признак отказа
//  ТекстОтказа								 - Строка	 - Описание ошибки
//  ЛогПолученныхДанных						 - ТекстовыйДокумент - Логирование
//  Сессия									 - Структура		 - Кеш соединения
//  ОставитьЗаписьВЖурналеРегистрацииВызовов - Булево			 - Делать запись в журнале регистрации вызовов
//  Комментарий								 - Строка			 - Комментарий в журнале регистрации вызовов
// 
// Возвращаемое значение:
//   - Число - Признак обращаемости ценной бумаги
//
Функция ДанныеМетода_V2_Risk_FintoolsRiskGroupParams (
	ВхПараметры,
	Отказ,
	ТекстОтказа,
	ЛогПолученныхДанных,
	Сессия = Неопределено,
	ОставитьЗаписьВЖурналеРегистрацииВызовов = Истина,
	Комментарий = "") Экспорт
	
	СвойстваМетода = "fintoolIdList,date,params";
	
	ПараметрыURL = Новый Структура;
	ДобавитьОбщиеПараметрыURLЗапроса(ПараметрыURL, ВхПараметры, СвойстваМетода);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ПараметрыURL, ВхПараметры, СвойстваМетода);
	
	АдресСервиса = "/v2/Risk/FintoolsRiskGroupParams";
	СлужебныйВызов = Ложь;
	
	FintoolsRiskGroupParams = ПолучитьДанныеИзСервиса_V2(АдресСервиса, ПараметрыURL, Отказ, ТекстОтказа, ЛогПолученныхДанных, СлужебныйВызов, 
			Сессия, ОставитьЗаписьВЖурналеРегистрацииВызовов, Комментарий);
	
	Если Отказ Или FintoolsRiskGroupParams.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Возврат FintoolsRiskGroupParams;
	
КонецФункции

// Метод /v2/Info/Instruments. Получить данные ценной бумаги.
//
// Параметры:
//  ВхПараметры								 - Строка	 - Входные параметры метода
//  Отказ									 - Булево	 - Признак отказа
//  ТекстОтказа								 - Строка	 - Описание ошибки
//  ЛогПолученныхДанных						 - ТекстовыйДокумент - Логирование
//  Сессия									 - Структура		 - Кеш соединения
//  ОставитьЗаписьВЖурналеРегистрацииВызовов - Булево			 - Делать запись в журнале регистрации вызовов
//  Комментарий								 - Строка			 - Комментарий в журнале регистрации вызовов
// 
// Возвращаемое значение:
//   - Число - fintoolid ценной бумаги
//
Функция ДанныеМетода_V2_Info_Instruments(
	ВхПараметры,
	Отказ,
	ТекстОтказа,
	ЛогПолученныхДанных,
	Сессия = Неопределено,
	ОставитьЗаписьВЖурналеРегистрацииВызовов = Истина,
	Комментарий = "") Экспорт
	
	СвойстваМетода = "filter,fields";
	
	ПараметрыURL = Новый Структура;
	ДобавитьОбщиеПараметрыURLЗапроса(ПараметрыURL, ВхПараметры, СвойстваМетода);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ПараметрыURL, ВхПараметры, СвойстваМетода);
	
	АдресСервиса = "/v2/Info/Instruments";
	
	СлужебныйВызов = Ложь;
	
	Instruments = ПолучитьДанныеИзСервиса_V2(АдресСервиса, ПараметрыURL, Отказ, ТекстОтказа, ЛогПолученныхДанных, СлужебныйВызов, Сессия,
			ОставитьЗаписьВЖурналеРегистрацииВызовов, Комментарий);
	
	Если Отказ Или Instruments.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
		
	Возврат Instruments[0];
	
КонецФункции

#Область ЗагрузкаКотировок_МетодыAPI_Подключение

// Процедура - Подключиться к сервису
//
// Параметры:
//  Соединение		 - HTTPСоединение	 - Соединение
//  Токен			 - Строка			 - Токен
//  Отказ			 - Булево			 - Отказ
//  ТекстОтказа		 - Строка			 - Описание ошибки
//  СлужебныйВызов	 - Булево			 - Признак служебного вызова
//  Сессия			 - Структура		 - Кеш
//
Процедура ПодключитьсяКСервису(Соединение,
	Токен,
	Отказ,
	ТекстОтказа,
	СлужебныйВызов = Ложь, Сессия = Неопределено) Экспорт
	
	ТекстОтказа = "";
	Соединение = Подключить(ТекстОтказа, СлужебныйВызов, Сессия);
	Если ЗначениеЗаполнено(ТекстОтказа) Тогда
		Отказ = Истина;
	Иначе
		Токен = ПараметрыСеанса.ТокенRuDataAPI;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Выйти из сервиса
//
// Параметры:
//  Соединение		 - HTTPСоединение	 - Соединение
//  Отказ		 - Булево	 - Отказ
//  ТекстОтказа	 - Строка	 - Описание ошибки
//
Процедура ВыйтиИзСервиса(Соединение, Отказ, ТекстОтказа) Экспорт
	
	Если Соединение = Неопределено Или ТестированиеVanessa.ЭтоТест() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаголовкиЗапроса	= Новый Соответствие;
	ЗаголовкиЗапроса.Вставить("Content-Type",	 "application/json");
	ЗаголовкиЗапроса.Вставить("Authorization",	 ПараметрыСеанса.ТокенRuDataAPI);
	ЗаголовкиЗапроса.Вставить("Accept",			 "application/json");
	
	ЗапросОтключения = Новый HTTPЗапрос;
	ЗапросОтключения.АдресРесурса = "/v2/Account/Logoff";
	ЗапросОтключения.Заголовки = ЗаголовкиЗапроса;
	
	// Обрабатываем ответ
	КодУспешногоОтвета = 200;
	Ответ = Соединение.ОтправитьДляОбработки(ЗапросОтключения);
	Если Не Ответ.КодСостояния = КодУспешногоОтвета Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru='Не удалось корректно завершить выход из сервиса. Код ошибки: '") + Ответ.КодСостояния;
		ДобавитьТекстКСообщению(ТекстОтказа, ТекстСообщения);
	КонецЕсли;
	
	Соединение = Неопределено;
	ПараметрыСеанса.ТокенRuDataAPI = "";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Возвращает таблицу с подвидом облигаций
//
// Параметры:
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  Сессия			 - Строка	 - Кеш сессии HTTP
//  ВходныеПараметры - Структура - Структура входных параметров (может быть неопределено)
//    Обязательные поля:
//     * fintoolids					 - Массив	 - массив fintoolid (обязательное поле - идентификатор ЦБ в RuData),
//     * filterOnlySpecifiedCategory - Строка	 - строка фильтрации по категории, например: ""id_category in (450, 540, 541)"
//     * onlyFintoolsWithCategory	 - Булево
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с данными
Функция InfoFintoolCategoryValue(ОписаниеОшибки, Сессия = Неопределено, ВходныеПараметры = Неопределено) Экспорт
	ТаблицаCategoryValue = Неопределено;
	
	ОписаниеОшибки = "";
	НастройкиСоединения = ПараметрыИсточника();
	
	НомерПачки = 0;
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		ОграничениеПоКоличествуЦБ = 100; // Ограничения RuData по объему запрашиваемых данных
		//
		fintoolids = Новый Массив;
		//
		ПоследнийИндекс = ВходныеПараметры.fintoolids.ВГраница();
		Для Индекс = 0 По ПоследнийИндекс Цикл
			fintoolids.Добавить(ВходныеПараметры.fintoolids[Индекс]);
			Группировать = (Индекс + 1) % ОграничениеПоКоличествуЦБ;
			Если Группировать = 0 Или Индекс = ПоследнийИндекс Тогда
				НомерПачки = НомерПачки + 1;
				
				ВходящиеИдентификаторы = НовыеВходящиеИдентификаторы();
				ВходящиеИдентификаторы.fintoolids = fintoolids;
				
				ВходныеПараметрыГруппа = НовыеВходныеПараметрыГруппы(НомерПачки, Дата(1, 1, 1), ВходящиеИдентификаторы);
				ВходныеПараметрыГруппа.Вставить("filterOnlySpecifiedCategory", ВходныеПараметры.filterOnlySpecifiedCategory);
				ВходныеПараметрыГруппа.Вставить("onlyFintoolsWithCategory"	, ВходныеПараметры.onlyFintoolsWithCategory);
				
				ВременнаяТаблица = ТаблицаДанныхМетода("FintoolCategoryValue", НастройкиСоединения, ОписаниеОшибки, Сессия, ВходныеПараметрыГруппа);
				//
				fintoolids = Новый Массив;
				//
				Если ЗначениеЗаполнено(ВременнаяТаблица) Тогда
					ТаблицаCategoryValue = КонкатенацияТаблицЗначений(ТаблицаCategoryValue, ВременнаяТаблица);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаCategoryValue;
КонецФункции

// BSLLS:LatinAndCyrillicSymbolInWord-on
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СозданиеОбновлениеСправочников

Процедура СоздатьЗаписьКонтактнаяИнформация(Данные, Знач Период)
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	НаборКонтактнаяИнформация = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборКонтактнаяИнформация.Отбор.Объект.Установить(Данные.Объект, Истина);
	НаборКонтактнаяИнформация.Отбор.Тип.Установить(Данные.Тип, Истина);
	НаборКонтактнаяИнформация.Отбор.Вид.Установить(Данные.Вид, Истина);
	
	Запись = НаборКонтактнаяИнформация.Добавить();
	ЗаполнитьЗначенияСвойств(Запись, Данные);
	Запись.Период = Период;
	Если Данные.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		СтранаАдреса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Объект, "Страна");
		Если СтранаАдреса = Справочники.КлассификаторСтранМира.РОССИЯ Тогда
			ДлинаИндекса = 6;
			Запись.ЭтоРоссийскийАдрес = Истина;
			Индекс = СокрЛП(Лев(Данные.Представление, ДлинаИндекса));
			Если СтрДлина(Индекс) = ДлинаИндекса И ОбщегоНазначенияКлиентСервер.ЭтоЧисло(Индекс) Тогда
				Запись.Поле1 = Индекс;
			Иначе
				Запись.Поле1 = "";
			КонецЕсли; 
		Иначе
			Запись.ЭтоРоссийскийАдрес = Ложь;
			Запись.Поле1 = СтранаАдреса;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		НаборКонтактнаяИнформация.ОбменДанными.Загрузка = Истина;
		НаборКонтактнаяИнформация.Записать();
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("RuDataAPI.СоздатьЗаписьКонтактнаяИнформация", УровеньЖурналаРегистрации.Предупреждение, , , ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off

Процедура СоздатьОбновитьЮрлицоЭмитента(ДанныеЮрЛица, ПараметрыКИ, КредитныеОрганизации, КодыРегистрации)
	
	КодСтраныРоссия = 643;
	ГраничнаяДатаПервичнойРегистрации = Дата("20020701");
	
	Если ЗначениеЗаполнено(ДанныеЮрЛица.ЮрЛицо) Тогда
		ЮрЛицо = ДанныеЮрЛица.ЮрЛицо.ПолучитьОбъект();
		Если ЮрЛицо.Заблокирован() = Истина Тогда
			Возврат;
		Иначе
			ЮрЛицо.Заблокировать();
		КонецЕсли;
		ЭмитентСсылка = Справочники.Контрагенты.КонтрагентПоЮрФизЛицу(ЮрЛицо.Ссылка);
	Иначе
		ЮрЛицо = Справочники.ЮридическиеЛица.СоздатьЭлемент();
		ЮрЛицо.Код = "RuDataE" + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ДанныеЮрЛица.fininstid, 13);
		ЭмитентСсылка = Неопределено;
	КонецЕсли;
	
	// Наименование юр. лица
	Если ЗначениеЗаполнено(ДанныеЮрЛица.shortname_rus_nrd) Тогда
		ЮрЛицо.Наименование = ДанныеЮрЛица.shortname_rus_nrd;
	Иначе
		Если ЗначениеЗаполнено(ДанныеЮрЛица.shortname_rus) Тогда 
			ЮрЛицо.Наименование = ДанныеЮрЛица.shortname_rus;
		КонецЕсли;
	КонецЕсли;
	Если ДанныеЮрЛица.country_oksm = КодСтраныРоссия Тогда
		ЮрЛицо.НеРезидент = ЮрЛицо.МеждународнаяКомпания;
		Если ЗначениеЗаполнено(ДанныеЮрЛица.fullname_rus_nrd) Тогда
			ЮрЛицо.ПолноеНаименование = ДанныеЮрЛица.fullname_rus_nrd;
		Иначе
			Если ЗначениеЗаполнено(ДанныеЮрЛица.fullname_rus) Тогда 
				ЮрЛицо.ПолноеНаименование = ДанныеЮрЛица.fullname_rus;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ЮрЛицо.НеРезидент = Истина;
		Если ЗначениеЗаполнено(ДанныеЮрЛица.fullname_eng_nrd) Тогда
			ЮрЛицо.ПолноеНаименование = ДанныеЮрЛица.fullname_eng_nrd;
		Иначе
			Если ЗначениеЗаполнено(ДанныеЮрЛица.shortname_eng) Тогда 
				ЮрЛицо.ПолноеНаименование = ДанныеЮрЛица.shortname_eng;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеЮрЛица.fullname_eng_nrd) Тогда
		ЮрЛицо.ПолноеНаименованиеНаАнглийскомЯзыке = ДанныеЮрЛица.fullname_eng_nrd;
	Иначе
		Если ЗначениеЗаполнено(ДанныеЮрЛица.fullname_rus) Тогда 
			ЮрЛицо.ПолноеНаименованиеНаАнглийскомЯзыке = ОбщегоНазначенияКлиентСервер.Транслит(ДанныеЮрЛица.fullname_rus);
		КонецЕсли;
	КонецЕсли;
	
	// ИНН юр. лица
	Если ЗначениеЗаполнено(ДанныеЮрЛица.inn_fle) Тогда
		ЮрЛицо.ИНН = ДанныеЮрЛица.inn_fle;
	Иначе
		Если ЗначениеЗаполнено(ДанныеЮрЛица.inn) Тогда
			Если ДанныеЮрЛица.inn <> ДанныеЮрЛица.tin Тогда
				ЮрЛицо.ИНН = ДанныеЮрЛица.inn;
			Иначе
				ЮрЛицо.ИНН = "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Прочие поля юр. лица
	ЮрЛицо.TIN		  = ?(ЗначениеЗаполнено(ДанныеЮрЛица.tin), ДанныеЮрЛица.tin, ЮрЛицо.TIN);
	ЮрЛицо.КПП		  = ?(ЗначениеЗаполнено(ДанныеЮрЛица.kpp), ДанныеЮрЛица.kpp, ЮрЛицо.КПП);
	ЮрЛицо.КодПоОКПО  = ?(ЗначениеЗаполнено(ДанныеЮрЛица.okpo), ДанныеЮрЛица.okpo, ЮрЛицо.КодПоОКПО);
	ЮрЛицо.ОГРН		  = ?(ЗначениеЗаполнено(ДанныеЮрЛица.ogrn), ДанныеЮрЛица.ogrn, ЮрЛицо.ОГРН);
	
	ЮрЛицо.РегистрирующийОрган = ?(ЗначениеЗаполнено(ДанныеЮрЛица.state_reg_name), ДанныеЮрЛица.state_reg_name, ЮрЛицо.РегистрирующийОрган);
	Если Не ЗначениеЗаполнено(ЮрЛицо.РегистрирующийОрган) Тогда
		ЮрЛицо.РегистрирующийОрган = ДанныеЮрЛица.egrul_organ_name;
	КонецЕсли;
	ЮрЛицо.ОКОПФ		 = ?(ЗначениеЗаполнено(ДанныеЮрЛица.okopf), ДанныеЮрЛица.okopf, ЮрЛицо.ОКОПФ);
	ЮрЛицо.ОКОГУ		 = ?(ЗначениеЗаполнено(ДанныеЮрЛица.okogu), ДанныеЮрЛица.okogu, ЮрЛицо.ОКОГУ);
	ЮрЛицо.КодПоОКВЭД	 = ?(ЗначениеЗаполнено(ДанныеЮрЛица.okved), ДанныеЮрЛица.okved, ЮрЛицо.КодПоОКВЭД);
	Если ЗначениеЗаполнено(ДанныеЮрЛица.country_oksm) Тогда
		КодСтраныСтрокой = Строка(ДанныеЮрЛица.country_oksm);
		КодСтраныСтрокойПоФормату = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(КодСтраныСтрокой, 3);
		ЮрЛицо.Страна = Справочники.КлассификаторСтранМира.НайтиПоКоду(КодСтраныСтрокойПоФормату); // BSLLS:UsingFindElementByString-off
	КонецЕсли;
	ЮрЛицо.ДатаГосРегистрации		 = ?(ЗначениеЗаполнено(ДанныеЮрЛица.state_reg_date), ДанныеЮрЛица.state_reg_date, ЮрЛицо.ДатаГосРегистрации);
	Если Не ЗначениеЗаполнено(ЮрЛицо.ДатаГосРегистрации) Тогда
		Если ЗначениеЗаполнено(ДанныеЮрЛица.reg_date) Тогда
			ЮрЛицо.ДатаГосРегистрации = ДанныеЮрЛица.reg_date;
		Иначе
			ЮрЛицо.ДатаГосРегистрации = ДанныеЮрЛица.primary_reg_date;
		КонецЕсли;
	КонецЕсли;
	Если ДанныеЮрЛица.country_oksm = КодСтраныРоссия Тогда
		ЮрЛицоРегНомер = "";
		Если ЗначениеЗаполнено(КодыРегистрации) Тогда
			ПараметрыПоискаКодаРегистрации = Новый Структура("fininstid", ДанныеЮрЛица.fininstid);
			НайденыКодыРегистрации = КодыРегистрации.НайтиСтроки(ПараметрыПоискаКодаРегистрации);
			Если НайденыКодыРегистрации.Количество() = 1 Тогда
				ЮрЛицоРегНомер = НайденыКодыРегистрации[0].code;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЮрЛицоРегНомер) Тогда
			ЮрЛицо.РегНомер = ЮрЛицоРегНомер;
		Иначе
			НомерПервичнойРегистрации =
				?(ЗначениеЗаполнено(ДанныеЮрЛица.state_reg_number), ДанныеЮрЛица.state_reg_number, ДанныеЮрЛица.state_reg_num);
			ЕстьДатаНомерПервичнойРегистрации = ЗначениеЗаполнено(ДанныеЮрЛица.state_reg_date)
				И ДанныеЮрЛица.state_reg_date < ГраничнаяДатаПервичнойРегистрации И ЗначениеЗаполнено(НомерПервичнойРегистрации);
			Если ЕстьДатаНомерПервичнойРегистрации Тогда
				ЮрЛицо.РегНомер = НомерПервичнойРегистрации;
			Иначе
				ЮрЛицо.РегНомер = ?(ЗначениеЗаполнено(ДанныеЮрЛица.reg_code), ДанныеЮрЛица.reg_code, ЮрЛицо.РегНомер);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ЮрЛицо.РегНомер = ?(ЗначениеЗаполнено(ДанныеЮрЛица.reg_code), ДанныеЮрЛица.reg_code, ЮрЛицо.РегНомер);
	КонецЕсли;
	ЮрЛицо.ДатаВнесенияВЕГРЮЛ		 = ?(ЗначениеЗаполнено(ДанныеЮрЛица.egrul_date), ДанныеЮрЛица.egrul_date, ЮрЛицо.ДатаВнесенияВЕГРЮЛ);
	ЭтоКредитнаяОрганизация = ЗначениеЗаполнено(ДанныеЮрЛица.credit_cmp) И ДанныеЮрЛица.credit_cmp = "1"
		Или КредитныеОрганизации.Найти(ДанныеЮрЛица.fininstid) <> Неопределено;
	ЮрЛицо.КредитнаяОрганизация = ЭтоКредитнаяОрганизация;
	
	ЮрЛицо.ОбменДанными.Загрузка = Истина;
	ЮрЛицо.Записать();
	ЮрЛицоСсылка = ЮрЛицо.Ссылка;
	
	// Коды загрузки LEI юр. лица
	СоздаемКодЗагрузки = Ложь;
	Если ЗначениеЗаполнено(ДанныеЮрЛица.lei_code) Тогда
		СоздатьОбновитьКодЗагрузки(ЮрЛицоСсылка, Справочники.КлассификаторыЗагрузки.LEI_Code, ДанныеЮрЛица.lei_code, СоздаемКодЗагрузки);
	КонецЕсли;
	// Коды загрузки юр. лица
	СоздаемКодЗагрузки = Истина;
	Если ЗначениеЗаполнено(ДанныеЮрЛица.fininstid) И Не ЗначениеЗаполнено(ДанныеЮрЛица.КодЗагрузкиRuData) Тогда
		СоздатьОбновитьКодЗагрузки(ЮрЛицоСсылка, Справочники.КлассификаторыЗагрузки.RuData, ДанныеЮрЛица.fininstid, СоздаемКодЗагрузки);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеЮрЛица.issuer_nrd) И Не ЗначениеЗаполнено(ДанныеЮрЛица.КодЗагрузкиНДЦ) Тогда
		СоздатьОбновитьКодЗагрузки(ЮрЛицоСсылка, Справочники.КлассификаторыЗагрузки.НДЦ(), ДанныеЮрЛица.issuer_nrd, СоздаемКодЗагрузки);
	КонецЕсли;
	
	// Регистры сведений связанные с юр. лицом
	ЕстьЮридическийАдрес = Ложь;
	ИмяРеквизитаСтруктурыОбъект			 = "Объект";
	ИмяРеквизитаСтруктурыТип			 = "Тип";
	ИмяРеквизитаСтруктурыВид			 = "Вид";
	ИмяРеквизитаСтруктурыПредставление	 = "Представление";
	Если ЗначениеЗаполнено(ДанныеЮрЛица.post_address) Тогда
		Данные = Новый Структура;
		Данные.Вставить(ИмяРеквизитаСтруктурыОбъект			, ЮрЛицоСсылка);
		Данные.Вставить(ИмяРеквизитаСтруктурыТип			, ПараметрыКИ.ТипАдрес);
		Данные.Вставить(ИмяРеквизитаСтруктурыВид			, ПараметрыКИ.ВидФактическийАдрес);
		Данные.Вставить(ИмяРеквизитаСтруктурыПредставление	, ДанныеЮрЛица.post_address);
		СоздатьЗаписьКонтактнаяИнформация(Данные, ПараметрыКИ.Период);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеЮрЛица.legal_address) Тогда
		ЕстьЮридическийАдрес = Истина;
		Данные = Новый Структура;
		Данные.Вставить(ИмяРеквизитаСтруктурыОбъект			, ЮрЛицоСсылка);
		Данные.Вставить(ИмяРеквизитаСтруктурыТип			, ПараметрыКИ.ТипАдрес);
		Данные.Вставить(ИмяРеквизитаСтруктурыВид			, ПараметрыКИ.ВидЮридическийАдрес);
		Данные.Вставить(ИмяРеквизитаСтруктурыПредставление	, ДанныеЮрЛица.legal_address);
		СоздатьЗаписьКонтактнаяИнформация(Данные, ПараметрыКИ.Период);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеЮрЛица.e_mail) Тогда
		Данные = Новый Структура;
		Данные.Вставить(ИмяРеквизитаСтруктурыОбъект			, ЮрЛицоСсылка);
		Данные.Вставить(ИмяРеквизитаСтруктурыТип			, ПараметрыКИ.ТипАдресЭлектроннойПочты);
		Данные.Вставить(ИмяРеквизитаСтруктурыВид			, ПараметрыКИ.ВидАдресЭлектроннойПочты);
		Данные.Вставить(ИмяРеквизитаСтруктурыПредставление	, ДанныеЮрЛица.e_mail);
		СоздатьЗаписьКонтактнаяИнформация(Данные, ПараметрыКИ.Период);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеЮрЛица.phone) Тогда
		Данные = Новый Структура;
		Данные.Вставить(ИмяРеквизитаСтруктурыОбъект			, ЮрЛицоСсылка);
		Данные.Вставить(ИмяРеквизитаСтруктурыТип			, ПараметрыКИ.ТипТелефон);
		Данные.Вставить(ИмяРеквизитаСтруктурыВид			, ПараметрыКИ.ВидТелефон);
		Данные.Вставить(ИмяРеквизитаСтруктурыПредставление	, ДанныеЮрЛица.phone);
		СоздатьЗаписьКонтактнаяИнформация(Данные, ПараметрыКИ.Период);
	КонецЕсли;
	
	// Данные Эмитента
	Если ЗначениеЗаполнено(ЭмитентСсылка) Тогда
		Эмитент = ЭмитентСсылка.ПолучитьОбъект();
		Если Эмитент.Заблокирован() = Истина Тогда
			Возврат;
		Иначе
			Эмитент.Заблокировать();
		КонецЕсли;
	Иначе
		Эмитент = Справочники.Контрагенты.СоздатьЭлемент();
		Эмитент.Код = "RuDataE" + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ДанныеЮрЛица.fininstid, 13);
		Эмитент.Родитель = Справочники.Контрагенты.Эмитенты;
	КонецЕсли;
	
	Эмитент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
	Эмитент.ЮридическиеФизическиеЛица = ЮрЛицоСсылка;
	Эмитент.Контрагент = Истина;
	Эмитент.Наименование		 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрЛицоСсылка, "Наименование");
	Если ДанныеЮрЛица.country_oksm = КодСтраныРоссия Тогда
		Эмитент.ИНН 				 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрЛицоСсылка, "ИНН");
	Иначе
		Если Не ЗначениеЗаполнено(Эмитент.СекторЭкономикиИностранногоЭмитента) Тогда
			СекторЭкономикиИностранногоЭмитента
				= Справочники.КлассификаторСекторовЭкономикиДляИностранныхЭмитентов.НайтиПоКоду(ДанныеЮрЛица.sector4212u);
			Если ЗначениеЗаполнено(СекторЭкономикиИностранногоЭмитента) Тогда
				Эмитент.СекторЭкономикиИностранногоЭмитента = СекторЭкономикиИностранногоЭмитента;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Эмитент.КПП					 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрЛицоСсылка, "КПП");
	Эмитент.КодПоОКПО			 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрЛицоСсылка, "КодПоОКПО");
	Эмитент.ОКВЭД				 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрЛицоСсылка, "КодПоОКВЭД");
	Эмитент.ОГРН				 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрЛицоСсылка, "ОГРН");
	Эмитент.НаименованиеПолное	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрЛицоСсылка, "ПолноеНаименование");
	Эмитент.TIN					 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрЛицоСсылка, "TIN");
	// Важно, что реквизит Резидент в справочнике контрагентов, как это ни парадоксально, означает
	// "Нерезидент по документам", а в справочнике Юрлиц реквизит с аналогичным значением называется
	// правильно - НеРезидент. Живите теперь с этим, если не знали раньше
	Эмитент.Резидент			 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрЛицоСсылка, "НеРезидент");
	Если Эмитент.Резидент И Не Эмитент.РегионДляОтчетовРучнойВвод Тогда
		Эмитент.РегионДляОтчетов = Неопределено;
	КонецЕсли;
	
	Эмитент.ОбменДанными.Загрузка = Истина;
	Попытка
		Эмитент.Записать();
		Если ЕстьЮридическийАдрес Тогда
			Справочники.КлассификаторРегионов.УстановитьРегионДляКонтрагентов(ЮрЛицоСсылка);
		КонецЕсли;
	Исключение
		ТекстОшибки = "Эмитент [" + Эмитент.Наименование + "] :" + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("RuDataAPI.СоздатьЗаписьЭмитента", УровеньЖурналаРегистрации.Предупреждение, , , ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

// BSLLS:MethodSize-off

Функция СоздатьОбновитьЦеннуюБумагу(ДанныеЦБ, ПараметрыКИ, ТаблицаОшибок, ВыходныеПараметры)
	
	Ошибки = Новый Структура;
	
	ДатаНачалаУчета = Дата("20000101");
	
	ТаблицаСтран = ВыходныеПараметры.ТаблицаСтран;
	ТаблицаВалют = ВыходныеПараметры.ТаблицаВалют;
	
	Если ЗначениеЗаполнено(ДанныеЦБ.ЦБ) Тогда
		ЦБ = ДанныеЦБ.ЦБ.ПолучитьОбъект();
		Если ЦБ.Заблокирован() = Истина Тогда
			Ошибки.Вставить("ЦБ_Объект", "Был блокирован");
			ДобавитьУведомлениеОбОшибкахЗагрузкиЦБизRuDataAPI(ТаблицаОшибок, ЦБ.Ссылка, ДанныеЦБ.ЭтоНоваяЦБ, Ошибки);
			Возврат ЦБ.Ссылка;
		Иначе
			ЦБ.Заблокировать();
		КонецЕсли;
	Иначе
		ЦБ = Справочники.ЦенныеБумаги.СоздатьЭлемент();
		Если ЗначениеЗаполнено(ДанныеЦБ.nrdcode) Тогда
			ЦБ.Код = СокрЛП(ДанныеЦБ.nrdcode);
		Иначе
			ЦБ.Код = "RuData" + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ДанныеЦБ.fintoolid, 14);
		КонецЕсли;
	КонецЕсли;
	
	ЦБ.Дефолтная = ДанныеЦБ.status_name = "Дефолт" Или ДанныеЦБ.havedefault = 1;
	Если ЦБ.Дефолтная И Не ЗначениеЗаполнено(ЦБ.ДатаДефолта) Тогда
		Если ЗначениеЗаполнено(ДанныеЦБ.update_date) Тогда
			ЦБ.ДатаДефолта = ДанныеЦБ.update_date;
		Иначе
			ЦБ.ДатаДефолта = ПараметрыКИ.Период;
		КонецЕсли;
	КонецЕсли;
	Если Не ЦБ.Дефолтная И ЗначениеЗаполнено(ЦБ.ДатаДефолта) Тогда
		ЦБ.ДатаДефолта = Дата(1, 1, 1);
	КонецЕсли;
	
	ЭмитентRuData = ЭмитентЦБ(ДанныеЦБ.fininstid);
	Если ЗначениеЗаполнено(ЭмитентRuData) Тогда
		ЦБ.Эмитент = ЭмитентRuData;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ЦБ.Эмитент) Тогда
		Ошибки.Вставить("Эмитент", "fininstid = [" + ДанныеЦБ.fininstid + "]");
	КонецЕсли;
	
	ЦБ.ПолноеНаименование = ДанныеЦБ.ПолноеНаименование;
	ЦБ.ISIN = ДанныеЦБ.isin;
	ЦБ.CFI = ДанныеЦБ.cfi;
	
	НФИДоИзменения = ЦБ.НФИ;
	Если Не ЗначениеЗаполнено(ЦБ.CFI) И Не MarketData.ЭтоЦБRu(ЦБ.ISIN) Тогда
		ЦБ.НФИ = 1;
	Иначе
		ЦБ.НФИ = 0;
	КонецЕсли;
	СменилосьНФИ = Не ДанныеЦБ.ЭтоНоваяЦБ И НФИДоИзменения <> ЦБ.НФИ;
	
	ЦБ.ТипВыпуска = ДанныеЦБ.securitytype;
	ЦБ.ТипНоминала = ДанныеЦБ.nominaltype;
	ЦБ.ИндексируемыйНоминал = ЭтоИндексируемыйНоминал(ДанныеЦБ);
	ЦБ.АмортизационнаяЦБ = ЭтоАмортизируемыйНоминал(ДанныеЦБ);
	ЦБ.ДатаГосРег = ДанныеЦБ.regdate;
	Если Не ЗначениеЗаполнено(ЦБ.НомерРегистрации) Тогда
		ЦБ.НомерРегистрации = ДанныеЦБ.reg_code;
	КонецЕсли;
	ЦБ.ДатаПогашения = ДанныеЦБ.endmty_date;
	ЦБ.ДатаРазмещения = ДанныеЦБ.begdistdate;
	ЦБ.ДляКвалифицированныхИнвесторов = ЗначениеЗаполнено(ДанныеЦБ.isqualified_nrd);
	ЦБ.ДокументарнаяБездокументарная = СтрНайти(ДанныеЦБ.secformnamerus_nrd, "Бездокументарная") = 0;
	ЦБ.ФормаВыпуска = ?(ЦБ.ДокументарнаяБездокументарная,
		Перечисления.ФормаВыпускаЦБ.Документарная,
		Перечисления.ФормаВыпускаЦБ.Бездокументарная);
	ЦБ.ДополнительныеСведения = ДанныеЦБ.note;
	ЦБ.Дробная = СтрНайти(ДанныеЦБ.securitykind, "Дробная") > 0;
	ЦБ.Знаменатель = ДанныеЦБ.shqty;
	ЦБ.Числитель = ДанныеЦБ.drqty;
	// BSLLS:Typo-off
	ЦБ.ИменнаяНаПредьявителя = СтрНайти(ДанныеЦБ.secformnamerus_nrd, "именная") > 0;
	ЦБ.УдостоверениеПравообладания = ?(ЦБ.ИменнаяНаПредьявителя,
		Перечисления.ФормаУдостоверенияПравообладания.Именные,
		Перечисления.ФормаУдостоверенияПравообладания.НаПредъявителя);
	// BSLLS:Typo-on
	ЦБ.ОбъемРазмещения = ДанныеЦБ.summarketvol;
	ЦБ.РазрядностьНКД = ДанныеЦБ.numdecimals;
	ЦБ.СтавкаНалога = ДанныеЦБ.tax_rate;
	
	Если ЗначениеЗаполнено(ДанныеЦБ.base_asset_fintoolid) Тогда
		ЦББазовыйАктив = Справочники.ЦенныеБумаги.ЦеннаяБумагаПоКодуRuData(ДанныеЦБ.base_asset_fintoolid, ДанныеЦБ.isincodebase_nrd);
		Если ЗначениеЗаполнено(ЦББазовыйАктив) Тогда
			ЦБ.БазовыйАктив = ЦББазовыйАктив;
		КонецЕсли;
	КонецЕсли;
	Если ЦБ.Знаменатель <> 0 И ЦБ.Числитель <> 0 Тогда
		ЦБ.КоличествоБазовогоАктива = ЦБ.Числитель / ЦБ.Знаменатель;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЦБ.ТипЦБ) Или СменилосьНФИ Тогда
		Если ДанныеЦБ.fintooltype = "Акция" Тогда
			ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Акция;
		ИначеЕсли ДанныеЦБ.fintooltype = "Депозитарная расписка" Тогда
			ЦБ.ТипЦБ = Перечисления.ТипыЦБ.ДепозитарнаяРасписка;
		ИначеЕсли ДанныеЦБ.fintooltype = "Облигация" Тогда
			ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Облигация;
		ИначеЕсли ДанныеЦБ.fintooltype = "Ипотечный сертификат" Тогда
			ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Пай;
		ИначеЕсли ДанныеЦБ.fintooltype = "Фонд" Тогда
			Если СтрНайти(ДанныеЦБ.securitytype, "КСУ") > 0 Тогда
				ЦБ.ТипЦБ = Перечисления.ТипыЦБ.КлиринговыйСертификатУчастия;
			Иначе
				ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Пай;
			КонецЕсли;
		Иначе
			Ошибки.Вставить("ТипЦБ", "fintooltype = [" + ДанныеЦБ.fintooltype + "] ;securitytype = [" + ДанныеЦБ.securitytype + "]");
		КонецЕсли;
	КонецЕсли;
	
	ЦБ.ВидВыпуска = ДанныеЦБ.securitykind2;
	
	ЦБ.НазваниеРеальногоЭмитента = ДанныеЦБ.borrowername;
	ИмяРеквизитаКодСтраны = "code2_eng";
	ЦБ.СтранаРеальногоЭмитента = СтранаПоКодуИнтерфакс(ТаблицаСтран, ИмяРеквизитаКодСтраны, ДанныеЦБ.borrowercountry);
	ЦБ.СтранаНахожденияАктивовРеальногоЭмитента = СтранаПоКодуИнтерфакс(ТаблицаСтран, ИмяРеквизитаКодСтраны, ДанныеЦБ.original_country);
	ЦБ.Страна = СтранаПоКодуИнтерфакс(ТаблицаСтран, ИмяРеквизитаКодСтраны, ДанныеЦБ.country);
	ЦБ.БазисРасчетаНКД = ДанныеЦБ.basis;
	ЦБ.СтатусRuData = ДанныеЦБ.status_name;
	ЦБ.ЦБДопущенаКТоргамВРФ = ДанныеЦБ.ЦБДопущенаКТоргамВРФ;
	// BSLLS:Typo-off
	ЦБ.КвазироссийскаяЦБ = (ЦБ.СтранаРеальногоЭмитента = Справочники.КлассификаторСтранМира.РОССИЯ
								Или ЦБ.СтранаНахожденияАктивовРеальногоЭмитента = Справочники.КлассификаторСтранМира.РОССИЯ)
		И Справочники.КлассификаторСтранМира.СтранаЭмитента(ЦБ.Эмитент) <> Справочники.КлассификаторСтранМира.РОССИЯ;
	// BSLLS:Typo-on
	
	Если ЦБ.ТипЦБ = Перечисления.ТипыЦБ.ДепозитарнаяРасписка Тогда
		ЦБ.Наименование = ?(ЗначениеЗаполнено(ДанныеЦБ.fullname_rus), ДанныеЦБ.fullname_rus, ДанныеЦБ.shortname_rus);
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Пай Тогда
		Если ЗначениеЗаполнено(ДанныеЦБ.fullname_nrd) Тогда
			ЦБ.Наименование = ДанныеЦБ.fullname_nrd;
		Иначе
			ЦБ.Наименование = ?(ЗначениеЗаполнено(ДанныеЦБ.shortname_rus), ДанныеЦБ.shortname_rus, ДанныеЦБ.issuername_nrd);
		КонецЕсли;
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.КлиринговыйСертификатУчастия Тогда
		Если ЗначениеЗаполнено(ДанныеЦБ.sectypenamerus_nrd2) Тогда
			ЦБ.Наименование = ДанныеЦБ.sectypenamerus_nrd2;
		Иначе
			ЦБ.Наименование = ?(ЗначениеЗаполнено(ДанныеЦБ.shortname_rus), ДанныеЦБ.shortname_rus, ДанныеЦБ.issuername_nrd);
		КонецЕсли;
	Иначе
		ЦБ.Наименование = ?(ЗначениеЗаполнено(ДанныеЦБ.issuername_nrd), ДанныеЦБ.issuername_nrd, ДанныеЦБ.shortname_rus);
	КонецЕсли;
	ЦБ.АнглийскоеНаименование
		= ?(ЗначениеЗаполнено(ДанныеЦБ.fullname_en_nrd), ДанныеЦБ.fullname_en_nrd, ОбщегоНазначенияКлиентСервер.Транслит(ЦБ.Наименование));
	
	ВидЦББанкаРоссииRD = КодВидаЦББанкаРоссии(ДанныеЦБ);
	Если ЦБ.НФИ Тогда
		ЦБ.ВидЦББанкаРоссии = Справочники.ВидыЦББанкаРоссии.НайтиПоКоду("OTHER"); // BSLLS:UsingFindElementByString-off
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.КлиринговыйСертификатУчастия Тогда
		ЦБ.ВидЦББанкаРоссии = Справочники.ВидыЦББанкаРоссии.НайтиПоКоду("KSU"); // BSLLS:UsingFindElementByString-off
	Иначе
		ЦБ.ВидЦББанкаРоссии = Справочники.ВидыЦББанкаРоссии.НайтиПоКоду(ВидЦББанкаРоссииRD); // BSLLS:UsingFindElementByString-off
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ЦБ.ВидЦББанкаРоссии) Тогда
		Ошибки.Вставить("ВидЦББанкаРоссии", "sec_type_br_code = [" + ВидЦББанкаРоссииRD + "]");
	КонецЕсли;
	
	// BSLLS:IfElseIfEndsWithElse-off
	Если ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Акция Тогда
		ВидЦБПолучен = Истина;
		Если ДанныеЦБ.securitytype = "Обыкн-ая" Тогда // BSLLS:Typo-off
			ЦБ.ВидЦБ = Перечисления.ВидыАкций.Обыкновенная;
		ИначеЕсли ДанныеЦБ.securitytype = "Привилег-ая" Тогда // BSLLS:Typo-off
			ЦБ.ВидЦБ = Перечисления.ВидыАкций.Привилегированная;
		Иначе
			Если ДанныеЦБ.share_category_name_nrd = "обыкновенные" Тогда
				ЦБ.ВидЦБ = Перечисления.ВидыАкций.Обыкновенная;
			ИначеЕсли ДанныеЦБ.securitytype = "привилегированные" Тогда
				ЦБ.ВидЦБ = Перечисления.ВидыАкций.Привилегированная;
			Иначе
				ВидЦБПолучен = Ложь;
			КонецЕсли;
		КонецЕсли;
		Если Не ВидЦБПолучен И Не ЗначениеЗаполнено(ЦБ.ВидЦБ) Тогда
			Если СтрНайти(ДанныеЦБ.fullname_rus, "обыкн") Тогда // BSLLS:Typo-off
				ЦБ.ВидЦБ = Перечисления.ВидыАкций.Обыкновенная;
			ИначеЕсли СтрНайти(ДанныеЦБ.fullname_rus, "привилег") Тогда // BSLLS:Typo-off
				ЦБ.ВидЦБ = Перечисления.ВидыАкций.Привилегированная;
			Иначе
				Ошибки.Вставить("ВидЦБ_Акции", "securitytype = [" + ДанныеЦБ.securitytype + "]");
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Облигация Тогда
		Если ЭтоГособлигация(ВидЦББанкаРоссииRD) Тогда
			ЦБ.ВидЦБ = Перечисления.ВидыОблигаций.Государственная;
		ИначеЕсли ЭтоВидКорпоративнойОблигации(ВидЦББанкаРоссииRD) Тогда
			ЦБ.ВидЦБ = Перечисления.ВидыОблигаций.Корпоративная;
		Иначе
			ЦБ.ВидЦБ = Перечисления.ВидыОблигаций.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Пай Тогда
		ВидЦБПайRD = ?(ЗначениеЗаполнено(ДанныеЦБ.sectypenamerus_nrd3), ДанныеЦБ.sectypenamerus_nrd3, ДанныеЦБ.securitytype);
		Попытка
			ЦБ.ВидЦБ = Перечисления.ВидыПаев[ВидЦБПайRD];
		Исключение
			Если ВидЦБПайRD = "ETF" Тогда
				ЦБ.ВидЦБ = Перечисления.ВидыПаев.Биржевой;
			ИначеЕсли ВидЦБПайRD = "REIT" Тогда
				ЦБ.ВидЦБ = Перечисления.ВидыПаев.ПайАкцияИнвестиционногоФонда;
			Иначе
				Ошибки.Вставить("ВидЦБ_Паи",
				"sectypenamerus_nrd3 = [" + ДанныеЦБ.sectypenamerus_nrd3 + "] ;securitytype = [" + ДанныеЦБ.securitytype + "]");
			КонецЕсли;
		КонецПопытки;
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.ДепозитарнаяРасписка Тогда
		ВидЦБДРRD = ?(ЗначениеЗаполнено(ДанныеЦБ.securitytype), ДанныеЦБ.securitytype, ДанныеЦБ.dr_category_mn);
		Если ВидЦБДРRD = "ADR" Тогда
			ЦБ.ВидЦБ = Перечисления.ВидыДепозитарныхРасписок.АмериканскаяДепозитарнаяРасписка;
		ИначеЕсли ВидЦБДРRD = "GDR" Тогда
			ЦБ.ВидЦБ = Перечисления.ВидыДепозитарныхРасписок.ГлобальнаяДепозитарнаяРасписка;
		ИначеЕсли ВидЦБДРRD = "EDR" Тогда
			ЦБ.ВидЦБ = Перечисления.ВидыДепозитарныхРасписок.ЕвропейскаяДепозитарнаяРасписка;
		ИначеЕсли ВидЦБДРRD = "RDR" Тогда
			ЦБ.ВидЦБ = Перечисления.ВидыДепозитарныхРасписок.РоссийскаяДепозитарнаяРасписка;
		Иначе
			Ошибки.Вставить("ВидЦБ_ДР", "securitytype = [" + ВидЦБДРRD + "]");
		КонецЕсли;
	КонецЕсли;
	// BSLLS:IfElseIfEndsWithElse-on
	
	Если ЗначениеЗаполнено(ДанныеЦБ.facevalue_currency) Тогда
		
		ЦБВалютаНоминала = ПолучитьСоздатьВалюту(ДанныеЦБ.facevalue_currency, ТаблицаВалют);
		Если ЗначениеЗаполнено(ЦБВалютаНоминала) Тогда
			ЦБ.ВалютаНоминала = ЦБВалютаНоминала;
		КонецЕсли;
		
		Если ЦБ.ВалютаНоминала.Пустая() Тогда
			Ошибки.Вставить("ВалютаНоминала", "facevalue_currency = [" + ДанныеЦБ.facevalue_currency + "]");
		КонецЕсли;
	КонецЕсли;
	
	Если ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Облигация Тогда
		Если ЦБ.ВидЦБ = Перечисления.ВидыОблигаций.Государственная Тогда
			ЗаполнитьПодвидОблигаций(ЦБ, ДанныеЦБ, ВидЦББанкаРоссииRD);
		Иначе
			ЦБ.ПодвидОблигаций = Перечисления.ПодвидыОблигаций.ПустаяСсылка();
		КонецЕсли;
		
		Если MarketData.ЭтоЦБRu(ЦБ.ISIN) Тогда
			ЦБ.ПроцентКупона = ДанныеЦБ.couponrate;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеЦБ.coupons_per_year) Тогда
			ЦБ.КупоннаяОблигация = Истина;
		КонецЕсли;
		Если ЦБ.КупоннаяОблигация И ЦБ.ВалютаНоминала.Пустая() Тогда
			ЦБ.ВалютаКупона = Константы.ВалютаРегламентированногоУчета.Получить();
		Иначе
			ЦБ.ВалютаКупона = ЦБ.ВалютаНоминала;
		КонецЕсли;
		Если ДанныеЦБ.coupons_per_year = 0 Тогда
			ЦБ.ПериодПогашенияКупона = Перечисления.ВариантыНачисленияКомиссий.ПустаяСсылка();
		ИначеЕсли ДанныеЦБ.coupons_per_year = 12 Тогда // BSLLS:MagicNumber-off
			ЦБ.ПериодПогашенияКупона = Перечисления.ВариантыНачисленияКомиссий.Месяц;
		ИначеЕсли ДанныеЦБ.coupons_per_year = 1 Тогда
			ЦБ.ПериодПогашенияКупона = Перечисления.ВариантыНачисленияКомиссий.Год;
		ИначеЕсли ДанныеЦБ.coupons_per_year = 2 Тогда // BSLLS:MagicNumber-off
			ЦБ.ПериодПогашенияКупона = Перечисления.ВариантыНачисленияКомиссий.Полугодие;
		ИначеЕсли ДанныеЦБ.coupons_per_year = 3 Или ДанныеЦБ.coupons_per_year = 4 Тогда // BSLLS:MagicNumber-off
			ЦБ.ПериодПогашенияКупона = Перечисления.ВариантыНачисленияКомиссий.Квартал;
		Иначе
			ЦБ.ПериодПогашенияКупона = Перечисления.ВариантыНачисленияКомиссий.ПроизвольнаяПериодичность;
		КонецЕсли;
		ЦБ.КупоновВГод = ДанныеЦБ.coupons_per_year;
	КонецЕсли;
	
	Если ЦБ.ТипЦБ = Перечисления.ТипыЦБ.КлиринговыйСертификатУчастия Тогда
		ЦБ.Выпуск = ДанныеЦБ.sectypenamerus_nrd2;
	КонецЕсли;
	ЦБ.НаименованиеВыпуска = ?(ЗначениеЗаполнено(ДанныеЦБ.fullname_nrd), ДанныеЦБ.fullname_nrd, ДанныеЦБ.fullname_rus);
	
	Если ЦБ.НФИ Тогда
		ЦБ.Родитель = Справочники.ЦенныеБумаги.НИФИ;
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Акция Тогда
		ЦБ.Родитель = Справочники.ЦенныеБумаги.Акции;
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Пай Тогда
		ЦБ.Родитель = Справочники.ЦенныеБумаги.Паи;
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Облигация И Не ЗначениеЗаполнено(ЦБ.ВидЦБ) Тогда
		ЦБ.Родитель = Справочники.ЦенныеБумаги.Облигации;
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Облигация И ЦБ.ВидЦБ = Перечисления.ВидыОблигаций.Государственная
			И Не ЗначениеЗаполнено(ЦБ.ПодвидОблигаций) Тогда
		ЦБ.Родитель = Справочники.ЦенныеБумаги.Государственные;
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Облигация И ЦБ.ВидЦБ = Перечисления.ВидыОблигаций.Государственная
			И ЦБ.ПодвидОблигаций = Перечисления.ПодвидыОблигаций.Муниципальная Тогда
		ЦБ.Родитель = Справочники.ЦенныеБумаги.Муниципальные;
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Облигация И ЦБ.ВидЦБ = Перечисления.ВидыОблигаций.Государственная
			И ЦБ.ПодвидОблигаций = Перечисления.ПодвидыОблигаций.РФ Тогда
		ЦБ.Родитель = Справочники.ЦенныеБумаги.РФ;
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Облигация И ЦБ.ВидЦБ = Перечисления.ВидыОблигаций.Государственная
			И ЦБ.ПодвидОблигаций = Перечисления.ПодвидыОблигаций.СубъектовРФ Тогда
		ЦБ.Родитель = Справочники.ЦенныеБумаги.СубъектовРФ;
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Облигация И ЦБ.ВидЦБ = Перечисления.ВидыОблигаций.Корпоративная Тогда
		ЦБ.Родитель = Справочники.ЦенныеБумаги.Корпоративные;
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.КлиринговыйСертификатУчастия Тогда
		ЦБ.Родитель = Справочники.ЦенныеБумаги.КСУ;
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.ДепозитарнаяРасписка Тогда
		ЦБ.Родитель = Справочники.ЦенныеБумаги.ДепозитарныеРасписки;
	Иначе
		ЦБ.Родитель = Справочники.ЦенныеБумаги.Прочее;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЦБ.СтранаНалогообложения) Тогда
		ЦБ.СтранаНалогообложения = СтранаПоКодуИнтерфакс(ТаблицаСтран, "shortname_rus", ДанныеЦБ.tax_country_name);
		Если Не ЗначениеЗаполнено(ЦБ.СтранаНалогообложения) Тогда
			ЦБ.СтранаНалогообложения = СтранаПоКодуИнтерфакс(ТаблицаСтран, "fullname_eng", ДанныеЦБ.tax_country_name_en);
		КонецЕсли;
	КонецЕсли;
	Если ЦБ.МестаХранения.Количество() = 0 И ЗначениеЗаполнено(ДанныеЦБ.depositary_nrd) Тогда
		МестоХранения = МестоХраненияЦБ(ДанныеЦБ.depositary_nrd);
		Если ЗначениеЗаполнено(МестоХранения) Тогда
			НовоеМестоХранения = ЦБ.МестаХранения.Добавить();
			НовоеМестоХранения.МестоХранения = МестоХранения;
			НовоеМестоХранения.КодХранения = ДанныеЦБ.nrdcode;
			НовоеМестоХранения.ОсновноеМестоХранения = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЦБ.ОбменДанными.Загрузка = Истина;
	ЦБ.Записать();
	ЦБСсылка = ЦБ.Ссылка;
	
	ЦБСсылкаТипЦБ				 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦБСсылка, "ТипЦБ");
	ЦБСсылкаISIN				 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦБСсылка, "ISIN");
	ЦБСсылкаЗаморожена			 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦБСсылка, "Заморожена");
	ЦБСсылкаРодитель			 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦБСсылка, "Родитель");
	ЦБСсылкаДатаГосРег			 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦБСсылка, "ДатаГосРег");
	ЦБСсылкаДатаРазмещения		 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦБСсылка, "ДатаРазмещения");
	ЦБСсылкаАмортизационнаяЦБ	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦБСсылка, "АмортизационнаяЦБ");
	ЦБСсылкаИндексируемыйНоминал = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦБСсылка, "ИндексируемыйНоминал");
	
	СоздаемКодЗагрузки = Истина;
	Если ЗначениеЗаполнено(ДанныеЦБ.fintoolid) И Не ЗначениеЗаполнено(ДанныеЦБ.КодЗагрузкиRuData) Тогда
		СоздатьОбновитьКодЗагрузки(ЦБСсылка, Справочники.КлассификаторыЗагрузки.RuData, ДанныеЦБ.fintoolid, СоздаемКодЗагрузки);
	КонецЕсли;
	// --> Закрыть старый код загрузки НРД
	НеобходимоЗакрытьСтарыйКодЗагрузкиНРД = ЗначениеЗаполнено(ДанныеЦБ.nrdcode) И ЗначениеЗаполнено(ДанныеЦБ.nrd_date_from);
	Если НеобходимоЗакрытьСтарыйКодЗагрузкиНРД Тогда
		ПрекратитьДействиеПрочихКодовЗагрузки(ЦБСсылка,
			Справочники.КлассификаторыЗагрузки.НДЦ(), ДанныеЦБ.nrdcode, ДанныеЦБ.nrd_date_from - 1);
	КонецЕсли;
	// <-- 
	Если ЗначениеЗаполнено(ДанныеЦБ.nrdcode) И Не ЗначениеЗаполнено(ДанныеЦБ.КодЗагрузкиНДЦ) Тогда
		УчестьДатуДействияКодаЗагрузки = Истина;
		СоздатьОбновитьКодЗагрузки(ЦБСсылка, Справочники.КлассификаторыЗагрузки.НДЦ(), ДанныеЦБ.nrdcode, СоздаемКодЗагрузки,
			ДанныеЦБ.nrd_date_from, ДанныеЦБ.nrd_date_to, УчестьДатуДействияКодаЗагрузки);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеЦБ.moex_code) И Не ЗначениеЗаполнено(ДанныеЦБ.КодЗагрузкиMICEX) Тогда
		СоздатьОбновитьКодЗагрузки(ЦБСсылка, Справочники.Биржи.MICEX, ДанныеЦБ.moex_code, СоздаемКодЗагрузки);
	КонецЕсли;
	
	// Регистры сведений связанные с ЦБ
	Если ЗначениеЗаполнено(ДанныеЦБ.facevalue) Тогда
		
		ПериодНоминалаЭтоДатаНачалаДействияКодаНРД = Не ДанныеЦБ.ЭтоНоваяЦБ И Не ЦБСсылкаАмортизационнаяЦБ И Не ЦБСсылкаИндексируемыйНоминал
			И ЗначениеЗаполнено(ДанныеЦБ.nrdcode) И ЗначениеЗаполнено(ДанныеЦБ.nrd_date_from);
		
		Если ЦБСсылкаАмортизационнаяЦБ Тогда
			НаборЗаписейНоминала = РегистрыСведений.НоминалЦБ.СоздатьНаборЗаписей();
			НаборЗаписейНоминала.Отбор.ЦеннаяБумага.Установить(ЦБСсылка);
			НаборЗаписейНоминала.Записать();
		КонецЕсли;
		
		МенеджерНоминала = РегистрыСведений.НоминалЦБ.СоздатьМенеджерЗаписи();
		Если ПериодНоминалаЭтоДатаНачалаДействияКодаНРД Тогда
			ПериодНоминала = ДанныеЦБ.nrd_date_from;
		ИначеЕсли ЗначениеЗаполнено(ЦБСсылкаДатаГосРег) Тогда
			ПериодНоминала = ЦБСсылкаДатаГосРег;
		ИначеЕсли ЗначениеЗаполнено(ЦБСсылкаДатаРазмещения) Тогда
			ПериодНоминала = ЦБСсылкаДатаРазмещения;
		Иначе
			ПериодНоминала = ДатаНачалаУчета;
		КонецЕсли;
		МенеджерНоминала.Период = ПериодНоминала;
		МенеджерНоминала.ЦеннаяБумага = ЦБСсылка;
		МенеджерНоминала.Сумма = ДанныеЦБ.facevalue;
		МенеджерНоминала.Записать();
		
		Если Не ЗначениеЗаполнено(ЦБСсылкаДатаГосРег) Тогда
			ОтборЗаписи = Новый Структура;
			ОтборЗаписи.Вставить("ЦеннаяБумага", ЦБСсылка);
			НоминалНаНачало = РегистрыСведений.НоминалЦБ.ПолучитьПоследнее(ДатаНачалаУчета, ОтборЗаписи);
			Если Не ЗначениеЗаполнено(НоминалНаНачало.Сумма) Тогда
				МенеджерНоминала = РегистрыСведений.НоминалЦБ.СоздатьМенеджерЗаписи();
				МенеджерНоминала.Период = ДатаНачалаУчета;
				МенеджерНоминала.ЦеннаяБумага = ЦБСсылка;
				МенеджерНоминала.Сумма = ДанныеЦБ.facevalue;
				МенеджерНоминала.Записать();
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ЦБСсылкаТипЦБ = Перечисления.ТипыЦБ.Облигация Тогда
			Ошибки.Вставить("Номинал", "facevalue = [" + ДанныеЦБ.facevalue + "]");
		КонецЕсли;
	КонецЕсли;
	
	УровеньЛистинга = ДанныеЦБ.micexlist_nrd;
	Если ЦБСсылкаТипЦБ = Перечисления.ТипыЦБ.Пай Или ЦБСсылкаТипЦБ = Перечисления.ТипыЦБ.ДепозитарнаяРасписка Тогда
		КатегорияЛистинга = Справочники.КатегорииЦБ.А05370;
	ИначеЕсли ЦБСсылкаТипЦБ = Перечисления.ТипыЦБ.Акция Или ЦБСсылкаТипЦБ = Перечисления.ТипыЦБ.КлиринговыйСертификатУчастия Тогда
		Если ЗначениеЗаполнено(ЦБСсылкаISIN) И Не MarketData.ЭтоЦБRu(ЦБСсылкаISIN) Тогда
			КатегорияЛистинга = Справочники.КатегорииЦБ.А05370;
		ИначеЕсли ЦБСсылкаЗаморожена Или Не ЗначениеЗаполнено(УровеньЛистинга) Тогда
			КатегорияЛистинга = Справочники.КатегорииЦБ.ПустаяСсылка();
		ИначеЕсли УровеньЛистинга = "Первый уровень листинга" Тогда
			КатегорияЛистинга = Справочники.КатегорииЦБ.А05390;
		ИначеЕсли УровеньЛистинга = "Второй уровень листинга"
			Или УровеньЛистинга = "Третий уровень листинга" Тогда
			КатегорияЛистинга = Справочники.КатегорииЦБ.А05330;
		Иначе
			КатегорияЛистинга = Неопределено;
		КонецЕсли;
	ИначеЕсли ЦБСсылкаТипЦБ = Перечисления.ТипыЦБ.Облигация Тогда
		Если ЗначениеЗаполнено(ЦБСсылкаISIN) И Не MarketData.ЭтоЦБRu(ЦБСсылкаISIN) Тогда
			КатегорияЛистинга = Справочники.КатегорииЦБ.А05370;
		ИначеЕсли ЦБСсылкаЗаморожена Тогда
			КатегорияЛистинга = Справочники.КатегорииЦБ.ПустаяСсылка(); // BSLLS:IfElseDuplicatedCodeBlock-off
		ИначеЕсли ЦБСсылкаРодитель = Справочники.ЦенныеБумаги.РФ Тогда
			КатегорияЛистинга = Справочники.КатегорииЦБ.А05310;
		ИначеЕсли ЦБСсылкаРодитель = Справочники.ЦенныеБумаги.СубъектовРФ Тогда
			КатегорияЛистинга = Справочники.КатегорииЦБ.А05320;
		ИначеЕсли Не ЗначениеЗаполнено(УровеньЛистинга) Тогда
			КатегорияЛистинга = Справочники.КатегорииЦБ.ПустаяСсылка(); // BSLLS:IfElseDuplicatedCodeBlock-off
		ИначеЕсли УровеньЛистинга = "Первый уровень листинга" Тогда
			КатегорияЛистинга = Справочники.КатегорииЦБ.А05380;
		ИначеЕсли УровеньЛистинга = "Второй уровень листинга"
			Или УровеньЛистинга = "Третий уровень листинга" Тогда
			КатегорияЛистинга = Справочники.КатегорииЦБ.А05350;
		Иначе
			КатегорияЛистинга = Неопределено;
		КонецЕсли;
	Иначе
		КатегорияЛистинга = Неопределено;
	КонецЕсли;
	Если ЗначениеЗаполнено(КатегорияЛистинга) Тогда
		МенеджерКатегорияЦБ = РегистрыСведений.КатегорияЦБ.СоздатьМенеджерЗаписи();
		Если ЗначениеЗаполнено(ЦБСсылкаДатаГосРег) Тогда
			МенеджерКатегорияЦБ.Период = ЦБСсылкаДатаГосРег;
		ИначеЕсли ЗначениеЗаполнено(ДанныеЦБ.update_date) Тогда
			МенеджерКатегорияЦБ.Период = ДанныеЦБ.update_date;
		Иначе
			МенеджерКатегорияЦБ.Период = ПараметрыКИ.Период;
		КонецЕсли;
		МенеджерКатегорияЦБ.ЦеннаяБумага = ЦБСсылка;
		МенеджерКатегорияЦБ.Категория = КатегорияЛистинга;
		МенеджерКатегорияЦБ.Записать();
		
		Если Не ЗначениеЗаполнено(ЦБСсылкаДатаГосРег) Тогда
			ОтборЗаписи = Новый Структура;
			ОтборЗаписи.Вставить("ЦеннаяБумага", ЦБСсылка);
			КатегорияЦБНаНачало = РегистрыСведений.КатегорияЦБ.ПолучитьПоследнее(ДатаНачалаУчета, ОтборЗаписи);
			Если Не ЗначениеЗаполнено(КатегорияЦБНаНачало.Категория) Тогда
				МенеджерКатегорияЦБ = РегистрыСведений.КатегорияЦБ.СоздатьМенеджерЗаписи();
				МенеджерКатегорияЦБ.Период = ДатаНачалаУчета;
				МенеджерКатегорияЦБ.ЦеннаяБумага = ЦБСсылка;
				МенеджерКатегорияЦБ.Категория = КатегорияЛистинга;
				МенеджерКатегорияЦБ.Записать();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ДобавитьУведомлениеОбОшибкахЗагрузкиЦБизRuDataAPI(ТаблицаОшибок, ЦБСсылка, ДанныеЦБ.ЭтоНоваяЦБ, Ошибки);
	
	Возврат ЦБСсылка;
	
КонецФункции

// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on
// BSLLS:MethodSize-on

Функция ЭтоАмортизируемыйНоминал(ДанныеЦБ)
	
	Если ЗначениеЗаполнено(ДанныеЦБ.amortisedmty) Тогда
		ЭтоАмортизируемыйНоминал = Истина;
	ИначеЕсли ЗначениеЗаполнено(ДанныеЦБ.nominaltype) Тогда
		ТипыНоминалаАмортизируемые
			= ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("101.RuData_ТипыНоминалаАмортизируемые", "'Неопределено'");
		ЭтоАмортизируемыйНоминал = СтрНайти(ТипыНоминалаАмортизируемые, ДанныеЦБ.nominaltype) > 0;
	Иначе
		ЭтоАмортизируемыйНоминал = Ложь;
	КонецЕсли;
	
	Возврат ЭтоАмортизируемыйНоминал;
	
КонецФункции

Функция ЭтоИндексируемыйНоминал(ДанныеЦБ)
	
	Если ЗначениеЗаполнено(ДанныеЦБ.nominaltype) Тогда
		ТипыНоминалаИндексируемые
			= ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("101.RuData_ТипыНоминалаИндексируемые", "'Неопределено'");
		ЭтоИндексируемыйНоминал = СтрНайти(ТипыНоминалаИндексируемые, ДанныеЦБ.nominaltype) > 0;
	Иначе
		ЭтоИндексируемыйНоминал = Ложь;
	КонецЕсли;
	
	Возврат ЭтоИндексируемыйНоминал;
	
КонецФункции

Функция ПолучитьСоздатьВалюту(facevalue_currency, ТаблицаВалют)
	
	ЦБВалютаНоминала = Справочники.Валюты.НайтиПоНаименованию(facevalue_currency, Истина); // BSLLS:UsingFindElementByString-off
	Если Не ЗначениеЗаполнено(ЦБВалютаНоминала) И facevalue_currency = "RUB" Тогда
		ЦБВалютаНоминала = Справочники.Валюты.НайтиПоНаименованию("SUR", Истина); // BSLLS:UsingFindElementByString-off
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ЦБВалютаНоминала) И facevalue_currency = "CNH" Тогда
		ЦБВалютаНоминала = Справочники.Валюты.НайтиПоНаименованию("CNY", Истина); // BSLLS:UsingFindElementByString-off
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЦБВалютаНоминала) Тогда
		ПараметрыПоискаВалюты = Новый Структура("code", facevalue_currency);
		НайденыВалюты = ТаблицаВалют.НайтиСтроки(ПараметрыПоискаВалюты);
		Если НайденыВалюты.Количество() > 0 Тогда
			ЦБВалютаНоминала = СоздатьВалюту(НайденыВалюты[0]);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЦБВалютаНоминала;
	
КонецФункции

Функция СоздатьВалюту(ПараметрыСоздания)
	
	Валюта = Справочники.Валюты.СоздатьЭлемент();
	Валюта.Код					= СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Строка(ПараметрыСоздания.iso_number), 3);
	Валюта.Наименование			= СокрЛП(ПараметрыСоздания.Code);
	Валюта.НаименованиеПолное	= СокрЛП(ПараметрыСоздания.full_name_rus);
	Валюта.НаименованиеДляОтчетов = Валюта.Наименование;
	Валюта.Записать();
	ОбщегоНазначения.ПроверитьКорректностьКурсаНа01_01_1980(Валюта.Ссылка);
	
	Возврат Валюта.Ссылка;
	
КонецФункции

Функция ЭтоВидКорпоративнойОблигации(КодВидаКорпоративнойОблигации)
	
	Возврат КодВидаКорпоративнойОблигации = "BON3"
		Или КодВидаКорпоративнойОблигации = "BON4"
		Или КодВидаКорпоративнойОблигации = "BON5"
		Или КодВидаКорпоративнойОблигации = "BON6"
		Или КодВидаКорпоративнойОблигации = "BON7";
	
КонецФункции

Функция ЭмитентЦБ(КодЗагрузки)
	
	Если Не ЗначениеЗаполнено(КодЗагрузки) Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫРАЗИТЬ(КодыЗагрузки.Владелец КАК Справочник.ЮридическиеЛица).Ссылка КАК ЮрЛицо
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	ВЫРАЗИТЬ(КодыЗагрузки.Биржа КАК Справочник.КлассификаторыЗагрузки).Ссылка = &RuData
	|	И КодыЗагрузки.Код = &Код
	|	И КодыЗагрузки.Владелец ССЫЛКА Справочник.ЮридическиеЛица
	|	И НЕ КодыЗагрузки.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("RuData",	 Справочники.КлассификаторыЗагрузки.RuData);
	Запрос.УстановитьПараметр("Код",	 СокрЛП(КодЗагрузки));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЮрЛицо = Выборка.ЮрЛицо;
	Иначе
		ЮрЛицо = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЮрЛицо) Тогда
		Возврат Справочники.Контрагенты.КонтрагентПоЮрФизЛицу(ЮрЛицо);
	Иначе
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция МестоХраненияЦБ(КодЗагрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫРАЗИТЬ(КодыЗагрузки.Владелец КАК Справочник.ЮридическиеЛица).Ссылка КАК ЮрЛицо
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	ВЫРАЗИТЬ(КодыЗагрузки.Биржа КАК Справочник.КлассификаторыЗагрузки).Ссылка = &НДЦ
	|	И КодыЗагрузки.Код = &Код
	|	И КодыЗагрузки.Владелец ССЫЛКА Справочник.ЮридическиеЛица
	|	И НЕ КодыЗагрузки.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НДЦ",	 Справочники.КлассификаторыЗагрузки.НДЦ());
	Запрос.УстановитьПараметр("Код",	 СокрЛП(КодЗагрузки));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЮрЛицо;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ЭмитентыКредитныеОрганизации()
	
	ОписаниеОшибки = "";
	Сессия = Неопределено;
	СквозныеПараметры = Новый Структура;
	СквозныеПараметры.Вставить("ДатаВремяОбновленияДанных", ТекущаяДатаСеанса());
	СквозныеПараметры.Вставить("filter", "id_category = 757");
	ТаблицаКредитныхОрганизаций = RuDataAPI.InfoEmitentCategoryValue(ОписаниеОшибки, Сессия, СквозныеПараметры);
	Если ОписаниеОшибки = "" И ЗначениеЗаполнено(ТаблицаКредитныхОрганизаций) Тогда
		КредитныеОрганизации = ТаблицаКредитныхОрганизаций.ВыгрузитьКолонку("Fininstid");
	Иначе
		КредитныеОрганизации = Новый Массив;
	КонецЕсли;
	
	Возврат КредитныеОрганизации;
	
КонецФункции

Функция ЭмитентыКодыРегистрации()
	
	ОписаниеОшибки = "";
	Сессия = Неопределено;
	СквозныеПараметры = Новый Структура;
	СквозныеПараметры.Вставить("ДатаВремяОбновленияДанных", ТекущаяДатаСеанса());
	СквозныеПараметры.Вставить("filter", "id_code = 1");
	КодыРегистрации = RuDataAPI.InfoEmitentClassification(ОписаниеОшибки, Сессия, СквозныеПараметры);
	Если ОписаниеОшибки <> "" Или Не ЗначениеЗаполнено(КодыРегистрации) Тогда
		КодыРегистрации = Новый ТаблицаЗначений;
	КонецЕсли;
	
	Возврат КодыРегистрации;
	
КонецФункции

Функция ЦБДопущенныеКТоргамВРФ(ТаблицаInfoSecurities)
	ОписаниеОшибки = "";
	Сессия = Неопределено;
	
	ТекстФильтра = "id_code in (23, 37) and (up_to_date is null or up_to_date > 'текущая дата')";
	ТекстФильтра = СтрЗаменить(ТекстФильтра, "текущая дата", Формат(ТекущаяДатаСеанса(), "ДФ=dd-MM-yyyy") );
	fintoolids = ТаблицаInfoSecurities.ВыгрузитьКолонку("fintoolid");
	
	СквозныеПараметры = Новый Структура;
	СквозныеПараметры.Вставить("filter", ТекстФильтра);
	СквозныеПараметры.Вставить("fintoolids", fintoolids);
	
	// На самом деле ДатаВремяОбновленияДанных в InfoFintoolClassification не используется, там нет возможности фильтровать
	// по времени изменений, но этот параметр нужен для работы ряда используемых универсальных процедур "по дороге вниз".
	СквозныеПараметры.Вставить("ДатаВремяОбновленияДанных", ДАТА(1, 1, 1));
	
	КлассификацияЦБ = InfoFintoolClassification(ОписаниеОшибки, Сессия, СквозныеПараметры);
	
	ДопущенныеКТоргамЦБ = Новый ТаблицаЗначений;
	ДопущенныеКТоргамЦБ.Колонки.Добавить("fintoolid", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	Если ОписаниеОшибки = "" И ЗначениеЗаполнено(КлассификацияЦБ) Тогда
		Для каждого ТекСтрока Из КлассификацияЦБ Цикл
			НовСтрока = ДопущенныеКТоргамЦБ.Добавить();
			НовСтрока.fintoolid = ТекСтрока.fintoolid;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДопущенныеКТоргамЦБ;
КонецФункции

Функция ИндексируемыеНоминалыЦенныхБумаг()
	
	ОписаниеОшибки = "";
	Сессия = Неопределено;
	СквозныеПараметры = Новый Структура;
	СквозныеПараметры.Вставить("ДатаВремяОбновленияДанных", Дата(1, 1, 1));
	ТипыНоминалаИндексируемые = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("101.RuData_ТипыНоминалаИндексируемые", "'Неопределено'");
	СквозныеПараметры.Вставить("filter", "nominaltype in (" + ТипыНоминалаИндексируемые + ") and currentfacevalue_nrd is not null");
	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("fintoolid");
	ИменаРеквизитов.Добавить("facevalue");
	ИменаРеквизитов.Добавить("currentfacevalue_nrd");
	СквозныеПараметры.Вставить("fields", ИменаРеквизитов);
	ИндексируемыеНоминалы = RuDataAPI.InfoFintoolReferenceData_nominaltype(ОписаниеОшибки, Сессия, СквозныеПараметры);
	Если ОписаниеОшибки <> "" Или Не ЗначениеЗаполнено(ИндексируемыеНоминалы) Тогда
		ИндексируемыеНоминалы = Новый ТаблицаЗначений;
	КонецЕсли;
	
	Возврат ИндексируемыеНоминалы;
	
КонецФункции

Функция СтранаПоКодуИнтерфакс(ТаблицаСтран, ИмяРеквизитаКодСтраны, ЗначениеКодаСтраны)
	
	Страна = Справочники.КлассификаторСтранМира.ПустаяСсылка();
	Если ЗначениеЗаполнено(ТаблицаСтран) И ЗначениеЗаполнено(ЗначениеКодаСтраны) Тогда
		ПараметрыОтбораСтран = Новый Структура(ИмяРеквизитаКодСтраны, ЗначениеКодаСтраны);
		НайденыСтраны = ТаблицаСтран.НайтиСтроки(ПараметрыОтбораСтран);
		Если НайденыСтраны.Количество() > 0 Тогда
			НайденаСтрана = НайденыСтраны[0];
			Если ЗначениеЗаполнено(НайденаСтрана.Страна1С) Тогда
				Страна = НайденаСтрана.Страна1С;
			Иначе
				КодСтраны1С = НайденаСтрана.code_rus;
				КодСтраныСтрокой = Строка(КодСтраны1С);
				КодСтраныСтрокойПоФормату = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(КодСтраныСтрокой, 3);
				Страна = Справочники.КлассификаторСтранМира.НайтиПоКоду(КодСтраныСтрокойПоФормату); // BSLLS:UsingFindElementByString-off
				НайденаСтрана.Страна1С = Страна;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Страна;
	
КонецФункции

Функция ЭтоГособлигация(КодВидаЦББанкаРоссии)
	Возврат КодВидаЦББанкаРоссии = "BON1" Или КодВидаЦББанкаРоссии = "BON2";
КонецФункции

Процедура ЗаполнитьПодвидОблигаций(ЦБ, ДанныеЦБ, ВидЦББанкаРоссииRD)
	Если ЗначениеЗаполнено(ДанныеЦБ.ПодвидОблигации) Тогда
		ЦБ.ПодвидОблигаций = ДанныеЦБ.ПодвидОблигации;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ЦБ.ПодвидОблигаций) Тогда
		Если СтрНайти(ДанныеЦБ.securitytype, "Муни") > 0 Тогда // BSLLS:Typo-off
			ЦБ.ПодвидОблигаций = Перечисления.ПодвидыОблигаций.Муниципальная;
		ИначеЕсли ВидЦББанкаРоссииRD = "BON1" Тогда
			ЦБ.ПодвидОблигаций = Перечисления.ПодвидыОблигаций.РФ;
		ИначеЕсли ВидЦББанкаРоссииRD = "BON2" Тогда
			ЦБ.ПодвидОблигаций = Перечисления.ПодвидыОблигаций.СубъектовРФ;
		Иначе
			ЦБ.ПодвидОблигаций = Перечисления.ПодвидыОблигаций.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

Функция НеобходимоОтправитьПисьмоОРезультатахЗагрузкиСтатики(ВходныеПараметры, КоличествоОшибок)
	
	ОтсутствуютISIN = Не ВходныеПараметры.Свойство("ISINs") Или ВходныеПараметры.Свойство("ISINs") И ВходныеПараметры.ISINs.Количество() = 0;
	
	ПричинаОтправки_НаличиеISIN = Не ОтсутствуютISIN;
	ПричинаОтправки_ЕжедневноеОбновление = ОтсутствуютISIN
		И ЗначениеЗаполнено(ВходныеПараметры.ДатаВремяОбновленияДанных) И КоличествоОшибок > 0;
	
	НеобходимоОтправитьПисьмо = ПричинаОтправки_НаличиеISIN Или ПричинаОтправки_ЕжедневноеОбновление;
	
	Возврат НеобходимоОтправитьПисьмо;
	
КонецФункции

Процедура ЗаполнитьКупоныЦенныхБумаг(ТаблицаBondTimeTableCPN, КупонныеОблигации)
	
	Для Каждого КупоннаяОблигация Из КупонныеОблигации Цикл
		ПараметрыПоиска = Новый Структура("fintoolid", КупоннаяОблигация.fintoolid);
		КупонныеПараметры = ТаблицаBondTimeTableCPN.НайтиСтроки(ПараметрыПоиска);
		Если КупонныеПараметры.Количество() > 0 Тогда
			ЦеннаяБумага = КупоннаяОблигация.ЦеннаяБумага.ПолучитьОбъект();
			ЦеннаяБумага.Купоны.Очистить();
			Для Каждого КупонныйПараметр Из КупонныеПараметры Цикл
				НовыйКупон = ЦеннаяБумага.Купоны.Добавить();
				НовыйКупон.НомерКупона			 = КупонныйПараметр.eventID;
				НовыйКупон.Комментарий			 = КупонныйПараметр.note;
				НовыйКупон.Сумма				 = КупонныйПараметр.pay1Bond_frac;
				НовыйКупон.Купон				 = КупонныйПараметр.couponRate;
				НовыйКупон.Ставка				 = КупонныйПараметр.value;
				НовыйКупон.ДатаВыпуска			 = ОбщегоНазначенияКлиентСервер.ПолучитьДатуИзJSON(КупонныйПараметр.beginPeriod, Ложь);
				НовыйКупон.ДатаПогашения		 = ОбщегоНазначенияКлиентСервер.ПолучитьДатуИзJSON(КупонныйПараметр.endPeriod, Ложь);
				НовыйКупон.СрокОбращения		 = ДеньГода(КонецГода(НовыйКупон.ДатаПогашения));
				НовыйКупон.ДатаФиксацииСписка	 = ОбщегоНазначенияКлиентСервер.ПолучитьДатуИзJSON(КупонныйПараметр.fixdate, Ложь);
			КонецЦикла;
			ЦеннаяБумага.ОбменДанными.Загрузка = Истина;
			ЦеннаяБумага.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОпределитьЦенныеБумагиДляДополнительныхЗапросов(ПараметрыОпределения, FintoolidAmortisedmty, КупонныеОблигации)
	
	ЦеннаяБумага = ПараметрыОпределения.ЦеннаяБумага;
	ДанныеЦБ	 = ПараметрыОпределения.ДанныеЦБ;
	
	Если ЗначениеЗаполнено(ДанныеЦБ.isin) Тогда
		АмортизационнаяЦБ = ЭтоАмортизируемыйНоминал(ДанныеЦБ);
		Если АмортизационнаяЦБ И ЗначениеЗаполнено(ДанныеЦБ.fintoolid) Тогда
			ПараметрыАмортизацииЦБ = Новый Структура("isin, fintoolid, ЦеннаяБумага");
			ЗаполнитьЗначенияСвойств(ПараметрыАмортизацииЦБ, ДанныеЦБ);
			ПараметрыАмортизацииЦБ.ЦеннаяБумага = ЦеннаяБумага;
			FintoolidAmortisedmty.Добавить(ПараметрыАмортизацииЦБ);
		КонецЕсли;
		
		Если ЦеннаяБумага.КупоннаяОблигация Тогда
			НоваяКупоннаяОблигация = КупонныеОблигации.Добавить();
			НоваяКупоннаяОблигация.fintoolid	 = ДанныеЦБ.fintoolid;
			НоваяКупоннаяОблигация.isin			 = ДанныеЦБ.isin;
			НоваяКупоннаяОблигация.ЦеннаяБумага	 = ЦеннаяБумага;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ЧисловыеРеквизитыТаблицRuDataAPI()
	ЧисловыеРеквизиты = Новый СписокЗначений();
	
	// Основная таблица Securities
	ЧисловыеРеквизиты.Добавить("id_fintool");
	ЧисловыеРеквизиты.Добавить("on_quatro");
	ЧисловыеРеквизиты.Добавить("facevalue");
	ЧисловыеРеквизиты.Добавить("issue_vol");
	ЧисловыеРеквизиты.Добавить("fininstid");
	ЧисловыеРеквизиты.Добавить("coupons_per_year");
	ЧисловыеРеквизиты.Добавить("borroweruid");
	ЧисловыеРеквизиты.Добавить("id_iss");
	ЧисловыеРеквизиты.Добавить("listing_level");
	ЧисловыеРеквизиты.Добавить("counter");
	
	// Прочие таблицы FintoolReferenceData
	ЧисловыеРеквизиты.Добавить("amortisedmty");
	ЧисловыеРеквизиты.Добавить("summarketvol");
	ЧисловыеРеквизиты.Добавить("couponrate");
	ЧисловыеРеквизиты.Добавить("numdecimals");
	ЧисловыеРеквизиты.Добавить("havedefault");
	ЧисловыеРеквизиты.Добавить("numcoupons");
	ЧисловыеРеквизиты.Добавить("couponperiod");
	ЧисловыеРеквизиты.Добавить("listing_level_spb");
	ЧисловыеРеквизиты.Добавить("issueruid");
	ЧисловыеРеквизиты.Добавить("summarketval");
	ЧисловыеРеквизиты.Добавить("couponperyear");
	ЧисловыеРеквизиты.Добавить("haveoffer");
	ЧисловыеРеквизиты.Добавить("isqualified_nrd");
	ЧисловыеРеквизиты.Добавить("available_for_unqualified");
	ЧисловыеРеквизиты.Добавить("progfintoolid");
	ЧисловыеРеквизиты.Добавить("isconvertible");
	ЧисловыеРеквизиты.Добавить("isguaranteed");
	
	// Прочие таблицы CommonData
	ЧисловыеРеквизиты.Добавить("coupon_period_base_id");
	ЧисловыеРеквизиты.Добавить("cp_type_id");
	ЧисловыеРеквизиты.Добавить("currentfacevalue_nrd");
	ЧисловыеРеквизиты.Добавить("daysall_nrd");
	ЧисловыеРеквизиты.Добавить("drqty");
	ЧисловыеРеквизиты.Добавить("facevalue_nrd");
	ЧисловыеРеквизиты.Добавить("fininstid_operator");
	ЧисловыеРеквизиты.Добавить("formarketbonds_nrd");
	ЧисловыеРеквизиты.Добавить("fraction_nrd");
	ЧисловыеРеквизиты.Добавить("islombardcbr_nrd");
	ЧисловыеРеквизиты.Добавить("minlot_nrd");
	ЧисловыеРеквизиты.Добавить("numcoupons_nrd");
	ЧисловыеРеквизиты.Добавить("placement_type_id");
	ЧисловыеРеквизиты.Добавить("placeprice_nrd");
	ЧисловыеРеквизиты.Добавить("rate_type_id");
	ЧисловыеРеквизиты.Добавить("sec_form_id");
	ЧисловыеРеквизиты.Добавить("sec_state_id");
	ЧисловыеРеквизиты.Добавить("sec_type_id");
	ЧисловыеРеквизиты.Добавить("share_category_id");
	ЧисловыеРеквизиты.Добавить("shqty");
	ЧисловыеРеквизиты.Добавить("sumissuevol_nrd");
	ЧисловыеРеквизиты.Добавить("summarketvol_nrd");
	ЧисловыеРеквизиты.Добавить("summarketvolorig_nrd");
	ЧисловыеРеквизиты.Добавить("nrd_sec_id");
	ЧисловыеРеквизиты.Добавить("instr_type_id");
	ЧисловыеРеквизиты.Добавить("issued_size_outstanding");
	ЧисловыеРеквизиты.Добавить("tax_rate");
	ЧисловыеРеквизиты.Добавить("tax_country_id");
	ЧисловыеРеквизиты.Добавить("tax_types_id");
	ЧисловыеРеквизиты.Добавить("credit_note_type_id");
	ЧисловыеРеквизиты.Добавить("managing_id");
	ЧисловыеРеквизиты.Добавить("registrar_id");
	
	// Прочие таблицы EmitentList
	ЧисловыеРеквизиты.Добавить("country_oksm");
	
	// Прочие таблицы Countries
	ЧисловыеРеквизиты.Добавить("code_rus");
	ЧисловыеРеквизиты.Добавить("country_id");
	ЧисловыеРеквизиты.Добавить("currency_fintool_id");
	ЧисловыеРеквизиты.Добавить("gov_fininst_id");
	
	// Прочие таблицы Currencies
	ЧисловыеРеквизиты.Добавить("iso_number");
	
	// Прочие таблицы Bond/TimeTable
	ЧисловыеРеквизиты.Добавить("fintoolid");
	ЧисловыеРеквизиты.Добавить("eventID");
	ЧисловыеРеквизиты.Добавить("couponRate");
	ЧисловыеРеквизиты.Добавить("pay1Bond_frac");
	ЧисловыеРеквизиты.Добавить("value");
	
	Возврат ЧисловыеРеквизиты;
КонецФункции

Функция InfoFintoolReferenceDataРеквизитыИИхТипы(ТолькоFintoolid)
	ИменаИТипыРеквизитов = Новый ТаблицаЗначений;
	ИменаИТипыРеквизитов.Колонки.Добавить("Имя");
	
	// Тип используется только при тестировании Ванесса для добавления тех колонок которых не оказалось в тестовых
	// данных (файл vsFintoolReferenceData.txt). Это нужно для того, чтобы при очередной доработке, когда мы добавляем
	// очередной реквизит, получаемый из RuData не пересоздовать каждый раз vsFintoolReferenceData.txt в тестах.
	ИменаИТипыРеквизитов.Колонки.Добавить("Тип");
	
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "fintoolid");
	Если ТолькоFintoolid Тогда
		Возврат ИменаИТипыРеквизитов;
	КонецЕсли;
	
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "base_asset_fintoolid");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "isincode");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "regcode");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "nrdcode");
	
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "moex_code");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "amortisedmty");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "fullname_en_nrd");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "isincodebase_nrd");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "sec_type_br_code");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "sectypenamerus_nrd");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "regdate");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "begdistdate");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "isqualified_nrd");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "available_for_unqualified", ОбщегоНазначения.ОписаниеТипаЧисло(1, 0));
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "secformnamerus_nrd");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "note");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "shqty");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "secformnamerus_nrd");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "fullname_nrd");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "summarketvol");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "couponrate");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "numdecimals");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "drqty");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "issuername_nrd");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "havedefault");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "numcoupons");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "depositary_nrd");
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "nominaltype",		ОбщегоНазначения.ОписаниеТипаСтрока(64));
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "securitykind",		ОбщегоНазначения.ОписаниеТипаСтрока(64));
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "borrowername",		ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "borrowercountry",	ОбщегоНазначения.ОписаниеТипаСтрока(3));
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "original_country",	ОбщегоНазначения.ОписаниеТипаСтрока(3));
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "country",			ОбщегоНазначения.ОписаниеТипаСтрока(3));
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "basis",				ОбщегоНазначения.ОписаниеТипаСтрока(15));
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "fullname",			ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, "issuername",		ОбщегоНазначения.ОписаниеТипаСтрока(200));
	
	Возврат ИменаИТипыРеквизитов;
КонецФункции

Процедура ДобавитьИнформациюОРеквизите(ИменаИТипыРеквизитов, Имя, Тип = Неопределено)
	НоваяСтрока = ИменаИТипыРеквизитов.Добавить();
	НоваяСтрока.Имя = Имя;
	НоваяСтрока.Тип = Тип;
КонецПроцедуры

Функция InfoFintoolReferenceDataРеквизиты(ТолькоFintoolid)
	ИменаИТипыРеквизитов = InfoFintoolReferenceDataРеквизитыИИхТипы(ТолькоFintoolid);
	fields = ИменаИТипыРеквизитов.ВыгрузитьКолонку("Имя");
	
	Возврат fields;
КонецФункции

Функция BondTimeTableРеквизиты()
	
	fields = Новый Массив;
	
	fields.Добавить("fintoolid");
	
	fields.Добавить("eventID");
	fields.Добавить("beginPeriod");
	fields.Добавить("endPeriod");
	fields.Добавить("fixdate");
	fields.Добавить("couponRate");
	fields.Добавить("pay1Bond_frac");
	fields.Добавить("value");
	fields.Добавить("note");
	
	Возврат fields;
КонецФункции

Функция НовыеВходныеПараметрыГруппы(НомерПачки, ДатаВремяОбновленияДанных, ВходящиеИдентификаторы, 
									ФильтрСтатусовЦБ = Неопределено, ИгнорируемыйКлюч = Неопределено)
	
	fintoolids 	= ВходящиеИдентификаторы.fintoolids;
	nrdcodes 	= ВходящиеИдентификаторы.nrdcodes;
	fininstids 	= ВходящиеИдентификаторы.fininstids;
	isins 		= ВходящиеИдентификаторы.isins;
	ids 		= ВходящиеИдентификаторы.ids;
	
	МаксимальноеКоличествоСтраниц = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("101.МаксимальноеКоличествоСтраниц", 10000);
	ЧисловыеРеквизиты = ЧисловыеРеквизитыТаблицRuDataAPI();
	
	Параметры = Новый Структура;
	ВставитьЭлементСтруктуры(Параметры, ИгнорируемыйКлюч, "НомерПачки"					, НомерПачки);
	ВставитьЭлементСтруктуры(Параметры, ИгнорируемыйКлюч, "ДатаВремяОбновленияДанных"	, ДатаВремяОбновленияДанных);
	ВставитьЭлементСтруктуры(Параметры, ИгнорируемыйКлюч, "МаксимальноеКоличествоСтраниц", МаксимальноеКоличествоСтраниц);
	ВставитьЭлементСтруктуры(Параметры, ИгнорируемыйКлюч, "ЧисловыеРеквизиты"			, ЧисловыеРеквизиты);
	ВставитьЭлементСтруктуры(Параметры, ИгнорируемыйКлюч, "fintoolids"					, ?(Не ЗначениеЗаполнено(fintoolids), 	Новый Массив, fintoolids));
	ВставитьЭлементСтруктуры(Параметры, ИгнорируемыйКлюч, "nrdcodes"						, ?(Не ЗначениеЗаполнено(nrdcodes), 	Новый Массив, nrdcodes));
	ВставитьЭлементСтруктуры(Параметры, ИгнорируемыйКлюч, "fininstids"					, ?(Не ЗначениеЗаполнено(fininstids), 	Новый Массив, fininstids));
	ВставитьЭлементСтруктуры(Параметры, ИгнорируемыйКлюч, "isins"						, ?(Не ЗначениеЗаполнено(isins), 		Новый Массив, isins));
	ВставитьЭлементСтруктуры(Параметры, ИгнорируемыйКлюч, "ids"							, ?(Не ЗначениеЗаполнено(ids), 			Новый Массив, ids));
	ВставитьЭлементСтруктуры(Параметры, ИгнорируемыйКлюч, "ФильтрСтатусовЦБ"				, ФильтрСтатусовЦБ);
	
	Возврат Параметры;
КонецФункции

Процедура ВставитьЭлементСтруктуры(Структура, ИгнорируемыйКлюч, Ключ, Значение)
	Если Ключ <> ИгнорируемыйКлюч Тогда
		Структура.Вставить(Ключ, Значение);
	КонецЕсли;
КонецПроцедуры

Функция НовыеВходящиеИдентификаторы()
	Возврат Новый Структура("fintoolids, nrdcodes, fininstids, isins, ids");
КонецФункции

Функция ПоследнийИндексДляЦикла(Параметры, ИмяПараметраСМассивом, ПолучитьВсеБезФильтра = Ложь)
	ВерхняяГраница = Параметры[ИмяПараметраСМассивом].ВГраница();
	Если ЗначениеЗаполнено(Параметры.ДатаВремяОбновленияДанных) Или ПолучитьВсеБезФильтра Тогда
		ПоследнийИндекс = Макс(ВерхняяГраница, 0);	// Чтобы была хоть одна итерация
	Иначе
		ПоследнийИндекс = ВерхняяГраница;
	КонецЕсли;
	
	Возврат ПоследнийИндекс;
КонецФункции

// BSLLS:CognitiveComplexity-off
Функция ТаблицаДанныхМетода(ИмяМетода, НастройкиСоединения, ОписаниеОшибки, Сессия, ВходныеПараметры)
	
	ТаблицаДанных = Неопределено;
	
	ИмяМетодаInfoFintoolClassification	 = "InfoFintoolClassification";
	ИмяМетодаInfoFintoolReferenceData	 = "InfoFintoolReferenceData";
	ИмяМетодаNsdCommonData				 = "NsdCommonData";
	ИмяМетодаEmitentList				 = "EmitentList";
	ИмяМетодаInfoSecuritiesWithCodes	 = "InfoSecurities";
	ИмяМетодаBondAmortizations 			 = "BondAmortizations";
	ИмяМетодаBondTimeTable				 = "BondTimeTable";
	ИмяМетодаFintoolCategoryValue		 = "FintoolCategoryValue";
	
	ИмяПараметраFintoolids = "fintoolids";
	
	ВходныеПараметрыГруппа = Новый Структура;
	ВходныеПараметрыГруппа.Вставить("НомерПачки"				, "");
	ВходныеПараметрыГруппа.Вставить("pageNum"					, 0);
	ВходныеПараметрыГруппа.Вставить("pageSize"					, 100);
	ВходныеПараметрыГруппа.Вставить("ДатаВремяОбновленияДанных"	, ВходныеПараметры.ДатаВремяОбновленияДанных);
	
	Если ИмяМетода = ИмяМетодаInfoFintoolClassification Тогда
		ВходныеПараметрыГруппа.Вставить(ИмяПараметраFintoolids		, ВходныеПараметры.fintoolids);
		ВходныеПараметрыГруппа.Вставить("filter"					, ВходныеПараметры.filter);
	КонецЕсли;
	Если ИмяМетода = ИмяМетодаInfoFintoolReferenceData Тогда
		ВходныеПараметрыГруппа.Вставить(ИмяПараметраFintoolids		, ВходныеПараметры.fintoolids);
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ВходныеПараметрыГруппа, ВходныеПараметры, "ТолькоFintoolid");
	КонецЕсли;
	Если ИмяМетода = ИмяМетодаNsdCommonData Тогда
		ВходныеПараметрыГруппа.Вставить("nrdcodes"					, ВходныеПараметры.nrdcodes);
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ВходныеПараметрыГруппа, ВходныеПараметры, "filter");
	КонецЕсли;
	Если ИмяМетода = ИмяМетодаEmitentList Тогда
		ВходныеПараметрыГруппа.Вставить("fininstids"				, ВходныеПараметры.fininstids);
	КонецЕсли;
	Если ИмяМетода = ИмяМетодаInfoSecuritiesWithCodes Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ВходныеПараметрыГруппа, ВходныеПараметры, "isins");
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуруВыборочно(ВходныеПараметрыГруппа, ВходныеПараметры, "fintoolids");
		ВходныеПараметрыГруппа.Вставить("ФильтрСтатусовЦБ"			, ВходныеПараметры.ФильтрСтатусовЦБ);
		ВходныеПараметрыГруппа.Вставить("ОбновитьБумагиВНеактуальномСтатусе" , ВходныеПараметры.ОбновитьБумагиВНеактуальномСтатусе);
	КонецЕсли;
	Если ИмяМетода = ИмяМетодаBondAmortizations Тогда
		ВходныеПараметрыГруппа.Вставить(ИмяПараметраFintoolids		, ВходныеПараметры.fintoolids);
	КонецЕсли;
	Если ИмяМетода = ИмяМетодаBondTimeTable Тогда
		ВходныеПараметрыГруппа.Вставить("ids"						, ВходныеПараметры.ids);
		ВходныеПараметрыГруппа.Вставить("eventTypes"				, ВходныеПараметры.eventTypes);
		ВходныеПараметрыГруппа.Вставить("pageSize"					, 1000);
	КонецЕсли;
	Если ИмяМетода = ИмяМетодаFintoolCategoryValue Тогда
		ВходныеПараметрыГруппа.Вставить("fintoolIds" 				, ВходныеПараметры.fintoolIds);
		ВходныеПараметрыГруппа.Вставить("filterOnlySpecifiedCategory", ВходныеПараметры.filterOnlySpecifiedCategory);
		ВходныеПараметрыГруппа.Вставить("onlyFintoolsWithCategory"	, ВходныеПараметры.onlyFintoolsWithCategory);
	КонецЕсли;
	
	Для НомерСтраницы = 1 По ВходныеПараметры.МаксимальноеКоличествоСтраниц Цикл
		ВходныеПараметрыГруппа.НомерПачки = "" + ВходныеПараметры.НомерПачки + "_" + НомерСтраницы;
		ВходныеПараметрыГруппа.pageNum = НомерСтраницы;
		Если ИмяМетода = ИмяМетодаInfoFintoolClassification Тогда
			
			Результат = API_ПолучитьОтветМетода(ИмяМетодаInfoFintoolClassification, "/Info/FintoolClassification",
				ВходныеПараметрыГруппа, НастройкиСоединения, ОписаниеОшибки, Сессия);
				
		КонецЕсли;
		Если ИмяМетода = ИмяМетодаInfoFintoolReferenceData Тогда
			
			Результат = API_ПолучитьОтветМетода(ИмяМетодаInfoFintoolReferenceData, "/Info/FintoolReferenceData",
				ВходныеПараметрыГруппа, НастройкиСоединения, ОписаниеОшибки, Сессия);
			
		КонецЕсли;
		Если ИмяМетода = ИмяМетодаNsdCommonData Тогда
			
			Результат = API_ПолучитьОтветМетода(ИмяМетодаNsdCommonData, "/Nsd/CommonData",
				ВходныеПараметрыГруппа, НастройкиСоединения, ОписаниеОшибки, Сессия);
			
		КонецЕсли;
		Если ИмяМетода = ИмяМетодаEmitentList Тогда
			
			Результат = API_ПолучитьОтветМетода(ИмяМетодаEmitentList, "/Emitent/List",
				ВходныеПараметрыГруппа, НастройкиСоединения, ОписаниеОшибки, Сессия);
			
		КонецЕсли;
		Если ИмяМетода = ИмяМетодаInfoSecuritiesWithCodes Тогда
			
			Результат = API_ПолучитьОтветМетода("InfoSecurities", "/Info/Securities",
				ВходныеПараметрыГруппа, НастройкиСоединения, ОписаниеОшибки, Сессия);
			
		КонецЕсли;
		Если ИмяМетода = ИмяМетодаBondAmortizations Тогда
			
			Результат = API_ПолучитьОтветМетода(ИмяМетодаBondAmortizations, "/Bond/Amortizations",
				ВходныеПараметрыГруппа, НастройкиСоединения, ОписаниеОшибки, Сессия);
				
		КонецЕсли;	
		Если ИмяМетода = ИмяМетодаBondTimeTable Тогда
			
			Результат = API_ПолучитьОтветМетода(ИмяМетодаBondTimeTable, "/Bond/TimeTable",
				ВходныеПараметрыГруппа, НастройкиСоединения, ОписаниеОшибки, Сессия);
			
			Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("timeTableFields") Тогда
				Результат = Результат.timeTableFields;
			Иначе
				Результат = Новый Массив;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИмяМетода = ИмяМетодаFintoolCategoryValue Тогда
			Результат = API_ПолучитьОтветМетода("InfoFintoolCategoryValue", "/Info/fintool-category-value",
				ВходныеПараметрыГруппа, НастройкиСоединения, ОписаниеОшибки, Сессия);
		КонецЕсли;
			
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Прервать;
		КонецЕсли;
		ВременнаяТаблица = ПреобразоватьМассивВТаблицуЗначений(Результат, ВходныеПараметры.ЧисловыеРеквизиты);
		ДополнитьИмитаторТаблицыДанныхМетода(ИмяМетода, ВременнаяТаблица);
		ТаблицаДанных = КонкатенацияТаблицЗначений(ТаблицаДанных, ВременнаяТаблица);
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции
// BSLLS:CognitiveComplexity-on

Функция ТаблицаСозданияОбновленияЦенныхБумаг(ИмяТаблицы, ИмяПараметраПериод, ТаблицаВходныхДанных, ВходныеПараметры = Неопределено)
	
	РезультирующаяТаблица = Неопределено;
	ТолькоУникальныеЗначения = Истина;
	ТолькоЗаполненныеЗначения = Истина;
	
	Если ИмяТаблицы = "BondTimeTable" Тогда
		ЦенныеБумаги = ТаблицаВходныхДанных.Скопировать();
		ids = ОбщегоНазначения.ВыгрузитьКолонку(ЦенныеБумаги, "isin", ТолькоУникальныеЗначения, ТолькоЗаполненныеЗначения);
		ВходныеПараметры.Вставить("ids", ids);
		ВходныеПараметры.Вставить(ИмяПараметраПериод, Дата(1, 1, 1));
		ОписаниеОшибки = "";
		Сессия = Неопределено;
		РезультирующаяТаблица = BondTimeTable(ОписаниеОшибки, Сессия, ВходныеПараметры);
	КонецЕсли;
	
	Если ИмяТаблицы = "InfoFintoolReferenceData" Тогда
		ВходныеПараметры = Новый Структура;
		ЦенныеБумаги = ТаблицаВходныхДанных.Скопировать();
		fintoolids = ОбщегоНазначения.ВыгрузитьКолонку(ЦенныеБумаги, "fintoolid", ТолькоУникальныеЗначения, ТолькоЗаполненныеЗначения);
		ВходныеПараметры.Вставить("fintoolids", fintoolids);
		ВходныеПараметры.Вставить(ИмяПараметраПериод, Дата(1, 1, 1));
		ОписаниеОшибки = "";
		Сессия = Неопределено;
		РезультирующаяТаблица = InfoFintoolReferenceData(ОписаниеОшибки, Сессия, ВходныеПараметры);
		
		Если Не ЗначениеЗаполнено(РезультирующаяТаблица) Тогда // Получим таблицу
			ВходныеПараметры = Новый Структура;
			fintoolids = Новый Массив;
			КодПоУмолчаниюRuData = "158150";
			fintoolids.Добавить(КодПоУмолчаниюRuData);
			ВходныеПараметры.Вставить("fintoolids", fintoolids);
			ВходныеПараметры.Вставить(ИмяПараметраПериод, Дата(1, 1, 1));
			ОписаниеОшибки = "";
			Сессия = Неопределено;
			РезультирующаяТаблица = InfoFintoolReferenceData(ОписаниеОшибки, Сессия, ВходныеПараметры);
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяТаблицы = "NsdCommonData" Тогда
		ВходныеПараметры = Новый Структура;
		ЦенныеБумаги = ТаблицаВходныхДанных.Скопировать();
		nrdcodes = ОбщегоНазначения.ВыгрузитьКолонку(ЦенныеБумаги, "nrdcode", ТолькоУникальныеЗначения, ТолькоЗаполненныеЗначения);
		ВходныеПараметры.Вставить("nrdcodes", nrdcodes);
		ВходныеПараметры.Вставить(ИмяПараметраПериод, Дата(1, 1, 1));
		ОписаниеОшибки = "";
		Сессия = Неопределено;
		РезультирующаяТаблица = NsdCommonData(ОписаниеОшибки, Сессия, ВходныеПараметры);
		
		Если Не ЗначениеЗаполнено(РезультирующаяТаблица) Тогда // Получим таблицу
			ВходныеПараметры = Новый Структура;
			КодПоУмолчаниюNDC = "RU000A102RB2";
			nrdcodes = Новый Массив;
			nrdcodes.Добавить(КодПоУмолчаниюNDC);
			ВходныеПараметры.Вставить("nrdcodes", nrdcodes);
			ВходныеПараметры.Вставить(ИмяПараметраПериод, Дата(1, 1, 1));
			ОписаниеОшибки = "";
			Сессия = Неопределено;
			РезультирующаяТаблица = NsdCommonData(ОписаниеОшибки, Сессия, ВходныеПараметры);
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультирующаяТаблица;
	
КонецФункции

Функция ТаблицаЭмитентовЗагружаемыхЦБ(ТаблицаЗагружаемыхЦБ, ВходныеПараметры = Неопределено)

	Если ВходныеПараметры = Неопределено Тогда
		ВходныеПараметры = Новый Структура;
	КонецЕсли;
	
	// Отбираем id (fininstid) всех новых ЦБ (которых раньше не было в справочнике ЦБ)
	fininstids = Новый Массив;
	ПараметрыОтбора = Новый Структура("ЭтоНоваяЦБ", Истина);
	ЦБДляПоискаЭмитентов = ТаблицаЗагружаемыхЦБ.НайтиСтроки(ПараметрыОтбора);
	Для Каждого ЦБДляПоиска Из ЦБДляПоискаЭмитентов Цикл
		Если ЗначениеЗаполнено(ЦБДляПоиска.fininstid) И fininstids.Найти(ЦБДляПоиска.fininstid) = Неопределено Тогда
			fininstids.Добавить(ЦБДляПоиска.fininstid);
		КонецЕсли;
	КонецЦикла;
	
	// В зависимости от входных параметров отбираем id (fininstid) всех не новых загружаемых ЦБ, или только тех,
	// для которых раньше не был указан эмитент (юридическое лицо контрагента)
	Если ВходныеПараметры.Свойство("ОбновитьЭмитентовВсехЗагружаемыхЦБ") И ВходныеПараметры.ОбновитьЭмитентовВсехЗагружаемыхЦБ Тогда
		ПараметрыОтбора = Новый Структура("ЭтоНоваяЦБ", Ложь);
	Иначе
		ПараметрыОтбора = Новый Структура("ЭтоНоваяЦБ, БезЭмитента", Ложь, Истина);
	КонецЕсли;
	ЦБДляПоискаЭмитентов = ТаблицаЗагружаемыхЦБ.НайтиСтроки(ПараметрыОтбора);
	Для Каждого ЦБДляПоиска Из ЦБДляПоискаЭмитентов Цикл
		Если ЗначениеЗаполнено(ЦБДляПоиска.fininstid) И fininstids.Найти(ЦБДляПоиска.fininstid) = Неопределено Тогда
			fininstids.Добавить(ЦБДляПоиска.fininstid);
		КонецЕсли;
	КонецЦикла;
	
	ВходныеПараметры.Вставить("fininstids", fininstids);
	ВходныеПараметры.Вставить("ДатаВремяОбновленияДанных", Дата(1, 1, 1));
	ОписаниеОшибки = "";
	Сессия = Неопределено;
	ТаблицаЭмитентовЗагружаемыхЦБ = EmitentList(ОписаниеОшибки, Сессия, ВходныеПараметры);
	
	Возврат ТаблицаЭмитентовЗагружаемыхЦБ;
КонецФункции

Функция ТаблицаИзменившихсяЭмитентов(ВходныеПараметры = Неопределено)
	
	Если ВходныеПараметры = Неопределено Тогда
		ВходныеПараметры = Новый Структура;
	КонецЕсли;
	
	ТаблицаИзменившихсяЭмитентов = Неопределено;
	ЭтоОтчет = ВходныеПараметры.Свойство("ЭтоОтчет") И ВходныеПараметры.ЭтоОтчет;
	
	Если Не ЭтоОтчет И СвойствоЗаполнено(ВходныеПараметры, "ДатаВремяОбновленияДанных") Тогда
		ОписаниеОшибки = "";
		Сессия = Неопределено;
		НастройкиСоединения = ПараметрыИсточника();
		Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
			ВходящиеИдентификаторы = НовыеВходящиеИдентификаторы();
			ВходящиеИдентификаторы.Вставить("fininstids", Неопределено);
			ВходныеПараметрыГруппа = НовыеВходныеПараметрыГруппы(1, ВходныеПараметры.ДатаВремяОбновленияДанных, ВходящиеИдентификаторы);
			ТаблицаИзменившихсяЭмитентов = ТаблицаДанныхМетода("EmitentList", НастройкиСоединения, ОписаниеОшибки, Сессия, ВходныеПараметрыГруппа);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТаблицаИзменившихсяЭмитентов;
КонецФункции
 
// Возвращает таблицу создания Эмитентов
//
// Параметры:
//  ТаблицаЭмитентовЗагружаемыхЦБ - ТаблицаЗначений	 - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Info/Securities) 
//  													или Неопределено
//  ТаблицаИзменившихсяЭмитентов - ТаблицаЗначений	 - таблица с данными того же формата что и у предыдущего параметра или Неопределено
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с объединенными данными по новым Эмитентам
//
Функция СтатикаЭмитентов(ТаблицаЭмитентовЗагружаемыхЦБ, ТаблицаИзменившихсяЭмитентов)
	
	ТаблицаСтатики = Новый ТаблицаЗначений;
	
	Если Не ЗначениеЗаполнено(ТаблицаЭмитентовЗагружаемыхЦБ) И Не ЗначениеЗаполнено(ТаблицаИзменившихсяЭмитентов) Тогда
		Возврат ТаблицаСтатики;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТаблицаЭмитентовЗагружаемыхЦБ) Тогда
		ТаблицаЭмитентовЗагружаемыхЦБ = ТаблицаИзменившихсяЭмитентов.СкопироватьКолонки();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТаблицаИзменившихсяЭмитентов) Тогда
		ТаблицаИзменившихсяЭмитентов = ТаблицаЭмитентовЗагружаемыхЦБ.СкопироватьКолонки();
	КонецЕсли;
	
	ТекстЗапроса = "";
	ВыбратьПоместить = " ВЫБРАТЬ * ПОМЕСТИТЬ ";
	
	ТекстЗапроса = ТекстЗапроса
	+ ВыбратьПоместить + " ВТ_ТаблицаЭмитентовЗагружаемыхЦБ " + "
	|ИЗ
	|	&ТаблицаЭмитентовЗагружаемыхЦБ КАК ТаблицаЭмитентовЗагружаемыхЦБ; ";
	ТекстЗапроса = ТекстЗапроса
	+ ВыбратьПоместить + " ВТ_ТаблицаИзменившихсяЭмитентов " + "
	|ИЗ
	|	&ТаблицаИзменившихсяЭмитентов КАК ТаблицаИзменившихсяЭмитентов";
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаЭмитентовЗагружаемыхЦБ", ТаблицаЭмитентовЗагружаемыхЦБ);
	Запрос.УстановитьПараметр("ТаблицаИзменившихсяЭмитентов", ТаблицаИзменившихсяЭмитентов);
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	СхемаRuDataAPI = ПолучитьОбщийМакет("СтатикаЭмитентыRuDataAPI");
	
	КомпоновщикНастроекНастройки = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекНастройки.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаRuDataAPI));
	КомпоновщикНастроекНастройки.ЗагрузитьНастройки(СхемаRuDataAPI.НастройкиПоУмолчанию); 
	
	ПараметрыДанных = КомпоновщикНастроекНастройки.Настройки.ПараметрыДанных;
	ПараметрыДанных.УстановитьЗначениеПараметра("ЭтоПервоначальнаяЗагрузка", Ложь);
	ПараметрыДанных.УстановитьЗначениеПараметра("ТекущаяДатаСеанса", НачалоДня(ТекущаяДатаСеанса()));
	ПараметрыДанных.УстановитьЗначениеПараметра("КлассификаторНДЦ", Справочники.КлассификаторыЗагрузки.НДЦ());
	ПараметрыДанных.УстановитьЗначениеПараметра("КлассификаторRuData", Справочники.КлассификаторыЗагрузки.RuData);
	ПараметрыДанных.УстановитьЗначениеПараметра("СтатусыАктуальныхЦБ", СтатусыАктуальныхЦБ());
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаRuDataAPI, КомпоновщикНастроекНастройки.Настройки, , ,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , Истина, , МенеджерВременныхТаблиц);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаСтатики);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТаблицаСтатики;
	
КонецФункции

// Возвращает таблицу обновления ЦБ
//
// Параметры:
//  ТаблицаInfoSecurities			 - ТаблицаЗначений	 - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Info/Securities)
//  ТаблицаInfoFintoolReferenceData	 - ТаблицаЗначений	 - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Info/FintoolReferenceData)
//  ТаблицаNsdCommonData			 - ТаблицаЗначений	 - Таблица с данными (см. https://docs.efir-net.ru/dh2/#/Nsd/CommonData)
//  ТаблицаДопущенныхКТоргамЦБ		 - ТаблицаЗначений	 - Таблица с единственной колонкой fintoolid (см.
//															https://docs.efir-net.ru/dh2/#/Info/FintoolClassification)
//  ВходныеПараметры				 - Структура
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с объединенными данными по ЦБ
//
Функция СтатикаЦенныхБумаг(ТаблицаInfoSecurities, ТаблицаInfoFintoolReferenceData, ТаблицаNsdCommonData,
							ТаблицаДопущенныхКТоргамЦБ, ВходныеПараметры)
	
	ТаблицаСтатики = Новый ТаблицаЗначений;
	
	Если Не ЗначениеЗаполнено(ТаблицаInfoSecurities)
			Или Не ЗначениеЗаполнено(ТаблицаInfoFintoolReferenceData)
			Или Не ЗначениеЗаполнено(ТаблицаNsdCommonData) Тогда
		Возврат ТаблицаСтатики;
	КонецЕсли;
	
	ТекстЗапроса = "";
	ВыбратьПоместить = " ВЫБРАТЬ * ПОМЕСТИТЬ ";
	
	ТекстЗапроса = ТекстЗапроса
	+ ВыбратьПоместить + " InfoSecurities " + "
	|ИЗ
	|	&ТаблицаInfoSecurities КАК ТаблицаInfoSecurities; ";
	ТекстЗапроса = ТекстЗапроса
	+ ВыбратьПоместить + " InfoFintoolReferenceData " + "
	|ИЗ
	|	&ТаблицаInfoFintoolReferenceData КАК ТаблицаInfoFintoolReferenceData; ";
	ТекстЗапроса = ТекстЗапроса
	+ ВыбратьПоместить + " NsdCommonData " + "
	|ИЗ
	|	&ТаблицаNsdCommonData КАК ТаблицаNsdCommonData; ";
	ТекстЗапроса = ТекстЗапроса
	+ ВыбратьПоместить + " ТаблицаДопущенныхКТоргамЦБ " + "
	|ИЗ
	|	&ТаблицаДопущенныхКТоргамЦБ КАК ТаблицаДопущенныхКТоргамЦБ ";
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// В платформе 1C (на момент написания этого кода использовалась платформа 8.3.21.1674) в СКД присутствует
	// ограничение: не более 9 знаков после запятой у числовых значений. Значения с большей разрядностью округляются
	// до 9 знаков. Поэтому пришлось пойти на такой способ обхода этого ограничения: предварительно преобразовать
	// число, представляющее номинал ЦБ, в строку. А после получения результата из СКД - преобразовать обратно строку
	// в число.
	ТаблицаInfoSecurities.Колонки.Добавить("facevalue_строка", ОбщегоНазначения.ОписаниеТипаСтрока(40));
	Для каждого Строка Из ТаблицаInfoSecurities Цикл
		Если ЗначениеЗаполнено(Строка.facevalue) Тогда
			Строка.facevalue_строка = Формат(Строка.facevalue, "ЧГ=");
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаInfoSecurities", ТаблицаInfoSecurities);
	Запрос.УстановитьПараметр("ТаблицаInfoFintoolReferenceData", ТаблицаInfoFintoolReferenceData);
	Запрос.УстановитьПараметр("ТаблицаNsdCommonData", ТаблицаNsdCommonData);
	Запрос.УстановитьПараметр("ТаблицаДопущенныхКТоргамЦБ", ТаблицаДопущенныхКТоргамЦБ);
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	СхемаRuDataAPI = ПолучитьОбщийМакет("СтатикаЦБRuDataAPI");
	
	КомпоновщикНастроекНастройки = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекНастройки.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаRuDataAPI));
	КомпоновщикНастроекНастройки.ЗагрузитьНастройки(СхемаRuDataAPI.НастройкиПоУмолчанию); 
	
	ПараметрыДанных = КомпоновщикНастроекНастройки.Настройки.ПараметрыДанных;
	ПараметрыДанных.УстановитьЗначениеПараметра("ЭтоПервоначальнаяЗагрузка", Ложь);
	ПараметрыДанных.УстановитьЗначениеПараметра("ТекущаяДатаСеанса", НачалоДня(ТекущаяДатаСеанса()));
	ПараметрыДанных.УстановитьЗначениеПараметра("КлассификаторНДЦ", Справочники.КлассификаторыЗагрузки.НДЦ());
	ПараметрыДанных.УстановитьЗначениеПараметра("КлассификаторRuData", Справочники.КлассификаторыЗагрузки.RuData);
	ПараметрыДанных.УстановитьЗначениеПараметра("КлассификаторMICEX", Справочники.Биржи.MICEX);
	ПараметрыДанных.УстановитьЗначениеПараметра("ОбновитьБумагиВНеактуальномСтатусе", ВходныеПараметры.ОбновитьБумагиВНеактуальномСтатусе);
	ПараметрыДанных.УстановитьЗначениеПараметра("СтатусыАктуальныхЦБ", СтатусыАктуальныхЦБ());
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаRuDataAPI, КомпоновщикНастроекНастройки.Настройки, , ,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , Истина, , МенеджерВременныхТаблиц);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаСтатики);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	// Обратное преобразование номинала ЦБ из строки в число
	ТаблицаСтатики.Колонки.Добавить("facevalue", ОбщегоНазначения.ОписаниеТипаЧисло(32, 20));
	Для каждого Строка Из ТаблицаСтатики Цикл
		Если ЗначениеЗаполнено(Строка.facevalue_строка) Тогда
			Строка.facevalue = Число(Строка.facevalue_строка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаСтатики;
	
КонецФункции

Функция FintoolidsПоВсемИзменениям(ВходныеПараметры, ОписаниеОшибки, Сессия = Неопределено)
	ТолькоУникальныеЗначения = Истина;
	ТолькоЗаполненныеЗначения = Истина;
	ИмяКолонкиFintoolid = "fintoolid";
	
	// Получим fintoolids/nrdcodes соответствующие ISINs если заданы ISINs (фильтр по статусам учитываем, фильтр по дате - нет)
	// Списоки fintoolid/nrdcodes нужны для фильтрации по заданым ISIN в остальных таблицах
	Если СвойствоЗаполнено(ВходныеПараметры, "ISINs") Тогда
		Параметры = Новый Структура;
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Параметры, ВходныеПараметры);
		Параметры.ДатаВремяОбновленияДанных = ДАТА(1, 1, 1);
		ЦБПоISINs = ДанныеЦенныхБумагПоПараметрам(Параметры, ОписаниеОшибки, Сессия);
		FintoolidsOnISINs = ОбщегоНазначения.ВыгрузитьКолонку(ЦБПоISINs, ИмяКолонкиFintoolid,
																ТолькоУникальныеЗначения, ТолькоЗаполненныеЗначения);
		NrdcodesOnISINs = ОбщегоНазначения.ВыгрузитьКолонку(ЦБПоISINs, "nrdcode", ТолькоУникальныеЗначения, ТолькоЗаполненныеЗначения);
		Если FintoolidsOnISINs.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		FintoolidsOnISINs = Новый Массив;
		NrdcodesOnISINs = Новый Массив;
	КонецЕсли;
	
	// Получим fintoolids с использованием всех стандартных фильтров по InfoSecurities
	Параметры = ПараметрыДляПоискаИзменений(ВходныеПараметры.ДатаВремяОбновленияДанных, FintoolidsOnISINs);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Параметры, ВходныеПараметры, Ложь);
	ТЗInfoSecurities = ДанныеЦенныхБумагПоПараметрам(Параметры, ОписаниеОшибки, Сессия);
	Если ЗначениеЗаполнено(ТЗInfoSecurities) Тогда
		Fintoolids = ОбщегоНазначения.ВыгрузитьКолонку(ТЗInfoSecurities, ИмяКолонкиFintoolid,
															ТолькоУникальныеЗначения, ТолькоЗаполненныеЗначения);
	Иначе
		Fintoolids = Новый Массив;
	КонецЕсли;
	
	// Получим fintoolids из таблицы Info\FintoolReferenceData с использованием фильтров по дате обновления и FintoolidsOnISINs
	Параметры = ПараметрыДляПоискаИзменений(ВходныеПараметры.ДатаВремяОбновленияДанных, FintoolidsOnISINs);
	Параметры.Вставить("ТолькоFintoolid", Истина);
	ТЗFintoolReferenceData = InfoFintoolReferenceData(ОписаниеОшибки, Сессия, Параметры);
	ДополнитьМассивFintoolids(Fintoolids, ТЗFintoolReferenceData, ИмяКолонкиFintoolid);
	
	// Получим fintoolids из таблицы Nsd\CommonData с использованием фильтров по дате обновления и NrdcodesOnISINs
	Параметры = ПараметрыДляПоискаИзменений(ВходныеПараметры.ДатаВремяОбновленияДанных, FintoolidsOnISINs, NrdcodesOnISINs);
	Параметры.Вставить("filter", "fintoolid IS NOT NULL");
	ТЗNsdCommonData = NsdCommonData(ОписаниеОшибки, Сессия, Параметры);
	ДополнитьМассивFintoolids(Fintoolids, ТЗNsdCommonData, ИмяКолонкиFintoolid);
	
	// Получим fintoolids из таблицы Bond\Amortizations с использованием фильтров по дате обновления и FintoolidsOnISINs
	Параметры = ПараметрыДляПоискаИзменений(ВходныеПараметры.ДатаВремяОбновленияДанных, FintoolidsOnISINs);
	ТЗBondAmortizations = BondAmortizations(ОписаниеОшибки, Сессия, Параметры);
	ДополнитьМассивFintoolids(Fintoolids, ТЗBondAmortizations, "id_fintool");
	
	Возврат Fintoolids;
КонецФункции

Процедура ДополнитьМассивFintoolids(Fintoolids, ТаблицаЗначений, ИмяКолонкиСFintoolid)
	Если ЗначениеЗаполнено(ТаблицаЗначений) Тогда
		FintoolidsFromTable = ТаблицаЗначений.ВыгрузитьКолонку(ИмяКолонкиСFintoolid);
		ЧисловыеРеквизиты = ЧисловыеРеквизитыТаблицRuDataAPI();
		Если ЧисловыеРеквизиты.НайтиПоЗначению(ИмяКолонкиСFintoolid) <> Неопределено Тогда // Преобразуем число в строку
			МаксИндекс = FintoolidsFromTable.Количество() - 1;
			Для Индекс = 0 По МаксИндекс Цикл
				FintoolidsFromTable[Индекс] = Формат(FintoolidsFromTable[Индекс], "ЧН=0; ЧГ=");
			КонецЦикла;
		КонецЕсли;
		ТолькоУникальныеЗначения = Истина;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Fintoolids, FintoolidsFromTable, ТолькоУникальныеЗначения);
	КонецЕсли;
КонецПроцедуры

Функция ПараметрыДляПоискаИзменений(ДатаВремяОбновленияДанных, FintoolidsOnISINs, NrdcodesOnISINs = Неопределено)
	Параметры = Новый Структура;
	Параметры.Вставить("fintoolids", FintoolidsOnISINs);
	Параметры.Вставить("ДатаВремяОбновленияДанных", ДатаВремяОбновленияДанных);
	Если NrdcodesOnISINs <> Неопределено Тогда
		Параметры.Вставить("nrdcodes", NrdcodesOnISINs);
	КонецЕсли;
	
	Возврат Параметры;
КонецФункции

Процедура ОсновнойАлгоритмЗагрузкиНКД(ТекущаяДата, Isins)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КурсыВалют.Валюта.Наименование КАК ВалютаНаименование,
	|	КурсыВалют.Курс КАК Курс
	|ИЗ
	|	РегистрСведений.КурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Период = &Дата";
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата));
	Выборка = Запрос.Выполнить().Выбрать();
	КурсыВалют = Новый Структура;
	Пока Выборка.Следующий() Цикл
		КурсыВалют.Вставить(Выборка.ВалютаНаименование, Выборка.Курс);
	КонецЦикла;
	КурсыВалют.Вставить("RUB", 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КодыЗагрузки.Код КАК Код,
	|	ЦенныеБумаги.Ссылка КАК ЦБ,
	|	ЦенныеБумаги.ДатаПогашения КАК ДатаПогашения,
	|	ЦенныеБумаги.ISIN КАК ISIN
	|ПОМЕСТИТЬ ЦенныеБумаги
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО КодыЗагрузки.Владелец = ЦенныеБумаги.Ссылка
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.Rudata))
	|			И (ЦенныеБумаги.КупоннаяОблигация)
	|			И (НЕ ЦенныеБумаги.ПометкаУдаления)
	|			И (ЦенныеБумаги.ISIN В (&Isins))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЦенныеБумагиКупоны.ДатаПогашения) КАК ДатаПогашения,
	|	ЦенныеБумагиКупоны.Ссылка КАК ЦБ
	|ПОМЕСТИТЬ Купоны
	|ИЗ
	|	ЦенныеБумаги КАК ЦенныеБумаги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги.Купоны КАК ЦенныеБумагиКупоны
	|		ПО ЦенныеБумаги.ЦБ = ЦенныеБумагиКупоны.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумагиКупоны.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЦенныеБумагиКупоны.ДатаПогашения) КАК ДатаПогашения,
	|	ЦенныеБумагиКупоны.Ссылка КАК ЦБ,
	|	ЦенныеБумагиКупоны.Сумма КАК Сумма
	|ПОМЕСТИТЬ КупоныСтоимость
	|ИЗ
	|	ЦенныеБумаги КАК ЦенныеБумаги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги.Купоны КАК ЦенныеБумагиКупоны
	|		ПО ЦенныеБумаги.ЦБ = ЦенныеБумагиКупоны.Ссылка
	|			И (ЦенныеБумагиКупоны.ДатаПогашения = &ДатаПогашения)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумагиКупоны.Ссылка,
	|	ЦенныеБумагиКупоны.Сумма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумаги.Код КАК Код,
	|	ЦенныеБумаги.ЦБ КАК ЦБ,
	|	ЕСТЬNULL(КупоныСтоимость.Сумма, 0) КАК Сумма,
	|	ЦенныеБумаги.ISIN КАК ISIN
	|ИЗ
	|	ЦенныеБумаги КАК ЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Купоны КАК Купоны
	|		ПО ЦенныеБумаги.ЦБ = Купоны.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ КупоныСтоимость КАК КупоныСтоимость
	|		ПО ЦенныеБумаги.ЦБ = КупоныСтоимость.ЦБ
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЦенныеБумаги.ДатаПогашения <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ЦенныеБумаги.ДатаПогашения >= &ДатаПогашения
	|			ИНАЧЕ ЕСТЬNULL(Купоны.ДатаПогашения, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаПогашения
	|		КОНЕЦ";
	Если ЗначениеЗаполнено(Isins) Тогда
		Запрос.УстановитьПараметр("Isins", Isins);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И (ЦенныеБумаги.ISIN В (&Isins))", "");
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаПогашения", НачалоДня(ТекущаяДата));
	СписокБумаг = Новый Массив;
	КодРуДатаЦБ = Новый Соответствие;
	СтоимостьКупона = Новый Соответствие;
	МаксимальноеКоличествоЗаписей = 100;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОписаниеТипа = Новый ОписаниеТипов("Число");
		КодЦБ = ОписаниеТипа.ПривестиЗначение(Выборка.Код);
		Если КодЦБ = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КодРуДатаЦБ.Вставить(Число(Выборка.Код), Выборка.ЦБ);
		СтоимостьКупона.Вставить(Число(Выборка.Код), Выборка.Сумма);
		СписокБумаг.Добавить(Выборка.Код);
		
		Если СписокБумаг.Количество() = МаксимальноеКоличествоЗаписей Тогда
			ОбработатьПолученныеНКД(СписокБумаг, СтоимостьКупона, КурсыВалют, ТекущаяДата, КодРуДатаЦБ);
			СписокБумаг.Очистить();
			КодРудатаЦБ.Очистить();
			СтоимостьКупона.Очистить();
		КонецЕсли;
	КонецЦикла;
	Если СписокБумаг.Количество() > 0 Тогда 
		ОбработатьПолученныеНКД(СписокБумаг, СтоимостьКупона, КурсыВалют, ТекущаяДата, КодРуДатаЦБ);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработатьПолученныеНКД(СписокБумаг, СтоимостьКупона, КурсыВалют, ТекущаяДата, КодРуДатаЦБ)
	
	HTTPОтвет = ДанныеМетодаЗагрузитьНКД(СписокБумаг, ТекущаяДата);
	Если Не ЗначениеЗаполнено(HTTPОтвет) Тогда
		Возврат;
	КонецЕсли;
	ИнтерфаксРуДата = Справочники.ИнформационноАналитическиеСистемы.Интерфакс;
	Для Каждого Ответ Из HTTPОтвет Цикл
		
		Стоимость = Ответ.accruedInterest;
		Если Не ЗначениеЗаполнено(Стоимость) Тогда
			Стоимость = СтоимостьКупона[Ответ.fintoolId];
		КонецЕсли;
		
		Если Стоимость = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.НКД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДата);
		НаборЗаписей.Отбор.Биржа.Установить(ИнтерфаксРуДата);
		НаборЗаписей.Отбор.ЦеннаяБумага.Установить(КодРудатаЦБ[Ответ.fintoolId]);
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДата;
		НоваяЗапись.Биржа = ИнтерфаксРуДата;
		НоваяЗапись.ЦеннаяБумага = КодРудатаЦБ[Ответ.fintoolId];
		НоваяЗапись.AccInt = Стоимость;
		Попытка
			НоваяЗапись.Nkd = Стоимость * КурсыВалют[Ответ.accruedInterestCurrency];
		Исключение
			НоваяЗапись.Nkd = 0;
		КонецПопытки;
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОбращаемостьСпискаЦБИзRuDataПоFintoolid(ПараметрыСессии, Дата, МассивИД, ТекстОтказа = Неопределено)
	
	ЛогПолученныхДанных = Неопределено;
	ОставитьЗаписьВЖурналеРегистрацииВызовов = Ложь;
	
	Отказ = ПараметрыСессии.Отказ;
	ТекстОтказа = ПараметрыСессии.ТекстОтказа;
	Сессия = ПараметрыСессии.Сессия;
	
	ПараметрыМетода = Новый Структура();
	ПараметрыМетода.Вставить("date", Формат(Дата, "ДФ=""гггг-ММ-дд"""));
	ПараметрыМетода.Вставить("fintoolIdList", МассивИД);
	params = Новый Массив;
	params.Добавить("ISNEGOTIABILITY");
	ПараметрыМетода.Вставить("params", params);
	
	ПризнакиОбращаемости = ДанныеМетода_V2_Risk_FintoolsRiskGroupParams(ПараметрыМетода, Отказ, ТекстОтказа,
		ЛогПолученныхДанных, Сессия, ОставитьЗаписьВЖурналеРегистрацииВызовов);
		
	Если Отказ Тогда
		Возврат Неопределено;
	Иначе
		Возврат ПризнакиОбращаемости;
	КонецЕсли;
	
КонецФункции

Процедура ЗагрузитьДанныеПоОбращаемостиЦБНаДату(ПараметрыСессии, Дата, Isins)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки
	|ПОМЕСТИТЬ ЦенныеБумаги
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|ГДЕ
	|	НЕ ЦенныеБумаги.ПометкаУдаления
	|	И ЦенныеБумаги.ISIN <> """"
	|	И &ОтборПоЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ОбращаемостьЦБСрезПоследних.МестоОбращаемости КАК МестоОбращаемостиСтарое,
	|	КодыЗагрузки.Код КАК КодРуДата,
	|	ВЫРАЗИТЬ((ЦенныеБумаги.НомерСтроки + 49) / 100 КАК ЧИСЛО(10, 0)) КАК Группировка
	|ИЗ
	|	ЦенныеБумаги КАК ЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбращаемостьЦБ.СрезПоследних(&Дата, 1 = 1) КАК ОбращаемостьЦБСрезПоследних
	|		ПО ЦенныеБумаги.ЦеннаяБумага = ОбращаемостьЦБСрезПоследних.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ЦенныеБумаги.ЦеннаяБумага = КодыЗагрузки.Владелец
	|ГДЕ
	|	ВЫРАЗИТЬ(КодыЗагрузки.Биржа КАК Справочник.КлассификаторыЗагрузки).Ссылка = &RuData
	|	И КодыЗагрузки.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА КодыЗагрузки.ДатаНачалаДействия <= &Дата
	|				ТОГДА ИСТИНА
	|			КОГДА КодыЗагрузки.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА КодыЗагрузки.ДатаОкончанияДействия > &Дата
	|				ТОГДА ИСТИНА
	|			КОГДА КодыЗагрузки.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Группировка,
	|	КодРуДата
	|ИТОГИ
	|	КОЛИЧЕСТВО(ЦеннаяБумага)
	|ПО
	|	Группировка";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("RuData",	 Справочники.КлассификаторыЗагрузки.RuData);
	Если ЗначениеЗаполнено(Isins) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПоЦБ", "И ЦенныеБумаги.ISIN В (&ISIN)");
		Запрос.УстановитьПараметр("ISIN", Isins);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПоЦБ", "");
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		ВыборкаДетали = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		МассивКодовРуДата = Новый Массив();
		ДанныеЗапроса = Новый Соответствие;
		
		Пока ВыборкаДетали.Следующий() Цикл
			КодРуДаты = СокрЛП(ВыборкаДетали.КодРуДата);
			МассивКодовРуДата.Добавить(КодРуДаты);
			СтруктураЦБ = Новый Структура;
			СтруктураЦБ.Вставить("ЦеннаяБумага", ВыборкаДетали.ЦеннаяБумага);
			СтруктураЦБ.Вставить("МестоОбращаемостиСтарое", ВыборкаДетали.МестоОбращаемостиСтарое);
			ДанныеЗапроса.Вставить(КодРуДаты, СтруктураЦБ);
		КонецЦикла;
		
		ПризнакиОбращаемостиЦБ = ПолучитьОбращаемостьСпискаЦБИзRuDataПоFintoolid(ПараметрыСессии, Дата, МассивКодовРуДата);
		Если ПризнакиОбращаемостиЦБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого стр Из ПризнакиОбращаемостиЦБ Цикл
			ПризнакОбращаемостиЦБ = стр.params[0].param;
			МестоОбращаемостиЦБНовое = Перечисления.МестаОбращаемостиЦБ.МестоОбращаемостиЦБ(ПризнакОбращаемостиЦБ);
			
			КодРуДаты = СокрЛП(СтрЗаменить(стр.fintoolId, Символы.НПП, ""));
			КодРуДаты = СокрЛП(СтрЗаменить(КодРуДаты, ",", ""));
			строкаЦБ = ДанныеЗапроса.Получить(КодРуДаты);
			
			Если строкаЦБ = Неопределено Тогда
				Комментарий = "Не найдена ЦБ для установки признака обращаемости по fintoolId: [" + стр.fintoolId + "]";
				ЗаписьЖурналаРегистрации("RuData", УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
				Продолжить;
			КонецЕсли;
			
			МестоОбращаемостиСтарое = строкаЦБ.МестоОбращаемостиСтарое;
			ЦеннаяБумага = строкаЦБ.ЦеннаяБумага;
			УстановитьПризнакОбращаемостиЦБ(ПараметрыСессии, Дата, ЦеннаяБумага, МестоОбращаемостиСтарое, МестоОбращаемостиЦБНовое);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПризнакОбращаемостиЦБ(ПараметрыСессии, Дата, ЦеннаяБумага, МестоОбращаемостиСтарое, МестоОбращаемостиЦБНовое)
	Если МестоОбращаемостиСтарое = NULL Или МестоОбращаемостиСтарое <> МестоОбращаемостиЦБНовое Тогда
		МенеджерЗаписи = РегистрыСведений.ОбращаемостьЦБ.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = Дата;
		МенеджерЗаписи.ЦеннаяБумага = ЦеннаяБумага;
		МенеджерЗаписи.МестоОбращаемости = МестоОбращаемостиЦБНовое;
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры

#Область ФильтрыЗапроса

Функция InfoSecurities_Фильтр(ВходныеПараметры)
	ОператорAND = " AND ";
	Условие = "";
	
	Если СвойствоЗаполнено(ВходныеПараметры, "ДатаВремяОбновленияДанных") Тогда
		Условие = " update_date > #" + XMLСтрока(ВходныеПараметры.ДатаВремяОбновленияДанных) + ".0000000Z#";
	КонецЕсли;
		
	Если СвойствоЗаполнено(ВходныеПараметры, "fintoolids") Тогда
		FintoolidsСтрокой = СтрокаДляФильтраRuData(ВходныеПараметры.fintoolids, Истина);
		Условие = Условие + ?(ПустаяСтрока(Условие), "", ОператорAND) + " fintoolid IN ( " + FintoolidsСтрокой + ")";
	Иначе
		Если Не ВходныеПараметры.Свойство("fintoolids") И СвойствоЗаполнено(ВходныеПараметры, "ISINs") Тогда
			ISINsСтрокой = СтрокаДляФильтраRuData(ВходныеПараметры.ISINs);
			Условие = Условие + ?(ПустаяСтрока(Условие), "", ОператорAND) + " isin IN ( " + ISINsСтрокой + ")";
			// Пустые ISIN тоже принимаем, в противном случае будет условие: Иначе Условие = Условие + " isin IS NOT NULL AND ";
		КонецЕсли;
	КонецЕсли;
	
	Если СвойствоЗаполнено(ВходныеПараметры, "ФильтрСтатусовЦБ") Тогда
		ФильтрСтатусовЦБ = ВходныеПараметры.ФильтрСтатусовЦБ;
	Иначе
		ФильтрСтатусовЦБ = Неопределено;
	КонецЕсли;
	ОбновитьБумагиВНеактуальномСтатусе = ВходныеПараметры.Свойство("ОбновитьБумагиВНеактуальномСтатусе") 
											И ВходныеПараметры.ОбновитьБумагиВНеактуальномСтатусе;
	Если Не ОбновитьБумагиВНеактуальномСтатусе И ФильтрСтатусовЦБ <> "" Тогда
		Если ФильтрСтатусовЦБ = Неопределено Тогда
			ФильтрСтатусовЦБ = ФильтрПоАктуальнымСтатусамЦБ();
		КонецЕсли;
		Условие = Условие + ?(ПустаяСтрока(Условие), "", ОператорAND) + " status_name IN (" + ФильтрСтатусовЦБ + " ) ";
	КонецЕсли;
	
	Возврат Условие;
КонецФункции

Функция InfoFintoolReferenceData_Фильтр(ДатаВремяОбновленияДанных, fintoolids = Неопределено)
	Если ЗначениеЗаполнено(ДатаВремяОбновленияДанных) Тогда
		Условие = " update_time > #" + XMLСтрока(ДатаВремяОбновленияДанных) + ".0000000Z#";
	Иначе
		Условие = "";
	КонецЕсли;
	
	Если fintoolids <> Неопределено И fintoolids.Количество() > 0 Тогда
		fintoolidsStr = СтрокаДляФильтраRuData(fintoolids, Истина);
		Условие = Условие + ?(ПустаяСтрока(Условие), "", " AND ") + " fintoolid IN ( " + fintoolidsStr + ") ";
	КонецЕсли;
	
	Возврат Условие;
КонецФункции

Функция InfoFintoolClassification_Фильтр(ВходныеПараметры)
	Если ВходныеПараметры.Свойство("filter") И ЗначениеЗаполнено(ВходныеПараметры.filter) Тогда
		Условие = ВходныеПараметры.filter;
	Иначе
		Условие = "";
	КонецЕсли;
	
	Если СвойствоЗаполнено(ВходныеПараметры, "fintoolids") Тогда
		FintoolidsСтрокой = СтрокаДляФильтраRuData(ВходныеПараметры.fintoolids, Истина);
		Условие = Условие + ?(ПустаяСтрока(Условие), "", " AND ") + " fintoolid IN ( " + FintoolidsСтрокой + ")";
	КонецЕсли;
	
	Возврат Условие;
КонецФункции

Функция BondAmortizations_Фильтр(ВходныеПараметры)
	Если СвойствоЗаполнено(ВходныеПараметры, "filter") Тогда
		Условие = ВходныеПараметры.filter;
	Иначе
		Условие = "";
	КонецЕсли;
	
	Если СвойствоЗаполнено(ВходныеПараметры, "ДатаВремяОбновленияДанных") Тогда
		Условие = Условие + ?(ПустаяСтрока(Условие), "", " AND ");
		Условие = Условие + " update_date > #" + XMLСтрока(ВходныеПараметры.ДатаВремяОбновленияДанных) + ".0000000Z#";
	КонецЕсли;
	
	Если СвойствоЗаполнено(ВходныеПараметры, "fintoolids") Тогда
		FintoolidsСтрокой = СтрокаДляФильтраRuData(ВходныеПараметры.fintoolids, Истина);
		Условие = Условие + ?(ПустаяСтрока(Условие), "", " AND ") + " id_fintool IN ( " + FintoolidsСтрокой + ")";
	КонецЕсли;
	
	Возврат Условие;
КонецФункции

Функция NsdCommonData_Фильтр(ВходныеПараметры)
	Если СвойствоЗаполнено(ВходныеПараметры, "filter") Тогда
		Условие = ВходныеПараметры.filter;
	Иначе
		Условие = "";
	КонецЕсли;
	
	Если СвойствоЗаполнено(ВходныеПараметры, "ДатаВремяОбновленияДанных") Тогда
		Условие = Условие + ?(ПустаяСтрока(Условие), "", " AND ");
		Условие = Условие + " update_date > #" + XMLСтрока(ВходныеПараметры.ДатаВремяОбновленияДанных) + ".0000000Z#";
	КонецЕсли;

	Если СвойствоЗаполнено(ВходныеПараметры, "nrdcodes") Тогда
		nrdcodesStr = СтрокаДляФильтраRuData(ВходныеПараметры.nrdcodes);
		Условие = Условие + ?(ПустаяСтрока(Условие), "", " AND ") + " nrdcode IN ( " + nrdcodesStr + ") ";
	КонецЕсли;
	
	Возврат Условие;
КонецФункции

Функция EmitentList_Фильтр(ДатаВремяОбновленияДанных, fininstids = Неопределено)
	
	Если ЗначениеЗаполнено(ДатаВремяОбновленияДанных) Тогда
		Условие = " update_date > #" + XMLСтрока(ДатаВремяОбновленияДанных) + ".0000000Z#";
	Иначе
		Условие = "";
	КонецЕсли;
	
	Если fininstids <> Неопределено И fininstids.Количество() > 0 Тогда
		fininstidsStr = "";
		Для Индекс = 0 По fininstids.ВГраница() Цикл
			fininstidsStr = fininstidsStr + ?(Индекс = 0, "", ",") + Формат(1 * fininstids[Индекс], "ЧГ=0");
		КонецЦикла;
		Условие = Условие + ?(ПустаяСтрока(Условие), "", " AND ") + " fininstid IN ( " + fininstidsStr + ") ";
	КонецЕсли;
	
	Возврат Условие;
	
КонецФункции

Функция СтрокаДляФильтраRuData(Массив, ЭтоЦелыеЧисла = Ложь)
	СтрокаДляФильтра = "";
	ТипЧисло = Тип("Число");
	Для Каждого Элемент Из Массив Цикл
		Если Не ПустаяСтрока(СтрокаДляФильтра) Тогда
			СтрокаДляФильтра = СтрокаДляФильтра + ", ";
		КонецЕсли;
		Если ЭтоЦелыеЧисла И ТипЗнч(Элемент) = ТипЧисло Тогда
			СтрЭлемент = Формат(1 * Элемент, "ЧГ=0");
		Иначе
			СтрЭлемент = Элемент;
		КонецЕсли;
		СтрокаДляФильтра = СтрокаДляФильтра + "'" + СтрЭлемент + "'";
	КонецЦикла;
	
	Возврат СтрокаДляФильтра;
КонецФункции

#КонецОбласти


#Область API

Функция ТокенАвторизации()
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.ТокенRuDataAPI) Тогда
		
		Возврат ПараметрыСеанса.ТокенRuDataAPI;
		
	Иначе
		
		ОписаниеОшибки = "";
		
		Подключить(ОписаниеОшибки);
		
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			
			Возврат "";
			
		Иначе
			
			Возврат ПараметрыСеанса.ТокенRuDataAPI;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ПараметрыИсточника()
	
	Источник = ПланыВидовХарактеристик.ВнешниеИсточники.ЗагрузкаИзВнешнейAPIRuData;
	
	Если ТестированиеVanessa.ЭтоТест() Тогда
		Настройка = Неопределено;
	Иначе
		Настройка = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(Источник).Настройка;
	КонецЕсли;
	
	СтруктураНастроек = Новый Структура;
	
	Если ЗначениеЗаполнено(Настройка) Тогда
		СтруктураНастроек.Вставить("HTTPСервисАдресСервера"								, Настройка.HTTPСервисАдресСервера);
		СтруктураНастроек.Вставить("HTTPСервисПорт"										, Настройка.HTTPСервисПорт);
		СтруктураНастроек.Вставить("HTTPСервисТаймаут"									, Настройка.HTTPСервисТаймаут);
		СтруктураНастроек.Вставить("HTTPСервисЗащищенноеСоединение"						, Настройка.HTTPСервисЗащищенноеСоединение);
		СтруктураНастроек.Вставить("HTTPСервисПользователь"								, Настройка.HTTPСервисПользователь);
		СтруктураНастроек.Вставить("HTTPСервисПароль"									, Настройка.HTTPСервисПароль);
		СтруктураНастроек.Вставить("HTTPСервисАдресРесурсаАутентификации"				, Настройка.HTTPСервисАдресРесурсаАутентификации);
		СтруктураНастроек.Вставить("HTTPСервисАдресРесурса"								, Настройка.HTTPСервисАдресРесурса);
	Иначе
		СтруктураНастроек.Вставить("HTTPСервисАдресСервера"								, "ServerRuDataAPI");
		СтруктураНастроек.Вставить("HTTPСервисПорт"										, 0);
		СтруктураНастроек.Вставить("HTTPСервисТаймаут"									, 0);
		СтруктураНастроек.Вставить("HTTPСервисЗащищенноеСоединение"						, Истина);
		СтруктураНастроек.Вставить("HTTPСервисПользователь"								, "");
		СтруктураНастроек.Вставить("HTTPСервисПароль"									, "");
		СтруктураНастроек.Вставить("HTTPСервисАдресРесурсаАутентификации"				, "/v2/Account/Login");
		СтруктураНастроек.Вставить("HTTPСервисАдресРесурса"								, "/v2");
	КонецЕсли;
	
	СтруктураНастроек.Вставить("ПроксиСерверАдрес",			 ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("ПроксиСерверАдрес"));
	СтруктураНастроек.Вставить("ПроксиСерверПорт",			 ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("ПроксиСерверПорт", 3128));
	СтруктураНастроек.Вставить("ПроксиСерверИспользовать",
		ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("ПроксиСерверИспользовать", Ложь));
	
	СтруктураНастроек.Вставить("ИмяИсточника"										, Источник.Наименование);
	
	Возврат СтруктураНастроек;
	
КонецФункции

Функция API_ВыполнитьЗапрос(ИмяМетода, ВходныеПараметры, НастройкиСоединения, URL, СтруктураДляJSON, ДополнительныеПараметры, Сессия)
	
	ОписаниеВызова = РегистрыСведений.ЖурналРегистрацииВызовов.НовоеОписаниеВызова(
		"URL = " + URL,
		"ОбщийМодуль.RuDataAPI." + "API_" + ИмяМетода + ".Page" + ВходныеПараметры.НомерПачки);
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьНачало(ОписаниеВызова);
	
	Комментарий = "";
	Если ВходныеПараметры.Свойство("Комментарий") Тогда
		Комментарий = ВходныеПараметры.Комментарий;
	КонецЕсли;
	
	Accept = "Accept";
	Если Сессия = Неопределено И ДополнительныеПараметры.Свойство("Заголовки") Тогда
		Заголовки = Неопределено;
		ЕстьЗаголовки = ДополнительныеПараметры.Свойство("Заголовки", Заголовки);
		Если ЕстьЗаголовки И Не Заголовки = Неопределено И Заголовки.Получить(Accept) <> Неопределено Тогда
			Сессия = КоннекторHTTP.СоздатьСессию();
			Сессия.Заголовки.Вставить(Accept, ДополнительныеПараметры.Заголовки[Accept]);
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Если ТестированиеVanessa.ЭтоТест() Тогда
			СтруктураВозвратаПоУмолчанию = Новый Массив;
			HTTPОтвет = ИмитаторHTTP(URL, СтруктураДляJSON, СтруктураВозвратаПоУмолчанию);
		Иначе
			HTTPОтвет = КоннекторHTTP.PostJson(URL, СтруктураДляJSON, ДополнительныеПараметры, Сессия);
		КонецЕсли;
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	ИмяСобытия = НастройкиСоединения.ИмяИсточника + ": " + ИмяМетода;
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Событие '%1'; подробности: '%2'",
			ИмяСобытия,
			ОписаниеОшибки);
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОшибку(ОписаниеВызова, ОписаниеОшибки, Комментарий);
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не HTTPОтвет = Неопределено Тогда
		Попытка
			ОписаниеОшибки = HTTPОтвет.Error;
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ОписаниеОшибки = "{Ошибку возвратил RuData}: " + ОписаниеОшибки;
				ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Событие '%1'; подробности: '%2'",
					ИмяСобытия,
					ОписаниеОшибки);
				РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОшибку(ОписаниеВызова, ОписаниеОшибки, Комментарий);
				Возврат Неопределено;
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "";
		КонецПопытки;
	КонецЕсли;
	
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОкончание(ОписаниеВызова, Комментарий);
	Возврат HTTPОтвет;
	
КонецФункции

Функция API_AccountLogin(НастройкиСоединения, ОписаниеОшибки, Сессия)
	
	ИмяМетода = "AccountLogin";
	
	URL = "https://" + НастройкиСоединения.HTTPСервисАдресСервера + НастройкиСоединения.HTTPСервисАдресРесурсаАутентификации;
	
	СтруктураДляJSON = Новый Структура();
	СтруктураДляJSON.Вставить("Login", НастройкиСоединения.HTTPСервисПользователь);
	СтруктураДляJSON.Вставить("Password", НастройкиСоединения.HTTPСервисПароль);
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept", "*/*");
	Заголовки.Вставить("Content-Type", "application/json-patch+json");
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Заголовки", Заголовки);
	Если НастройкиСоединения.ПроксиСерверИспользовать Тогда
		ПроксиСервер = Новый ИнтернетПрокси;
		ПроксиСервер.Установить("https", НастройкиСоединения.ПроксиСерверАдрес, НастройкиСоединения.ПроксиСерверПорт);
		ДополнительныеПараметры.Вставить("Прокси", ПроксиСервер);
	КонецЕсли;
	
	// --> ЖурналРегистрацииВызовов
	ОписаниеВызова = РегистрыСведений.ЖурналРегистрацииВызовов.НовоеОписаниеВызова(
		"URL = " + URL,
		"ОбщийМодуль.RuDataAPI." + "API_AccountLogin");
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьНачало(ОписаниеВызова);
	// <--
	
	Попытка
		Если ТестированиеVanessa.ЭтоТест() Тогда
			СтруктураВозвратаПоУмолчанию = Новый Соответствие;
			СтруктураВозвратаПоУмолчанию.Вставить("token", "Vanessa");
			HTTPОтвет = ТестированиеVanessa.ТестовыеДанные("RuDataAPI.API_AccountLogin", СтруктураВозвратаПоУмолчанию);
		Иначе
			HTTPОтвет = КоннекторHTTP.PostJson(URL, СтруктураДляJSON, ДополнительныеПараметры, Сессия);
		КонецЕсли;
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	ИмяСобытия = НастройкиСоединения.ИмяИсточника + ": " + ИмяМетода;
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда // Описание ошибки
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Событие '%1'; подробности: '%2'",
			ИмяСобытия,
			ОписаниеОшибки);
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОшибку(ОписаниеВызова, ОписаниеОшибки); // <--> ЖурналРегистрацииВызовов
		Возврат "";
	КонецЕсли;
	
	Токен = HTTPОтвет["token"];
	
	Если Токен = Неопределено Тогда
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Событие '%1'; Ошибка '%2'; подробности: '%3'",
			ИмяСобытия,
			"Токен не может быть возвращен",
			"Неопределенная ошибка");
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОшибку(ОписаниеВызова, ОписаниеОшибки); // <--> ЖурналРегистрацииВызовов
		Возврат "";
	КонецЕсли;
	
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОкончание(ОписаниеВызова);
	Возврат "Bearer " + Токен;
	
КонецФункции

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off
// BSLLS:NestedStatements-off
Функция API_ПолучитьОтветМетода(ИмяМетода, ПутьКМетоду, ВходныеПараметры, НастройкиСоединения, ОписаниеОшибки, Сессия)
	// Поддерживаемые методы RuData API:
	//	 DictionaryCountries		 - https://docs.efir-net.ru/dh2/#/Dictionary/Countries
	//	 InfoCurrencies				 - https://docs.efir-net.ru/dh2/#/Info/Currencies
	//	 InfoSecurities				 - https://docs.efir-net.ru/dh2/#/Info/Securities
	//	 InfoFintoolReferenceData	 - https://docs.efir-net.ru/dh2/#/Info/FintoolReferenceData
	//	 NsdCommonData				 - https://docs.efir-net.ru/dh2/#/Nsd/CommonData
	//	 EmitentList				 - https://docs.efir-net.ru/dh2/#/Info/Emitent/List
	//	 BondTimeTable				 - https://docs.efir-net.ru/dh2/#/Bond/TimeTable
	//	 BondAmortizations			 - https://docs.efir-net.ru/dh2/#/Bond/Amortizations 
	//									(не путать с https://docs.efir-net.ru/dh2/#/Bond/_fintoolId__Amortizations)
	//	 InfoEmitentCategoryValue	 - https://docs.efir-net.ru/dh2/#/Info/emitent-category-value
	//	 InfoEmitentClassification	 - https://docs.efir-net.ru/dh2/#/Info/EmitentClassification
	//	 InfoFintoolClassification	 - https://docs.efir-net.ru/dh2/#/Info/FintoolClassification
	//	 InfoFintoolReferenceData_nominaltype	 - https://docs.efir-net.ru/dh2/#/Info/FintoolReferenceData
	//	 InfoFintoolCategoryValue	 - https://docs.efir-net.ru/dh2/#/Info/fintool-category-value
	
	Таймаут = 30; // Таймаут по-умолчанию ожидания ответа от RuData API = 30 секунд
	
	ИмяПараметраFilter		 = "filter";
	ИмяПараметраFields		 = "fields";
	ИмяПараметраPageNum		 = "pageNum";
	ИмяПараметраPageSize	 = "pageSize";
	
	Токен = ТокенАвторизации();
	Если Не ЗначениеЗаполнено(Токен) Тогда // нет возможности дальше продолжать
		Возврат Неопределено;
	КонецЕсли;
	
	URL = "https://" + НастройкиСоединения.HTTPСервисАдресСервера + НастройкиСоединения.HTTPСервисАдресРесурса + ПутьКМетоду;
	
	СтруктураДляJSON = Новый Структура();
	Если ИмяМетода = "InfoSecurities" Тогда
		Если ВходныеПараметры.Свойство("ФильтрСтатусовЦБ") И ЗначениеЗаполнено(ВходныеПараметры.ФильтрСтатусовЦБ) Тогда
			ФильтрСтатусовЦБ = ВходныеПараметры.ФильтрСтатусовЦБ;
		Иначе
			ФильтрСтатусовЦБ = Неопределено;
		КонецЕсли;
		filter = InfoSecurities_Фильтр(ВходныеПараметры);
		СтруктураДляJSON.Вставить(ИмяПараметраFilter, filter);
		СтруктураДляJSON.Вставить(ИмяПараметраPageNum, ВходныеПараметры.pageNum);
		СтруктураДляJSON.Вставить(ИмяПараметраPageSize, ВходныеПараметры.pageSize);	
		ВходныеПараметры.Вставить("Комментарий", filter);
	КонецЕсли;
	Если ИмяМетода = "InfoFintoolReferenceData" Тогда
		filter = InfoFintoolReferenceData_Фильтр(ВходныеПараметры.ДатаВремяОбновленияДанных, ВходныеПараметры.fintoolids);
		СтруктураДляJSON.Вставить(ИмяПараметраFilter, filter);
		pager = Новый Структура;
		pager.Вставить("page", ВходныеПараметры.pageNum);
		pager.Вставить("size", ВходныеПараметры.pageSize);
		СтруктураДляJSON.Вставить("pager", pager);
		ТолькоFintoolid = ВходныеПараметры.Свойство("ТолькоFintoolid") И ВходныеПараметры.ТолькоFintoolid;
		fields = InfoFintoolReferenceDataРеквизиты(ТолькоFintoolid);
		СтруктураДляJSON.Вставить(ИмяПараметраFields, fields);
		sort = Новый Структура;
		sort.Вставить("field", "fintoolid");
		sort.Вставить("ascending", Истина);
		СтруктураДляJSON.Вставить("sort", sort);
	КонецЕсли;
	Если ИмяМетода = "NsdCommonData" Тогда
		filter = NsdCommonData_Фильтр(ВходныеПараметры);
		СтруктураДляJSON.Вставить(ИмяПараметраFilter, filter);
		СтруктураДляJSON.Вставить(ИмяПараметраPageNum, ВходныеПараметры.pageNum);
		СтруктураДляJSON.Вставить(ИмяПараметраPageSize, ВходныеПараметры.pageSize);
	КонецЕсли;
	Если ИмяМетода = "EmitentList" Тогда
		filter = EmitentList_Фильтр(ВходныеПараметры.ДатаВремяОбновленияДанных, ВходныеПараметры.fininstids);
		СтруктураДляJSON.Вставить(ИмяПараметраFilter, filter);
		СтруктураДляJSON.Вставить("inn_as_string", Истина);
		СтруктураДляJSON.Вставить(ИмяПараметраPageNum, ВходныеПараметры.pageNum);
		СтруктураДляJSON.Вставить(ИмяПараметраPageSize, ВходныеПараметры.pageSize);
	КонецЕсли;
	Если ИмяМетода = "InfoCurrencies" Тогда
		filter = "iso_number is not null";
		МаксимальноеКоличествоСтран = 300;
		СтруктураДляJSON.Вставить(ИмяПараметраFilter, filter);
		СтруктураДляJSON.Вставить(ИмяПараметраPageNum, 1);
		СтруктураДляJSON.Вставить(ИмяПараметраPageSize, МаксимальноеКоличествоСтран);
		СтруктураДляJSON.Вставить("withKKV", False);
	КонецЕсли;
	Если ИмяМетода = "BondTimeTable" Тогда
		Таймаут = 60; // Увеличим таймаут, так как pageSize = 1000 элементов вместо 100
		СтруктураДляJSON.Вставить("ids", ВходныеПараметры.ids);
		СтруктураДляJSON.Вставить("eventTypes", ВходныеПараметры.eventTypes);
		fields = BondTimeTableРеквизиты();
		СтруктураДляJSON.Вставить(ИмяПараметраFields, fields);
		СтруктураДляJSON.Вставить("isShowDefault", Ложь);
		СтруктураДляJSON.Вставить("sortDesc", Ложь);
		СтруктураДляJSON.Вставить(ИмяПараметраPageNum, ВходныеПараметры.pageNum);
		СтруктураДляJSON.Вставить(ИмяПараметраPageSize, ВходныеПараметры.pageSize);
	КонецЕсли;
	Если ИмяМетода = "BondAmortizations" Тогда
		МаксимальноеКоличествоЗаписей = 100;
		filter = BondAmortizations_Фильтр(ВходныеПараметры);
		СтруктураДляJSON.Вставить(ИмяПараметраFilter, filter);
		СтруктураДляJSON.Вставить(ИмяПараметраPageNum, ВходныеПараметры.pageNum);
		СтруктураДляJSON.Вставить(ИмяПараметраPageSize, МаксимальноеКоличествоЗаписей);
	КонецЕсли;
	Если ИмяМетода = "InfoEmitentCategoryValue" Тогда
		МаксимальноеКоличествоЗаписей = 100;
		СтруктураДляJSON.Вставить("filterCategory", ВходныеПараметры.filter);
		СтруктураДляJSON.Вставить(ИмяПараметраPageNum, ВходныеПараметры.НомерПачки);
		СтруктураДляJSON.Вставить(ИмяПараметраPageSize, МаксимальноеКоличествоЗаписей);
		СтруктураДляJSON.Вставить("onlyEmitentsWithCategory", Истина);
	КонецЕсли;
	Если ИмяМетода = "InfoEmitentClassification" Тогда
		МаксимальноеКоличествоЗаписей = 100;
		СтруктураДляJSON.Вставить(ИмяПараметраFilter, ВходныеПараметры.filter);
		СтруктураДляJSON.Вставить(ИмяПараметраPageNum, ВходныеПараметры.НомерПачки);
		СтруктураДляJSON.Вставить(ИмяПараметраPageSize, МаксимальноеКоличествоЗаписей);
		СтруктураДляJSON.Вставить("dateFrom", "2000-01-01");
		СтруктураДляJSON.Вставить("dateTo", Формат(ВходныеПараметры.ДатаВремяОбновленияДанных, "ДФ=yyyy-MM-dd"));
	КонецЕсли;
	Если ИмяМетода = "InfoFintoolClassification" Тогда
		МаксимальноеКоличествоЗаписей = 100;
		filter = InfoFintoolClassification_Фильтр(ВходныеПараметры);
		СтруктураДляJSON.Вставить(ИмяПараметраFilter, filter);
		СтруктураДляJSON.Вставить(ИмяПараметраPageNum, ВходныеПараметры.PageNum);
		СтруктураДляJSON.Вставить(ИмяПараметраPageSize, МаксимальноеКоличествоЗаписей);
		СтруктураДляJSON.Вставить("dateFrom", "1900-01-01");
		СтруктураДляJSON.Вставить("dateTo", "2050-01-01");
	КонецЕсли;
	Если ИмяМетода = "InfoFintoolReferenceData_nominaltype" Тогда
		МаксимальноеКоличествоЗаписей = 100;
		СтруктураДляJSON.Вставить(ИмяПараметраFilter, ВходныеПараметры.filter);
		СтруктураДляJSON.Вставить(ИмяПараметраFields, ВходныеПараметры.fields);
		pager = Новый Структура;
		pager.Вставить("page", ВходныеПараметры.НомерПачки);
		pager.Вставить("size", МаксимальноеКоличествоЗаписей);
		СтруктураДляJSON.Вставить("pager", pager);
	КонецЕсли;
	Если ИмяМетода = "InfoFintoolCategoryValue" Тогда
		МаксимальноеКоличествоЗаписей = 100;
		СтруктураДляJSON.Вставить("fintoolIds", ВходныеПараметры.fintoolids);
		СтруктураДляJSON.Вставить("filterOnlySpecifiedCategory", ВходныеПараметры.filterOnlySpecifiedCategory);
		СтруктураДляJSON.Вставить("onlyFintoolsWithCategory", ВходныеПараметры.onlyFintoolsWithCategory);
		СтруктураДляJSON.Вставить(ИмяПараметраPageNum, ВходныеПараметры.pageNum);
		СтруктураДляJSON.Вставить(ИмяПараметраPageSize, ВходныеПараметры.pageSize);
	КонецЕсли;
	
	Заголовки = Новый Соответствие();
	ЭтоМетодJSON = ИмяМетода = "DictionaryCountries"
		Или ИмяМетода = "InfoCurrencies"
		Или ИмяМетода = "BondTimeTable"
		Или ИмяМетода = "BondAmortizations"
		Или ИмяМетода = "InfoEmitentCategoryValue"
		Или ИмяМетода = "InfoEmitentClassification"
		Или ИмяМетода = "InfoFintoolClassification"
		Или ИмяМетода = "InfoFintoolCategoryValue";
		
	Если ЭтоМетодJSON Тогда
		Заголовки.Вставить("Accept", "application/json");
		Заголовки.Вставить("Content-Type", "application/json");
	Иначе
		Заголовки.Вставить("Accept", "*/*");
		Заголовки.Вставить("Content-Type", "application/json-patch+json");
	КонецЕсли;
	Заголовки.Вставить("Authorization", Токен);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Заголовки", Заголовки);
	ДополнительныеПараметры.Вставить("Таймаут", Таймаут);
	ДополнительныеПараметры.Вставить("ПараметрыПреобразованияJSON", Новый Структура("ПрочитатьВСоответствие", Ложь));
	Если НастройкиСоединения.ПроксиСерверИспользовать Тогда
		ПроксиСервер = Новый ИнтернетПрокси;
		ПроксиСервер.Установить("https", НастройкиСоединения.ПроксиСерверАдрес, НастройкиСоединения.ПроксиСерверПорт);
		ДополнительныеПараметры.Вставить("Прокси", ПроксиСервер);
	КонецЕсли;
	
	HTTPОтвет = API_ВыполнитьЗапрос(ИмяМетода, ВходныеПараметры, НастройкиСоединения, URL, СтруктураДляJSON, ДополнительныеПараметры, Сессия);
	
	Возврат HTTPОтвет;
	
КонецФункции
// BSLLS:LatinAndCyrillicSymbolInWord-off

#Область ЗагрузкаКотировок_МетодыAPI_ВспомогательныеПроцедуры

Функция ПолучитьДанныеИзСервиса_V2(АдресСервиса, ПараметрыURLЗапроса, Отказ, ТекстОтказа, ЛогПолученныхДанных, // BSLLS:NumberOfParams-off
	СлужебныйВызов, Сессия = Неопределено, ОставитьЗаписьВЖурналеРегистрацииВызовов = Истина, Комментарий = "")
	Перем СчетчикЗапросов;
	Перем ДатаНачалаСерииЗапросов;
	
	Перем Соединение;
	Перем Токен;
	
	ПолученныеДанные			 = Новый Массив;
	ПолученныеДанныеНеопределено = Новый Массив;
	
	Число100					 = 100;
	МаксимальноеЧислоЗапросов	 = 5;
	КодОтвета400				 = 400;
	КодОтвета403				 = 403;
	КодОтветаУспех				 = 200;
	
	Если ПараметрыURLЗапроса.Свойство("dateFrom") Тогда
		Комментарий = ПараметрыURLЗапроса.dateFrom + ?(Комментарий = "", "", "; " + Комментарий);
	КонецЕсли;
	
	// --> ЖурналРегистрацииВызовов
	Если ОставитьЗаписьВЖурналеРегистрацииВызовов Тогда
		ОписаниеВызова = РегистрыСведений.ЖурналРегистрацииВызовов.НовоеОписаниеВызова(
			"URL = " + АдресСервиса,
			"ОбщийМодуль.RuDataAPI.ПолучитьДанныеИзСервиса_V2");
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьНачало(ОписаниеВызова);
	Иначе
		ОписаниеВызова = Неопределено;
	КонецЕсли;
	// <--
	
	Если Сессия = Неопределено Тогда
		ПодключитьсяКСервису(Соединение, Токен, Отказ, ТекстОтказа, СлужебныйВызов, Сессия);
	Иначе
		Токен = ПараметрыСеанса.ТокенRuDataAPI;
		Соединение = КешСоединения(Сессия);
	КонецЕсли;
	
	Если Отказ Тогда
		ПолучитьДанныеИзСервиса_V2_ЗафиксироватьОшибку(ОписаниеВызова, ТекстОтказа, Комментарий, АдресСервиса);
		Возврат ПолученныеДанныеНеопределено;
	КонецЕсли;
	
	ПолучениеДанных = Истина;
	ПолученоСтрок = 0;
	counter = 0;
	Если ПараметрыURLЗапроса.Свойство("pageNum") = Истина Тогда
		pageNum = ПараметрыURLЗапроса.pageNum;
	Иначе
		pageNum = 1;
	КонецЕсли;
	Страницы = ПараметрыURLЗапроса.Свойство("pageNum") = Истина И ПараметрыURLЗапроса.Свойство("pageSize") = Истина;
	
	Пока ПолучениеДанных = Истина И pageNum < Число100 Цикл
		
		// ASP-108335 Проверка, что бы не было больше 5 запросов в секунду.
		Если Не ЗначениеЗаполнено(ДатаНачалаСерииЗапросов) Или Не ЗначениеЗаполнено(СчетчикЗапросов) Тогда
			ДатаНачалаСерииЗапросов = ТекущаяДатаСеанса();
			СчетчикЗапросов = 0;
		КонецЕсли;
		
		Если СчетчикЗапросов = МаксимальноеЧислоЗапросов Тогда
			КонДата = ДатаНачалаСерииЗапросов + 1;
			Пока ТекущаяДатаСеанса() < КонДата Цикл
				ВременнаяПеременная = 1; // BSLLS:UnusedLocalVariable-off
			КонецЦикла;
			СчетчикЗапросов = 1;
		Иначе
			СчетчикЗапросов = СчетчикЗапросов + 1;
		КонецЕсли;
		// }
		
		Если Страницы Тогда
			ПараметрыURLЗапроса.pageNum = pageNum;
		КонецЕсли;
		
		// Получаем данные из сервиса
		КодСостояния = 0;
		СтрокаОтвета = "";
		
		Попытка
			Ответ = Соединение.ОтправитьДляОбработки(
				HTTPЗапросМетодPOST_V2(Токен, АдресСервиса, ПараметрыURLЗапроса, ЛогПолученныхДанных));
			Если Ответ.КодСостояния = КодОтвета403 Тогда // Если токен просрочен, пробуем переподключиться.
				
				ВыйтиИзСервиса(Соединение, Отказ, ТекстОтказа);
				Сессия = Неопределено;
				ПодключитьсяКСервису(Соединение, Токен, Отказ, ТекстОтказа, СлужебныйВызов, Сессия);
				Если Отказ Тогда
					ПолучитьДанныеИзСервиса_V2_ЗафиксироватьОшибку(ОписаниеВызова, ТекстОтказа, Комментарий, АдресСервиса);
					Возврат ПолученныеДанныеНеопределено;
				КонецЕсли;
				
				Ответ = Соединение.ОтправитьДляОбработки(
					HTTPЗапросМетодPOST_V2(Токен, АдресСервиса, ПараметрыURLЗапроса, ЛогПолученныхДанных));
			КонецЕсли;
			
			// Получаем строку с ответом
			Если ТипЗнч(Ответ) = Тип("HTTPОтвет") Тогда
				КодСостояния	= Ответ.КодСостояния;
				СтрокаОтвета	= Ответ.ПолучитьТелоКакСтроку();
			ИначеЕсли ТипЗнч(Ответ) = Тип("ТекстовыйДокумент") Тогда
				СтрокаОтвета	= Ответ.ПолучитьТекст();
			Иначе
				СтрокаОтвета	= "";
			КонецЕсли;
			
		Исключение
			ТекстОтказа = СтрШаблон(
				НСтр("ru='Не удалось получить данные из сервиса %1. Техническая информация: %2'"), АдресСервиса, ОписаниеОшибки());
			Отказ 	= Истина;
			ПолучитьДанныеИзСервиса_V2_ЗафиксироватьОшибку(ОписаниеВызова, ТекстОтказа, Комментарий, АдресСервиса);
			Возврат ПолученныеДанные;
		КонецПопытки;
		
		// Сохраняем полученные даные в логе
		Если ТипЗнч(ЛогПолученныхДанных) = Тип("ТекстовыйДокумент") Тогда
			ЛогПолученныхДанных.ДобавитьСтроку("Ответ:");
			СтрокаЛога = СтрЗаменить(СтрокаОтвета, "}", "}" + Символы.ПС);
			ЛогПолученныхДанных.ДобавитьСтроку(СтрокаЛога);
		КонецЕсли;
		
		Если КодСостояния = КодОтвета400 И СтрНайти(СтрокаОтвета, "Нет данных по инструменту") > 0 Тогда
			ПолучитьДанныеИзСервиса_V2_ЗафиксироватьОшибку(ОписаниеВызова,
				"Нет данных по инструменту", Комментарий, АдресСервиса);
			Возврат ПолученныеДанные;
		КонецЕсли;
		
		Если Не Ответ.КодСостояния = КодОтветаУспех Тогда
			ТекстОтказа = СтрШаблон(НСтр("ru='Не удалось получить данные из сервиса %1. Код ошибки: %2.'"),
				АдресСервиса, ОписаниеПоКодуОтвета(Ответ.КодСостояния));
			Отказ 	= Истина;
			ПолучитьДанныеИзСервиса_V2_ЗафиксироватьОшибку(ОписаниеВызова, ТекстОтказа, Комментарий, АдресСервиса);
			Возврат ПолученныеДанные;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаОтвета) Тогда
			
			Попытка
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
				мПолученныеДанные = ПрочитатьJSON(ЧтениеJSON);
				ЧтениеJSON.Закрыть();
			Исключение
				ТекстОтказа = СтрШаблон(НСтр("ru='Не удалось получить данные из сервиса %1. Техническая информация: %2'"),
					АдресСервиса, ОписаниеОшибки());
				Отказ 	= Истина;
				ПолучитьДанныеИзСервиса_V2_ЗафиксироватьОшибку(ОписаниеВызова, ТекстОтказа, Комментарий, АдресСервиса);
				Возврат ПолученныеДанные;
			КонецПопытки;
			
			Если ТипЗнч(мПолученныеДанные) = Тип("Структура") Тогда
				
				ПолученныеДанные.Добавить(мПолученныеДанные);
				ПолученоСтрок = ПолученоСтрок + 1;
				Если Страницы И counter = 0 И мПолученныеДанные.Свойство("counter") Тогда
					counter = мПолученныеДанные.counter;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(мПолученныеДанные) = Тип("Массив") Тогда
				
				Для Каждого Значение Из мПолученныеДанные Цикл
					ПолученныеДанные.Добавить(Значение);
					ПолученоСтрок = ПолученоСтрок + 1;
					Если Страницы И counter = 0 И Значение.Свойство("counter") Тогда
						counter = Значение.counter;
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли ТипЗнч(мПолученныеДанные) = Тип("Соответствие") Тогда
				ПолученныеДанные.Добавить(мПолученныеДанные);
			Иначе
				ТекстОтказа = СтрШаблон(НСтр("ru='Не удалось получить данные из сервиса %1. Тип данных: %2 не поддерживается'"),
					АдресСервиса, ТипЗнч(мПолученныеДанные));
				Отказ 	= Истина;
				ПолучитьДанныеИзСервиса_V2_ЗафиксироватьОшибку(ОписаниеВызова, ТекстОтказа, Комментарий, АдресСервиса);
				Возврат ПолученныеДанные;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Страницы И counter > ПолученоСтрок Тогда
			ПолучениеДанных = Истина;
		Иначе
			ПолучениеДанных = Ложь;
		КонецЕсли;
		
		pageNum = pageNum + 1;
		
	КонецЦикла;
	
	Если ОставитьЗаписьВЖурналеРегистрацииВызовов Тогда
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОкончание(ОписаниеВызова, Комментарий);
	КонецЕсли;
	
	Возврат ПолученныеДанные;
	
КонецФункции

Процедура ПолучитьДанныеИзСервиса_V2_ЗафиксироватьОшибку(ОписаниеВызова, ТекстОтказа, Комментарий, АдресСервиса)
	
	Если ОписаниеВызова = Неопределено Тогда
		ОписаниеВызова = РегистрыСведений.ЖурналРегистрацииВызовов.НовоеОписаниеВызова(
			"URL = " + АдресСервиса,
			"ОбщийМодуль.RuDataAPI.ПолучитьДанныеИзСервиса_V2");
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьНачало(ОписаниеВызова);
	КонецЕсли;
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОшибку(ОписаниеВызова, ТекстОтказа, Комментарий);
	
КонецПроцедуры

// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on
// BSLLS:NestedStatements-on

Функция КешСоединения(Сессия)
	
	Если Сессия.Свойство("СлужебныеДанные") Тогда
		Для Каждого Пул Из Сессия.СлужебныеДанные.ПулСоединений Цикл
			Возврат Пул.Значение;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция HTTPЗапросМетодPOST_V2(Токен, АдресСервиса, ПараметрыURLЗапроса, ЛогПолученныхДанных = Неопределено)
	
	ЗаголовкиЗапроса	= Новый Соответствие;
	ЗаголовкиЗапроса.Вставить("Accept", 		"application/json");
	ЗаголовкиЗапроса.Вставить("Authorization", 	Токен);
	ЗаголовкиЗапроса.Вставить("Content-Type", 	"application/json");
	
	ЗапросМетодPOST = Новый HTTPЗапрос;
	ЗапросМетодPOST.АдресРесурса = АдресСервиса;
	ЗапросМетодPOST.Заголовки = ЗаголовкиЗапроса;
	
	ТелоЗапроса = Новый ЗаписьJSON;
	ТелоЗапроса.УстановитьСтроку();
	
	ТелоЗапроса.ЗаписатьНачалоОбъекта();
	
	Для Каждого ТекПараметр Из ПараметрыURLЗапроса Цикл
		
		ТелоЗапроса.ЗаписатьИмяСвойства(ТекПараметр.Ключ);
		
		Если ТипЗнч(ТекПараметр.Значение) = Тип("Массив") Тогда
			
			ТелоЗапроса.ЗаписатьНачалоМассива();
			
			Для Каждого ТекЗначение Из ТекПараметр.Значение Цикл
				Если ТипЗнч(ТекЗначение) = Тип("Структура")  Тогда
					ДобавитьВТелоЗапросаТипСтруктура(ТелоЗапроса, ТекЗначение);
				Иначе
					ТелоЗапроса.ЗаписатьЗначение(ТекЗначение);
				КонецЕсли;
			КонецЦикла;
			
			ТелоЗапроса.ЗаписатьКонецМассива();
			
		ИначеЕсли ТипЗнч(ТекПараметр.Значение) = Тип("Дата") Тогда
			ТелоЗапроса.ЗаписатьЗначение(XMLСтрока(НачалоДня(ТекПараметр.Значение)) + ".0000000Z");
			
		ИначеЕсли ТипЗнч(ТекПараметр.Значение) = Тип("Структура")  Тогда
			ДобавитьВТелоЗапросаТипСтруктура(ТелоЗапроса, ТекПараметр.Значение);
		Иначе
			ТелоЗапроса.ЗаписатьЗначение(ТекПараметр.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	ТелоЗапроса.ЗаписатьКонецОбъекта();
	СтрокаТелоЗапроса = ТелоЗапроса.Закрыть();
	
	// Сохраняем полученные даные в логе
	Если ТипЗнч(ЛогПолученныхДанных) = Тип("ТекстовыйДокумент") Тогда
		ЛогПолученныхДанных.ДобавитьСтроку("Тело запроса:");
		ЛогПолученныхДанных.ДобавитьСтроку(СтрокаТелоЗапроса);
	КонецЕсли;
	
	ЗапросМетодPOST.УстановитьТелоИзСтроки(СтрокаТелоЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат ЗапросМетодPOST;
	
КонецФункции

Процедура ДобавитьВТелоЗапросаТипСтруктура(ТелоЗапроса, ТекЗначение)

	ТелоЗапроса.ЗаписатьНачалоОбъекта();
	Для Каждого ТекЗначениеСтруктуры Из ТекЗначение Цикл
		ТелоЗапроса.ЗаписатьИмяСвойства(ТекЗначениеСтруктуры.Ключ);
		ТелоЗапроса.ЗаписатьЗначение(ТекЗначениеСтруктуры.Значение);
	КонецЦикла;
	ТелоЗапроса.ЗаписатьКонецОбъекта();

КонецПроцедуры

Функция КодыСостоянияHTTP()
	
	КодыСостояния = Новый Соответствие;
	Для Каждого Описание Из КоннекторHTTP.КодыСостоянияHTTP() Цикл
		КодыСостояния.Вставить(Описание.Значение, Описание.Ключ);
	КонецЦикла;
	
	Возврат КодыСостояния;
	
КонецФункции

Функция ОписаниеПоКодуОтвета(КодОтвета)
	
	СписокКодовОтвета = КодыСостоянияHTTP();
	Описание = Строка(КодОтвета) + " - ";
	
	НайденноеОписание = СписокКодовОтвета[КодОтвета];
	
	Если НайденноеОписание <> Неопределено Тогда
		Описание = Описание + НайденноеОписание;
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

Процедура ДобавитьТекстКСообщению(Сообщение, ДобавляемыйТекст)
	
	Если  ЗначениеЗаполнено(Сообщение) Тогда
		Сообщение = Сообщение + Символы.ПС + ДобавляемыйТекст;
	Иначе
		Сообщение = ДобавляемыйТекст;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОбщиеПараметрыURLЗапроса(ПараметрыURLЗапроса, ВхПараметры, СвойстваМетода = "")
	
	ИмяПараметраPageNum = "pageNum";
	ИмяПараметраPageSize = "pageSize";
	
	Если ВхПараметры.Свойство(ИмяПараметраPageNum) = Ложь И СтрНайти(СвойстваМетода, ИмяПараметраPageNum) > 0 Тогда
		ПараметрыURLЗапроса.Вставить(ИмяПараметраPageNum, 1);
	КонецЕсли;
	
	Если ВхПараметры.Свойство(ИмяПараметраPageSize) = Ложь И СтрНайти(СвойстваМетода, ИмяПараметраPageSize) > 0 Тогда
		ПараметрыURLЗапроса.Вставить(ИмяПараметраPageSize, 300);
	КонецЕсли;
	
	Если СтрНайти(СвойстваМетода, "count") > 0 Тогда
		ПараметрыURLЗапроса.Вставить("count", 100000);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// BSLLS:LatinAndCyrillicSymbolInWord-on

#КонецОбласти

#Область Тестирование

Функция ИмитаторHTTP(URL, СтруктураДляJSON, СтруктураВозвратаПоУмолчанию)
	
	ЭтоSecurities			 = СтрНайти(URL, "Securities") > 0			 И СтруктураДляJSON.pageNum = 1;
	ЭтоFintoolReferenceData	 = СтрНайти(URL, "FintoolReferenceData") > 0 И СтруктураДляJSON.pager.page = 1;
	ЭтоCommonData			 = СтрНайти(URL, "CommonData") > 0			 И СтруктураДляJSON.pageNum = 1;
	ЭтоEmitentList			 = СтрНайти(URL, "Emitent/List") > 0		 И СтруктураДляJSON.pageNum = 1;
	ЭтоCountries			 = СтрНайти(URL, "Countries") > 0;
	
	ПолучитьТестовыеДанные = ЭтоSecurities Или ЭтоFintoolReferenceData Или ЭтоCommonData Или ЭтоEmitentList Или ЭтоCountries;
	
	Если ПолучитьТестовыеДанные Тогда
		XMLHTTPОтвет = ТестированиеVanessa.ТестовыеДанные(URL, СтруктураВозвратаПоУмолчанию);
		HTTPОтвет = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLHTTPОтвет);
	Иначе
		HTTPОтвет = Новый Массив;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(HTTPОтвет) И ТипЗнч(HTTPОтвет) = Тип("ХранилищеЗначения") Тогда
		
		HTTPОтвет = HTTPОтвет.Получить();
		
	КонецЕсли;
	
	Возврат HTTPОтвет;
	
КонецФункции

Процедура ДополнитьИмитаторТаблицыДанныхМетода(ИмяМетода, ВременнаяТаблица)
	
	Если Не ТестированиеVanessa.ЭтоТест() Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяМетода = "InfoFintoolReferenceData" Тогда
		// Добавляем те колонки, которых не оказалось в тестовых данных (файл vsFintoolReferenceData.txt).
		// Это нужно для того чтобы при очередной доработке, когда мы добавляем очередной реквизит, получаемый
		// из RuData не пересоздовать каждый раз vsFintoolReferenceData.txt в тестах.
		Колонки = ВременнаяТаблица.Колонки;
		ТолькоFintoolid = Ложь;
		РеквизитыИИхТипы = InfoFintoolReferenceDataРеквизитыИИхТипы(ТолькоFintoolid);
		Для каждого Реквизит Из РеквизитыИИхТипы Цикл
			Если Колонки.Найти(Реквизит.Имя) = Неопределено И Реквизит.Тип <> Неопределено Тогда
				Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УниверсальныеМетоды

Функция ТипПоИмениРеквизита(ИмяРеквизита, ЧисловыеРеквизиты)
	
	Если ЧисловыеРеквизиты.НайтиПоЗначению(ИмяРеквизита) = Неопределено Тогда
		Возврат Тип("Строка");
	Иначе
		Возврат Тип("Число");
	КонецЕсли;
	
КонецФункции

Функция ЭтоКлючевойРеквизит(ИмяРеквизита)
	Если ИмяРеквизита = "fintoolid"
		Или ИмяРеквизита = "fininstid"
		Или ИмяРеквизита = "base_asset_fintoolid" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Возвращает результат преобразования из массив структур - таблицы значений
//
// Параметры:
//  МассивСтруктур		 - Масив			 - Массив  структур
//  ЧисловыеРеквизиты	 - СписокЗначений	 - Список имен числовых реквизитов
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - преобразованная из массива структур
//
Функция ПреобразоватьМассивВТаблицуЗначений(МассивСтруктур, ЧисловыеРеквизиты) Экспорт
	
	тзДанные = Новый ТаблицаЗначений;
	Для Каждого ЭлементМассива Из МассивСтруктур Цикл
		Если тзДанные.Колонки.Количество() = 0 Тогда
			ПреобразоватьМассивВТаблицуЗначенийКолонки(тзДанные, ЭлементМассива, ЧисловыеРеквизиты);
		КонецЕсли;
		НоваяСтрока = тзДанные.Добавить();
		ПреобразоватьМассивВТаблицуЗначенийСтроки(НоваяСтрока, ЭлементМассива);
	КонецЦикла;
	
	Возврат тзДанные;
КонецФункции

Процедура ПреобразоватьМассивВТаблицуЗначенийКолонки(тзДанные, ЭлементМассива, ЧисловыеРеквизиты)
	
	КС = Новый КвалификаторыСтроки(1000);
	Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
		МассивДопустимыеТипы = Новый Массив;
		
		Если ЭтоКлючевойРеквизит(ЗначениеСтруктуры.Ключ) Тогда
			ТипКолонки = Тип("Строка");
		Иначе
			ТипКолонки = ТипЗнч(ЗначениеСтруктуры.Значение);
		КонецЕсли;
		Если ТипКолонки = Тип("Неопределено") Тогда
			ТипКолонки = ТипПоИмениРеквизита(ЗначениеСтруктуры.Ключ, ЧисловыеРеквизиты);
		КонецЕсли;
		
		МассивДопустимыеТипы.Добавить(ТипКолонки);
		Если ТипКолонки = Тип("Строка") Тогда
			Описание_Типов = Новый ОписаниеТипов(МассивДопустимыеТипы, , , , КС);
		Иначе
			Описание_Типов = Новый ОписаниеТипов(МассивДопустимыеТипы);
		КонецЕсли;
		тзДанные.Колонки.Добавить(ЗначениеСтруктуры.Ключ, Описание_Типов);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПреобразоватьМассивВТаблицуЗначенийСтроки(НоваяСтрока, ЭлементМассива)
	
	Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
		Если ЭтоКлючевойРеквизит(ЗначениеСтруктуры.Ключ) Тогда
			НоваяСтрока[ЗначениеСтруктуры.Ключ] = Формат(ЗначениеСтруктуры.Значение, "ЧГ=0");
		Иначе
			НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает результат конкатенации таблиц значений
//  (должны быть одинаковые колонки)
//
// Параметры:
//  Таблица1					 - ТаблицаЗначений	 - Первая таблица (основная)
//  Таблица2					 - ТаблицаЗначений	 - Вторая таблица (добавляемая)
//  ПоместитьТаблицу2ВТаблицу1	 - Булево			 - Если Истина - то вторая таблица дописывается к первой (Таблица1 - изменяется),
//  													иначе возвращается новая таблица - объединение первой и второй
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - результат конкатенации
//
Функция КонкатенацияТаблицЗначений(Таблица1, Таблица2, ПоместитьТаблицу2ВТаблицу1 = Истина) Экспорт
	Если Таблица1 = Неопределено Или Таблица1.Количество() = 0 Тогда
		Возврат Таблица2;
	КонецЕсли;
	Если Таблица2 = Неопределено Или Таблица2.Количество() = 0 Тогда
		Возврат Таблица1;
	КонецЕсли;
	
	Если ПоместитьТаблицу2ВТаблицу1 Тогда
		ОбъединениеТаблиц = Таблица1;
	Иначе
		ОбъединениеТаблиц = Таблица1.Скопировать();
	КонецЕсли;
	
	Для Каждого Строка Из Таблица2 Цикл
		ЗаполнитьЗначенияСвойств(ОбъединениеТаблиц.Добавить(), Строка);
	КонецЦикла;
	
	Возврат ОбъединениеТаблиц;
КонецФункции

Функция СвойствоЗаполнено(Структура, ИмяСвойства)
	Заполнено = Структура.Свойство(ИмяСвойства) И ЗначениеЗаполнено(Структура[ИмяСвойства]);
	
	Возврат Заполнено;
КонецФункции

#КонецОбласти

#Область ОбработкаОшибок

// Процедура - Добавить уведомление об ошибках загрузки ц биз ru data API
//
// Параметры:
//  ТаблицаОшибок			 - ТаблицаЗначений				 - Таблица произвольного формата с сообщениями об ошибках
//  КлючеваяКолонкаСсылка	 - СправочникСсылка.ЦенныеБумаги - ЦБ
//  ЭтоНовый				 - Булево						 - Признак нового элемента справочника
//  Ошибки					 - Структура					 - Ключ = "ИмяКолонки", Значение = "ТекстСообщения"
//
Процедура ДобавитьУведомлениеОбОшибкахЗагрузкиЦБизRuDataAPI(ТаблицаОшибок, КлючеваяКолонкаСсылка, ЭтоНовый, Ошибки) // BSLLS:Typo-off
	
	Если Ошибки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКлючевойКолонки = "ЦеннаяБумага";
	ТипКлючевойКолонки = Новый ОписаниеТипов("СправочникСсылка.ЦенныеБумаги");
	
	Если ТаблицаОшибок.Колонки.Найти(ИмяКлючевойКолонки) = Неопределено Тогда
		ТаблицаОшибок.Колонки.Добавить("КлючеваяКолонкаКод");
		ТаблицаОшибок.Колонки.Добавить(ИмяКлючевойКолонки, ТипКлючевойКолонки);
		ТаблицаОшибок.Колонки.Добавить("КлючеваяКолонкаISIN");
		ТаблицаОшибок.Колонки.Добавить("Новая");
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура(ИмяКлючевойКолонки, КлючеваяКолонкаСсылка);
	СтрокиОшибок = ТаблицаОшибок.НайтиСтроки(ПараметрыОтбора);
	Если СтрокиОшибок.Количество() = 0 Тогда
		СтрокаОшибки = ТаблицаОшибок.Добавить();
		СтрокаОшибки.КлючеваяКолонкаКод = КлючеваяКолонкаСсылка.Код;
		СтрокаОшибки.ЦеннаяБумага = КлючеваяКолонкаСсылка;
		СтрокаОшибки.КлючеваяКолонкаISIN = КлючеваяКолонкаСсылка.ISIN;
		СтрокаОшибки.Новая = ?(ЭтоНовый = Истина, "Да", "");
	Иначе
		СтрокаОшибки = СтрокиОшибок.Получить(0);
	КонецЕсли;
	
	Для Каждого Элемент Из Ошибки Цикл
		Если ТаблицаОшибок.Колонки.Найти(Элемент.Ключ) = Неопределено Тогда
			ТаблицаОшибок.Колонки.Добавить(Элемент.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент Из Ошибки Цикл
		СтрокаОшибки[Элемент.Ключ] = Элемент.Значение;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправитьУведомлениеОбОшибкахЗагрузкиЦБизRuDataAPI(ТаблицаОшибок, ТекстПисьмаПредопределенный = "") // BSLLS:Typo-off
	
	Если ТестированиеVanessa.ЭтоТест() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТаблицаОшибок) И Не ЗначениеЗаполнено(ТекстПисьмаПредопределенный) Тогда
		Возврат;
	КонецЕсли;
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОбОшибкахЗагрузкиЦБизAPIRuData;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	Если НастройкиОбмена = Неопределено Тогда
		ТекстОшибки = "Не заданы параметры внешнего источника """ + Строка(ВнешнийИсточник) + """";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ИмяСобытия = "RuDataAPI";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ТемаПисьма = "Уведомление об ошибках загрузки ЦБ из RuDataAPI";
	
	ТекстПисьма = "";
	Если ЗначениеЗаполнено(ТекстПисьмаПредопределенный) Тогда
		ТекстПисьма = "" + Символы.ПС + ТекстПисьмаПредопределенный + Символы.ПС + Символы.ПС;
	КонецЕсли;
	ТекстПисьма = ТекстПисьма + ТекстУведомленияОбОшибкахЗагрузкиЦБизRuDataAPI(ТаблицаОшибок);
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("Вложения",			Неопределено);
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.HTML);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
	
КонецПроцедуры

Функция ТекстУведомленияОбОшибкахЗагрузкиЦБизRuDataAPI(ТаблицаОшибок) // BSLLS:Typo-off
	
	ПС = "<br>";		// Тег HTML означает перевод строки
	ВклBold = "<b>";	// Тег HTML означает включить жирный шрифт
	ОтклBold = "</b>";	// Тег HTML означает отключить жирный шрифт
	
	ТекстЗаголовка = "Уведомления об ошибках загрузки ЦБ из RuDataAPI:" + ПС + Символы.ПС;
	Текст = "<html><BODY>" + Символы.ПС
			+ ТекстЗаголовка + ПС + Символы.ПС;
	
	ПараметрыТрансформацииВHTML = Новый Структура;
	ПараметрыТрансформацииВHTML.Вставить("ПунктПорядкуИспользуется", Истина);
	ПараметрыТрансформацииВHTML.Вставить("ЦветШапки", "eadbaf");
	ПараметрыТрансформацииВHTML.Вставить("ШиринаТаблицы", "1500");
	
	ПараметрыТрансформацииВHTML.Вставить("Заголовок1", "Код 1С");
	ПараметрыТрансформацииВHTML.Вставить("Ширина1", "100");
	
	ПараметрыТрансформацииВHTML.Вставить("Заголовок2", "Ценная бумага");
	ПараметрыТрансформацииВHTML.Вставить("Ширина2", "250");
	ПараметрыТрансформацииВHTML.Вставить("Положение2", "right");
	
	ПараметрыТрансформацииВHTML.Вставить("Заголовок3", "ISIN");
	
	ПараметрыТрансформацииВHTML.Вставить("Заголовок4", "Новая");
	
	Если ТаблицаОшибок.Количество() > 0 Тогда
		ТаблицаОшибокHTML = ОбщегоНазначения.ТаблицаЗначенийВТаблицуHTML(ТаблицаОшибок, ПараметрыТрансформацииВHTML);
		Текст = Текст + ВклBold + ПС + ТаблицаОшибокHTML + ОтклBold + ПС + Символы.ПС;
	КонецЕсли;
	
	Текст = Текст + "</BODY></html>";
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#Область ПогашенныеЦБ

Процедура ЗагрузитьЦБЭмитенты(ISINs)
	
	ФильтрСтатусовЦБ = "'Погашен'";
	ДатаНачала = Дата(1, 1, 1);
	
	ВходныеПараметры = Новый Структура;
	ВходныеПараметры.Вставить("ISINs", ISINs);
	ВходныеПараметры.Вставить("ДатаВремяОбновленияДанных", ДатаНачала);
	ВходныеПараметры.Вставить("ОбновитьЭмитентовВсехЗагружаемыхЦБ", Истина);
	ВходныеПараметры.Вставить("ФильтрСтатусовЦБ", ФильтрСтатусовЦБ);
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Начало: " + ТекущаяДатаСеанса());
	УспешноеСозданиеОбновлениеЦенныхБумагИЭмитентов = RuDataAPI.СозданиеОбновлениеЦенныхБумагИЭмитентов(ВходныеПараметры);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"Завершение: ?успех = [" + УспешноеСозданиеОбновлениеЦенныхБумагИЭмитентов + "] " + ТекущаяДатаСеанса());
	
КонецПроцедуры

Функция СписокПогашенныхЦБСОстатками()
	
	СписокISIN = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиЦБОстатки.ЦБ.ISIN КАК ISIN
		|ИЗ
		|	РегистрНакопления.ОстаткиЦБ.Остатки(
		|			&ДатаОстатков,
		|			ЦБ.ДатаПогашения <= &ДатаОстатков
		|				И ЦБ.ДатаПогашения > &ПустаяДата
		|				И НЕ ЦБ.Дефолтная
		|				И НЕ ЦБ.ПометкаУдаления) КАК ОстаткиЦБОстатки
		|ГДЕ
		|	ОстаткиЦБОстатки.ЦБ.ISIN <> &ПустаяСтрока
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиЦБОстатки.ЦБ.ISIN";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		СписокISIN = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ISIN");
	КонецЕсли;
	
	Возврат СписокISIN;

КонецФункции

#КонецОбласти

Процедура ЗаполнитьПодвидГосОблигаций(ОписаниеОшибки, Сессия, ТаблицаДанныхЦБ)
	Если Не ЗначениеЗаполнено(ТаблицаДанныхЦБ) Тогда
		Возврат;
	КонецЕсли;
	
	// Отберем fintoolids гособлигаций в массив и отдельно запомним соответствия fintoolid и номера строки таблицы с данными ЦБ
	FintoolidsГосОблигаций = Новый Массив;
	СоответствиеНомераСтрокиИFintoolid = Новый Соответствие;
	Для Каждого ДанныеЦБ Из ТаблицаДанныхЦБ Цикл
		КодВидаЦББанкаРФ = КодВидаЦББанкаРоссии(ДанныеЦБ);
		Если ЭтоГособлигация(КодВидаЦББанкаРФ) Тогда
			FintoolidsГосОблигаций.Добавить(ДанныеЦБ.fintoolid);
			СоответствиеНомераСтрокиИFintoolid.Вставить(ДанныеЦБ.fintoolid, ТаблицаДанныхЦБ.Индекс(ДанныеЦБ));
		КонецЕсли;
	КонецЦикла;
	
	// Получим для списка найденных гособлигаций данные о категориях ЦБ из RuData
	ВходныеПараметры = Новый Структура;
	ВходныеПараметры.Вставить("fintoolids", FintoolidsГосОблигаций);
	ВходныеПараметры.Вставить("filterOnlySpecifiedCategory", "id_category in (450, 540, 541)");
	ВходныеПараметры.Вставить("onlyFintoolsWithCategory", Истина);
	ТаблицаCategoryValue = InfoFintoolCategoryValue(ОписаниеОшибки, Сессия, ВходныеПараметры);
	Если Не ЗначениеЗаполнено(ТаблицаCategoryValue) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним данные о подвиде облигаций в таблице данных ЦБ
	КодОблигацийРФ = 450;
	КодОблигацийСубъектовРФ = 540;
	КодМуниципальныхОблигаций = 541;
	Для Каждого СтрокаТЗ Из ТаблицаCategoryValue Цикл
		Если СтрокаТЗ.categories.Количество() > 0 Тогда
			fintoolid = СтрокаТЗ.fintoolid;
			id_Category = СтрокаТЗ.categories[0].id_Category;
			Индекс = СоответствиеНомераСтрокиИFintoolid.Получить(fintoolid);
			ДанныеЦБ = ТаблицаДанныхЦБ[Индекс];
			Если id_Category = КодОблигацийРФ Тогда
				ДанныеЦБ.ПодвидОблигации = Перечисления.ПодвидыОблигаций.РФ;
			ИначеЕсли id_Category = КодОблигацийСубъектовРФ Тогда
				ДанныеЦБ.ПодвидОблигации = Перечисления.ПодвидыОблигаций.СубъектовРФ;
			ИначеЕсли id_Category = КодМуниципальныхОблигаций Тогда
				ДанныеЦБ.ПодвидОблигации = Перечисления.ПодвидыОблигаций.Муниципальная;
			Иначе
				ДанныеЦБ.ПодвидОблигации = Перечисления.ПодвидыОблигаций.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция КодВидаЦББанкаРоссии(ДанныеЦБ)
	КодВидаЦББанкаРоссии = ?(ЗначениеЗаполнено(ДанныеЦБ.sec_type_br_code3), ДанныеЦБ.sec_type_br_code3, ДанныеЦБ.sec_type_br_code2);
	
	Возврат КодВидаЦББанкаРоссии;
КонецФункции

#КонецОбласти
