
// Определяет, относится ли ЦБ к иностранным
//
// Параметры:
//  ВидЦББанкаРоссии - СправочникСсылка.ВидыЦББанкаРоссии	 - Вид ценной бумаги, которую необходимо проверить на принадлежность к иностранным
// 
// Возвращаемое значение:
//  Булево - Истина, если вид ЦБ Банка России относится к иностранным
//
Функция ЭтоВидИностраннойЦБ(ВидЦББанкаРоссии) Экспорт
	Если ЗначениеЗаполнено(ВидЦББанкаРоссии) Тогда
		Возврат ВидЦББанкаРоссии.ИностраннаяЦБ;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

