
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает режим торгов по коду
//
// Параметры:
//  Код	 - Строка - Код режима торгов
// 
// Возвращаемое значение:
//   - СправочникСсылка.РежимыТоргов - Ссылка на режим торгов
//
Функция РежимТорговПоКоду(Знач Код) Экспорт
	
	Код = СокрЛП(Код);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РежимыТоргов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РежимыТоргов КАК РежимыТоргов
	|ГДЕ
	|	НЕ РежимыТоргов.ПометкаУдаления
	|	И РежимыТоргов.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;
	
	Возврат Справочники.РежимыТоргов.ПустаяСсылка();
	
КонецФункции

// Возвращает Основные режимы торгов ММВБ
//
// Параметры:
//  ИмяРеквизита - Строка	 - Имя реквизита справочника "Ссылка", "Код"
// 
// Возвращаемое значение:
//   - Массив - Массив режимов торгов
//
Функция ОсновныеРежимыТорговММВБ(ИмяРеквизита) Экспорт
	
	РежимыТоргов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РежимыТоргов.Ссылка КАК Ссылка,
	|	СОКРЛП(ВЫРАЗИТЬ(РежимыТоргов.Код КАК СТРОКА)) КАК Код
	|ИЗ
	|	Справочник.РежимыТоргов КАК РежимыТоргов
	|ГДЕ
	|	НЕ РежимыТоргов.ПометкаУдаления
	|	И РежимыТоргов.ТипРежимаТоргов = &MAIN";
	
	Запрос.УстановитьПараметр("MAIN", Справочники.ТипыРежимовТоргов.MAIN);
	
	РежимыТоргов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(ИмяРеквизита);
	
	Возврат РежимыТоргов;
	
КонецФункции

#КонецОбласти
