
&НаКлиенте
Процедура ПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 

	Если ДиалогОткрытия.Выбрать() Тогда 
		Объект.Путь = ДиалогОткрытия.Каталог; 
	КонецЕсли;   
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНастройки(Команда)
	
	Выборка = ПолучитьВыборкуОбработок();
		
	Для каждого Обработка из Выборка Цикл
		АдресВременногоХранилища = "";
		НаименованиеОбработки = Строка(Обработка);
		Путь = Объект.Путь + "\PIF_" +ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(НаименованиеОбработки)+".txt"; 
		Попытка
			Текст = Новый ЗаписьТекста(Путь, КодировкаТекста.UTF8, Символы.ПС);
			Текст.Закрыть();
		Исключение
		КонецПопытки;
		ПоместитьФайл(АдресВременногоХранилища, Путь,,Ложь,УникальныйИдентификатор); // помещаем наш файл во временное хранилище (для его передачи на сервер)        
		
		Адрес = ВыгрузитьНастройкиНаСервере(АдресВременногоХранилища,Обработка.УникальныйИдентификатор()); //ВыгрузитьВXMLНаСервере(АдресВременногоХранилища);
      	ДвоичныеДанные_ = ПолучитьИзВременногоХранилища(Адрес);  // по адресу временного хранилища получаем двоичные данные
		ДвоичныеДанные_.Записать(Путь);	
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВыборкуОбработок()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст ="ВЫБРАТЬ
	|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	|ГДЕ
	|	НЕ ДополнительныеОтчетыИОбработки.ПометкаУдаления
	|	И ДополнительныеОтчетыИОбработки.Публикация = &Публикация
	|	И НЕ ДополнительныеОтчетыИОбработки.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Публикация",ПредопределенноеЗначение("Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется"));
	РезультатЗапроса = Запрос.Выполнить();
	МассивОбработок = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		МассивОбработок.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат МассивОбработок;
	
КонецФункции 


&НаСервере
Функция ВыгрузитьНастройкиНаСервере(АдресВременногоХранилища,Guid)
//	Сообщить(Guid);
	Возврат ВТБ_DevOps.ВыгрузитьНастройкиНаСервере(АдресВременногоХранилища,Guid)
КонецФункции

