
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДопОбработка", ДопОбработка);
	
	Настройки = ДопОбработка.ХранилищеНастроек.Получить();
	
	Если ТипЗнч(Настройки) = Тип("ХранилищеЗначения") Тогда
		Настройки = Настройки.Получить();
	КонецЕсли;
	
	Если ТипЗнч(Настройки) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Настройки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	
	СохранитьНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоУмолчанию(Команда)
	НастройкиПоУмолчаниюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура СохранитьНаСервере()
	
	Настройки = Новый Структура;
	Настройки.Вставить("ОбработкаЗагрузкиАктивов", Объект.ОбработкаЗагрузкиАктивов);
	Настройки.Вставить("КомандаЗагрузкиАктивов", Объект.КомандаЗагрузкиАктивов);
	Настройки.Вставить("ТестовыйРежим", Объект.ТестовыйРежим);
	Настройки.Вставить("НастройкаРассылки", Объект.НастройкаРассылки);
	Настройки.Вставить("СервисИсточник", Объект.СервисИсточник);
	
	ОбработкаОбъект = ДопОбработка.ПолучитьОбъект();
	ОбработкаОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(Настройки);
	ОбработкаОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура НастройкиПоУмолчаниюНаСервере()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.НастройкиПоУмолчанию(Объект);
КонецПроцедуры

#КонецОбласти