&НаКлиенте
Процедура ДатаЗагрузкиПриИзменении(Элемент)
	Элементы.ЗагрузитьЗаМесяц.Подсказка = "Загрузить все котировки за " + Формат(Объект.ДатаЗагрузки, "ДФ='ММММ гггг'");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.ДатаЗагрузки = ТекущаяДата();
	ДатаЗагрузкиПриИзменении(Элементы.ДатаЗагрузки);
	// По-умолчанию грузим за месяц
	Объект.ЗагрузитьЗаМесяц = Истина;
	
	Объект.ВариантЗагрузки = 0;
	
	ПолучитьКаталогЗагрузкиНаСервере();
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПолучитьКаталогЗагрузкиНаСервере()
	ПутьКФайлу = "";
	
	ПараметрыИсточника	= ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.КаталогФайловОценкиНРД);
	Если ПараметрыИсточника.Папка <> "" Тогда 
		
		Объект.ПутьКФайлуЗагрузки = СокрЛП(ПараметрыИсточника.Папка);
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура Загрузить(Команда)
	ВыполнитьЗагрузкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуНаСервере()
	Обработка	= РеквизитФормыВЗначение("Объект");
	Обработка.ВыполнениеЗагрузкиПоСтандартнойСхеме();
	ЗначениеВРеквизитФормы(Обработка, "Объект");
КонецПроцедуры

