
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.Настройки;
	ПараметрыОтчета	= Настройки.ПараметрыДанных;
	
	СтандартнаяОбработка = Ложь;
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ДанныеЖурналаДоходов", ДанныеЖурналаДоходов());
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных, ДанныеРасшифровки);
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Шапка = ДокументРезультат.Область(1, , 1);
	ДокументРезультат.ВставитьОбласть(Шапка, , ТипСмещенияТабличногоДокумента.ПоВертикали);
	Для НомерКолонки = 1 По ДокументРезультат.ШиринаТаблицы Цикл
		Ячейка = ДокументРезультат.Область(Шапка.Верх + 1, НомерКолонки);
		Ячейка.Текст = НомерКолонки;
		Ячейка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеЖурналаДоходов()
	
	МВТ = Новый МенеджерВременныхТаблиц;
	WTRCСообщенияQI.ПодготовитьВТДанныеВыплатПоЦБАмерикиОпределениеРСВ(МВТ, НачалоДня(ДатаНачала), КонецДня(ДатаОкончания));
	ДанныеСубклиентовОбщиеРазделы = WTRCСообщенияQI.ТаблицаСубклиентовОбщихРазделовПоДаннымВыплатЦБАмерики(МВТ);
	ТекстОшибок = "";
	WTRCСообщенияQI.ПодготовитьВТДетальныеЗаписиПоВыплатамИФормамW8(МВТ, ДанныеСубклиентовОбщиеРазделы, ТекстОшибок);
	Если Не ПустаяСтрока(ТекстОшибок) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибок);
		МД = Метаданные.Отчеты.QIЖурналДоходов;
		ЗаписьЖурналаРегистрации("Формирование отчета QI журнал доходов", УровеньЖурналаРегистрации.Ошибка, МД, , ТекстОшибок);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = ТекстЗапросаДанныеЖурналаДоходов();
	ДанныеЖурналаДоходов = Запрос.Выполнить().Выгрузить();
	Возврат ДанныеЖурналаДоходов;
	
КонецФункции

Функция ТекстЗапросаДанныеЖурналаДоходов()
	
	Возврат
	"ВЫБРАТЬ
	|	Поручения.Ссылка КАК Поручение,
	|	Поручения.ДатаИсполненияПоручения КАК ДатаПолученияДоходаНаСДС,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.ЦеннаяБумага КАК ЦеннаяБумага,
	|	"""" КАК ПризнакFATCA,
	|	Поручения.ВыплатаНа1ЦБ КАК СуммаДоходаНа1ЦБ,
	|	ВЫРАЗИТЬ(втДетальныеЗаписиПоВыплатамИФормамW8.Контрагент КАК Справочник.Контрагенты) КАК Клиент,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.Субклиент КАК Субклиент,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.W8BENE_W8BEN.Лицо.Наименование КАК НаименованиеЮЛФЛ,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.Количество КАК Количество,
	|	Поручения.ВидОперацииД КАК НаименованиеВыплаты,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.Доход КАК Доход,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.СтавкаНалога КАК СтавкаНалога,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.УдержанныйНалог КАК УдержанныйНалог,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.ЧистыйДоход КАК ЧистыйДоход,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.ДополнительныеУдержания КАК ДополнительныеУдержания,
	|	Поручения.Комментарий КАК Комментарий,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.СтатусПоГлаве4USTAXCODE КАК СтатусПоГлаве4USTAXCODE,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.Адрес1 КАК Адрес1,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.Страна КАК Страна,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.НаименованиеКонечногоБенефициара КАК НаименованиеКонечногоБенефициара,
	|	Поручения.Номер КАК НомерПоручения,
	|	ВЫРАЗИТЬ(втДетальныеЗаписиПоВыплатамИФормамW8.Контрагент КАК Справочник.Контрагенты).Код КАК КодКлиента,
	|	Поручения.Валюта КАК Валюта,
	|	ДоговорыКонтрагентов.Договор КАК Договор,
	|	Поручения.КарточкаКД.ДатаВыплатыНеПозднее КАК ДатаВыплатыНРД,
	|	Поручения.КарточкаКД.КДРеференс КАК КДРеференс
	|ИЗ
	|	втДетальныеЗаписиПоВыплатамИФормамW8 КАК втДетальныеЗаписиПоВыплатамИФормамW8
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			втДетальныеЗаписиПоВыплатамИФормамW8.Контрагент КАК Контрагент,
	|			МАКСИМУМ(ЕСТЬNULL(ДоговорыКонтрагентов.Наименование, ВЫРАЗИТЬ(втДетальныеЗаписиПоВыплатамИФормамW8.Контрагент КАК Справочник.Контрагенты).Код)) КАК Договор
	|		ИЗ
	|			втДетальныеЗаписиПоВыплатамИФормамW8 КАК втДетальныеЗаписиПоВыплатамИФормамW8
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|				ПО втДетальныеЗаписиПоВыплатамИФормамW8.Контрагент = ДоговорыКонтрагентов.Владелец
	|					И (НЕ ДоговорыКонтрагентов.ПометкаУдаления)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			втДетальныеЗаписиПоВыплатамИФормамW8.Контрагент) КАК ДоговорыКонтрагентов
	|		ПО втДетальныеЗаписиПоВыплатамИФормамW8.Контрагент = ДоговорыКонтрагентов.Контрагент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручения
	|		ПО втДетальныеЗаписиПоВыплатамИФормамW8.Поручение = Поручения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыплатыНРД,
	|	ДатаПолученияДоходаНаСДС,
	|	НомерПоручения,
	|	КодКлиента,
	|	НаименованиеЮЛФЛ";
	
КонецФункции

#КонецОбласти


