
Функция ЕстьКвалификацияИнвестора(ЮрФизЛицо, ВидИнструмента, Дата) Экспорт
	Признание = Новый Массив;
	Признание.Добавить(Перечисления.ВидыОперацийРеестраКвалифицированныхИнвесторов.Признание);
	Признание.Добавить(Перечисления.ВидыОперацийРеестраКвалифицированныхИнвесторов.ПодтверждениеСтатуса);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МАКСИМУМ(Реестр.Период) КАК Период,
	|	Реестр.Организация КАК Организация,
	|	Реестр.ЮрФизЛицо КАК ЮрФизЛицо,
	|	Реестр.ВидИнструмента КАК ВидИнструмента
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрСведений.РеестрКвалифицированныхИнвесторовРОФР.СрезПоследних(
	|			&Дата,
	|			ВидИнструмента = &ВидИнструмента
	|				И ЮрФизЛицо = &ЮрФизЛицо
	|				И Организация = &Организация) КАК Реестр
	|ГДЕ
	|	Реестр.ФлагАктивности
	|
	|СГРУППИРОВАТЬ ПО
	|	Реестр.Организация,
	|	Реестр.ЮрФизЛицо,
	|	Реестр.ВидИнструмента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеестрКвалифицированныхИнвесторовРОФР.ВидОперации КАК ВидОперации
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрКвалифицированныхИнвесторовРОФР КАК РеестрКвалифицированныхИнвесторовРОФР
	|		ПО вт.Организация = РеестрКвалифицированныхИнвесторовРОФР.Организация
	|			И вт.ЮрФизЛицо = РеестрКвалифицированныхИнвесторовРОФР.ЮрФизЛицо
	|			И вт.ВидИнструмента = РеестрКвалифицированныхИнвесторовРОФР.ВидИнструмента
	|			И вт.Период = РеестрКвалифицированныхИнвесторовРОФР.Период
	|			И (РеестрКвалифицированныхИнвесторовРОФР.ФлагАктивности = ИСТИНА)
	|ГДЕ
	|	РеестрКвалифицированныхИнвесторовРОФР.ВидОперации В(&Признание)");
	Запрос.УстановитьПараметр("Дата",			Дата);
	Запрос.УстановитьПараметр("ВидИнструмента",	ВидИнструмента);
	Запрос.УстановитьПараметр("Признание",		Признание);
	Запрос.УстановитьПараметр("ЮрФизЛицо",		ЮрФизЛицо);
	Запрос.УстановитьПараметр("Организация",	Константы.ОрганизацияПоУмолчанию.Получить());
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции
