////////////////////////////////////////////////////////////////////////////////////////////
//ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(Основание, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение") Тогда
		Если Основание.ВидОперацииД = Справочники.ВидыОпераций.ПогашениеНКД Тогда
			ДокументОснование	= Основание.Ссылка;			
			Дата				= ОбщегоНазначения.ДатаДокумента(Основание);
			ЦеннаяБумага		= Основание.ЦБ;
			//---
			Если Основание.БанковскийСчет.ВалютаДенежныхСредств = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
				Биржа	= Справочники.Биржи.MICEX;
			Иначе
				Биржа	= Справочники.Биржи.Внебирж;
			КонецЕсли;
			//---
			ЦенныеБумаги.Очистить();
			//---
			ДанныеДляТЧ	= Основание.ЦенныеБумагиСписываемые.Выгрузить();
			ДанныеДляТЧ.Свернуть("СчетДепо, ЦеннаяБумага", "Количество, Сумма");
			//---
			Для каждого СтрокаТаблицы Из ДанныеДляТЧ Цикл
				НоваяСтрока				= ЦенныеБумаги.Добавить();
				НоваяСтрока.СчетДепо	= СтрокаТаблицы.СчетДепо;
				НоваяСтрока.Депонент	= СтрокаТаблицы.СчетДепо.Владелец;
				НоваяСтрока.ЦеннаяБумага= СтрокаТаблицы.ЦеннаяБумага;
				НоваяСтрока.Количество	= СтрокаТаблицы.Количество;
				НоваяСтрока.НКД			= СтрокаТаблицы.Сумма;
			КонецЦикла; 
		Иначе	                      
			СтандартнаяОбработка = Ложь;
			Сообщить("На основании данного вида поручения нельзя создать документ Погашение НКД!!!");
			Возврат;
		КонецЕсли;			
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если Не ЗначениеЗаполнено(ДокументОснование.БанковскийСчет) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("В документе поручение не заполнен Банковский счет!", Отказ);
		Возврат;
	КонецЕсли;
	РезультатЗапроса	= ПолучитьРезультатЗапросаПоТабличнойЧасти();
	Выборка				= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ДенежныеСредства.ДобавитьПриход();
		Движение.Период			= Дата;
		Движение.БанковскийСчет = ДокументОснование.БанковскийСчет;
		Движение.Депонент		= Выборка.Депонент;
		Движение.Валюта			= Выборка.ВалютаДенежныхСредств;
		Движение.ВалютнаяСумма	= Выборка.ВалютнаяСумма;
		Движение.Сумма			= Выборка.Сумма;
	КонецЦикла;
	СформироватьВыпискиПоПогашениюНКД();
КонецПроцедуры

Процедура СформироватьВыпискиПоПогашениюНКД()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Выписка.Ссылка КАК ВыпискаСсылка,
	|	ПогашениеНКДЦенныеБумаги.СчетДепо			КАК СчетДепо,
	|	ПогашениеНКДЦенныеБумаги.Депонент			КАК СчетДепоВладелец
	|ИЗ
	|	Документ.ПогашениеНКД.ЦенныеБумаги КАК ПогашениеНКДЦенныеБумаги
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.Выписка КАК Выписка
	|ПО
	|	ПогашениеНКДЦенныеБумаги.Депонент = Выписка.СчетДепо.Владелец
	|И
	|	ПогашениеНКДЦенныеБумаги.Ссылка = Выписка.ОперацияЦБ
	|И
	|	ПогашениеНКДЦенныеБумаги.СчетДепо = Выписка.СчетДепо
	|ГДЕ
	|	ПогашениеНКДЦенныеБумаги.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ВыпискаСсылка) Тогда
			ВыпискаОбъект = Выборка.ВыпискаСсылка.ПолучитьОбъект();
		Иначе
			ВыпискаОбъект = Документы.Выписка.СоздатьДокумент();
		КонецЕсли;
		
		Если ВыпискаОбъект.ПометкаУдаления Тогда
			ВыпискаОбъект.ПометкаУдаления = Ложь;
			ВыпискаОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;	
		
		ВыпискаОбъект.ОперацияЦБ		= Ссылка;
		ВыпискаОбъект.Дата				= Дата;
		ВыпискаОбъект.ВидОтчета			= Перечисления.ВидыОтчетов.Отчет;
		ВыпискаОбъект.ДокументОснование = ДокументОснование;
		ВыпискаОбъект.СчетДепо			= Выборка.СчетДепо;
		ВыпискаОбъект.ВладелецСчета		= Выборка.СчетДепоВладелец;
		ВыпискаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьРезультатЗапросаПоТабличнойЧасти()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПогашениеНКДЦенныеБумаги.Депонент,
	|	ПогашениеНКДЦенныеБумаги.НКД							КАК Сумма,
	|	ПогашениеНКДЦенныеБумаги.ЦеннаяБумага.ВалютаНоминала	КАК ВалютаНоминала,
	|	(ПогашениеНКДЦенныеБумаги.НКД * КурсыВалютСрезПоследнихНоминал.Курс * КурсыВалютСрезПоследних.Кратность) / (КурсыВалютСрезПоследних.Курс * КурсыВалютСрезПоследнихНоминал.Кратность) КАК ВалютнаяСумма,
	|	ПогашениеНКДЦенныеБумаги.Ссылка.ДокументОснование.БанковскийСчет.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств
	|ИЗ
	|	Документ.ПогашениеНКД.ЦенныеБумаги КАК ПогашениеНКДЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
	|		ПО ПогашениеНКДЦенныеБумаги.Ссылка.ДокументОснование.БанковскийСчет.ВалютаДенежныхСредств = КурсыВалютСрезПоследних.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследнихНоминал
	|		ПО ПогашениеНКДЦенныеБумаги.ЦеннаяБумага.ВалютаНоминала = КурсыВалютСрезПоследнихНоминал.Валюта
	|ГДЕ
	|	ПогашениеНКДЦенныеБумаги.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", МоментВремени());
	
	Возврат Запрос.Выполнить();
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНовыйНомер();
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры
