&НаСервере
Функция ЭтотОбъект(ТекущийОбъект = Неопределено) 
	
	Если ТекущийОбъект = Неопределено Тогда
		Возврат РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
	Возврат Неопределено;
КонецФункции

Процедура УзелОбменаДляКабинетаПриИзменении(Элемент)
	
	ОбработкаВыбораУзлаОбмена();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораУзлаОбмена()
	
	Список.Параметры.УстановитьЗначениеПараметра("узел", Объект.УзелОбменаСсылка);
	
	// MPazhukov 15.05.2019 IMAPPS-7499
	Валюта = Справочники.Валюты.НайтиПоКоду("643");
	Список.Параметры.УстановитьЗначениеПараметра("ВалютаРубль", Валюта); 

	Об = РеквизитФормыВЗначение("Объект");
	Табл = Об.ПолучитьСписокДоговороДУ();
	ЗначениеВРеквизитФормы(Об, "Объект");	

	ДоговораДУ.Загрузить(Табл);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбработкаВыбораУзлаОбмена();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЭкспортДанныхНаСервере()
	
	//
	Объект.ПочтовыйЛогин = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	Объект.СписокРассылкиЮЛ.Очистить();
	Строка = Объект.СписокРассылкиЮЛ.Добавить();
	Строка.ПочтовыйЯщик = "maxim.pazhukov@vtbcapital.com";
	Строка.Представление = "maxim.pazhukov@vtbcapital.com";
	//
	
	ЭтотОбъект().ВыгрузитьДанныеВКабинетHNWI("");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЭкспортДанных(Команда)
	
	ВыполнитьЭкспортДанныхНаСервере();
	Обновить("");
	
КонецПроцедуры

&НаКлиенте
Процедура УзелОбменаСсылкаПриИзменении(Элемент)
	
	ОбработкаВыбораУзлаОбмена();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//
	//ОбработкаВыбораУзлаОбмена();
	//
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбработкаВыбораУзлаОбмена();
	
КонецПроцедуры


