
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");   //ЗаполнениеОбъекта
	ПараметрыРегистрации.Вставить("Назначение", Неопределено); // МассивСтрокИмен
	ПараметрыРегистрации.Вставить("Наименование", "Проверка реестра обратного выкупа");
	ПараметрыРегистрации.Вставить("Версия", "1.00");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", "Проверка реестра обратного выкупа");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "2.1.1.12");
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд,
		"Проверка реестра обратного выкупа",
		"ОткрытьФорму",
		"ОткрытиеФормы");
		
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьСсылкуНаОбработку() Экспорт
	
	ИмяОбработки = СведенияОВнешнейОбработке().Наименование;
	ДопОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ИмяОбработки, Истина);
	
	Возврат ДопОбработкаСсылка;
	
КонецФункции

Процедура ПрочитатьФайл(АдресФайлаНаСервере) Экспорт
	
	УникальноеИмяФайла = Новый УникальныйИдентификатор;
	ИмяФайлаНаСервере = КаталогВременныхФайлов() + УникальноеИмяФайла + ".xlsx";
	
	ФайлДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаНаСервере);
	ФайлДвоичныеДанные.Записать(ИмяФайлаНаСервере);
	
	ТабДок = Новый ТабличныйДокумент;
	Попытка
		ТабДок.Прочитать(ИмяФайлаНаСервере, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		ВызватьИсключение "Невозможно прочитать файл на сервере: " + ОписаниеОшибки();
	КонецПопытки;
	
	Попытка
		УдалитьФайлы(ИмяФайлаНаСервере);
	Исключение
	КонецПопытки;
	
	ПрочитатьДанные(ТабДок);
	
КонецПроцедуры

Функция ВыполнитьПроверку() Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("РезультатПроверки");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаФайл = Макет.ПолучитьОбласть("СтрокаФайл");
	ОбластьИтогФайл = Макет.ПолучитьОбласть("ИтогФайл");
	ОбластьИтогБаза = Макет.ПолучитьОбласть("ИтогБаза");
	
	ТабДок.Вывести(ОбластьШапка);
	
	т = Новый ТаблицаЗначений;
	КвалификаторыСтроки = Новый КвалификаторыСтроки(50);
	т.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	т.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки));
	т.Колонки.Добавить("НомерИДатаДоговораЗайма", Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки));
	
	Для каждого ТекСтрока Из ДанныеФайла Цикл
		МассивСтрок = СтрРазделить(ТекСтрока.НомерИДатаДоговораЗайма, "от");
		
		НоваяСтрока = т.Добавить();
		НоваяСтрока.Дата = ?(МассивСтрок.Количество() >= 2, МассивСтрок.Получить(1), Дата(1, 1, 1));
		НоваяСтрока.Номер = СокрЛП(?(МассивСтрок.Количество() >= 1, МассивСтрок.Получить(0), ""));
		НоваяСтрока.НомерИДатаДоговораЗайма = ТекСтрока.НомерИДатаДоговораЗайма;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("ВидАктива", ПланыВидовХарактеристик.ВидыАктивов.ДенежныеТребования);
	Запрос.УстановитьПараметр("ВидДенежногоТребования", Перечисления.ВидыДенежныхТребований.Займ);
	Запрос.УстановитьПараметр("т", т);
	Запрос.УстановитьПараметр("ДатаПроверки", КонецДня(ДатаПроверки));
	Запрос.УстановитьПараметр("Счет76_13_2", ПланыСчетов.Управленческий.РасчетыПоДенежнымТребованиямОД);
	Запрос.УстановитьПараметр("Счет76_13_3", ПланыСчетов.Управленческий.РасчетыПоДенежнымТребованиямПроценты);
	Запрос.УстановитьПараметр("ПИФ", Фонд);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ИтогоОбщаяСуммаУступкиТребованийБаза = 0;
	
	Для каждого ТекСтрока Из ДанныеФайла Цикл
		ОбластьСтрокаФайл.Параметры.Заполнить(ТекСтрока);
		ТабДок.Вывести(ОбластьСтрокаФайл);
		
		УсловияПоиска = Новый Структура;
		УсловияПоиска.Вставить("НомерИДатаДоговораЗайма", ТекСтрока.НомерИДатаДоговораЗайма);
		
		ОбластьСтрокаБаза = Макет.ПолучитьОбласть("СтрокаБаза");
		Если Выборка.НайтиСледующий(УсловияПоиска) Тогда
			
			ОбластьСтрокаБаза.Параметры.Заполнить(Выборка);
			
			Если ТекСтрока.НаименованиеЗаемщика_ИНН_ <> Выборка.НаименованиеЗаемщика_ИНН_ Тогда
				ОбластьСтроки = ОбластьСтрокаБаза.Область(1, 2, 1, 2);
				ОбластьСтроки.ЦветФона = WebЦвета.Лосось;
			КонецЕсли;
			
			Если ТекСтрока.СуммаЗайма_Руб_ <> Выборка.СуммаЗайма_Руб_ Тогда
				ОбластьСтроки = ОбластьСтрокаБаза.Область(1, 3, 1, 3);
				ОбластьСтроки.ЦветФона = WebЦвета.Лосось;
			КонецЕсли;
			
			ОбластьСтрокаБаза.Параметры.ОстатокЗадолженностиПоОсновномуДолгу_Руб_ = Выборка.СуммаЗайма_Руб_
				- Выборка.СуммаВсехПогашенийЗаемщиком - Выборка.amount_paid_before;
			Если ТекСтрока.ОстатокЗадолженностиПоОсновномуДолгу_Руб_ <> ОбластьСтрокаБаза.Параметры.ОстатокЗадолженностиПоОсновномуДолгу_Руб_ Тогда
				ОбластьСтроки = ОбластьСтрокаБаза.Область(1, 4, 1, 4);
				ОбластьСтроки.ЦветФона = WebЦвета.Лосось;
			КонецЕсли;
			
			ОбластьСтрокаБаза.Параметры.ОстатокЗадолженностиПоПроцентам_Руб_ = Выборка.ОстатокЗадолженностиПоПроцентам_Руб_;
			Если ТекСтрока.ОстатокЗадолженностиПоПроцентам_Руб_ <> Выборка.ОстатокЗадолженностиПоПроцентам_Руб_ Тогда
				ОбластьСтроки = ОбластьСтрокаБаза.Область(1, 5, 1, 5);
				ОбластьСтроки.ЦветФона = WebЦвета.Лосось;
			КонецЕсли;
			
			Если ТекСтрока.ПросроченнаяЗадолженностьПоОсновномуДолгу_Руб_ <> Выборка.ПросроченнаяЗадолженностьПоОсновномуДолгу_Руб_ Тогда
				ОбластьСтроки = ОбластьСтрокаБаза.Область(1, 6, 1, 6);
				ОбластьСтроки.ЦветФона = WebЦвета.Лосось;
			КонецЕсли;
			
			Если ТекСтрока.ПросроченнаяЗадолженностьПоПроцентам_Руб_ <> Выборка.ПросроченнаяЗадолженностьПоПроцентам_Руб_ Тогда
				ОбластьСтроки = ОбластьСтрокаБаза.Область(1, 7, 1, 7);
				ОбластьСтроки.ЦветФона = WebЦвета.Лосось;
			КонецЕсли;
			
			ОбластьСтрокаБаза.Параметры.КоличествоДнейПросрочки_ = Выборка.КоличествоДнейПросрочки_;
			Если ТекСтрока.КоличествоДнейПросрочки_ <> Выборка.КоличествоДнейПросрочки_ Тогда
				ОбластьСтроки = ОбластьСтрокаБаза.Область(1, 8, 1, 8);
				ОбластьСтроки.ЦветФона = WebЦвета.Лосось;
			КонецЕсли;
			
			ОбластьСтроки = ОбластьСтрокаБаза.Область(1, 9, 1, 9);
			ОбластьСтроки.ЦветФона = WebЦвета.Лосось;
			
			ОбластьСтрокаБаза.Параметры.ЦенаУступки_Руб_ = ОбластьСтрокаБаза.Параметры.ОстатокЗадолженностиПоОсновномуДолгу_Руб_
				+ Выборка.ОстатокЗадолженностиПоПроцентам_Руб_;
			Если ТекСтрока.ЦенаУступки_Руб_ <> ОбластьСтрокаБаза.Параметры.ЦенаУступки_Руб_ Тогда
				ОбластьСтроки = ОбластьСтрокаБаза.Область(1, 10, 1, 10);
				ОбластьСтроки.ЦветФона = WebЦвета.Лосось;
			КонецЕсли;
			ИтогоОбщаяСуммаУступкиТребованийБаза = ИтогоОбщаяСуммаУступкиТребованийБаза + ОбластьСтрокаБаза.Параметры.ЦенаУступки_Руб_;
		Иначе
			ОбластьСтроки = ОбластьСтрокаБаза.Область(1, 1, 1, 10);
			ОбластьСтроки.ЦветФона = WebЦвета.Лосось;
		КонецЕсли;
		ТабДок.Вывести(ОбластьСтрокаБаза);
		
		Выборка.Сбросить();
	КонецЦикла;
	
	ОбластьИтогФайл.Параметры.ЦенаУступки_Руб_ = ИтогоОбщаяСуммаУступкиТребований;
	ТабДок.Вывести(ОбластьИтогФайл);
	
	ОбластьИтогБаза.Параметры.ЦенаУступки_Руб_ = ИтогоОбщаяСуммаУступкиТребованийБаза;
	Если ИтогоОбщаяСуммаУступкиТребований <> ИтогоОбщаяСуммаУступкиТребованийБаза Тогда
		ОбластьИтог = ОбластьИтогБаза.Область(1, 10, 1, 10);
		ОбластьИтог.ЦветФона = WebЦвета.Лосось;
	КонецЕсли;
	ТабДок.Вывести(ОбластьИтогБаза);
	
	Возврат ТабДок;
	
КонецФункции

#Область DevOps

Функция ПолучитьСсылкуСправочникаПриемникаДляЗагрузки() Экспорт
	
	Возврат Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка()
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Функция НайтиДопСвойство(НазначениеСвойства, Наименование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвойстваОбъектов.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
		|ГДЕ
		|	СвойстваОбъектов.НазначениеСвойства = &НазначениеСвойства
		|	И СвойстваОбъектов.Наименование = &Наименование
		|	И НЕ СвойстваОбъектов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НазначениеСвойства", НазначениеСвойства);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Сообщить("Ошибка! Обратитесь к администратору. Не найдено свойство: " + Наименование);
	Возврат Неопределено;
	
КонецФункции

Процедура ПрочитатьДанные(ТабДок)
	
	ДанныеФайла.Очистить();
	
	ОбластьШапкаТаблицы = ТабДок.НайтиТекст("Номер и дата договора займа",,, Ложь);
	
	Если ОбластьШапкаТаблицы = Неопределено Тогда
		Сообщить("Не найдена таблица данных в файле");
		Возврат;
	КонецЕсли;
	
	Поз = Найти(ОбластьШапкаТаблицы.Имя, "C");
	НомерСтрокиШапкиТаблицы = Число(Сред(ОбластьШапкаТаблицы.Имя, 2, Поз - 2));
	
	ОбластьЯчеек = ТабДок.Область(НомерСтрокиШапкиТаблицы, 1, ТабДок.ВысотаТаблицы, ТабДок.ШиринаТаблицы);
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	ТЗ = ПостроительОтчета.Результат.Выгрузить();
	
	Для Каждого текСтрока Из ТЗ Цикл
		Если текСтрока.НомерИДатаДоговораЗайма = "Итого общая сумма  уступки требований" Тогда
			ИтогоОбщаяСуммаУступкиТребований = текСтрока.ЦенаУступки_Руб_;
			
			Прервать;
		КонецЕсли;
		
		НоваяСтрока = ДанныеФайла.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, текСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТекстЗапроса()
	
	Возврат
	"ВЫБРАТЬ
	|	т.Дата КАК Дата,
	|	т.Номер КАК Номер,
	|	т.НомерИДатаДоговораЗайма КАК НомерИДатаДоговораЗайма
	|ПОМЕСТИТЬ т
	|ИЗ
	|	&т КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.НомерИДатаДоговораЗайма КАК НомерИДатаДоговораЗайма,
	|	ДенежныеТребования.Заемщик КАК Заемщик,
	|	ДенежныеТребования.Ссылка КАК ДенежноеТребование,
	|	ДенежныеТребования.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДенежныеТребования.Заемщик.Наименование КАК НаименованиеЗаемщика_ИНН_,
	|	ДенежныеТребования.ДатаВыдачиКредита КАК ДатаВыдачиКредита,
	|	ДенежныеТребования.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
	|	ДенежныеТребования.Процент КАК Процент
	|ПОМЕСТИТЬ тДенежныеТребования
	|ИЗ
	|	т КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДенежныеТребования КАК ДенежныеТребования
	|		ПО т.Дата = ДенежныеТребования.ДатаВыдачиЗакладной
	|			И т.Номер = ДенежныеТребования.НомерКредитногоДоговора
	|			И (ДенежныеТребования.ВидАктива = &ВидАктива)
	|			И (ДенежныеТребования.ВидДенежногоТребования = &ВидДенежногоТребования)
	|			И (НЕ ДенежныеТребования.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УстановкаГрафикаПлатежейТаблицаПлатежей.Ссылка.Закладная КАК Закладная,
	|	МАКСИМУМ(УстановкаГрафикаПлатежейТаблицаПлатежей.ДатаПлатежа) КАК ДатаПлатежа
	|ПОМЕСТИТЬ тДатыПоследнегоПлатежа
	|ИЗ
	|	Документ.УстановкаГрафикаПлатежей.ТаблицаПлатежей КАК УстановкаГрафикаПлатежейТаблицаПлатежей
	|ГДЕ
	|	УстановкаГрафикаПлатежейТаблицаПлатежей.Ссылка.Проведен
	|	И НЕ УстановкаГрафикаПлатежейТаблицаПлатежей.Ссылка.ПометкаУдаления
	|	И УстановкаГрафикаПлатежейТаблицаПлатежей.Ссылка.Закладная В
	|			(ВЫБРАТЬ
	|				тДенежныеТребования.ДенежноеТребование КАК ДенежноеТребование
	|			ИЗ
	|				тДенежныеТребования КАК тДенежныеТребования)
	|
	|СГРУППИРОВАТЬ ПО
	|	УстановкаГрафикаПлатежейТаблицаПлатежей.Ссылка.Закладная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УправленческийОстаткиИОбороты.Субконто1 КАК Заемщик,
	|	УправленческийОстаткиИОбороты.Субконто2 КАК ДоговорКонтрагента,
	|	УправленческийОстаткиИОбороты.СуммаОборотКт КАК СуммаВсехПогашенийЗаемщиком,
	|	УправленческийОстаткиИОбороты.СуммаКонечныйОстатокДт КАК ПросроченнаяЗадолженностьПоОсновномуДолгу_Руб_
	|ПОМЕСТИТЬ тОсновнойДолг
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.ОстаткиИОбороты(
	|			,
	|			&ДатаПроверки,
	|			,
	|			,
	|			Счет = &Счет76_13_2,
	|			,
	|			ПИФ = &ПИФ
	|				И (Субконто1, Субконто2) В
	|					(ВЫБРАТЬ
	|						тДенежныеТребования.Заемщик,
	|						тДенежныеТребования.ДоговорКонтрагента
	|					ИЗ
	|						тДенежныеТребования КАК тДенежныеТребования)) КАК УправленческийОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УправленческийОстаткиИОбороты.Субконто1 КАК Заемщик,
	|	УправленческийОстаткиИОбороты.Субконто2 КАК ДоговорКонтрагента,
	|	УправленческийОстаткиИОбороты.СуммаОборотКт КАК СуммаВсехОплаченныхПроцентовЗаемщиком,
	|	УправленческийОстаткиИОбороты.СуммаКонечныйОстатокДт КАК ПросроченнаяЗадолженностьПоПроцентам_Руб_
	|ПОМЕСТИТЬ тДолгПроценты
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.ОстаткиИОбороты(
	|			,
	|			&ДатаПроверки,
	|			,
	|			,
	|			Счет = &Счет76_13_3,
	|			,
	|			ПИФ = &ПИФ
	|				И (Субконто1, Субконто2) В
	|					(ВЫБРАТЬ
	|						тДенежныеТребования.Заемщик,
	|						тДенежныеТребования.ДоговорКонтрагента
	|					ИЗ
	|						тДенежныеТребования КАК тДенежныеТребования)) КАК УправленческийОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УправленческийОстатки.Субконто1 КАК Заемщик,
	|	УправленческийОстатки.Субконто2 КАК ДоговорКонтрагента,
	|	УправленческийОстатки.Субконто3 КАК НачислениеЗадолженности,
	|	УправленческийОстатки.СуммаОстатокДт КАК СуммаОстатокДт
	|ПОМЕСТИТЬ тЗадолженность
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Остатки(
	|			&ДатаПроверки,
	|			Счет В (&Счет76_13_2, &Счет76_13_3),
	|			,
	|			ПИФ = &ПИФ
	|				И (Субконто1, Субконто2) В
	|					(ВЫБРАТЬ
	|						тДенежныеТребования.Заемщик,
	|						тДенежныеТребования.ДоговорКонтрагента
	|					ИЗ
	|						тДенежныеТребования КАК тДенежныеТребования)) КАК УправленческийОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тЗадолженность.Заемщик КАК Заемщик,
	|	тЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	МИНИМУМ(ВЫРАЗИТЬ(тЗадолженность.НачислениеЗадолженности КАК Документ.НачислениеЗадолженностиПоПлатежам).Дата) КАК ДатаЗадолженности
	|ПОМЕСТИТЬ тПерваяДатаЗадолженности
	|ИЗ
	|	тЗадолженность КАК тЗадолженность
	|
	|СГРУППИРОВАТЬ ПО
	|	тЗадолженность.Заемщик,
	|	тЗадолженность.ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тДенежныеТребования.НомерИДатаДоговораЗайма КАК НомерИДатаДоговораЗайма,
	|	тДенежныеТребования.НаименованиеЗаемщика_ИНН_ КАК НаименованиеЗаемщика_ИНН_,
	|	ЕСТЬNULL(тОсновнойДолг.СуммаВсехПогашенийЗаемщиком, 0) КАК СуммаВсехПогашенийЗаемщиком,
	|	ЕСТЬNULL(тОсновнойДолг.ПросроченнаяЗадолженностьПоОсновномуДолгу_Руб_, 0) КАК ПросроченнаяЗадолженностьПоОсновномуДолгу_Руб_,
	|	ЕСТЬNULL(тДолгПроценты.СуммаВсехОплаченныхПроцентовЗаемщиком, 0) КАК СуммаВсехОплаченныхПроцентовЗаемщиком,
	|	ЕСТЬNULL(тДолгПроценты.ПросроченнаяЗадолженностьПоПроцентам_Руб_, 0) КАК ПросроченнаяЗадолженностьПоПроцентам_Руб_,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(тДатыПоследнегоПлатежа.ДатаПлатежа, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) < &ДатаПроверки
	|			ТОГДА ЕСТЬNULL(тДолгПроценты.ПросроченнаяЗадолженностьПоПроцентам_Руб_, 0)
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(Значения_start_amount.Значение КАК ЧИСЛО), 0) * тДенежныеТребования.Процент / 100 * ВЫБОР
	|				КОГДА РАЗНОСТЬДАТ(тДенежныеТребования.ДатаВыдачиКредита, &ДатаПроверки, МЕСЯЦ) < РАЗНОСТЬДАТ(тДенежныеТребования.ДатаВыдачиКредита, тДенежныеТребования.ДатаОкончанияДоговора, МЕСЯЦ)
	|					ТОГДА РАЗНОСТЬДАТ(тДенежныеТребования.ДатаВыдачиКредита, &ДатаПроверки, МЕСЯЦ) + ВЫБОР
	|							КОГДА ДЕНЬ(&ДатаПроверки) > ДЕНЬ(тДенежныеТребования.ДатаВыдачиКредита)
	|								ТОГДА 1
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ РАЗНОСТЬДАТ(тДенежныеТребования.ДатаВыдачиКредита, тДенежныеТребования.ДатаОкончанияДоговора, МЕСЯЦ)
	|			КОНЕЦ - ЕСТЬNULL(тДолгПроценты.СуммаВсехОплаченныхПроцентовЗаемщиком, 0) - ЕСТЬNULL(ВЫРАЗИТЬ(Значения_percents_paid_before.Значение КАК ЧИСЛО), 0)
	|	КОНЕЦ КАК ОстатокЗадолженностиПоПроцентам_Руб_,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Значения_start_amount.Значение КАК ЧИСЛО), 0) КАК СуммаЗайма_Руб_,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Значения_amount_paid_before.Значение КАК ЧИСЛО), 0) КАК amount_paid_before,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Значения_percents_paid_before.Значение КАК ЧИСЛО), 0) КАК percents_paid_before,
	|	ВЫБОР
	|		КОГДА тПерваяДатаЗадолженности.ДатаЗадолженности ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(тПерваяДатаЗадолженности.ДатаЗадолженности, ДЕНЬ), &ДатаПроверки, ДЕНЬ)
	|	КОНЕЦ КАК КоличествоДнейПросрочки_
	|ИЗ
	|	тДенежныеТребования КАК тДенежныеТребования
	|		ЛЕВОЕ СОЕДИНЕНИЕ тДатыПоследнегоПлатежа КАК тДатыПоследнегоПлатежа
	|		ПО тДенежныеТребования.ДенежноеТребование = тДатыПоследнегоПлатежа.Закладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Значения_start_amount
	|		ПО тДенежныеТребования.ДенежноеТребование = Значения_start_amount.Объект
	|			И (Значения_start_amount.Свойство.Наименование = ""start_amount"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Значения_amount_paid_before
	|		ПО тДенежныеТребования.ДенежноеТребование = Значения_amount_paid_before.Объект
	|			И (Значения_amount_paid_before.Свойство.Наименование = ""amount_paid_before"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Значения_percents_paid_before
	|		ПО тДенежныеТребования.ДенежноеТребование = Значения_percents_paid_before.Объект
	|			И (Значения_percents_paid_before.Свойство.Наименование = ""percents_paid_before"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ тОсновнойДолг КАК тОсновнойДолг
	|		ПО тДенежныеТребования.Заемщик = тОсновнойДолг.Заемщик
	|			И тДенежныеТребования.ДоговорКонтрагента = тОсновнойДолг.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ тДолгПроценты КАК тДолгПроценты
	|		ПО тДенежныеТребования.Заемщик = тДолгПроценты.Заемщик
	|			И тДенежныеТребования.ДоговорКонтрагента = тДолгПроценты.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ тПерваяДатаЗадолженности КАК тПерваяДатаЗадолженности
	|		ПО тДенежныеТребования.Заемщик = тПерваяДатаЗадолженности.Заемщик
	|			И тДенежныеТребования.ДоговорКонтрагента = тПерваяДатаЗадолженности.ДоговорКонтрагента";
	
КонецФункции

#КонецОбласти
