
Процедура Сформировать() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УслугиДепозитарияОбороты.Регистратор КАК Регистратор,
	|	УслугиДепозитарияОбороты.Валюта КАК Валюта,
	|	УслугиДепозитарияОбороты.Услуга КАК Комиссия,
	|	УслугиТарифногоПлана.Код КАК КодКомиссии,
	|	УслугиТарифногоПлана.Наименование КАК НаименованиеКомиссии,
	|	УслугиТарифногоПлана.НДС КАК НДСКомиссии,
	|	УслугиТарифногоПлана.КодВБэкОфисе КАК КодВБэкОфисе,
	|	ВЫБОР
	|		КОГДА УслугиДепозитарияОбороты.Регистратор ССЫЛКА Документ.УслугиДепозитария
	|				И УслугиДепозитарияОбороты.Регистратор.ПериодРасчетаКомиссии <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА УслугиДепозитарияОбороты.Регистратор.ПериодРасчетаКомиссии
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(УслугиДепозитарияОбороты.Период, ДЕНЬ)
	|	КОНЕЦ КАК ПериодРасчета,
	|	УслугиДепозитарияОбороты.СуммаВВалютеПриход КАК Сумма,
	|	УслугиДепозитарияОбороты.Период КАК Период,
	|	УслугиДепозитарияОбороты.НомерСтроки КАК НомерСтрокиВРегистре,
	|	ЕСТЬNULL(КодыЗагрузки.Код, """") КАК CrmClientId,
	|	УслугиДепозитарияОбороты.Инициатор КАК Инициатор,
	|	УслугиДепозитарияОбороты.Инициатор.Владелец КАК ИнициаторВладелец,
	|	УслугиДепозитарияОбороты.Инициатор.Наименование КАК НаименованиеДоговора,
	|	УслугиДепозитарияОбороты.Выгодоприобретатель КАК Выгодоприобретатель,
	|	Контрагенты.КлиентОтсутствуетВBQ КАК КлиентОтсутствуетВBQ,
	|	Контрагенты.СчетСписанияКомиссииВНРБанке КАК НомерСчетаСписанияКомиссии
	|ПОМЕСТИТЬ ДанныеПоУслугамДепозитария
	|ИЗ
	|	РегистрНакопления.УслугиДепозитария.Обороты(&НачалоПериода, &КонецПериода, Запись, ) КАК УслугиДепозитарияОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|			ПО Контрагенты.ЮридическиеФизическиеЛица = КодыЗагрузки.Владелец
	|				И (НЕ КодыЗагрузки.ПометкаУдаления)
	|				И (КодыЗагрузки.Биржа = &КлассификаторыЗагрузкиКлиенты)
	|		ПО УслугиДепозитарияОбороты.Инициатор.Владелец = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиТарифногоПлана КАК УслугиТарифногоПлана
	|		ПО УслугиДепозитарияОбороты.Услуга = УслугиТарифногоПлана.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УслугиДепозитарияВыгруженные КАК УслугиДепозитарияВыгруженные
	|		ПО УслугиДепозитарияОбороты.Регистратор = УслугиДепозитарияВыгруженные.Документ
	|ГДЕ
	|	УслугиДепозитарияОбороты.СуммаВВалютеОборот <> 0
	|	И УслугиДепозитарияВыгруженные.Документ ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА Контрагенты.КлиентОтсутствуетВBQ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ КодыЗагрузки.Код ЕСТЬ NULL
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредоставленныеДокументыСрезПоследних.Депонент КАК Депонент,
	|	ПредоставленныеДокументыСрезПоследних.Период КАК НачалоПериода,
	|	ВЫБОР
	|		КОГДА ПредоставленныеДокументыСрезПоследних.СрокДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ПредоставленныеДокументыСрезПоследних.СрокДействия
	|		ИНАЧЕ КОНЕЦПЕРИОДА(ПредоставленныеДокументыСрезПоследних.СрокДействия, ДЕНЬ)
	|	КОНЕЦ КАК ОкончаниеПериода
	|ПОМЕСТИТЬ ПериодыПредоставленияДокументов
	|ИЗ
	|	РегистрСведений.ПредоставленныеДокументы.СрезПоследних(
	|			&НачалоПериода,
	|			ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовУдостоверяющихПолномочия.ЗаявлениеНаРегулярноеПеречисление)
	|				И Депонент В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ДанныеПоУслугамДепозитария.ИнициаторВладелец КАК ИнициаторВладелец
	|					ИЗ
	|						ДанныеПоУслугамДепозитария КАК ДанныеПоУслугамДепозитария)) КАК ПредоставленныеДокументыСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредоставленныеДокументы.Депонент,
	|	ПредоставленныеДокументы.Период,
	|	ВЫБОР
	|		КОГДА ПредоставленныеДокументы.СрокДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ПредоставленныеДокументы.СрокДействия
	|		ИНАЧЕ КОНЕЦПЕРИОДА(ПредоставленныеДокументы.СрокДействия, ДЕНЬ)
	|	КОНЕЦ
	|ИЗ
	|	ДанныеПоУслугамДепозитария КАК ДанныеПоУслугамДепозитария
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПредоставленныеДокументы КАК ПредоставленныеДокументы
	|		ПО ДанныеПоУслугамДепозитария.ИнициаторВладелец = ПредоставленныеДокументы.Депонент
	|			И (ПредоставленныеДокументы.Период МЕЖДУ &НачалоПериода И &КонецПериода)
	|			И (ПредоставленныеДокументы.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовУдостоверяющихПолномочия.ЗаявлениеНаРегулярноеПеречисление))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоУслугамДепозитария.Комиссия КАК Комиссия,
	|	ДанныеПоУслугамДепозитария.Валюта КАК Валюта,
	|	СУММА(ДанныеПоУслугамДепозитария.Сумма) КАК Сумма,
	|	ДанныеПоУслугамДепозитария.КодВБэкОфисе КАК КодВБэкОфисе
	|ИЗ
	|	ДанныеПоУслугамДепозитария КАК ДанныеПоУслугамДепозитария
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоУслугамДепозитария.КодВБэкОфисе,
	|	ДанныеПоУслугамДепозитария.Валюта,
	|	ДанныеПоУслугамДепозитария.Комиссия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоУслугамДепозитария.Комиссия КАК Комиссия,
	|	ДанныеПоУслугамДепозитария.Валюта КАК Валюта,
	|	СУММА(ДанныеПоУслугамДепозитария.Сумма) КАК Сумма,
	|	ДанныеПоУслугамДепозитария.КодВБэкОфисе КАК КодБэк,
	|	ДанныеПоУслугамДепозитария.Инициатор КАК Договор,
	|	ДанныеПоУслугамДепозитария.ИнициаторВладелец КАК Депонент,
	|	ВЫБОР
	|		КОГДА ДанныеПоУслугамДепозитария.Регистратор ССЫЛКА Документ.УслугиДепозитария
	|				И ДанныеПоУслугамДепозитария.Регистратор.ПериодРасчетаКомиссии <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДанныеПоУслугамДепозитария.Регистратор.ПериодРасчетаКомиссии
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДанныеПоУслугамДепозитария.Период, ДЕНЬ)
	|	КОНЕЦ КАК ПериодРасчета,
	|	ДанныеПоУслугамДепозитария.Выгодоприобретатель КАК Выгодоприобретатель
	|ИЗ
	|	ДанныеПоУслугамДепозитария КАК ДанныеПоУслугамДепозитария
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоУслугамДепозитария.Комиссия,
	|	ДанныеПоУслугамДепозитария.Валюта,
	|	ДанныеПоУслугамДепозитария.КодВБэкОфисе,
	|	ВЫБОР
	|		КОГДА ДанныеПоУслугамДепозитария.Регистратор ССЫЛКА Документ.УслугиДепозитария
	|				И ДанныеПоУслугамДепозитария.Регистратор.ПериодРасчетаКомиссии <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДанныеПоУслугамДепозитария.Регистратор.ПериодРасчетаКомиссии
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДанныеПоУслугамДепозитария.Период, ДЕНЬ)
	|	КОНЕЦ,
	|	ДанныеПоУслугамДепозитария.Выгодоприобретатель,
	|	ДанныеПоУслугамДепозитария.Инициатор,
	|	ДанныеПоУслугамДепозитария.ИнициаторВладелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоУслугамДепозитария.Регистратор КАК Регистратор,
	|	ДанныеПоУслугамДепозитария.Валюта.Код КАК КодВалюты,
	|	УслугиТарифногоПлана.Ссылка КАК Комиссия,
	|	УслугиТарифногоПлана.Код КАК КодКомиссии,
	|	УслугиТарифногоПлана.Наименование КАК НаименованиеКомиссии,
	|	УслугиТарифногоПлана.НДС КАК НДСКомиссии,
	|	ЕСТЬNULL(КодыЗагрузки.Код, ДанныеПоУслугамДепозитария.НаименованиеДоговора) КАК НаименованиеДоговора,
	|	ДанныеПоУслугамДепозитария.ПериодРасчета КАК ПериодРасчета,
	|	ДанныеПоУслугамДепозитария.Сумма КАК Сумма,
	|	ДанныеПоУслугамДепозитария.Период КАК Период,
	|	ДанныеПоУслугамДепозитария.НомерСтрокиВРегистре КАК НомерСтрокиВРегистре,
	|	ДанныеПоУслугамДепозитария.CrmClientId КАК CrmClientId,
	|	ДанныеПоУслугамДепозитария.КлиентОтсутствуетВBQ КАК КлиентОтсутствуетВBQ,
	|	ДанныеПоУслугамДепозитария.НомерСчетаСписанияКомиссии КАК НомерСчетаСписанияКомиссии,
	|	ВЫБОР
	|		КОГДА ДанныеПоУслугамДепозитария.КлиентОтсутствуетВBQ
	|				И ПериодыПредоставленияДокументов.Депонент ЕСТЬ НЕ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК БезАкцептноеСписание
	|ИЗ
	|	ДанныеПоУслугамДепозитария КАК ДанныеПоУслугамДепозитария
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УслугиТарифногоПлана КАК УслугиТарифногоПлана
	|		ПО ДанныеПоУслугамДепозитария.Комиссия = УслугиТарифногоПлана.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыПредоставленияДокументов КАК ПериодыПредоставленияДокументов
	|		ПО ДанныеПоУслугамДепозитария.ИнициаторВладелец = ПериодыПредоставленияДокументов.Депонент
	|			И ДанныеПоУслугамДепозитария.Период >= ПериодыПредоставленияДокументов.НачалоПериода
	|			И (ДанныеПоУслугамДепозитария.Период <= ПериодыПредоставленияДокументов.ОкончаниеПериода
	|				ИЛИ ПериодыПредоставленияДокументов.ОкончаниеПериода = ДАТАВРЕМЯ(1, 1, 1))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ДанныеПоУслугамДепозитария.ИнициаторВладелец = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.CrmContractNumber))
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия >= &НачалоПериода
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоУслугамДепозитария.Регистратор КАК Документ,
	|	ДанныеПоУслугамДепозитария.Регистратор.Номер КАК Номер,
	|	ДанныеПоУслугамДепозитария.Регистратор.Дата КАК Дата,
	|	ДанныеПоУслугамДепозитария.Период КАК Период,
	|	СУММА(ДанныеПоУслугамДепозитария.Сумма) КАК Сумма
	|ИЗ
	|	ДанныеПоУслугамДепозитария КАК ДанныеПоУслугамДепозитария
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоУслугамДепозитария.Период,
	|	ДанныеПоУслугамДепозитария.Регистратор,
	|	ДанныеПоУслугамДепозитария.Регистратор.Номер,
	|	ДанныеПоУслугамДепозитария.Регистратор.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("КлассификаторыЗагрузкиКлиенты", Справочники.КлассификаторыЗагрузки.Клиенты);
	
	Пакеты = Запрос.ВыполнитьПакет();
	
	Комиссии.Загрузить(Пакеты[2].Выгрузить());
	НачисленияПоДоговорам.Загрузить(Пакеты[3].Выгрузить());
	ДанныеПоКомиссиям.Загрузить(Пакеты[4].Выгрузить());
	ДокументыСКомиссиями.Загрузить(Пакеты[5].Выгрузить());
	
КонецПроцедуры

Процедура ОтправитьВБэкОфис() Экспорт
	
	Отбор = Новый Структура("Регистратор");
	
	Для Каждого ДанныеРегистратора Из ДокументыСКомиссиями Цикл
		
		Отбор.Регистратор = ДанныеРегистратора.Документ;
		ЗаписиПоКомиссиям = ДанныеПоКомиссиям.НайтиСтроки(Отбор);
		
		ТекстыJSON = ТекстыПоСтрокамДокумента(ДанныеРегистратора, ЗаписиПоКомиссиям);
		Если ЗначениеЗаполнено(ТекстыJSON) Тогда
			
			Если ЗаписиПоКомиссиям[0].КлиентОтсутствуетВBQ Тогда
				ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaDepoToDiasCommissionIn1642;
			Иначе
				ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaDepoComissions;
			КонецЕсли;
			
			Для Каждого СтруктураТекстаJSON Из ТекстыJSON Цикл
				ТекстJSON = СтруктураТекстаJSON.Значение;
				Идентификатор = СтруктураТекстаJSON.Представление;
				ОбменДаннымиКафка.ЗаписатьДанныеНабораЗаписиВИсходящиеСообщенияКафка(
				ТекстJSON, ВнешнийИсточник, Идентификатор, ДанныеРегистратора.Документ);
			КонецЦикла;
			
			РегистрыСведений.УслугиДепозитарияВыгруженные.Добавить(ДанныеРегистратора.Документ);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстыПоСтрокамДокумента(ДанныеРегистратора, ЗаписиПоКомиссиям)
	
	Если ЗаписиПоКомиссиям[0].КлиентОтсутствуетВBQ Тогда
		
		Если ЗаписиПоКомиссиям[0].БезАкцептноеСписание И Не ЗначениеЗаполнено(ЗаписиПоКомиссиям[0].НомерСчетаСписанияКомиссии) Тогда
			ТекстОшибки = СтрШаблон("Не указан счет списания депозитарной комиссии в НРБанке у клиента %1",
			ЗаписиПоКомиссиям[0].НаименованиеДоговора);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Возврат Неопределено;
		КонецЕсли;
		
		ТекстыJSON = ОбменДаннымиКафка.УслугиДепозитарияТолькоДепозитарноеОбслуживаниеТекстыJSON(ДанныеРегистратора, ЗаписиПоКомиссиям);
	Иначе
		ТекстыJSON = ОбменДаннымиКафка.УслугиДепозитарияТекстыJSON(ДанныеРегистратора, ЗаписиПоКомиссиям);
	КонецЕсли;
	
	Возврат ТекстыJSON;
	
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
