// Описание: Возвращает значения параметров по списку договоров ДУ на дату.
//
// Параметры:
// МассивДоговоровДУ - Массив - список договоров ДУ
// Параметры - Массив, ПланВидовХарактеристикСсылка.ПараметрыДоговораДУ - список параметров
// Дата - Дата - дата получения среза
//
// Возвращаемое значение:
// Соответствие - ключ: ДоговорДУ, значение: Соответствие(Параметр -> Значение)
//
Функция ЗначенияПараметровДоговоровДУ(МассивДоговоровДУ, Параметры, Знач Дата = '00010101') Экспорт

    Результат = Новый Соответствие;

    Если Не ЗначениеЗаполнено(МассивДоговоровДУ) Или Параметры = Неопределено Тогда
        Возврат Результат;
    КонецЕсли;

    Если ТипЗнч(Параметры) <> Тип("Массив") Тогда
        МассивПараметров = Новый Массив;
        МассивПараметров.Добавить(Параметры);
    Иначе
        МассивПараметров = Параметры;
    КонецЕсли;

    Если Дата = '00010101' Тогда
        Дата = ТекущаяДатаСеанса();
    КонецЕсли;

    Для Каждого ДоговорДУ Из МассивДоговоровДУ Цикл
        ЗначенияПараметровДоговора = Новый Соответствие;
        Для Каждого Параметр Из МассивПараметров Цикл
            ЗначенияПараметровДоговора.Вставить(Параметр, Неопределено);
        КонецЦикла;
        Результат.Вставить(ДоговорДУ, ЗначенияПараметровДоговора);
    КонецЦикла;

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Дата", Дата);
    Запрос.УстановитьПараметр("МассивДоговоровДУ", МассивДоговоровДУ);
    Запрос.УстановитьПараметр("Параметры", МассивПараметров);

    Запрос.Текст =
    "ВЫБРАТЬ
    |    ПараметрыДУ.ДоговорДУ КАК ДоговорДУ,
    |    ПараметрыДУ.Параметр КАК Параметр,
    |    ПараметрыДУ.Значение КАК Значение
    |ИЗ
    |    РегистрСведений.ЗначенияПараметровДоговораДУ.СрезПоследних(
    |            &Дата,
    |            ДоговорДУ В (&МассивДоговоровДУ)
    |                И Параметр В (&Параметры)) КАК ПараметрыДУ";

    ОбщегоНазначенияДУ.ДобавитьВЛогОтладки(Запрос,
        "РегистрСведений.ЗначенияПараметровДоговоровДУ.МодульМенеджера:ЗначенияПараметровДоговоровДУ");

    ВыборкаПараметров = Запрос.Выполнить().Выбрать();
    Пока ВыборкаПараметров.Следующий() Цикл
        ЗначенияПараметровДоговора = Результат.Получить(ВыборкаПараметров.ДоговорДУ);
        Если ЗначенияПараметровДоговора <> Неопределено Тогда
            ЗначенияПараметровДоговора.Вставить(ВыборкаПараметров.Параметр, ВыборкаПараметров.Значение);
        КонецЕсли;
    КонецЦикла;

    Возврат Результат;

КонецФункции
