/////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Депонирование",			Справочники.ВидыОпераций.Депонирование);
	Список.Параметры.УстановитьЗначениеПараметра("СнятиеСДепонирования",	Справочники.ВидыОпераций.СнятиеСДепонирования);
	ОтображатьВсеПоручения = Ложь;
	УстановитьРежимОтбораПоручений();
КонецПроцедуры

/////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура ПерейтиНаСледующий(Команда)
	КоличествоВыделенных = Элементы.Список.ВыделенныеСтроки.Количество();
	Если КоличествоВыделенных > 0 Тогда
		Ссылки = Новый Массив;
		Для Каждого КлючЗаписи Из Элементы.Список.ВыделенныеСтроки Цикл
			Ссылки.Добавить(КлючЗаписи);
		КонецЦикла;
		Ошибки = РезультатПереходаКСледующемуЭтапу(Ссылки);
		Если ЗначениеЗаполнено(Ошибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибки);
		КонецЕсли;		
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыделенные(Команда)
	КоличествоВыделенных = Элементы.Список.ВыделенныеСтроки.Количество();
	Если КоличествоВыделенных > 0 Тогда
		Ссылки = Новый Массив;
		Для Каждого КлючЗаписи Из Элементы.Список.ВыделенныеСтроки Цикл
			Ссылки.Добавить(КлючЗаписи);
		КонецЦикла;
		Ошибки = РезультатИсполненияЭтапаОбработки(Ссылки);
		Если ЗначениеЗаполнено(Ошибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибки);
		КонецЕсли;		
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОбработкиПоручений(Команда)
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		Отбор = Новый Структура("Поручение", Элементы.Список.ТекущаяСтрока);
		Парам = Новый Структура("Отбор", Отбор);
		ОткрытьФорму("РегистрСведений.ЭтапыОбработкиПоручений.Форма.ФормаСписка", Парам);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборПоручений(Команда)
	ОтображатьВсеПоручения = НЕ ОтображатьВсеПоручения;
	УстановитьРежимОтбораПоручений();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьИзОбработки(Команда)
	КоличествоВыделенных = Элементы.Список.ВыделенныеСтроки.Количество();
	Если КоличествоВыделенных > 0 Тогда
		Текст = "Выделенные поручения будут исключены из обработки. Продолжить?";
		Если Вопрос(Текст, РежимДиалогаВопрос.ДаНет, 0) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;

		ИсключитьИзОбработкиНаСервере();
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

/////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ

&НаСервере
Функция РезультатИсполненияЭтапаОбработки(Ссылки)
	ОбработкаОбъект = Обработки.ЭтапыОбработкиПоручений.Создать();
	ОбработкаОбъект.ЗаполнитьИзМассива(Ссылки);
	Возврат ОбработкаОбъект.РезультатИсполненияЭтапаОбработки();
КонецФункции

&НаСервере
Функция РезультатПереходаКСледующемуЭтапу(Ссылки)
	ОбработкаОбъект = Обработки.ЭтапыОбработкиПоручений.Создать();
	ОбработкаОбъект.ЗаполнитьИзМассива(Ссылки);
	Возврат ОбработкаОбъект.РезультатПереходаКСледующемуЭтапу();
КонецФункции

&НаСервере
Процедура УстановитьРежимОтбораПоручений()
	Список.Параметры.УстановитьЗначениеПараметра("ОтображатьВсеПоручения", ОтображатьВсеПоручения);
	Если ОтображатьВсеПоручения Тогда
		Элементы.ФормаОтображатьВсеПоручения.Заголовок	= "Показать только поручения в обработке";
		Элементы.ФормаОтображатьВсеПоручения.Картинка	= БиблиотекаКартинок.ОтборПоТекущемуЗначению;
	Иначе
		Элементы.ФормаОтображатьВсеПоручения.Заголовок	= "Показать все поручения";
		Элементы.ФормаОтображатьВсеПоручения.Картинка	= БиблиотекаКартинок.ОтключитьОтбор;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИсключитьИзОбработкиНаСервере()
	Для Каждого Поручение Из Элементы.Список.ВыделенныеСтроки Цикл
		Если Не Поручение.ПринятьВОбработку Тогда
			Продолжить;
		КонецЕсли;
		ДокументОбъект = Поручение.ПолучитьОбъект();
		ДокументОбъект.ОбменДанными.Загрузка	= Истина;
		ДокументОбъект.ПринятьВОбработку		= Ложь;
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось исключить из обработки " + Поручение + ". "
				+ ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры
