////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем Подключение1 Экспорт;
Перем Подключение2 Экспорт;

////////////////////////////////////////////////////////////////////////////////
// МЕТОДЫ УСТАНОВКИ СОЕДИНЕНИЯ

// Выполняет соединение с удаленной базой данных
//
// Параметры
//  НомерБД      - Число(1,2) - номер БД
//
// Возвращаемое значение:
//   Булево      - Истина - успешное соединение, Ложь - ошибка соединения
//
Функция СоединениеУстановлено(СтрокаСоединения, НомерБД) Экспорт
	
	Подключение = ЭтотОбъект["Подключение"+НомерБД];
	
	Если ТипЗнч(Подключение) = Тип("COMОбъект") Тогда
	
		Возврат Истина;
	
	КонецЕсли; 
	
	Попытка
	
		ВнешнееСоединение = Новый COMОбъект("V83.COMConnector");
		Подключение = ВнешнееСоединение.Connect(СтрокаСоединения);
	
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки()); 
		Возврат Ложь;
	
	КонецПопытки; 
	
	ЭтотОбъект["Подключение"+НомерБД] = Подключение;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Соединение установлено"); 
	Возврат Истина;

КонецФункции // СоединениеУстановлено()

// Формируем строку соединения с БД
//
// Параметры
//  НомерБД      - Число(1,2) - номер БД
//
// Возвращаемое значение:
//   Строка      – Строка соединения с базой данных
//
Функция СформироватьСтрокуСоединения(НомерБД) Экспорт 

	ИмяБД 		 = ЭтотОбъект["ИмяБД"+НомерБД];
	ИмяСервера 	 = ЭтотОбъект["ИмяСервера"+НомерБД];
	Пользователь = ЭтотОбъект["Пользователь"+НомерБД];
	Пароль 		 = ЭтотОбъект["Пароль"+НомерБД];
	
	ФайловыйВариант = ЭтотОбъект["ТипСоединения"+НомерБД];
	
	Если ФайловыйВариант Тогда
	
		СтрокаСоединения = "File=""" + ИмяБД + """;Usr="""+ Пользователь + """;" + """;Pwd=""" + Пароль + """;"; 
	
	Иначе
	
		СтрокаСоединения = "Srvr=""" + ИмяСервера + """;Ref="""+ ИмяБД + """;Usr="""+ Пользователь + """;" + """;Pwd=""" + Пароль + """;"; 
	
	КонецЕсли; 
	
	Возврат СтрокаСоединения;

КонецФункции // СформироватьСтрокуСоединения()


////////////////////////////////////////////////////////////////////////////////
// МЕТОДЫ СИНХРОНИЗАЦИИ

Функция ПолучитьДанныеТекущейБД(ИмяОбъекта, НомерБД, ТолькоСтруктура) Экспорт
	
	Запрос = Новый Запрос;
	
	Иерархический = Метаданные.Справочники[ИмяОбъекта].Иерархический;
	
	Запрос.Текст = "ВЫБРАТЬ " + ?(ТолькоСтруктура, "Первые 0 ", "") 
	+ ?(Иерархический, " ЭтоГруппа, ", " ЛОЖЬ КАК ЭтоГруппа, ")
	+ " * ИЗ Справочник." + ИмяОбъекта + " АВТОУПОРЯДОЧИВАНИЕ";
	
	тмпТаблДанных = Запрос.Выполнить().Выгрузить();
	
	Возврат тмпТаблДанных;

КонецФункции // ПолучитьДанныеТекущейБД()

Функция ПолучитьСтруктуруТаблицыУдаленнойБД(НомерБД, ИмяОбъекта)
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("Ссылка");
	ТЗ.Колонки.Добавить("ПометкаУдаления");
	ТЗ.Колонки.Добавить("Предопределенный");
	ТЗ.Колонки.Добавить("Код");
	ТЗ.Колонки.Добавить("Наименование");
	ТЗ.Колонки.Добавить("ЭтоГруппа");
	
	Подключение = ЭтотОбъект["Подключение"+НомерБД];
	РеквизитыМД = Подключение.Метаданные.Справочники[ИмяОбъекта].Реквизиты;
	
	Для Каждого Реквизит Из РеквизитыМД Цикл
		ТЗ.Колонки.Добавить(Реквизит.Имя);
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции

Функция ПолучитьДанныеУдаленнойБД(ИмяОбъекта, НомерБД, СтрокаСоединения, ТолькоСтруктура) Экспорт
	
	Если СоединениеУстановлено(СтрокаСоединения, НомерБД) Тогда 
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
	ТЗ = ПолучитьСтруктуруТаблицыУдаленнойБД(НомерБД, ИмяОбъекта);
	
	Если Не ТолькоСтруктура Тогда 
		
		Запрос = ЭтотОбъект["Подключение"+НомерБД].NewObject("Запрос");
		Иерархический = ЭтотОбъект["Подключение"+НомерБД].Метаданные.Справочники[ИмяОбъекта].Иерархический;
		
		Запрос.Текст = "ВЫБРАТЬ " + ?(ТолькоСтруктура, "Первые 0 ", "") 
					 + ?(Иерархический, " ЭтоГруппа, ", " ЛОЖЬ КАК ЭтоГруппа, ")
					 + " * ИЗ Справочник." + ИмяОбъекта + " АВТОУПОРЯДОЧИВАНИЕ";
					 
		тмпТаблДанных = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаТЗ Из тмпТаблДанных Цикл
			НоваяСтрока = ТЗ.Добавить();
			Для Каждого Колонка Из ТЗ.Колонки Цикл 
				Если ТипЗнч(СтрокаТЗ[Колонка.Имя]) = Тип("COMОбъект") Тогда 
					НоваяСтрока[Колонка.Имя] = ЭтотОбъект["Подключение"+НомерБД].XMLString(СтрокаТЗ[Колонка.Имя]);
				Иначе 
					НоваяСтрока[Колонка.Имя] = СтрокаТЗ[Колонка.Имя];
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТЗ;

КонецФункции // ПолучитьДанныеУдаленнойБД()

// Корректировка объекта
//
// Параметры
//  ИмяСправочника- Строка - Имя справочника, объект которого нужно изменить
//  СтрокаТЗ     – СтрокаТабличногоПоля – Строка с обновляемыми данными
//  Колонка      – Строка – Имя измененной колонки
//  Текущая      – Булево – Признак текущей БД
//
Процедура ЗаписатьОбъект(ИмяСправочника, СтрокаТЗ, Колонка, Текущая) Экспорт

	Если Текущая Тогда
		
		Объект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
		
	Иначе
		
		УИД = Подключение2.NewObject("УникальныйИдентификатор", СтрокаТЗ.Ссылка);
		Объект = Подключение2.Справочники[ИмяСправочника].ПолучитьСсылку(УИД).ПолучитьОбъект();
		
	КонецЕсли; 
	
	Объект[Колонка] = СтрокаТЗ[Колонка];
	
	Попытка
	
		Объект.Записать();
	
	Исключение
	
	КонецПопытки; 

КонецПроцедуры // ЗаписатьОбъект()

Процедура ОбновитьСправочник(СтрокаСоединения, БД2Текущая, ТЗ1, ТЗ2, Колонка_2) Экспорт 
	
	Если БД2Текущая Тогда 
		Менеджер = Справочники[Объект2];
	Иначе 
		Если СоединениеУстановлено(СтрокаСоединения, 2) Тогда 
			Менеджер = Подключение2.Справочники[Объект2];
		Иначе 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЕстьФильтр = Не ПустаяСтрока(ПравилоУсловия);
	
	Поиск = Новый Соответствие;
	Для Каждого СтрокаТЧ Из ТЗ1 Цикл
		Если Не СтрокаТЧ.Синхронизирован Тогда
			Продолжить;
		КонецЕсли; 
		
		Поиск.Вставить(СтрокаТЧ.Нпп, ТЗ1.Индекс(СтрокаТЧ));
		
	КонецЦикла;
	
	Для Каждого Строка_2 Из ТЗ2 Цикл
		
		Если Строка_2.Синхронизирован Тогда
			
			Попытка
				
				Если ЕстьФильтр
					И Вычислить(ПравилоУсловия) Тогда
					
					Продолжить;
					
				КонецЕсли; 
				
				Строка_1 = ТЗ1[Поиск[Строка_2.Соответствие]];
				
				тмпЗначение = Вычислить(ПравилоЗаполнения);
				
				Если Строка_2[Колонка_2] <> тмпЗначение Тогда
					
					Строка_2[Колонка_2] = тмпЗначение;
					
					ЗаписатьОбъект(Объект2, Строка_2, Колонка_2, БД2Текущая);
					
				КонецЕсли; 
				
			Исключение
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки()); 
				Возврат;
				
			КонецПопытки; 
			
		КонецЕсли; 
	
	КонецЦикла;
	
КонецПроцедуры

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
