
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщегоНазначенияКлиентСервер.УстановитьОтборыДинамическогоСпискаПоУмолчанию(ЭтотОбъект, Список.Отбор, "Список");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	Справочники.КлассификаторРегионов.ЗаполнитьКлассификаторЗначениямиПоУмолчанию();
КонецПроцедуры

#КонецОбласти
