

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьДеревоОбъектовИБлоков();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовИБлоковПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ДеревоОбъектовИБлоков.ТекущаяСтрока = Неопределено Тогда
		ОтборыСписковКлиентСервер.УдалитьЭлементОтбораСписка(Список, "Объект");
		ОтборыСписковКлиентСервер.УдалитьЭлементОтбораСписка(Список, "Блок");
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = ДеревоОбъектовИБлоков.НайтиПоИдентификатору(Элементы.ДеревоОбъектовИБлоков.ТекущаяСтрока);	
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Объект", ТекущаяСтрока.Объект, Истина);
	Если ЗначениеЗаполнено(Строка(ТекущаяСтрока.Блок)) Тогда
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Блок", ТекущаяСтрока.Блок, Истина);
	Иначе
		ОтборыСписковКлиентСервер.УдалитьЭлементОтбораСписка(Список, "Блок");
	КонецЕСли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаполнениеНаОсновеШаблона(Команда)
	
	СписокОбъектов = СписокОбъектовИспользующихРегистрНаСервере();
	
	Если СписокОбъектов.Количество() = 1 Или СписокОбъектов.ОтметитьЭлементы("Объекты для заполнения") Тогда
		
		СоздатьЗаполнениеНаОсновеШаблонаНаСервере(СписокОбъектов);
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеПоТиповымНастройкам(Команда)
	
	СписокОбъектов = СписокОбъектовИспользующихРегистрНаСервере();
	
	Если СписокОбъектов.Количество() = 1 Или СписокОбъектов.ОтметитьЭлементы("Объекты для заполнения") Тогда
		
		ЗаполнениеПоТиповымНастройкамНаСервере(СписокОбъектов);
		
		Элементы.Список.Обновить();
		
	КонецЕсли;

КонецПроцедуры



&НаСервереБезКонтекста
Функция СписокОбъектовИспользующихРегистрНаСервере()
	
	Список = РегистрыСведений.НастройкиРазбораТекстовыхДанных.ОбъектыИспользующиеРегистр();
	
	Если Список.Количество() = 1 Тогда
		Список[0].Пометка = Истина;
	КонецЕсли;
	
	Возврат Список;
	
КонецФункции

&НаСервере
Процедура СоздатьЗаполнениеНаОсновеШаблонаНаСервере(ОбъектыИспользующиеРегистр)
	
	Для Каждого СтрокаОбъекта Из ОбъектыИспользующиеРегистр Цикл
		
		Если СтрокаОбъекта.Пометка Тогда
			
			РегистрыСведений.НастройкиРазбораТекстовыхДанных.СоздатьЗаполнениеНаОсновеШаблона(СтрокаОбъекта.Значение);
			
		КонецЕсли;		
		
	КонецЦикла;
	
	ОбновитьДеревоОбъектовИБлоков();

	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеПоТиповымНастройкамНаСервере(ОбъектыИспользующиеРегистр)
	
	Для Каждого СтрокаОбъекта Из ОбъектыИспользующиеРегистр Цикл
		
		Если СтрокаОбъекта.Пометка Тогда
			
			РегистрыСведений.НастройкиРазбораТекстовыхДанных.ВыполнитьТиповоеЗаполнение(СтрокаОбъекта.Значение);
			
		КонецЕсли;		
		
	КонецЦикла;
	
	ОбновитьДеревоОбъектовИБлоков();

	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоОбъектовИБлоков()
	
	ДеревоОбъектовИБлоков.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиРазбораТекстовыхДанных.Объект КАК Объект,
	               |	НастройкиРазбораТекстовыхДанных.Блок КАК Блок
	               |ИЗ
	               |	РегистрСведений.НастройкиРазбораТекстовыхДанных КАК НастройкиРазбораТекстовыхДанных
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НастройкиРазбораТекстовыхДанных.Объект,
	               |	НастройкиРазбораТекстовыхДанных.Блок
	               |ИТОГИ ПО
	               |	Объект";
	
	ДеревоРезультата = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого СтрокаОбъекта Из ДеревоРезультата.Строки Цикл
		
		НоваяСтрокаОбъекта = ДеревоОбъектовИБлоков.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаОбъекта, СтрокаОбъекта);
		
		
		Для Каждого СтрокаБлока Из СтрокаОбъекта.Строки Цикл
			
			НоваяСтрокаБлока = НоваяСтрокаОбъекта.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаБлока, СтрокаБлока);
			
		КонецЦикла;
	КонецЦикла;
	
	Элементы.ДеревоОбъектовИБлоков.Обновить();		
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

	


