///////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС МОДУЛЯ

Процедура ЗаполнитьЖурналВходящихДокументов(Знач НачалоПериода, Знач КонецПериода) Экспорт
	НачалоПериода = НачалоДня(НачалоПериода);
	КонецПериода = КонецДня(КонецПериода);
	
	РегистрыСведений.ЖурналВходящихДокументов.УдалитьЗаписиЗаПериод(НачалоПериода, КонецПериода);
	
	// Заполнить регистр данными за указанный период
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("КлассОперацийПоручений", Перечисления.КлассыОпераций.Инвентарные);
	Запрос.УстановитьПараметр("ПользовательРОБОТ", Константы.ПользовательРобот.Получить());
	Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяЦеннаяБумага", Справочники.ЦенныеБумаги.ПустаяСсылка());
	Запрос.УстановитьПараметр("СписокДопустимыхЗначенийРеквизитаДокументКД", СписокПустыхЗначенийРеквизитаДокументКД());
	
	ВидыОперацийПорученияНаДатуИсполнения = Новый Массив;
	ВидыОперацийПорученияНаДатуИсполнения.Добавить(Справочники.ВидыОпераций.Депонирование);
	ВидыОперацийПорученияНаДатуИсполнения.Добавить(Справочники.ВидыОпераций.СнятиеСДепонирования);
	ВидыОперацийПорученияНаДатуИсполнения.Добавить(Справочники.ВидыОпераций.Перемещение);
	Запрос.УстановитьПараметр("ВидыОперацийПорученияНаДатуИсполнения", ВидыОперацийПорученияНаДатуИсполнения);
	Запрос.УстановитьПараметр("КлассОперацийГлобальные", Перечисления.КлассыОпераций.Глобальные);
	Запрос.УстановитьПараметр("ОтменаПоручения", Справочники.ВидыОпераций.ОтменаПоручения);
	Запрос.УстановитьПараметр("МестоХраненияПоУмолчанию", Константы.МестоХраненияПоУмолчанию.Получить());
	
	ВидыКДДляРСВ = Справочники.ВидыКорпоративныхДействий.ВидыКДРСВДляЖурналовВходящихИсходящих();
	Запрос.УстановитьПараметр("ВидыКДДляРСВ", ВидыКДДляРСВ);
	
	ТипыСчетовДепоМХОтчетаНРД40 = Новый Массив;
	ТипыСчетовДепоМХОтчетаНРД40.Добавить(Перечисления.ТипыСчетовДепо.НоминальногоДержателя);
	ТипыСчетовДепоМХОтчетаНРД40.Добавить(Перечисления.ТипыСчетовДепо.НоминальногоДержателяТорговый);
	ТипыСчетовДепоМХОтчетаНРД40.Добавить(Перечисления.ТипыСчетовДепо.КлиринговыйСчетДЕПО_КСУ_GC_Bonds);
	ТипыСчетовДепоМХОтчетаНРД40.Добавить(Перечисления.ТипыСчетовДепо.КлиринговыйСчетДЕПО_КСУ_GC_Expanded);
	ТипыСчетовДепоМХОтчетаНРД40.Добавить(Перечисления.ТипыСчетовДепо.КлиринговыйСчетДЕПО_КСУ_GC_Shares);
	Запрос.УстановитьПараметр("ТипыСчетовДепоМХОтчетаНРД40", ТипыСчетовДепоМХОтчетаНРД40);
	
	// Получим депонентов из состава сводных поручений
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоставПоручения.Ссылка КАК Ссылка,
	|	МАКСИМУМ(СоставПоручения.Депонент) КАК Депонент
	|ПОМЕСТИТЬ втСоставПоручения
	|ИЗ
	|	Документ.иц_СводноеПоручение.СоставПоручения КАК СоставПоручения
	|ГДЕ
	|	СоставПоручения.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СоставПоручения.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	СоставПоручения.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СоставПоручения.Ссылка
	|";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтветСубброкераНаРаскрытиеДанныеСубброкера.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ОтветСубброкераНаРаскрытиеДанныеСубброкера.Клиент) КАК Клиент,
	|	МАКСИМУМ(ОтветСубброкераНаРаскрытиеДанныеСубброкера.ЦеннаяБумага) КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втКлиентыОтветСубброкераНаРаскрытие
	|ИЗ
	|	Документ.ОтветСубброкераНаРаскрытие.ДанныеСубброкера КАК ОтветСубброкераНаРаскрытиеДанныеСубброкера
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтветСубброкераНаРаскрытиеДанныеСубброкера.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Поручение.Ссылка КАК Основание,
	|	Поручение.Дата КАК Период,
	|	Поручение.Номер КАК НомерОснования,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(Поручение.ВидОперацииД КАК Справочник.ВидыОпераций).КлассОпераций = &КлассОперацийГлобальные
	|				И ВЫРАЗИТЬ(Поручение.ВидОперацииД КАК Справочник.ВидыОпераций).ВыплатаДоходаВДенежнойФорме
	|			ТОГДА ""Извещение о выплате и перечислении денежных средств""
	|		ИНАЧЕ ""Поручение""
	|	КОНЕЦ КАК НаименованиеДокументаИлиКомплекта,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(Поручение.ВидОперацииД КАК Справочник.ВидыОпераций).КлассОпераций = &КлассОперацийГлобальные
	|				И ВЫРАЗИТЬ(Поручение.ВидОперацииД КАК Справочник.ВидыОпераций).ДвижениеПоЦБ
	|			ТОГДА Поручение.КодОтчетаНРД
	|		КОГДА ВЫРАЗИТЬ(Поручение.ВидОперацииД КАК Справочник.ВидыОпераций).ВыплатаДоходаВДенежнойФорме
	|			ТОГДА Поручение.НомерИПД
	|		ИНАЧЕ Поручение.Номер
	|	КОНЕЦ КАК ИсходящийНомер,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(Поручение.ВидОперацииД КАК Справочник.ВидыОпераций).ВыплатаДоходаВДенежнойФорме
	|			ТОГДА Поручение.ДатаПлатежногоПоручения
	|		ИНАЧЕ Поручение.Дата
	|	КОНЕЦ КАК ДатаОтправления,
	|	ВЫБОР
	|		КОГДА Поручение.ВидОперацииД = &ОтменаПоручения
	|				И Поручение.ОтменяемоеПоручение ССЫЛКА Документ.Поручение
	|			ТОГДА Поручение.ОтменяемоеПоручение.Депонент
	|		КОГДА Поручение.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|				И Поручение.ТипПеревода = ЗНАЧЕНИЕ(Перечисление.ТипыПереводов.Зачисление)
	|			ТОГДА Поручение.Контрагент
	|		КОГДА Поручение.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|				И Поручение.ТипПеревода = ЗНАЧЕНИЕ(Перечисление.ТипыПереводов.Списание)
	|			ТОГДА Поручение.Депонент
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(Поручение.СчетДепо КАК Справочник.СчетаДепо).Владелец, Поручение.Депонент)
	|	КОНЕЦ КАК Депонент,
	|	ВЫБОР
	|		КОГДА Поручение.ВидОперацииД = &ОтменаПоручения
	|				И Поручение.ОтменяемоеПоручение ССЫЛКА Документ.Поручение
	|			ТОГДА Поручение.ОтменяемоеПоручение.ЦБ
	|		ИНАЧЕ Поручение.ЦБ
	|	КОНЕЦ КАК ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(Поручение.ВидОперацииД КАК Справочник.ВидыОпераций).КлассОпераций = &КлассОперацийГлобальные
	|				И ВЫРАЗИТЬ(Поручение.ВидОперацииД КАК Справочник.ВидыОпераций).ВыплатаДоходаВДенежнойФорме
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(Поручение.ПлатежныйАгент)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(Поручение.Инициатор)
	|	КОНЕЦ КАК ЛицоНаправившееДокумент,
	|	Поручение.Автор КАК Исполнитель,
	|	Поручение.СпособПриемаПоручений.Наименование + "" "" + ПОДСТРОКА(СТРОКА(Поручение.ДатаПриема), 1, 10) КАК Комментарий,
	|	ВЫБОР
	|		КОГДА Поручение.ВидОперацииД = &ОтменаПоручения
	|				И Поручение.ОтменяемоеПоручение ССЫЛКА Документ.Поручение
	|			ТОГДА Поручение.ОтменяемоеПоручение.Номер
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОтменяемоеПоручениеНомер,
	|	ВЫБОР
	|		КОГДА Поручение.ВидОперацииД = &ОтменаПоручения
	|				И Поручение.ОтменяемоеПоручение ССЫЛКА Документ.Поручение
	|			ТОГДА Поручение.ОтменяемоеПоручение.Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ОтменяемоеПоручениеДата
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Поручение.Проведен
	|	И ВЫБОР
	|			КОГДА Поручение.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ОткрытиеРазделаСчетаДепо)
	|					ИЛИ Поручение.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ЗакрытиеРазделаСчетаДепо)
	|				ТОГДА ВЫБОР
	|						КОГДА Поручение.Депонент ССЫЛКА Справочник.Контрагенты
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Поручение.Ссылка,
	|	Поручение.ДатаИсполненияПоручения,
	|	""О"",
	|	""Отчет"",
	|	Поручение.КодОтчетаНРД,
	|	Поручение.ДатаИсполненияПоручения,
	|	Поручение.Депонент,
	|	Поручение.ЦБ,
	|	Поручение.МХДепонента.Наименование,
	|	ВЫБОР
	|		КОГДА Поручение.Изменил = &ПустойПользователь
	|			ТОГДА &ПользовательРОБОТ
	|		ИНАЧЕ Поручение.Изменил
	|	КОНЕЦ,
	|	Поручение.СпособПриемаПоручений.Наименование + "" "" + ПОДСТРОКА(СТРОКА(Поручение.ДатаПриема), 1, 10),
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.ДатаИсполненияПоручения МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Поручение.Проведен
	|	И ВЫРАЗИТЬ(Поручение.ВидОперацииД КАК Справочник.ВидыОпераций).КлассОпераций = &КлассОперацийПоручений
	|	И Поручение.ВидОперацииД В(&ВидыОперацийПорученияНаДатуИсполнения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СводноеПоручение.Ссылка,
	|	СводноеПоручение.Дата,
	|	СводноеПоручение.Номер,
	|	""Сводное поручение депо"",
	|	СводноеПоручение.Номер,
	|	СводноеПоручение.Дата,
	|	втСоставПоручения.Депонент,
	|	&ПустаяЦеннаяБумага,
	|	СводноеПоручение.Инициатор.Наименование,
	|	&ПользовательРОБОТ,
	|	"""",
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	Документ.иц_СводноеПоручение КАК СводноеПоручение
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСоставПоручения КАК втСоставПоручения
	|		ПО СводноеПоручение.Ссылка = втСоставПоручения.Ссылка
	|ГДЕ
	|	СводноеПоручение.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СводноеПоручение.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Входящий.Ссылка,
	|	Входящий.Дата,
	|	Входящий.Номер,
	|	Входящий.НаименованиеДокументаИлиКомплекта,
	|	Входящий.ИсходящийНомер,
	|	Входящий.ДатаОтправления,
	|	Входящий.Депонент,
	|	Входящий.ЦеннаяБумага,
	|	Входящий.ЛицоНаправившееДокумент,
	|	Входящий.Исполнитель,
	|	Входящий.Комментарий,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	Документ.Входящий КАК Входящий
	|ГДЕ
	|	Входящий.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Входящий.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭтапыКД.ДокументКД,
	|	ЭтапыКД.Период,
	|	""КД"",
	|	ВЫБОР
	|		КОГДА ЭтапыКД.ЭтапКД.КомплектДокументов <> """"
	|			ТОГДА ЭтапыКД.ЭтапКД.КомплектДокументов + "". КД Референс "" + ЭтапыКД.КД.КДРеференс
	|		ИНАЧЕ ЭтапыКД.ЭтапКД.Наименование + "". КД Референс "" + ЭтапыКД.КД.КДРеференс
	|	КОНЕЦ,
	|	ЭтапыКД.НомерСообщения,
	|	ЭтапыКД.Период,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ЭтапыКД.ДокументКД ССЫЛКА Документ.Поручение
	|			ТОГДА ЭтапыКД.ДокументКД.ЦБ
	|		КОГДА ЭтапыКД.ДокументКД ССЫЛКА Документ.КорпоративноеДействие_Новый
	|				ИЛИ ЭтапыКД.ДокументКД ССЫЛКА Документ.РаскрытиеСпискаВладельцев
	|			ТОГДА ЭтапыКД.ДокументКД.ЦеннаяБумага1
	|	КОНЕЦ,
	|	Константы.МестоХраненияПоУмолчанию.Наименование,
	|	&ПользовательРОБОТ,
	|	"""",
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	РегистрСведений.ЭтапыКД КАК ЭтапыКД,
	|	Константы КАК Константы
	|ГДЕ
	|	ЭтапыКД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ЭтапыКД.Исходящее
	|	И ЭтапыКД.КодОтчета <> ""CA061""
	|	И (ЭтапыКД.ДокументКД В (&СписокДопустимыхЗначенийРеквизитаДокументКД)
	|			ИЛИ ЭтапыКД.ДокументКД ССЫЛКА Документ.Поручение
	|			ИЛИ (ЭтапыКД.ДокументКД ССЫЛКА Документ.КорпоративноеДействие_Новый
	|				ИЛИ ЭтапыКД.ДокументКД ССЫЛКА Документ.РаскрытиеСпискаВладельцев)
	|				И (ЭтапыКД.ДокументКД.ЦеннаяБумага1 = &ПустаяЦеннаяБумага
	|					ИЛИ ЭтапыКД.ДокументКД.ЦеннаяБумага1.НФИ = 0))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспоряжениеОператораСчетаДЕПО.Ссылка,
	|	РаспоряжениеОператораСчетаДЕПО.Дата,
	|	РаспоряжениеОператораСчетаДЕПО.Номер,
	|	""Распоряжение оператора счета депо на расчеты по сделке"",
	|	РаспоряжениеОператораСчетаДЕПО.ВходящийНомер,
	|	РаспоряжениеОператораСчетаДЕПО.Дата,
	|	РаспоряжениеОператораСчетаДЕПО.Депонент,
	|	РаспоряжениеОператораСчетаДЕПО.ЦеннаяБумага,
	|	РаспоряжениеОператораСчетаДЕПО.Оператор,
	|	РаспоряжениеОператораСчетаДЕПО.Автор,
	|	РаспоряжениеОператораСчетаДЕПО.ДопИнформация,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	Документ.РаспоряжениеОператораСчетаДЕПО КАК РаспоряжениеОператораСчетаДЕПО
	|ГДЕ
	|	РаспоряжениеОператораСчетаДЕПО.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РаспоряжениеОператораСчетаДЕПО.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтветСубброкераНаРаскрытие.Ссылка,
	|	ОтветСубброкераНаРаскрытие.Дата,
	|	ОтветСубброкераНаРаскрытие.Номер,
	|	""Ответ субброкера на раскрытие"",
	|	ОтветСубброкераНаРаскрытие.НомерДокументаСубброкера,
	|	ОтветСубброкераНаРаскрытие.ДатаДокументаСубброкера,
	|	втКлиентыОтветСубброкераНаРаскрытие.Клиент,
	|	втКлиентыОтветСубброкераНаРаскрытие.ЦеннаяБумага,
	|	втКлиентыОтветСубброкераНаРаскрытие.Клиент.Наименование,
	|	&ПользовательРОБОТ,
	|	"""",
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	Документ.ОтветСубброкераНаРаскрытие КАК ОтветСубброкераНаРаскрытие
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКлиентыОтветСубброкераНаРаскрытие КАК втКлиентыОтветСубброкераНаРаскрытие
	|		ПО ОтветСубброкераНаРаскрытие.Ссылка = втКлиентыОтветСубброкераНаРаскрытие.Ссылка
	|ГДЕ
	|	ОтветСубброкераНаРаскрытие.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаскрытиеСпискаВладельцев.Ссылка,
	|	РаскрытиеСпискаВладельцев.ВходящийДокументДата,
	|	""КД"",
	|	""Запрос на раскрытие списка владельцев. КД Референс "" + РаскрытиеСпискаВладельцев.КДРеференс,
	|	РаскрытиеСпискаВладельцев.ВходящийДокументНомер,
	|	РаскрытиеСпискаВладельцев.ВходящийДокументДата,
	|	NULL,
	|	РаскрытиеСпискаВладельцев.ЦеннаяБумага1,
	|	РаскрытиеСпискаВладельцев.СчетДЕПО.Владелец,
	|	РаскрытиеСпискаВладельцев.Автор,
	|	"""",
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|ГДЕ
	|	РаскрытиеСпискаВладельцев.ВходящийДокументДата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РаскрытиеСпискаВладельцев.ВидКорпоративногоДействия В(&ВидыКДДляРСВ)
	|	И РаскрытиеСпискаВладельцев.ТипЗагрузкиСписковРаскрытия <> ЗНАЧЕНИЕ(Перечисление.ТипЗагрузкиСписковРаскрытия.PARTAD)
	|	И НЕ РаскрытиеСпискаВладельцев.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Настройки.Наименование,
	|	ДОБАВИТЬКДАТЕ(Календарь.Период, СЕКУНДА, РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Настройки.ДатаНачалаДействия, ДЕНЬ), Настройки.ДатаНачалаДействия, СЕКУНДА)),
	|	Настройки.ПрефиксНомераДокумента,
	|	Настройки.НаименованиеДокументаИлиКомплекта,
	|	Настройки.ПрефиксИсходящегоНомера + ""<ПериодВФорматеYYMMDDHHmm>"",
	|	ДОБАВИТЬКДАТЕ(Календарь.Период, СЕКУНДА, РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Настройки.ДатаНачалаДействия, ДЕНЬ), Настройки.ДатаНачалаДействия, СЕКУНДА)),
	|	Настройки.Депонент,
	|	NULL,
	|	Настройки.ЛицоНаправившееДокумент,
	|	Настройки.Исполнитель,
	|	Настройки.Комментарий,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	Справочник.НастройкиФиксированныхЗаписейЖурналаВходящихДокументов КАК Настройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Календарь КАК Календарь
	|		ПО (НЕ Календарь.Значение)
	|			И (Календарь.Период МЕЖДУ &НачалоПериода И &КонецПериода)
	|			И (НЕ Настройки.ПометкаУдаления)
	|			И (НАЧАЛОПЕРИОДА(Настройки.ДатаНачалаДействия, ДЕНЬ) <= Календарь.Период)
	|			И (ВЫБОР
	|				КОГДА Настройки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				КОГДА Настройки.ДатаОкончанияДействия > Календарь.Период
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВходящийПакетИзФайловогоШлюза.Ссылка,
	|	ВходящийПакетИзФайловогоШлюза.Дата,
	|	""П"",
	|	""Отчет НКО АО НРД ("" + СОКРЛП(ВходящийПакетИзФайловогоШлюза.КодОперации) + "") "" + ЕСТЬNULL(СчетаДепоМХ.Код, """"),
	|	ВходящийПакетИзФайловогоШлюза.НомерВходящегоДокумента,
	|	ВходящийПакетИзФайловогоШлюза.ДатаВходящегоДокумента,
	|	NULL,
	|	NULL,
	|	""НКО АО НРД"",
	|	&ПользовательРОБОТ,
	|	"""",
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	Документ.ВходящийПакетИзФайловогоШлюза КАК ВходящийПакетИзФайловогоШлюза
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК ВходящийПакетИзФайловогоШлюзаСодержимоеФайла
	|		ПО ВходящийПакетИзФайловогоШлюза.Ссылка = ВходящийПакетИзФайловогоШлюзаСодержимоеФайла.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепоМХ КАК СчетаДепоМХ
	|		ПО (ВходящийПакетИзФайловогоШлюзаСодержимоеФайла.Элемент = ""DEPO_ACC_C"")
	|			И (ВходящийПакетИзФайловогоШлюзаСодержимоеФайла.Значение = СчетаДепоМХ.Код)
	|			И (ВходящийПакетИзФайловогоШлюза.КодОперации = ""40"")
	|ГДЕ
	|	ВходящийПакетИзФайловогоШлюза.КодОперации В (""40"", ""41"", ""14"")
	|	И ВходящийПакетИзФайловогоШлюза.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВЫБОР
	|			КОГДА ВходящийПакетИзФайловогоШлюза.КодОперации = ""40""
	|				ТОГДА СчетаДепоМХ.Владелец = &МестоХраненияПоУмолчанию
	|						И СчетаДепоМХ.ТипСчета В (&ТипыСчетовДепоМХОтчетаНРД40)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВходящийПакетИзФайловогоШлюза.Ссылка,
	|	ВходящийПакетИзФайловогоШлюза.Дата,
	|	ВходящийПакетИзФайловогоШлюза.НомерВходящегоДокумента,
	|	ВходящийПакетИзФайловогоШлюза.ДатаВходящегоДокумента,
	|	СчетаДепоМХ.Код
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Основание";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредДень = Дата("00010101");	// Предыдущее значение для генерации последовательности номеров
	НомерВнутриДня = 1;
	
	Если Выборка.Количество() = 0 Тогда
		ТекстСообщения = "Не обнаружены данные за " + ПредставлениеПериода(НачалоПериода, КонецПериода)
			+ " для заполнения регистра сведений ""Журнал входящих документов""";
	Иначе
		Пока Выборка.Следующий() Цикл
			Если Документы.Поручение.ЭтоПоручениеНФИ(Выборка.Основание) Тогда
				Продолжить;
			КонецЕсли;
			
			// Генерация номера внутри дня
			Если НачалоДня(ПредДень) = НачалоДня(Выборка.Период) Тогда // день не изменился - продолжаем нумерацию
				НомерВнутриДня = НомерВнутриДня + 1;
			Иначе // день сменился - начинаем новую нумерацию
				НомерВнутриДня = 1;
			КонецЕсли;
			ПредДень = Выборка.Период;
			
			// Формирование записи регистра
			НаборЗаписей = РегистрыСведений.ЖурналВходящихДокументов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Основание.Установить(Выборка.Основание);
			НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			
			Если НоваяЗапись.ИсходящийНомер = "0" Тогда
				НоваяЗапись.ИсходящийНомер = "б/н";
			КонецЕсли;
			
			Если СтрНайти(НоваяЗапись.ИсходящийНомер, "<ПериодВФорматеYYMMDDHHmm>") <> 0 Тогда
				ДатаСтрокой = Формат(Выборка.Период, "ДФ=""yyMMddHHmm""");
				НоваяЗапись.ИсходящийНомер = СтрЗаменить(НоваяЗапись.ИсходящийНомер, "<ПериодВФорматеYYMMDDHHmm>", ДатаСтрокой);
			КонецЕсли;
				
			НоваяЗапись.НомерДокумента = БуквыПрефиксаНомера(Выборка.НомерОснования)
				+ Формат(Выборка.Период, "ДФ=ггММдд-") + Формат(НомерВнутриДня, "ЧЦ=5;ЧВН=1;ЧГ=0");
				
			Если ЗначениеЗаполнено(Выборка.ОтменяемоеПоручениеНомер) Тогда
				НоваяЗапись.Комментарий = "Отмена поручения № " + СокрЛП(Выборка.ОтменяемоеПоручениеНомер) + " от " + Формат(Выборка.ОтменяемоеПоручениеДата, "ДФ=dd.MM.yyyy");
			КонецЕсли;
			
			НаборЗаписей.Записать();
		КонецЦикла;
		ТекстСообщения = "Заполнен регистр сведений ""Журнал входящих документов"" за "
			+ ПредставлениеПериода(НачалоПериода, КонецПериода);
	КонецЕсли;
	ЗаписьЖурналаРегистрации("Заполнение журналов ДЕПО", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
КонецПроцедуры

Процедура ЗаполнитьЖурналИсходящихДокументов(Знач НачалоПериода, Знач КонецПериода) Экспорт
	НачалоПериода = НачалоДня(НачалоПериода);
	КонецПериода = КонецДня(КонецПериода);
	
	РегистрыСведений.ЖурналИсходящихДокументов.УдалитьЗаписиЗаПериод(НачалоПериода, КонецПериода);
	
	ВидыОтчетаПоСчетуДЕПО = Новый Массив;
	ВидыОтчетаПоСчетуДЕПО.Добавить(Перечисления.ВидыОтчетов.ВыпискаОСостоянииСчетаДЕПО);
	ВидыОтчетаПоСчетуДЕПО.Добавить(Перечисления.ВидыОтчетов.ОтчетОбОперацияхПоСчетуДЕПО);
	ВидыОтчетаПоСчетуДЕПО.Добавить(Перечисления.ВидыОтчетов.СводныйОтчетОСовершеннойОперации);
	
	ЭтапыУведомлениеКлиентов = Новый Массив;
	ЭтапыУведомлениеКлиентов.Добавить(Справочники.ЭтапыКД.УведомлениеКлиентов);
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ЭтапыУведомлениеКлиентов", ЭтапыУведомлениеКлиентов);
	Запрос.УстановитьПараметр("ПользовательРОБОТ", Константы.ПользовательРобот.Получить());
	Запрос.УстановитьПараметр("ВидыОтчетаПоСчетуДЕПО", ВидыОтчетаПоСчетуДЕПО);
	Запрос.УстановитьПараметр("СписокДопустимыхЗначенийРеквизитаДокументКД", СписокПустыхЗначенийРеквизитаДокументКД());
	Запрос.УстановитьПараметр("ИзменениеАнкетныхДанных", Справочники.ВидыОпераций.ВидОперацииИзменениеАнкетныхДанных());
	Запрос.УстановитьПараметр("ПустаяЦеннаяБумага", Справочники.ЦенныеБумаги.ПустаяСсылка());
	
	ЗаполнитьЖИ_втВыписка(Запрос);
	ЗаполнитьЖИ_втСводныйОтчетОСовершенныхОперациях(Запрос);
	ЗаполнитьЖИ_втИсходящий(Запрос);
	ЗаполнитьЖИ_втЭтапыКДНЕУведомлениеКлиентов(Запрос);
	ЗаполнитьЖИ_втЭтапыКДУведомлениеКлиентов(Запрос);
	ЗаполнитьЖИ_втУведомленияОПриемеЗаявлений(Запрос);
	ЗаполнитьЖИ_втДокументыВыгруженныеВЛуч(Запрос);
	ЗаполнитьЖИ_втЗапросыСубброкераНаРаскрытие(Запрос);
	ЗаполнитьЖИ_втВыгрузкиРазделовРСВ(Запрос);
	ЗаполнитьЖИ_втРаскрытияСписковВладельцев(Запрос);
	
	// Объединение таблиц документов
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Выписка.Основание КАК Основание,
	|	Выписка.Период КАК Период,
	|	Выписка.ПрефиксНомера КАК ПрефиксНомера,
	|	Выписка.Депонент КАК Депонент,
	|	Выписка.ДепонентКод КАК ДепонентКод,
	|	Выписка.НаименованиеДокументаИлиКомплекта КАК НаименованиеДокументаИлиКомплекта,
	|	Выписка.ЭтоУведомленияЧерезЛК КАК ЭтоУведомленияЧерезЛК,
	|	Выписка.ДатаНаправленияВрученияДокумента КАК ДатаНаправленияВрученияДокумента,
	|	Выписка.Адресат КАК Адресат,
	|	Выписка.ИсточникАдресата КАК ИсточникАдресата,
	|	Выписка.Исполнитель КАК Исполнитель,
	|	Выписка.Комментарий КАК Комментарий,
	|	Выписка.Инициатор КАК Инициатор,
	|	Выписка.Поручение КАК Поручение,
	|	Выписка.ЦеннаяБумага КАК ЦеннаяБумага
	|ИЗ
	|	втВыписка КАК Выписка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СводныйОтчетОСовершенныхОперациях.Основание,
	|	СводныйОтчетОСовершенныхОперациях.Период,
	|	СводныйОтчетОСовершенныхОперациях.ПрефиксНомера,
	|	СводныйОтчетОСовершенныхОперациях.Депонент,
	|	СводныйОтчетОСовершенныхОперациях.ДепонентКод,
	|	СводныйОтчетОСовершенныхОперациях.НаименованиеДокументаИлиКомплекта,
	|	СводныйОтчетОСовершенныхОперациях.ЭтоУведомленияЧерезЛК,
	|	СводныйОтчетОСовершенныхОперациях.ДатаНаправленияВрученияДокумента,
	|	СводныйОтчетОСовершенныхОперациях.Адресат,
	|	СводныйОтчетОСовершенныхОперациях.ИсточникАдресата,
	|	СводныйОтчетОСовершенныхОперациях.Исполнитель,
	|	СводныйОтчетОСовершенныхОперациях.Комментарий,
	|	СводныйОтчетОСовершенныхОперациях.Инициатор,
	|	СводныйОтчетОСовершенныхОперациях.Поручение,
	|	СводныйОтчетОСовершенныхОперациях.ЦеннаяБумага
	|ИЗ
	|	втСводныйОтчетОСовершенныхОперациях КАК СводныйОтчетОСовершенныхОперациях
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Исходящий.Основание,
	|	Исходящий.Период,
	|	Исходящий.ПрефиксНомера,
	|	Исходящий.Депонент,
	|	Исходящий.ДепонентКод,
	|	Исходящий.НаименованиеДокументаИлиКомплекта,
	|	Исходящий.ЭтоУведомленияЧерезЛК,
	|	Исходящий.ДатаНаправленияВрученияДокумента,
	|	Исходящий.Адресат,
	|	Исходящий.ИсточникАдресата,
	|	Исходящий.Исполнитель,
	|	Исходящий.Комментарий,
	|	Исходящий.Инициатор,
	|	NULL,
	|	&ПустаяЦеннаяБумага
	|ИЗ
	|	втИсходящий КАК Исходящий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭтапыКД.Основание,
	|	ЭтапыКД.Период,
	|	ЭтапыКД.ПрефиксНомера,
	|	ЭтапыКД.Депонент,
	|	ЭтапыКД.ДепонентКод,
	|	ЭтапыКД.НаименованиеДокументаИлиКомплекта,
	|	ЭтапыКД.ЭтоУведомленияЧерезЛК,
	|	ЭтапыКД.ДатаНаправленияВрученияДокумента,
	|	ЭтапыКД.Адресат,
	|	ЭтапыКД.ИсточникАдресата,
	|	ЭтапыКД.Исполнитель,
	|	ЭтапыКД.Комментарий,
	|	ЭтапыКД.Инициатор,
	|	ЭтапыКД.Поручение,
	|	&ПустаяЦеннаяБумага
	|ИЗ
	|	втЭтапыКДНЕУведомлениеКлиентов КАК ЭтапыКД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭтапыКД.Основание,
	|	ЭтапыКД.Период,
	|	ЭтапыКД.ПрефиксНомера,
	|	ЭтапыКД.Депонент,
	|	ЭтапыКД.ДепонентКод,
	|	ЭтапыКД.НаименованиеДокументаИлиКомплекта,
	|	ЭтапыКД.ЭтоУведомленияЧерезЛК,
	|	ЭтапыКД.ДатаНаправленияВрученияДокумента,
	|	ЭтапыКД.Адресат,
	|	ЭтапыКД.ИсточникАдресата,
	|	ЭтапыКД.Исполнитель,
	|	ЭтапыКД.Комментарий,
	|	ЭтапыКД.Инициатор,
	|	NULL,
	|	&ПустаяЦеннаяБумага
	|ИЗ
	|	втЭтапыКДУведомлениеКлиентов КАК ЭтапыКД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УведомленияОПриемеЗаявлений.Основание,
	|	УведомленияОПриемеЗаявлений.Период,
	|	УведомленияОПриемеЗаявлений.ПрефиксНомера,
	|	УведомленияОПриемеЗаявлений.Депонент,
	|	УведомленияОПриемеЗаявлений.ДепонентКод,
	|	УведомленияОПриемеЗаявлений.НаименованиеДокументаИлиКомплекта,
	|	УведомленияОПриемеЗаявлений.ЭтоУведомленияЧерезЛК,
	|	УведомленияОПриемеЗаявлений.ДатаНаправленияВрученияДокумента,
	|	УведомленияОПриемеЗаявлений.Адресат,
	|	УведомленияОПриемеЗаявлений.ИсточникАдресата,
	|	УведомленияОПриемеЗаявлений.Исполнитель,
	|	УведомленияОПриемеЗаявлений.Комментарий,
	|	УведомленияОПриемеЗаявлений.Инициатор,
	|	NULL,
	|	&ПустаяЦеннаяБумага
	|ИЗ
	|	втУведомленияОПриемеЗаявлений КАК УведомленияОПриемеЗаявлений
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документы.Основание,
	|	Документы.Период,
	|	Документы.ПрефиксНомера,
	|	Документы.Депонент,
	|	Документы.ДепонентКод,
	|	Документы.НаименованиеДокументаИлиКомплекта,
	|	Документы.ЭтоУведомленияЧерезЛК,
	|	Документы.ДатаНаправленияВрученияДокумента,
	|	Документы.Адресат,
	|	Документы.ИсточникАдресата,
	|	Документы.Исполнитель,
	|	Документы.Комментарий,
	|	Документы.Инициатор,
	|	Документы.Поручение,
	|	&ПустаяЦеннаяБумага
	|ИЗ
	|	втДокументыВыгруженныеВЛуч КАК Документы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втЗапросыСубброкеруНаРаскрытие.Основание,
	|	втЗапросыСубброкеруНаРаскрытие.Период,
	|	втЗапросыСубброкеруНаРаскрытие.ПрефиксНомера,
	|	втЗапросыСубброкеруНаРаскрытие.Депонент,
	|	втЗапросыСубброкеруНаРаскрытие.ДепонентКод,
	|	втЗапросыСубброкеруНаРаскрытие.НаименованиеДокументаИлиКомплекта,
	|	втЗапросыСубброкеруНаРаскрытие.ЭтоУведомленияЧерезЛК,
	|	втЗапросыСубброкеруНаРаскрытие.ДатаНаправленияВрученияДокумента,
	|	втЗапросыСубброкеруНаРаскрытие.Адресат,
	|	втЗапросыСубброкеруНаРаскрытие.ИсточникАдресата,
	|	втЗапросыСубброкеруНаРаскрытие.Исполнитель,
	|	втЗапросыСубброкеруНаРаскрытие.Комментарий,
	|	втЗапросыСубброкеруНаРаскрытие.Инициатор,
	|	NULL,
	|	втЗапросыСубброкеруНаРаскрытие.ЦеннаяБумага
	|ИЗ
	|	втЗапросыСубброкеруНаРаскрытие КАК втЗапросыСубброкеруНаРаскрытие
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыгрузкиРазделовРСВ.Основание,
	|	ВыгрузкиРазделовРСВ.Период,
	|	ВыгрузкиРазделовРСВ.ПрефиксНомера,
	|	ВыгрузкиРазделовРСВ.Депонент,
	|	ВыгрузкиРазделовРСВ.ДепонентКод,
	|	ВыгрузкиРазделовРСВ.НаименованиеДокументаИлиКомплекта,
	|	ВыгрузкиРазделовРСВ.ЭтоУведомленияЧерезЛК,
	|	ВыгрузкиРазделовРСВ.ДатаНаправленияВрученияДокумента,
	|	ВыгрузкиРазделовРСВ.Адресат,
	|	ВыгрузкиРазделовРСВ.ИсточникАдресата,
	|	ВыгрузкиРазделовРСВ.Исполнитель,
	|	ВыгрузкиРазделовРСВ.Комментарий,
	|	ВыгрузкиРазделовРСВ.Инициатор,
	|	NULL,
	|	ВыгрузкиРазделовРСВ.ЦеннаяБумага
	|ИЗ
	|	втВыгрузкиРазделовРСВ КАК ВыгрузкиРазделовРСВ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаскрытияСписковВладельцев.Основание,
	|	РаскрытияСписковВладельцев.Период,
	|	РаскрытияСписковВладельцев.ПрефиксНомера,
	|	NULL,
	|	РаскрытияСписковВладельцев.ДепонентКод,
	|	РаскрытияСписковВладельцев.НаименованиеДокументаИлиКомплекта,
	|	РаскрытияСписковВладельцев.ЭтоУведомленияЧерезЛК,
	|	РаскрытияСписковВладельцев.ДатаНаправленияВрученияДокумента,
	|	РаскрытияСписковВладельцев.Адресат,
	|	РаскрытияСписковВладельцев.ИсточникАдресата,
	|	РаскрытияСписковВладельцев.Исполнитель,
	|	РаскрытияСписковВладельцев.Комментарий,
	|	РаскрытияСписковВладельцев.Инициатор,
	|	РаскрытияСписковВладельцев.Поручение,
	|	РаскрытияСписковВладельцев.ЦеннаяБумага
	|ИЗ
	|	втРаскрытияСписковВладельцев КАК РаскрытияСписковВладельцев
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Основание,
	|	ДепонентКод";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредДень = Дата("00010101");	// Предыдущие значения для генерации последовательности номеров
	ПредОснование = "";
	НомерВнутриДня = 1;		// Начинается с 1 с началом нового дня
	НомерВнутриРСВ = 1;		// Начинается с 1 внутри списка владельцев РСВ, всегда равен 1 для других документов
	
	Если Выборка.Количество() = 0 Тогда
    	ТекстСообщения = "Не обнаружены данные за " + ПредставлениеПериода(НачалоПериода, КонецПериода)
			+ " для заполнения регистра сведений ""Журнал исходящих документов""";
	Иначе
		Пока Выборка.Следующий() Цикл
			Если Документы.Поручение.ЭтоПоручениеНФИ(Выборка.Поручение) Тогда
				Продолжить;
			КонецЕсли;
			
			// Генерация номера внутри дня
			Если НачалоДня(ПредДень) = НачалоДня(Выборка.Период) Тогда
				Если ПредОснование = Выборка.Основание Тогда	// Тот же документ в тот же день - обход списка владельцев РСВ
					НомерВнутриРСВ = НомерВнутриРСВ + 1;
				Иначе	// Документ сменился
					НомерВнутриДня = НомерВнутриДня + 1;
					НомерВнутриРСВ = 1;
				КонецЕсли;
			Иначе // день сменился - начинаем новую нумерацию
				НомерВнутриДня = 1;
				НомерВнутриРСВ = 1;
			КонецЕсли;
			ПредОснование	= Выборка.Основание;
			ПредДень		= Выборка.Период;
			
			// Формирование записи регистра
			НаборЗаписей = РегистрыСведений.ЖурналИсходящихДокументов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Основание.Установить(Выборка.Основание);
			НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
			НаборЗаписей.Отбор.НомерСтрокиРСВ.Установить(НомерВнутриРСВ);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.НомерДокумента = Выборка.ПрефиксНомера
				+ Формат(Выборка.Период, "ДФ=ггММдд-") + Формат(НомерВнутриДня, "ЧЦ=5;ЧВН=1;ЧГ=0");
				
			// Т.к. у всех уведомлений, отправленных через ЛК, номер документа один, добавим суффикс
			Если Выборка.ЭтоУведомленияЧерезЛК Тогда
				НоваяЗапись.НомерДокумента = НоваяЗапись.НомерДокумента + "/" + Формат(НомерВнутриРСВ, "ЧЦ=4;ЧВН=1;ЧГ=0");
			КонецЕсли;
			
			// Если нужно, перезапишем адресата.
			Если (Выборка.ИсточникАдресата = "Депонент") И ЗначениеЗаполнено(Выборка.Депонент) Тогда
				НаименованиеДепонента = ОбщегоНазначенияКлиентСервер.НаименованиеЮрФизЛицаКлиента(
					Выборка.Депонент, Выборка.Период, Ложь);
				ДокументыДепонента = ОбщегоНазначенияКлиентСервер.ДокументКлиента(Выборка.Депонент, Выборка.Период);
				НоваяЗапись.Адресат = НаименованиеДепонента + ". " + ДокументыДепонента;
				
			ИначеЕсли (Выборка.ИсточникАдресата = "Инициатор") И ЗначениеЗаполнено(Выборка.Инициатор) Тогда
				// Это поле Инициатор документа РаскрытиеСпискаВладельцев. Может быть контрагентом и местом хранения.
				Если ТипЗнч(Выборка.Инициатор) = Тип("СправочникСсылка.Контрагенты") Тогда
					НаименованиеДепонента = ОбщегоНазначенияКлиентСервер.НаименованиеЮрФизЛицаКлиента(
						Выборка.Инициатор, Выборка.Период, Ложь);
					ДокументыДепонента = ОбщегоНазначенияКлиентСервер.ДокументКлиента(Выборка.Инициатор, Выборка.Период);
					НоваяЗапись.Адресат = НаименованиеДепонента + ". " + ДокументыДепонента;
				Иначе
					НоваяЗапись.Адресат = Выборка.Инициатор.Наименование;
				КонецЕсли;
			КонецЕсли;
			НоваяЗапись.НомерСтрокиРСВ = НомерВнутриРСВ;
			НаборЗаписей.Записать();
		КонецЦикла;
    	ТекстСообщения = "Заполнен регистр сведений ""Журнал исходящих документов"" за "
			+ ПредставлениеПериода(НачалоПериода, КонецПериода);
	КонецЕсли;
	ЗаписьЖурналаРегистрации("Заполнение журналов ДЕПО", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
КонецПроцедуры

Процедура ЗаполнитьЖурналОпераций(Знач НачалоПериода, Знач КонецПериода) Экспорт
	НачалоПериода = НачалоДня(НачалоПериода);
	КонецПериода = КонецДня(КонецПериода);
	
	РегистрыСведений.ЖурналОпераций.УдалитьЗаписиЗаПериод(НачалоПериода, КонецПериода);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода",			НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",			КонецПериода);
	
	ОперацииПеремещения = Новый Массив;
	ОперацииПеремещения.Добавить(Справочники.ВидыОпераций.Перемещение);
	ОперацииПеремещения.Добавить(Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо);
	Запрос.УстановитьПараметр("ОперацииПеремещения",	ОперацииПеремещения);
	
	Запрос.УстановитьПараметр("ВидОперацииПеревод",		Справочники.ВидыОпераций.Перевод);
	Запрос.УстановитьПараметр("ВидОперацииКонвертация",	Справочники.ВидыОпераций.Конвертация);
	Запрос.УстановитьПараметр("ВидСчетаДЕПО",			Перечисления.ВидыСчетовДепо.СчетДЕПО);
	
	ДвустрочныеОперацииЦБ = Новый Массив;
	ДвустрочныеОперацииЦБ.Добавить(Справочники.ВидыОпераций.Перемещение);
	ДвустрочныеОперацииЦБ.Добавить(Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо);
	ДвустрочныеОперацииЦБ.Добавить(Справочники.ВидыОпераций.Перевод);
	Запрос.УстановитьПараметр("ДвустрочныеОперацииЦБ",	ДвустрочныеОперацииЦБ);
	
	Запрос.УстановитьПараметр("НачалоПериодаГраница", 	Новый Граница(НачалоПериода, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ИзменениеДанныхЦБ",		Справочники.ВидыОпераций.ИзменениеДанныхЦБ);
	Запрос.УстановитьПараметр("ИсходящийНомер",			"SIR-NSD_%");
	
	ЗаполнитьЖО_втГлобальнаяОперацияКонвертация(Запрос);
	ЗаполнитьЖО_втГлобальнаяОперацияПрочиеВидыОпераций(Запрос);
	
	ЗаполнитьЖО_втФормированиеОтчетаВыписки(Запрос);
	
	ЗаполнитьЖО_втОперацииЦБПеремещения(Запрос);
	ЗаполнитьЖО_втОперацииЦБПереводы(Запрос);
	ЗаполнитьЖО_втОперацииЦБОднострочные(Запрос);
	
	ЗаполнитьЖО_втОткрытиеСчетаДепо(Запрос);
	ЗаполнитьЖО_втОткрытиеРазделаСчетаДепо(Запрос);
	ЗаполнитьЖО_втЗакрытиеРазделаСчетаДепо(Запрос);
	ЗаполнитьЖО_втЗакрытиеСчетаДепо(Запрос);
	ЗаполнитьЖО_втНазначениеПредставителяСчетаДепо(Запрос);
	ЗаполнитьЖО_втОтменаПоручения(Запрос);
	ЗаполнитьЖО_втИзменениеАнкетныхДанных(Запрос);
	ЗаполнитьЖО_втИзменениеКатегорииСчетовДепонента(Запрос);
	ЗаполнитьЖО_втЦенныеБумагиОбслуживание(Запрос);
	
	ЗаполнитьЖО_втИсторияИзмененияПараметровЦБ(Запрос);
	
	// Объединение таблиц документов
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГлобальнаяОперация.Операция КАК Операция,
	|	ГлобальнаяОперация.Период КАК Период,
	|	ГлобальнаяОперация.НомерОперации КАК НомерОперации,
	|	ГлобальнаяОперация.ВидОперации КАК ВидОперации,
	|	ГлобальнаяОперация.СчетДепо КАК СчетДепо,
	|	ГлобальнаяОперация.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ГлобальнаяОперация.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ГлобальнаяОперация.Поручение КАК Поручение,
	|	ГлобальнаяОперация.Инициатор КАК Инициатор,
	|	ГлобальнаяОперация.Исполнитель КАК Исполнитель,
	|	"""" КАК ОтменяемоеПоручениеНомер,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ОтменяемоеПоручениеДата,
	|	ГлобальнаяОперация.Комментарий КАК Комментарий,
	|	ГлобальнаяОперация.ПорядокСтрок КАК ПорядокСтрок
	|ИЗ
	|	втГлобальнаяОперацияКонвертация КАК ГлобальнаяОперация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГлобальнаяОперация.Операция,
	|	ГлобальнаяОперация.Период,
	|	ГлобальнаяОперация.НомерОперации,
	|	ГлобальнаяОперация.ВидОперации,
	|	ГлобальнаяОперация.СчетДепо,
	|	ГлобальнаяОперация.РазделСчетаДепо,
	|	ГлобальнаяОперация.ЦеннаяБумага,
	|	ГлобальнаяОперация.Поручение,
	|	ГлобальнаяОперация.Инициатор,
	|	ГлобальнаяОперация.Исполнитель,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	"""",
	|	0
	|ИЗ
	|	втГлобальнаяОперацияПрочиеВидыОпераций КАК ГлобальнаяОперация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФормированиеОтчетаВыписки.Операция,
	|	ФормированиеОтчетаВыписки.Период,
	|	ФормированиеОтчетаВыписки.НомерОперации,
	|	ФормированиеОтчетаВыписки.ВидОперации,
	|	ФормированиеОтчетаВыписки.СчетДепо,
	|	"""",
	|	ФормированиеОтчетаВыписки.ЦеннаяБумага,
	|	ФормированиеОтчетаВыписки.Поручение,
	|	ФормированиеОтчетаВыписки.Инициатор,
	|	ФормированиеОтчетаВыписки.Исполнитель,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ФормированиеОтчетаВыписки.Комментарий,
	|	0
	|ИЗ
	|	втФормированиеОтчетаВыписки КАК ФормированиеОтчетаВыписки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОперацииЦБ.Операция,
	|	ОперацииЦБ.Период,
	|	ОперацииЦБ.НомерОперации,
	|	ОперацииЦБ.ВидОперации,
	|	ОперацииЦБ.СчетДепо,
	|	ОперацииЦБ.РазделСчетаДепо,
	|	ОперацииЦБ.ЦеннаяБумага,
	|	ОперацииЦБ.Поручение,
	|	ОперацииЦБ.Инициатор,
	|	ОперацииЦБ.Исполнитель,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ОперацииЦБ.Комментарий,
	|	ОперацииЦБ.ПорядокСтрок
	|ИЗ
	|	втОперацииЦБПеремещения КАК ОперацииЦБ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОперацииЦБ.Операция,
	|	ОперацииЦБ.Период,
	|	ОперацииЦБ.НомерОперации,
	|	ОперацииЦБ.ВидОперации,
	|	ОперацииЦБ.СчетДепо,
	|	ОперацииЦБ.РазделСчетаДепо,
	|	ОперацииЦБ.ЦеннаяБумага,
	|	ОперацииЦБ.Поручение,
	|	ОперацииЦБ.Инициатор,
	|	ОперацииЦБ.Исполнитель,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ОперацииЦБ.Комментарий,
	|	ОперацииЦБ.ПорядокСтрок
	|ИЗ
	|	втОперацииЦБПереводы КАК ОперацииЦБ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОперацииЦБ.Операция,
	|	ОперацииЦБ.Период,
	|	ОперацииЦБ.НомерОперации,
	|	ОперацииЦБ.ВидОперации,
	|	ОперацииЦБ.СчетДепо,
	|	ОперацииЦБ.РазделСчетаДепо,
	|	ОперацииЦБ.ЦеннаяБумага,
	|	ОперацииЦБ.Поручение,
	|	ОперацииЦБ.Инициатор,
	|	ОперацииЦБ.Исполнитель,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	"""",
	|	0
	|ИЗ
	|	втОперацииЦБОднострочные КАК ОперацииЦБ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОткрытиеСчетаДепо.Операция,
	|	ОткрытиеСчетаДепо.Период,
	|	ОткрытиеСчетаДепо.НомерОперации,
	|	ОткрытиеСчетаДепо.ВидОперации,
	|	ОткрытиеСчетаДепо.СчетДепо,
	|	NULL,
	|	NULL,
	|	ОткрытиеСчетаДепо.Поручение,
	|	ОткрытиеСчетаДепо.Инициатор,
	|	ОткрытиеСчетаДепо.Исполнитель,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ОткрытиеСчетаДепо.Комментарий КАК Комментарий,
	|	0
	|ИЗ
	|	втОткрытиеСчетаДепо КАК ОткрытиеСчетаДепо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОткрытиеРазделаСчетаДепо.Операция,
	|	ОткрытиеРазделаСчетаДепо.Период,
	|	ОткрытиеРазделаСчетаДепо.НомерОперации,
	|	ОткрытиеРазделаСчетаДепо.ВидОперации,
	|	ОткрытиеРазделаСчетаДепо.СчетДепо,
	|	ОткрытиеРазделаСчетаДепо.РазделСчетаДепо,
	|	NULL,
	|	ОткрытиеРазделаСчетаДепо.Поручение,
	|	ОткрытиеРазделаСчетаДепо.Инициатор,
	|	ОткрытиеРазделаСчетаДепо.Исполнитель,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	"""",
	|	0
	|ИЗ
	|	втОткрытиеРазделаСчетаДепо КАК ОткрытиеРазделаСчетаДепо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеРазделаСчетаДепо.Операция,
	|	ЗакрытиеРазделаСчетаДепо.Период,
	|	ЗакрытиеРазделаСчетаДепо.НомерОперации,
	|	ЗакрытиеРазделаСчетаДепо.ВидОперации,
	|	ЗакрытиеРазделаСчетаДепо.СчетДепо,
	|	ЗакрытиеРазделаСчетаДепо.РазделСчетаДепо,
	|	NULL,
	|	ЗакрытиеРазделаСчетаДепо.Поручение,
	|	ЗакрытиеРазделаСчетаДепо.Инициатор,
	|	ЗакрытиеРазделаСчетаДепо.Исполнитель,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	"""",
	|	0
	|ИЗ
	|	втЗакрытиеРазделаСчетаДепо КАК ЗакрытиеРазделаСчетаДепо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеСчетаДепо.Операция,
	|	ЗакрытиеСчетаДепо.Период,
	|	ЗакрытиеСчетаДепо.НомерОперации,
	|	ЗакрытиеСчетаДепо.ВидОперации,
	|	ЗакрытиеСчетаДепо.СчетДепо,
	|	NULL,
	|	NULL,
	|	ЗакрытиеСчетаДепо.Поручение,
	|	ЗакрытиеСчетаДепо.Инициатор,
	|	ЗакрытиеСчетаДепо.Исполнитель,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	"""",
	|	0
	|ИЗ
	|	втЗакрытиеСчетаДепо КАК ЗакрытиеСчетаДепо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Назначение.Операция,
	|	Назначение.Период,
	|	Назначение.НомерОперации,
	|	Назначение.ВидОперации,
	|	Назначение.СчетДепо,
	|	NULL,
	|	NULL,
	|	Назначение.Поручение,
	|	Назначение.Инициатор,
	|	Назначение.Исполнитель,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	"""",
	|	0
	|ИЗ
	|	втНазначениеПредставителяСчетаДепо КАК Назначение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтменаПоручения.Операция,
	|	ОтменаПоручения.Период,
	|	ОтменаПоручения.НомерОперации,
	|	ОтменаПоручения.ВидОперации,
	|	ОтменаПоручения.СчетДепо,
	|	ОтменаПоручения.РазделСчетаДепо,
	|	ОтменаПоручения.ЦеннаяБумага,
	|	ОтменаПоручения.Поручение,
	|	ОтменаПоручения.Инициатор,
	|	ОтменаПоручения.Исполнитель,
	|	ОтменаПоручения.ОтменяемоеПоручениеНомер,
	|	ОтменаПоручения.ОтменяемоеПоручениеДата,
	|	"""",
	|	0
	|ИЗ
	|	втОтменаПоручения КАК ОтменаПоручения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИзменениеАнкеты.Операция,
	|	ИзменениеАнкеты.Период,
	|	ИзменениеАнкеты.НомерОперации,
	|	ИзменениеАнкеты.ВидОперации,
	|	ИзменениеАнкеты.СчетДепо,
	|	NULL,
	|	NULL,
	|	ИзменениеАнкеты.Поручение,
	|	ИзменениеАнкеты.Инициатор,
	|	ИзменениеАнкеты.Исполнитель,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ИзменениеАнкеты.Комментарий,
	|	0
	|ИЗ
	|	втИзменениеАнкетныхДанных КАК ИзменениеАнкеты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИзменениеКатегорииСчетовДепонента.Операция,
	|	ИзменениеКатегорииСчетовДепонента.Период,
	|	ИзменениеКатегорииСчетовДепонента.НомерОперации,
	|	ИзменениеКатегорииСчетовДепонента.ВидОперации,
	|	ИзменениеКатегорииСчетовДепонента.СчетДепо,
	|	NULL,
	|	NULL,
	|	ИзменениеКатегорииСчетовДепонента.Поручение,
	|	ИзменениеКатегорииСчетовДепонента.Инициатор,
	|	ИзменениеКатегорииСчетовДепонента.Исполнитель,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ИзменениеКатегорииСчетовДепонента.Комментарий,
	|	0
	|ИЗ
	|	втИзменениеКатегорииСчетовДепонента КАК ИзменениеКатегорииСчетовДепонента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦБОбслуживание.Операция,
	|	ЦБОбслуживание.Период,
	|	ЦБОбслуживание.НомерОперации,
	|	ЦБОбслуживание.ВидОперации,
	|	NULL,
	|	NULL,
	|	ЦБОбслуживание.ЦеннаяБумага,
	|	ЦБОбслуживание.Поручение,
	|	ЦБОбслуживание.Инициатор,
	|	ЦБОбслуживание.Исполнитель,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	"""",
	|	0
	|ИЗ
	|	втЦенныеБумагиОбслуживание КАК ЦБОбслуживание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втЦБИстория.Операция,
	|	втЦБИстория.Период,
	|	втЦБИстория.НомерОперации,
	|	втЦБИстория.ВидОперации,
	|	NULL,
	|	NULL,
	|	втЦБИстория.ЦеннаяБумага,
	|	NULL,
	|	втЦБИстория.Инициатор,
	|	втЦБИстория.Исполнитель,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	втЦБИстория.Комментарий,
	|	втЦБИстория.ПорядокСтрок
	|ИЗ
	|	втЦБИстория КАК втЦБИстория
	|ГДЕ
	|	втЦБИстория.Комментарий <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Операция,
	|	ПорядокСтрок";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредДень = Дата("00010101");	// Предыдущее значение для генерации последовательности номеров
	НомерВнутриДня = 1;
	НомерСтрокиВнутриОперации = 1;
	Операция = Неопределено;
	Сообщение = Новый СообщениеПользователю();
	Если Выборка.Количество() = 0 Тогда
    	Сообщение.Текст = "Не обнаружены данные за " + ПредставлениеПериода(НачалоПериода, КонецПериода)
			+ " для заполнения регистра сведений ""Журнал операций""";
	Иначе
		Пока Выборка.Следующий() Цикл
			// Генерация номера внутри дня
			Если НачалоДня(ПредДень) = НачалоДня(Выборка.Период) Тогда	// день не изменился
				Если Операция <> Выборка.Операция Тогда 				// изменилась операция
					НомерВнутриДня = НомерВнутриДня + 1;				// продолжаем нумерацию
				КонецЕсли;
			Иначе // день сменился - начинаем новую нумерацию
				НомерВнутриДня = 1;
			КонецЕсли;
			
			// Генерация номера строки внутри операции
			Если Операция <> Выборка.Операция Тогда
				НомерСтрокиВнутриОперации = 1;
			Иначе
				НомерСтрокиВнутриОперации = НомерСтрокиВнутриОперации + 1;
			КонецЕсли;
			
			Операция = Выборка.Операция;
			ПредДень = Выборка.Период;
			
			// Формирование записи регистра
			НаборЗаписей = РегистрыСведений.ЖурналОпераций.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Операция.Установить(Выборка.Операция);
			НаборЗаписей.Отбор.РазделСчетаДепо.Установить(Выборка.РазделСчетаДепо);
			НаборЗаписей.Отбор.СчетДЕПО.Установить(Выборка.СчетДЕПО);
			НаборЗаписей.Отбор.ЦеннаяБумага.Установить(Выборка.ЦеннаяБумага);
			НаборЗаписей.Отбор.Период.Установить(Выборка.Период); 
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.НомерОперации = Лев(Выборка.НомерОперации, 1) + Формат(Выборка.Период, "ДФ=ггММдд-")
				+ Формат(НомерВнутриДня, "ЧЦ=5;ЧВН=1;ЧГ=0")
				+ ?(Выборка.ПорядокСтрок <> 0, "/" + Формат(НомерСтрокиВнутриОперации, "ЧГ="), "");
			Если ЗначениеЗаполнено(Выборка.ОтменяемоеПоручениеНомер) Тогда
				НоваяЗапись.Комментарий = "Отмененное поручение №" + СокрЛП(Выборка.ОтменяемоеПоручениеНомер)
					+ " от " + Формат(Выборка.ОтменяемоеПоручениеДата, "ДЛФ=Д");
			Иначе
				Комментарий = СокрЛП(Выборка.Комментарий);
				Если Прав(Комментарий, 1) = "," Тогда
					НоваяЗапись.Комментарий = Лев(Комментарий, СтрДлина(Комментарий) - 1);
				КонецЕсли;
			КонецЕсли;
			
			Если Выборка.ВидОперации = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо
					И ТипЗнч(Выборка.СчетДЕПО) = Тип("СправочникСсылка.СчетаДепоМХ") Тогда
				НоваяЗапись.Комментарий			= "Счет депо – " + СокрЛП(Выборка.СчетДЕПО) + " Раздел счета депо МХ – " + СокрЛП(Выборка.РазделСчетаДепо.Код);
				НоваяЗапись.СчетДЕПО			= Неопределено;
				НоваяЗапись.удРазделСчетаДЕПО	= Неопределено;
			КонецЕсли;
			
			НаборЗаписей.Записать();
		КонецЦикла;
		Сообщение.Текст = "Заполнен регистр сведений ""Журнал операций"" за " + ПредставлениеПериода(НачалоПериода, КонецПериода);
	КонецЕсли;
	ЗаписьЖурналаРегистрации("Заполнение журналов ДЕПО", УровеньЖурналаРегистрации.Информация,,, Сообщение.Текст);
	Сообщение.Сообщить();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ЗАПОЛНЕНИЕ ВРЕМЕННЫХ ТАБЛИЦ

Процедура ЗаполнитьЖИ_втВыписка(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Выписка.Ссылка КАК Основание,
	|	Выписка.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА Выписка.ВидОтчета = ЗНАЧЕНИЕ(Перечисление.ВидыОтчетов.Уведомление)
	|			ТОГДА ""У""
	|		КОГДА Выписка.ВидОтчета = ЗНАЧЕНИЕ(Перечисление.ВидыОтчетов.Отчет)
	|			ТОГДА ""О""
	|		ИНАЧЕ ""В""
	|	КОНЕЦ КАК ПрефиксНомера,
	|	Выписка.ВидОтчета КАК НаименованиеДокументаИлиКомплекта,
	|	ВЫРАЗИТЬ(Выписка.ВладелецСчета КАК Справочник.Контрагенты) КАК Депонент,
	|	ВЫРАЗИТЬ(Выписка.ВладелецСчета КАК Справочник.Контрагенты).Код КАК ДепонентКод,
	|	ЛОЖЬ КАК ЭтоУведомленияЧерезЛК,
	|	Выписка.Дата КАК ДатаНаправленияВрученияДокумента,
	|	"""" КАК Адресат,
	|	""Депонент"" КАК ИсточникАдресата,
	|	ЕСТЬNULL(РегистрацияЭДО.Пользователь, Выписка.Автор) КАК Исполнитель,
	|	ВЫБОР
	|		КОГДА Выписка.ВидОтчета В (&ВидыОтчетаПоСчетуДЕПО)
	|			ТОГДА ""Документ выдан: "" + ВЫРАЗИТЬ(Выписка.ДокументОснование КАК Документ.Поручение).СпособОтправкиОтчета.Наименование
	|		КОГДА ВЫРАЗИТЬ(Выписка.ДокументОснование КАК Документ.Поручение).ВидОперацииД = &ИзменениеАнкетныхДанных
	|			ТОГДА ВЫРАЗИТЬ(Выписка.ДокументОснование КАК Документ.Поручение).Комментарий
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Комментарий,
	|	"""" КАК Инициатор,
	|	Выписка.ДокументОснование КАК Поручение,
	|	ВЫРАЗИТЬ(Выписка.ОперацияЦБ КАК Документ.ОперацииЦБ).ЦБ КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втВыписка
	|ИЗ
	|	Документ.Выписка КАК Выписка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияЭДО
	|		ПО (Выписка.Ссылка = (ВЫРАЗИТЬ(РегистрацияЭДО.Документ КАК Документ.Выписка)))
	|ГДЕ
	|	Выписка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Выписка.Проведен
	|";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖИ_втСводныйОтчетОСовершенныхОперациях(Запрос)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Выписка.Ссылка КАК Основание,
	|	Выписка.Дата КАК Период,
	|	"""" КАК ПрефиксНомера,
	|	""Сводный отчет о совершенных операциях"" КАК НаименованиеДокументаИлиКомплекта,
	|	ВЫРАЗИТЬ(Выписка.ВладелецСчета КАК Справочник.Контрагенты) КАК Депонент,
	|	ВЫРАЗИТЬ(Выписка.ВладелецСчета КАК Справочник.Контрагенты).Код КАК ДепонентКод,
	|	ЛОЖЬ КАК ЭтоУведомленияЧерезЛК,
	|	Выписка.Дата КАК ДатаНаправленияВрученияДокумента,
	|	"""" КАК Адресат,
	|	""Депонент"" КАК ИсточникАдресата,
	|	ВЫБОР
	|		КОГДА Выписка.Изменил = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА Выписка.Автор
	|		ИНАЧЕ Выписка.Изменил
	|	КОНЕЦ КАК Исполнитель,
	|	"""" КАК Комментарий,
	|	НЕОПРЕДЕЛЕНО КАК Инициатор,
	|	НЕОПРЕДЕЛЕНО КАК Поручение,
	|	НЕОПРЕДЕЛЕНО КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втСводныйОтчетОСовершенныхОперациях
	|ИЗ
	|	Документ.СводныйОтчетОСовершенныхОперациях КАК Выписка
	|ГДЕ
	|	Выписка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Выписка.Проведен";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗаполнитьЖИ_втИсходящий(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Исходящий.Ссылка КАК Основание,
	|	Исходящий.Дата КАК Период,
	|	""П"" КАК ПрефиксНомера,
	|	Исходящий.НаименованиеДокументаИлиКомплекта КАК НаименованиеДокументаИлиКомплекта,
	|	Исходящий.Депонент КАК Депонент,
	|	Исходящий.Депонент.Код КАК ДепонентКод,
	|	ЛОЖЬ КАК ЭтоУведомленияЧерезЛК,
	|	Исходящий.Дата КАК ДатаНаправленияВрученияДокумента,
	|	Исходящий.Адресат КАК Адресат,
	|	""Адресат"" КАК ИсточникАдресата,
	|	Исходящий.Исполнитель КАК Исполнитель,
	|	Исходящий.Комментарий КАК Комментарий,
	|	"""" КАК Инициатор
	|ПОМЕСТИТЬ втИсходящий
	|ИЗ
	|	Документ.Исходящий КАК Исходящий
	|ГДЕ
	|	Исходящий.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Исходящий.Проведен";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖИ_втЭтапыКДНЕУведомлениеКлиентов(Запрос)
	// Исходящие ДокументКД из РС ЭтапыКД на период записи и это не уведомления клиентов
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыКД.ДокументКД КАК Основание,
	|	ЭтапыКД.Период КАК Период,
	|	""КД"" КАК ПрефиксНомера,
	|	ВЫБОР
	|		КОГДА ЭтапыКД.ДокументКД ССЫЛКА Документ.КорпоративноеДействие_Новый
	|				И ЭтапыКД.ЭтапКД.КомплектДокументов <> """"
	|			ТОГДА ЭтапыКД.ЭтапКД.КомплектДокументов + "". КД референс: "" + ЭтапыКД.ДокументКД.КДРеференс
	|		КОГДА ЭтапыКД.ДокументКД ССЫЛКА Документ.КорпоративноеДействие_Новый
	|				И ЭтапыКД.ЭтапКД.КомплектДокументов = """"
	|			ТОГДА ЭтапыКД.ЭтапКД.Наименование + "". КД референс: "" + ЭтапыКД.ДокументКД.КДРеференс
	|		КОГДА ЭтапыКД.ЭтапКД.КомплектДокументов <> """"
	|			ТОГДА ЭтапыКД.ЭтапКД.КомплектДокументов
	|		ИНАЧЕ ЭтапыКД.ЭтапКД.Наименование
	|	КОНЕЦ КАК НаименованиеДокументаИлиКомплекта,
	|	NULL КАК Депонент,
	|	"""" КАК ДепонентКод,
	|	ЛОЖЬ КАК ЭтоУведомленияЧерезЛК,
	|	ЭтапыКД.Период КАК ДатаНаправленияВрученияДокумента,
	|	"""" КАК Адресат,
	|	""Инициатор"" КАК ИсточникАдресата,
	|	ВЫБОР
	|		КОГДА ЭтапыКД.ДокументКД ССЫЛКА Документ.РаскрытиеСпискаВладельцев
	|			ТОГДА ЭтапыКД.ДокументКД.Автор
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Исполнитель,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ЭтапыКД.ДокументКД КАК Документ.Поручение).ВидОперацииД = &ИзменениеАнкетныхДанных
	|			ТОГДА ВЫРАЗИТЬ(ЭтапыКД.ДокументКД КАК Документ.Поручение).Комментарий
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Комментарий,
	|	ВЫБОР
	|		КОГДА ЭтапыКД.ДокументКД ССЫЛКА Документ.РаскрытиеСпискаВладельцев
	|			ТОГДА ЭтапыКД.ДокументКД.Инициатор
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Инициатор,
	|	ЭтапыКД.ДокументКД КАК Поручение
	|ПОМЕСТИТЬ втЭтапыКДНЕУведомлениеКлиентов
	|ИЗ
	|	РегистрСведений.ЭтапыКД КАК ЭтапыКД
	|ГДЕ
	|	ЭтапыКД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЭтапыКД.Исходящее
	|	И НЕ ЭтапыКД.ЭтапКД В (&ЭтапыУведомлениеКлиентов)
	|	И
	|	(
	|		ЭтапыКД.ДокументКД В (&СписокДопустимыхЗначенийРеквизитаДокументКД)
	|		ИЛИ ЭтапыКД.ДокументКД ССЫЛКА Документ.Поручение
	|		ИЛИ 
	|			(	(ЭтапыКД.ДокументКД ССЫЛКА Документ.КорпоративноеДействие_Новый
	|					ИЛИ ЭтапыКД.ДокументКД ССЫЛКА Документ.РаскрытиеСпискаВладельцев)
	|				И (ЭтапыКД.ДокументКД.ЦеннаяБумага1 = &ПустаяЦеннаяБумага
	|					ИЛИ	ЭтапыКД.ДокументКД.ЦеннаяБумага1.НФИ = 0)
	|			)
	|	)
	|";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖИ_втЭтапыКДУведомлениеКлиентов(Запрос)
	// Исходящие КД из РС ЭтапыКД на период записи и это уведомления клиентов
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыКД.КД КАК Основание,
	|	ЭтапыКД.Период КАК Период,
	|	""КД"" КАК ПрефиксНомера,
	|	ВЫБОР
	|		КОГДА ЭтапыКД.КД ССЫЛКА Документ.УведомлениеКлиентам
	|				И ЭтапыКД.ЭтапКД.КомплектДокументов <> """"
	|			ТОГДА ЭтапыКД.ЭтапКД.КомплектДокументов + "". КД референс: "" + ЭтапыКД.КД.КДРеференс
	|		КОГДА ЭтапыКД.КД ССЫЛКА Документ.УведомлениеКлиентам
	|				И ЭтапыКД.ЭтапКД.КомплектДокументов = """"
	|			ТОГДА ЭтапыКД.ЭтапКД.Наименование + "". КД референс: "" + ЭтапыКД.КД.КДРеференс
	|		КОГДА ЭтапыКД.ЭтапКД.КомплектДокументов <> """"
	|			ТОГДА ЭтапыКД.ЭтапКД.КомплектДокументов
	|		ИНАЧЕ ЭтапыКД.ЭтапКД.Наименование
	|	КОНЕЦ КАК НаименованиеДокументаИлиКомплекта,
	|	Уведомления.Клиент КАК Депонент,
	|	Уведомления.Клиент.Код КАК ДепонентКод,
	|	ВЫБОР
	|		КОГДА НЕ Уведомления.Клиент ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоУведомленияЧерезЛК,
	|	ЭтапыКД.Период КАК ДатаНаправленияВрученияДокумента,
	|	"""" КАК Адресат,
	|	""Депонент"" КАК ИсточникАдресата,
	|	&ПользовательРОБОТ КАК Исполнитель,
	|	"""" КАК Комментарий,
	|	"""" КАК Инициатор
	|ПОМЕСТИТЬ втЭтапыКДУведомлениеКлиентов
	|ИЗ
	|	РегистрСведений.ЭтапыКД КАК ЭтапыКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК Уведомления
	|		ПО ЭтапыКД.КД = Уведомления.КД
	|			И (НАЧАЛОПЕРИОДА(ЭтапыКД.Период, ДЕНЬ) = Уведомления.Период)
	|ГДЕ
	|	ЭтапыКД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЭтапыКД.Исходящее
	|	И ЭтапыКД.ЭтапКД В (&ЭтапыУведомлениеКлиентов)
	|	И
	|	(
	|		ЭтапыКД.КД = НЕОПРЕДЕЛЕНО
	|		ИЛИ ЭтапыКД.КД = ЗНАЧЕНИЕ(Документ.КорпоративноеДействие_Новый.ПустаяСсылка)
	|		ИЛИ ЭтапыКД.КД = ЗНАЧЕНИЕ(Документ.РаскрытиеСпискаВладельцев.ПустаяСсылка)
	|		ИЛИ ЭтапыКД.КД.ЦеннаяБумага1 = &ПустаяЦеннаяБумага
	|		ИЛИ	ЭтапыКД.КД.ЦеннаяБумага1.НФИ = 0
	|	)
	|";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖИ_втУведомленияОПриемеЗаявлений(Запрос)
	// Уведомления из РС УведомленияОтправленныеЧерезЛичныйКабинет основывающиеся на Заявлениях на участие в оферте
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокКарточкаОферты.КорпоративноеДействие КАК Основание,
	|	Уведомления.Период КАК Период,
	|	""КД"" КАК ПрефиксНомера,
	|	""Уведомление клиентов. КД референс: "" + ЕСТЬNULL(ДокКорпоративноеДействие.КДРеференс, """") КАК НаименованиеДокументаИлиКомплекта,
	|	Уведомления.Клиент КАК Депонент,
	|	Уведомления.Клиент.Код КАК ДепонентКод,
	|	Истина КАК ЭтоУведомленияЧерезЛК,
	|	Уведомления.Период КАК ДатаНаправленияВрученияДокумента,
	|	"""" КАК Адресат,
	|	""Депонент"" КАК ИсточникАдресата,
	|	&ПользовательРОБОТ КАК Исполнитель,
	|	"""" КАК Комментарий,
	|	"""" КАК Инициатор
	|ПОМЕСТИТЬ втУведомленияОПриемеЗаявлений
	|ИЗ
	|	РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК Уведомления
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявлениеНаУчастиеВОферте КАК ЗаявлениеНаУчастиеВОферте
	|		ПО Уведомления.КД = ЗаявлениеНаУчастиеВОферте.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КарточкаОферты КАК ДокКарточкаОферты
	|		ПО ЗаявлениеНаУчастиеВОферте.КарточкаОферты = ДокКарточкаОферты.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорпоративноеДействие_Новый КАК ДокКорпоративноеДействие
	|		ПО ДокКарточкаОферты.КорпоративноеДействие = ДокКорпоративноеДействие.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО 	ДоговорыКонтрагентов.Владелец = Уведомления.Клиент
	|			И ДоговорыКонтрагентов.ТипДоговора В (&ТипыДоговоровДепонента)
	|			И (ДоговорыКонтрагентов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ДоговорыКонтрагентов.ДатаОкончанияДействия > Уведомления.Период)
	|			И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|ГДЕ
	|	Уведомления.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|СГРУППИРОВАТЬ ПО
	|	Уведомления.КД,
	|	ДокКарточкаОферты.КорпоративноеДействие,
	|	""Уведомление клиентов. КД референс: "" + ЕСТЬNULL(ДокКорпоративноеДействие.КДРеференс, """"),
	|	Уведомления.Период,
	|	Уведомления.Клиент
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВЫБОР
	|				КОГДА ДоговорыКонтрагентов.Ссылка ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА
	|			 КОНЕЦ) = ИСТИНА
	|";
	Запрос.УстановитьПараметр("ТипыДоговоровДепонента", Справочники.Контрагенты.ТипыДоговоровДепонента());
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖИ_втДокументыВыгруженныеВЛуч(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(НеттоПоручениеПоручения.Поручение, ДокументыВыгруженныеВЛуч.ДокументОснование) КАК Основание,
	|	ДокументыВыгруженныеВЛуч.ДатаВыгрузки КАК Период,
	|	""В"" КАК ПрефиксНомера,
	|	ВЫБОР
	|		КОГДА ДокументыВыгруженныеВЛуч.ИсходящийНомер <> """"
	|			ТОГДА ""Поручение "" + ДокументыВыгруженныеВЛуч.ИсходящийНомер
	|		ИНАЧЕ ""Поручение""
	|	КОНЕЦ КАК НаименованиеДокументаИлиКомплекта,
	|	ВЫБОР
	|		КОГДА ДокументыВыгруженныеВЛуч.ДокументОснование ССЫЛКА Документ.Поручение
	|			ТОГДА ВЫРАЗИТЬ(ДокументыВыгруженныеВЛуч.ДокументОснование.СчетДепо КАК Справочник.СчетаДепо).Владелец
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Депонент,
	|	ВЫБОР
	|		КОГДА ДокументыВыгруженныеВЛуч.ДокументОснование ССЫЛКА Документ.Поручение
	|			ТОГДА ВЫРАЗИТЬ(ДокументыВыгруженныеВЛуч.ДокументОснование.СчетДепо КАК Справочник.СчетаДепо).Владелец.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДепонентКод,
	|	ЛОЖЬ КАК ЭтоУведомленияЧерезЛК,
	|	ДокументыВыгруженныеВЛуч.ДатаВыгрузки КАК ДатаНаправленияВрученияДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыВыгруженныеВЛуч.ДокументОснование ССЫЛКА Документ.Поручение
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ДокументыВыгруженныеВЛуч.ДокументОснование.МХДепонента)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДокументыВыгруженныеВЛуч.ДокументОснование.МестоХранения)
	|	КОНЕЦ КАК Адресат,
	|	""Адресат"" КАК ИсточникАдресата,
	|	ДокументыВыгруженныеВЛуч.Исполнитель КАК Исполнитель,
	|	ВЫБОР
	|		КОГДА ДокументыВыгруженныеВЛуч.ДокументОснование ССЫЛКА Документ.Поручение
	|				И ДокументыВыгруженныеВЛуч.ДокументОснование.ВидОперацииД = &ИзменениеАнкетныхДанных
	|			ТОГДА ДокументыВыгруженныеВЛуч.ДокументОснование.Комментарий
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Комментарий,
	|	"""" КАК Инициатор,
	|	ЕСТЬNULL(НеттоПоручениеПоручения.Поручение, ДокументыВыгруженныеВЛуч.ДокументОснование) КАК Поручение
	|ПОМЕСТИТЬ втДокументыВыгруженныеВЛуч
	|ИЗ
	|	РегистрСведений.ДокументыВыгруженныеВЛуч КАК ДокументыВыгруженныеВЛуч
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НеттоПоручение.Поручения КАК НеттоПоручениеПоручения
	|		ПО ДокументыВыгруженныеВЛуч.ДокументОснование = НеттоПоручениеПоручения.Ссылка
	|ГДЕ
	|	ДокументыВыгруженныеВЛуч.ДатаВыгрузки МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВЫБОР
	|			КОГДА ДокументыВыгруженныеВЛуч.ДокументОснование ССЫЛКА Документ.Поручение
	|				ТОГДА ВЫРАЗИТЬ(ДокументыВыгруженныеВЛуч.ДокументОснование КАК Документ.Поручение).НомерПорученияВБО + ДокументыВыгруженныеВЛуч.РегистрационныйНомер
	|			ИНАЧЕ ДокументыВыгруженныеВЛуч.РегистрационныйНомер
	|		КОНЕЦ <> """"";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖИ_втЗапросыСубброкераНаРаскрытие(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.Ссылка КАК Основание,
	|	ЗапросСубброкеруНаРаскрытие.Дата КАК Период,
	|	""П"" КАК ПрефиксНомера,
	|	""Запрос субброкеру на раскрытие"" КАК НаименованиеДокументаИлиКомплекта,
	|	ЗапросСубброкеруНаРаскрытие.Клиент КАК Депонент,
	|	ЗапросСубброкеруНаРаскрытие.Клиент.Код КАК ДепонентКод,
	|	ЛОЖЬ КАК ЭтоУведомленияЧерезЛК,
	|	ЗапросСубброкеруНаРаскрытие.Дата КАК ДатаНаправленияВрученияДокумента,
	|	"""" КАК Адресат,
	|	""Депонент"" КАК ИсточникАдресата,
	|	&ПользовательРОБОТ КАК Исполнитель,
	|	"""" КАК Комментарий,
	|	"""" КАК Инициатор,
	|	ЗапросСубброкеруНаРаскрытие.РСВ.ЦеннаяБумага1 КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втЗапросыСубброкеруНаРаскрытие
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖИ_втВыгрузкиРазделовРСВ(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыгрузкаРСВ.РаскрытиеСпискаВладельцев КАК Основание,
	|	ВыгрузкаРСВ.Дата КАК Период,
	|	""КД"" КАК ПрефиксНомера,
	|	""Раскрытие информации о налоговых ставках"" КАК НаименованиеДокументаИлиКомплекта,
	|	"""" КАК Депонент,
	|	"""" КАК ДепонентКод,
	|	ИСТИНА КАК ЭтоУведомленияЧерезЛК,
	|	ВыгрузкаРСВ.Дата КАК ДатаНаправленияВрученияДокумента,
	|	"""" КАК Адресат,
	|	""Инициатор"" КАК ИсточникАдресата,
	|	ВыгрузкаРСВ.Автор КАК Исполнитель,
	|	"""" КАК Комментарий,
	|	ВыгрузкаРСВ.РаскрытиеСпискаВладельцев.Инициатор КАК Инициатор,
	|	ВыгрузкаРСВ.РаскрытиеСпискаВладельцев.ЦеннаяБумага1 КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втВыгрузкиРазделовРСВ
	|ИЗ
	|	Документ.ВыгрузкаРазделаРСВвВышестоящийДепозитарий КАК ВыгрузкаРСВ
	|ГДЕ
	|	ВыгрузкаРСВ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ВыгрузкаРСВ.ПометкаУдаления";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖИ_втРаскрытияСписковВладельцев(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РаскрытиеСпискаВладельцев.Ссылка КАК Основание,
	|	РаскрытиеСпискаВладельцев.Дата КАК Период,
	|	""КД"" КАК ПрефиксНомера,
	|	ВЫБОР
	|		КОГДА РаскрытиеСпискаВладельцев.КДРеференс <> """"
	|		ТОГДА ""Распоряжение по сбору списка владельцев ЦБ. КД референс: "" + РаскрытиеСпискаВладельцев.КДРеференс
	|		ИНАЧЕ ""Распоряжение по сбору списка владельцев ЦБ""
	|	КОНЕЦ КАК НаименованиеДокументаИлиКомплекта,
	|	"""" КАК ДепонентКод,
	|	ЛОЖЬ КАК ЭтоУведомленияЧерезЛК,
	|	ЕСТЬNULL(СтатусыРаскрытияСписковВладельцевСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНаправленияВрученияДокумента,
	|	РаскрытиеСпискаВладельцев.СчетДЕПО.Владелец КАК Адресат,
	|	""Инициатор"" КАК ИсточникАдресата,
	|	ЕСТЬNULL(СтатусыРаскрытияСписковВладельцевСрезПоследних.Автор, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Исполнитель,
	|	"""" КАК Комментарий,
	|	"""" КАК Инициатор,
	|	РаскрытиеСпискаВладельцев.Ссылка КАК Поручение,
	|	РаскрытиеСпискаВладельцев.ЦеннаяБумага1 КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втРаскрытияСписковВладельцев
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыРаскрытияСписковВладельцев.СрезПоследних(, Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРаскрытияСписковВладельцев.Выгружено)) КАК СтатусыРаскрытияСписковВладельцевСрезПоследних
	|		ПО РаскрытиеСпискаВладельцев.Ссылка = СтатусыРаскрытияСписковВладельцевСрезПоследних.ДокументРаскрытия
	|ГДЕ
	|	РаскрытиеСпискаВладельцев.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РаскрытиеСпискаВладельцев.ВидКорпоративногоДействия В(&ВидыКДДляРСВ)
	|	И РаскрытиеСпискаВладельцев.ТипЗагрузкиСписковРаскрытия <> ЗНАЧЕНИЕ(Перечисление.ТипЗагрузкиСписковРаскрытия.PARTAD)
	|	И РаскрытиеСпискаВладельцев.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРаскрытияСписковВладельцев.Выгружено)
	|	И НЕ РаскрытиеСпискаВладельцев.ПометкаУдаления";
	ВидыКДДляРСВ = Справочники.ВидыКорпоративныхДействий.ВидыКДРСВДляЖурналовВходящихИсходящих();
	Запрос.УстановитьПараметр("ВидыКДДляРСВ", ВидыКДДляРСВ);
	Запрос.Выполнить();
КонецПроцедуры


Процедура ЗаполнитьЖО_втГлобальнаяОперацияКонвертация(Запрос)
	
	// Получить табличные части списаний и зачислений для конвертаций
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Списание.Ссылка					КАК Ссылка,
	|	Списание.РазделСчетаДепо		КАК РазделСчетаДепо,
	|	Списание.ЦеннаяБумага			КАК ЦеннаяБумага,
	|	""Конвертация / Списание""		КАК Комментарий,
	|	1								КАК ПорядокСтрок	// В начале идут списания
	|ПОМЕСТИТЬ втСписанияЗачисления
	|ИЗ
	|	Документ.ГлобальнаяОперация.Списание КАК Списание
	|
	|ГДЕ
	|	Списание.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Списание.Ссылка.Проведен
	|	И Списание.Ссылка.ВидГлобальнойОперации = &ВидОперацииКонвертация
	|	И Списание.ЦеннаяБумага.НФИ = 0
	|	И Списание.Ссылка.СчетДепо.ВидСчетаДепо = &ВидСчетаДЕПО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Зачисление.Ссылка				КАК Ссылка,
	|	Зачисление.РазделСчетаДепо		КАК РазделСчетаДепо,
	|	Зачисление.ЦеннаяБумага			КАК ЦеннаяБумага,
	|	""Конвертация / Зачисление""	КАК Комментарий,
	|	2								КАК ПорядокСтрок	// Затем идут зачисления
	|ИЗ
	|	Документ.ГлобальнаяОперация.Зачисление КАК Зачисление
	|
	|ГДЕ
	|	Зачисление.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Зачисление.Ссылка.Проведен
	|	И Зачисление.Ссылка.ВидГлобальнойОперации = &ВидОперацииКонвертация
	|	И Зачисление.ЦеннаяБумага.НФИ = 0
	|	И Зачисление.Ссылка.СчетДепо.ВидСчетаДепо = &ВидСчетаДЕПО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|";
	Запрос.Выполнить();
	
	// Посчитать количество строк на конвертацию: если строка только 1, то нумерация через дробь не нужна
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписанияЗачисления.Ссылка				КАК Ссылка,
	|	КОЛИЧЕСТВО(СписанияЗачисления.Ссылка)	КАК КоличествоСтрок
	|ПОМЕСТИТЬ втКоличествоСтрокСписанияЗачисления
	|ИЗ
	|	втСписанияЗачисления КАК СписанияЗачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	СписанияЗачисления.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|";
	Запрос.Выполнить();
	
	// ГлобальнаяОперация
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписанияЗачисления.Ссылка						КАК Операция,
	|	СписанияЗачисления.Ссылка.Дата					КАК Период,
	|	СписанияЗачисления.Ссылка.Номер					КАК НомерОперации,
	|	СписанияЗачисления.Ссылка.ВидГлобальнойОперации	КАК ВидОперации,
	|	СписанияЗачисления.Ссылка.СчетДепо				КАК СчетДепо,
	|	СписанияЗачисления.РазделСчетаДепо				КАК РазделСчетаДепо,
	|	СписанияЗачисления.ЦеннаяБумага					КАК ЦеннаяБумага,
	|	СписанияЗачисления.Ссылка.ДокументОснование		КАК Поручение,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, СписанияЗачисления.Ссылка.Автор)	КАК Инициатор,
	|	СписанияЗачисления.Ссылка.Автор					КАК Исполнитель,
	|	СписанияЗачисления.Комментарий					КАК Комментарий,
	|	ВЫБОР
	|		КОГДА КоличествоСтрокСписанияЗачисления.КоличествоСтрок = 1
	|			ТОГДА 0		// если строка только 1, то нумерация через дробь не нужна
	|		ИНАЧЕ СписанияЗачисления.ПорядокСтрок
	|	КОНЕЦ											КАК ПорядокСтрок
	|ПОМЕСТИТЬ втГлобальнаяОперацияКонвертация
	|ИЗ
	|	втСписанияЗачисления КАК СписанияЗачисления
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияВЭДО
	|	ПО
	|		СписанияЗачисления.Ссылка = РегистрацияВЭДО.Документ.ОперацияЦБ
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКоличествоСтрокСписанияЗачисления КАК КоличествоСтрокСписанияЗачисления
	|	ПО
	|		СписанияЗачисления.Ссылка = КоличествоСтрокСписанияЗачисления.Ссылка
	|";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖО_втГлобальнаяОперацияПрочиеВидыОпераций(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабЧастьЦенныеБумаги.Ссылка													КАК Операция,
	|	ТабЧастьЦенныеБумаги.Ссылка.Дата											КАК Период,
	|	ТабЧастьЦенныеБумаги.Ссылка.Номер											КАК НомерОперации,
	|	ТабЧастьЦенныеБумаги.Ссылка.ВидГлобальнойОперации							КАК ВидОперации,
	|	ТабЧастьЦенныеБумаги.Ссылка.СчетДепо										КАК СчетДепо,
	|	ТабЧастьЦенныеБумаги.РазделСчетаДепо										КАК РазделСчетаДепо,
	|	ТабЧастьЦенныеБумаги.ЦеннаяБумага											КАК ЦеннаяБумага,
	|	ТабЧастьЦенныеБумаги.Ссылка.ДокументОснование								КАК Поручение,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ТабЧастьЦенныеБумаги.Ссылка.Автор)	КАК Инициатор,
	|	ТабЧастьЦенныеБумаги.Ссылка.Автор											КАК Исполнитель
	|ПОМЕСТИТЬ втГлобальнаяОперацияПрочиеВидыОпераций
	|ИЗ
	|	Документ.ГлобальнаяОперация.ЦенныеБумаги КАК ТабЧастьЦенныеБумаги
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияВЭДО
	|	ПО
	|		ТабЧастьЦенныеБумаги.Ссылка = РегистрацияВЭДО.Документ.ОперацияЦБ
	|
	|ГДЕ
	|	ТабЧастьЦенныеБумаги.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТабЧастьЦенныеБумаги.Ссылка.Проведен
	|	И ТабЧастьЦенныеБумаги.Ссылка.ВидГлобальнойОперации ССЫЛКА Справочник.ВидыОпераций
	|	И ТабЧастьЦенныеБумаги.Ссылка.ВидГлобальнойОперации <> &ВидОперацииКонвертация
	|	И ТабЧастьЦенныеБумаги.ЦеннаяБумага.НФИ = 0
	|	И ТабЧастьЦенныеБумаги.Ссылка.СчетДепо.ВидСчетаДепо = &ВидСчетаДЕПО
	|";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖО_втФормированиеОтчетаВыписки(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФормированиеОтчетаВыписки.Ссылка			КАК Операция,
	|	ФормированиеОтчетаВыписки.Дата				КАК Период,
	|	ФормированиеОтчетаВыписки.Номер				КАК НомерОперации,
	|	ФормированиеОтчетаВыписки.ВидОтчета			КАК ВидОперации,
	|	ФормированиеОтчетаВыписки.СчетДепо			КАК СчетДепо,
	|	ФормированиеОтчетаВыписки.ЦеннаяБумага		КАК ЦеннаяБумага,
	|	ФормированиеОтчетаВыписки.ДокументОснование	КАК Поручение,
	|	ФормированиеОтчетаВыписки.Автор				КАК Исполнитель,
	|	ФормированиеОтчетаВыписки.Комментарий		КАК Комментарий,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ФормированиеОтчетаВыписки.Автор)	КАК Инициатор
	|ПОМЕСТИТЬ втФормированиеОтчетаВыписки
	|ИЗ
	|	Документ.ФормированиеОтчетаВыписки КАК ФормированиеОтчетаВыписки
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияВЭДО
	|	ПО
	|		ФормированиеОтчетаВыписки.Ссылка = РегистрацияВЭДО.Документ.ОперацияЦБ
	|
	|ГДЕ
	|	ФормированиеОтчетаВыписки.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ФормированиеОтчетаВыписки.Проведен
	|	И ФормированиеОтчетаВыписки.СчетДепо.ВидСчетаДепо = &ВидСчетаДЕПО
	|";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖО_втОперацииЦБПеремещения(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОперацииЦБ.Ссылка				КАК Операция,
	|	ОперацииЦБ.Дата					КАК Период,
	|	ОперацииЦБ.Номер				КАК НомерОперации,
	|	ОперацииЦБ.ВидОперацииД			КАК ВидОперации,
	|	ОперацииЦБ.СчетДепо				КАК СчетДепо,
	|	ОперацииЦБ.РазделСчетаДепо		КАК РазделСчетаДепо,
	|	ОперацииЦБ.ЦБ					КАК ЦеннаяБумага,
	|	ОперацииЦБ.ДокументОснование	КАК Поручение,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ОперацииЦБ.Автор) КАК Инициатор,
	|	ВЫБОР
	|		КОГДА ОперацииЦБ.ДокументОснование ССЫЛКА Документ.иц_СводноеПоручение
	|			ТОГДА ОперацииЦБ.Автор
	|		ИНАЧЕ ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ОперацииЦБ.Автор)
	|	КОНЕЦ КАК Исполнитель,
	|	""Перемещение / Списание""		КАК Комментарий,
	|	ВЫБОР
	|		КОГДА ОперацииЦБ.СчетДепо.ВидСчетаДепо = &ВидСчетаДЕПО
	|				И ОперацииЦБ.СчетДепоПолучатель.ВидСчетаДепо = &ВидСчетаДЕПО
	|			ТОГДА 1		// Нумеровать строки имеет смысл если их будет больше одной
	|		ИНАЧЕ 0
	|	КОНЕЦ							КАК ПорядокСтрок
	|ПОМЕСТИТЬ втОперацииЦБПеремещения
	|ИЗ
	|	Документ.ОперацииЦБ КАК ОперацииЦБ
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияВЭДО
	|	ПО
	|		ОперацииЦБ.Ссылка = РегистрацияВЭДО.Документ.ОперацияЦБ
	|ГДЕ
	|	ОперацииЦБ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОперацииЦБ.Проведен
	|	И ОперацииЦБ.ВидОперацииД В (&ОперацииПеремещения)
	|	И ОперацииЦБ.ЦБ.НФИ = 0
	|	И ОперацииЦБ.СчетДепо.ВидСчетаДепо = &ВидСчетаДЕПО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОперацииЦБ.Ссылка						КАК Операция,
	|	ОперацииЦБ.Дата							КАК Период,
	|	ОперацииЦБ.Номер						КАК НомерОперации,
	|	ОперацииЦБ.ВидОперацииД					КАК ВидОперации,
	|	ОперацииЦБ.СчетДепоПолучатель			КАК СчетДепо,
	|	ОперацииЦБ.РазделСчетаДепоПолучатель	КАК РазделСчетаДепо,
	|	ОперацииЦБ.ЦБ							КАК ЦеннаяБумага,
	|	ОперацииЦБ.ДокументОснование			КАК Поручение,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ОперацииЦБ.Автор) КАК Инициатор,
	|	ВЫБОР
	|		КОГДА ОперацииЦБ.ДокументОснование ССЫЛКА Документ.иц_СводноеПоручение
	|			ТОГДА ОперацииЦБ.Автор
	|		ИНАЧЕ ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ОперацииЦБ.Автор)
	|	КОНЕЦ КАК Исполнитель,
	|	""Перемещение / Зачисление""			КАК Комментарий,
	|	ВЫБОР
	|		КОГДА ОперацииЦБ.СчетДепо.ВидСчетаДепо = &ВидСчетаДЕПО
	|				И ОперацииЦБ.СчетДепоПолучатель.ВидСчетаДепо = &ВидСчетаДЕПО
	|			ТОГДА 2		// Нумеровать строки имеет смысл если их будет больше одной
	|		ИНАЧЕ 0
	|	КОНЕЦ									КАК ПорядокСтрок
	|ИЗ
	|	Документ.ОперацииЦБ КАК ОперацииЦБ
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияВЭДО
	|	ПО
	|		ОперацииЦБ.Ссылка = РегистрацияВЭДО.Документ.ОперацияЦБ
	|ГДЕ
	|	ОперацииЦБ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОперацииЦБ.Проведен
	|	И ОперацииЦБ.ВидОперацииД В (&ОперацииПеремещения)
	|	И ОперацииЦБ.ЦБ.НФИ = 0
	|	И ОперацииЦБ.СчетДепоПолучатель.ВидСчетаДепо = &ВидСчетаДЕПО
	|";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖО_втОперацииЦБПереводы(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОперацииЦБ.Ссылка				КАК Операция,
	|	ОперацииЦБ.Дата					КАК Период,
	|	ОперацииЦБ.Номер				КАК НомерОперации,
	|	ОперацииЦБ.ВидОперацииД			КАК ВидОперации,
	|	ОперацииЦБ.СчетДепо				КАК СчетДепо,
	|	ОперацииЦБ.РазделСчетаДепо		КАК РазделСчетаДепо,
	|	ОперацииЦБ.ЦБ					КАК ЦеннаяБумага,
	|	ОперацииЦБ.ДокументОснование	КАК Поручение,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ОперацииЦБ.Автор) КАК Инициатор,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ОперацииЦБ.Автор) КАК Исполнитель,
	|	""Перевод / Списание""			КАК Комментарий,
	|	ВЫБОР
	|		КОГДА ОперацииЦБ.СчетДепо.ВидСчетаДепо = &ВидСчетаДЕПО
	|				И ОперацииЦБ.СчетДепоПолучатель.ВидСчетаДепо = &ВидСчетаДЕПО
	|			ТОГДА 1		// Нумеровать строки имеет смысл если их будет больше одной
	|		ИНАЧЕ 0
	|	КОНЕЦ							КАК ПорядокСтрок
	|ПОМЕСТИТЬ втОперацииЦБПереводы
	|ИЗ
	|	Документ.ОперацииЦБ КАК ОперацииЦБ
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияВЭДО
	|	ПО
	|		ОперацииЦБ.Ссылка = РегистрацияВЭДО.Документ.ОперацияЦБ
	|ГДЕ
	|	ОперацииЦБ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОперацииЦБ.Проведен
	|	И ОперацииЦБ.ВидОперацииД = &ВидОперацииПеревод
	|	И ОперацииЦБ.ЦБ.НФИ = 0
	|	И ОперацииЦБ.СчетДепо.ВидСчетаДепо = &ВидСчетаДЕПО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОперацииЦБ.Ссылка						КАК Операция,
	|	ОперацииЦБ.Дата							КАК Период,
	|	ОперацииЦБ.Номер						КАК НомерОперации,
	|	ОперацииЦБ.ВидОперацииД					КАК ВидОперации,
	|	ОперацииЦБ.СчетДепоПолучатель			КАК СчетДепо,
	|	ОперацииЦБ.РазделСчетаДепоПолучатель	КАК РазделСчетаДепо,
	|	ОперацииЦБ.ЦБ							КАК ЦеннаяБумага,
	|	ОперацииЦБ.ДокументОснованиеВстречный	КАК Поручение,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ОперацииЦБ.Автор) КАК Инициатор,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ОперацииЦБ.Автор) КАК Исполнитель,
	|	""Перевод / Зачисление""				КАК Комментарий,
	|	ВЫБОР
	|		КОГДА ОперацииЦБ.СчетДепо.ВидСчетаДепо = &ВидСчетаДЕПО
	|				И ОперацииЦБ.СчетДепоПолучатель.ВидСчетаДепо = &ВидСчетаДЕПО
	|			ТОГДА 2		// Нумеровать строки имеет смысл если их будет больше одной
	|		ИНАЧЕ 0
	|	КОНЕЦ									КАК ПорядокСтрок
	|ИЗ
	|	Документ.ОперацииЦБ КАК ОперацииЦБ
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияВЭДО
	|	ПО
	|		ОперацииЦБ.Ссылка = РегистрацияВЭДО.Документ.ОперацияЦБ
	|ГДЕ
	|	ОперацииЦБ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОперацииЦБ.Проведен
	|	И ОперацииЦБ.ВидОперацииД = &ВидОперацииПеревод
	|	И ОперацииЦБ.ЦБ.НФИ = 0
	|	И ОперацииЦБ.СчетДепоПолучатель.ВидСчетаДепо = &ВидСчетаДЕПО
	|";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖО_втОперацииЦБОднострочные(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОперацииЦБ.Ссылка				КАК Операция,
	|	ОперацииЦБ.Дата					КАК Период,
	|	ОперацииЦБ.Номер				КАК НомерОперации,
	|	ОперацииЦБ.ВидОперацииД			КАК ВидОперации,
	|	ОперацииЦБ.СчетДепо				КАК СчетДепо,
	|	ОперацииЦБ.РазделСчетаДепо		КАК РазделСчетаДепо,
	|	ОперацииЦБ.ЦБ					КАК ЦеннаяБумага,
	|	ОперацииЦБ.ДокументОснование	КАК Поручение,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ОперацииЦБ.Автор) КАК Инициатор,
	|	ВЫБОР
	|		КОГДА ОперацииЦБ.ДокументОснование ССЫЛКА Документ.иц_СводноеПоручение
	|			ТОГДА ОперацииЦБ.Автор
	|		ИНАЧЕ ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ОперацииЦБ.Автор)
	|	КОНЕЦ КАК Исполнитель
	|ПОМЕСТИТЬ втОперацииЦБОднострочные
	|ИЗ
	|	Документ.ОперацииЦБ КАК ОперацииЦБ
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияВЭДО
	|	ПО
	|		ОперацииЦБ.Ссылка = РегистрацияВЭДО.Документ.ОперацияЦБ
	|ГДЕ
	|	ОперацииЦБ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОперацииЦБ.Проведен
	|	И НЕ ОперацииЦБ.ВидОперацииД В (&ДвустрочныеОперацииЦБ)
	|	И ОперацииЦБ.ЦБ.НФИ = 0
	|	И ОперацииЦБ.СчетДепо.ВидСчетаДепо = &ВидСчетаДЕПО
	|";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖО_втОткрытиеСчетаДепо(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокОткрытие.Ссылка КАК Операция,
	|	ДокОткрытие.Дата КАК Период,
	|	ДокОткрытие.Номер КАК НомерОперации,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(ДокОткрытие.ДокументОснование КАК Документ.Поручение).ВидОперацииД КАК Справочник.ВидыОпераций) КАК ВидОперации,
	|	ВЫРАЗИТЬ(ДокОткрытие.СчетДепо КАК Справочник.СчетаДепо) КАК СчетДепо,
	|	ВЫРАЗИТЬ(ДокОткрытие.ДокументОснование КАК Документ.Поручение) КАК Поручение,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ДокОткрытие.Автор) КАК Инициатор,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ДокОткрытие.Автор) КАК Исполнитель,
	|	ВЫБОР
	|		КОГДА ДокОткрытие.ВладелецСчета ССЫЛКА Справочник.МестаХранения
	|			ТОГДА ""Счет депо – "" + ДокОткрытие.НомерСчета
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Комментарий
	|ПОМЕСТИТЬ втОткрытиеСчетаДепо
	|ИЗ
	|	Документ.ОткрытиеСчетаДепо КАК ДокОткрытие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияВЭДО
	|		ПО ДокОткрытие.Ссылка = РегистрацияВЭДО.Документ.ОперацияЦБ
	|ГДЕ
	|	ДокОткрытие.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДокОткрытие.Проведен
	|	И (НЕ ДокОткрытие.СчетДепо ССЫЛКА Справочник.СчетаДепо
	|			ИЛИ ВЫРАЗИТЬ(ДокОткрытие.СчетДепо КАК Справочник.СчетаДепо).ВидСчетаДепо = &ВидСчетаДЕПО)";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖО_втОткрытиеРазделаСчетаДепо(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокОткрытие.Ссылка КАК Операция,
	|	ДокОткрытие.Дата КАК Период,
	|	ДокОткрытие.Номер КАК НомерОперации,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(ДокОткрытие.ДокументОснование КАК Документ.Поручение).ВидОперацииД КАК Справочник.ВидыОпераций) КАК ВидОперации,
	|	ДокОткрытие.СчетДепо КАК СчетДепо,
	|	ДокОткрытие.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ВЫРАЗИТЬ(ДокОткрытие.ДокументОснование КАК Документ.Поручение) КАК Поручение,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ДокОткрытие.Автор) КАК Инициатор,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ДокОткрытие.Автор) КАК Исполнитель
	|ПОМЕСТИТЬ втОткрытиеРазделаСчетаДепо
	|ИЗ
	|	Документ.ОткрытиеРазделаСчетаДепо КАК ДокОткрытие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияВЭДО
	|		ПО ДокОткрытие.Ссылка = РегистрацияВЭДО.Документ.ОперацияЦБ
	|ГДЕ
	|	ДокОткрытие.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДокОткрытие.Проведен
	|	И (НЕ ДокОткрытие.СчетДепо ССЫЛКА Справочник.СчетаДепо
	|			ИЛИ ВЫРАЗИТЬ(ДокОткрытие.СчетДепо КАК Справочник.СчетаДепо).ВидСчетаДепо = &ВидСчетаДЕПО)";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖО_втЗакрытиеРазделаСчетаДепо(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокЗакрытие.Ссылка КАК Операция,
	|	ДокЗакрытие.Дата КАК Период,
	|	ДокЗакрытие.Номер КАК НомерОперации,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(ДокЗакрытие.ДокументОснование КАК Документ.Поручение).ВидОперацииД КАК Справочник.ВидыОпераций) КАК ВидОперации,
	|	ДокЗакрытие.СчетДепо КАК СчетДепо,
	|	ДокЗакрытие.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ВЫРАЗИТЬ(ДокЗакрытие.ДокументОснование КАК Документ.Поручение) КАК Поручение,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ДокЗакрытие.Автор) КАК Инициатор,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ДокЗакрытие.Автор) КАК Исполнитель
	|ПОМЕСТИТЬ втЗакрытиеРазделаСчетаДепо
	|ИЗ
	|	Документ.ЗакрытиеРазделаСчетаДепо КАК ДокЗакрытие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияВЭДО
	|		ПО ДокЗакрытие.Ссылка = РегистрацияВЭДО.Документ.ОперацияЦБ
	|ГДЕ
	|	ДокЗакрытие.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДокЗакрытие.Проведен
	|	И (НЕ ДокЗакрытие.СчетДепо ССЫЛКА Справочник.СчетаДепо
	|			ИЛИ ВЫРАЗИТЬ(ДокЗакрытие.СчетДепо КАК Справочник.СчетаДепо).ВидСчетаДепо = &ВидСчетаДЕПО)";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖО_втЗакрытиеСчетаДепо(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗакрытиеСчетаДепо.Ссылка КАК Операция,
	|	ЗакрытиеСчетаДепо.Дата КАК Период,
	|	ЗакрытиеСчетаДепо.Номер КАК НомерОперации,
	|	ВЫРАЗИТЬ(ЗакрытиеСчетаДепо.ДокументОснование.ВидОперацииД КАК Справочник.ВидыОпераций) КАК ВидОперации,
	|	ВЫРАЗИТЬ(ЗакрытиеСчетаДепо.СчетДепо КАК Справочник.СчетаДепо) КАК СчетДепо,
	|	ЗакрытиеСчетаДепо.ДокументОснование КАК Поручение,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ЗакрытиеСчетаДепо.Автор) КАК Инициатор,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ЗакрытиеСчетаДепо.Автор) КАК Исполнитель
	|ПОМЕСТИТЬ втЗакрытиеСчетаДепо
	|ИЗ
	|	Документ.ЗакрытиеСчетаДепо КАК ЗакрытиеСчетаДепо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияВЭДО
	|		ПО ЗакрытиеСчетаДепо.Ссылка = РегистрацияВЭДО.Документ.ОперацияЦБ
	|ГДЕ
	|	ЗакрытиеСчетаДепо.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗакрытиеСчетаДепо.Проведен
	|	И (НЕ ЗакрытиеСчетаДепо.СчетДепо ССЫЛКА Справочник.СчетаДепо
	|			ИЛИ ВЫРАЗИТЬ(ЗакрытиеСчетаДепо.СчетДепо КАК Справочник.СчетаДепо).ВидСчетаДепо = &ВидСчетаДЕПО)";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖО_втНазначениеПредставителяСчетаДепо(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокНазначение.Ссылка КАК Операция,
	|	ДокНазначение.Дата КАК Период,
	|	ДокНазначение.Номер КАК НомерОперации,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(ДокНазначение.ДокументОснование КАК Документ.Поручение).ВидОперацииД КАК Справочник.ВидыОпераций) КАК ВидОперации,
	|	ВЫРАЗИТЬ(ДокНазначение.СчетДепо КАК Справочник.СчетаДепо) КАК СчетДепо,
	|	ВЫРАЗИТЬ(ДокНазначение.ДокументОснование КАК Документ.Поручение) КАК Поручение,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ДокНазначение.Автор) КАК Инициатор,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ДокНазначение.Автор) КАК Исполнитель
	|ПОМЕСТИТЬ втНазначениеПредставителяСчетаДепо
	|ИЗ
	|	Документ.НазначениеПредставителяСчетаДепо КАК ДокНазначение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияВЭДО
	|		ПО ДокНазначение.Ссылка = РегистрацияВЭДО.Документ.ОперацияЦБ
	|ГДЕ
	|	ДокНазначение.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДокНазначение.Проведен
	|	И (НЕ ДокНазначение.СчетДепо ССЫЛКА Справочник.СчетаДепо
	|			ИЛИ ВЫРАЗИТЬ(ДокНазначение.СчетДепо КАК Справочник.СчетаДепо).ВидСчетаДепо = &ВидСчетаДЕПО)";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖО_втОтменаПоручения(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтменаПоручения.Ссылка КАК Операция,
	|	ОтменаПоручения.Дата КАК Период,
	|	ОтменаПоручения.Номер КАК НомерОперации,
	|	ВЫРАЗИТЬ(ОтменаПоручения.ДокументОснование.ВидОперацииД КАК Справочник.ВидыОпераций) КАК ВидОперации,
	|	ОтменаПоручения.ДокументОснование КАК Поручение,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, ОтменаПоручения.Автор) КАК Инициатор,
	|	ОтменаПоручения.Автор КАК Исполнитель,
	|	ОтменаПоручения.ОтменяемоеПоручение.Номер КАК ОтменяемоеПоручениеНомер,
	|	ОтменаПоручения.ОтменяемоеПоручение.Дата КАК ОтменяемоеПоручениеДата,
	|	ОтменаПоручения.ОтменяемоеПоручение.ЦБ КАК ЦеннаяБумага,
	|	ОтменаПоручения.ОтменяемоеПоручение.СчетДепо КАК СчетДепо,
	|	ОтменаПоручения.ОтменяемоеПоручение.РазделСчетаДепо КАК РазделСчетаДепо
	|ПОМЕСТИТЬ втОтменаПоручения
	|ИЗ
	|	Документ.ОтменаПоручения КАК ОтменаПоручения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияВЭДО
	|		ПО ОтменаПоручения.Ссылка = РегистрацияВЭДО.Документ.ОперацияЦБ
	|ГДЕ
	|	ОтменаПоручения.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОтменаПоручения.Проведен";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖО_втИзменениеАнкетныхДанных(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Изменение.Ссылка КАК Операция,
	|	Изменение.Дата КАК Период,
	|	Изменение.Номер КАК НомерОперации,
	|	ВЫРАЗИТЬ(Изменение.ДокументОснование.ВидОперацииД КАК Справочник.ВидыОпераций) КАК ВидОперации,
	|	ВЫРАЗИТЬ(Изменение.СчетДепо КАК Справочник.СчетаДепо) КАК СчетДепо,
	|	Изменение.ДокументОснование КАК Поручение,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, Изменение.Автор) КАК Инициатор,
	|	ЕСТЬNULL(РегистрацияВЭДО.Пользователь, Изменение.Автор) КАК Исполнитель,
	|	Изменение.ДокументОснование.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ втИзменениеАнкетныхДанных
	|ИЗ
	|	Документ.ИзменениеАнкетныхДанных КАК Изменение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияВЭДО
	|		ПО Изменение.Ссылка = РегистрацияВЭДО.Документ.ОперацияЦБ
	|ГДЕ
	|	Изменение.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Изменение.Проведен
	|	И (НЕ Изменение.СчетДепо ССЫЛКА Справочник.СчетаДепо
	|			ИЛИ ВЫРАЗИТЬ(Изменение.СчетДепо КАК Справочник.СчетаДепо).ВидСчетаДепо = &ВидСчетаДЕПО)";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖО_втИзменениеКатегорииСчетовДепонента(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Изменение.Ссылка КАК Операция,
	|	Изменение.Дата КАК Период,
	|	Изменение.Номер КАК НомерОперации,
	|	ВЫРАЗИТЬ(Изменение.ДокументОснование.ВидОперацииД КАК Справочник.ВидыОпераций) КАК ВидОперации,
	|	СчетаДепо.Ссылка КАК СчетДепо,
	|	Изменение.ДокументОснование КАК Поручение,
	|	Изменение.Автор КАК Инициатор,
	|	Изменение.Автор КАК Исполнитель,
	|	Изменение.ДокументОснование.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ втИзменениеКатегорииСчетовДепонента
	|ИЗ
	|	Документ.ИзменениеКатегорииСчетовДепонента КАК Изменение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
	|		ПО (СчетаДепо.Владелец = Изменение.Депонент)
	|			И (НЕ СчетаДепо.ПометкаУдаления)
	|			И (ВЫБОР
	|				КОГДА СчетаДепо.ДатаОткрытияСчета > Изменение.Дата
	|					ТОГДА ЛОЖЬ
	|				КОГДА СчетаДепо.ДатаЗакрытияСчета <= Изменение.Дата
	|						И СчетаДепо.ДатаЗакрытияСчета <> ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	Изменение.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Изменение.Проведен";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖО_втЦенныеБумагиОбслуживание(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБОбслуживание.Ссылка	КАК Операция,
	|	ЦБОбслуживание.Дата		КАК Период,
	|	ЦБОбслуживание.Номер	КАК НомерОперации,
	|	ВЫРАЗИТЬ(ЦБОбслуживание.ДокументОснование.ВидОперацииД КАК Справочник.ВидыОпераций)	КАК ВидОперации,
	|	ЦБОбслуживание.ЦБ		КАК ЦеннаяБумага,
	|	ЦБОбслуживание.ДокументОснование	КАК Поручение,
	|	ЦБОбслуживание.Автор	КАК Инициатор,
	|	ЦБОбслуживание.Автор	КАК Исполнитель
	|ПОМЕСТИТЬ втЦенныеБумагиОбслуживание
	|ИЗ
	|	Документ.ЦенныеБумагиОбслуживание КАК ЦБОбслуживание
	|ГДЕ
	|	ЦБОбслуживание.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЦБОбслуживание.Проведен
	|	И ЦБОбслуживание.ЦБ.НФИ = 0
	|";
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗаполнитьЖО_втИсторияИзмененияПараметровЦБ(Запрос)
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Входящий.Дата, ДЕНЬ) КАК Период,
	|	МАКСИМУМ(Входящий.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ втВходящиеДокументы
	|ИЗ
	|	Документ.Входящий КАК Входящий
	|ГДЕ
	|	Входящий.Проведен
	|	И Входящий.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Входящий.ИсходящийНомер ПОДОБНО &ИсходящийНомер
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Входящий.Дата, ДЕНЬ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Входящий.Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВходящиеДокументы.Ссылка КАК Операция,
	|	ИсторияИзмененияПараметровЦБ.Период КАК Период,	
	|	ИсторияИзмененияПараметровЦБ.ЦеннаяБумага,
	|	ИсторияИзмененияПараметровЦБ.ПолноеНаименованиеЭмитента КАК ПолноеНаименованиеЭмитента,
	|	ИсторияИзмененияПараметровЦБ.КраткоеНаименованиеЭмитента КАК КраткоеНаименованиеЭмитента,
	|	ИсторияИзмененияПараметровЦБ.ВидЦБ КАК ВидЦБ,
	|	ИсторияИзмененияПараметровЦБ.ТипЦБ КАК ТипЦБ,
	|	ИсторияИзмененияПараметровЦБ.ISIN КАК ISIN,
	|	ИсторияИзмененияПараметровЦБ.НомерРегистрации КАК НомерРегистрации,
	|	ИсторияИзмененияПараметровЦБ.CFI КАК CFI,
	|	ИсторияИзмененияПараметровЦБ.ДатаВнесенияВЕГРЮЛ КАК ДатаВнесенияВЕГРЮЛ,
	|	ИсторияИзмененияПараметровЦБ.ОГРН КАК ОГРН,
	|	ИсторияИзмененияПараметровЦБ.ИНН КАК ИНН,
	|	ИсторияИзмененияПараметровЦБ.TIN КАК TIN,
	|	ИсторияИзмененияПараметровЦБ.РегНомер КАК РегНомер
	|ПОМЕСТИТЬ втИсторияЦБЗаПериод
	|ИЗ
	|	РегистрСведений.ИсторияИзмененияПараметровЦБ КАК ИсторияИзмененияПараметровЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втВходящиеДокументы КАК втВходящиеДокументы
	|		ПО ИсторияИзмененияПараметровЦБ.Период = втВходящиеДокументы.Период
	|ГДЕ
	|	ИсторияИзмененияПараметровЦБ.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ИсторияИзмененияПараметровЦБ.ЦеннаяБумага.НФИ = 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИсторияИзмененияПараметровЦБ.Период,
	|	ИсторияИзмененияПараметровЦБ.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияЦБСрезПоследних.Период КАК Период,
	|	ИсторияЦБСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втИсторияЦБСрезПоследних
	|ИЗ
	|	РегистрСведений.ИсторияИзмененияПараметровЦБ.СрезПоследних(
	|			&НачалоПериодаГраница,
	|			ЦеннаяБумага В
	|				(ВЫБРАТЬ
	|					втИсторияЦБЗаПериод.ЦеннаяБумага
	|				ИЗ
	|					втИсторияЦБЗаПериод)) КАК ИсторияЦБСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втИсторияЦБЗаПериод.Период,
	|	втИсторияЦБЗаПериод.ЦеннаяБумага
	|ИЗ
	|	втИсторияЦБЗаПериод КАК втИсторияЦБЗаПериод
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИсторияЦБЗаПериод.Период,
	|	втИсторияЦБЗаПериод.ЦеннаяБумага,
	|	МАКСИМУМ(втИсторияЦБСрезПоследних.Период) КАК ПредыдущийПериод
	|ПОМЕСТИТЬ втИсторияЦБПредыдущийПериод
	|ИЗ
	|	втИсторияЦБЗаПериод КАК втИсторияЦБЗаПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИсторияЦБСрезПоследних КАК втИсторияЦБСрезПоследних
	|		ПО втИсторияЦБЗаПериод.ЦеннаяБумага = втИсторияЦБСрезПоследних.ЦеннаяБумага
	|			И втИсторияЦБЗаПериод.Период > втИсторияЦБСрезПоследних.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	втИсторияЦБЗаПериод.Период,
	|	втИсторияЦБЗаПериод.ЦеннаяБумага
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	втИсторияЦБЗаПериод.Период,
	|	втИсторияЦБЗаПериод.ЦеннаяБумага,
	|	ПредыдущийПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИсторияЦБЗаПериод.Операция КАК Операция,
	|	втИсторияЦБЗаПериод.Операция.Дата КАК Период,
	|	ISNULL(втИсторияЦБЗаПериод.Операция.Номер, ""П"") КАК НомерОперации,
	|	&ИзменениеДанныхЦБ КАК ВидОперации,
	|	втИсторияЦБЗаПериод.ЦеннаяБумага КАК ЦеннаяБумага,
	|	втИсторияЦБЗаПериод.Операция.Исполнитель КАК Инициатор,
	|	втИсторияЦБЗаПериод.Операция.Исполнитель КАК Исполнитель,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(втИсторияЦБЗаПериод.ПолноеНаименованиеЭмитента КАК СТРОКА(1020))) <> (ВЫРАЗИТЬ(ИсторияЦБ.ПолноеНаименованиеЭмитента КАК СТРОКА(1020)))
	|			ТОГДА ""Полное наименование, ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(втИсторияЦБЗаПериод.КраткоеНаименованиеЭмитента КАК СТРОКА(1020))) <> (ВЫРАЗИТЬ(ИсторияЦБ.КраткоеНаименованиеЭмитента КАК СТРОКА(1020)))
	|			ТОГДА ""Краткое наименование, ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА втИсторияЦБЗаПериод.ДатаВнесенияВЕГРЮЛ <> ИсторияЦБ.ДатаВнесенияВЕГРЮЛ
	|			ТОГДА ""Дата ЕГРЮЛ, ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА втИсторияЦБЗаПериод.ОГРН <> ИсторияЦБ.ОГРН
	|			ТОГДА ""ОГРН, ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА втИсторияЦБЗаПериод.ИНН <> ИсторияЦБ.ИНН
	|			ТОГДА ""ИНН, ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА втИсторияЦБЗаПериод.TIN <> ИсторияЦБ.TIN
	|			ТОГДА ""TIN, ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА втИсторияЦБЗаПериод.РегНомер <> ИсторияЦБ.РегНомер
	|			ТОГДА ""Рег. номер, ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА втИсторияЦБЗаПериод.НомерРегистрации <> ИсторияЦБ.НомерРегистрации
	|			ТОГДА ""Рег. номер выпуска, ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА втИсторияЦБЗаПериод.ВидЦБ <> ИсторияЦБ.ВидЦБ
	|			ТОГДА ""Вид ЦБ, ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА втИсторияЦБЗаПериод.ТипЦБ <> ИсторияЦБ.ТипЦБ
	|			ТОГДА ""Тип ЦБ, ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА втИсторияЦБЗаПериод.ISIN <> ИсторияЦБ.ISIN
	|			ТОГДА ""ISIN, ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА втИсторияЦБЗаПериод.CFI <> ИсторияЦБ.CFI
	|			ТОГДА ""CFI, ""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Комментарий,
	|	1 КАК ПорядокСтрок
	|ПОМЕСТИТЬ втЦБИстория
	|ИЗ
	|	втИсторияЦБЗаПериод КАК втИсторияЦБЗаПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИсторияЦБПредыдущийПериод КАК втИсторияЦБПредыдущийПериод
	|		ПО втИсторияЦБЗаПериод.ЦеннаяБумага = втИсторияЦБПредыдущийПериод.ЦеннаяБумага
	|			И втИсторияЦБЗаПериод.Период = втИсторияЦБПредыдущийПериод.Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИзмененияПараметровЦБ КАК ИсторияЦБ
	|		ПО втИсторияЦБПредыдущийПериод.ЦеннаяБумага = ИсторияЦБ.ЦеннаяБумага
	|			И втИсторияЦБПредыдущийПериод.ПредыдущийПериод = ИсторияЦБ.Период";
	Запрос.Выполнить();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

// Возвращает из НомерДокумента буквенный префикс, длиной не более МаксДлинаПрефикса
Функция БуквыПрефиксаНомера(НомерДокумента, МаксДлинаПрефикса = 2)
	Буквы = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЪЩЬЫЭЮЯабвгдеёжзийклмнопрстуфхцчшъщьыэюя";
	Префикс = "";
	Инд = 0;
	Пока Инд < СтрДлина(НомерДокумента) И Инд < МаксДлинаПрефикса Цикл
		ТекущийСимвол = Сред(НомерДокумента, Инд+1, 1);
		Если Найти(Буквы, ТекущийСимвол) > 0 Тогда
			Префикс = Префикс + ТекущийСимвол;
			Инд = Инд + 1;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Префикс;
КонецФункции

Функция СписокПустыхЗначенийРеквизитаДокументКД()
	ПустыеЗначенияДокументаКД = Новый Массив;
	ПустыеЗначенияДокументаКД.Добавить(Неопределено);
	ПустыеЗначенияДокументаКД.Добавить(Документы.Поручение.ПустаяСсылка());
	ПустыеЗначенияДокументаКД.Добавить(Документы.КорпоративноеДействие_Новый.ПустаяСсылка());
	ПустыеЗначенияДокументаКД.Добавить(Документы.РаскрытиеСпискаВладельцев.ПустаяСсылка());
	Возврат ПустыеЗначенияДокументаКД;
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
