
&НаСервере
Перем мКэшПраваДоступаКМетаданным;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ОбъектОтбора", ДокументСсылка);
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ОбновитьДеревоСтруктурыПодчиненности();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДокументСсылка = ДокументИсточник;
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ОбновитьДеревоСтруктурыПодчиненности();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Обновить(Команда)
	
	ВывестиСтруктуруПодчиненности();
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиДляТекущего(Команда)
	
	ТекущийДокумент = Элементы.ТаблицаОтчета.ТекущаяОбласть.Расшифровка;
	
	Если ЗначениеЗаполнено(ТекущийДокумент) Тогда
		ДокументСсылка = ТекущийДокумент;
		ЭтаФорма.КлючУникальности = ТекущийДокумент;
	Иначе
		Возврат;
	КонецЕсли;
	
	ВывестиСтруктуруПодчиненности();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументКоманда(Команда)
	
	ДокументКомандыСсылка = Элементы.ТаблицаОтчета.ТекущаяОбласть.Расшифровка;
	Если Не ЗначениеЗаполнено(ДокументКомандыСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ДействияНаСервереНадДокументом = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("ДокументПометкаУдаления,ДокументПровести,ДокументОтменитьПроведение", ",");
	Если ДействияНаСервереНадДокументом.Найти(Команда.Имя) <> Неопределено Тогда
		ДокументПроведен = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ДокументКомандыСсылка, "Проведен");
		
		Если Не ДокументПроведен И Команда.Имя = "ДокументОтменитьПроведение" Тогда
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(ДокументКомандыСсылка) = Тип("ДокументСсылка.Поручение") И ДокументПроведен Тогда
			Если Команда.Имя = "ДокументОтменитьПроведение" Тогда
				Режим = РежимДиалогаВопрос.ДаНет;
				Ответ = Вопрос(НСтр("ru = 'Отменить проведение документа?'"), Режим, 0);
				Если Ответ = КодВозвратаДиалога.Нет Тогда
					Возврат;
				КонецЕсли;
			ИначеЕсли Команда.Имя = "ДокументПометкаУдаления" Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Пометить на удаление можно только Поручение, у которого отменено проведение!";
				Сообщение.Сообщить();
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ОшибкаВыполнения = ВыполнитьДействиеНадДокументомСервер(ДокументКомандыСсылка, Команда.Имя);
		Если ЗначениеЗаполнено(ОшибкаВыполнения) Тогда
			ПоказатьПредупреждение(, "Ошибка:" + Символы.ПС + ОшибкаВыполнения);
		КонецЕсли;
		ВывестиСтруктуруПодчиненности();
	ИначеЕсли Команда.Имя = "ДокументОткрыть" Тогда
		ОткрытьЗначение(ДокументКомандыСсылка);
	ИначеЕсли Команда.Имя = "ДокументПоказатьВСписке" Тогда
		НайтиВСписке(ДокументКомандыСсылка);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура НайтиВСписке(ДокументСсылка)
	
	Попытка
		ПолноеИмя = ПолноеИмяМетаданных(ДокументСсылка);
		Если ПолноеИмя = Неопределено Тогда
			Возврат;			
		КонецЕсли; 
		ФормаСписка = ПолучитьФорму(ПолноеИмя + ".ФормаСписка");	
		
		Если ТипЗнч(ФормаСписка) = Тип("УправляемаяФорма") Тогда
			Попытка
				ФормаСписка.Открыть();
				ФормаСписка.Элементы.Список.ТекущаяСтрока = ДокументСсылка;
			Исключение
				Попытка
					ФормаСписка.Открыть();
					ФормаСписка.ТекущийЭлемент.ТекущаяСтрока = ДокументСсылка;
				Исключение
					ВызватьИсключение "Что-то не так при попытке спозиционироваться на документе!";
				КонецПопытки;
			КонецПопытки;
		Иначе
			ФормаСписка.ПараметрТекущаяСтрока = ДокументСсылка;
			ФормаСписка.Открыть();
		КонецЕсли;
		
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолноеИмяМетаданных(ДокументСсылка)
	Возврат ДокументСсылка.Метаданные().ПолноеИмя();
КонецФункции
	
&НаСервере
Функция ВыполнитьДействиеНадДокументомСервер(ДокументСсылка, ИмяКоманды)
	Если Не ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда
		Возврат "";
	КонецЕсли;
	Если БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДокументСсылка)) Тогда
		ТипОбъекта = "БизнесПроцесс";
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДокументСсылка)) Тогда
		ТипОбъекта = "Документ";
	Иначе
		Возврат "";
	КонецЕсли;
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	Попытка
		Если ИмяКоманды = "ДокументПометкаУдаления" Тогда
			ДокументОбъект.УстановитьПометкуУдаления(НЕ ДокументОбъект.ПометкаУдаления);
		ИначеЕсли ИмяКоманды = "ДокументПровести" И ТипОбъекта = "Документ" Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ИначеЕсли ИмяКоманды = "ДокументОтменитьПроведение" И ТипОбъекта = "Документ" Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли ИмяКоманды = "ДокументПровести" И ТипОбъекта = "БизнесПроцесс" Тогда
			Возврат "Выполнение бизнес-процесса из структуры подчиненности не предусмотрено."
		ИначеЕсли ИмяКоманды = "ДокументОтменитьПроведение" И ТипОбъекта = "БизнесПроцесс" Тогда
			Возврат "Сброс бизнес-процесса из структуры подчиненности не предусмотрен."
		КонецЕсли;
	Исключение		
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());		
	КонецПопытки;
КонецФункции
//////////////////////////////////////////////////////////////////////////////////////////////
// Процедуры вывода в табличный документ.

// Выводит дерево подчиненности в табличный документ
&НаСервере
Процедура ВывестиТабличныйДокумент()

	ТаблицаОтчета.Очистить();
	
	Макет = ПолучитьОбщийМакет("СтруктураПодчиненности");
	
	ВывестиРодительскиеЭлементыДерева(ДеревоРодительскиеДокументы.ПолучитьЭлементы(),Макет,1);
	ВывестиТекущийДокумент(Макет);
	ВывестиПодчиненныеЭлементыДерева(ДеревоПодчиненныеДокументы.ПолучитьЭлементы(),Макет,1)
	
КонецПроцедуры

// Выводит строки дерева родительских документов
//
// Параметры
//  СтрокиДерева  - ДанныеФормыКоллекцияЭлементовДерева - строки дерева
//                 которые выводятся в табличный документ
//  Макет  - МакетТабличногоДокумента - макет, на основании которого
//           происходит вывод в табличный документ
//  УровеньРекурсии - Число - уровень рекурсии процедуры
//
&НаСервере
Процедура ВывестиРодительскиеЭлементыДерева(СтрокиДерева,Макет,УровеньРекурсии)
	
	Счетчик =  СтрокиДерева.Количество();
	Пока Счетчик >0 Цикл
		
		ТекущаяСтрокаДерева = СтрокиДерева.Получить(Счетчик -1);
		ПодчиненныеЭлементыСтрокиДерева = ТекущаяСтрокаДерева.ПолучитьЭлементы();
		ВывестиРодительскиеЭлементыДерева(ПодчиненныеЭлементыСтрокиДерева,Макет,УровеньРекурсии + 1);
		
		Для инд=1 По УровеньРекурсии Цикл
			
			Если инд = УровеньРекурсии Тогда
				
				Если СтрокиДерева.Индекс(ТекущаяСтрокаДерева) < (СтрокиДерева.Количество()-1) Тогда
					Область = Макет.ПолучитьОбласть("КоннекторВерхПравоНиз");
				Иначе	
					Область = Макет.ПолучитьОбласть("КоннекторПравоНиз");
				КонецЕсли;
				
			Иначе
				
				Если НеобходимостьВыводаВертикальногоКоннектора(УровеньРекурсии - инд + 1,ТекущаяСтрокаДерева,Ложь) Тогда
					Область = Макет.ПолучитьОбласть("КоннекторВерхНиз");
				Иначе
					Область = Макет.ПолучитьОбласть("Отступ");
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если инд = 1 Тогда
				ТаблицаОтчета.Вывести(Область);
			Иначе
				ТаблицаОтчета.Присоединить(Область);
			КонецЕсли;
			
		КонецЦикла;
		
		ВывестиДокументИКартинку(ТекущаяСтрокаДерева,Макет,Ложь,Ложь);

		Счетчик = Счетчик - 1;
		
	КонецЦикла;
	
КонецПроцедуры

// Выводит в табличный документ картинку, соответствующую статусу документа и его представление
//
&НаСервере
Процедура ВывестиДокументИКартинку(СтрокаДерева,Макет,ЭтоТекущийДокумент = Ложь,ЭтоПодчиненный = Неопределено)
	
	//Вывод картинки
	Если СтрокаДерева.Проведен Тогда
		Если ЭтоПодчиненный = Неопределено  Тогда
			Если ДеревоПодчиненныеДокументы.ПолучитьЭлементы().Количество() И ДеревоРодительскиеДокументы.ПолучитьЭлементы().Количество()  Тогда
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторВерхНиз");
			ИначеЕсли ДеревоПодчиненныеДокументы.ПолучитьЭлементы().Количество() Тогда
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторНиз");
			ИначеЕсли ДеревоРодительскиеДокументы.ПолучитьЭлементы().Количество() Тогда
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторВерх");
			Иначе
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторВерх");
			КонецЕсли;
		ИначеЕсли ЭтоПодчиненный = Истина Тогда
			Если СтрокаДерева.ПолучитьЭлементы().Количество() Тогда
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторЛевоНиз");
			Иначе
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведен");
			КонецЕсли;
		Иначе
			Если СтрокаДерева.ПолучитьЭлементы().Количество() Тогда
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторЛевоВерх");
			Иначе
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведен");
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли СтрокаДерева.ПометкаУдаления Тогда
		Если ЭтоПодчиненный = Неопределено Тогда
			Если ДеревоПодчиненныеДокументы.ПолучитьЭлементы().Количество() И ДеревоРодительскиеДокументы.ПолучитьЭлементы().Количество()  Тогда
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПомеченНаУдалениеКоннекторВерхНиз");
			ИначеЕсли ДеревоПодчиненныеДокументы.ПолучитьЭлементы().Количество() Тогда
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПомеченНаУдалениеКоннекторНиз");
			ИначеЕсли ДеревоРодительскиеДокументы.ПолучитьЭлементы().Количество() Тогда
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПомеченНаУдалениеКоннекторВерх");
			Иначе
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПомеченНаУдалениеКоннекторВерх");
			КонецЕсли;
		ИначеЕсли ЭтоПодчиненный = Истина Тогда
			Если СтрокаДерева.ПолучитьЭлементы().Количество() Тогда
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПомеченНаУдалениеКоннекторЛевоНиз");
			Иначе
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПомеченНаУдаление");
			КонецЕсли;
		Иначе
			Если СтрокаДерева.ПолучитьЭлементы().Количество() Тогда
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПомеченНаУдалениеКоннекторЛевоВерх");
			Иначе
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПомеченНаУдаление");
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если СтрокаДерева.Ссылка = ДокументСсылка Тогда
			Если ДеревоПодчиненныеДокументы.ПолучитьЭлементы().Количество() И ДеревоРодительскиеДокументы.ПолучитьЭлементы().Количество()  Тогда
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументЗаписанКоннекторВерхНиз");
			ИначеЕсли ДеревоПодчиненныеДокументы.ПолучитьЭлементы().Количество() Тогда
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументЗаписанКоннекторНиз");
			ИначеЕсли ДеревоРодительскиеДокументы.ПолучитьЭлементы().Количество() Тогда
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументЗаписанКоннекторВерх");
			Иначе
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументЗаписанКоннекторВерх");
			КонецЕсли;
		ИначеЕсли ЭтоПодчиненный = Истина Тогда
			Если СтрокаДерева.ПолучитьЭлементы().Количество() Тогда
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументЗаписанКоннекторЛевоНиз");
			Иначе
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументЗаписан");
			КонецЕсли;
		Иначе
			Если СтрокаДерева.ПолучитьЭлементы().Количество() Тогда
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументЗаписанКоннекторЛевоВерх");
			Иначе
				ОбластьКартинка = Макет.ПолучитьОбласть("ДокументЗаписан");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЭтоТекущийДокумент Тогда
		ТаблицаОтчета.Вывести(ОбластьКартинка) 
	Иначе
		ТаблицаОтчета.Присоединить(ОбластьКартинка);
	КонецЕсли;
	
	
	//Вывод документа
	ОбластьДокумент = Макет.ПолучитьОбласть(?(ЭтоТекущийДокумент,"ТекущийДокумент","Документ"));
	ОбластьДокумент.Параметры.ПредставлениеДокумента = СтрокаДерева.Представление;
	ОбластьДокумент.Параметры.Документ = СтрокаДерева.Ссылка;
	ТаблицаОтчета.Присоединить(ОбластьДокумент);
	
КонецПроцедуры

// Определяет необходимость вывода вертикального коннектора в  табличный документ
//
// Параметры
//  УровеньВверх  - Число - на каком количестве уровней выше находится 
//                 родитель от которого будет рисоваться вертикальный коннектор
//  СтрокаДерева  - ДанныеФормыЭлементДерева - исходная строка дерева значений
//                  от которой ведется отсчет.
// Возвращаемое значение:
//   Булево   - необходимость вывода в области вертикального коннектора.
//
&НаСервере
Функция НеобходимостьВыводаВертикальногоКоннектора(УровеньВверх,СтрокаДерева,ИщемСредиПодчиненных = Истина)
	
	ТекущаяСтрока = СтрокаДерева;
	
	Для инд=1 По УровеньВверх Цикл
		
		ТекущаяСтрока = ТекущаяСтрока.ПолучитьРодителя();
		Если инд = УровеньВверх Тогда
			ИскомыйРодитель = ТекущаяСтрока;
		ИначеЕсли инд = (УровеньВверх-1) Тогда
			ИскомаяСтрока = ТекущаяСтрока;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИскомыйРодитель = Неопределено Тогда
		Если ИщемСредиПодчиненных Тогда
			ПодчиненныеЭлементыРодителя =  ДеревоПодчиненныеДокументы.ПолучитьЭлементы(); 
		Иначе
			ПодчиненныеЭлементыРодителя =  ДеревоРодительскиеДокументы.ПолучитьЭлементы();
		КонецЕсли;
	Иначе
		ПодчиненныеЭлементыРодителя =  ИскомыйРодитель.ПолучитьЭлементы(); 
	КонецЕсли;
	
	Возврат ПодчиненныеЭлементыРодителя.Индекс(ИскомаяСтрока) < (ПодчиненныеЭлементыРодителя.Количество()-1);
	
КонецФункции

// Выводит в табличный документ строку с документом, для которого формируется структура подчиненности
//
// Параметры
//  Макет  - МакетТабличногоДокумента - макет, на основании которого формируется табличный документ.
&НаСервере
Процедура ВывестиТекущийДокумент(Макет)
	
	Выборка = ПолучитьВыборкуПоРеквизитамДокумента(ДокументСсылка);
	Если Выборка.Следующий() Тогда
		
		ПереопределяемоеПредставление = ПолучитьПереопределяемоеПредставлениеДокументаДляПечати(Выборка);
		
		Если ПереопределяемоеПредставление <> Неопределено Тогда
			СтруктураРеквизитов = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка.Владелец().Выгрузить()[0]);
			СтруктураРеквизитов.Представление = ПереопределяемоеПредставление;
			ВывестиДокументИКартинку(СтруктураРеквизитов,Макет,Истина);
		Иначе
			СтруктураРеквизитов = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка.Владелец().Выгрузить()[0]);
			СтруктураРеквизитов.Представление = ПолучитьПредставлениеДокументаДляПечати(СтруктураРеквизитов);
			ВывестиДокументИКартинку(СтруктураРеквизитов,Макет,Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует представление документа для вывода в табличный документ
//
// Параметры
//  Выборка  - ВыборкаИзРезультатаЗапроса или ДанныеФормыЭлементДерева - набор данных
//             на основании которого формируется представление
//
// Возвращаемое значение:
//   Строка   - сформированное представление
//
&НаСервере
Функция ПолучитьПредставлениеДокументаДляПечати(Выборка)
	
	ПредставлениеДокумента = Выборка.Представление;
	Если (Выборка.СуммаДокумента <> 0) И (Выборка.СуммаДокумента <> NULL) Тогда
		ПредставлениеДокумента = ПредставлениеДокумента + " " + НСтр("ru='на сумму'") + " " + Выборка.СуммаДокумента + " " + Выборка.ВалютаДокумента + ".";
	КонецЕсли;
	
	Возврат ПредставлениеДокумента;
	
КонецФункции

// Выводит строки дерева подчиненных документов
//
// Параметры
//  СтрокиДерева  - ДанныеФормыКоллекцияЭлементовДерева - строки дерева
//                 которые выводятся в табличный документ
//  Макет  - МакетТабличногоДокумента - макет, на основании которого
//                 происходит вывод в табличный документ
//  УровеньРекурсии - Число - уровень рекурсии процедуры
//
&НаСервере
Процедура ВывестиПодчиненныеЭлементыДерева(СтрокиДерева,Макет,УровеньРекурсии)

	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		
		ЭтоТекущийДокумент = (СтрокаДерева.Ссылка = ДокументСсылка);
		ЭтоИсходныйДокумент = (СтрокаДерева.Ссылка = ДокументИсточник);
		ПодчиненныеЭлементыДерева = СтрокаДерева.ПолучитьЭлементы();
		
		//Вывод коннекторов
		Для инд = 1 По УровеньРекурсии Цикл
			Если УровеньРекурсии > инд Тогда
				
				Если НеобходимостьВыводаВертикальногоКоннектора(УровеньРекурсии - инд + 1,СтрокаДерева) Тогда
					Область = Макет.ПолучитьОбласть("КоннекторВерхНиз");
				Иначе
					Область = Макет.ПолучитьОбласть("Отступ");
					
				КонецЕсли;
			Иначе 
				
				Если СтрокиДерева.Количество() > 1 И (СтрокиДерева.Индекс(СтрокаДерева)<> (СтрокиДерева.Количество()-1)) Тогда
					Область = Макет.ПолучитьОбласть("КоннекторВерхПравоНиз");
				Иначе
					Область = Макет.ПолучитьОбласть("КоннекторВерхПраво");
				КонецЕсли;
				
			КонецЕсли;	
			
			Область.Параметры.Документ = ?(ЭтоИсходныйДокумент,Неопределено,СтрокаДерева.Ссылка);
			
			Если инд = 1 Тогда
				ТаблицаОтчета.Вывести(Область);
			Иначе
				ТаблицаОтчета.Присоединить(Область);
			КонецЕсли;
			
		КонецЦикла;		
		
		ВывестиДокументИКартинку(СтрокаДерева,Макет,Ложь,Истина);
		
		//Вывод подчиненных элементов дерева
		ВывестиПодчиненныеЭлементыДерева(ПодчиненныеЭлементыДерева,Макет,УровеньРекурсии + 1);
		
	КонецЦикла;
	
КонецПроцедуры

//Инициирует вывод в табличный документ и отображает его по окончанию формирования.
&НаКлиенте
Процедура ВывестиСтруктуруПодчиненности()

	ОбновитьДеревоСтруктурыПодчиненности();

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////////////
// Процедуры построения дерева подчиненности документов.

&НаСервере
Процедура ОбновитьДеревоСтруктурыПодчиненности()

	Если ОсновнойДокументДоступен() Тогда
		СформироватьДеревьяДокументов();
		ВывестиТабличныйДокумент();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Нстр("ru = 'Документ, для которого сформирован отчет о структуре подчиненности, стал недоступен.'"));
	КонецЕсли;

КонецПроцедуры

// Перегруппирует Дерево таким образом что документы определенного вида указанные в Подчиненный 
// будут подчинены документам определенного вида укзанного в Родитель, сопоставление будет выполнено по Реквизиту документа Подчиненный
//
// Параметры
//  Дерево  - Строка, ИмяРеквизитаДерева.
//  Подчиненный - Строка, вид документа
//  Родитель - Строка, вид документа
//	Реквизит - Строка, имя реквизита 
//
&НаСервере
Процедура ПерегруппироватьДокументы(ДеревоОбъект, Подчиненный, Родитель, Реквизит, ЭлементВерхнегоУровня = Неопределено)
		
	СтрокиПодчиненный = Новый Массив();
	ДобавитьСтрокиДокументаОпределенногоВида(СтрокиПодчиненный, ДеревоОбъект, Подчиненный);
	
	СтрокиРодитель = Новый Массив();
	ДобавитьСтрокиДокументаОпределенногоВида(СтрокиРодитель, ДеревоОбъект, Родитель);
	
	Если СтрокиПодчиненный.Количество() = 0 ИЛИ (СтрокиРодитель.Количество() = 0 И Не ЗначениеЗаполнено(ЭлементВерхнегоУровня)) Тогда 
		Возврат;	
	КонецЕсли;
	
	Для Каждого ПодчиненнаяСтрока Из СтрокиПодчиненный Цикл 
		ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПодчиненнаяСтрока.Ссылка, Реквизит);
		Если ЗначениеРеквизита = ЭлементВерхнегоУровня Тогда 
			СкопироватьСтрокуДерева(ПодчиненнаяСтрока, ДеревоОбъект);
			Если ПодчиненнаяСтрока.Родитель = Неопределено Тогда 
				ДеревоОбъект.Строки.Удалить(ПодчиненнаяСтрока);
			Иначе
				ПодчиненнаяСтрока.Родитель.Строки.Удалить(ПодчиненнаяСтрока);
			КонецЕсли;
		Иначе 	
			Для Каждого  РодительскаяСтрока Из СтрокиРодитель Цикл
				Если РодительскаяСтрока.Ссылка = ЗначениеРеквизита Тогда 
					СкопироватьСтрокуДерева(ПодчиненнаяСтрока, РодительскаяСтрока);
					Если ПодчиненнаяСтрока.Родитель = Неопределено Тогда 
						ДеревоОбъект.Строки.Удалить(ПодчиненнаяСтрока);
					Иначе
						ПодчиненнаяСтрока.Родитель.Строки.Удалить(ПодчиненнаяСтрока);
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
		
КонецПроцедуры

Процедура СкопироватьСтрокуДерева(Откуда, Куда)
	
	НоваяСтрока = Куда.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Откуда);
	Для Каждого Строка Из Откуда.Строки Цикл 
		СкопироватьСтрокуДерева(Строка,НоваяСтрока);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиДокументаОпределенногоВида(МассивСтрок, Дерево, ВидДокумента)
		
	ИскомыйТип = Тип("ДокументСсылка." + ВидДокумента);
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл 
		Если ТипЗнч(СтрокаДерева.Ссылка) = ИскомыйТип Тогда 
			МассивСтрок.Добавить(СтрокаДерева);
		ИначеЕсли СтрокаДерева.Строки.Количество() > 0 Тогда 
			ДобавитьСтрокиДокументаОпределенногоВида(МассивСтрок, СтрокаДерева, ВидДокумента);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревьяДокументов()

	мКэшПраваДоступаКМетаданным= Новый Соответствие;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РаскрытиеСпискаВладельцев") Тогда 
		КарточкаКД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "КарточкаКД");
		Если ЗначениеЗаполнено(КарточкаКД) Тогда
			ДокументСсылка = КарточкаКД;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("БизнесПроцессСсылка.ОбработкаWTRCСообщения") Тогда
		ДокументСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка,"КД");
	КонецЕсли;
	
	ДеревоРодительскиеДокументы.ПолучитьЭлементы().Очистить();
	ДеревоПодчиненныеДокументы.ПолучитьЭлементы().Очистить();

	СписокВыведенныхДокументов.Очистить();
	СписокВыведенныхДокументов.Добавить(ДокументСсылка);
	ВывестиРодительскиеДокументы(ДокументСсылка,ДеревоРодительскиеДокументы);
	ВывестиПодчиненныеДокументы(ДокументСсылка,ДеревоПодчиненныеДокументы);
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорпоративноеДействие_Новый") Тогда
		ДеревоОбъект = РеквизитФормыВЗначение("ДеревоПодчиненныеДокументы");
		ПерегруппироватьДокументы(ДеревоОбъект, "РаскрытиеСпискаВладельцев", "КорпоративноеДействие_Новый", "КарточкаКД", ДокументСсылка);
		ПерегруппироватьДокументы(ДеревоОбъект, "УведомлениеКлиентам", "КорпоративноеДействие_Новый", "ДокументОснование",ДокументСсылка);
		ПерегруппироватьДокументы(ДеревоОбъект, "ЗапросСубброкеруНаРаскрытие", "КорпоративноеДействие_Новый", "КД",ДокументСсылка);
		ПерегруппироватьДокументы(ДеревоОбъект, "ОтветСубброкераНаРаскрытие", "ЗапросСубброкеруНаРаскрытие", "ЗапросНаРСВ",ДокументСсылка);		
		ЗначениеВРеквизитФормы(ДеревоОбъект,"ДеревоПодчиненныеДокументы");
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Поручение") Тогда
		СтрокиДерева = ДеревоПодчиненныеДокументы.ПолучитьЭлементы();
		ДанныеУслугПоОснованию = РегистрыСведений.ОснованияУслугДепозитария.ДанныеУслугПоОснованию(ДокументСсылка);
		Если ЗначениеЗаполнено(ДанныеУслугПоОснованию) Тогда
			Пока ДанныеУслугПоОснованию.Следующий() Цикл
				ДобавитьСтрокуВДерево(СтрокиДерева, ДанныеУслугПоОснованию);
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.УслугиДепозитария") Тогда
		СтрокиДерева = ДеревоРодительскиеДокументы.ПолучитьЭлементы();
		ДанныеОснованийУслуги = РегистрыСведений.ОснованияУслугДепозитария.ДанныеОснованийУслуги(ДокументСсылка);
		Если ЗначениеЗаполнено(ДанныеОснованийУслуги) Тогда
			Пока ДанныеОснованийУслуги.Следующий() Цикл
				ДобавитьСтрокуВДерево(СтрокиДерева, ДанныеОснованийУслуги);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОсновнойДокументДоступен()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1
	|ИЗ
	|	Документ.Выписка КАК Таб
	|ГДЕ
	|	Таб.Ссылка = &ТекущийДокумент
	|");
	Запрос.УстановитьПараметр("ТекущийДокумент", ДокументСсылка);
	ЗаменитьТекстЗапросаПоМетаданнымОбъекта(Запрос.Текст, ДокументСсылка);
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции


&НаСервереБезКонтекста
Процедура ЗаменитьТекстЗапросаПоМетаданнымОбъекта(ТекстЗапроса, ОбъектСсылка)
	Если ОбъектСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ОбъектСсылка) = Тип("Массив") Тогда
		// предполагается массив однотипных значений
		ОбъектСсылкаТип = ТипЗнч(ОбъектСсылка[0]);
		ОбъектСсылкаМетаданныеИмя = ОбъектСсылка[0].Метаданные().Имя;
	Иначе
		ОбъектСсылкаТип = ТипЗнч(ОбъектСсылка);
		ОбъектСсылкаМетаданныеИмя = ОбъектСсылка.Метаданные().Имя;
	КонецЕсли;
	Если Документы.ТипВсеСсылки().СодержитТип(ОбъектСсылкаТип) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.Выписка", "Документ." + ОбъектСсылкаМетаданныеИмя);
	ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(ОбъектСсылкаТип) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".Проведен", ".Стартован");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.Выписка", "БизнесПроцесс." + ОбъектСсылкаМетаданныеИмя);
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Выписка", "&" + ОбъектСсылкаМетаданныеИмя);
КонецПроцедуры

// Получает выборку по реквизитам документа
//
// Параметры
//  ДокументСсылка  - ДокументСсылка - документ, значения реквизитов которого получаются запросом.
//
// Возвращаемое значение:
//   ВыборкаИзРезультатаЗапроса
//
&НаСервереБезКонтекста
Функция ПолучитьВыборкуПоРеквизитамДокумента(ДокументСсылка)
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокумент.Ссылка,
	|	ТаблицаДокумент.Проведен КАК Проведен,
	|	ТаблицаДокумент.ПометкаУдаления,
	|	&Сумма,
	|	&Валюта,
	|	&Представление
	|ИЗ
	|	Документ.Выписка КАК ТаблицаДокумент
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	ЗаменитьТекстЗапросаПоМетаданнымОбъекта(ТекстЗапроса, ДокументСсылка);
	ЗаменитьТекстЗапроса(ТекстЗапроса, МетаданныеДокумента, "&Сумма", "СуммаДокумента");
	ЗаменитьТекстЗапроса(ТекстЗапроса, МетаданныеДокумента, "&Валюта", "ВалютаДокумента");
	
	МассивДопРеквизитов = МассивДополнительныхРеквизитовДокумента(МетаданныеДокумента.Имя);
	
	ДополнитьТекстЗапросаПоРеквизитамДокумента(ТекстЗапроса, МассивДопРеквизитов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Возврат Запрос.Выполнить().Выбрать(); 
	
КонецФункции

&НаСервере
Процедура ВывестиРодительскиеДокументы(ТекущийДокумент, ДеревоРодитель)

	СтрокиДерева = ДеревоРодитель.ПолучитьЭлементы();
	МетаданныеДокумента = ТекущийДокумент.Метаданные();
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипДатаВремя = Новый ОписаниеТипов("Дата", , , , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	РодительскиеОбъекты = Новый ТаблицаЗначений;
	РодительскиеОбъекты.Колонки.Добавить("Ссылка");
	РодительскиеОбъекты.Колонки.Добавить("Дата", ТипДатаВремя);
	РодительскиеОбъекты.Колонки.Добавить("ТипСсылки");
	РодительскиеОбъекты.Колонки.Добавить("СсылкаИз", ТипСтрока);
	РодительскиеОбъекты.Колонки.Добавить("ВывестиРодительскиеДокументы", ТипБулево);
	РодительскиеОбъекты.Колонки.Добавить("УдалитьСтроку", ТипБулево);
	РодительскиеОбъекты.Колонки.Добавить("ВывестиПодчиненныеДокументы", ТипБулево);
	
	
	Для Каждого Реквизит ИЗ МетаданныеДокумента.Реквизиты Цикл
		
		//Если Метаданные.КритерииОтбора.СтруктураПодчиненности.Состав.Содержит(Реквизит) Тогда
			
			Для Каждого ТекущийТип Из Реквизит.Тип.Типы() Цикл
				
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
				
				Если МетаданныеРеквизита <> Неопределено
					И (Метаданные.Документы.Содержит(МетаданныеРеквизита) Или Метаданные.БизнесПроцессы.Содержит(МетаданныеРеквизита))
					И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
					
					ЗначениеРеквизита = ТекущийДокумент[Реквизит.Имя];
					
					Если ЗначениеЗаполнено(ЗначениеРеквизита)
						И ТипЗнч(ЗначениеРеквизита) = ТекущийТип
						И ЗначениеРеквизита <> ТекущийДокумент
						И РодительскиеОбъекты.Найти(ЗначениеРеквизита, "Ссылка") = Неопределено Тогда
						
						ЗаполнитьЗначенияСвойств(РодительскиеОбъекты.Добавить(), Новый Структура("Ссылка, Дата, ТипСсылки, СсылкаИз", ЗначениеРеквизита, ЗначениеРеквизита.Дата, ТипЗнч(ЗначениеРеквизита), "Шапки"));
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		//КонецЕсли;
		
	КонецЦикла;

	Для Каждого ТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		СтрРеквизитов = "";

		СодержимоеТЧ = ТекущийДокумент[ТЧ.Имя].Выгрузить();

		Для Каждого Реквизит Из ТЧ.Реквизиты Цикл

			//Если Метаданные.КритерииОтбора.СтруктураПодчиненности.Состав.Содержит(Реквизит) Тогда
				
				Для Каждого ТекущийТип Из Реквизит.Тип.Типы() Цикл
					
					МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
					
					Если МетаданныеРеквизита<>Неопределено
						И Метаданные.Документы.Содержит(МетаданныеРеквизита)
						И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
						
						СтрРеквизитов = СтрРеквизитов + ?(СтрРеквизитов = "", "", ", ") + Реквизит.Имя;
						Прервать;
						
					КонецЕсли;
				КонецЦикла;
				
			//КонецЕсли;
			
		КонецЦикла;

		СодержимоеТЧ.Свернуть(СтрРеквизитов);
		Для Каждого КолонкаТЧ ИЗ СодержимоеТЧ.Колонки Цикл

			Для Каждого СтрокаТЧ ИЗ СодержимоеТЧ Цикл

				ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];

				МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
				Если МетаданныеЗначения <> Неопределено Тогда

					Если ЗначениеЗаполнено(ЗначениеРеквизита)
						И Метаданные.Документы.Содержит(МетаданныеЗначения)
						И ЗначениеРеквизита <> ТекущийДокумент
						И РодительскиеОбъекты.Найти(ЗначениеРеквизита, "Ссылка") = Неопределено Тогда

							ЗаполнитьЗначенияСвойств(РодительскиеОбъекты.Добавить(), Новый Структура("Ссылка, Дата, ТипСсылки, СсылкаИз", ЗначениеРеквизита, ЗначениеРеквизита.Дата, ТипЗнч(ЗначениеРеквизита), "ТабличнойЧасти"));

					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	РодительскиеОбъекты.Сортировать("Дата");
	
	Если РодительскиеОбъекты.Количество() <> 0 Тогда
		ПервыйОбъект = РодительскиеОбъекты[0];
		Если РодительскиеОбъекты.Количество() = 1 Тогда
			Если ПервыйОбъект.СсылкаИз = "Шапки" Тогда
				ПервыйОбъект.ВывестиРодительскиеДокументы = Истина;
			КонецЕсли;
		Иначе
			ПропускаемыеТипы = Новый Массив();
			ПропускаемыеТипы.Добавить(Тип("ДокументСсылка.ЗапросСубброкеруНаРаскрытие"));
			ПропускаемыеТипы.Добавить(Тип("ДокументСсылка.ОтветСубброкераНаРаскрытие"));
			Для Каждого ПропускаемыйТип Из ПропускаемыеТипы Цикл
				НайденныеСтроки = РодительскиеОбъекты.НайтиСтроки(Новый Структура("ТипСсылки", ПропускаемыйТип));
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					НайденнаяСтрока.УдалитьСтроку = Истина;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		НайденныеСтроки = РодительскиеОбъекты.НайтиСтроки(Новый Структура("ТипСсылки", Тип("ДокументСсылка.ИсполнениеПоручения")));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.УдалитьСтроку = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого РодительскийОбъект Из РодительскиеОбъекты Цикл
		
		Если РодительскийОбъект.УдалитьСтроку Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка = ПолучитьВыборкуПоРеквизитамДокумента(РодительскийОбъект.Ссылка);
		
		Если Выборка.Следующий() Тогда
			
			Если СписокВыведенныхДокументов.НайтиПоЗначению(Выборка.Ссылка) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СписокВыведенныхДокументов.Добавить(Выборка.Ссылка);
			
			СтрокаДерева = ДобавитьСтрокуВДерево(СтрокиДерева, Выборка);
			Если НЕ ДобавляемыйДокументИмеетсяСредиРодителей(ДеревоРодитель, РодительскийОбъект.Ссылка) Тогда
				Если РодительскийОбъект.ВывестиРодительскиеДокументы Тогда
					ВывестиРодительскиеДокументы(РодительскийОбъект.Ссылка, СтрокаДерева);
				КонецЕсли;
				Если РодительскийОбъект.ВывестиПодчиненныеДокументы Тогда
					ВывестиПодчиненныеДокументы(РодительскийОбъект.Ссылка, СтрокаДерева);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Определяет наличие документа среди родителей строки дерева, которая возможно будет добавлена
//
// Параметры
//  СтрокаРодитель  - ДанныеФормыДерево,ДанныеФормыЭлементДерева - родитель, для 
//                 которого предполагается добавить строку дерева.
//  ДокументСсылка  - Документ - документ, на наличие которого выполняется проверка
//
// Возвращаемое значение:
//   Булево   - Истина если найден, Ложь в обратном случае.
//
&НаСервере
Функция ДобавляемыйДокументИмеетсяСредиРодителей(СтрокаРодитель,ИскомыйДокумент)
	
	Если ИскомыйДокумент = ДокументСсылка Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаРодитель) = Тип("ДанныеФормыДерево") Тогда
		Возврат Ложь; 
	КонецЕсли;
	
	ТекущийРодитель = СтрокаРодитель;
	Пока ТекущийРодитель <> Неопределено Цикл
		Если ТекущийРодитель.Ссылка = ИскомыйДокумент Тогда
		    Возврат Истина;
		КонецЕсли;
		ТекущийРодитель = ТекущийРодитель.ПолучитьРодителя();
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции


&НаСервереБезКонтекста
Процедура ЗаменитьТекстЗапроса(ТекстЗапроса, МетаданныеДокумента, ЧтоЗаменять, ИмяРеквизита)

	Если МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЧтоЗаменять, ИмяРеквизита + " КАК " + ИмяРеквизита);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЧтоЗаменять, " NULL КАК " + ИмяРеквизита);
	КонецЕсли;

КонецПроцедуры

// Функция разбирает строку вида
// ТипОбъектаМетаданных.ИмяДокумента.ТабличнаяЧасть.ИмяТабличнойЧасти.Реквизит.ИмяРеквизита.
// ТипОбъектаМетаданных должен быть Справочник или Документ.
//
// Параметры:
//  ПутьКДанным - строка.
//
// Возвращаемое значение:
//  Структура - путь к объекту метаданных
//
&НаСервере
Функция РазобратьПутьКОбъектуМетаданных(ПутьКДанным,МетаданныеДокументы) Экспорт
	
	Структура = Новый Структура;
	
	СоответствиеИмен = Новый Массив();
	СоответствиеИмен.Добавить("ТипОбъекта");
	СоответствиеИмен.Добавить("ВидОбъекта");
	СоответствиеИмен.Добавить("ПутьКДанным");
	СоответствиеИмен.Добавить("ИмяТаблЧасти");
	СоответствиеИмен.Добавить("ИмяРеквизита");
	
	Для индекс = 1 по 3 Цикл
		
		Точка = Найти(ПутьКДанным, ".");
		ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
		Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
		ПутьКДанным = Сред(ПутьКДанным, Точка+1);
		
	КонецЦикла;
	
	ПутьКДанным = СтрЗаменить(ПутьКДанным, "Реквизит.", "");
	
	Если Структура.ПутьКДанным = "ТабличнаяЧасть" Тогда
		
		Для индекс = 4 по 5  Цикл 
			
			Точка = Найти(ПутьКДанным, ".");
			Если Точка = 0 Тогда
				ТекущееЗначение = ПутьКДанным;
			Иначе
				ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
			КонецЕсли;
			
			Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
			ПутьКДанным = Сред(ПутьКДанным,  Точка+1);
			
		КонецЦикла;
		
	Иначе
		
		Структура.Вставить(СоответствиеИмен[3], "");
		Структура.Вставить(СоответствиеИмен[4], ПутьКДанным);
		
	КонецЕсли;
	
	ЕстьДоступКМетаданным = мКэшПраваДоступаКМетаданным.Получить(Структура.ТипОбъекта+"."+Структура.ВидОбъекта);
	Если ЕстьДоступКМетаданным = неопределено Тогда
		Если Структура.ТипОбъекта = "Документ" Тогда
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Документы[Структура.ВидОбъекта]);
		ИначеЕсли Структура.ТипОбъекта = "БизнесПроцесс" Тогда
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.БизнесПроцессы[Структура.ВидОбъекта]);
		Иначе
			ЕстьДоступКМетаданным = ПравоДоступа("Чтение", Метаданные.Справочники[Структура.ВидОбъекта]);
		КонецЕсли;
	КонецЕсли;                                                          
	
	Структура.Вставить("ЕстьДоступКМетаданным", ЕстьДоступКМетаданным);
	мКэшПраваДоступаКМетаданным.Вставить(Структура.ТипОбъекта+"."+Структура.ВидОбъекта,ЕстьДоступКМетаданным);        
	
	Возврат Структура;
	
КонецФункции // РазобратьПутьКОбъектуМетаданных()

&НаСервере
Процедура ВывестиПодчиненныеДокументы(ТекущийДокумент,ДеревоРодитель)
	
	СтрокиДерева = ДеревоРодитель.ПолучитьЭлементы();
	ТипДокумента = ТипЗнч(ТекущийДокумент);

	СтруктураРеквизитов = Новый ТаблицаЗначений;
	СтруктураРеквизитов.Колонки.Добавить("ПутьКДанным");
	СтруктураРеквизитов.Колонки.Добавить("ИмяРеквизита");
	СтруктураРеквизитов.Колонки.Добавить("ЕстьСуммаДокумента", Новый ОписаниеТипов("Булево"));
	СтруктураРеквизитов.Колонки.Добавить("ЕстьВалютаДокумента", Новый ОписаниеТипов("Булево"));
	
	Для каждого Док ИЗ Метаданные.Документы Цикл
		Если НЕ ПравоДоступа("Чтение", Док) Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьСуммаДокумента = НЕ (Док.Реквизиты.Найти("СуммаДокумента") = Неопределено);
		ЕстьВалютаДокумента = НЕ (Док.Реквизиты.Найти("ВалютаДокумента") = Неопределено);
				
		Для Каждого Реквизит Из Док.Реквизиты Цикл
			Если Реквизит.Тип.СодержитТип(ТипДокумента) Тогда			
				НовСтр = СтруктураРеквизитов.Добавить();
				НовСтр.ПутьКДанным = Док.Имя;
				НовСтр.ИмяРеквизита = Реквизит.Имя;
				НовСтр.ЕстьСуммаДокумента = ЕстьСуммаДокумента;
				НовСтр.ЕстьВалютаДокумента = ЕстьВалютаДокумента;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТЧ ИЗ Док.ТабличныеЧасти Цикл
			Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
				Если Реквизит.Тип.СодержитТип(ТипДокумента) Тогда
					НовСтр = СтруктураРеквизитов.Добавить();
					НовСтр.ПутьКДанным = Док.Имя+"."+ТЧ.Имя;
					НовСтр.ИмяРеквизита = Реквизит.Имя;
					НовСтр.ЕстьСуммаДокумента = ЕстьСуммаДокумента;
					НовСтр.ЕстьВалютаДокумента = ЕстьВалютаДокумента;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;		
		
	КонецЦикла;	
	ТекстЗапроса = "";
 	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		
		Если Найти(КлючИЗначение.ПутьКДанным, ".") = 0 Тогда
		
			ТекстЗапроса = ТекстЗапроса + "
			|Выбрать " + ?(ТекстЗапроса="", "РАЗРЕШЕННЫЕ ", "") + "Ссылка, Ссылка.Дата Как ДатаДок, Представление, #СуммаДокумента, #ВалютаДокумента, Проведен, ПометкаУдаления, """+ КлючИЗначение.ПутьКДанным +""" КАК ВидДокумента ИЗ Документ."+КлючИЗначение.ПутьКДанным+"
			|ГДЕ "+КлючИЗначение.ИмяРеквизита+"=&ДокументОснование
			|ОБЪЕДИНИТЬ ВСЕ
			|";
			
			Если КлючИЗначение.ЕстьСуммаДокумента Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#СуммаДокумента", "СуммаДокумента КАК СуммаДокумента");
			Иначе
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#СуммаДокумента", "NULL КАК СуммаДокумента");
			КонецЕсли;
			
			Если КлючИЗначение.ЕстьВалютаДокумента Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ВалютаДокумента", "ВалютаДокумента КАК ВалютаДокумента");
			Иначе
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ВалютаДокумента", "NULL КАК ВалютаДокумента");
			КонецЕсли;
			
		Иначе
			ПозицияТочки = Найти(КлючИЗначение.ПутьКДанным, ".");
			ТекстЗапроса = ТекстЗапроса + "
			|Выбрать " + ?(ТекстЗапроса="", "РАЗРЕШЕННЫЕ ", "") + "Ссылка, Ссылка.Дата Как ДатаДок, Ссылка.Представление,  #СуммаДокумента, #ВалютаДокумента, Ссылка.Проведен, Ссылка.ПометкаУдаления, """+ Лев(КлючИЗначение.ПутьКДанным, ПозицияТочки-1) +""" КАК ВидДокумента ИЗ Документ."+КлючИЗначение.ПутьКДанным+"
			|ГДЕ "+КлючИЗначение.ИмяРеквизита+"=&ДокументОснование
			|ОБЪЕДИНИТЬ ВСЕ
			|";
			
			Если КлючИЗначение.ЕстьСуммаДокумента Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#СуммаДокумента", "Ссылка.СуммаДокумента КАК СуммаДокумента");
			Иначе
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#СуммаДокумента", "NULL КАК СуммаДокумента");
			КонецЕсли;
			
			Если КлючИЗначение.ЕстьВалютаДокумента Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ВалютаДокумента", "Ссылка.ВалютаДокумента КАК ВалютаДокумента");
			Иначе
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ВалютаДокумента", "NULL КАК ВалютаДокумента");
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	СтруктураРеквизитов = Новый ТаблицаЗначений;
	СтруктураРеквизитов.Колонки.Добавить("ПутьКДанным");
	СтруктураРеквизитов.Колонки.Добавить("ИмяРеквизита");
    	
	Для каждого БП ИЗ Метаданные.БизнесПроцессы Цикл
		Если НЕ ПравоДоступа("Чтение", БП) Тогда
			Продолжить;
		КонецЕсли;
						
		Для Каждого Реквизит Из БП.Реквизиты Цикл
			Если Реквизит.Тип.СодержитТип(ТипДокумента) Тогда			
				НовСтр = СтруктураРеквизитов.Добавить();
				НовСтр.ПутьКДанным = БП.Имя;
				НовСтр.ИмяРеквизита = Реквизит.Имя;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;	
	
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		
		ТекстЗапроса = ТекстЗапроса + "
		|Выбрать " + ?(ТекстЗапроса="", "РАЗРЕШЕННЫЕ ", "") + "Ссылка, Ссылка.Дата Как ДатаДок, Представление, NULL КАК СуммаДокумента, NULL КАК ВалютаДокумента, Завершен КАК Проведен, ПометкаУдаления, """+ КлючИЗначение.ПутьКДанным +""" КАК ВидДокумента ИЗ БизнесПроцесс."+КлючИЗначение.ПутьКДанным+"
		|ГДЕ "+КлючИЗначение.ИмяРеквизита+"=&ДокументОснование
		|ОБЪЕДИНИТЬ ВСЕ
		|";
				
	КонецЦикла;  
	
	Если ТекстЗапроса="" Тогда
		Возврат;
	КонецЕсли;		
	
	ТекстЗапроса = Лев (ТекстЗапроса, СтрДлина(ТекстЗапроса)-15);
	//ТекстЗапроса = ТекстЗапроса+ "
	//|УПОРЯДОЧИТЬ ПО  ДатаДок";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументОснование", ТекущийДокумент);
	
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл
		Если СписокВыведенныхДокументов.НайтиПоЗначению(Выборка.Ссылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.Поручение")
			И ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ИсполнениеПоручения") Тогда
			Продолжить;
		КонецЕсли;	
		Если Не ДобавляемыйДокументИмеетсяСредиРодителей(ДеревоРодитель,Выборка.Ссылка) Тогда
			НоваяСтрока = ДобавитьСтрокуВДерево(СтрокиДерева, Выборка);
			СписокВыведенныхДокументов.Добавить(Выборка.Ссылка);
			ВывестиПодчиненныеДокументы(Выборка.Ссылка,НоваяСтрока)
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ДобавитьСтрокуВДерево(СтрокиДерева, Выборка, ДопПредставление = "")
	
	НоваяСтрока = СтрокиДерева.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "Ссылка, Представление, СуммаДокумента, ВалютаДокумента, Проведен, ПометкаУдаления");
	
	ПереопределенноеПредставление = ПолучитьПереопределяемоеПредставлениеДокументаДляПечати(Выборка);
	Если ПереопределенноеПредставление <> Неопределено Тогда
		НоваяСтрока.Представление = ПереопределенноеПредставление;
	Иначе
		НоваяСтрока.Представление = ПолучитьПредставлениеДокументаДляПечати(Выборка);
	КонецЕсли;
	НоваяСтрока.Представление = НоваяСтрока.Представление + ДопПредставление;
	
	Возврат НоваяСтрока;

КонецФункции

&НаСервереБезКонтекста
Процедура ДополнитьТекстЗапросаПоРеквизитамДокумента(ТекстЗапроса, МассивРеквизитов)
	
	ТекстПредставление = "Представление КАК Представление";
	
	Для Инд = 1 По 3 Цикл
		
		ТекстПредставление = ТекстПредставление + ",
			                   |	" + ?(МассивРеквизитов.Количество() >= Инд,МассивРеквизитов[инд - 1],"NULL") + " Как ДополнительныйРеквизит" + Инд;
		
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Представление", ТекстПредставление);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПереопределяемоеПредставлениеДокументаДляПечати(Выборка)
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция МассивДополнительныхРеквизитовДокумента(ТипОбъектаСтрокой)
	
	МассивРеквизитов = Новый Массив;
	Возврат МассивРеквизитов;
	
КонецФункции
