
#Область ПрограммныйИнтерфейс

// Возвращает налоговую базу за период по юр.\физ.лицу депонента
//
// Параметры:
//  Депонент		 - СправочникСсылка.Контрагенты	 - Депонент
//  КодДохода		 - СправочникСсылка.ДоходыНДФЛ	 - Код дохода (пусто - по всем)
//  МоментВремени	 - МоментВремени				 - МоментВремени документа в пределах года определения базы
// 
// Возвращаемое значение:
//   - Число - Сумма налоговой базы
//
Функция НалоговаяБазаЗаПериод(Депонент, КодДохода, МоментВремени) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(СУММА(НалоговаяБазаВыплатыДоходовОбороты.СуммаДоходаОборот - НалоговаяБазаВыплатыДоходовОбороты.СуммаРасходаОборот), 0) КАК СуммаДохода
	|ИЗ
	|	РегистрНакопления.НалоговаяБазаВыплатыДоходов.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			ЮридическиеФизическиеЛица = &ЮридическиеФизическиеЛица
	|				И ВЫБОР
	|					КОГДА &ПоВсемДоходам
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ КодДохода = &КодДохода
	|				КОНЕЦ) КАК НалоговаяБазаВыплатыДоходовОбороты";
	
	Запрос.УстановитьПараметр("ЮридическиеФизическиеЛица"	, Депонент.ЮридическиеФизическиеЛица);
	Запрос.УстановитьПараметр("ПоВсемДоходам"				, КодДохода = Неопределено);
	Запрос.УстановитьПараметр("КодДохода"					, КодДохода);
	Запрос.УстановитьПараметр("НачалоПериода"				, НачалоГода(МоментВремени.Дата));
	Запрос.УстановитьПараметр("КонецПериода"				, Новый Граница(МоментВремени, ВидГраницы.Исключая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаДохода;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Возвращает сумму остатка округления налога за период по юр.\физ.лицу депонента
//
// Параметры:
//  Депонент		 - СправочникСсылка.Контрагенты	 - Депонент
//  КодДохода		 - СправочникСсылка.ДоходыНДФЛ	 - Код дохода (пусто - по всем)
//  МоментВремени	 - МоментВремени				 - МоментВремени документа в пределах года определения базы
// 
// Возвращаемое значение:
//   - Число - Сумма остатка округления налога
//
Функция СуммаОстаткаОкругленияНалогаЗаПериод(Депонент, КодДохода, МоментВремени) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НалоговаяБазаВыплатыДоходовОбороты.СуммаОкругленияНалогаОборот КАК СуммаОкругленияНалога,
	|	НалоговаяБазаВыплатыДоходовОбороты.Период КАК Период
	|ИЗ
	|	РегистрНакопления.НалоговаяБазаВыплатыДоходов.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ЮридическиеФизическиеЛица = &ЮридическиеФизическиеЛица
	|				И ВЫБОР
	|					КОГДА &ПоВсемДоходам
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ КодДохода = &КодДохода
	|				КОНЕЦ) КАК НалоговаяБазаВыплатыДоходовОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("ЮридическиеФизическиеЛица"	, Депонент.ЮридическиеФизическиеЛица);
	Запрос.УстановитьПараметр("ПоВсемДоходам"				, КодДохода = Неопределено);
	Запрос.УстановитьПараметр("КодДохода"					, КодДохода);
	Запрос.УстановитьПараметр("НачалоПериода"				, НачалоГода(МоментВремени.Дата));
	Запрос.УстановитьПараметр("КонецПериода"				, Новый Граница(МоментВремени, ВидГраницы.Исключая));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.СуммаОкругленияНалога;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
