
// при записи
Процедура ПриЗаписи(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьДлинуСтрокиХранилища(Хранилище) Экспорт
	
	ТекстПравилаОбмена = Хранилище.Получить();
	РазмерСтроки = СтрДлина(ТекстПравилаОбмена);
	Возврат РазмерСтроки;
	
КонецФункции

// Перед записью
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Вся почта должна обрабатываться через один внешний источник ("робот рассылки")
	Если СпособОбмена = Перечисления.СпособыОбменаДанными.ОбменЧерезПочту 
		И НЕ (ДополнительныеСвойства.Свойство("НеУстанавливатьИспользованиеУчетнойЗаписиРоботаПринудительно")
				И ДополнительныеСвойства.НеУстанавливатьИспользованиеУчетнойЗаписиРоботаПринудительно = Истина) Тогда
		ЭтоРоботРассылки = (Ссылка = Справочники.НастройкиОбменаДанными.РоботРассылкиPROD)
							ИЛИ (Ссылка = Справочники.НастройкиОбменаДанными.РоботРассылкиUAT);
		ИспользоватьУчетнуюЗаписьСообщенийВнешнегоИсточника = НЕ ЭтоРоботРассылки;
		Если НЕ ЭтоРоботРассылки Тогда
			ИспользоватьУчетнуюЗаписьСообщенийВнешнегоИсточника = Истина;
			ВнешнийИсточникПриемаОтправкиСообщений = ПланыВидовХарактеристик.ВнешниеИсточники.РоботРассылки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры