&НаСервере
Процедура СформироватьОтчетыСервер()
	Отчет.РезультатыФормирования.Очистить();
	Элементы.ОтчетКлиент.СписокВыбора.Очистить();
	Результат.Очистить();
	
	ОтчетАдрес	= "";
	ОтчетКлиент	= Справочники.Контрагенты.ПустаяСсылка();
	
	Объект	= РеквизитФормыВЗначение("Отчет");
	Объект.СформироватьОтчеты(СписокКлиентов);
	
	РезультатыФормирования.Загрузить(Объект.РезультатыФормирования);
	// Заполним список клиентов
	Если Объект.РезультатыФормирования.Количество() > 0 Тогда
		Элементы.ОтчетКлиент.СписокВыбора.ЗагрузитьЗначения(Объект.РезультатыФормирования.ВыгрузитьКолонку("Клиент"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОтчетПоКлиенту()
	Если ЗначениеЗаполнено(ОтчетКлиент) Тогда
		НайденныеОтчеты		= РезультатыФормирования.НайтиСтроки(Новый Структура("Клиент", ОтчетКлиент));
		ОтчетАдрес			= НайденныеОтчеты[0].ОтчетАдрес;
		Результат			= ПолучитьИзВременногоХранилища(ОтчетАдрес);
		Результат.Защита	= Ложь;
	Иначе
		Результат = Новый ТабличныйДокумент;
		ОтчетАдрес = "";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если СписокКлиентов.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указано ни одного 'Клиента' для формирования отчета!");
		Возврат;
	КонецЕсли;
	
	СформироватьОтчетыСервер();
	
	Если  Элементы.ОтчетКлиент.СписокВыбора.Количество() > 0 Тогда
		ОтчетКлиент = Элементы.ОтчетКлиент.СписокВыбора.Получить(0).Значение;
	КонецЕсли;
	ОтобразитьОтчетПоКлиенту();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетКлиентПриИзменении(Элемент)
	ОтобразитьОтчетПоКлиенту();
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриИзмененииСодержимогоОбласти(Элемент, Область)
	ПоместитьВоВременноеХранилище(Результат, ОтчетАдрес);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.ДатаФормирования	= ТекущаяДата();
	Отчет.ПериодНачало		= НачалоМесяца(ДобавитьМесяц(ТекущаяДата()	, -1));
	Отчет.ПериодКонец		= КонецМесяца(ДобавитьМесяц(ТекущаяДата()	, -1));
	
	Отчет.КаталогВыгрузки	= СокрЛП(ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.КаталогОтчетовПоКомиссиям).Папка);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
		
	#Если ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Тогда
		НастройкаПериода = Новый НастройкаПериода;
		НастройкаПериода.УстановитьПериод(Отчет.ПериодНачало, ?(Отчет.ПериодНачало='0001-01-01', Отчет.ПериодКонец, НачалоДня(Отчет.ПериодНачало)));
		НастройкаПериода.РедактироватьКакИнтервал	= Истина;
		НастройкаПериода.РедактироватьКакПериод		= Истина;
		НастройкаПериода.ВариантНастройки			= ВариантНастройкиПериода.Период;
		НастройкаПериода.ВариантПериода				= ВариантПериода.Год;
		НастройкаПериода.Редактировать();
		Отчет.ПериодНачало	= НастройкаПериода.ПолучитьДатуНачала();
		Отчет.ПериодКонец	= НастройкаПериода.ПолучитьДатуОкончания();
	#Иначе
		Диалог	= Новый ДиалогРедактированияСтандартногоПериода();		
		Диалог.Период.ДатаНачала	= Отчет.ПериодНачало;
		Диалог.Период.ДатаОкончания	= ?(Отчет.ПериодНачало=Дата('0001-01-01'), Отчет.ПериодКонец, НачалоДня(Отчет.ПериодНачало));
		Диалог.Период.Вариант		= ВариантСтандартногоПериода.ПроизвольныйПериод;
		
		Если Диалог.Редактировать() Тогда
			Отчет.ПериодНачало	= Диалог.Период.ДатаНачала;
			Отчет.ПериодКонец	= Диалог.Период.ДатаОкончания;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогВыбора.Заголовок				= "Выберите каталог выгрузки";
	ДиалогВыбора.Каталог				= Отчет.КаталогВыгрузки;
	ДиалогВыбора.ПредварительныйПросмотр= Ложь;
	ДиалогВыбора.МножественныйВыбор		= Ложь;
	
	Если ДиалогВыбора.Выбрать() Тогда
		Отчет.КаталогВыгрузки			= ДиалогВыбора.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьОтчетыСервер()
	Для Каждого Строка Из РезультатыФормирования Цикл
		ИмяФайла = "" + СокрЛП(Строка.Клиент.Код) + "_" + Формат(Отчет.ПериодНачало, "ДФ=ddMMyyyy") + "_"+Формат(Отчет.ПериодКонец, "ДФ=ddMMyyyy") + ".pdf";
		ОтчетКлиента = ПолучитьИзВременногоХранилища(Строка.ОтчетАдрес);
		ОтчетКлиента.Записать(Отчет.КаталогВыгрузки + "\" + ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОтчеты(Команда)
	Если ЗначениеЗаполнено(Отчет.КаталогВыгрузки) Тогда
		СохранитьОтчетыСервер();
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Не указан каталог сохранения отчетов!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Для Каждого Строка Из РезультатыФормирования Цикл
		УдалитьИзВременногоХранилища(Строка.ОтчетАдрес);
	КонецЦикла;
КонецПроцедуры
