
 Процедура ПрочитатьДанныеОтчетовНКЦ() Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаЗагрузки) Тогда
		ТекстСообщения = "Не указана дата загрузки, загрузка невозможна";
		ЗаписьЖурналаРегистрации(ЭтотОбъект.Метаданные().Синоним, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(КаталогОтчетов) Тогда
		КаталогОтчетов = ПолучитьТекущуюПапкуОтчетовНКЦ();
	КонецЕсли;
	
	КаталогАрхива = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогОтчетов) + "Archive\";
	ФайлыEQM06 = Новый СписокЗначений;
	ДатаЗагрузкиБезРазделителей = СтрЗаменить(Формат(ДатаЗагрузки, "ДФ=ddMMyy"), ".", "");
	МаскаПоискаФайлов = "*_EQM06_*_" + ДатаЗагрузкиБезРазделителей + "_*.xml";
	Диалоги.ПоискФайлов(КаталогОтчетов, МаскаПоискаФайлов, Ложь, ФайлыEQM06);
	Если ФайлыEQM06.Количество() = 0 Тогда
		ТекстСообщения = "За дату "+Формат(ДатаЗагрузки,"ДФ=dd.MM.yyyy") +" не найдено отчетов НКЦ EQM06";
		ЗаписьЖурналаРегистрации(ЭтотОбъект.Метаданные().Синоним, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОтчетыНКЦ.Очистить();
	ЧтениеXML = Новый ЧтениеXML;
	НКЦ = Константы.КлиринговаяОрганизация.Получить().Наименование;

	Для Каждого ОбрабатываемыйФайл Из ФайлыEQM06 Цикл
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		ИмяФайла = ОбрабатываемыйФайл.Представление;
		КопироватьФайл(ОбрабатываемыйФайл.Значение, ИмяВременногоФайла);
		ОбрабатываемыйФайл.Значение = ИмяВременногоФайла;
		ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
		Пока ЧтениеXML.Прочитать() Цикл
			Если Не ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				Продолжить;
			КонецЕсли;
			Если ЧтениеXML.ЛокальноеИмя = "DOC_REQUISITES" Тогда
				Если Не ЧтениеXML.ЗначениеАтрибута("DOC_TYPE_ID") = "EQM06" Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока						= ОтчетыНКЦ.Добавить();
				НоваяСтрока.ИсходящийНомер		= ЧтениеXML.ЗначениеАтрибута("DOC_NO");
				НоваяСтрока.ДатаДокумента		= Дата(СтрЗаменить(ЧтениеXML.ЗначениеАтрибута("DOC_DATE"),"-","")+СтрЗаменить(ЧтениеXML.ЗначениеАтрибута("DOC_TIME"),":",""));
				НоваяСтрока.Комментарий			= ИмяФайла;
				НоваяСтрока.НаименованиеДокументаИлиКомплекта= "Отчет "+НКЦ+" от "+Формат(НоваяСтрока.ДатаДокумента,"ДФ=dd.MM.yyyy");
			КонецЕсли;
		КонецЦикла;
		ЧтениеXML.Закрыть();
		УдалитьФайлы(ИмяВременногоФайла);
		МетаданныеДляЖР = Метаданные.Обработки.ЗагрузкаВходящихДокументовПоОтчетамНКЦ;
		РаботаСФайлами.ПереместитьФайлВНовыйКаталог(ИмяФайла, КаталогОтчетов, КаталогАрхива, МетаданныеДляЖР);
	КонецЦикла;
	ЗаполнитьСуществующиеВходящиеДокументы();
	
КонецПроцедуры

Процедура СформироватьДокументы() Экспорт
	
	КлиринговаяОрганизация	= Константы.КлиринговаяОрганизация.Получить().Наименование;
	Исполнитель		= Константы.ПользовательРобот.Получить();
	КоличествоДок	= 0;
	Для Каждого ОбрабатываемыйОтчет Из ОтчетыНКЦ Цикл
		Если Не ОбрабатываемыйОтчет.ДокументВходящий.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		Входящий									= Документы.Входящий.СоздатьДокумент();
		Входящий.ИсходящийНомер						= ОбрабатываемыйОтчет.ИсходящийНомер;
		Входящий.Дата								= ОбрабатываемыйОтчет.ДатаДокумента;
		Входящий.ДатаОтправления					= ОбрабатываемыйОтчет.ДатаДокумента;
		Входящий.Комментарий						= ОбрабатываемыйОтчет.Комментарий;
		Входящий.Исполнитель						= Исполнитель;
		Входящий.ЛицоНаправившееДокумент			= КлиринговаяОрганизация;
		Входящий.НаименованиеДокументаИлиКомплекта	= ОбрабатываемыйОтчет.НаименованиеДокументаИлиКомплекта;
		Входящий.Записать(РежимЗаписиДокумента.Проведение);
		ОбрабатываемыйОтчет.ДокументВходящий = Входящий.Ссылка;
		КоличествоДок = КоличествоДок+1;
	КонецЦикла;
	
	Если КоличествоДок <> 0 Тогда 
		ТекстСообщения = "За дату "+Формат(ДатаЗагрузки,"ДФ=dd.MM.yyyy") +" по отчетам НКЦ загружено "+КоличествоДок+" входящих документа(ов)";
		ЗаписьЖурналаРегистрации(ЭтотОбъект.Метаданные().Синоним, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСуществующиеВходящиеДокументы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Входящий.Ссылка КАК ДокументВходящий,
	|	Входящий.ИсходящийНомер КАК ИсходящийНомер
	|ИЗ
	|	Документ.Входящий КАК Входящий
	|ГДЕ
	|	НЕ Входящий.ПометкаУдаления
	|	И Входящий.ИсходящийНомер В (&ИсходящиеНомера)
	|	И Входящий.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	Запрос.УстановитьПараметр("ИсходящиеНомера"	, ОтчетыНКЦ.ВыгрузитьКолонку("ИсходящийНомер"));
	Запрос.УстановитьПараметр("ДатаНачала"		, НачалоДня(ДатаЗагрузки));
	Запрос.УстановитьПараметр("ДатаОкончания"	, КонецДня(ДатаЗагрузки));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = ОтчетыНКЦ.Найти(Выборка.ИсходящийНомер, "ИсходящийНомер");
		Если Не СтрокаТЧ  = Неопределено Тогда
			СтрокаТЧ.ДокументВходящий = Выборка.ДокументВходящий;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТекущуюПапкуОтчетовНКЦ() Экспорт
	
	Параметры		= ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.ХранилищеОтчетовНКЦ);
	КаталогДанных	= Параметры.Папка;
	Возврат КаталогДанных;
	
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
