	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ЗаблокированныеЦБвВышестоящемДепозитарии.Записывать = Истина;
	Движения.ЗаблокированныеЦБвВышестоящемДепозитарии.Очистить();
	
	Если ВидОперации = Перечисления.ВидыОперацийЦБ.Блокирование Тогда
		ВидДвижения = ВидДвиженияНакопления.Приход;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийЦБ.Разблокирование Тогда
		ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЕсли;
	
	Движение = Движения.ЗаблокированныеЦБвВышестоящемДепозитарии.Добавить();
	Движение.ВидДвижения = ВидДвижения;
	Движение.Период = Дата;
	Движение.ЦеннаяБумага = ЦеннаяБумага;
	Движение.СчетДепо = СчетДепо;
	Движение.МестоХранения = МестоХранения;
	Движение.СчетДепоМХ = СчетДепоМХ;
	Движение.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
	Движение.БлокировочныйРазделСчетаДепоМХ = БлокировочныйРазделСчетаДепоМХ;
	Движение.Количество = Количество;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЭтоНовый() Тогда
		Изменил = ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры
