
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	Список.Параметры.УстановитьЗначениеПараметра("Период", НачалоДня(ТекущаяДата));
	Список.Параметры.УстановитьЗначениеПараметра("НачалоМесяца", НачалоМесяца(НачалоМесяца(ТекущаяДата) - 1));
	Список.Параметры.УстановитьЗначениеПараметра("КонецМесяца", КонецМесяца(ТекущаяДата));
	Список.Параметры.УстановитьЗначениеПараметра("CBonds", Справочники.ИнформационноАналитическиеСистемы.CBonds);
	Список.Параметры.УстановитьЗначениеПараметра("НРД", Справочники.ИнформационноАналитическиеСистемы.НРД);
	
КонецПроцедуры

#КонецОбласти
