////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Фиксация в справочнике ЦБ при Снятии или Приемке ЦБ на обслуживание
	Если ВидОперацииД = Справочники.ВидыОпераций.ПриемЦБНаОбслуживание Тогда
		Если ЗначениеЗаполнено(ЦБ.ДатаСнятияСОбслуживания) И (ЦБ.ДатаСнятияСОбслуживания < Дата) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Невозможно принять на обслуживание бумаги, которые были сняты с обслуживания ранее!", Отказ);
			Возврат;
		ИначеЕсли ЗначениеЗаполнено(ЦБ.ДатаПриемаНаОбслуживание) И (НЕ ЦБ.ДокументПриемаНаОбслуживание = Ссылка) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Невозможно принять бумаги на обслуживание повторно!", Отказ);
			Возврат;
		КонецЕсли;
		ЦБОбъект = ЦБ.ПолучитьОбъект();
		ЦБОбъект.ДатаПриемаНаОбслуживание = Дата;
		ЦБОбъект.ДокументПриемаНаОбслуживание = Ссылка;
		ЦБОбъект.Записать();
		
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.СнятиеЦБсОбслуживания Тогда
		Если ЗначениеЗаполнено(ЦБ.ДатаСнятияСОбслуживания) И (НЕ ЦБ.ДокументСнятияСОбслуживания = Ссылка) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Невозможно снять с обслуживания бумаги, которые уже были сняты с обслуживания!", Отказ);
			Возврат;
		КонецЕсли;
		ЦБОбъект = ЦБ.ПолучитьОбъект();
		ЦБОбъект.ДатаСнятияСОбслуживания = Дата;
		ЦБОбъект.ДокументСнятияСОбслуживания = Ссылка;
		ЦБОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперацииД <> Справочники.ВидыОпераций.ПриемЦБНаОбслуживание
		И ВидОперацииД <> Справочники.ВидыОпераций.СнятиеЦБсОбслуживания Тогда
		Сообщить("'Вид операции' должен быть 'Прием ЦБ на обслуживание' или 'Снятие ЦБ с обслуживания'", СтатусСообщения.Важное);
		Отказ = Истина;			
		Возврат;
	КонецЕсли;	
	
	Если Ссылка.Проведен Тогда
		ОчиститьСсылкиВСправочникеЦенныеБумаги(Ссылка.ВидОперацииД);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Основание) И ЗначениеЗаполнено(ДокументОснование) Тогда
		Основание = ДокументОснование;
	КонецЕсли;
	
	Если НЕ РучнойВвод Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
	// Установим автора или ответственного за изменения документа
	Если Не ЭтоНовый() Тогда
		Изменил	= ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Автор	= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание, СтандартнаяОбработка)
	
	Если Основание = Неопределено Тогда
		ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), , );
		Возврат;
	КонецЕсли;
	
	Если Основание.ВидОперацииД = Справочники.ВидыОпераций.ПриемЦБНаОбслуживание
		ИЛИ Основание.ВидОперацииД = Справочники.ВидыОпераций.СнятиеЦБсОбслуживания Тогда
			
		Дата = ?(ЗначениеЗаполнено(Основание.ДатаИсполненияПоручения), Основание.ДатаИсполненияПоручения, Основание.Дата);
		ДокументОснование			= Основание.Ссылка;	
		НомерВходящегоПоручения		= Основание.ВходящийНомерПоручения;
		ВидОперацииД				= Основание.ВидОперацииД;
		Комментарий					= Строка(Основание.Ссылка);
		Инициатор					= Основание.Инициатор;
		ЦБ							= Основание.ЦБ;
	Иначе
		ДокументОснование = Документы.Поручение.ПустаяСсылка();			
		Сообщить("На основании данного вида поручения нельзя создать документ 'Ценные бумаги (обслуживание)'.
				|'Вид операции' должен быть 'Прием ЦБ на обслуживание' или 'Снятие ЦБ с обслуживания'");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ОчиститьСсылкиВСправочникеЦенныеБумаги(Ссылка.ВидОперацииД);
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если Ссылка.Проведен Тогда
		ОчиститьСсылкиВСправочникеЦенныеБумаги(Ссылка.ВидОперацииД);
	КонецЕсли;	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура ОчиститьСсылкиВСправочникеЦенныеБумаги(ВидОперацииД)
	Если ВидОперацииД = Справочники.ВидыОпераций.ПриемЦБНаОбслуживание Тогда
		ЦБОбъект = ЦБ.ПолучитьОбъект();
		ЦБОбъект.ДатаПриемаНаОбслуживание = Дата(1, 1, 1);
		ЦБОбъект.ДокументПриемаНаОбслуживание = Неопределено;
		ЦБОбъект.Записать();
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.СнятиеЦБсОбслуживания Тогда
		ЦБОбъект = ЦБ.ПолучитьОбъект();
		ЦБОбъект.ДатаСнятияСОбслуживания = Дата(1, 1, 1);
		ЦБОбъект.ДокументСнятияСОбслуживания = Неопределено;
		ЦБОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

