
&НаКлиенте
Процедура ТипВекселяВексельПриИзменении(Элемент)
	УправлениеРеквизитамиФормыСервер();
КонецПроцедуры

&НаКлиенте
Процедура КатегорияЦБОткрытие(Элемент, СтандартнаяОбработка)
	Если Не Объект.Ссылка.Пустая() Тогда
		СтандартнаяОбработка = Ложь;
		МенеджерКатегорияЦБ = ПолучитьФорму("РегистрСведений.КатегорияЦБ.Форма.ФормаСписка",, ЭтаФорма);
		МенеджерКатегорияЦБ.Отбор.ЦеннаяБумага.Установить(Объект.Ссылка);
		МенеджерКатегорияЦБ.Отбор.ЦеннаяБумага.ВидСравнения		= ВидСравнения.Равно;
		МенеджерКатегорияЦБ.Отбор.ЦеннаяБумага.Использование	= Истина;
		Если МенеджерКатегорияЦБ.Открыта() Тогда
			МенеджерКатегорияЦБ.Активизировать();
		Иначе
			МенеджерКатегорияЦБ.Открыть();
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("'Ценная бумага' не записана - отображение списка категорий не возможно!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДатаАнкетыПриИзмененииСервер()
	Если Не Объект.Ссылка.Пустая() Тогда
		Попытка
			КатегорияЦБ = РегистрыСведений.КатегорияЦБ.СрезПоследних(ДатаАнкеты, Новый Структура("ЦеннаяБумага",Объект.Ссылка))[0].Категория;
		Исключение
			КатегорияЦБ = Справочники.КатегорииЦБ.ПустаяСсылка();
		КонецПопытки;
		Попытка
			ДанныеНоминалаЦБ= РегистрыСведений.НоминалЦБ.СрезПоследних(ДатаАнкеты, Новый Структура("ЦеннаяБумага",Объект.Ссылка));
			ЦБНоминал		= ДанныеНоминалаЦБ[0].Сумма;
		Исключение
			ЦБНоминал		= 0;
		КонецПопытки;
	Иначе
		КатегорияЦБ = Справочники.КатегорииЦБ.ПустаяСсылка();
		ЦБНоминал	= 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаАнкетыПриИзменении(Элемент)
	ДатаАнкетыПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ВидЦБПриИзменении(Элемент)
	УправлениеРеквизитамиФормыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ВидЦБОчистка(Элемент, СтандартнаяОбработка)
	УправлениеРеквизитамиФормыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ТипЦБПриИзменении(Элемент)
	УправлениеРеквизитамиФормыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ТипЦБОчистка(Элемент, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.ВидЦБ)= Тип("ПеречислениеСсылка.ВидыОблигаций") Тогда
		Объект.ПодвидОблигаций	= ПредопределенноеЗначение("Перечисление.ПодвидыОблигаций.ПустаяСсылка");
	КонецЕсли;
	Объект.ВидЦБ = Неопределено;
	Объект.КупоннаяОблигация = Ложь;
	УправлениеРеквизитамиФормыСервер();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеРеквизитамиФормыСервер()
	
	// Установим заголовок по умолчанию для поля "Эмитент"
	ЗаголовокЭмитента	= "Эмитент";
	// Видимость закладки "Купоны"
	ВидимостьКупонов	= Ложь;
	// Определим страницу по ЦБ
	Если Объект.ТипЦБ = Перечисления.ТипыЦБ.Акция Тогда
		Элементы.ГруппаСтраницПоЦБ.ТекущаяСтраница	= Элементы.ГруппаАкции;
	ИначеЕсли Объект.ТипЦБ = Перечисления.ТипыЦБ.Облигация Тогда
		Элементы.ГруппаСтраницПоЦБ.ТекущаяСтраница	= Элементы.ГруппаОблигации;
		Если Объект.КупоннаяОблигация Тогда
			ВидимостьКупонов	= Истина;
		Иначе
			ВидимостьКупонов	= Ложь;
		КонецЕсли;		
	ИначеЕсли Объект.ТипЦБ = Перечисления.ТипыЦБ.Вексель Тогда
		ЗаголовокЭмитента	= "Трассат:";
		Элементы.ГруппаСтраницПоЦБ.ТекущаяСтраница	= Элементы.ГруппаВекселя;
	ИначеЕсли Объект.ТипЦБ = Перечисления.ТипыЦБ.Пай Тогда
		ЗаголовокЭмитента	= "ПИФ:";
		Элементы.ГруппаСтраницПоЦБ.ТекущаяСтраница	= Элементы.ГруппаПаи;
	Иначе
		Элементы.ГруппаСтраницПоЦБ.ТекущаяСтраница	= Элементы.ГруппаАкции;
	КонецЕсли;
	// Установим заголовок поля "Эмитент"
	Элементы.Эмитент.Заголовок	= ЗаголовокЭмитента;
	// Установим видимость некоторых элементов для "Депозитарной расписки"
	Элементы.ГруппаБазовыйАктивКоличествоАкции.Видимость= (Объект.ТипЦБ = Перечисления.ТипыЦБ.ДепозитарнаяРасписка);
	// Обработка "Вида ЦБ"
	Элементы.ПодвидОблигаций.Видимость					= (Объект.ВидЦБ = Перечисления.ВидыОблигаций.Государственная);
	Если НЕ Элементы.ПодвидОблигаций.Видимость Тогда
		Объект.ПодвидОблигаций = Перечисления.ПодвидыОблигаций.ПустаяСсылка();
	КонецЕсли;
	Элементы.ПроцентДисконтВексель.Видимость			= (Объект.ВидЦБ = Перечисления.ВидыВекселей.Процентный);
	Элементы.ДекорацияПроцентДисконтВексель.Видимость	= (Объект.ВидЦБ = Перечисления.ВидыВекселей.Процентный);
	// Обработка изменения "Типа векселя"
	Элементы.УдостоверениеПравообладанияВексель.Доступность = (Объект.ТипВекселя <> Перечисления.ТипыВекселей.Простой);
	// Установим видимость панели купонов
	Элементы.ГруппаКупоны.Видимость						= ВидимостьКупонов;
	Элементы.ГруппаДанныеПоКупонуОблигации.Видимость	= ВидимостьКупонов;
	
	УстановитьВидТипаЦБ();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидТипаЦБ()
	
	Если Объект.ТипЦБ = Перечисления.ТипыЦБ.Акция
		ИЛИ Объект.ТипЦБ = Перечисления.ТипыЦБ.КлиринговыйСертификатУчастия Тогда
		НовыйВидЦБ = Перечисления.ВидыАкций.ПустаяСсылка();
	ИначеЕсли Объект.ТипЦБ = Перечисления.ТипыЦБ.Облигация Тогда
		НовыйВидЦБ = Перечисления.ВидыОблигаций.ПустаяСсылка();
	ИначеЕсли Объект.ТипЦБ = Перечисления.ТипыЦБ.Вексель Тогда
		НовыйВидЦБ = Перечисления.ВидыВекселей.ПустаяСсылка();
	ИначеЕсли Объект.ТипЦБ = Перечисления.ТипыЦБ.Пай Тогда
		НовыйВидЦБ = Перечисления.ВидыПаев.ПустаяСсылка();
	ИначеЕсли Объект.ТипЦБ = Перечисления.ТипыЦБ.ДепозитарнаяРасписка Тогда
		НовыйВидЦБ = Перечисления.ВидыДепозитарныхРасписок.ПустаяСсылка();
	Иначе
		НовыйВидЦБ = Неопределено;
	КонецЕсли;
	
	Элементы.ВидЦБАкции.ВыбиратьТип = НовыйВидЦБ = Неопределено;
	
	Если ТипЗнч(Объект.ВидЦБ) <> ТипЗнч(НовыйВидЦБ) Тогда
		Объект.ВидЦБ = НовыйВидЦБ;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНеобходимыеОтборыСервер()
	Если Объект.Ссылка.Пустая() Тогда                                        
		СсылкаОтбора	= Справочники.ЦенныеБумаги.ПолучитьСсылку(Новый УникальныйИдентификатор);
	Иначе
		СсылкаОтбора	= Объект.Ссылка;
	КонецЕсли;	
	// {{ Коды загрузки
	ЭлементыОтбора	= ТабличноеПолеКодыЗагрузки.Отбор.Элементы;
	// Очистим старые отборы
	ЭлементыОтбора.Очистить();
	// Новый отбор
	НовыйОтбор	= ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	НовыйОтбор.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Владелец");
	НовыйОтбор.Использование	= Истина;
	НовыйОтбор.ПравоеЗначение	= СсылкаОтбора;
	НовыйОтбор.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	// {{ Котировки
	ЭлементыОтбора	= ТабличноеПолеКотировки.Отбор.Элементы;
	// Очистим старые отборы
	ЭлементыОтбора.Очистить();
	// Новый отбор
	НовыйОтбор	= ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	НовыйОтбор.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ЦеннаяБумага");
	НовыйОтбор.Использование	= Истина;
	НовыйОтбор.ПравоеЗначение	= СсылкаОтбора;
	НовыйОтбор.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Если Не КотировкиБиржа.Пустая() Тогда
		НовыйОтбор	= ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		НовыйОтбор.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Биржа");
		НовыйОтбор.Использование	= Истина;
		НовыйОтбор.ПравоеЗначение	= КотировкиБиржа;
		//НовыйОтбор.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	Если Не КотировкиРежимТоргов.Пустая() Тогда
		НовыйОтбор	= ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		НовыйОтбор.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("РежимТоргов");
		НовыйОтбор.Использование	= Истина;
		НовыйОтбор.ПравоеЗначение	= КотировкиРежимТоргов;
		//НовыйОтбор.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаАнкеты = ТекущаяДата();
	
	ДатаАнкетыПриИзмененииСервер();
	УправлениеРеквизитамиФормыСервер();
	
	УстановитьНеобходимыеОтборыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ДатаАнкетыПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура УдостоверениеПравообладанияВексельПриИзменении(Элемент)
	Объект.ИменнаяНаПредьявителя = (Объект.УдостоверениеПравообладания = ПредопределенноеЗначение("Перечисление.ФормаУдостоверенияПравообладания.Именные"));
КонецПроцедуры

&НаКлиенте
Процедура АнкетаВыпускаЦБ(Команда)
	//---
	Если Объект.Ссылка.Пустая() Тогда
		Если Вопрос("Формирование анкеты возможно только для записанной ЦБ!
					|Записать?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//---
	Форма	= ПолучитьФорму("Отчет.АнкетаВыпускаЦБ.Форма.ФормаОтчета");
	//---
	Форма.Отчет.ВыводитьПечать		= Истина;
	Форма.Отчет.ОтчетПоСписку		= Истина;
	Форма.Отчет.Автоформирование	= Истина;
	Форма.Отчет.ЦенныеБумаги.Добавить(Объект.Ссылка);
	//---
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ФормаВыпускаПриИзменении(Элемент)
	Объект.ДокументарнаяБездокументарная = (Объект.ФормаВыпуска = ПредопределенноеЗначение("Перечисление.ФормаВыпускаЦБ.Документарная"));
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеКодыЗагрузкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Объект.Ссылка.Пустая() Тогда
	    ОбщегоНазначения.СообщитьОбОшибке("Перед вводом кодов загрузки необходимо записать элемент!", Отказ);	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура КупоннаяОблигацияОблигацииПриИзменении(Элемент)
	УправлениеРеквизитамиФормыСервер();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатаАнкетыПриИзмененииСервер();
	УправлениеРеквизитамиФормыСервер();
	
	УстановитьНеобходимыеОтборыСервер();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	КатегорияЦБРегистр = РегистрыСведений.КатегорияЦБ.СрезПоследних(ДатаАнкеты, Новый Структура("ЦеннаяБумага", Объект.Ссылка));
	Если КатегорияЦБРегистр.Количество() = 1 Тогда
		Если КатегорияЦБРегистр[0].Категория <> КатегорияЦБ Тогда
			МенеджерКатегорияЦБ = РегистрыСведений.КатегорияЦБ.СоздатьМенеджерЗаписи();
			МенеджерКатегорияЦБ.Период			= ДатаАнкеты;
			МенеджерКатегорияЦБ.ЦеннаяБумага	= Объект.Ссылка;
			МенеджерКатегорияЦБ.Категория		= КатегорияЦБ;
			МенеджерКатегорияЦБ.Записать();
		КонецЕсли;
	Иначе
		МенеджерКатегорияЦБ = РегистрыСведений.КатегорияЦБ.СоздатьМенеджерЗаписи();
		МенеджерКатегорияЦБ.Период			= ДатаАнкеты;
		МенеджерКатегорияЦБ.ЦеннаяБумага	= Объект.Ссылка;
		МенеджерКатегорияЦБ.Категория		= КатегорияЦБ;
		МенеджерКатегорияЦБ.Записать();
	КонецЕсли;
	
	НоминалЦБРегистр = РегистрыСведений.НоминалЦБ.СрезПоследних(ДатаАнкеты, Новый Структура("ЦеннаяБумага", Объект.Ссылка));
	Если НоминалЦБРегистр.Количество() = 1 Тогда
		Если НоминалЦБРегистр[0].Сумма <> ЦБНоминал Тогда
			НоминалЦБРегистр = РегистрыСведений.НоминалЦБ.СоздатьМенеджерЗаписи();
			НоминалЦБРегистр.Период			= ДатаАнкеты;
			НоминалЦБРегистр.ЦеннаяБумага	= Объект.Ссылка;
			НоминалЦБРегистр.Сумма			= ЦБНоминал;
			НоминалЦБРегистр.Записать();
		КонецЕсли;
	иначе
		НоминалЦБРегистр = РегистрыСведений.НоминалЦБ.СоздатьМенеджерЗаписи();
		НоминалЦБРегистр.Период			= ДатаАнкеты;
		НоминалЦБРегистр.ЦеннаяБумага	= Объект.Ссылка;
		НоминалЦБРегистр.Сумма			= ЦБНоминал;
		НоминалЦБРегистр.Записать();
	КонецЕсли;
	
	ДатаАнкетыПриИзмененииСервер();
	УправлениеРеквизитамиФормыСервер();
	УстановитьНеобходимыеОтборыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеКодыЗагрузкиОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)

	РеквизитыКода = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(НовыйОбъект, "ДатаОкончанияДействия,Код");
	Если Не ЗначениеЗаполнено(РеквизитыКода.ДатаОкончанияДействия)
			ИЛИ КонецДня(РеквизитыКода.ДатаОкончанияДействия) >= КонецДня(ТекущаяДата()) Тогда
		Если ЗначениеЗаполнено(Объект.ISIN) И ЗначениеЗаполнено(Объект.ТипЦБ) Тогда
			ПоискДублейЦБ(СокрЛП(РеквизитыКода.Код));
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю("Данные для проверки по ISIN и Типу ЦБ не верны!");
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоискДублейЦБ(КодММВБ)
	
	ОбъектПроверки	= Объект.Ссылка;
	
	Запрос	= Новый Запрос;
	
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка	КАК ЦБ
	|	,ТаблицаКодов.КодММВБ
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	(
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Владелец,
	|		МАКСИМУМ(ВЫБОР КОГДА Биржа = ЗНАЧЕНИЕ(Справочник.Биржи.MICEX) ТОГДА Код КОНЕЦ) КАК КодММВБ
	|	ИЗ
	|		Справочник.КодыЗагрузки
	|	ГДЕ
	|		ПометкаУдаления = ЛОЖЬ	
	|	И
	|		(ДатаОкончанияДействия = ДАТАВРЕМЯ(1,1,1) ИЛИ ДатаОкончанияДействия >= КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ))
	|	СГРУППИРОВАТЬ ПО
	|		Владелец
	|	ИМЕЮЩИЕ
	|		МАКСИМУМ(ВЫБОР КОГДА Биржа = ЗНАЧЕНИЕ(Справочник.Биржи.MICEX) ТОГДА Код КОНЕЦ) = &КодММВБ
	|	) КАК ТаблицаКодов
	|ПО
	|	(ТаблицаКодов.Владелец = ЦенныеБумаги.Ссылка)
	|ГДЕ
	|	ЦенныеБумаги.ISIN	= &ISIN
	|И
	|	ЦенныеБумаги.ТипЦБ	= &ТипЦБ
	|"+?(ОбъектПроверки = Неопределено	, "", "И ЦенныеБумаги.Ссылка <> &ТекущаяЦБ")+"
	|"+?(КодММВБ = Неопределено			, "", "И ТаблицаКодов.КодММВБ IS NOT NULL");
	
	Запрос.УстановитьПараметр("ISIN"		, Объект.ISIN);
	Запрос.УстановитьПараметр("ТипЦБ"		, Объект.ТипЦБ);
	Запрос.УстановитьПараметр("ТекущаяЦБ"	, ОбъектПроверки);
	Запрос.УстановитьПараметр("КодММВБ"		, КодММВБ);
	Запрос.УстановитьПараметр("ТекущаяДата"	, ТекущаяДата());
	
	Результат	= Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка	= Результат.Выбрать();
		ТекстСообщения	= "Найдены подобные элементы ЦБ:";
		
		Пока Выборка.Следующий() Цикл
			ТекстСообщения	= ТекстСообщения + "
			| - "+Выборка.ЦБ+" - Код 1С: "+СокрЛП(Выборка.ЦБ.Код)+" - ISIN: "+СокрЛП(Выборка.ЦБ.ISIN)+" - Тип: "+Выборка.ЦБ.ТипЦБ+?(КодММВБ = Неопределено, "", " - Код ММВБ: "+КодММВБ);
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КотировкиБиржаПриИзменении(Элемент)
	УстановитьНеобходимыеОтборыСервер();
КонецПроцедуры

&НаКлиенте
Процедура КотировкиРежимТорговПриИзменении(Элемент)
	УстановитьНеобходимыеОтборыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ЦБНоминалОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	Если Не Объект.Ссылка.Пустая() Тогда
		МенеджерНоминалЦБ = ПолучитьФорму("РегистрСведений.НоминалЦБ.Форма.ФормаСписка", , ЭтаФорма);
		ОтборНоминаловЭлементы	= МенеджерНоминалЦБ.Список.Отбор.Элементы;
		ОтборНоминаловЭлементы.Очистить();
		
		НовыйОтбор	= ОтборНоминаловЭлементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		НовыйОтбор.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ЦеннаяБумага");
		НовыйОтбор.Использование	= Истина;
		НовыйОтбор.ПравоеЗначение	= Объект.Ссылка;
		НовыйОтбор.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
		Если МенеджерНоминалЦБ.Открыта() Тогда
			МенеджерНоминалЦБ.Активизировать();
		Иначе
			МенеджерНоминалЦБ.Открыть();
		КонецЕсли;
	Иначе
		Сообщить("Перед открытием списка номиналов необходимо записать 'Ценную бумагу'!!!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НоминалЦБ(Дата, ЦеннаяБумага)
	Возврат РегистрыСведений.НоминалЦБ.ПолучитьПоследнее(Дата, Новый Структура("ЦеннаяБумага", ЦеннаяБумага)).Сумма;
КонецФункции

&НаКлиенте
Процедура КупоныДатаПогашенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ДатаПогашения) Тогда
		Если ВыбранноеЗначение > Объект.ДатаПогашения Тогда
			Предупреждение("Дата погашения купона больше даты погашения ЦБ!"); 
			СтандартнаяОбработка = Ложь;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КупоныДатаПогашенияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ДатаПогашения) И ЗначениеЗаполнено(СтрЗаменить(Текст, ".", "")) Тогда
		Выбраннаядата	= Дата(Прав(Текст,4), Сред(Текст, 4, 2), Лев(Текст, 2));
		Если Выбраннаядата > Объект.ДатаПогашения Тогда
			Предупреждение("Дата погашения купона больше даты погашения ЦБ!"); 
			СтандартнаяОбработка = Ложь;
		КонецЕсли; 
	Иначе
		Предупреждение("Не заполнена дата погашения ЦБ или купона!");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Пересчитать(Основание, Данные)
	Если Не Объект.Ссылка.Пустая() Тогда
		Если Данные.СрокОбращения > 0 Тогда
			ЦБНоминалЦБ = НоминалЦБ(Данные.ДатаВыпуска, Объект.Ссылка);
			Если ЦБНоминалЦБ <> 0 Тогда
				Если Основание = "Купон" Тогда
					Данные.Сумма = ОКР(Данные.Купон/Данные.СрокОбращения * ((Данные.ДатаПогашения - Данные.ДатаВыпуска)/86400)* ЦБНоминалЦБ/100,2,1);                     
				ИначеЕсли Основание = "Сумма" Тогда
					Данные.Купон = ОКР(Данные.Сумма * Данные.СрокОбращения * 100 / (((Данные.ДатаПогашения - Данные.ДатаВыпуска)/86400)* ЦБНоминалЦБ),4,1);
				ИначеЕсли Основание = "ДатаПогашения" ИЛИ Основание = "ДатаВыпуска" Тогда
					Данные.Сумма = ОКР(Данные.Купон/Данные.СрокОбращения *  ((Данные.ДатаПогашения - Данные.ДатаВыпуска)/86400)* ЦБНоминалЦБ/100,2,1);
				КонецЕсли;
			Иначе
				Предупреждение("Пересчет не выполнен, введите значение в регистр ""Номинал ЦБ""",60);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Предупреждение("Пересчет не выполнен, запишите ЦБ и введите значение в регистр ""Номинал ЦБ""",60);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КупоныСуммаПриИзменении(Элемент)
	ТекущиеДанные	= Элемент.Родитель.Текущиеданные;
	Пересчитать("Сумма", ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура КупоныПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.СрокОбращения = 365;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КупоныПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверкаДаты	= Элемент.ТекущиеДанные.ДатаПогашения;
	Для каждого СтрокаКупонов Из Объект.Купоны Цикл
		Если СтрокаКупонов.ДатаПогашения = ПроверкаДаты И СтрокаКупонов.НомерСтроки <> Элемент.ТекущиеДанные.НомерСтроки Тогда
			Оболочки.ВыводСообщения("Дата погашения купона в текущей строке совпадает с датой в строке № " + СтрокаКупонов.НомерСтроки+"! Строка не записана!",СтатусСообщения.ОченьВажное);
			ОтменаРедактирования = Истина;
			Объект.Купоны.Удалить(СтрокаКупонов.НомерСтроки-1);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Если ПроверкаДаты > Объект.ДатаПогашения Тогда
		Оболочки.ВыводСообщения("Дата погашения купона больше даты погашения для ЦБ "+Объект.Код+"! Строка не записана!", СтатусСообщения.ОченьВажное);
		ОтменаРедактирования	= Истина;
		Объект.Купоны.Удалить(Элемент.ТекущиеДанные.НомерСтроки-1);
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнтерфаксОтчетОЦеннойБумагеНаСервере(ISIN)
	Возврат Справочники.ЦенныеБумаги.ИнтерфаксОтчетОЦеннойБумаге(ISIN);
КонецФункции

&НаКлиенте
Процедура ПоказатьДанныеRuData(Команда)
	
	ISIN = СокрЛП(Объект.ISIN);
	Если Не ЗначениеЗаполнено(ISIN) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан ISIN", , "Объект.ISIN");
		Возврат;
	КонецЕсли;
	ТабличныйДокумент = ИнтерфаксОтчетОЦеннойБумагеНаСервере(ISIN);
	Если ТабличныйДокумент = Неопределено Тогда
		ПредупреждениеАсинх("Нет актуальных данных или произошла ошибка.", 10);
	Иначе
		ИнтерфаксИмяОтчета = "Отчет о ценной бумаге с ISIN " + ISIN + " из RuData";
		ТабличныйДокумент.Показать(ИнтерфаксИмяОтчета, ИнтерфаксИмяОтчета);
	КонецЕсли;
	
КонецПроцедуры
