
// Возвращает учетную запись робота рассылки из внешних источников для текущей информационной базы.
// Если такая учетная запись не найдена, возвращается пустая ссылка.
// 
// Возвращаемое значение:
//  СправочникСсылка.УчетныеЗаписиЭлектроннойПочты 
//
Функция УчетнаяЗаписьРоботаРассылки() Экспорт
	НастройкиОтправки = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(
		ПланыВидовХарактеристик.ВнешниеИсточники.РоботРассылки).Настройка;	
	
	Если ТипЗнч(НастройкиОтправки) = Тип("СправочникСсылка.НастройкиОбменаДанными") Тогда
		Возврат НастройкиОтправки.УчетнаяЗаписьПриемаОтправкиСообщений;
	Иначе
		Возврат Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка();
	КонецЕсли;
КонецФункции
