
// Возвращает строку с описанием документа физ.лица.
// Серия документа и номер подразделения не обязательны.
Функция ДокументУдостоверяющийЛичность(Паспорт) Экспорт
	Возврат
		?(Паспорт.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ИМНС21, "Паспорт РФ", СокрЛП(Паспорт.ДокументВид))
		+ ?(ЗначениеЗаполнено(Паспорт.ДокументСерия), " серия " + Паспорт.ДокументСерия, "")
		+ " № " + Паспорт.ДокументНомер
		+ ", выдан " + Формат(Паспорт.ДокументДатаВыдачи,"ДФ='дд ММММ гггг';ДП='...'") + " г. " 
		+ Паспорт.ДокументКемВыдан
		+ ?(ЗначениеЗаполнено(Паспорт.ДокументКодПодразделения), ", № подр. " + Паспорт.ДокументКодПодразделения, "");
КонецФункции
