#Область ПрограммныйИнтерфейс

// Возвращает список статусов поручений Панда
// 
// Возвращаемое значение:
//  Соответствие - число и соответствующий статус
//
Функция СписокСтатусовПорученийДляПанда() Экспорт
	СписокСтатусов = Новый Соответствие;
	СписокСтатусов.Вставить(7, "Снято");
	СписокСтатусов.Вставить(8, "Исполнено");
	СписокСтатусов.Вставить(12, "Обрабатывается");
	Возврат СписокСтатусов;
КонецФункции

// Возвращает числовое значение статуса в Панда по наименованию
//
// Параметры:
//  НаименованиеСтатуса	 - Строка
// 
// Возвращаемое значение:
//  Число - числовое значение статуса в Панда
Функция СтатусПоНаименованию(НаименованиеСтатуса) Экспорт
	СписокСтатусовПоручений = СписокСтатусовПорученийДляПанда();
	Для Каждого СтатусПоручений Из СписокСтатусовПоручений Цикл
		Если СтатусПоручений.Значение = НаименованиеСтатуса Тогда
			Возврат СтатусПоручений.Ключ;
		КонецЕсли;
	КонецЦикла;
КонецФункции

// Возвращает таблицу значений с данными о неторговых поручениях из Панда. Для этого ищет необработанные
// записи в регистре ЖурналИсходящихСообщенийKafka, содержащие данные о неторговых поручениях из Панда,
// распарсивает их и отбирает поручения в соответствии с указанными в параметрах функции критериями.
// Параметры:
// 	НачалоПериода - Дата
// 	КонецПериода - Дата
// 	Контрагент - СправочникСсылка.Контрагенты
// Возвращаемое значение:
//	ТаблицаЗначений
Функция ДанныеНеторговыхПоручений(НачалоПериода, КонецПериода, Контрагент) Экспорт
	ДанныеПоручений = ТаблицаДанныхНеторговыхПоручений();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЖурналВходящихСообщенийKafka.ВнешнийИсточник КАК ВнешнийИсточник,
	|	ЖурналВходящихСообщенийKafka.Ключ КАК Ключ,
	|	ЖурналВходящихСообщенийKafka.Идентификатор КАК Идентификатор,
	|	ЖурналВходящихСообщенийKafka.Сообщение КАК Сообщение,
	|	ЖурналВходящихСообщенийKafka.ОшибкаОбработки КАК ОшибкаОбработки,
	|	ЖурналВходящихСообщенийKafka.ОписаниеОшибки КАК ОписаниеОшибки,
	|	ЖурналВходящихСообщенийKafka.ПериодСообщения КАК ПериодСообщения,
	|	ЖурналВходящихСообщенийKafka.ПериодОбработкиСообщения КАК ПериодОбработкиСообщения
	|ИЗ
	|	РегистрСведений.ЖурналВходящихСообщенийKafka КАК ЖурналВходящихСообщенийKafka
	|ГДЕ
	|	ЖурналВходящихСообщенийKafka.ВнешнийИсточник = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВнешниеИсточники.KafkaPandaConsNti1634)
	|	И ЖурналВходящихСообщенийKafka.Ключ = ""NTConsInstrData""
	|	И НЕ ЖурналВходящихСообщенийKafka.Обработан
	|	И НЕ ЖурналВходящихСообщенийKafka.ОшибкаОбработки";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		CrmContractNumber = Справочники.Контрагенты.CrmContractNumberПоКлиенту(Контрагент);
		Если ЗначениеЗаполнено(Контрагент) И Не ЗначениеЗаполнено(CrmContractNumber) Тогда
			ТекстСообщения = "Для депонента " + Строка(Контрагент)
								+ " не удалось определить номер договора в CRM Панда (CrmContractNumber) - отбор по депоненту невозможен";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбработатьОдноВходящееСообщениеОНеторговомПоручении(Выборка, ДанныеПоручений, CrmContractNumber);
		КонецЦикла;
	КонецЕсли;
	Возврат ДанныеПоручений;
КонецФункции

// Создает запись в регистре ЖурналИсходящихСообщенийKafka содержащую запрос к Диасофт
// на получение данных для отчетности
// Параметры:
//	Поручение - ДокументСсылка.Поручение
//	Статус - Число
Процедура СоздатьСообщениеОбИзмененииСтатусаПорученияВПанда(Поручение, Статус) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Поручение.ИдентификаторЗагрузки КАК ConsolidatedNumber,
	|	Поручение.KafkaMessageId КАК KafkaMessageId,
	|	ПоручениеЦенныеБумагиСписываемые.ИдентификаторЗагрузки КАК Id
	|ИЗ
	|	Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦенныеБумагиСписываемые
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручение
	|		ПО ПоручениеЦенныеБумагиСписываемые.Ссылка = Поручение.Ссылка
	|ГДЕ
	|	ПоручениеЦенныеБумагиСписываемые.Ссылка = &Поручение";
	Запрос.УстановитьПараметр("Поручение", Поручение);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Ошибка = "Отсутствуют данные для отправки в CRM Панда статуса по поручению " + Строка(Поручение);
		ОбщегоНазначенияклиентСервер.СообщитьПользователю(Ошибка);
		Возврат;
	КонецЕсли;
	
	ТЗРезультат = РезультатЗапроса.Выгрузить();
	МассивId = ТЗРезультат.ВыгрузитьКолонку("Id");
	ПерваяСтрокаРезультата = ТЗРезультат[0];
	ConsolidatedNumber = ПерваяСтрокаРезультата.ConsolidatedNumber;
	УИДИсходногоСообщения = ПерваяСтрокаРезультата.KafkaMessageId;
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaDepoToPandaNotification1642;
	УИДСообщения = Строка(Новый УникальныйИдентификатор());
	Ключ = "DepoConsNti";
	ТекстJSON = СформироватьТекстИзвещенияJSON(УИДСообщения, УИДИсходногоСообщения, ConsolidatedNumber, МассивId, Статус);
	Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Ключ, ТекстJSON, УИДСообщения);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ТаблицаДанныхНеторговыхПоручений()
	ДанныеПоручений = Новый ТаблицаЗначений;
	
	Строка = "Строка";
	ТипСтрока1000	= Новый ОписаниеТипов(Строка, , Новый КвалификаторыСтроки(1000));
	ТипСтрока36		= Новый ОписаниеТипов(Строка, , Новый КвалификаторыСтроки(36));
	ТипСтрока20		= Новый ОписаниеТипов(Строка, , Новый КвалификаторыСтроки(20));
	ТипДатаВремя	= Новый ОписаниеТипов("Дата", , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	ТипЧисло2_0		= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0));
	ТипЧисло20_7	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(20, 7));
	
	Колонки = ДанныеПоручений.Колонки;
	Колонки.Добавить("Id",								ТипСтрока20);
	Колонки.Добавить("KafkaMessageId",					ТипСтрока36);
	Колонки.Добавить("DepoMessageId",					ТипСтрока36);
	Колонки.Добавить("Created",							ТипДатаВремя);
	Колонки.Добавить("Operation",						ТипСтрока20);
	Колонки.Добавить("OperationText",					ТипСтрока1000);
	Колонки.Добавить("ConsolidatedNumber",				ТипСтрока1000);
	Колонки.Добавить("DealReference",					ТипСтрока1000);
	Колонки.Добавить("PayDate",							ТипДатаВремя);
	Колонки.Добавить("DealDate",						ТипДатаВремя);
	Колонки.Добавить("DocComment",						ТипСтрока1000);
	Колонки.Добавить("DeponentCode",					ТипСтрока1000);
	Колонки.Добавить("DeponentName",					ТипСтрока1000);
	Колонки.Добавить("DeponentSubAccount",				ТипСтрока1000);
	Колонки.Добавить("DeponentDepoAccount",				ТипСтрока1000);
	Колонки.Добавить("DeponentDepoAccountSection",		ТипСтрока1000);
	Колонки.Добавить("CounterpartyName",				ТипСтрока1000);
	Колонки.Добавить("CounterpartyIdentifier",			ТипСтрока1000);
	Колонки.Добавить("CounterpartyDepoAccount",			ТипСтрока1000);
	Колонки.Добавить("CounterpartyDepoAccountSection",	ТипСтрока1000);
	Колонки.Добавить("CounterpartyClientName",			ТипСтрока1000);
	Колонки.Добавить("CounterpartyClientDepoAccount",	ТипСтрока1000);
	Колонки.Добавить("Place",							ТипЧисло2_0);
	Колонки.Добавить("PlaceText",						ТипСтрока1000);
	Колонки.Добавить("SecCode",							ТипСтрока1000);
	Колонки.Добавить("ISIN",							ТипСтрока1000);
	Колонки.Добавить("SecRegNumber",					ТипСтрока1000);
	Колонки.Добавить("Quantity",						ТипЧисло20_7);
	
	Возврат ДанныеПоручений;
КонецФункции

Процедура ОбработатьОдноВходящееСообщениеОНеторговомПоручении(Выборка, ДанныеПоручений, CrmContractNumber)
	ОписаниеОшибки = "";
	
	СтруктураИзJSON = РаботаСJSON.РезультатЧтенияJSON(Выборка.Сообщение);
	
	Если ОбязательныеПоляВНаличии(СтруктураИзJSON, ОписаниеОшибки) Тогда
		Data = СтруктураИзJSON.Data;
		Если ЗначениеЗаполнено(CrmContractNumber) И Data.DeponentCode <> CrmContractNumber Тогда
			Возврат;
		КонецЕсли;
		KafkaMessageId = СтруктураИзJSON.MessageInfo.MessageId;
		Created = ПрочитатьДатуJSON(Data.Created, ФорматДатыJSON.ISO);
		PayDate = ПрочитатьДатуJSON(Data.PayDate, ФорматДатыJSON.ISO);
		DealDate = ПрочитатьДатуJSON(Data.DealDate, ФорматДатыJSON.ISO);
		Для каждого Instruction Из СтруктураИзJSON.Data.Instructions Цикл
			НовСтрокаДанных = ДанныеПоручений.Добавить();
			НовСтрокаДанных.DepoMessageId = Выборка.Идентификатор;
			НовСтрокаДанных.KafkaMessageId = KafkaMessageId;
			ЗаполнитьЗначенияСвойств(НовСтрокаДанных, Data, , "Created,PayDate,DealDate");
			НовСтрокаДанных.Created = Created;
			НовСтрокаДанных.PayDate = PayDate;
			НовСтрокаДанных.DealDate = DealDate;
			ЗаполнитьЗначенияСвойств(НовСтрокаДанных, Instruction);
		КонецЦикла;
	Иначе
		Запись = РегистрыСведений.ЖурналВходящихСообщенийKafka.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка, "ВнешнийИсточник,Идентификатор");
		Запись.Прочитать();
		Запись.ОписаниеОшибки = ОписаниеОшибки;
		Запись.Обработан = Ложь;
		Запись.ОшибкаОбработки = Не ПустаяСтрока(ОписаниеОшибки);
		Запись.Записать();
		ИмяСобытия = "Загрузка неторговых поручений из CRM Панда";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		Текст = ИмяСобытия + " - ошибка в записи с идентификатором " + Выборка.Идентификатор
				+ " в журнале входящих сообщений Kafka: " + ОписаниеОшибки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	КонецЕсли;
КонецПроцедуры

Функция ОбязательныеПоляВНаличии(СтруктураИзJSON, ОписаниеОшибки)
	ПроверятьЗаполненность = Ложь;
	СписокПолейСтрокой = "MessageInfo,Data";
	РаботаСJSON.ПроверитьОбязательныеПоля(СтруктураИзJSON, СписокПолейСтрокой, ОписаниеОшибки, ПроверятьЗаполненность);
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПроверятьЗаполненность = Истина;
	СписокПолейСтрокой = "MessageId";
	РаботаСJSON.ПроверитьОбязательныеПоля(СтруктураИзJSON.MessageInfo, СписокПолейСтрокой, ОписаниеОшибки, ПроверятьЗаполненность);
	СписокПолейСтрокой = "ConsolidatedNumber,Instructions,Operation,DeponentCode,DeponentName,DeponentDepoAccount,CounterpartyDepoAccount"
						+ ",CounterpartyName,Created";
	РаботаСJSON.ПроверитьОбязательныеПоля(СтруктураИзJSON.Data, СписокПолейСтрокой, ОписаниеОшибки, ПроверятьЗаполненность);
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СписокПолейСтрокой = "Id,Quantity";
	Для каждого Instruction Из СтруктураИзJSON.Data.Instructions Цикл
		РаботаСJSON.ПроверитьОбязательныеПоля(Instruction, СписокПолейСтрокой, ОписаниеОшибки, ПроверятьЗаполненность);
		Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПустаяСтрока(ОписаниеОшибки);
КонецФункции

Функция СформироватьТекстИзвещенияJSON(УИДСообщения, УИДИсходногоСообщения, ConsolidatedNumber, МассивId, Статус)
	MessageInfo = РаботаСJSON.СтруктураMessageInfo();
	MessageInfo.MessageType = "Notification";
	MessageInfo.JsonVersion = "1.0.0";
	MessageInfo.MessageId = УИДСообщения;
	MessageInfo.MasterMessageId = УИДИсходногоСообщения;
	MessageInfo.ParentMessageId = УИДИсходногоСообщения;
	MessageInfo.SystemSource = "Depo";
	MessageInfo.ActionType = "Ins";
	ТекущаяДатаВФорматеJSON_ISO = ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO);
	MessageInfo.DateTimeCreate = ТекущаяДатаВФорматеJSON_ISO;
	
	Instructions = Новый Массив;
	Для Каждого Id Из МассивId Цикл
		Instruction = Новый Структура;
		Instruction.Вставить("Id", Id);
		Instruction.Вставить("Status", Статус);
		Instruction.Вставить("ExecuteDate", ТекущаяДатаВФорматеJSON_ISO);
		Instructions.Добавить(Instruction);
	КонецЦикла;
	
	Content = Новый Структура;
	Content.Вставить("ConsolidatedNumber", ConsolidatedNumber);
	Content.Вставить("Instructions", Instructions);
	
	Data = Новый Структура;
	Data.Вставить("NotificationType", "DepoConsNti");
	Data.Вставить("ResultCode", "SUCCESS");
	Data.Вставить("ResultDescription", "");
	Data.Вставить("Content", Content);
	
	ТекстЗапросаJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	Возврат ТекстЗапросаJSON;
КонецФункции

#КонецОбласти