
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтараяДатаЗапрета = Константы.ДатаЗапретаРедактирования.Получить();
	Если Значение <> СтараяДатаЗапрета Тогда
		Комментарий = "";
		Если ДополнительныеСвойства.Свойство("Комментарий") Тогда
			Комментарий = ДополнительныеСвойства.Комментарий;
		КонецЕсли;
		УведомитьОбИзмененииДатыЗапретаРедактирования(Значение, Комментарий);
	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УведомитьОбИзмененииДатыЗапретаРедактирования(НоваяДатаЗапрета, Комментарий)
	ТекущийПользователь = Пользователи.ТекущийПользователь();

	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОбИзмененииДатыЗапретаРедактирования;
	НастройкиОтправки = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	Если Не ЗначениеЗаполнено(НастройкиОтправки) Тогда
		ЗаписьЖурналаРегистрации("Не заполнены параметры внешнего источника", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Константы.ДатаЗапретаРедактирования, ВнешнийИсточник);
		Возврат;
	КонецЕсли;
	
	ТемаПисьма = "Изменение даты запрета редактирования";
	
	ДатаЗапретаДляСообщения = Формат(НоваяДатаЗапрета, "ДФ=dd.MM.yyyy");
	АвторИзмененияДляСообщения = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекущийПользователь, "Наименование");
	ТекстПисьма = "<html><BODY>" + СтрШаблон("Дата запрета редактирования установлена на: %1 <br>Изменил: %2 <br>Комментарий: %3",
								ДатаЗапретаДляСообщения, АвторИзмененияДляСообщения, Комментарий) + "</BODY></html>";
	
	СформироватьУведомлениеКОтправке(НастройкиОтправки, ТемаПисьма, ТекстПисьма, ВажностьИнтернетПочтовогоСообщения.Обычная);

КонецПроцедуры

Процедура СформироватьУведомлениеКОтправке(НастройкиОтправки, ТемаПисьма, ТекстУведомления, ВажностьСообщения)
	
	Вложения = Новый Соответствие;
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена"		, НастройкиОтправки);
	ПараметрыУведомления.Вставить("ТемаПисьма"			, ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма"			, ТекстУведомления);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма"		, ТипТекстаПочтовогоСообщения.HTML);
	ПараметрыУведомления.Вставить("Кодировка"			, "UTF-8");
	ПараметрыУведомления.Вставить("Вложения"			, Вложения);
	ПараметрыУведомления.Вставить("Важность"			, ВажностьСообщения);
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКОтправке(ПараметрыУведомления);
	
КонецПроцедуры

#КонецОбласти