Функция СведенияОВнешнейОбработке() Экспорт
		
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид","ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Назначение",Неопределено);   //  МассивСтрокИмен
	ПараметрыРегистрации.Вставить("Наименование", "Распределение доходов по ценным бумагам");
	ПараметрыРегистрации.Вставить("Версия", "1.03");
	ПараметрыРегистрации.Вставить("БезопасныйРежим",Ложь);
	ПараметрыРегистрации.Вставить("Информация","Распределение доходов по ценным бумагам");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "2.1.1.12");
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд, 
	"Распределение доходов по ценным бумагам",
	"внРаспределениеДоходовПоЦеннымБумагам",
	"ОткрытиеФормы");    
			
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры 

#Область НКД

Процедура ЗаполнитьТаблицуНКД() Экспорт

	Купон.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорДУ.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ДУ
	               |ИЗ
	               |	Справочник.ДоговорДУ КАК ДоговорДУ
	               |ГДЕ
	               |	НЕ ДоговорДУ.ПометкаУдаления
	               |	И ДоговорДУ.Пул = &Пул
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.Счет КАК Счет,
	               |	ХозрасчетныйОбороты.КорСчет КАК КорСчет,
	               |	ХозрасчетныйОбороты.ДоговорДУ КАК ДоговорДУ,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты) КАК Эмитент,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Облигации) КАК Облигация,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.КупонныеПериоды) КАК КупонныйПериод,
	               |	ХозрасчетныйОбороты.Валюта КАК Валюта,
	               |	ХозрасчетныйОбороты.ВалютнаяСуммаОборотДт КАК ВалютнаяСуммаОборотДт,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто3 КАК Документ.Сделка) КАК КорСубконто3,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто3 КАК Документ.Сделка).АналитическийСчетДС КАК АналитическийСчетДС,
	               |	ХозрасчетныйОбороты.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВТ_Начисление
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |			&Дата1,
	               |			&Дата2,
	               |			Регистратор,
	               |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям),
	               |			,
	               |			ДоговорДУ В
	               |				(ВЫБРАТЬ
	               |					ВТ_ДУ.Ссылка КАК Ссылка
	               |				ИЗ
	               |					ВТ_ДУ КАК ВТ_ДУ),
	               |			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленныйНКД),
	               |			) КАК ХозрасчетныйОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Начисление.Счет КАК Счет,
	               |	ВТ_Начисление.КорСчет КАК КорСчет,
	               |	ВТ_Начисление.ДоговорДУ КАК ДоговорДУ,
	               |	ВТ_Начисление.Облигация КАК Облигация,
	               |	ВТ_Начисление.КупонныйПериод КАК КупонныйПериод,
	               |	ВТ_Начисление.Валюта КАК Валюта,
	               |	СУММА(ВТ_Начисление.ВалютнаяСуммаОборотДт) КАК ВалютнаяСуммаОборотДт,
	               |	ВТ_Начисление.АналитическийСчетДС КАК АналитическийСчетДС,
	               |	ВТ_Начисление.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВТ_НачисленияСвернутые
	               |ИЗ
	               |	ВТ_Начисление КАК ВТ_Начисление
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Начисление.КупонныйПериод,
	               |	ВТ_Начисление.КорСчет,
	               |	ВТ_Начисление.ДоговорДУ,
	               |	ВТ_Начисление.Облигация,
	               |	ВТ_Начисление.Счет,
	               |	ВТ_Начисление.Валюта,
	               |	ВТ_Начисление.АналитическийСчетДС,
	               |	ВТ_Начисление.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстатки.ДоговорДУ КАК ДоговорДУ,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты) КАК Эмитент,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Облигации) КАК Облигация,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.КупонныеПериоды) КАК КупонныйПериод,
	               |	ХозрасчетныйОстатки.Валюта КАК Валюта,
	               |	ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток
	               |ПОМЕСТИТЬ ВТ_Остаток
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(
	               |			&Дата2,
	               |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям),
	               |			,
	               |			ДоговорДУ В
	               |				(ВЫБРАТЬ
	               |					ВТ_ДУ.Ссылка КАК Ссылка
	               |				ИЗ
	               |					ВТ_ДУ КАК ВТ_ДУ)) КАК ХозрасчетныйОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОперацияПоСчетуБрокера.Ссылка КАК Ссылка,
	               |	ОперацияПоСчетуБрокера.ДоговорДУ КАК ДоговорДУ,
	               |	ОперацияПоСчетуБрокера.СубконтоКоррСчета2 КАК СубконтоКоррСчета2,
	               |	ОперацияПоСчетуБрокера.СубконтоКоррСчета3 КАК СубконтоКоррСчета3,
	               |	ОперацияПоСчетуБрокера.СуммаДокументаРуб КАК СуммаДокументаРуб,
	               |	ОперацияПоСчетуБрокера.АналитическийСчетБрокера КАК АналитическийСчетБрокера,
	               |	ОперацияПоСчетуБрокера.ДокументОснование КАК ДокументОснование
	               |ПОМЕСТИТЬ ВТ_Операции
	               |ИЗ
	               |	Документ.ОперацияПоСчетуБрокера КАК ОперацияПоСчетуБрокера
	               |ГДЕ
	               |	НЕ ОперацияПоСчетуБрокера.ПометкаУдаления
	               |	И (ОперацияПоСчетуБрокера.ДоговорДУ, ОперацияПоСчетуБрокера.СубконтоКоррСчета2, ОперацияПоСчетуБрокера.СубконтоКоррСчета3, ОперацияПоСчетуБрокера.СуммаДокументаРуб, ОперацияПоСчетуБрокера.АналитическийСчетБрокера, ОперацияПоСчетуБрокера.ДокументОснование) В
	               |			(ВЫБРАТЬ
	               |				ВТ_НачисленияСвернутые.ДоговорДУ КАК ДоговорДУ,
	               |				ВТ_НачисленияСвернутые.Облигация КАК Облигация,
	               |				ВТ_НачисленияСвернутые.КупонныйПериод КАК КупонныйПериод,
	               |				ВТ_НачисленияСвернутые.ВалютнаяСуммаОборотДт КАК ВалютнаяСуммаОборотДт,
	               |				ВТ_НачисленияСвернутые.АналитическийСчетДС КАК АналитическийСчетДС,
	               |				ВТ_НачисленияСвернутые.Регистратор КАК Регистратор
	               |			ИЗ
	               |				ВТ_НачисленияСвернутые КАК ВТ_НачисленияСвернутые)
	               |	И ОперацияПоСчетуБрокера.Дата МЕЖДУ &Дата1 И &Дата2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИСТИНА КАК Отм,
	               |	ВТ_НачисленияСвернутые.Регистратор КАК Документ,
	               |	ВТ_Остаток.ДоговорДУ КАК ДоговорДУ,
	               |	ВТ_Остаток.Эмитент КАК Эмитент,
	               |	ВТ_Остаток.Облигация КАК Актив,
	               |	ВТ_Остаток.КупонныйПериод КАК КупонныйПериод,
	               |	ВТ_Остаток.Валюта КАК Валюта,
	               |	ВТ_Остаток.СуммаОстаток КАК Сумма,
	               |	ВТ_НачисленияСвернутые.АналитическийСчетДС КАК АналитическийСчетДС,
	               |	ВТ_Операции.Ссылка КАК ОперацияПоСчетуБрокера
	               |ИЗ
	               |	ВТ_Остаток КАК ВТ_Остаток
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НачисленияСвернутые КАК ВТ_НачисленияСвернутые
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Операции КАК ВТ_Операции
	               |			ПО ВТ_НачисленияСвернутые.ДоговорДУ = ВТ_Операции.ДоговорДУ
	               |				И ВТ_НачисленияСвернутые.Облигация = ВТ_Операции.СубконтоКоррСчета2
	               |				И ВТ_НачисленияСвернутые.КупонныйПериод = ВТ_Операции.СубконтоКоррСчета3
	               |				И ВТ_НачисленияСвернутые.ВалютнаяСуммаОборотДт = ВТ_Операции.СуммаДокументаРуб
	               |				И ВТ_НачисленияСвернутые.АналитическийСчетДС = ВТ_Операции.АналитическийСчетБрокера
	               |				И ВТ_НачисленияСвернутые.Регистратор = ВТ_Операции.ДокументОснование
	               |		ПО ВТ_Остаток.ДоговорДУ = ВТ_НачисленияСвернутые.ДоговорДУ
	               |			И ВТ_Остаток.Облигация = ВТ_НачисленияСвернутые.Облигация
	               |			И ВТ_Остаток.КупонныйПериод = ВТ_НачисленияСвернутые.КупонныйПериод
	               |			И ВТ_Остаток.Валюта = ВТ_НачисленияСвернутые.Валюта
	               |ГДЕ
	               |	ВТ_Остаток.ДоговорДУ В
	               |			(ВЫБРАТЬ
	               |				ВТ_ДУ.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТ_ДУ КАК ВТ_ДУ)";
	Запрос.УстановитьПараметр("Пул", Пул);
	Запрос.УстановитьПараметр("Дата1", Период);
	Запрос.УстановитьПараметр("Дата2", КонецДня(Период));
	
	Данные = Запрос.Выполнить().Выгрузить();
	Купон.Загрузить(Данные);	
	
КонецПроцедуры  

Процедура СоздатьОперацииПоНКД(МассивСообщений) Экспорт
	
	Для Каждого Стр из Купон Цикл
		
		Если НЕ Стр.Отм Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Стр.ОперацияПоСчетуБрокера.Пустая() Тогда
			ОбОперация = Стр.ОперацияПоСчетуБрокера.ПолучитьОбъект();
		Иначе
			ОбОперация = Документы.ОперацияПоСчетуБрокера.СоздатьДокумент();
		КонецЕсли;
		
		ОбОперация.Дата = НачалоДня(ДатаСоздания) + 10 * 3600;
		ОбОперация.ДоговорДУ = Стр.ДоговорДУ;
		ОбОперация.Контрагент = Брокер;   
		ОбОперация.ДоговорКонтрагента = Стр.АналитическийСчетДС.ДоговорКонтрагента;
		ОбОперация.АналитическийСчетБрокера = Стр.АналитическийСчетДС;
		ОбОперация.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ФЛ/ЮЛ");
		ОбОперация.СтатьяЗатрат = Справочники.СтатьиДоходовИРасходов.НачислениеНКД;
		
		ОбОперация.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Зачисление;
		ОбОперация.СтрокаРазмешенияБрокерскогоСчета = "ОРЦБ";
		ОбОперация.ВалютаДокумента = Стр.Валюта;		
		КурсКратность = МодульВалютногоУчета.ПолучитьКурсВалюты(Справочники.Валюты.RUB, Стр.Валюта, Период); // TM-3342 
		ОбОперация.КурсВзаиморасчетов = КурсКратность.Курс;
		ОбОперация.КратностьВзаиморасчетов = КурсКратность.Кратность;
		ОбОперация.СуммаДокумента = Стр.Сумма;
		ОбОперация.СуммаДокументаРуб = Стр.Сумма * (ОбОперация.КурсВзаиморасчетов / ОбОперация.КратностьВзаиморасчетов);
		
		ОбОперация.БУ = Истина;
		ОбОперация.ВУ = Истина;
		ОбОперация.УУ = Истина;
		
		ОбОперация.КоррСчет = ПланыСчетов.Хозрасчетный.РасчетыПоОблигациям;
		ОбОперация.Корреспондент = Стр.Эмитент;
		ОбОперация.СтатьяЗатратКорреспондента = Справочники.СтатьиДоходовИРасходов.НачислениеНКД; 
		
		ОбОперация.СубконтоКоррСчета1 = Стр.Эмитент;
		ОбОперация.СубконтоКоррСчета2 = Стр.Актив;
		ОбОперация.СубконтоКоррСчета3 = Стр.КупонныйПериод;
		
		ОбОперация.ВалютаКорреспондента = Стр.Валюта;
		ОбОперация.КурсКорреспондента = КурсКратность.Курс;
		ОбОперация.КратностьКорреспондента = КурсКратность.Кратность;
		ОбОперация.СуммаКорреспондента = Стр.Сумма;
		
		ОбОперация.ДокументОснование = Стр.Документ;
		
		ОбОперация.Комментарий = "Создано автоматически обработкой ""Распределение доходов по ценным бумагам"" " + Формат(ТекущаяДата(), "ДЛФ=DT");
		
		Попытка 
			
			ОбОперация.Записать(РежимЗаписиДокумента.Проведение);			
			Сообщение = "Создана операция по счету брокеру " + ОбОперация.Ссылка;
			МассивСообщений.Добавить(Сообщение); 
			
			стр.ОперацияПоСчетуБрокера = ОбОперация.Ссылка;
			
		Исключение
			
			Описание = ОписаниеОшибки();
			МассивСообщений.ДОбавить(Описание);
			
		КонецПопытки;
				
	КонецЦикла;	
	
	
КонецПроцедуры

#КонецОбласти

#Область Погашение

Процедура ЗаполнитьТаблицуПогашение() Экспорт

	Погашение.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорДУ.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ДУ
	               |ИЗ
	               |	Справочник.ДоговорДУ КАК ДоговорДУ
	               |ГДЕ
	               |	НЕ ДоговорДУ.ПометкаУдаления
	               |	И ДоговорДУ.Пул = &Пул
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.Счет КАК Счет,
	               |	ХозрасчетныйОбороты.КорСчет КАК КорСчет,
	               |	ХозрасчетныйОбороты.ДоговорДУ КАК ДоговорДУ,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Облигации).Эмитент КАК Эмитент,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Облигации) КАК Облигация,
	               |	ХозрасчетныйОбороты.Валюта КАК Валюта,
	               |	ХозрасчетныйОбороты.ВалютнаяСуммаОборотКт КАК ВалютнаяСуммаОборотКт,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Документ.Сделка) КАК Субконто2,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Документ.Сделка).АналитическийСчетДС КАК АналитическийСчетДС,
	               |	ХозрасчетныйОбороты.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВТ_Начисление
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |			&Дата1,
	               |			&Дата2,
	               |			Регистратор,
	               |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОблигацииТело),
	               |			,
	               |			ДоговорДУ В
	               |				(ВЫБРАТЬ
	               |					ВТ_ДУ.Ссылка КАК Ссылка
	               |				ИЗ
	               |					ВТ_ДУ КАК ВТ_ДУ),
	               |			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Себестоимость),
	               |			) КАК ХозрасчетныйОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	               |	ХозрасчетныйОбороты.ДоговорДУ КАК ДоговорДУ,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Облигации) КАК Облигация,
	               |	ХозрасчетныйОбороты.Валюта КАК Валюта,
	               |	ХозрасчетныйОбороты.ВалютнаяСуммаОборотДт КАК ВалютнаяСуммаОборотДт
	               |ПОМЕСТИТЬ ВТ_Начисление2
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |			&Дата1,
	               |			&Дата2,
	               |			Регистратор,
	               |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям_ПогашениеТела),
	               |			,
	               |			ДоговорДУ В
	               |				(ВЫБРАТЬ
	               |					ВТ_ДУ.Ссылка КАК Ссылка
	               |				ИЗ
	               |					ВТ_ДУ КАК ВТ_ДУ),
	               |			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Выручка),
	               |			) КАК ХозрасчетныйОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Начисление.Счет КАК Счет,
	               |	ВТ_Начисление.КорСчет КАК КорСчет,
	               |	ВТ_Начисление.ДоговорДУ КАК ДоговорДУ,
	               |	ВТ_Начисление.Облигация КАК Облигация,
	               |	ВТ_Начисление.Валюта КАК Валюта,
	               |	СУММА(ВТ_Начисление.ВалютнаяСуммаОборотКт) КАК ВалютнаяСуммаОборотКт,
	               |	ВТ_Начисление.АналитическийСчетДС КАК АналитическийСчетДС,
	               |	ВТ_Начисление.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВТ_НачисленияСвернутые
	               |ИЗ
	               |	ВТ_Начисление КАК ВТ_Начисление
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Начисление.КорСчет,
	               |	ВТ_Начисление.ДоговорДУ,
	               |	ВТ_Начисление.Облигация,
	               |	ВТ_Начисление.Счет,
	               |	ВТ_Начисление.Валюта,
	               |	ВТ_Начисление.АналитическийСчетДС,
	               |	ВТ_Начисление.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_НачисленияСвернутые.Счет КАК Счет,
	               |	ВТ_НачисленияСвернутые.КорСчет КАК КорСчет,
	               |	ВТ_НачисленияСвернутые.ДоговорДУ КАК ДоговорДУ,
	               |	ВТ_НачисленияСвернутые.Облигация КАК Облигация,
	               |	ВТ_НачисленияСвернутые.Валюта КАК Валюта,
	               |	ЕСТЬNULL(ВТ_Начисление2.ВалютнаяСуммаОборотДт, ВТ_НачисленияСвернутые.ВалютнаяСуммаОборотКт) КАК ВалютнаяСуммаОборотКт,
	               |	ВТ_НачисленияСвернутые.АналитическийСчетДС КАК АналитическийСчетДС,
	               |	ВТ_НачисленияСвернутые.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВТ_НачисленияСвернутые2
	               |ИЗ
	               |	ВТ_НачисленияСвернутые КАК ВТ_НачисленияСвернутые
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Начисление2 КАК ВТ_Начисление2
	               |		ПО ВТ_НачисленияСвернутые.ДоговорДУ = ВТ_Начисление2.ДоговорДУ
	               |			И ВТ_НачисленияСвернутые.Облигация = ВТ_Начисление2.Облигация
	               |			И ВТ_НачисленияСвернутые.Валюта = ВТ_Начисление2.Валюта
	               |			И ВТ_НачисленияСвернутые.Регистратор = ВТ_Начисление2.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстатки.ДоговорДУ КАК ДоговорДУ,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты) КАК Эмитент,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Облигации) КАК Облигация,
	               |	ХозрасчетныйОстатки.Валюта КАК Валюта,
	               |	ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток
	               |ПОМЕСТИТЬ ВТ_Остаток
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(
	               |			&Дата2,
	               |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям_ПогашениеТела),
	               |			,
	               |			ДоговорДУ В
	               |				(ВЫБРАТЬ
	               |					ВТ_ДУ.Ссылка КАК Ссылка
	               |				ИЗ
	               |					ВТ_ДУ КАК ВТ_ДУ)) КАК ХозрасчетныйОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОперацияПоСчетуБрокера.Ссылка КАК Ссылка,
	               |	ОперацияПоСчетуБрокера.ДоговорДУ КАК ДоговорДУ,
	               |	ОперацияПоСчетуБрокера.СубконтоКоррСчета2 КАК СубконтоКоррСчета2,
	               |	ОперацияПоСчетуБрокера.СубконтоКоррСчета3 КАК СубконтоКоррСчета3,
	               |	ОперацияПоСчетуБрокера.СуммаДокументаРуб КАК СуммаДокументаРуб,
	               |	ОперацияПоСчетуБрокера.АналитическийСчетБрокера КАК АналитическийСчетБрокера,
	               |	ОперацияПоСчетуБрокера.ДокументОснование КАК ДокументОснование
	               |ПОМЕСТИТЬ ВТ_Операции
	               |ИЗ
	               |	Документ.ОперацияПоСчетуБрокера КАК ОперацияПоСчетуБрокера
	               |ГДЕ
	               |	НЕ ОперацияПоСчетуБрокера.ПометкаУдаления
	               |	И (ОперацияПоСчетуБрокера.ДоговорДУ, ОперацияПоСчетуБрокера.СубконтоКоррСчета2, ОперацияПоСчетуБрокера.СуммаДокументаРуб, ОперацияПоСчетуБрокера.АналитическийСчетБрокера, ОперацияПоСчетуБрокера.ДокументОснование) В
	               |			(ВЫБРАТЬ
	               |				ВТ_НачисленияСвернутые.ДоговорДУ КАК ДоговорДУ,
	               |				ВТ_НачисленияСвернутые.Облигация КАК Облигация,
	               |				ВТ_НачисленияСвернутые.ВалютнаяСуммаОборотКт КАК ВалютнаяСуммаОборотКт,
	               |				ВТ_НачисленияСвернутые.АналитическийСчетДС КАК АналитическийСчетДС,
	               |				ВТ_НачисленияСвернутые.Регистратор КАК Регистратор
	               |			ИЗ
	               |				ВТ_НачисленияСвернутые2 КАК ВТ_НачисленияСвернутые)
	               |	И ОперацияПоСчетуБрокера.Дата МЕЖДУ &Дата1 И &Дата2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИСТИНА КАК Отм,
	               |	ВТ_НачисленияСвернутые.Регистратор КАК Документ,
	               |	ВТ_Остаток.ДоговорДУ КАК ДоговорДУ,
	               |	ВТ_Остаток.Эмитент КАК Эмитент,
	               |	ВТ_Остаток.Облигация КАК Актив,
	               |	ВТ_Остаток.Валюта КАК Валюта,
	               |	ВТ_Остаток.СуммаОстаток КАК Сумма,
	               |	ВТ_НачисленияСвернутые.АналитическийСчетДС КАК АналитическийСчетДС,
	               |	ВТ_Операции.Ссылка КАК ОперацияПоСчетуБрокера
	               |ИЗ
	               |	ВТ_Остаток КАК ВТ_Остаток
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НачисленияСвернутые2 КАК ВТ_НачисленияСвернутые
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Операции КАК ВТ_Операции
	               |			ПО ВТ_НачисленияСвернутые.ДоговорДУ = ВТ_Операции.ДоговорДУ
	               |				И ВТ_НачисленияСвернутые.Облигация = ВТ_Операции.СубконтоКоррСчета2
	               |				И ВТ_НачисленияСвернутые.ВалютнаяСуммаОборотКт = ВТ_Операции.СуммаДокументаРуб
	               |				И ВТ_НачисленияСвернутые.АналитическийСчетДС = ВТ_Операции.АналитическийСчетБрокера
	               |				И ВТ_НачисленияСвернутые.Регистратор = ВТ_Операции.ДокументОснование
	               |		ПО ВТ_Остаток.ДоговорДУ = ВТ_НачисленияСвернутые.ДоговорДУ
	               |			И ВТ_Остаток.Облигация = ВТ_НачисленияСвернутые.Облигация
	               |			И ВТ_Остаток.Валюта = ВТ_НачисленияСвернутые.Валюта
	               |ГДЕ
	               |	ВТ_Остаток.ДоговорДУ В
	               |			(ВЫБРАТЬ
	               |				ВТ_ДУ.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТ_ДУ КАК ВТ_ДУ)";
	Запрос.УстановитьПараметр("Пул", Пул);
	Запрос.УстановитьПараметр("Дата1", Период);
	Запрос.УстановитьПараметр("Дата2", КонецДня(Период));
	
	Данные = Запрос.Выполнить().Выгрузить();
	Погашение.Загрузить(Данные);	
	
КонецПроцедуры  

Процедура СоздатьОперацииПоПогашение(МассивСообщений) Экспорт

	Для Каждого Стр из Погашение Цикл
		
		Если НЕ Стр.Отм Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Стр.ОперацияПоСчетуБрокера.Пустая() Тогда
			ОбОперация = Стр.ОперацияПоСчетуБрокера.ПолучитьОбъект();
		Иначе
			ОбОперация = Документы.ОперацияПоСчетуБрокера.СоздатьДокумент();
		КонецЕсли;
		
		ОбОперация.Дата = НачалоДня(ДатаСоздания) + 10 * 3600;
		ОбОперация.ДоговорДУ = Стр.ДоговорДУ;
		ОбОперация.Контрагент = Брокер;   
		ОбОперация.ДоговорКонтрагента = Стр.АналитическийСчетДС.ДоговорКонтрагента;
		ОбОперация.АналитическийСчетБрокера = Стр.АналитическийСчетДС;
		ОбОперация.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - ФЛ/ЮЛ");
		ОбОперация.СтатьяЗатрат = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Амортизация");;
		
		ОбОперация.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Зачисление;
		ОбОперация.СтрокаРазмешенияБрокерскогоСчета = "ОРЦБ";
		ОбОперация.ВалютаДокумента = Стр.Валюта;		
		КурсКратность = МодульВалютногоУчета.ПолучитьКурсВалюты(Справочники.Валюты.RUB, Стр.Валюта, Период); // TM-3342 
		ОбОперация.КурсВзаиморасчетов = КурсКратность.Курс;
		ОбОперация.КратностьВзаиморасчетов = КурсКратность.Кратность;
		ОбОперация.СуммаДокумента = Стр.Сумма;
		ОбОперация.СуммаДокументаРуб = Стр.Сумма * (ОбОперация.КурсВзаиморасчетов / ОбОперация.КратностьВзаиморасчетов);
		
		ОбОперация.БУ = Истина;
		ОбОперация.ВУ = Истина;
		ОбОперация.УУ = Истина;
		
		ОбОперация.КоррСчет = ПланыСчетов.Хозрасчетный.РасчетыПоОблигациям_ПогашениеТела;
		ОбОперация.Корреспондент = Стр.Эмитент;
		ОбОперация.СтатьяЗатратКорреспондента = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Амортизация"); 
		
		ОбОперация.СубконтоКоррСчета1 = Стр.Эмитент;
		ОбОперация.СубконтоКоррСчета2 = Стр.Актив;
		
		ОбОперация.ВалютаКорреспондента = Стр.Валюта;
		ОбОперация.КурсКорреспондента = КурсКратность.Курс;
		ОбОперация.КратностьКорреспондента = КурсКратность.Кратность;
		ОбОперация.СуммаКорреспондента = Стр.Сумма;
		
		ОбОперация.ДокументОснование = Стр.Документ;
		
		ОбОперация.Комментарий = "Создано автоматически обработкой ""Распределение доходов по ценным бумагам"" " + Формат(ТекущаяДата(), "ДЛФ=DT");
		
		Попытка 
			
			ОбОперация.Записать(РежимЗаписиДокумента.Проведение);			
			Сообщение = "Создана операция по счету брокеру " + ОбОперация.Ссылка;
			МассивСообщений.Добавить(Сообщение); 
			
			стр.ОперацияПоСчетуБрокера = ОбОперация.Ссылка;
			
		Исключение
			
			Описание = ОписаниеОшибки();
			МассивСообщений.ДОбавить(Описание);
			
		КонецПопытки;
				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область Дивиденды

Процедура ЗаполнитьТаблицуДивиденды() Экспорт

	Дивиденды.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорДУ.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ДУ
	               |ИЗ
	               |	Справочник.ДоговорДУ КАК ДоговорДУ
	               |ГДЕ
	               |	НЕ ДоговорДУ.ПометкаУдаления
	               |	И ДоговорДУ.Пул = &Пул
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.Счет КАК Счет,
	               |	ХозрасчетныйОбороты.КорСчет КАК КорСчет,
	               |	ХозрасчетныйОбороты.ДоговорДУ КАК ДоговорДУ,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты) КАК Эмитент,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Акции) КАК Акция,
	               |	ХозрасчетныйОбороты.Валюта КАК Валюта,
	               |	ХозрасчетныйОбороты.ВалютнаяСуммаОборотДт КАК Дивиденды,
	               |	ХозрасчетныйОбороты.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВТ_Начисление
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |			&Дата1,
	               |			&Дата2,
	               |			Регистратор,
	               |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоДивидендам),
	               |			,
	               |			ДоговорДУ В
	               |				(ВЫБРАТЬ
	               |					ВТ_ДУ.Ссылка КАК Ссылка
	               |				ИЗ
	               |					ВТ_ДУ КАК ВТ_ДУ),
	               |			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Дивиденды),
	               |			) КАК ХозрасчетныйОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстатки.ДоговорДУ КАК ДоговорДУ,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Акции) КАК Акция,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Документ.Сделка).АналитическийСчетДС КАК АналитическийСчетДС
	               |ПОМЕСТИТЬ ВТ_Счет
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(
	               |			&Дата2,
	               |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АкцииТело),
	               |			,
	               |			(ДоговорДУ, Субконто1) В
	               |				(ВЫБРАТЬ
	               |					ВТ_Начисление.ДоговорДУ КАК ДоговорДУ,
	               |					ВТ_Начисление.Акция КАК Акция
	               |				ИЗ
	               |					ВТ_Начисление КАК ВТ_Начисление)) КАК ХозрасчетныйОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОстатки.ДоговорДУ,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Акции),
	               |	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Документ.Сделка).АналитическийСчетДС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИСТИНА КАК Отм,
	               |	ВТ_Начисление.Регистратор КАК Документ,
	               |	ВТ_Начисление.ДоговорДУ КАК ДоговорДУ,
	               |	ВТ_Начисление.Эмитент КАК Эмитент,
	               |	ВТ_Начисление.Акция КАК Актив,
	               |	ВТ_Начисление.Валюта КАК Валюта,
	               |	ВТ_Начисление.Дивиденды КАК Сумма,
	               |	ВТ_Счет.АналитическийСчетДС КАК АналитическийСчетДС
	               |ПОМЕСТИТЬ ВТ_Итог
	               |ИЗ
	               |	ВТ_Начисление КАК ВТ_Начисление
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Счет КАК ВТ_Счет
	               |		ПО ВТ_Начисление.ДоговорДУ = ВТ_Счет.ДоговорДУ
	               |			И ВТ_Начисление.Акция = ВТ_Счет.Акция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОперацияПоСчетуБрокера.Ссылка КАК Ссылка,
	               |	ОперацияПоСчетуБрокера.ДоговорДУ КАК ДоговорДУ,
	               |	ОперацияПоСчетуБрокера.СубконтоКоррСчета1 КАК СубконтоКоррСчета1,
	               |	ОперацияПоСчетуБрокера.СубконтоКоррСчета2 КАК СубконтоКоррСчета2,
	               |	ОперацияПоСчетуБрокера.СуммаДокументаРуб КАК СуммаДокументаРуб,
	               |	ОперацияПоСчетуБрокера.АналитическийСчетБрокера КАК АналитическийСчетБрокера,
	               |	ОперацияПоСчетуБрокера.ДокументОснование КАК ДокументОснование
	               |ПОМЕСТИТЬ ВТ_Операции
	               |ИЗ
	               |	Документ.ОперацияПоСчетуБрокера КАК ОперацияПоСчетуБрокера
	               |ГДЕ
	               |	НЕ ОперацияПоСчетуБрокера.ПометкаУдаления
	               |	И ОперацияПоСчетуБрокера.Дата МЕЖДУ &Дата1 И &Дата2
	               |	И (ОперацияПоСчетуБрокера.ДоговорДУ, ОперацияПоСчетуБрокера.СубконтоКоррСчета2, ОперацияПоСчетуБрокера.СуммаДокументаРуб, ОперацияПоСчетуБрокера.АналитическийСчетБрокера, ОперацияПоСчетуБрокера.ДокументОснование) В
	               |			(ВЫБРАТЬ
	               |				ВТ_Итог.ДоговорДУ КАК ДоговорДУ,
	               |				ВТ_Итог.Актив КАК Актив,
	               |				ВТ_Итог.Сумма КАК Сумма,
	               |				ВТ_Итог.АналитическийСчетДС КАК АналитическийСчетДС,
	               |				ВТ_Итог.Документ КАК Документ
	               |			ИЗ
	               |				ВТ_Итог КАК ВТ_Итог)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Итог.Отм КАК Отм,
	               |	ВТ_Итог.Документ КАК Документ,
	               |	ВТ_Итог.ДоговорДУ КАК ДоговорДУ,
	               |	ВТ_Итог.Эмитент КАК Эмитент,
	               |	ВТ_Итог.Актив КАК Актив,
	               |	ВТ_Итог.Валюта КАК Валюта,
	               |	ВТ_Итог.Сумма КАК Сумма,
	               |	ВТ_Итог.АналитическийСчетДС КАК АналитическийСчетДС,
	               |	ВТ_Операции.Ссылка КАК ОперацияПоСчетуБрокера
	               |ИЗ
	               |	ВТ_Итог КАК ВТ_Итог
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Операции КАК ВТ_Операции
	               |		ПО ВТ_Итог.Документ = ВТ_Операции.ДокументОснование
	               |			И ВТ_Итог.ДоговорДУ = ВТ_Операции.ДоговорДУ
	               |			И ВТ_Итог.Актив = ВТ_Операции.СубконтоКоррСчета2
	               |			И ВТ_Итог.Сумма = ВТ_Операции.СуммаДокументаРуб
	               |			И ВТ_Итог.АналитическийСчетДС = ВТ_Операции.АналитическийСчетБрокера";
	Запрос.УстановитьПараметр("Пул", Пул);
	Запрос.УстановитьПараметр("Дата1", Период);
	Запрос.УстановитьПараметр("Дата2", КонецДня(Период));
	
	Данные = Запрос.Выполнить().Выгрузить();
	Дивиденды.Загрузить(Данные);	
	
КонецПроцедуры  

Процедура СоздатьОперацииПоДивидендам(МассивСообщений) Экспорт

	Для Каждого Стр из Дивиденды Цикл
		
		Если НЕ Стр.Отм Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Стр.ОперацияПоСчетуБрокера.Пустая() Тогда
			ОбОперация = Стр.ОперацияПоСчетуБрокера.ПолучитьОбъект();
		Иначе
			ОбОперация = Документы.ОперацияПоСчетуБрокера.СоздатьДокумент();
		КонецЕсли;
		
		ОбОперация.Дата = НачалоДня(ДатаСоздания) + 10 * 3600;
		ОбОперация.ДоговорДУ = Стр.ДоговорДУ;
		ОбОперация.Контрагент = Брокер;   
		ОбОперация.ДоговорКонтрагента = Стр.АналитическийСчетДС.ДоговорКонтрагента;
		ОбОперация.АналитическийСчетБрокера = Стр.АналитическийСчетДС;
		ОбОперация.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - ФЛ/ЮЛ");
		ОбОперация.СтатьяЗатрат = Справочники.СтатьиДоходовИРасходов.НачислениеДивидендов;
		
		ОбОперация.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Зачисление;
		ОбОперация.СтрокаРазмешенияБрокерскогоСчета = "ОРЦБ";
		ОбОперация.ВалютаДокумента = Стр.Валюта;		
		КурсКратность = МодульВалютногоУчета.ПолучитьКурсВалюты(Справочники.Валюты.RUB, Стр.Валюта, Период); // TM-3342 
		ОбОперация.КурсВзаиморасчетов = КурсКратность.Курс;
		ОбОперация.КратностьВзаиморасчетов = КурсКратность.Кратность;
		ОбОперация.СуммаДокумента = Стр.Сумма;
		ОбОперация.СуммаДокументаРуб = Стр.Сумма * (ОбОперация.КурсВзаиморасчетов / ОбОперация.КратностьВзаиморасчетов);
		
		ОбОперация.БУ = Истина;
		ОбОперация.ВУ = Истина;
		ОбОперация.УУ = Истина;
		
		ОбОперация.КоррСчет = ПланыСчетов.Хозрасчетный.РасчетыПоДивидендам;
		ОбОперация.Корреспондент = Стр.Эмитент;
		//ОбОперация.СтатьяЗатратКорреспондента = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Амортизация"); 
		
		ОбОперация.СубконтоКоррСчета1 = Стр.Эмитент;
		ОбОперация.СубконтоКоррСчета2 = Стр.Актив;
		
		ОбОперация.ВалютаКорреспондента = Стр.Валюта;
		ОбОперация.КурсКорреспондента = КурсКратность.Курс;
		ОбОперация.КратностьКорреспондента = КурсКратность.Кратность;
		ОбОперация.СуммаКорреспондента = Стр.Сумма;
		
		ОбОперация.ДокументОснование = Стр.Документ;
		
		ОбОперация.Комментарий = "Создано автоматически обработкой ""Распределение доходов по ценным бумагам"" " + Формат(ТекущаяДата(), "ДЛФ=DT");
		
		Попытка 
			
			ОбОперация.Записать(РежимЗаписиДокумента.Проведение);			
			Сообщение = "Создана операция по счету брокеру " + ОбОперация.Ссылка;
			МассивСообщений.Добавить(Сообщение); 
			
			стр.ОперацияПоСчетуБрокера = ОбОперация.Ссылка;
			
		Исключение
			
			Описание = ОписаниеОшибки();
			МассивСообщений.ДОбавить(Описание);
			
		КонецПопытки;
				
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти
