////////////////////////////////////////////////////////
//
// Команда предназначена для открытия приложения Word с заполненной печатной формой приложения 1.5
// Параметры для заполнения в макете заключены в квадратные скобки [],
// текст описания ЦБ - повторяющийся блок, обрамлён комментариями <!--ОписаниеЦБНачало--> и <!--ОписаниеЦБКонец-->.
// Методы ОМ РаботаСФайламиМайкрософтОфисКлиентСервер не используются из-за необходимости повторения блока ЦБ, далее,
// чтобы дважды не открывать файл на редактирование, параметры заполняются заменой текста
// При доработке макета (изменении файла в приложении Word) данные комментарии затираются,
// а квадратные скобки отделяются от наименования параметра,
// поэтому макет рекомендуется править посредством изменения файла \word\document.xml,
// либо после правки в Word необходимо в данном файле внести изменения (вернуть комментарии и поправить параметры)
//
////////////////////////////////////////////////////////

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Поручение = ПараметрКоманды;
	ДанныеПечатнойФормы = ДанныеПечатнойФормы(Поручение);
	Если Не ЗначениеЗаполнено(ДанныеПечатнойФормы) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайлаDOCX = ПолучитьИмяВременногоФайла("docx");
	ДанныеПечатнойФормы.ДвоичныеДанныеФайла.Записать(ИмяФайлаDOCX);
	
	Word = Новый COMОбъект("Word.Application");
	Word.Documents.Add(ИмяФайлаDOCX);
	WdDialogFileSummaryInfo = 86;
	Dialog = Word.Dialogs(WdDialogFileSummaryInfo);
	Dialog.Title = ДанныеПечатнойФормы.ИмяФайла;
	Dialog.Execute();
	Word.Application.Visible = 1;
	УдалитьФайлы(ИмяФайлаDOCX);
КонецПроцедуры

&НаСервере
Функция ЭтоДопустимыйВидОперацииДляПриложения_1_5(ДанныеПоручения)
	Возврат ДанныеПоручения.ВидОперацииД = Справочники.ВидыОпераций.Депонирование
		Или ДанныеПоручения.ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования
		Или ДанныеПоручения.ВидОперацииД = Справочники.ВидыОпераций.Перевод
		Или ДанныеПоручения.ВидОперацииД = Справочники.ВидыОпераций.Перемещение
		Или ДанныеПоручения.ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо;
КонецФункции

&НаСервере
Функция ДанныеПечатнойФормы(Поручение)
	
	Запрос = ЗапросДанныхДляПриложения_1_5(Поручение);
	ДанныеПоручения = Запрос.Выполнить().Выбрать();
	ДанныеПоручения.Следующий();
	
	Если Не ЭтоДопустимыйВидОперацииДляПриложения_1_5(ДанныеПоручения) Тогда
		ТекстСообщения = "Формирование Приложения 6 допустимо только для видов операции "
		+ """Зачисление"", ""Списание"", ""Перевод"", ""Перемещение"" или ""Перевод (между разделами счета депо)""";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	НаименованиеФайла			= "Приложение 6";
	ИмяВременногоФайлаАрхива	= ПолучитьИмяВременногоФайла("zip");
	ИмяВременногоКаталога		= КаталогВременныхФайлов() + НаименованиеФайла;
	ИмяИтоговогоФайла			= ИмяВременногоКаталога + ".docx";
	
	ИмяМакета = ИмяМакетаПриложения06(Поручение);
	ШаблонЗаявления = Документы.Поручение.ПолучитьМакет(ИмяМакета);
	ШаблонЗаявления.Записать(ИмяВременногоФайлаАрхива);
	
	ЧтениеАрхива = Новый ЧтениеZipФайла(ИмяВременногоФайлаАрхива);
	ЧтениеАрхива.ИзвлечьВсе(ИмяВременногоКаталога);
	ЧтениеАрхива.Закрыть();
	
	ИмяОсновногоФайла = ИмяВременногоКаталога + "\word\document.xml";
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяОсновногоФайла, "UTF8");
	ШаблонОсновногоФайла = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	ШаблонОписанияЦБ = ШаблонОписанияЦБ(ШаблонОсновногоФайла);
	Если ЗначениеЗаполнено(ШаблонОписанияЦБ) Тогда
		ШаблонОсновногоФайла = СтрЗаменить(ШаблонОсновногоФайла, ШаблонОписанияЦБ, "[ОписаниеЦБ]");
	КонецЕсли;
	
	Текст = ШаблонОсновногоФайла;
	ЗаполнитьДанныеДепонентаИКонтрагента(Текст, ДанныеПоручения);
	
	Текст = СтрЗаменить(Текст, "[Референс]", ДанныеПоручения.Референс);
	ОписаниеСтрокиЦБ(Текст, ДанныеПоручения, 1);
	
	Сумма = СуммаПоручения(ДанныеПоручения);
	Если Сумма <> 0 Тогда
		Если ЗначениеЗаполнено(ДанныеПоручения.ВалютаПараметрыПрописиНаРусском) Тогда
			СуммаПрописью = ЧислоПрописью(Сумма, , ДанныеПоручения.ВалютаПараметрыПрописиНаРусском);
		Иначе
			СуммаПрописью = ФормированиеПечатныхФорм.КоличествоПрописью(Сумма);
		КонецЕсли;
		Текст = СтрЗаменить(Текст, "[Сумма]", Сумма);
		Текст = СтрЗаменить(Текст, "[СуммаПрописью]", СуммаПрописью);
		Текст = СтрЗаменить(Текст, "[Валюта]", ДанныеПоручения.ВалютаНаименованиеДляОтчетов);
	КонецЕсли;
	
	Если ТипЗнч(ДанныеПоручения.Инициатор) = Тип("СправочникСсылка.Организации") И ДанныеПоручения.ВидИнициатора = 1 Тогда
		ДанныеУполномоченногоЛица = ДанныеУполномоченногоЛица(ДанныеПоручения);
		Текст = СтрЗаменить(Текст, "[УполномоченноеЛицо]", ДанныеУполномоченногоЛица.НаименованиеОрганизации);
		Текст = СтрЗаменить(Текст, "[ЛицоДействующееОтИмениУполномоченногоЛица]", ДанныеУполномоченногоЛица.ОтветственноеЛицо);
	КонецЕсли;
	
	Если ЭтоРеестр(ДанныеПоручения) Тогда
		Текст = СтрЗаменить(Текст, "[Основание]", ОписаниеОснования(ДанныеПоручения));
		Текст = СтрЗаменить(Текст, "[ДопИнформация]", ДопИнформация(ДанныеПоручения));
	Иначе
		ПозицияРазделителя = СтрНайти(ДанныеПоручения.Комментарий, "|");
		Если ПозицияРазделителя = 0 Тогда
			Основание = ДанныеПоручения.Комментарий;
		Иначе
			Основание = Лев(ДанныеПоручения.Комментарий, ПозицияРазделителя - 1);
		КонецЕсли;
		Если Не СтрНачинаетсяС(СокрЛП(Основание), "Отчет/выписка") Тогда
			Текст = СтрЗаменить(Текст, "[Основание]", СокрЛП(Основание));
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьДату(Текст, ДанныеПоручения.ДатаСделки, "С");
	ЗаполнитьДату(Текст, ДанныеПоручения.ПланируемаяДатаРасчетов, "Р");
	ЗаполнитьДату(Текст, ДанныеПоручения.ДатаПриема, "П");
	
	ЗаполнитьВидОперации(Текст, ДанныеПоручения);
	ЗаполнитьМестоРасчетов(Текст, ДанныеПоручения);
	ЗаполнитьТипРасчетов(Текст, ДанныеПоручения);
	
	ОчиститьНезаполненныеПараметры(Текст);
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяОсновногоФайла, "UTF8");
	ЗаписьТекста.Записать(Текст);
	ЗаписьТекста.Закрыть();
	
	ЗаписьАрхива = Новый ЗаписьZipФайла(ИмяИтоговогоФайла);
	ЗаписьАрхива.Добавить(ИмяВременногоКаталога + "\*.*",
	РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
	РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ЗаписьАрхива.Записать();
	
	ДвоичныеДанныеПечатнойФормы = Новый ДвоичныеДанные(ИмяИтоговогоФайла);
	
	УдалитьФайлы(ИмяВременногоФайлаАрхива);
	УдалитьФайлы(ИмяВременногоКаталога);
	
	Результат = Новый Структура;
	Результат.Вставить("ДвоичныеДанныеФайла", ДвоичныеДанныеПечатнойФормы);
	Результат.Вставить("ИмяФайла", СокрЛП(СтрЗаменить(ДанныеПоручения.Номер, "-", " ")));
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗапросДанныхДляПриложения_1_5(Поручение)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Поручение.Ссылка КАК Поручение,
	|	Поручение.Номер КАК Номер,
	|	Поручение.Дата КАК Дата,
	|	Поручение.ВидОперацииД КАК ВидОперацииД,
	|	Поручение.ВидПоручения КАК ВидПоручения,
	|	Поручение.ТипПеревода КАК ТипПеревода,
	|	Поручение.МХКонтрагент КАК МХКонтрагент,
	|	Поручение.МХКонтрагент.Наименование КАК МХКонтрагентНаименование,
	|	Поручение.МХКонтрагент.Код КАК МХКонтрагентКод,
	|	Поручение.Депонент КАК Депонент,
	|	Поручение.Депонент.НаименованиеПолное КАК НаименованиеДепонента,
	|	Поручение.Депонент.ЮридическиеФизическиеЛица КАК ДепонентЮрФизЛицо,
	|	Поручение.Депонент.Код КАК КодДепонента,
	|	Поручение.СчетДепо.Код КАК КодСчетаДепо,
	|	Поручение.РазделСчетаДепо.Код КАК КодРазделаСчетаДепо,
	|	Поручение.ЦБ.ISIN КАК ISIN,
	|	Поручение.ЦБ.Наименование КАК НаименованиеЦБ,
	|	Поручение.ЦБ.НомерРегистрации КАК НомерРегистрации,
	|	Поручение.КоличествоЦБ КАК КоличествоЦБ,
	|	Поручение.Контрагент КАК Контрагент,
	|	Поручение.Контрагент.НаименованиеПолное КАК НаименованиеКонтрагента, 
	|	Поручение.Контрагент.Код КАК КодКонтрагента,
	|	ВЫБОР
	|		КОГДА Поручение.Контрагент В ИЕРАРХИИ (&ГруппаДепоненты)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКлиентИзГруппыДепоненты,
	|	Поручение.СчетДепоКонтрагента.Код КАК КодСчетаДепоКонтрагента,
	|	Поручение.СчетДепоКонтрагента.СчетВМестеРасчетовНомерСчета КАК НомерСчетаДепоКонтрагента,
	|	ВЫБОР
	|		КОГДА Поручение.СчетДепоКонтрагента.ТипСчетаДепоFCDR_2017_02.Код = ""OWNE""
	|			ТОГДА ""владельца""
	|		КОГДА Поручение.СчетДепоКонтрагента.ТипСчетаДепоFCDR_2017_02.Код = ""NOMI""
	|			ТОГДА ""номинального держателя""
	|		ИНАЧЕ Поручение.СчетДепоКонтрагента.ТипСчетаДепоFCDR_2017_02.Наименование
	|	КОНЕЦ КАК ТипСчетаДепоКонтрагентаFCDR_2017_02,
	|	Поручение.РазделСчетаДепоКонтрагента.Код КАК КодРазделаСчетаДепоКонтрагента,
	|	Поручение.СчетДепоКонтрагента.СчетВМестеРасчетовНаименованиеКлиента КАК НаименованиеКлиентаКонтрагента,
	|	Поручение.СчетДепоКонтрагента.СчетВМестеРасчетовНомерСчетаКлиента КАК КодСчетаДепоКлиентаКонтрагента,
	|	Поручение.ДатаСделки КАК ДатаСделки,
	|	Поручение.ПланируемаяДатаРасчетов КАК ПланируемаяДатаРасчетов,
	|	Поручение.ДатаПриема КАК ДатаПриема,
	|	Поручение.Референс КАК Референс,
	|	Поручение.СуммаСделки КАК Сумма,
	|	Поручение.Комментарий КАК Комментарий,
	|	Поручение.Инициатор КАК Инициатор,
	|	Поручение.ВидИнициатора КАК ВидИнициатора,
	|	Поручение.Инициатор = Поручение.Депонент КАК ИнициаторомЯвляетсяДепонент,
	|	Поручение.Инициатор = Поручение.Контрагент КАК ИнициаторомЯвляетсяКонтрагент,
	|	Поручение.ВидИсполненияDVP КАК ВидИсполненияDVP,
	|	ЕСТЬNULL(Поручение.БанковскийСчет.ВалютаДенежныхСредств.ПараметрыПрописиНаРусском, """") КАК ВалютаПараметрыПрописиНаРусском,
	|	ЕСТЬNULL(Поручение.БанковскийСчет.ВалютаДенежныхСредств.НаименованиеДляОтчетов, """") КАК ВалютаНаименованиеДляОтчетов
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.Ссылка = &Поручение";
	Запрос.УстановитьПараметр("Поручение", Поручение);
	Запрос.УстановитьПараметр("ГруппаДепоненты", Справочники.Контрагенты.Депоненты);
	Возврат Запрос;
КонецФункции

&НаСервере
Функция ЭтоРеестр(ДанныеПоручения)
	Возврат (ДанныеПоручения.ВидПоручения = Справочники.ВидыИнвентарныхПоручений.П35
	Или ДанныеПоручения.ВидПоручения = Справочники.ВидыИнвентарныхПоручений.П36_Реестр);
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеДепонентаИКонтрагента(Текст, ДанныеПоручения)
	
	Если ЭтоПоручениеНаПереводТипаЗачисление(ДанныеПоручения) Тогда
		Если ДанныеПоручения.ТипПеревода = Перечисления.ТипыПереводов.Зачисление Тогда // Поручение на перевод типа зачисление нового образца
			Текст = СтрЗаменить(Текст, "[КодДепонента]"					, ДанныеПоручения.КодКонтрагента);
		КонецЕсли;
		Текст = СтрЗаменить(Текст, "[НаименованиеДепонента]"			, ДанныеПоручения.НаименованиеКонтрагента);
		Текст = СтрЗаменить(Текст, "[КодСчетаДепо]"						, ДанныеПоручения.КодСчетаДепоКонтрагента);
		Текст = СтрЗаменить(Текст, "[КодРазделаСчетаДепо]"				, ДанныеПоручения.КодРазделаСчетаДепоКонтрагента);
		Текст = СтрЗаменить(Текст, "[НаименованиеКонтрагента]"			, ДанныеПоручения.НаименованиеДепонента);
		Текст = СтрЗаменить(Текст, "[КодРазделаСчетаДепоКонтрагента]"	, ДанныеПоручения.КодРазделаСчетаДепо);
		Текст = СтрЗаменить(Текст, "[НомерСчетаДепоКонтрагента]"		, ДанныеПоручения.КодСчетаДепо);
	Иначе // Другие типы операций кроме перевод + зачисление
		Текст = СтрЗаменить(Текст, "[КодДепонента]"						, ДанныеПоручения.КодДепонента);
		Текст = СтрЗаменить(Текст, "[НаименованиеДепонента]"			, ДанныеПоручения.НаименованиеДепонента);
		Текст = СтрЗаменить(Текст, "[КодСчетаДепо]"						, ДанныеПоручения.КодСчетаДепо);
		Текст = СтрЗаменить(Текст, "[КодРазделаСчетаДепо]"				, ДанныеПоручения.КодРазделаСчетаДепо);
		Текст = СтрЗаменить(Текст, "[НаименованиеКонтрагента]"			, ДанныеПоручения.НаименованиеКонтрагента);
		Текст = СтрЗаменить(Текст, "[КодРазделаСчетаДепоКонтрагента]"	, ДанныеПоручения.КодРазделаСчетаДепоКонтрагента);
		Если ЭтоПоручениеНаПереводТипаСписание(ДанныеПоручения)
			Или ДанныеПоручения.ВидОперацииД = Справочники.ВидыОпераций.Перемещение
			Или ДанныеПоручения.ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
			Текст = СтрЗаменить(Текст, "[НомерСчетаДепоКонтрагента]", ДанныеПоручения.КодСчетаДепоКонтрагента);
		Иначе
			Текст = СтрЗаменить(Текст, "[НомерСчетаДепоКонтрагента]", ДанныеПоручения.НомерСчетаДепоКонтрагента);
		КонецЕсли;
	КонецЕсли;
	
	Текст = СтрЗаменить(Текст, "[НаименованиеКлиентаКонтрагента]"	, ДанныеПоручения.НаименованиеКлиентаКонтрагента);
	Текст = СтрЗаменить(Текст, "[КодСчетаДепоКлиентаКонтрагента]"	, ДанныеПоручения.КодСчетаДепоКлиентаКонтрагента);
	
	МестоХраненияПоУмолчанию = ОбщегоНазначения.ЗначениеКонстанты("МестоХраненияПоУмолчанию");
КонецПроцедуры

// Заполняет шаблон блока описания ЦБ. Текст описания ЦБ - повторяющийся блок,
//  обрамлён комментариями <!--ОписаниеЦБНачало--> и <!--ОписаниеЦБКонец-->
//  при доработке макета (изменении файла в приложении Word) данные комментарии затираются,
//  поэтому макет рекомендуется править посредством изменения файла \word\document.xml,
//  либо после правки в Word необходимо в данном файле внести изменения (вернуть комментарии)
//
// Параметры:
//  ШаблонОсновногоФайла - Строка	 - текст файла
// 
// Возвращаемое значение:
//  Строка - шаблон для заполнения данных по одной ЦБ
//
&НаСервере
Функция ШаблонОписанияЦБ(ШаблонОсновногоФайла)
	МеткаНачалаОписанияЦБ		= "<!--ОписаниеЦБНачало-->";
	МеткаОкончанияОписанияЦБ	= "<!--ОписаниеЦБКонец-->";
	ПозицияНачалаОписанияЦБ		= СтрНайти(ШаблонОсновногоФайла, МеткаНачалаОписанияЦБ);
	ПозицияОкончанияОписанияЦБ	= СтрНайти(ШаблонОсновногоФайла, МеткаОкончанияОписанияЦБ);
	
	Если ПозицияНачалаОписанияЦБ = 0 Или ПозицияОкончанияОписанияЦБ = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ДлинаШаблонаОписанияЦБ = ПозицияОкончанияОписанияЦБ - ПозицияНачалаОписанияЦБ + СтрДлина(МеткаОкончанияОписанияЦБ);
	ШаблонОписанияЦБ = Сред(ШаблонОсновногоФайла, ПозицияНачалаОписанияЦБ, ДлинаШаблонаОписанияЦБ);
	
	ШаблонОписанияЦБ = СтрЗаменить(ШаблонОписанияЦБ, МеткаНачалаОписанияЦБ, "");
	ШаблонОписанияЦБ = СтрЗаменить(ШаблонОписанияЦБ, МеткаОкончанияОписанияЦБ, "");
	ШаблонОписанияЦБ = СокрЛП(ШаблонОписанияЦБ);
	
	Возврат ШаблонОписанияЦБ;
КонецФункции


&НаСервере
Процедура ОписаниеСтрокиЦБ(ШаблонОписанияЦБ, ДанныеЦБ, НомерСтроки)
	ШаблонОписанияЦБ = СтрЗаменить(ШаблонОписанияЦБ, "[НомерСтрокиЦБ]"	, НомерСтроки);
	ШаблонОписанияЦБ = СтрЗаменить(ШаблонОписанияЦБ, "[ISIN]"				, ДанныеЦБ.ISIN);
	ШаблонОписанияЦБ = СтрЗаменить(ШаблонОписанияЦБ, "[НаименованиеЦБ]"	, ДанныеЦБ.НаименованиеЦБ);
	ШаблонОписанияЦБ = СтрЗаменить(ШаблонОписанияЦБ, "[НомерРегистрации]"	, ДанныеЦБ.НомерРегистрации);
	ШаблонОписанияЦБ = СтрЗаменить(ШаблонОписанияЦБ, "[КоличествоЦБ]"		, ДанныеЦБ.КоличествоЦБ);
КонецПроцедуры

&НаСервере
Функция СуммаПоручения(ДанныеПоручения)
	
	Сумма = ДанныеПоручения.Сумма;
	
	Возврат Сумма;
КонецФункции

&НаСервере
Процедура ЗаполнитьДату(Текст, ЗаполняемаяДата, Префикс)
	
	Если ЗначениеЗаполнено(ЗаполняемаяДата) Тогда
		ЗаполняемаяДатаТекст = Формат(ЗаполняемаяДата, "ДФ=dd.MM.yyyy");
	Иначе
		ЗаполняемаяДатаТекст = "";
	КонецЕсли;
	
	Текст = СтрЗаменить(Текст, "[" + Префикс + "Д1]", Сред(ЗаполняемаяДатаТекст, 1, 1));
	Текст = СтрЗаменить(Текст, "[" + Префикс + "Д2]", Сред(ЗаполняемаяДатаТекст, 2, 1));
	Текст = СтрЗаменить(Текст, "[" + Префикс + "М1]", Сред(ЗаполняемаяДатаТекст, 4, 1));
	Текст = СтрЗаменить(Текст, "[" + Префикс + "М2]", Сред(ЗаполняемаяДатаТекст, 5, 1));
	Текст = СтрЗаменить(Текст, "[" + Префикс + "Г1]", Сред(ЗаполняемаяДатаТекст, 7, 1));
	Текст = СтрЗаменить(Текст, "[" + Префикс + "Г2]", Сред(ЗаполняемаяДатаТекст, 8, 1));
	Текст = СтрЗаменить(Текст, "[" + Префикс + "Г3]", Сред(ЗаполняемаяДатаТекст, 9, 1));
	Текст = СтрЗаменить(Текст, "[" + Префикс + "Г4]", Сред(ЗаполняемаяДатаТекст, 10, 1));
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНезаполненныеПараметры(Текст)
	
	ПараметрыСтрокой = "КодДепонента, НаименованиеДепонента, КодСчетаДепо, КодРазделаСчетаДепо, НаименованиеКонтрагента, "
	+ "НомерСчетаДепоКонтрагента, КодРазделаСчетаДепоКонтрагента, НаименованиеКлиентаКонтрагента, КодСчетаДепоКлиентаКонтрагента, "
	+ "Референс, Сумма, СуммаПрописью, Валюта, УполномоченноеЛицо, ЛицоДействующееОтИмениУполномоченногоЛица, "
	+ "Основание, ДопИнформация, НомерСтрокиЦБ, ISIN, НаименованиеЦБ, НомерРегистрации, КоличествоЦБ, КоличествоЦБПрописью, "
	+ "ЭтоПеревод, ЭтоЗачисление, ЭтоСписание, ЭтоБлокировка, ЭтоРазблокировка, СвободнаяСделка, ПоставкаПротивПлатежа, "
	+ "МРДепозитарийНРБ, МРНРД, МРDTC, МРИное, МРРеестр, МРЕвроклир, МРКлирСтрим, МРЕвроклирFundsettle";
	
	Параметры = СтрРазделить(ПараметрыСтрокой, ", ", Ложь);
	Для Каждого Параметр Из Параметры Цикл
		Текст = СтрЗаменить(Текст, "[" + Параметр + "]", "");
	КонецЦикла;
	
	ЗаполнитьДату(Текст, "", "С");
	ЗаполнитьДату(Текст, "", "Р");
	ЗаполнитьДату(Текст, "", "П");
	
КонецПроцедуры

&НаСервере
Функция ОписаниеОснования(ДанныеПоручения)
	Результат = "";
	
	СКД = ДанныеПоручения.ВидПоручения.СхемаКомпоновкиДанных.Получить();
	Если СКД = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	НаборДанных = СКД.НаборыДанных.Найти("ТЧ_Документы");
	Если НаборДанных = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос(НаборДанных.Запрос);
	Запрос.УстановитьПараметр("Сделка", ДанныеПоручения.Поручение);
	Запрос.УстановитьПараметр("Дата", ДанныеПоручения.Дата);
	ДанныеОснований = Запрос.Выполнить().Выбрать();
	
	Пока ДанныеОснований.Следующий() Цикл
		Если ЗначениеЗаполнено(ДанныеОснований.НомерДокумента) Или ЗначениеЗаполнено(ДанныеОснований.ДатаДокумента) Тогда
			ВидДоговора = Справочники.КодыВидаДоговоровОснованийОперацийДКУ.НайтиПоКоду(ДанныеОснований.КодДокументаНРД);
			Результат = Результат + ?(ЗначениеЗаполнено(Результат), "; ", "");
			Результат = Результат
			+ СтрШаблон("%1 №%2 от %3", ВидДоговора, СокрЛП(ДанныеОснований.НомерДокумента), Формат(ДанныеОснований.ДатаДокумента, "ДЛФ=Д"));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ДопИнформация(ДанныеПоручения)
	ДокументЮрФизЛица =
	Справочники.ВидыИнвентарныхПоручений.ДанныеУдостоверяющихДокументовЮрФизЛица(ДанныеПоручения.ДепонентЮрФизЛицо);
	
	Если ТипЗнч(ДанныеПоручения.ДепонентЮрФизЛицо) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
		ТипДокумента = "свидетельство о регистрации";
	ИначеЕсли ДокументЮрФизЛица.ТипДокумента = "21" Тогда
		ТипДокумента = "паспорт";
	Иначе
		ТипДокумента = "";
	КонецЕсли;
	
	ТипСчетаДепоКонтрагента = ДанныеПоручения.ТипСчетаДепоКонтрагентаFCDR_2017_02;
	Результат = "Тип лицевого счета"
	+ ?(ЗначениеЗаполнено(ДанныеПоручения.НомерСчетаДепоКонтрагента), " " + ДанныеПоручения.НомерСчетаДепоКонтрагента, "")
	+ " в реестре" + ?(ЗначениеЗаполнено(ДанныеПоручения.МХКонтрагентНаименование), " " + ДанныеПоручения.МХКонтрагентНаименование, "")
	+ ?(ЗначениеЗаполнено(ТипСчетаДепоКонтрагента), "- " + ТипСчетаДепоКонтрагента, "") + ", "
	+ ?(ЗначениеЗаполнено(ТипДокумента), ТипДокумента + ":", "")
	+ ?(ЗначениеЗаполнено(ДокументЮрФизЛица.СерияДокумента), " " + ДокументЮрФизЛица.СерияДокумента, "")
	+ ?(ЗначениеЗаполнено(ДокументЮрФизЛица.НомерДокумента), " " + ДокументЮрФизЛица.НомерДокумента, "")
	+ ?(ЗначениеЗаполнено(ДокументЮрФизЛица.ДатаДокумента), ", дата документа: " + Формат(ДокументЮрФизЛица.ДатаДокумента, "ДЛФ=Д"), "")
	+ ?(ЗначениеЗаполнено(ДокументЮрФизЛица.ОрганРегистрации), " выдан: " + ДокументЮрФизЛица.ОрганРегистрации, "");
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьВидОперации(Текст, ДанныеПоручения)
	Если ДанныеПоручения.ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо
			Или ДанныеПоручения.ВидОперацииД = Справочники.ВидыОпераций.Перемещение Тогда
		Текст = СтрЗаменить(Текст, "[ЭтоПеревод]", "V");
	КонецЕсли;
	Если ДанныеПоручения.ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования
			Или ЭтоПоручениеНаПереводТипаСписание(ДанныеПоручения) Тогда
		Текст = СтрЗаменить(Текст, "[ЭтоСписание]", "V");
	КонецЕсли;
	Если ДанныеПоручения.ВидОперацииД = Справочники.ВидыОпераций.Депонирование
			Или ЭтоПоручениеНаПереводТипаЗачисление(ДанныеПоручения) Тогда
		Текст = СтрЗаменить(Текст, "[ЭтоЗачисление]", "V");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМестоРасчетов(Текст, ДанныеПоручения)
	
	МХКонтрагентКод = СокрЛП(ДанныеПоручения.МХКонтрагентКод);
	
	Если ЭтоРеестр(ДанныеПоручения) Тогда
		Текст = СтрЗаменить(Текст, "[МРРеестр]", "V");
	ИначеЕсли ДанныеПоручения.ЭтоКлиентИзГруппыДепоненты Тогда
		Текст = СтрЗаменить(Текст, "[МРДепозитарийНРБ]", "V");
	ИначеЕсли МХКонтрагентКод = "НРД" Тогда
		Текст = СтрЗаменить(Текст, "[МРНРД]", "V");
	ИначеЕсли МХКонтрагентКод = "DTC" Тогда
		Текст = СтрЗаменить(Текст, "[МРDTC]", "V");
	ИначеЕсли МХКонтрагентКод = "MGTCBEBE" Тогда
		Текст = СтрЗаменить(Текст, "[МРЕвроклир]", "V");
	ИначеЕсли МХКонтрагентКод = "CEDELULL" Тогда
		Текст = СтрЗаменить(Текст, "[МРКлирстрим]", "V");
	Иначе
		Текст = СтрЗаменить(Текст, "[МРИное]", "V");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипРасчетов(Текст, ДанныеПоручения)
	
	Если ЗначениеЗаполнено(ДанныеПоручения.ВидИсполненияDVP) Тогда
		Текст = СтрЗаменить(Текст, "[ПоставкаПротивПлатежа]", "V");
	Иначе
		Текст = СтрЗаменить(Текст, "[СвободнаяСделка]", "V");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДанныеУполномоченногоЛица(ДанныеПоручения)
	Результат = Новый Структура("НаименованиеОрганизации, ОтветственноеЛицо", "", "");
	
	Организация = ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию();
	ОтветственныеЛица = ОбщегоНазначения.ОтветственныеЛица(Организация, ДанныеПоручения.Дата);
	Если ЗначениеЗаполнено(ОтветственныеЛица.ГенеральныйДиректорФИО)
		И ЗначениеЗаполнено(ОтветственныеЛица.ГенеральныйДиректорФИО.Фамилия) Тогда
		ПредставлениеОтветственногоЛица = ОтветственныеЛица.ГенеральныйДиректорФИО.Фамилия + " "
		+ ОтветственныеЛица.ГенеральныйДиректорФИО.Имя + " "
		+ ОтветственныеЛица.ГенеральныйДиректорФИО.Отчество;
	ИначеЕсли ЗначениеЗаполнено(ОтветственныеЛица.ГенеральныйДиректор) Тогда
		ПредставлениеОтветственногоЛица = ОтветственныеЛица.ГенеральныйДиректор;
	Иначе
		ПредставлениеОтветственногоЛица = "";
	КонецЕсли;
	
	Результат.НаименованиеОрганизации = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "Наименование"));
	Результат.ОтветственноеЛицо = ПредставлениеОтветственногоЛица;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ЭтоПоручениеНаПереводТипаСписаниеНовогоОбразца(ДанныеПоручения)
	Возврат (ДанныеПоручения.ВидОперацииД = Справочники.ВидыОпераций.Перевод 
				И ДанныеПоручения.ТипПеревода = Перечисления.ТипыПереводов.Списание);
КонецФункции

&НаСервере
Функция ЭтоПоручениеНаПереводТипаСписаниеСтарогоОбразца(ДанныеПоручения)
	Возврат (ДанныеПоручения.ВидОперацииД = Справочники.ВидыОпераций.Перевод
				И Не ЗначениеЗаполнено(ДанныеПоручения.ТипПеревода)
				И ДанныеПоручения.ИнициаторомЯвляетсяДепонент);
КонецФункции

&НаСервере
Функция ЭтоПоручениеНаПереводТипаЗачислениеНовогоОбразца(ДанныеПоручения)
	Возврат (ДанныеПоручения.ВидОперацииД = Справочники.ВидыОпераций.Перевод
				И ДанныеПоручения.ТипПеревода = Перечисления.ТипыПереводов.Зачисление);
КонецФункции

&НаСервере
Функция ЭтоПоручениеНаПереводТипаЗачислениеСтарогоОбразца(ДанныеПоручения)
	Возврат (ДанныеПоручения.ВидОперацииД = Справочники.ВидыОпераций.Перевод
				И Не ЗначениеЗаполнено(ДанныеПоручения.ТипПеревода)
				И ДанныеПоручения.ИнициаторомЯвляетсяКонтрагент);
КонецФункции

&НаСервере
Функция ЭтоПоручениеНаПереводТипаСписание(ДанныеПоручения)
	Возврат ЭтоПоручениеНаПереводТипаСписаниеНовогоОбразца(ДанныеПоручения)
				Или ЭтоПоручениеНаПереводТипаСписаниеСтарогоОбразца(ДанныеПоручения);
КонецФункции

&НаСервере
Функция ЭтоПоручениеНаПереводТипаЗачисление(ДанныеПоручения)
	Возврат ЭтоПоручениеНаПереводТипаЗачислениеНовогоОбразца(ДанныеПоручения)
				Или ЭтоПоручениеНаПереводТипаЗачислениеСтарогоОбразца(ДанныеПоручения);
КонецФункции

&НаСервере
Функция ИмяМакетаПриложения06(Поручение)
	
	ДатаПоручения = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Поручение, "Дата");
	ДатаРедакцииПечатнойФормыБезНомераТелефона = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра(
		"3105.ДатаПереходаНаПечатнуюФормуПоручения_06_БезНомераТелефона", Дата(1, 1, 1));
	
	Если ДатаПоручения < ДатаРедакцииПечатнойФормыБезНомераТелефона Тогда
		ИмяМакета = "Макет_06_2023";
	Иначе
		ИмяМакета = "Макет_06_20250902";
	КонецЕсли;
	Возврат ИмяМакета;
КонецФункции