#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиОбработки = Неопределено;
	Если ТипЗнч(Параметры.НастройкиАлгоритма) = Тип("Структура") тогда
		НастройкиОбработки = Параметры.НастройкиАлгоритма;
	Иначе
		ДопОбработка = Неопределено;
		Если Параметры.Свойство("ДополнительнаяОбработкаСсылка", ДопОбработка) Тогда
			НастройкиОбработки = Справочники.ДополнительныеОтчетыИОбработки.НастройкиОбработки(ДопОбработка);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиОбработки) Тогда
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.УстановитьПользовательскиеНастройки(НастройкиОбработки);
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	Заголовок = "";
	ЗначенияПараметров = УстановитьПараметры(Заголовок);
	ОповеститьОВыборе(новый Структура("Значения,ЗаголовокНастроек", ЗначенияПараметров,Заголовок));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция УстановитьПараметры(Заголовок)
	
	Значения = Новый Структура;
	Значения.Вставить("Пул", Объект.Пул);
	Значения.Вставить("ПериодОхлажденияДней", Объект.ПериодОхлажденияДней);
	Значения.Вставить("ПроцентВознаграждения", Объект.ПроцентВознаграждения);
	Значения.Вставить("НастройкаРасчета", XMLСтрока(Новый ХранилищеЗначения(Объект.НастройкаРасчета.Выгрузить())));
	Значения.Вставить("ПочтовыйЛогин", Объект.ПочтовыйЛогин);
	Значения.Вставить("СписокРассылки", XMLСтрока(Новый ХранилищеЗначения(Объект.СписокРассылки.Выгрузить())));
	
	Представление = ?(ЗначениеЗаполнено(Объект.Пул),"Settings have been set:"+Объект.Пул,"");
	
	Заголовок = Представление;
	Заголовок = СокрЛП(Заголовок);

	Возврат Значения;

КонецФункции

#КонецОбласти


