
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Для Каждого ПараметрКоманды ИЗ ПараметрКоманды Цикл
		Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Отправка уведомления возможна только для записанного документа.");
			Продолжить;
		КонецЕсли;
		ВариантОтправки = ВариантОтправкиУведомленияОКД(ПараметрКоманды);
		Если ВариантОтправки = "" Тогда 
			ОбщегоНазначения.СообщитьОбОшибке("Отправка уведомления о КД: " + СокрЛП(ПараметрКоманды.Ссылка) + ". Для данного вида КД отправка уведомления не требуется");
			Продолжить;
		КонецЕсли;
		Если НЕ ВсеДанныеЗаполненыКорректно(ПараметрКоманды) Тогда
			Продолжить;
		КонецЕсли;
		Если ПараметрКоманды.УведомлениеОтправлено Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Отправка уведомления о КД: " + СокрЛП(ПараметрКоманды.Ссылка) + ". Уведомление было отправлено ранее");
			Продолжить;
		Иначе 
			ПередатьУведомлениеОКДНаСервере(ПараметрКоманды, ВариантОтправки);
		КонецЕсли;
		
		Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
			Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Документ.КорпоративноеДействие_Новый.Форма.ФормаДокумента" Тогда
				ПараметрыВыполненияКоманды.Источник.Прочитать();
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ВариантОтправкиУведомленияОКД(ДокументКД)
	Если Документы.КорпоративноеДействие_Новый.ЭтоВидКДВыкупа(ДокументКД.ВидКД) Тогда
		Возврат "Выкуп";
	ИначеЕсли Документы.КорпоративноеДействие_Новый.ЭтоВидКДСобрания(ДокументКД.ВидКД) Тогда
		Возврат "Собрание";		
	КонецЕсли;
	Возврат "";
КонецФункции

&НаСервере
Процедура ПередатьУведомлениеОКДНаСервере(ДокументКД, ВариантОтправки)
	
	ДокументОбъект = ДокументКД.ПолучитьОбъект();
	Попытка
		ДокументОбъект.УведомлениеОтправлено = Истина;
		ДокументОбъект.ПередатьУведомлениеОКД(ВариантОтправки);
	Исключение
		ДокументОбъект.УведомлениеОтправлено = Ложь;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации("Отправка уведомления о КД", УровеньЖурналаРегистрации.Ошибка,,ДокументКД,ПодробноеПредставлениеОшибки);
	КонецПопытки; 
	
	Если ДокументОбъект.УведомлениеОтправлено Тогда
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Уведомление по документу " + СокрЛП(ДокументОбъект.Ссылка) + " отправлено");
	Иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось отправить уведомление по документу " + СокрЛП(ДокументОбъект.Ссылка));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВсеДанныеЗаполненыКорректно(ДокументКД)
	МассивСообщенийОбОшибкеЗаполнения = Новый Массив;
	Документы.КорпоративноеДействие_Новый.ПроверитьКорректностьВводаРаскрытияСпискаВладельцев(ДокументКД, МассивСообщенийОбОшибкеЗаполнения);
	Документы.КорпоративноеДействие_Новый.ПроверитьДостаточностьДанныхДляОтправкиУведомлений(ДокументКД, МассивСообщенийОбОшибкеЗаполнения);
	Если МассивСообщенийОбОшибкеЗаполнения.Количество() > 0 Тогда 
		ОбщегоНазначения.СообщитьОбОшибке("Отправка уведомления о КД: " + СокрЛП(ДокументКД.Ссылка) + ". Действие отменено:");
		Для каждого СтрокаОшибки из МассивСообщенийОбОшибкеЗаполнения Цикл
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаОшибки);
		КонецЦикла;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции