#Область ЭкспортныеПроцедурыИФункции

// Определяет есть ли у данного контрагента действующие депозитарные или междепозитарные договоры
// Параметры:
//	Клиент - СправочникСсылка.Контрагенты
// Возвращаемое значение:
//	Булево
Функция ЯвляетсяДепонентом(Клиент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Клиент
	|	И ДоговорыКонтрагентов.ТипДоговора В (&ТипыДоговоровДепонента)
	|	И (ДоговорыКонтрагентов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|		ИЛИ ДоговорыКонтрагентов.ДатаОкончанияДействия > &ТекущаяДата)
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()) );
	Запрос.УстановитьПараметр("ТипыДоговоровДепонента", ТипыДоговоровДепонента());
	
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

// (Устаревшая) Возвращает ClientId данного клиента используемый в СУДК
// Параметры:
//	Клиент - СправочникСсылка.Контрагенты
// Возвращаемое значение:
//	Строка
Функция ClientId(Клиент) Экспорт
	ClientId = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КодыЗагрузкиКлиента.Код КАК ClientId
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузкиКлиента
	|ГДЕ
	|	КодыЗагрузкиКлиента.Владелец = &Клиент
	|	И НЕ КодыЗагрузкиКлиента.ПометкаУдаления
	|	И КодыЗагрузкиКлиента.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.Клиенты)
	|	И (КодыЗагрузкиКлиента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1,1,1)
	|		ИЛИ КодыЗагрузкиКлиента.ДатаОкончанияДействия > &ТекущаяДата)
	|";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ClientId = Выборка.ClientId;
	КонецЕсли;
	
	Возврат ClientId;
КонецФункции

// (Устаревшая) Возвращает клиента по ClientId
// Параметры:
//	ClientId - Строка
// Возвращаемое значение:
//	СправочникСсылка.Контрагенты - или неопределено если не удалось найти клиента
Функция КлиентПоClientId(ClientId) Экспорт
	Клиент = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КодыЗагрузки.Владелец КАК Клиент
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	КодыЗагрузки.Код = &ClientId
	|	И КодыЗагрузки.Владелец ССЫЛКА Справочник.Контрагенты
	|	И КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.Клиенты)
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|	И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ТекущаяДата)";
	Запрос.УстановитьПараметр("ClientId", ClientId);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Клиент = Выборка.Клиент;
	КонецЕсли;
	
	Возврат Клиент;
КонецФункции

// Возвращает клиента по Коду
// Параметры:
//	Код - Строка
// Возвращаемое значение:
//	Контрагент - СправочникСсылка.Контрагенты - или неопределено, если не удалось найти контрагента
Функция КонтрагентПоКоду(Код) Экспорт
	Контрагент = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Код = &Код";
	Запрос.УстановитьПараметр("Код", Код);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Контрагент = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Контрагент;
КонецФункции

// Возвращает массив типов договоров депонента
//
// Возвращаемое значение:
//	Массив
Функция ТипыДоговоровДепонента() Экспорт
	ТипыДоговоровДепонента = Новый Массив;
	
	ТипыДоговоровДепонента.Добавить(Перечисления.ТипыДоговоров.Депозитарный);
	ТипыДоговоровДепонента.Добавить(Перечисления.ТипыДоговоров.МежДепозитарный);
	
	Возврат ТипыДоговоровДепонента;
КонецФункции

// Возвращает Контрагента по юр. физ. лицу
//
// Параметры:
//  ЮридическиеФизическиеЛица	 - СправочникСсылка.ЮридическиеЛица, СправочникСсылка.ФизическиеЛица - ссылка на юр. физ. лицо
//  ПриоритетЭмитентов			 - Булево	 - Если найдено несколько контрагентов, то приоритет для того который в папке Эмитенты
// 
// Возвращаемое значение:
//   - СправочникСсылка.Контрагент - Найденный контрагент. Если не найдено - то пустая ссылка.
//
Функция КонтрагентПоЮрФизЛицу(ЮридическиеФизическиеЛица, Знач ПриоритетЭмитентов = Неопределено) Экспорт
	
	Если ПриоритетЭмитентов = Неопределено Тогда
		Если ТипЗнч(ЮридическиеФизическиеЛица) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ПриоритетЭмитентов = Ложь;
		Иначе
			ПриоритетЭмитентов = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Контрагенты.Родитель = &Эмитенты
	|			ТОГДА &ПриоритетЭмитентов
	|		ИНАЧЕ НЕ &ПриоритетЭмитентов
	|	КОНЕЦ КАК Приоритет,
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ПометкаУдаления
	|	И Контрагенты.ЮридическиеФизическиеЛица = &ЮридическиеФизическиеЛица
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ";
	
	Запрос.УстановитьПараметр("ПриоритетЭмитентов", ПриоритетЭмитентов);
	Запрос.УстановитьПараметр("ЮридическиеФизическиеЛица", ЮридическиеФизическиеЛица);
	Запрос.УстановитьПараметр("Эмитенты", Справочники.Контрагенты.Эмитенты);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Контрагент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Контрагент;
	
КонецФункции

// Возвращает клиента по CrmContractNumber
// Параметры:
//	CrmContractNumber - Строка - Номер договора из CRM
// Возвращаемое значение:
//	СправочникСсылка.Контрагенты - или неопределено если не удалось найти клиента
Функция КлиентПоCrmContractNumber(CrmContractNumber) Экспорт
	Клиент = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КодыЗагрузки.Владелец КАК Клиент
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	КодыЗагрузки.Код = &CrmContractNumber
	|	И КодыЗагрузки.Владелец ССЫЛКА Справочник.Контрагенты
	|	И КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.CrmContractNumber)
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА КодыЗагрузки.ДатаОкончанияДействия > &ТекущаяДата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("CrmContractNumber", CrmContractNumber);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Клиент = Выборка.Клиент;
	КонецЕсли;
	
	Возврат Клиент;
КонецФункции

// Возвращает признак эмитента по юр. физ. лицу
//
// Параметры:
//  ЮридическиеФизическиеЛица	 - СправочникСсылка.ЮридическиеЛица, СправочникСсылка.ФизическиеЛица - ссылка на юр. физ. лицо
// 
// Возвращаемое значение:
//   - Булево - Истина, если это только эмитент
//
Функция ЯвляетсяЭмитентом(ЮридическиеФизическиеЛица) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(МИНИМУМ(Контрагенты.Родитель = &Эмитенты), ЛОЖЬ) КАК ЭтоЛицоЭмитент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ПометкаУдаления
	|	И Контрагенты.ЮридическиеФизическиеЛица = &ЮридическиеФизическиеЛица";
	
	Запрос.УстановитьПараметр("ЮридическиеФизическиеЛица", ЮридическиеФизическиеЛица);
	Запрос.УстановитьПараметр("Эмитенты", Справочники.Контрагенты.Эмитенты);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.ЭтоЛицоЭмитент;
	
КонецФункции

// Функция - Является контрагентом
// Проверяет является ли клиент контрагентом
// Параметры:
//  Клиент	 - СправочникСсылка.Контрагенты - Клиент
// 
// Возвращаемое значение:
//   - Булево - Истина, если это Контрагент
//
Функция ЯвляетсяКонтрагентом(Клиент) Экспорт
	
	Возврат Клиент.ПринадлежитЭлементу(Справочники.Контрагенты.НайтиПоКоду("Контрагент"));
	
КонецФункции

// Возвращает Контрагентов по юр. физ. лицу \ лицам
//
// Параметры:
//  ЮридическиеФизическиеЛица	 - Массив, СправочникСсылка.ЮридическиеЛица, СправочникСсылка.ФизическиеЛица - массив\ссылка на юр. физ. лицо
//  КромеКонтрагентов			 - Массив - Контрагенты или группы контрагентов, исключаемые из поиска
// 
// Возвращаемое значение:
//   - Массив - Найденные контрагенты.
//
Функция КонтрагентыПоЮрФизЛицам(ЮридическиеФизическиеЛица, КромеКонтрагентов = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ПоВсемКонтрагентам
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ Контрагенты.Ссылка В ИЕРАРХИИ (&КромеКонтрагентов)
	|		КОНЕЦ
	|	И Контрагенты.ЮридическиеФизическиеЛица В(&ЮридическиеФизическиеЛица)";
	
	Если ЗначениеЗаполнено(КромеКонтрагентов) Тогда
		Запрос.УстановитьПараметр("ПоВсемКонтрагентам", Ложь);
	Иначе
		Запрос.УстановитьПараметр("ПоВсемКонтрагентам", Истина);
	КонецЕсли;
	Запрос.УстановитьПараметр("КромеКонтрагентов", КромеКонтрагентов);
	Если ТипЗнч(ЮридическиеФизическиеЛица) = Тип("Массив") Тогда
		Запрос.УстановитьПараметр("ЮридическиеФизическиеЛица", ЮридическиеФизическиеЛица);
	Иначе
		Запрос.УстановитьПараметр("ЮридическиеФизическиеЛица", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЮридическиеФизическиеЛица));
	КонецЕсли;
	
	Контрагенты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");
	
	Возврат Контрагенты;
	
КонецФункции

// Функция - Эмитенты ценных бумаг
// Возвращает массив эмитентов передаваемых ценных бумаг
// Параметры:
//  ЦенныеБумаги - Массив, СправочникСсылка.ЦенныеБумаги - Массив ценных бумаг по которым надо определить эмитента
// 
// Возвращаемое значение:
//   - Массив, СправочникСсылка.Контрагенты
//
Функция ЭмитентыЦенныхБумаг(ЦенныеБумаги) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦенныеБумаги.Эмитент КАК Эмитент
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|ГДЕ
	|	ЦенныеБумаги.Ссылка В(&ЦенныеБумаги)";
	Запрос.УстановитьПараметр("ЦенныеБумаги", ЦенныеБумаги);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Эмитент");
	
КонецФункции

// Возвращает клиента по CrmContractNumber
// Параметры:
//	Клиент - СправочникСсылка.Контрагенты
// Возвращаемое значение:
//	Строка - Номер договора из CRM или неопределено если не удалось найти CrmContractNumber
Функция CrmContractNumberПоКлиенту(Клиент) Экспорт
	CrmContractNumber = Неопределено;
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КодыЗагрузки.Код КАК CrmContractNumber
		|ИЗ
		|	Справочник.КодыЗагрузки КАК КодыЗагрузки
		|ГДЕ
		|	КодыЗагрузки.Владелец = &Клиент
		|	И КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.CrmContractNumber)
		|	И НЕ КодыЗагрузки.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА КодыЗагрузки.ДатаОкончанияДействия > &ТекущаяДата
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
		Запрос.УстановитьПараметр("Клиент", Клиент);
		Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			CrmContractNumber = Выборка.CrmContractNumber;
		КонецЕсли;
	КонецЕсли;
	
	Возврат CrmContractNumber;
КонецФункции

// Функция возвращает настройки для отправки отчетов в Kafka по заданному способу отправки
//
// Параметры:
//  СпособОтправкиОтчетов	 - ПеречислениеСсылка.СпособыОтправкиОтчетов - Способ отправки отчетов
// 
// Возвращаемое значение:
//  Структура:
//      * Сущность - Строка - сущность для передачи в Kafka
//      * ВнешнийИсточник - ПланыВидовХарактеристикСсылка.ВнешниеИсточники - топик для передачи в Kafka
//
Функция НастройкиОтправкиОтчетовПоСпособуОтправки(СпособОтправкиОтчетов) Экспорт
	НастройкиОтправкиОтчетов = Новый Структура("Сущность, ВнешнийИсточник");
	Если ЗначениеЗаполнено(СпособОтправкиОтчетов) Тогда
		Если СпособОтправкиОтчетов = Перечисления.СпособыОтправкиОтчетов.EmailКлиента Тогда
			НастройкиОтправкиОтчетов.Сущность = "Email";
			НастройкиОтправкиОтчетов.ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaEmail;
		ИначеЕсли СпособОтправкиОтчетов = Перечисления.СпособыОтправкиОтчетов.EmailCustody Тогда
			НастройкиОтправкиОтчетов.Сущность = "EmailGen";
			НастройкиОтправкиОтчетов.ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaEmailGen;
		ИначеЕсли СпособОтправкиОтчетов = Перечисления.СпособыОтправкиОтчетов.МП Тогда
			НастройкиОтправкиОтчетов.Сущность = "Document";
			НастройкиОтправкиОтчетов.ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaFileExchangeIn;
		Иначе
			ВызватьИсключение "Не удалось определить настройки отправки отчетов по способу отправки!";
		КонецЕсли;
	Иначе
		ВызватьИсключение "Не заполнен ""Способ отправки отчетов""!";
	КонецЕсли;
	Возврат НастройкиОтправкиОтчетов;
КонецФункции

// Функция - Особые условия
//
// Параметры:
//  Контрагент	 - СправочникСсылка.Контрагенты, Массив - Контрагент
//  ВозвращатьМассивКонтрагентов - Булево - Возвращать массив клиентов с ограничениями или просто булево что они есть
// 
// Возвращаемое значение:
//   - Булево, Массив - Истина, если у Контрагента особые условия или Массив Справочник.Контрагенты с особыми условиями
//
Функция ОсобыеУсловия(Контрагент, ВозвращатьМассивКонтрагентов = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В(&Ссылка)
	|	И Контрагенты.ЮридическиеФизическиеЛица.ОсобыеУсловия";
	
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОсобыеКонтрагенты = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ОсобыеКонтрагенты.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Если ВозвращатьМассивКонтрагентов Тогда
		Возврат ОсобыеКонтрагенты;
	Иначе
		Возврат ОсобыеКонтрагенты.Количество() > 0;
	КонецЕсли;
	
КонецФункции

// Функция возвращает ссылку на группу Контрагенты
// Возвращаемое значение:
//	- СправочникСсылка.Контрагенты
Функция ГруппаКонтрагенты() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЭтоГруппа
	|	И Контрагенты.Наименование = ""Контрагенты""
	|	И НЕ Контрагенты.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ГруппаКонтрагенты = Выборка.Ссылка;
	Иначе
		ОписаниеОшибки = "В справочнике Депоненты/Контрагенты не удалось найти группу с названием ""Контрагенты""";
		ЗаписьЖурналаРегистрации("Поиск группы ""Контрагенты""", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		ГруппаКонтрагенты = Неопределено;
	КонецЕсли;
	
	Возврат ГруппаКонтрагенты;
КонецФункции

#КонецОбласти