
Перем ТаблицаСверки;
Перем АДО;

Процедура ВыполнитьСверку() Экспорт
	
	ТаблицаСверки = СоздатьТаблицуСверкиНаСервере();
	
	ДобавитьВнешниеДанные();
	
	ДобавитьДанныеИзДепозитария();
	
	СформироватьОтчет();
	
КонецПроцедуры

Процедура СформироватьОтчет()
	
	Если ВариантСверки = "ДепозитарийБэкофис" Тогда
		
		Дерево = ДанныеЗапросаСверкиПоКлиентам();
		ЕстьРасхождение = (Дерево.Количество() > 0);
		ВывестиДанныеПоКлиентам(Дерево, ЭтотОбъект.Результат);
		
	ИначеЕсли ВариантСверки = "ДепозитарийНРД" Тогда
		
		Дерево = ДанныеЗапросаСверкиПоЦБ();
		ЕстьРасхождение = (Дерево.Количество() > 0);
		ВывестиДанныеПоЦБ(Дерево, ЭтотОбъект.Результат);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьВнешниеДанные()
	
	Если ЭтотОбъект.ВариантСверки = "ДепозитарийБэкофис" Тогда
		
		ДобавитьДанныеИзБэкофиса();	
		
	Иначе
		
		Если ЭтотОбъект.ИсточникДанныхДепозитария = "ФайловыйШлюз" Тогда
			
			ДобавитьДанныеИзФайловогоШлюза();
			
		Иначе
			
			ДобавитьДанныеИзФайловНРД();
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция СоздатьТаблицуСверкиНаСервере()
	
	ТипыЗначений = СоздатьТипыЗначений();
	
	Возврат СоздатьТаблицу(ТипыЗначений); 
	
КонецФункции

Функция СоздатьТипыЗначений()
	
	ТипыЗначений = Новый Структура;
	ТипыЗначений.Вставить("ОписаниеТиповСтрока3",   Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(3, ДопустимаяДлина.Переменная)));
	ТипыЗначений.Вставить("ОписаниеТиповСтрока12",  Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(12, ДопустимаяДлина.Переменная)));
	ТипыЗначений.Вставить("ОписаниеТиповСтрока17",  Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(17, ДопустимаяДлина.Переменная)));
	ТипыЗначений.Вставить("ОписаниеТиповСтрока20",  Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
	ТипыЗначений.Вставить("ОписаниеТиповСтрока30",  Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30, ДопустимаяДлина.Переменная)));
	ТипыЗначений.Вставить("ОписаниеТиповСтрока50",  Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50, ДопустимаяДлина.Переменная)));
	ТипыЗначений.Вставить("ОписаниеТиповСтрока99",  Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(99, ДопустимаяДлина.Переменная)));
	ТипыЗначений.Вставить("ОписаниеТиповОстаткиЦБ", Метаданные.ОпределяемыеТипы.КоличествоЦБ.Тип);
	
	Возврат ТипыЗначений;
	
КонецФункции

Функция СоздатьТаблицу(ТипыЗначений)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("НомерСчетаДепо",			ТипыЗначений.ОписаниеТиповСтрока12,  "Номер счета депо");
	ТЗ.Колонки.Добавить("НомерРазделаСчетаДепо",	ТипыЗначений.ОписаниеТиповСтрока17,  "Номер раздела счета депо");
	ТЗ.Колонки.Добавить("КодНРД",					ТипыЗначений.ОписаниеТиповСтрока50,  "Код НРД");
	ТЗ.Колонки.Добавить("ОстатокВнешнегоИсточника",	ТипыЗначений.ОписаниеТиповОстаткиЦБ, "Остаток во внешнем источнике");
	ТЗ.Колонки.Добавить("ОстатокДепо",				ТипыЗначений.ОписаниеТиповОстаткиЦБ, "Остаток в Депозитарии");
	ТЗ.Колонки.Добавить("ЦеннаяБумагаНаименование",	ТипыЗначений.ОписаниеТиповСтрока50,  "Наименование ценной бумаги");
	ТЗ.Колонки.Добавить("НомерРегистрации",			ТипыЗначений.ОписаниеТиповСтрока50,  "Номер гос. регистрации");
	ТЗ.Колонки.Добавить("КодКлиента",				ТипыЗначений.ОписаниеТиповСтрока99,  "Код клиента");
	ТЗ.Колонки.Добавить("КодСубклиента",			ТипыЗначений.ОписаниеТиповСтрока3,   "Код субклиента");
	ТЗ.Колонки.Добавить("ISIN",						ТипыЗначений.ОписаниеТиповСтрока30,  "ISIN");
	Если ВариантСверки = "ДепозитарийБэкофис" Тогда // BSLLS:Typo-off
		ТЗ.Колонки.Добавить("СчетДепоДепонента",	ТипыЗначений.ОписаниеТиповСтрока12,  "Счет депо Депонента");
	КонецЕсли;
	Возврат ТЗ
	
КонецФункции

Процедура ДобавитьДанныеИзФайловНРД()
	
	ФайлыНРД = ФайлыНРДВКлиентскихПапках(ЭтотОбъект.КаталогФайлов, ЭтотОбъект.ДатаСверки);
	
	НайденоФайлов = ФайлыНРД.Количество();
	Если НайденоФайлов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеЯчейкиПервойКолонки = "";
	ЗначениеЯчейкиВторойКолонки = "";
	
	Для СчетчикФайлов = 0 По (НайденоФайлов - 1) Цикл
		ВременныйФайл = ПолучитьИмяВременногоФайла("XLS");
		ФайлНРД = ФайлыНРД.Получить(СчетчикФайлов);
		ИмяФайлаНРД = ФайлНРД.Имя;
		
		Попытка
			КопироватьФайл(ФайлНРД.ПолноеИмя, ВременныйФайл);
		Исключение
			ВызватьИсключение ("Ошибка открытия файла " + ИмяФайлаНРД + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
		Попытка
			ДанныеФайла = Новый ТабличныйДокумент;
			ДанныеФайла.Прочитать(ВременныйФайл);
			УдалитьФайлы(ВременныйФайл);
		Исключение
			ВызватьИсключение ("Ошибка чтения из Excel" + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
		НомерСтроки = 1;
		ЗаполнитьЗначенияИзЯчеек(ДанныеФайла, НомерСтроки, ЗначениеЯчейкиПервойКолонки, ЗначениеЯчейкиВторойКолонки);
		
		// Определяем номер счета депо по заголовку
		Если СтрНайти(ЗначениеЯчейкиПервойКолонки, "Отчет/Выписка по счету") > 0 Тогда
			НомерСчетаДепо = Сред(ЗначениеЯчейкиПервойКолонки, 24, 12);
		Иначе
			// Если нет стандартного заголовка - ошибка
			ВызватьИсключение ("Ошибка формата файла " + ИмяФайлаНРД);
		КонецЕсли;
		
		ОбработкаФайлаСверкиНРД(НомерСчетаДепо, ИмяФайлаНРД, ДанныеФайла);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыделитьНомерРаздела(Знач Строка)
	
	Перем ДлинаНомераРазделаСчетаДепо;
	
	ДлинаНомераРазделаСчетаДепо = 17;
	
	Позиция = Найти (Строка, "Раздел счета депо");
	ПозицияДвоеточия = Найти (Строка, ":");
	Строка = СтрЗаменить(Строка, " ", Символы.ПС);
	ЧислоСтрок = СтрЧислоСтрок(Строка);
	Для НомерСтроки = 1 По ЧислоСтрок Цикл
		
		Подстрока = СокрЛП(СтрПолучитьСтроку(Строка, НомерСтроки));
		Если СтрДлина(Подстрока) = ДлинаНомераРазделаСчетаДепо Тогда
			Возврат Подстрока;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

// В каталоге Каталог ищет подкаталоги HL, TL, ML. В них ищет xls-файлы с именем в определенном формате (от даты).
//  Это и есть клиентские счета-файлы НРД.
//
// Параметры:
//  РодительскийКаталог	 - Строка	 - Каталог
//  День				 - Дата		 - День сверки
// 
// Возвращаемое значение:
//  массив - из значений типа Файл
//
Функция ФайлыНРДВКлиентскихПапках(РодительскийКаталог, День)
	
	ИменаКлиентскихКаталогов = Новый Массив;
	ИменаКлиентскихКаталогов.Добавить("HL");
	ИменаКлиентскихКаталогов.Добавить("TL");
	ИменаКлиентскихКаталогов.Добавить("ML");
	ИменаКлиентскихКаталогов.Добавить("L1");
	
	МаскаФайлов = Формат(День, "ДФ=""ддММгггг""") + "*.xls";
	
	ФайлыКлиентов = Новый Массив;
	
	// Найти все подкаталоги клиента
	Каталоги = НайтиФайлы(РодительскийКаталог, "*.*");
	Для Каждого Каталог Из Каталоги Цикл
		Если Каталог.ЭтоКаталог() И ИменаКлиентскихКаталогов.Найти(ВРЕГ(Каталог.Имя)) <> Неопределено Тогда
			// Собираем xls-файлы из этого клиентского каталога
			ФайлыНРД = НайтиФайлы(Каталог.ПолноеИмя, МаскаФайлов, Истина);
			Для Каждого ФайлНРД Из ФайлыНРД Цикл
				ФайлыКлиентов.Добавить(ФайлНРД);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ФайлыКлиентов;
	
КонецФункции

Процедура ДобавитьДанныеИзБэкофиса()
	
	ШаблонСообщенияОбОшибке = "";
	ДатаСверкиСтрокой = Формат(КонецДня(ДатаСверки) + 1, "ДФ='yyyy-MM-dd'");
	ВходныеПараметры = Новый Структура;
	ВходныеПараметры.Вставить("DateTimeReconciliation", ДатаСверкиСтрокой);
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.НРБСервисStoredProcSQL;
	
	База = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).База;
	Если Не ЗначениеЗаполнено(База) Тогда
		УровеньОшибка = УровеньЖурналаРегистрации.Предупреждение;
		ТекстСообщения = "Не найден внешний источник <<Сервис хранимых процедур НРБ>> для данной базы.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ЗаписьЖурналаРегистрации("СверкаЦБсНРДДепозитарий:BQ",
			УровеньОшибка, Метаданные.Отчеты.СверкаЦБсНРДДепозитарий, , ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Параметры = Неопределено;
	ВнешниеДанные.ДобавитьПараметрСоединения(Параметры, "ВнешнийИсточник", ВнешнийИсточник);
	
	Попытка
		ВнешниеДанные.ИнициироватьСоединение(АДО, "АДО", Параметры);
		ОстаткиBQ = АДО.ВыполнитьХранимуюПроцедуру("[Depo].[PositionForCompare]", ВходныеПараметры);
		
		Если Не ЗначениеЗаполнено(ОстаткиBQ) Тогда
			ШаблонСообщенияОбОшибке = "BQ: На дату сверки: %1 нет данных";
		Иначе
			ОстаткиBQ.Колонки.Добавить("CrmClientIdStr", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));
			Для Каждого ПриведениеТипа Из ОстаткиBQ Цикл
				ПриведениеТипа.CrmClientIdStr = "" + Формат(ПриведениеТипа.CrmClientId, "ЧН=Отсутствует; ЧГ=0");
			КонецЦикла;
		КонецЕсли;
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ШаблонСообщенияОбОшибке = "BQ: На дату сверки: %1 произошла ошибка: " + ТекстОшибки;
	КонецПопытки;
	Если ЗначениеЗаполнено(ШаблонСообщенияОбОшибке) Тогда
		ТекстСообщенияОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, ДатаСверкиСтрокой);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("втОстатки"		, ОстаткиBQ);
	Запрос.УстановитьПараметр("ВсеРазделы"		, ФильтрПоРазделамСчетовДепоМХЛокальный.Количество() = 0);
	РазделыМХ = Новый СписокЗначений;
	Для Каждого Фильтр Из ФильтрПоРазделамСчетовДепоМХЛокальный Цикл
		РазделыМХ.Добавить(СокрЛП(Фильтр.РазделСчетаДепоМХ.Код));
	КонецЦикла;
	Запрос.УстановитьПараметр("РазделыМХ"		, РазделыМХ);
	
	// BSLLS:LogicalOrInTheWhereSectionOfQuery-off
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(втОстатки.CrmClientIdStr КАК СТРОКА(20)) КАК CrmClientId,
	|	"""" КАК CrmSubClientId,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(втОстатки.NrdCode, """") КАК СТРОКА(20)) КАК NrdCode,
	|	ВЫРАЗИТЬ(втОстатки.Isin КАК СТРОКА(30)) КАК Isin,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(втОстатки.RegNum, """") КАК СТРОКА(50)) КАК RegNum,
	|	ВЫРАЗИТЬ(втОстатки.DepoAccount КАК СТРОКА(12)) КАК DepoAccount,
	|	ВЫРАЗИТЬ(втОстатки.DepoAccountSafeKeeping КАК СТРОКА(17)) КАК DepoAccountSafeKeeping,
	|	ВЫРАЗИТЬ(втОстатки.SubDepoAccountSafeKeeping КАК СТРОКА(17)) КАК SubDepoAccountSafeKeeping,
	|	ВЫРАЗИТЬ(втОстатки.Qty КАК ЧИСЛО(20, 7)) КАК Qty
	|ПОМЕСТИТЬ ОстаткиBQ
	|ИЗ
	|	&втОстатки КАК втОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиBQ.DepoAccountSafeKeeping КАК НомерСчетаДепо,
	|	ОстаткиBQ.SubDepoAccountSafeKeeping КАК НомерРазделаСчетаДепо,
	|	ОстаткиBQ.DepoAccount КАК СчетДепоДепонента,
	|	"""" КАК КодНРД,
	|	"""" КАК ЦеннаяБумагаНаименование,
	|	ОстаткиBQ.RegNum КАК НомерРегистрации,
	|	ОстаткиBQ.Isin КАК ISIN,
	|	ОстаткиBQ.CrmClientId КАК КодКлиента,
	|	ОстаткиBQ.CrmSubClientId КАК КодСубклиента,
	|	СУММА(ОстаткиBQ.Qty) КАК ОстатокВнешнегоИсточника
	|ИЗ
	|	ОстаткиBQ КАК ОстаткиBQ
	|ГДЕ
	|	(&ВсеРазделы
	|			ИЛИ ОстаткиBQ.SubDepoAccountSafeKeeping В (&РазделыМХ))
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиBQ.DepoAccountSafeKeeping,
	|	ОстаткиBQ.SubDepoAccountSafeKeeping,
	|	ОстаткиBQ.DepoAccount,
	|	ОстаткиBQ.RegNum,
	|	ОстаткиBQ.Isin,
	|	ОстаткиBQ.CrmClientId,
	|	ОстаткиBQ.CrmSubClientId
	|
	|ИМЕЮЩИЕ
	|	СУММА(ОстаткиBQ.Qty) <> 0";
	// BSLLS:LogicalOrInTheWhereSectionOfQuery-on
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		УровеньОшибка = УровеньЖурналаРегистрации.Предупреждение;
		ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ЗаписьЖурналаРегистрации("СверкаЦБсНРДДепозитарий:BQ",
			УровеньОшибка, Метаданные.Отчеты.СверкаЦБсНРДДепозитарий, , ТекстСообщения);
	КонецПопытки;
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаСверки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДанныеИзДепозитария() 
	
	ЭтоВариантСверкиДепозитарийНРД = ВариантСверки = "ДепозитарийНРД";
	
	Сообщение = Новый СообщениеПользователю;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ДатаСверкиНачалоСледующегоДня = КонецДня(ДатаСверки) + 1;
	Запрос.УстановитьПараметр("ДатаСверкиНачалоСледующегоДня", ДатаСверкиНачалоСледующегоДня);
	Запрос.УстановитьПараметр("НДЦ", Справочники.КлассификаторыЗагрузки.НДЦ());
	Запрос.УстановитьПараметр("НРД", Константы.МестоХраненияПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("Клиенты", Справочники.КлассификаторыЗагрузки.Клиенты);
	Запрос.УстановитьПараметр("CrmContractNumber", Справочники.КлассификаторыЗагрузки.CrmContractNumber);
	Запрос.УстановитьПараметр("ВсеРазделы", ФильтрПоРазделамСчетовДепоМХЛокальный.Количество() = 0);
	РазделыМХ = Новый СписокЗначений;
	Для Каждого Фильтр Из ФильтрПоРазделамСчетовДепоМХЛокальный Цикл
		РазделыМХ.Добавить(Фильтр.РазделСчетаДепоМХ);
	КонецЦикла;
	Запрос.УстановитьПараметр("РазделыМХ"		, РазделыМХ);
	
	Запрос.Текст = ТекстЗапросаКодыЗагрузкиКлиентов();
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаКодыЗагрузки();
	Запрос.Выполнить();
	
	Если ЭтоВариантСверкиДепозитарийНРД Тогда
		Запрос.Текст = ТекстЗапросаОстаткиНРД();
	Иначе
		Запрос.Текст = ТекстЗапросаОстаткиBQ();
	КонецЕсли;
	
	Запрос.Выполнить();
	
	Если ЭтоВариантСверкиДепозитарийНРД Тогда
		Запрос.Текст = ТекстЗапросаОстаткиЗаблокированныхЦБ();
		Запрос.Выполнить();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаПроверкаНаДублированиеКодовЗагрузки();
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ЭтоВариантСверкиДепозитарийНРД И Выборка.Количество() > 0 Тогда
		Сообщение.Текст = "Внимание! На " + Формат(ДатаСверки, "ДЛФ=ДД")
			+ " найдено более одного действующего кода загрузки НДЦ для ценных бумаг:";
		Пока Выборка.Следующий() Цикл
			Сообщение.Текст = Сообщение.Текст + Символы.ПС
				+ Выборка.Наименование + " Рег. номер: " + Выборка.НомерРегистрации;
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаПроверкаНаСуществованиеКодовЗагрузки();
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ЭтоВариантСверкиДепозитарийНРД И Выборка.Количество() > 0 Тогда
		Сообщение.Текст = Сообщение.Текст + Символы.ПС + "Внимание! На " + Формат(ДатаСверки, "ДЛФ=ДД")
			+ " нет действующего кода загрузки НДЦ для ценных бумаг:";
		Пока Выборка.Следующий() Цикл
			Сообщение.Текст = Сообщение.Текст + Символы.ПС
				+ Выборка.Наименование + " Рег. номер: " + Выборка.НомерРегистрации;
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтоВариантСверкиДепозитарийНРД Тогда
		Запрос.Текст = ТекстЗапросаИтоговыеОстаткиСУчетомЗаблокированныхЦБ();
	Иначе
		Запрос.Текст = ТекстЗапросаИтоговыеОстатки();
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаСверки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Сообщение.Текст) Тогда
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДанныеИзФайловогоШлюза()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиПоЦеннымБумагамНРД.СчетДепоМХ КАК НомерСчетаДепо,
		|	ОстаткиПоЦеннымБумагамНРД.РазделСчетаДепоМХ КАК НомерРазделаСчетаДепо,
		|	КодыЗагрузки.Ссылка КАК КодНРД,
		|	ОстаткиПоЦеннымБумагамНРД.ЦеннаяБумага.Наименование КАК ЦеннаяБумагаНиаменование,
		|	ОстаткиПоЦеннымБумагамНРД.ЦеннаяБумага.НомерРегистрации КАК НомерРегистрации,
		|	СУММА(ОстаткиПоЦеннымБумагамНРД.Количество) КАК ОстатокВнешнегоИсточника
		|ИЗ
		|	РегистрСведений.ОстаткиПоЦеннымБумагамНРД КАК ОстаткиПоЦеннымБумагамНРД
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
		|		ПО ОстаткиПоЦеннымБумагамНРД.ЦеннаяБумага = КодыЗагрузки.Владелец
		|			И (КодыЗагрузки.Биржа = &НДЦ)
		|			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > ОстаткиПоЦеннымБумагамНРД.Дата)
		|ГДЕ
		|	ОстаткиПоЦеннымБумагамНРД.Дата = &Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиПоЦеннымБумагамНРД.СчетДепоМХ,
		|	ОстаткиПоЦеннымБумагамНРД.РазделСчетаДепоМХ,
		|	КодыЗагрузки.Ссылка,
		|	ОстаткиПоЦеннымБумагамНРД.ЦеннаяБумага.Наименование,
		|	ОстаткиПоЦеннымБумагамНРД.ЦеннаяБумага.НомерРегистрации";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(ЭтотОбъект.ДатаСверки));
	Запрос.УстановитьПараметр("НДЦ", Справочники.КлассификаторыЗагрузки.НДЦ());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТаблицаСверки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаКодыЗагрузкиКлиентов()
	
	Возврат
	"ВЫБРАТЬ
	|	КодыЗагрузки.Владелец КАК ЮридическиеФизическиеЛицаПоКодуЗагрузки,
	|	КодыЗагрузки.Код КАК КодЗагрузкиКлиента
	|ПОМЕСТИТЬ втКодыЗагрузкиКлиентов
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	(КодыЗагрузки.Владелец ССЫЛКА Справочник.ФизическиеЛица
	|			ИЛИ КодыЗагрузки.Владелец ССЫЛКА Справочник.ЮридическиеЛица)
	|	И КодыЗагрузки.Биржа = &Клиенты
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КодыЗагрузки.ДатаОкончанияДействия >= &ДатаСверкиНачалоСледующегоДня
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЮридическиеФизическиеЛицаПоКодуЗагрузки";
	
КонецФункции

Функция ТекстЗапросаКодыЗагрузки()
	Возврат
	"ВЫБРАТЬ
	|	КодыЗагрузки.Владелец КАК ЦБ,
	|	КодыЗагрузки.Код КАК КодНРД
	|ПОМЕСТИТЬ втКодыЗагрузки
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	КодыЗагрузки.Владелец ССЫЛКА Справочник.ЦенныеБумаги
	|	И КодыЗагрузки.Биржа = &НДЦ
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|	И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ КодыЗагрузки.ДатаОкончанияДействия >= &ДатаСверкиНачалоСледующегоДня)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦБ;"
КонецФункции

Функция ТекстЗапросаОстаткиНРД()
	// BSLLS:JoinWithVirtualTable-off
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Остатки.ЦБ КАК ЦБ,
	|	Остатки.СчетДепоМХ.Код КАК НомерСчетаДепо,
	|	Остатки.РазделСчетаДепоМХ.Код КАК НомерРазделаСчетаДепо,
	|	ЕСТЬNULL(КодыЗагрузки.КодНРД, """") КАК КодНРД,
	|	ВЫБОР
	|		КОГДА Остатки.ЦБ.Дробная
	|				И Остатки.ЦБ.Числитель <> 0
	|			ТОГДА Остатки.КоличествоОстаток / Остатки.ЦБ.Числитель * Остатки.ЦБ.Знаменатель
	|		ИНАЧЕ Остатки.КоличествоОстаток
	|	КОНЕЦ КАК ОстатокДепо,
	|	Остатки.ЦБ.НомерРегистрации КАК НомерРегистрации,
	|	Остатки.ЦБ.ISIN КАК ISIN,
	|	Остатки.ЦБ.Наименование КАК ЦеннаяБумагаНаименование,
	|	"""" КАК КодКлиента,
	|	"""" КАК КодСубклиента
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(&ДатаСверкиНачалоСледующегоДня, СчетДепоМХ.Владелец = &НРД) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКодыЗагрузки КАК КодыЗагрузки
	|		ПО Остатки.ЦБ = КодыЗагрузки.ЦБ";
	// BSLLS:JoinWithVirtualTable-on
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОстаткиBQ()
	// BSLLS:JoinWithVirtualTable-off
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Остатки.ЦБ КАК ЦБ,
	|	Остатки.СчетДепоМХ.Код КАК НомерСчетаДепо,
	|	Остатки.РазделСчетаДепоМХ.Код КАК НомерРазделаСчетаДепо,
	|	Остатки.СчетДепо.Код КАК СчетДепоДепонента,
	|	"""" КАК КодНРД,
	|	ВЫБОР
	|		КОГДА Остатки.ЦБ.Дробная
	|				И Остатки.ЦБ.Числитель <> 0
	|			ТОГДА Остатки.КоличествоОстаток / Остатки.ЦБ.Числитель * Остатки.ЦБ.Знаменатель
	|		ИНАЧЕ Остатки.КоличествоОстаток
	|	КОНЕЦ КАК ОстатокДепо,
	|	Остатки.ЦБ.НомерРегистрации КАК НомерРегистрации,
	|	Остатки.ЦБ.ISIN КАК ISIN,
	|	Остатки.ЦБ.Наименование КАК ЦеннаяБумагаНаименование,
	|	ЕСТЬNULL(КодыЗагрузкиКлиентов.КодЗагрузкиКлиента, ""Юр\физ лицо без Кода загрузки, код 1С: "" + Остатки.СчетДепо.Владелец.ЮридическиеФизическиеЛица.Код + "" ["" + Остатки.СчетДепо.Владелец.ЮридическиеФизическиеЛица.Наименование + ""]"") КАК КодКлиента,
	|	"""" КАК КодСубклиента
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&ДатаСверкиНачалоСледующегоДня,
	|			&ВсеРазделы
	|				ИЛИ РазделСчетаДепоМХ В (&РазделыМХ)) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКодыЗагрузки КАК КодыЗагрузки
	|		ПО Остатки.ЦБ = КодыЗагрузки.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКодыЗагрузкиКлиентов КАК КодыЗагрузкиКлиентов
	|		ПО Остатки.СчетДепо.Владелец.ЮридическиеФизическиеЛица = КодыЗагрузкиКлиентов.ЮридическиеФизическиеЛицаПоКодуЗагрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиДепонентов
	|		ПО Остатки.СчетДепо.Владелец = КодыЗагрузкиДепонентов.Владелец
	|ГДЕ
	|	КодыЗагрузкиДепонентов.Владелец ССЫЛКА Справочник.Контрагенты
	|	И КодыЗагрузкиДепонентов.Биржа = &CrmContractNumber
	|	И НЕ КодыЗагрузкиДепонентов.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА КодыЗагрузкиДепонентов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КодыЗагрузкиДепонентов.ДатаОкончанияДействия >= &ДатаСверкиНачалоСледующегоДня
	|		КОНЕЦ";
	// BSLLS:JoinWithVirtualTable-on
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаИтоговыеОстаткиСУчетомЗаблокированныхЦБ()
	Возврат
	"ВЫБРАТЬ
	|	Остатки.ЦБ КАК ЦБ,
	|	Остатки.НомерСчетаДепо КАК НомерСчетаДепо,
	|	Остатки.НомерРазделаСчетаДепо КАК НомерРазделаСчетаДепо,
	|	Остатки.КодНРД КАК КодНРД,
	|	Остатки.ОстатокДепо КАК ОстатокДепо,
	|	Остатки.ЦеннаяБумагаНаименование КАК ЦеннаяБумагаНаименование,
	|	Остатки.НомерРегистрации КАК НомерРегистрации,
	|	Остатки.ISIN КАК ISIN,
	|	Остатки.КодКлиента КАК КодКлиента
	|ПОМЕСТИТЬ втИтоговыеОстатки
	|ИЗ
	|	втОстатки КАК Остатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.ЦБ КАК ЦБ,
	|	Остатки.НомерСчетаДепо КАК НомерСчетаДепо,
	|	Остатки.НомерРазделаСчетаДепо КАК НомерРазделаСчетаДепо,
	|	Остатки.КодНРД КАК КодНРД,
	|	Остатки.ОстатокДепо КАК ОстатокДепо,
	|	Остатки.ЦеннаяБумагаНаименование КАК ЦеннаяБумагаНаименование,
	|	Остатки.НомерРегистрации КАК НомерРегистрации,
	|	Остатки.ISIN КАК ISIN,
	|	Остатки.КодКлиента КАК КодКлиента
	|ИЗ
	|	втОстаткиЗаблокированныхЦБ КАК Остатки
	|;
	|//////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Остатки.ЦБ КАК ЦБ,
	|	Остатки.НомерСчетаДепо КАК НомерСчетаДепо,
	|	Остатки.НомерРазделаСчетаДепо КАК НомерРазделаСчетаДепо,
	|	Остатки.КодНРД КАК КодНРД,
	|	Остатки.НомерРегистрации КАК НомерРегистрации,
	|	Остатки.ISIN КАК ISIN,
	|	Остатки.ЦеннаяБумагаНаименование КАК ЦеннаяБумагаНаименование,
	|	Остатки.КодКлиента КАК КодКлиента,
	|	СУММА(Остатки.ОстатокДепо) КАК ОстатокДепо
	|ИЗ
	|	втИтоговыеОстатки КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.ЦБ,
	|	Остатки.НомерСчетаДепо,
	|	Остатки.НомерРазделаСчетаДепо,
	|	Остатки.КодНРД,
	|	Остатки.НомерРегистрации,
	|	Остатки.ISIN,
	|	Остатки.ЦеннаяБумагаНаименование,
	|	Остатки.КодКлиента
	|
	|ИМЕЮЩИЕ
	|	СУММА(Остатки.ОстатокДепо) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Остатки.ЦеннаяБумагаНаименование";
КонецФункции

Функция ТекстЗапросаИтоговыеОстатки()
	Возврат
	"ВЫБРАТЬ
	|	Остатки.ЦБ КАК ЦБ,
	|	Остатки.НомерСчетаДепо КАК НомерСчетаДепо,
	|	Остатки.НомерРазделаСчетаДепо КАК НомерРазделаСчетаДепо,
	|	Остатки.СчетДепоДепонента КАК СчетДепоДепонента,
	|	Остатки.КодНРД КАК КодНРД,
	|	Остатки.ОстатокДепо КАК ОстатокДепо,
	|	Остатки.ЦеннаяБумагаНаименование КАК ЦеннаяБумагаНаименование,
	|	Остатки.НомерРегистрации КАК НомерРегистрации,
	|	Остатки.ISIN КАК ISIN,
	|	Остатки.КодКлиента КАК КодКлиента,
	|	Остатки.КодСубклиента КАК КодСубклиента
	|ИЗ
	|	втОстатки КАК Остатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Остатки.ЦеннаяБумагаНаименование";
КонецФункции

Функция ТекстЗапросаОстаткиЗаблокированныхЦБ()
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Остатки.ЦеннаяБумага КАК ЦБ,
	|	Остатки.СчетДепоМХ.Код КАК НомерСчетаДепо,
	|	Остатки.БлокировочныйРазделСчетаДепоМХ.Код КАК НомерРазделаСчетаДепо,
	|	ЕСТЬNULL(КодыЗагрузки.КодНРД, """") КАК КодНРД,
	|	ВЫБОР
	|		КОГДА Остатки.ЦеннаяБумага.Дробная И Остатки.ЦеннаяБумага.Числитель <> 0
	|			ТОГДА Остатки.КоличествоОстаток / Остатки.ЦеннаяБумага.Числитель * Остатки.ЦеннаяБумага.Знаменатель
	|		ИНАЧЕ Остатки.КоличествоОстаток
	|	КОНЕЦ КАК ОстатокДепо,
	|	Остатки.ЦеннаяБумага.НомерРегистрации КАК НомерРегистрации,
	|	Остатки.ЦеннаяБумага.ISIN КАК ISIN,
	|	Остатки.ЦеннаяБумага.Наименование КАК ЦеннаяБумагаНаименование,
	|	"""" КАК КодКлиента
	|ПОМЕСТИТЬ втОстаткиЗаблокированныхЦБ
	|ИЗ
	|	РегистрНакопления.ЗаблокированныеЦБвВышестоящемДепозитарии.Остатки(&ДатаСверкиНачалоСледующегоДня) КАК Остатки
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКодыЗагрузки КАК КодыЗагрузки
	|	ПО
	|		Остатки.ЦеннаяБумага = КодыЗагрузки.ЦБ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.ЦеннаяБумага КАК ЦБ,
	|	Остатки.СчетДепоМХ.Код КАК НомерСчетаДепо,
	|	Остатки.РазделСчетаДепоМХ.Код КАК НомерРазделаСчетаДепо,
	|	ЕСТЬNULL(КодыЗагрузки.КодНРД, """") КАК КодНРД,
	|	ВЫБОР
	|		КОГДА Остатки.ЦеннаяБумага.Дробная И Остатки.ЦеннаяБумага.Числитель <> 0
	|			ТОГДА -Остатки.КоличествоОстаток / Остатки.ЦеннаяБумага.Числитель * Остатки.ЦеннаяБумага.Знаменатель
	|		ИНАЧЕ -Остатки.КоличествоОстаток
	|	КОНЕЦ КАК ОстатокДепо,
	|	Остатки.ЦеннаяБумага.НомерРегистрации КАК НомерРегистрации,
	|	Остатки.ЦеннаяБумага.ISIN КАК ISIN,
	|	Остатки.ЦеннаяБумага.Наименование КАК ЦеннаяБумагаНаименование,
	|	"""" КАК КодКлиента
	|ИЗ
	|	РегистрНакопления.ЗаблокированныеЦБвВышестоящемДепозитарии.Остатки(&ДатаСверкиНачалоСледующегоДня) КАК Остатки
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКодыЗагрузки КАК КодыЗагрузки
	|	ПО
	|		Остатки.ЦеннаяБумага = КодыЗагрузки.ЦБ
	|";
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаПроверкаНаДублированиеКодовЗагрузки()
	Возврат
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втОстатки.ЦБ КАК ЦБ
	|ПОМЕСТИТЬ втРазличныеЦБ
	|ИЗ
	|	втОстатки КАК втОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРазличныеЦБ.ЦБ КАК ЦБ,
	|	втРазличныеЦБ.ЦБ.Наименование КАК Наименование,
	|	втРазличныеЦБ.ЦБ.НомерРегистрации КАК НомерРегистрации,
	|	КОЛИЧЕСТВО(втРазличныеЦБ.ЦБ) КАК КоличествоКодов
	|ИЗ
	|	втРазличныеЦБ КАК втРазличныеЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКодыЗагрузки КАК втКодыЗагрузки
	|		ПО втРазличныеЦБ.ЦБ = втКодыЗагрузки.ЦБ
	|
	|СГРУППИРОВАТЬ ПО
	|	втРазличныеЦБ.ЦБ
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(втРазличныеЦБ.ЦБ) > 1
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	НомерРегистрации
	|";
КонецФункции

Функция ТекстЗапросаПроверкаНаСуществованиеКодовЗагрузки()
	Возврат
	"ВЫБРАТЬ
	|	втОстатки.ЦБ КАК ЦБ,
	|	втОстатки.ЦБ.Наименование КАК Наименование,
	|	втОстатки.ЦБ.НомерРегистрации КАК НомерРегистрации
	|ИЗ
	|	втОстатки КАК втОстатки
	|ГДЕ
	|	втОстатки.КодНРД = """"
	|
	|СГРУППИРОВАТЬ ПО
	|	втОстатки.ЦБ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	НомерРегистрации";	
КонецФункции

Функция ДанныеЗапросаСверкиПоЦБ()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаСверки",	ТаблицаСверки);
	Запрос.УстановитьПараметр("ДатаСверки",		КонецДня(ДатаСверки));
	Запрос.УстановитьПараметр("НДЦ",			Справочники.КлассификаторыЗагрузки.НДЦ());
	Запрос.УстановитьПараметр("ВыводитьТолькоРасхождения", ВыводитьТолькоРасхождения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСверки.НомерСчетаДепо КАК НомерСчетаДепо,
	|	ТаблицаСверки.НомерРазделаСчетаДепо КАК НомерРазделаСчетаДепо,
	|	ТаблицаСверки.КодНРД КАК КодНРД,
	|	ТаблицаСверки.ОстатокВнешнегоИсточника КАК ОстатокВнешнегоИсточника,
	|	ТаблицаСверки.ОстатокДепо КАК ОстатокДепо,
	|	ТаблицаСверки.ЦеннаяБумагаНаименование КАК ЦеннаяБумагаНаименование,
	|	ТаблицаСверки.НомерРегистрации КАК НомерРегистрации
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	&ТаблицаСверки КАК ТаблицаСверки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСчетаДепо,
	|	НомерРазделаСчетаДепо,
	|	НомерРегистрации,
	|	КодНРД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.НомерСчетаДепо КАК НомерСчетаДепо,
	|	втДанные.НомерРазделаСчетаДепо КАК НомерРазделаСчетаДепо,
	|	втДанные.КодНРД КАК КодНРД,
	|	МАКСИМУМ(втДанные.НомерРегистрации) КАК НомерРегистрации
	|ПОМЕСТИТЬ втКлючи
	|ИЗ
	|	втДанные КАК втДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	втДанные.НомерСчетаДепо,
	|	втДанные.НомерРазделаСчетаДепо,
	|	втДанные.КодНРД
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСчетаДепо,
	|	НомерРазделаСчетаДепо,
	|	НомерРегистрации,
	|	КодНРД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.КодНРД КАК КодНРД,
	|	МАКСИМУМ(втДанные.ЦеннаяБумагаНаименование) КАК ЦеннаяБумагаНаименование
	|ПОМЕСТИТЬ втНаименованияПоКодуНРД
	|ИЗ
	|	втДанные КАК втДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	втДанные.КодНРД
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодНРД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.НомерРегистрации КАК НомерРегистрации,
	|	МАКСИМУМ(втДанные.ЦеннаяБумагаНаименование) КАК ЦеннаяБумагаНаименование
	|ПОМЕСТИТЬ втНаименованияПоНомеруРегистрации
	|ИЗ
	|	втДанные КАК втДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	втДанные.НомерРегистрации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыЗагрузки.Владелец КАК ЦеннаяБумага,
	|	ПРЕДСТАВЛЕНИЕ(КодыЗагрузки.Владелец) КАК ЦеннаяБумагаНаименование,
	|	КодыЗагрузки.Владелец.НомерРегистрации КАК НомерРегистрации,
	|	МАКСИМУМ(КодыЗагрузки.Код) КАК КодНРД
	|ПОМЕСТИТЬ втКодыЗагрузки
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	(КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ДатаСверки)
	|	И КодыЗагрузки.Биржа = &НДЦ
	|	И КодыЗагрузки.Владелец ССЫЛКА Справочник.ЦенныеБумаги
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	КодыЗагрузки.Владелец,
	|	КодыЗагрузки.Владелец.НомерРегистрации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодНРД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКлючи.НомерСчетаДепо КАК НомерСчетаДепо,
	|	втКлючи.НомерРазделаСчетаДепо КАК НомерРазделаСчетаДепо,
	|	втКлючи.КодНРД КАК КодНРД,
	|	"""" КАК НомерРегистрации,
	|	СУММА(втДанные.ОстатокВнешнегоИсточника) КАК ОстатокВнешнегоИсточника,
	|	СУММА(втДанные.ОстатокДепо) КАК ОстатокДепо,
	|	МАКСИМУМ(втНаименования.ЦеннаяБумагаНаименование) КАК ЦеннаяБумагаНаименование
	|ПОМЕСТИТЬ втОбъединенныеДанные
	|ИЗ
	|	втКлючи КАК втКлючи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДанные КАК втДанные
	|		ПО втКлючи.НомерСчетаДепо = втДанные.НомерСчетаДепо
	|			И втКлючи.НомерРазделаСчетаДепо = втДанные.НомерРазделаСчетаДепо
	|			И втКлючи.КодНРД = втДанные.КодНРД
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНаименованияПоКодуНРД КАК втНаименования
	|		ПО втКлючи.КодНРД = втНаименования.КодНРД
	|ГДЕ
	|	втКлючи.КодНРД <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	втКлючи.НомерСчетаДепо,
	|	втКлючи.НомерРазделаСчетаДепо,
	|	втКлючи.КодНРД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втКлючи.НомерСчетаДепо,
	|	втКлючи.НомерРазделаСчетаДепо,
	|	"""",
	|	втКлючи.НомерРегистрации,
	|	СУММА(втДанные.ОстатокВнешнегоИсточника),
	|	СУММА(втДанные.ОстатокДепо),
	|	МАКСИМУМ(втНаименования.ЦеннаяБумагаНаименование)
	|ИЗ
	|	втКлючи КАК втКлючи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДанные КАК втДанные
	|		ПО втКлючи.НомерСчетаДепо = втДанные.НомерСчетаДепо
	|			И втКлючи.НомерРазделаСчетаДепо = втДанные.НомерРазделаСчетаДепо
	|			И втКлючи.НомерРегистрации = втДанные.НомерРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНаименованияПоНомеруРегистрации КАК втНаименования
	|		ПО втКлючи.НомерРегистрации = втНаименования.НомерРегистрации
	|ГДЕ
	|	втКлючи.НомерРегистрации <> """"
	|	И втКлючи.КодНРД = """"
	|
	|СГРУППИРОВАТЬ ПО
	|	втКлючи.НомерСчетаДепо,
	|	втКлючи.НомерРазделаСчетаДепо,
	|	втКлючи.НомерРегистрации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодНРД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.НомерСчетаДепо КАК НомерСчетаДепо,
	|	Данные.НомерРазделаСчетаДепо КАК НомерРазделаСчетаДепо,
	|	Данные.КодНРД КАК КодНРД,
	|	Данные.ОстатокВнешнегоИсточника КАК ОстатокВнешнегоИсточника,
	|	Данные.ОстатокДепо КАК ОстатокДепо,
	|	Данные.ОстатокДепо - Данные.ОстатокВнешнегоИсточника КАК Расхождение,
	|	ЕСТЬNULL(КодыЗагрузки.ЦеннаяБумага, Данные.ЦеннаяБумагаНаименование) КАК ЦеннаяБумага,
	|	ЕСТЬNULL(КодыЗагрузки.НомерРегистрации, Данные.НомерРегистрации) КАК НомерРегистрации,
	|	ЕСТЬNULL(КодыЗагрузки.ЦеннаяБумагаНаименование, Данные.ЦеннаяБумагаНаименование) КАК ЦеннаяБумагаНаименование
	|ИЗ
	|	втОбъединенныеДанные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКодыЗагрузки КАК КодыЗагрузки
	|		ПО (КодыЗагрузки.КодНРД = Данные.КодНРД)
	|
	|ГДЕ
	|	(Данные.ОстатокДепо - Данные.ОстатокВнешнегоИсточника <> 0)
	|	ИЛИ НЕ &ВыводитьТолькоРасхождения
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСчетаДепо,
	|	НомерРазделаСчетаДепо,
	|	КодНРД
	|
	|ИТОГИ
	|	СУММА(ОстатокВнешнегоИсточника),
	|	СУММА(ОстатокДепо),
	|	СУММА(Расхождение)
	|ПО
	|	НомерСчетаДепо,
	|	НомерРазделаСчетаДепо";
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

Процедура ВывестиДанныеПоЦБ(Дерево, Результат)
	
	Результат.Очистить();	
	Макет = ПолучитьМакет("Макет");		
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаМестаХранения = Макет.ПолучитьОбласть("ШапкаМестаХранения");
	ОбластьСтрокаЦБ = Макет.ПолучитьОбласть("СтрокаЦБ");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	// Шапка
	ОбластьШапка.Параметры.ДатаСверки  = "на конец дня: " + Формат(ДатаСверки, "ДЛФ=D");
	ОбластьШапка.Параметры.ИсточникВШапке = "НРД";
	ОбластьШапка.Параметры.ИсточникВТаблице = "НРД";
	Результат.Вывести(ОбластьШапка);
	
	Результат.НачатьАвтогруппировкуСтрок();
	
	Пока Дерево.Следующий() Цикл
		ВыборкаРазделов = Дерево.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаРазделов.Следующий() Цикл
			ОбластьШапкаМестаХранения.Параметры.Заполнить(ВыборкаРазделов);
			ОбластьШапкаМестаХранения.Параметры.МестоХранения = 
				"Счет депо: " + ВыборкаРазделов.НомерСчетаДепо +
				"; раздел счета депо: " + ВыборкаРазделов.НомерРазделаСчетаДепо;
			Результат.Вывести(ОбластьШапкаМестаХранения, 1);
					
			ВыборкаЦБ = ВыборкаРазделов.Выбрать();			
			Пока ВыборкаЦБ.Следующий() Цикл				
				ОбластьСтрокаЦБ.Параметры.Заполнить(ВыборкаЦБ);
				Если ЗначениеЗаполнено(ВыборкаЦБ.ЦеннаяБумага) Тогда
					ОбластьСтрокаЦБ.Область("ЦеннаяБумага").Расшифровка = ВыборкаЦБ.ЦеннаяБумага;
				КонецЕсли;
				Если ВыборкаЦБ.Расхождение = 0 Тогда
					ЦветФонаРасхождения = WebЦвета.МятныйКрем;
				Иначе
					ЦветФонаРасхождения = WebЦвета.Розовый; // Выделяем ошибки цветом
				КонецЕсли;
				ОбластьСтрокаЦБ.Область("Расхождение").ЦветФона = ЦветФонаРасхождения;
				Результат.Вывести(ОбластьСтрокаЦБ, 2);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Результат.ЗакончитьАвтогруппировкуСтрок();
	
	ОбластьПодвал.Параметры.ДатаВремяФормирования = "Время формирования отчета (1С): " + ТекущаяДатаСеанса();
	Результат.Вывести(ОбластьПодвал);
	
	Результат.ПоказатьУровеньГруппировокСтрок(0);
	Результат.ФиксацияСверху = 3;
	Результат.ПовторятьПриПечатиСтроки = Результат.Область("R3:R3");
КонецПроцедуры

Функция ДанныеЗапросаСверкиПоКлиентам()
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаСверки",	ТаблицаСверки);
	Запрос.УстановитьПараметр("ДатаСверки",		КонецДня(ДатаСверки));
	Запрос.УстановитьПараметр("НДЦ",			Справочники.КлассификаторыЗагрузки.НДЦ());
	Запрос.УстановитьПараметр("ВыводитьТолькоРасхождения", ВыводитьТолькоРасхождения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСверки.НомерСчетаДепо КАК НомерСчетаДепо,
	|	ТаблицаСверки.НомерРазделаСчетаДепо КАК НомерРазделаСчетаДепо,
	|	ТаблицаСверки.СчетДепоДепонента КАК СчетДепоДепонента,
	|	ТаблицаСверки.КодНРД КАК КодНРД,
	|	ТаблицаСверки.ОстатокВнешнегоИсточника КАК ОстатокВнешнегоИсточника,
	|	ТаблицаСверки.ОстатокДепо КАК ОстатокДепо,
	|	ТаблицаСверки.ЦеннаяБумагаНаименование КАК ЦеннаяБумагаНаименование,
	|	ТаблицаСверки.НомерРегистрации КАК НомерРегистрации,
	|	ТаблицаСверки.ISIN КАК ISIN,
	|	ТаблицаСверки.КодКлиента КАК КодКлиента,
	|	ТаблицаСверки.КодСубклиента КАК КодСубклиента
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	&ТаблицаСверки КАК ТаблицаСверки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСчетаДепо,
	|	НомерРазделаСчетаДепо,
	|	СчетДепоДепонента,
	|	НомерРегистрации,
	|	ISIN,
	|	КодНРД,
	|	КодКлиента,
	|	КодСубклиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(КодыЗагрузки.Владелец) КАК Ссылка,
	|	КодыЗагрузки.Код КАК Код
	|ПОМЕСТИТЬ Контрагенты
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	(КодыЗагрузки.Владелец ССЫЛКА Справочник.ФизическиеЛица
	|			ИЛИ КодыЗагрузки.Владелец ССЫЛКА Справочник.ЮридическиеЛица)
	|	И КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.Клиенты)
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КодыЗагрузки.ДатаОкончанияДействия > &ДатаСверки
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	КодыЗагрузки.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.НомерРегистрации КАК НомерРегистрации,
	|	МАКСИМУМ(ЦенныеБумаги.Ссылка) КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втЦБпоГосНомерам
	|ИЗ
	|	втДанные КАК ТЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ТЗ.НомерРегистрации = ЦенныеБумаги.НомерРегистрации
	|			И (ТЗ.НомерРегистрации <> """")
	|			И (НЕ ЦенныеБумаги.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗ.НомерРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.ISIN КАК ISIN,
	|	МАКСИМУМ(ЦенныеБумаги.Ссылка) КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втЦБпоISIN
	|ИЗ
	|	втДанные КАК ТЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ТЗ.ISIN = ЦенныеБумаги.ISIN
	|			И (ТЗ.ISIN <> """")
	|			И (НЕ ЦенныеБумаги.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗ.ISIN
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.НомерРегистрации КАК НомерРегистрации,
	|	ЦенныеБумаги.Ссылка КАК Ссылка,
	|	ЦенныеБумаги.ДатаПриемаНаОбслуживание КАК ДатаПриемаНаОбслуживание,
	|	ЦенныеБумаги.ДатаСнятияСОбслуживания КАК ДатаСнятияСОбслуживания
	|ПОМЕСТИТЬ втЦенныеБумаги1СДепоСДублями
	|ИЗ
	|	втДанные КАК ТЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ТЗ.ISIN = ЦенныеБумаги.ISIN
	|			И ТЗ.НомерРегистрации = ЦенныеБумаги.НомерРегистрации
	|			И (ТЗ.ISIN <> """")
	|			И (НЕ ЦенныеБумаги.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ДатаПриемаНаОбслуживание <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ЦенныеБумаги.ДатаСнятияСОбслуживания = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * 100 + ВЫБОР
	|		КОГДА ДЛИНАСТРОКИ(ЕСТЬNULL(КодыЗагрузки.Код, """")) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА СТРНАЙТИ(ЕСТЬNULL(КодыЗагрузки.Код, """"), ""/"") = 0
	|						ТОГДА 2
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ * 10 КАК Приоритет,
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.НомерРегистрации КАК НомерРегистрации,
	|	ЦенныеБумаги.Ссылка КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втЦенныеБумаги1СДепоСПриоритетом
	|ИЗ
	|	втЦенныеБумаги1СДепоСДублями КАК ЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ЦенныеБумаги.Ссылка = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.NrdCode))
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ КодыЗагрузки.ДатаОкончанияДействия > &ДатаСверки
	|			КОНЕЦ)
	|			И (КодыЗагрузки.ДатаНачалаДействия <= &ДатаСверки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(втЦенныеБумаги1СДепоСПриоритетом.Приоритет) КАК Приоритет,
	|	втЦенныеБумаги1СДепоСПриоритетом.ISIN КАК ISIN,
	|	втЦенныеБумаги1СДепоСПриоритетом.НомерРегистрации КАК НомерРегистрации
	|ПОМЕСТИТЬ втЦенныеБумаги1СДепоСМаксимальнымПриоритетом
	|ИЗ
	|	втЦенныеБумаги1СДепоСПриоритетом КАК втЦенныеБумаги1СДепоСПриоритетом
	|
	|СГРУППИРОВАТЬ ПО
	|	втЦенныеБумаги1СДепоСПриоритетом.ISIN,
	|	втЦенныеБумаги1СДепоСПриоритетом.НомерРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.НомерРегистрации КАК НомерРегистрации,
	|	МАКСИМУМ(ЦенныеБумаги.ЦеннаяБумага) КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втЦБпоISINиГосНомерам
	|ИЗ
	|	втЦенныеБумаги1СДепоСПриоритетом КАК ЦенныеБумаги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЦенныеБумаги1СДепоСМаксимальнымПриоритетом КАК втЦенныеБумаги1СДепоСМаксимальнымПриоритетом
	|		ПО ЦенныеБумаги.Приоритет = втЦенныеБумаги1СДепоСМаксимальнымПриоритетом.Приоритет
	|			И ЦенныеБумаги.ISIN = втЦенныеБумаги1СДепоСМаксимальнымПриоритетом.ISIN
	|			И ЦенныеБумаги.НомерРегистрации = втЦенныеБумаги1СДепоСМаксимальнымПриоритетом.НомерРегистрации
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумаги.ISIN,
	|	ЦенныеБумаги.НомерРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.НомерСчетаДепо КАК НомерСчетаДепо,
	|	Данные.НомерРазделаСчетаДепо КАК НомерРазделаСчетаДепо,
	|	Данные.СчетДепоДепонента КАК СчетДепоДепонента,
	|	МАКСИМУМ(Данные.КодНРД) КАК КодНРД,
	|	МАКСИМУМ(Данные.НомерРегистрации) КАК НомерРегистрации,
	|	МАКСИМУМ(Данные.ISIN) КАК ISIN,
	|	МАКСИМУМ(Данные.ЦеннаяБумагаНаименование) КАК ЦеннаяБумагаНаименование,
	|	Данные.КодКлиента КАК КодКлиента,
	|	Данные.КодСубклиента КАК КодСубклиента,
	|	СУММА(Данные.ОстатокДепо) КАК ОстатокДепо,
	|	СУММА(Данные.ОстатокВнешнегоИсточника) КАК ОстатокВнешнегоИсточника,
	|	ЕСТЬNULL(ЦБпоISINиГосНомерам.ЦеннаяБумага, ЕСТЬNULL(ЦБпоISIN.ЦеннаяБумага, ЕСТЬNULL(ЦБпоГосНомерам.ЦеннаяБумага, Данные.ЦеннаяБумагаНаименование))) КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втДанныеПоЦБ
	|ИЗ
	|	втДанные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦБпоISINиГосНомерам КАК ЦБпоISINиГосНомерам
	|		ПО Данные.ISIN = ЦБпоISINиГосНомерам.ISIN
	|			И Данные.НомерРегистрации = ЦБпоISINиГосНомерам.НомерРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦБпоГосНомерам КАК ЦБпоГосНомерам
	|		ПО Данные.НомерРегистрации = ЦБпоГосНомерам.НомерРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦБпоISIN КАК ЦБпоISIN
	|		ПО Данные.ISIN = ЦБпоISIN.ISIN
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.НомерСчетаДепо,
	|	Данные.НомерРазделаСчетаДепо,
	|	Данные.СчетДепоДепонента,
	|	Данные.КодКлиента,
	|	Данные.КодСубклиента,
	|	ЕСТЬNULL(ЦБпоISINиГосНомерам.ЦеннаяБумага, ЕСТЬNULL(ЦБпоISIN.ЦеннаяБумага, ЕСТЬNULL(ЦБпоГосНомерам.ЦеннаяБумага, Данные.ЦеннаяБумагаНаименование)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоЦБ.НомерСчетаДепо КАК НомерСчетаДепо,
	|	ДанныеПоЦБ.НомерРазделаСчетаДепо КАК НомерРазделаСчетаДепо,
	|	ДанныеПоЦБ.СчетДепоДепонента КАК СчетДепоДепонента,
	|	ДанныеПоЦБ.КодНРД КАК КодНРД,
	|	ЕСТЬNULL(ДанныеПоЦБ.ЦеннаяБумага.ISIN, ДанныеПоЦБ.ISIN) КАК ISIN,
	|	ЕСТЬNULL(ДанныеПоЦБ.ЦеннаяБумага.НомерРегистрации, ДанныеПоЦБ.НомерРегистрации) КАК НомерРегистрации,
	|	ЕСТЬNULL(ДанныеПоЦБ.ЦеннаяБумага.Наименование, ДанныеПоЦБ.ЦеннаяБумагаНаименование) КАК ЦеннаяБумагаНаименование,
	|	ДанныеПоЦБ.КодКлиента КАК КодКлиента,
	|	ДанныеПоЦБ.КодСубклиента КАК КодСубклиента,
	|	ДанныеПоЦБ.ОстатокДепо КАК ОстатокДепо,
	|	ДанныеПоЦБ.ОстатокВнешнегоИсточника КАК ОстатокВнешнегоИсточника,
	|	ДанныеПоЦБ.ОстатокДепо - ДанныеПоЦБ.ОстатокВнешнегоИсточника КАК Расхождение,
	|	ЕСТЬNULL(ДанныеПоЦБ.ЦеннаяБумага, ДанныеПоЦБ.ЦеннаяБумагаНаименование) КАК ЦеннаяБумага,
	|	ЕСТЬNULL(Контрагенты.Ссылка, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Клиент,
	|	ЕСТЬNULL(Субклиенты.Ссылка, ЗНАЧЕНИЕ(Справочник.Субклиенты.ПустаяСсылка)) КАК Субклиент,
	|	ЕСТЬNULL(СчетаДепо.Ссылка, ЗНАЧЕНИЕ(Справочник.СчетаДепо.ПустаяСсылка)) КАК СчетДепоДепонентаСсылка
	|ПОМЕСТИТЬ втСверкаСУточнениемЦБ
	|ИЗ
	|	втДанныеПоЦБ КАК ДанныеПоЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Контрагенты КАК Контрагенты
	|		ПО ДанныеПоЦБ.КодКлиента = Контрагенты.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Субклиенты КАК Субклиенты
	|		ПО ДанныеПоЦБ.КодСубклиента = Субклиенты.Код
	|			И (Контрагенты.Ссылка = Субклиенты.Владелец)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
	|		ПО ДанныеПоЦБ.СчетДепоДепонента = СчетаДепо.Код
	|ГДЕ
	|	(ДанныеПоЦБ.ОстатокДепо - ДанныеПоЦБ.ОстатокВнешнегоИсточника <> 0
	|			ИЛИ НЕ &ВыводитьТолькоРасхождения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.НомерСчетаДепо КАК НомерСчетаДепо,
	|	ТЗ.НомерРазделаСчетаДепо КАК НомерРазделаСчетаДепо,
	|	ТЗ.СчетДепоДепонента КАК СчетДепоДепонента,
	|	ВЫБОР
	|		КОГДА ТЗ.КодНРД = """"
	|			ТОГДА ТЗ.ISIN
	|		ИНАЧЕ ТЗ.КодНРД
	|	КОНЕЦ КАК КодНРД,
	|	ТЗ.НомерРегистрации КАК НомерРегистрации,
	|	ТЗ.ОстатокДепо КАК ОстатокДепо,
	|	ТЗ.ОстатокВнешнегоИсточника КАК ОстатокВнешнегоИсточника,
	|	ТЗ.ЦеннаяБумагаНаименование КАК ЦеннаяБумагаНаименование,
	|	ТЗ.КодКлиента КАК КодКлиента,
	|	ТЗ.КодСубклиента КАК КодСубклиента,
	|	ТЗ.Расхождение КАК Расхождение,
	|	ТЗ.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ТЗ.Клиент КАК Клиент,
	|	ТЗ.Субклиент КАК Субклиент,
	|	ТЗ.СчетДепоДепонентаСсылка КАК СчетДепоДепонентаСсылка
	|ИЗ
	|	втСверкаСУточнениемЦБ КАК ТЗ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСчетаДепо,
	|	НомерРазделаСчетаДепо,
	|	КодКлиента,
	|	КодСубклиента,
	|	СчетДепоДепонента,
	|	КодНРД
	|ИТОГИ
	|	СУММА(ОстатокДепо),
	|	СУММА(ОстатокВнешнегоИсточника),
	|	СУММА(Расхождение),
	|	МАКСИМУМ(Клиент),
	|	МАКСИМУМ(Субклиент),
	|	МАКСИМУМ(СчетДепоДепонентаСсылка)
	|ПО
	|	НомерСчетаДепо,
	|	НомерРазделаСчетаДепо,
	|	КодКлиента,
	|	КодСубклиента,
	|	СчетДепоДепонента";
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
КонецФункции

Процедура ВывестиДанныеПоКлиентам(Дерево, Результат)
	
	Результат.Очистить();
	Макет = ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаМестаХранения = Макет.ПолучитьОбласть("ШапкаМестаХранения");
	ОбластьСтрокаГруппировки = Макет.ПолучитьОбласть("СтрокаГруппировки");
	ОбластьСтрокаГруппировкиСчетДепоДепонента = Макет.ПолучитьОбласть("СтрокаГруппировкиСчетДепоДепонента");
	ОбластьСтрокаЦБ = Макет.ПолучитьОбласть("СтрокаЦБ");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	// Шапка
	ОбластьШапка.Параметры.ДатаСверки		 = "на конец дня: " + Формат(ДатаСверки, "ДЛФ=D");
	ОбластьШапка.Параметры.ИсточникВШапке	 = "Бэкофисом"; // BSLLS:Typo-off
	ОбластьШапка.Параметры.ИсточникВТаблице	 = "BQ:Бэкофис"; // BSLLS:Typo-off
	Результат.Вывести(ОбластьШапка);
	
	Результат.НачатьАвтогруппировкуСтрок();
	
	Пока Дерево.Следующий() Цикл
		ВыборкаРазделов = Дерево.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаРазделов.Следующий() Цикл
			ОбластьШапкаМестаХранения.Параметры.Заполнить(ВыборкаРазделов);
			ОбластьШапкаМестаХранения.Параметры.МестоХранения = "Счет депо МХ: " + ВыборкаРазделов.НомерСчетаДепо
				+ "; раздел счета депо МХ: " + ВыборкаРазделов.НомерРазделаСчетаДепо;
			Результат.Вывести(ОбластьШапкаМестаХранения, 1);
			
			ВыборкаКлиентов = ВыборкаРазделов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКлиентов.Следующий() Цикл
				ВыборкаКлиентовИСубклиентов = ВыборкаКлиентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); // BSLLS:Typo-off
				Пока ВыборкаКлиентовИСубклиентов.Следующий() Цикл
					
					ВывестиДанныеПоКлиентамДоСчетовДепо(Результат,
						ВыборкаКлиентов,
						ВыборкаКлиентовИСубклиентов,
						ОбластьСтрокаГруппировки,
						ОбластьСтрокаГруппировкиСчетДепоДепонента,
						ОбластьСтрокаЦБ);
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Результат.ЗакончитьАвтогруппировкуСтрок();
	
	ОбластьПодвал.Параметры.ДатаВремяФормирования = "Время формирования отчета (1С): " + ТекущаяДатаСеанса();
	Результат.Вывести(ОбластьПодвал);
	
	Результат.ПоказатьУровеньГруппировокСтрок(0);
	Результат.ФиксацияСверху = 3;
	Результат.ПовторятьПриПечатиСтроки = Результат.Область("R3:R3");
	
КонецПроцедуры

Процедура ВывестиДанныеПоКлиентамДоСчетовДепо(Результат,
	ВыборкаКлиентов,
	ВыборкаКлиентовИСубклиентов,
	ОбластьСтрокаГруппировки,
	ОбластьСтрокаГруппировкиСчетДепоДепонента,
	ОбластьСтрокаЦБ)
	
	КодСубклиента = ВыборкаКлиентовИСубклиентов.КодСубклиента; // BSLLS:Typo-off
	Если Не ПустаяСтрока(КодСубклиента) Тогда
		ТекстСубклиент = " Код субклиента: " + КодСубклиента; // BSLLS:Typo-off
	Иначе
		ТекстСубклиент = ""; // BSLLS:Typo-off
	КонецЕсли;
	ОбластьСтрокаГруппировки.Параметры.ПредставлениеКлиента = "Код клиента: "
		+ ВыборкаКлиентов.КодКлиента + ТекстСубклиент;
	Если ЗначениеЗаполнено(ВыборкаКлиентов.Клиент) Тогда 
		ОбластьСтрокаГруппировки.Параметры.Клиент = ВыборкаКлиентов.Клиент;
		ЦветТекстаКлиента = WebЦвета.ТемноГрифельноСерый;
	Иначе
		ОбластьСтрокаГруппировки.Параметры.Клиент = ВыборкаКлиентов.КодКлиента;
		ЦветТекстаКлиента = WebЦвета.Красный;
	КонецЕсли;
	Если Не ПустаяСтрока(КодСубклиента) И Не ЗначениеЗаполнено(ВыборкаКлиентов.Субклиент) Тогда
		ЦветТекстаКлиента = WebЦвета.Красный;
	КонецЕсли;
	
	ОбластьСтрокаГруппировки.Область("Клиент").ЦветТекста = ЦветТекстаКлиента;
	Результат.Вывести(ОбластьСтрокаГруппировки, 2);
	
	ВыборкаСчетовДепоДепонента = ВыборкаКлиентовИСубклиентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСчетовДепоДепонента.Следующий() Цикл
		
		ПредставлениеСчетаДепоДепонента = "Счет депо Депонента: " + ВыборкаСчетовДепоДепонента.СчетДепоДепонента;
		Если ЗначениеЗаполнено(ВыборкаСчетовДепоДепонента.СчетДепоДепонентаСсылка) Тогда
			ОбластьСтрокаГруппировкиСчетДепоДепонента.Параметры.СчетДепоДепонента = ВыборкаСчетовДепоДепонента.СчетДепоДепонентаСсылка;
			ЦветТекстаСчетаДепоДепонента = WebЦвета.ТемноГрифельноСерый;
			ПредставлениеДепонента = СокрЛП(ВыборкаСчетовДепоДепонента.СчетДепоДепонентаСсылка.Владелец.Код);
			ПредставлениеСчетаДепоДепонента = ПредставлениеСчетаДепоДепонента + " [Код депонента: " + ПредставлениеДепонента + "]";
		Иначе
			ОбластьСтрокаГруппировкиСчетДепоДепонента.Параметры.СчетДепоДепонента = ВыборкаСчетовДепоДепонента.СчетДепоДепонента;
			ЦветТекстаСчетаДепоДепонента = WebЦвета.Красный;
		КонецЕсли;
		ОбластьСтрокаГруппировкиСчетДепоДепонента.Параметры.ПредставлениеСчетаДепоДепонента = ПредставлениеСчетаДепоДепонента;
		
		ОбластьСтрокаГруппировкиСчетДепоДепонента.Область("СчетДепоДепонента").ЦветТекста = ЦветТекстаСчетаДепоДепонента;
		Результат.Вывести(ОбластьСтрокаГруппировкиСчетДепоДепонента, 3);
		
		ВывестиДанныеПоКлиентамДоЦенныхБумаг(Результат,
			ВыборкаСчетовДепоДепонента,
			ОбластьСтрокаЦБ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиДанныеПоКлиентамДоЦенныхБумаг(Результат,
	ВыборкаСчетовДепоДепонента,
	ОбластьСтрокаЦБ)
	
	ВыборкаЦБ = ВыборкаСчетовДепоДепонента.Выбрать();
	Пока ВыборкаЦБ.Следующий() Цикл
		ОбластьСтрокаЦБ.Параметры.Заполнить(ВыборкаЦБ);
		Если ЗначениеЗаполнено(ВыборкаЦБ.ЦеннаяБумага) Тогда
			ОбластьСтрокаЦБ.Область("ЦеннаяБумага").Расшифровка = ВыборкаЦБ.ЦеннаяБумага;
		КонецЕсли;
		Если ВыборкаЦБ.Расхождение = 0 Тогда
			ЦветФонаРасхождения = WebЦвета.МятныйКрем;
		Иначе
			ЦветФонаРасхождения = WebЦвета.Розовый;
		КонецЕсли;
		ОбластьСтрокаЦБ.Область("Расхождение").ЦветФона = ЦветФонаРасхождения;
		Результат.Вывести(ОбластьСтрокаЦБ, 4);
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЯчейки(ТабличныйДокумент, НомерСтроки, НомерКолонки, ОтсечьПробелы = Ложь)
	Текст = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки).Текст;
	Если ОтсечьПробелы Тогда
		Текст = СокрЛП(Текст);
	КонецЕсли;
	Возврат Текст;
КонецФункции

Процедура ЗаполнитьЗначенияИзЯчеек(ДанныеФайла, НомерСтроки, ЗначениеЯчейкиПервойКолонки, ЗначениеЯчейкиВторойКолонки)
	НомерКолонки = 1;
	ЗначениеЯчейкиПервойКолонки = ТекстЯчейки(ДанныеФайла, НомерСтроки, НомерКолонки);
	НомерКолонки = 2;
	ЗначениеЯчейкиВторойКолонки = ТекстЯчейки(ДанныеФайла, НомерСтроки, НомерКолонки);
КонецПроцедуры

Процедура ОбработкаФайлаСверкиНРД(НомерСчетаДепо, ИмяФайлаНРД, ДанныеФайла)
	
	ЗначениеЯчейкиПервойКолонки = "";
	ЗначениеЯчейкиВторойКолонки = "";
	НомерРазделаСчетаДепо = "";
	НомерСтроки = 3;
	ЗаполнитьЗначенияИзЯчеек(ДанныеФайла, НомерСтроки, ЗначениеЯчейкиПервойКолонки, ЗначениеЯчейкиВторойКолонки);
	
	Пока ЗначениеЗаполнено(ЗначениеЯчейкиПервойКолонки) Или ЗначениеЗаполнено(ЗначениеЯчейкиВторойКолонки) Цикл
		
		// Строка с номером раздела счета депо
		Если ЗначениеЗаполнено(ЗначениеЯчейкиПервойКолонки) Тогда
			
			Если СтрНайти(ЗначениеЯчейкиПервойКолонки, "Раздел счета депо") > 0 Тогда
				НомерРазделаСчетаДепо = ВыделитьНомерРаздела(ЗначениеЯчейкиПервойКолонки);
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			ЗаполнитьЗначенияИзЯчеек(ДанныеФайла, НомерСтроки, ЗначениеЯчейкиПервойКолонки, ЗначениеЯчейкиВторойКолонки);
			Продолжить;
			
			// В любом другом случае - это строка с остатками ЦБ
		Иначе
			
			Попытка
				НоваяСтрока = ТаблицаСверки.Добавить();
				НоваяСтрока.НомерСчетаДепо				= СокрЛП(НомерСчетаДепо);
				НоваяСтрока.НомерРазделаСчетаДепо		= СокрЛП(НомерРазделаСчетаДепо);
				НоваяСтрока.КодНРД						= ЗначениеЯчейкиВторойКолонки;
				ОтсечьПробелы = Истина;
				НоваяСтрока.ЦеннаяБумагаНаименование	= ТекстЯчейки(ДанныеФайла, НомерСтроки, 3, ОтсечьПробелы);
				НоваяСтрока.НомерРегистрации			= ТекстЯчейки(ДанныеФайла, НомерСтроки, 4, ОтсечьПробелы);
				ОстатокВнешнегоИсточника				= ТекстЯчейки(ДанныеФайла, НомерСтроки, 5);
				НоваяСтрока.ОстатокВнешнегоИсточника	= СтроковыеФункцииКлиентСервер.ЧислоИзСтроки(ОстатокВнешнегоИсточника);
			Исключение
				ВызватьИсключение ("Ошибка в строке " + СокрЛП(Строка(НомерСтроки)) + " в файле "
					+ ИмяФайлаНРД + Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
			
		КонецЕсли;
		
		// Переходим к следующей строке
		НомерСтроки = НомерСтроки + 1;
		ЗаполнитьЗначенияИзЯчеек(ДанныеФайла, НомерСтроки, ЗначениеЯчейкиПервойКолонки, ЗначениеЯчейкиВторойКолонки);
		
	КонецЦикла;
КонецПроцедуры

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Сохранить настройки
//
// Параметры:
//  ИмяОтчета			 - Строка - Название отчета
//  ИмяИсточника		 - Строка - Название источника сверки
//
Процедура СохранитьНастройки(ИмяОтчета, ИмяИсточника) Экспорт
	
	// Локальный фильтр для текущего пользователя
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ФильтрПоРазделамСчетовДепоМХЛокальный",
		ФильтрПоРазделамСчетовДепоМХЛокальный.ВыгрузитьКолонку("РазделСчетаДепоМХ"));
	ХранилищеОбщихНастроек.Сохранить(ИмяОтчета , "СтруктураПараметров" + ИмяИсточника , СтруктураПараметров);
	
	// Глобальный фильтр для пользователя svcWebService
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ФильтрПоРазделамСчетовДепоМХ",
		ФильтрПоРазделамСчетовДепоМХ.ВыгрузитьКолонку("РазделСчетаДепоМХ"));
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить(ИмяОтчета , "СтруктураПараметров" + ИмяИсточника , СтруктураПараметров, , "svcWebService");
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Процедура - Восстановить настройки
//
// Параметры:
//  ИмяОтчета			 - Строка - Название отчета
//  ИмяИсточника		 - Строка - Название источника сверки
//
Процедура ВосстановитьНастройки(ИмяОтчета, ИмяИсточника) Экспорт
	
	// Локальный фильтр текущего пользователя
	ЭтоПервоеВосстановлениеЛокальныхНастроек = Истина;
	СтруктураПараметров = ХранилищеОбщихНастроек.Загрузить(ИмяОтчета , "СтруктураПараметров" + ИмяИсточника);
	Если СтруктураПараметров <> Неопределено Тогда
		Если СтруктураПараметров.Свойство("ФильтрПоРазделамСчетовДепоМХЛокальный") Тогда
			ВосстановитьНастройкиВТаблицу(ФильтрПоРазделамСчетовДепоМХЛокальный, СтруктураПараметров.ФильтрПоРазделамСчетовДепоМХЛокальный);
			ЭтоПервоеВосстановлениеЛокальныхНастроек = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// Глобальный фильтр пользователя svcWebService
	УстановитьПривилегированныйРежим(Истина);
	СтруктураПараметров = ХранилищеОбщихНастроек.Загрузить(ИмяОтчета , "СтруктураПараметров" + ИмяИсточника, , "svcWebService");
	УстановитьПривилегированныйРежим(Ложь);
	Если СтруктураПараметров <> Неопределено Тогда
		Если СтруктураПараметров.Свойство("ФильтрПоРазделамСчетовДепоМХ") Тогда
			ВосстановитьНастройкиВТаблицу(ФильтрПоРазделамСчетовДепоМХ, СтруктураПараметров.ФильтрПоРазделамСчетовДепоМХ);
			ВосстановитьНастройкиВТаблицу(ФильтрПоРазделамСчетовДепоМХЭталон, СтруктураПараметров.ФильтрПоРазделамСчетовДепоМХ);
			Если ЭтоПервоеВосстановлениеЛокальныхНастроек Тогда
				ВосстановитьНастройкиВТаблицу(ФильтрПоРазделамСчетовДепоМХЛокальный, СтруктураПараметров.ФильтрПоРазделамСчетовДепоМХ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВосстановитьНастройкиВТаблицу(Таблица, Настройки)
	
	КоличествоРазделов = Настройки.Количество();
	Если КоличествоРазделов > 0 Тогда
		Таблица.Очистить();
		Для ИндексРаздела = 1 По КоличествоРазделов Цикл
			Таблица.Добавить();
		КонецЦикла;
		Таблица.ЗагрузитьКолонку(Настройки, "РазделСчетаДепоМХ");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РассылкаСверкаДепо

// Рассылка сверки с BQ/NRD
// Результат Сверки побитовая маска:
// 0 - сверки ок
// 1 - сверка с Нрд error
// 2 - сверка с Bq error
// 3 - сверки Error
// Одноименное регламентное задание
Процедура ВыполнитьРассылку(ДатаСверкиПараметр) Экспорт
	
	ДатаСверки = ДатаСверкиПараметр;
	ВыводитьТолькоРасхождения = Истина;
	ИсточникДанныхДепозитария = "ФайловыйШлюз";
	
	РезультатСверки = 0;
	FileBody = Неопределено;
	ВложенныеФайлы = Новый Соответствие();
	
	МассивВариантовСверки = Новый Массив();
	МассивВариантовСверки.Добавить("ДепозитарийНРД");
	МассивВариантовСверки.Добавить("ДепозитарийБэкофис");
	
	Для Каждого ПерВариантСверки Из МассивВариантовСверки Цикл
		
		ВариантСверки = ПерВариантСверки;
		ВыполнитьСверку();
		РезультатСверки = РезультатСверки + ?(ЕстьРасхождение, pow(2, МассивВариантовСверки.Найти(ВариантСверки)), 0);
		
		Если РезультатСверки > 0 Тогда
			Поток = Новый ПотокВПамяти();
			Результат.Записать(Поток, ТипФайлаТабличногоДокумента.XLSX);
			ДвоичныеДанныеОтчет = Поток.ЗакрытьИПолучитьДвоичныеДанные();
			FileBody = Base64Строка(ДвоичныеДанныеОтчет);
			ВложенныеФайлы.Вставить(ВариантСверки, FileBody);
		КонецЕсли;
		
	КонецЦикла;
	
	ОтправитьEmailСообщение(ДатаСверки, РезультатСверки, ВложенныеФайлы);
	ОтправитьSmsСообщение(ДатаСверки, РезультатСверки);
	
КонецПроцедуры

Процедура ОтправитьEmailСообщение(ДатаСверки, РезультатСверки, ВложенныеФайлы)
	
	ТипСообщения = "EmailGen";
	НаименованиеШаблона = "СверкаДепоMail";
	ВнешнийИсточникРассылки = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaEmailGen;
	ВнешнийИсточникПолучатели = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаEmailСверкиДепо;
	НастройкиПолучателей = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточникПолучатели).Настройка;
	Получатели = НастройкиПолучателей.АдресПолучателя;
	
	MessageInfo = ОбменДаннымиКафка.ТиповыеДанныеMessageInfo(ТипСообщения, "INS", "1.0.0");
	Data = ДанныеDataEmail(ДатаСверки, Получатели, НаименованиеШаблона, РезультатСверки, ВложенныеФайлы);
	
	ТелоСообщения = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточникРассылки, ТипСообщения, ТелоСообщения);
	
КонецПроцедуры

Процедура ОтправитьSmsСообщение(ДатаСверки, РезультатСверки)
	
	ТипСообщения = "SmsGen";
	НаименованиеШаблона = "СверкаДепоSms";
	ВнешнийИсточникРассылки = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaSmsGen;
	ВнешнийИсточникПолучатели = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаSmsСверкиДепо;
	НастройкиПолучателей = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточникПолучатели).Настройка;
	Получатели = НастройкиПолучателей.АдресПолучателя;
	
	MessageInfo = ОбменДаннымиКафка.ТиповыеДанныеMessageInfo(ТипСообщения, "INS", "1.0.0");
	Data = ДанныеDataSms(ДатаСверки, Получатели, НаименованиеШаблона, РезультатСверки);
	
	ТелоСообщения = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточникРассылки, ТипСообщения, ТелоСообщения);
	
КонецПроцедуры

Функция ДанныеDataEmail(ДатаСверки, Получатели, НаименованиеШаблона, РезультатСверки, ВложенныеФайлы)
	
	Data = Новый Структура();
	Data.Вставить("Email", Получатели);
	Data.Вставить("MailTemplateId", Неопределено);
	Data.Вставить("MailTemplateTitle", НаименованиеШаблона);
	
	ReplaceFields = Новый Структура;
	ReplaceFields.Вставить("ПериодСверки", Формат(ДатаСверки, "ДЛФ=Д"));
	ReplaceFields.Вставить("СтатусСверкиДепоНрд", СтатусыСверки(РезультатСверки).СтатусСверкиДепоНрд);
	ReplaceFields.Вставить("СтатусСверкиДепоБк", СтатусыСверки(РезультатСверки).СтатусСверкиДепоBq);
	
	Attachments = Новый Массив;
	
	Для Каждого Файл Из ВложенныеФайлы Цикл
		File = Новый Структура();
		File.Вставить("FileName", Файл.Ключ);
		File.Вставить("FileExt", "XLSX");
		File.Вставить("FileBody", Файл.Значение);
		Attachments.Добавить(Новый Структура("File", File));
	КонецЦикла;
	
	Data.Вставить("ReplaceFields", ReplaceFields);
	Data.Вставить("Attachments", Attachments);
	
	Возврат Data;
	
КонецФункции

Функция ДанныеDataSms(ДатаСверки, Получатели, НаименованиеШаблона, РезультатСверки)
	
	Data = Новый Структура();
	
	Data.Вставить("Phone", Получатели);
	Data.Вставить("SmsTemplateId", Неопределено);
	Data.Вставить("SmsTemplateTitle", НаименованиеШаблона);
	EmailРассылка = Ложь;
	
	ReplaceFields = Новый Структура;
	ReplaceFields.Вставить("ПериодСверки", Формат(ДатаСверки, "ДЛФ=Д"));
	ReplaceFields.Вставить("СтатусСверкиДепоНрд", СтатусыСверки(РезультатСверки, EmailРассылка).СтатусСверкиДепоНрд);
	ReplaceFields.Вставить("СтатусСверкиДепоБк", СтатусыСверки(РезультатСверки, EmailРассылка).СтатусСверкиДепоBq);
	
	Data.Вставить("ReplaceFields", ReplaceFields);
	
	Возврат Data;
	
КонецФункции

Функция СтатусыСверки(РезультатСверки, ШаблонEmail = Истина)
	
	СтатусСверки = Новый Структура();
	StyleGreen = "<span style=background:LightGreen;>";
	StyleRed = "<span style=background:red;>";
	StyleEnd = "</span>";
	
	Если РезультатСверки = 0 Тогда
		
		СтатусСверкиДепоНрд = ?(ШаблонEmail, (StyleGreen + "OK" + StyleEnd), "OK");
		СтатусСверкиДепоBq = ?(ШаблонEmail, (StyleGreen + "OK" + StyleEnd), "OK");
		
	ИначеЕсли РезультатСверки = 1 Тогда
		
		СтатусСверкиДепоНрд = ?(ШаблонEmail, (StyleRed + "ERROR" + StyleEnd), "ERROR");
		СтатусСверкиДепоBq = ?(ШаблонEmail, (StyleGreen + "OK" + StyleEnd), "OK");
		
	ИначеЕсли РезультатСверки = 2 Тогда
		
		СтатусСверкиДепоНрд = ?(ШаблонEmail, (StyleGreen + "OK" + StyleEnd), "OK");
		СтатусСверкиДепоBq = ?(ШаблонEmail, (StyleRed + "ERROR" + StyleEnd), "ERROR");
		
	Иначе
		
		СтатусСверкиДепоНрд = ?(ШаблонEmail, (StyleRed + "ERROR" + StyleEnd), "ERROR");
		СтатусСверкиДепоBq = ?(ШаблонEmail, (StyleRed + "ERROR" + StyleEnd), "ERROR");
		
	КонецЕсли;
	
	СтатусСверки.Вставить("СтатусСверкиДепоНрд", СтатусСверкиДепоНрд);
	СтатусСверки.Вставить("СтатусСверкиДепоBq", СтатусСверкиДепоBq);
	
	Возврат СтатусСверки;
	
КонецФункции

#КонецОбласти

АДО = Неопределено;
