#Область КомандыФормы

// Процедура - Команда отмена на сервере
//
&НаСервере
Процедура КомандаОтменаНаСервере()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.СбросПроцесса();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

// Процедура - Команда отмена
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура КомандаОтмена(Команда)
	КомандаОтменаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Служебные

// Процедура - Управление видимостью
//
// Параметры:
//  Объект	 - 	 - 
//
&НаСервере
Процедура УправлениеВидимостью(Объект)
	Если Объект.Стартован Тогда
		//ЭтаФорма.ТолькоПросмотр = Истина;
		Если Элементы.Найти("ФормаСтартИЗакрыть") <> Неопределено Тогда
			Элементы.ФормаСтартИЗакрыть.Видимость = Ложь;
		КонецЕсли;
		Если Элементы.Найти("ФормаСтарт") <> Неопределено Тогда
			Элементы.ФормаСтарт.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Элементы.Найти("ФормаАктивировать") <> Неопределено Тогда
		Элементы.ФормаАктивировать.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

// Функция - Получить список котировок
// 
// Возвращаемое значение:
//   - СписокЗначений содаржащий имена числовых ресусров регистра Котировки
//
&НаСервереБезКонтекста
Функция ПолучитьСписокКотировок()
	СписокКотировок = Новый СписокЗначений;
	Для Каждого Ресурс Из Метаданные.РегистрыСведений.Котировки.Ресурсы Цикл
		Если Ресурс.Тип.СодержитТип(Тип("Число")) Тогда
			СписокКотировок.Добавить(Ресурс.Имя, Ресурс.Синоним + " [" + Ресурс.Имя + "]");
		КонецЕсли;
	КонецЦикла;
	Возврат СписокКотировок;
КонецФункции

// Функция - Получить владельца данных
//
// Параметры:
//  Данные	 - 	 - Ссылка на объект, Владельца которого надо получить
// 
// Возвращаемое значение:
//   - Ссылка на объект
//
&НаСервереБезКонтекста
Функция ПолучитьВладельцаДанных(Данные)
	Возврат ОбщегоНазначения.ПолучитьЗначениеРеквизита(Данные, "Владелец");
КонецФункции

// Функция - Есть дни с незагруженными котировками
//
// Параметры:
//  ДатаНачисленияКомиссии	 - 	 - 
// 
// Возвращаемое значение:
//   - Булево
//
&НаСервереБезКонтекста
Функция ЕстьДниСНезагруженнымиКотировками(ДатаНачисленияКомиссии)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	0 КАК Цифра
	|ПОМЕСТИТЬ Цифры
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&КонДата, МЕСЯЦ), ДЕНЬ, Цифры1.Цифра + 10 * Цифры2.Цифра + 100 * Цифры3.Цифра + 1000 * Цифры4.Цифра) КАК День
	|ПОМЕСТИТЬ Дни
	|ИЗ
	|	Цифры КАК Цифры1,
	|	Цифры КАК Цифры2,
	|	Цифры КАК Цифры3,
	|	Цифры КАК Цифры4
	|ГДЕ
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&КонДата, МЕСЯЦ), ДЕНЬ, Цифры1.Цифра + 10 * Цифры2.Цифра + 100 * Цифры3.Цифра + 1000 * Цифры4.Цифра) <= &КонДата
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	День
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Котировки.Период КАК Период
	|ПОМЕСТИТЬ ДниКотировок
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|ГДЕ
	|	Котировки.Период МЕЖДУ &НачДата И &КонДата
	|	И Котировки.Биржа = &Биржа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Дни.День КАК День,
	|	ДниКотировок.Период КАК Период
	|ИЗ
	|	Дни КАК Дни
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДниКотировок КАК ДниКотировок
	|		ПО (ДниКотировок.Период = Дни.День)
	|ГДЕ
	|	(ДниКотировок.Период ЕСТЬ NULL
	|			ИЛИ ДниКотировок.Период = ДАТАВРЕМЯ(1, 1, 1))");
	
	Запрос.УстановитьПараметр("Биржа", Константы.МестоХраненияПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("НачДата", НачалоМесяца(ДатаНачисленияКомиссии));
	Запрос.УстановитьПараметр("КонДата", ДатаНачисленияКомиссии);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

#КонецОбласти

#Область События

// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Объект.ДатаНачисленияКомиссии) Тогда
		Объект.ДатаНачисленияКомиссии = НачалоМесяца(ТекущаяДата()) - 1;
	КонецЕсли;
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Объект.ШкалаКотировок) Тогда
		Объект.ШкалаКотировок = "РыночнаяЦена";
	КонецЕсли;
	//
	ЗаблокироватьДанныеДляРедактирования(Объект.Ссылка, , ЭтаФорма.УникальныйИдентификатор);
	УправлениеВидимостью(Объект);
КонецПроцедуры

// Процедура - При открытии
//
// Параметры:
//  Отказ	 - 	 - 
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Заполнение списка выбора ресурса
	Элементы.ШкалаКотировок.СписокВыбора.Очистить();
	СписокКотировок = ПолучитьСписокКотировок();
	Для Каждого Котировка Из СписокКотировок Цикл
		Элементы.ШкалаКотировок.СписокВыбора.Добавить(Котировка.Значение, Котировка.Представление);
	КонецЦикла;
КонецПроцедуры

// Процедура - Перед стартом
//
// Параметры:
//  Отказ	 - 	 - 
//
&НаКлиенте
Процедура ПередСтартом(Отказ)
	Если ЕстьДниСНезагруженнымиКотировками(Объект.ДатаНачисленияКомиссии) Тогда
		
		Ответ = Вопрос("За период обнаружены дни с незагруженными котировками!
		|Продолжить?", РежимДиалогаВопрос.ДаНет);
		
		Если Не Ответ = КодВозвратаДиалога.Да Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

// Процедура - Комиссии выгодоприобретатель начало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаКлиенте
Процедура КомиссииВыгодоприобретательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Комиссии.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Договор) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыОтбора = Новый Структура("Владелец", ПолучитьВладельцаДанных(ТекущиеДанные.Договор));
		ОткрытьФорму("Справочник.Субклиенты.ФормаВыбора", Новый Структура("Отбор", ПараметрыОтбора), Элемент);
	КонецЕсли;
КонецПроцедуры

// Процедура - Комиссии договор при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура КомиссииДоговорПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Комиссии.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Выгодоприобретатель)
		И ПолучитьВладельцаДанных(ТекущиеДанные.Выгодоприобретатель) <> ПолучитьВладельцаДанных(ТекущиеДанные.Договор) Тогда
		ТекущиеДанные.Выгодоприобретатель = ПредопределенноеЗначение("Справочник.Субклиенты.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
