#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиОбработки = Неопределено;
	Если ТипЗнч(Параметры.НастройкиАлгоритма) = Тип("Структура") тогда
		НастройкиОбработки = Параметры.НастройкиАлгоритма;
	Иначе
		ДопОбработка = Неопределено;
		Если Параметры.Свойство("ДополнительнаяОбработкаСсылка", ДопОбработка) Тогда
			НастройкиОбработки = Справочники.ДополнительныеОтчетыИОбработки.НастройкиОбработки(ДопОбработка);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиОбработки) Тогда
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.УстановитьПользовательскиеНастройки(НастройкиОбработки);
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	Заголовок = "";
	ЗначенияПараметров = УстановитьПараметры(Заголовок);
	ОповеститьОВыборе(новый Структура("Значения,ЗаголовокНастроек", ЗначенияПараметров,Заголовок));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция УстановитьПараметры(Заголовок)
	
	Значения = Новый Структура;
	Значения.Вставить("Организация", Объект.Организация);
	Значения.Вставить("ЦентральныеСчетУК", Объект.ЦентральныеСчетУК);
	Значения.Вставить("КомиссияВыводСтороннийБанк", Объект.КомиссияВыводСтороннийБанк);
	Значения.Вставить("УниверсальнаяОбработкаВыводовРозничногоДУ", Объект.УниверсальнаяОбработкаВыводовРозничногоДУ);
	Значения.Вставить("Пул", Объект.Пул);
	Значения.Вставить("АдресВебДО", Объект.АдресВебДО);
	Значения.Вставить("ПользовательДО", Объект.ПользовательДО);
	Значения.Вставить("ПарольДО", Объект.ПарольДО);
	Значения.Вставить("АдресВебФИН", Объект.АдресВебФИН);
	Значения.Вставить("ПользовательФИН", Объект.ПользовательФИН);
	Значения.Вставить("ПарольФИН", Объект.ПарольФИН);
	Значения.Вставить("АдресВебФO", Объект.АдресВебФO);
	Значения.Вставить("ПризнакПереводаДС", Объект.ПризнакПереводаДС);
	Значения.Вставить("ПочтовыйЛогин", Объект.ПочтовыйЛогин);
	Значения.Вставить("ЕРС", Объект.ЕРС);
	Значения.Вставить("ОбработкаНачисленияВознаграждения", Объект.ОбработкаНачисленияВознаграждения);
	Значения.Вставить("КаталогСохранения", Объект.КаталогСохранения);
	Значения.Вставить("НДФЛИзFinance", Объект.НДФЛИзFinance);
	Значения.Вставить("КонтрагентИФНС", Объект.КонтрагентИФНС);
	Значения.Вставить("ДоговорИФНС", Объект.ДоговорИФНС);
	Значения.Вставить("СчетИНФС", Объект.СчетИНФС);
	Значения.Вставить("ДатаЗакрытияПредыдущийРабочийДень", Объект.ДатаЗакрытияПредыдущийРабочийДень);
	Значения.Вставить("КаталогСохранения", Объект.КаталогСохранения);
	Значения.Вставить("КаталогСохраненияКабинетаДУ", Объект.КаталогСохраненияКабинетаДУ);
	Значения.Вставить("ШаблонППВознаграждения", Объект.ШаблонППВознаграждения);
	Значения.Вставить("ШаблонППКомиссии", Объект.ШаблонППКомиссии);
	Значения.Вставить("ШаблонППНДФЛ", Объект.ШаблонППНДФЛ);
	Значения.Вставить("СписокРассылки", XMLСтрока(Новый ХранилищеЗначения(Объект.СписокРассылки.Выгрузить())));
	
	Представление = ?(ЗначениеЗаполнено(Объект.Пул),"Settings have been set:"+Объект.Пул,"");
	
	Заголовок = Представление;
	Заголовок = СокрЛП(Заголовок);

	Возврат Значения;

КонецФункции

#КонецОбласти


