
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("РежимВыбора", Элементы.Список.РежимВыбора);
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекСтрока = Неопределено Тогда
		Возврат;		
	КонецЕсли; 
	
	Если ТекТарифныйПлан = ТекСтрока Тогда
		Возврат;		
	КонецЕсли; 
	
	ТекТарифныйПлан = ТекСтрока;
	ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиНаКлиенте", 0.1, Истина);
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьОсновным(Команда)
		
	Если НЕ ЗначениеЗаполнено(ТекТарифныйПлан) Тогда
		Возврат;		
	КонецЕсли; 
	
	УстановитьОсновнымНаСервере(ТекТарифныйПлан);
	ОповеститьОбИзменении(ТекТарифныйПлан);
	НастроитьДоступностьКнопкиУстановитьОсновным();
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

//#Область Диалог

//#Область ОбработчикиОжидания

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиНаКлиенте()
	НастроитьДоступностьКнопкиУстановитьОсновным();	
	
КонецПроцедуры
 
//#КонецОбласти 

//#Область НастройкаФормы

&НаКлиенте
Процедура НастроитьДоступностьКнопкиУстановитьОсновным()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ДоступностьКнопки = Ложь;
	Иначе
		ДоступностьКнопки = НЕ ЭтоОсновнойТарифныйПлан(ТекТарифныйПлан);
	КонецЕсли; 
	
	Элементы.ФормаУстановитьОсновным.Доступность = ДоступностьКнопки;
	
КонецПроцедуры

//#КонецОбласти 

//#КонецОбласти 

//#Область ВызовСервера

&НаСервере
Процедура УстановитьОсновнымНаСервере(Знач ТарифныйПлан)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТарифныеПланы.Ссылка
	|ИЗ
	|	Справочник.ТарифныеПланы КАК ТарифныеПланы
	|ГДЕ
	|	ТарифныеПланы.ОсновнойТарифныйПлан.Наименование <> &Наименование";
	Запрос.УстановитьПараметр("Наименование","");
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	Если Результат.Количество() <> 0 Тогда
		НеОсновнойТП = Результат.Ссылка.ПолучитьОбъект();
		НеОсновнойТП.ОсновнойТарифныйПлан = Справочники.ТарифныеПланы.ПустаяСсылка(); 
		НеОсновнойТП.Записать();
	КонецЕсли;	
	
	ОсновнойТП = ТарифныйПлан.ПолучитьОбъект();
	ОсновнойТП.ОсновнойТарифныйПлан = ТарифныйПлан;
	ОсновнойТП.Записать();		
КонецПроцедуры 

//#КонецОбласти 

//#Область СборДанных

&НаСервере
Функция ЭтоОсновнойТарифныйПлан(Знач ТарифныйПлан)
	ВладелецОсновногоТП = Справочники.ТарифныеПланы.НайтиПоРеквизиту("ОсновнойТарифныйПлан", ТарифныйПлан);
	Возврат ЗначениеЗаполнено(ВладелецОсновногоТП);	
КонецФункции

//#КонецОбласти 
 
//#КонецОбласти