#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение") Тогда
		
		Если Основание.ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеСчетаДепо Тогда 
			Дата = ?(ЗначениеЗаполнено(Основание.ДатаИсполненияПоручения), Основание.ДатаИсполненияПоручения, Основание.Дата);
			ДокументОснование = Основание;
			ВладелецСчета = Основание.Депонент;
			
			Запрос = новый Запрос("ВЫБРАТЬ
			                      |	ДоговорыКонтрагентов.Ссылка
			                      |ИЗ
			                      |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			                      |ГДЕ
			                      |	ДоговорыКонтрагентов.Владелец = &Владелец
			                      |	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
			                      |	И (ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.Депозитарный)
								  |	ИЛИ ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.МежДепозитарный))");
			Запрос.УстановитьПараметр("Владелец", ВладелецСчета);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				НомерДепозитарногоДоговора = Выборка.ссылка.Код;
				ДатаДепозитарногоДоговора = Выборка.Ссылка.ДатаначалоДействия;
			Иначе
				Проверка = Истина;
				Сообщить("Отсутствует депозитарный договор. Документ не создан.");
				Возврат;	
			КонецЕсли;
			
			ВидСчетаДепо = Основание.ВидСчетаДепо;
			ТипСчетаДепо = Основание.ТипСчетаДепо;
			
			Если ТипЗнч(ВладелецСчета) = Тип("СправочникСсылка.Контрагенты") Тогда
				СчетДепоМХ = Основание.СчетДепоМХ;
				НомерСчета = НомерСчетаДепо();
			Иначе
				НомерСчета = Основание.НомерСчета;
			КонецЕсли;
			
			Комментарий = Основание.Комментарий;
			
		Иначе
			
			Проверка = Истина;
			Сообщить("На основании данного вида поручения нельзя сделать документ Открытие счета.");
			Возврат;	
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбщегоНазначения.ПроверкаЗаполненностиРеквизитов1(ВладелецСчета) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Если ТипЗнч(ВладелецСчета) = Тип("СправочникСсылка.МестаХранения") Тогда
		
		// для МХ движения по услугам не выполняем
		Возврат;
	
	КонецЕсли; 

	РасчетныеПараметры = РасчетТарифов.РасчетСтоимостиУслуги(
							Дата,
							Справочники.ДоговорыКонтрагентов.НайтиПоКоду(Лев(СокрЛП(СчетДЕПО.Код),7)),
							Новый Структура("Операция, МестоХранения1, МестоХранения2",Справочники.ВидыОпераций.ОткрытиеСчетаДепо,Неопределено,Неопределено));
	
	Если РасчетныеПараметры <> Неопределено Тогда
								
		Движение = Движения.УслугиДепозитария.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Инициатор = ВладелецСчета;
		Движение.Услуга = РасчетныеПараметры.Услуга;
		Движение.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118;
		Движение.Валюта = РасчетныеПараметры.Валюта;
		Движение.Сумма = РасчетныеПараметры.Сумма;
		Движение.СуммаВВалюте = Конвертации.КонвертацияВалюты(Дата, Движение.Сумма, РасчетныеПараметры.Валюта);
		Движение.СуммаНДС = РасчетТарифов.РТ_РасчетНДС(Движение.СтавкаНДС, Движение.Сумма);
		Движение.СуммаВсего = РасчетТарифов.РТ_ОбщаяСумма(Движение.СтавкаНДС,Движение.Сумма,Движение.СуммаНДС);
		Движение.Сумма = Движение.СуммаВсего - Движение.СуммаНДС;
		Движение.ТипТарифа = РасчетныеПараметры.ТипТарифа;
		Движение.Тариф = РасчетныеПараметры.Тариф;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = Оболочки.ПредставлениеДокументаПоСобытию(ЭтотОбъект, "Запись");
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		СоздатьОбновитьСчетДепоДепонента(Отказ, Заголовок);
		Если ТипЗнч(ВладелецСчета) = Тип("СправочникСсылка.СчетаДепо") И Не ЗначениеЗаполнено(СчетДепоМХ) Тогда
			ТекстСообщения = "Поле ""Счет депо МХ"" не заполнено";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СчетДепоМХ", , Отказ);
			ЗаписьЖурналаРегистрации("Проверка заполнения реквизитов документа ""Открытие счета депо""",
				УровеньЖурналаРегистрации.Ошибка, , Ссылка, ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Проведен И ТипЗнч(ВладелецСчета) = Тип("СправочникСсылка.Контрагенты") Тогда
		НовыйОбъект	= СчетДепо.ПолучитьОбъект();
		НовыйОбъект.ОперацияОткрытияСчета = Ссылка;
		НовыйОбъект.Записать();
		
		Если Не ЗначениеЗаполнено(ТарифныйПлан) Тогда
			ДоговорНаОбслуживание = Справочники.ДоговорыКонтрагентов.НайтиПоКоду(Лев(СокрЛП(НовыйОбъект.Ссылка.Код), 7), , , ВладелецСчета);
			Если НЕ ДоговорНаОбслуживание.Пустая() Тогда
				ТарифныйПлан = ДоговорНаОбслуживание.ТарифныйПлан;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Помечаем на удаление счет депо и убираем ссылки на документ открытия
	Если ЗначениеЗаполнено(СчетДепо) Тогда
		СчетДепоОбъект 					= СчетДепо.ПолучитьОбъект();
		СчетДепоОбъект.ПометкаУдаления 	= Истина;
		Если ТипЗнч(ВладелецСчета) = Тип("СправочникСсылка.Контрагенты") Тогда
			СчетДепоОбъект.ОперацияОткрытияСчета = Документы.ОткрытиеСчетаДепо.ПустаяСсылка();
		КонецЕсли;
		СчетДепоОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Процедура создания счета депо депонента.
//
Процедура СоздатьОбновитьСчетДепоДепонента(Отказ, Заголовок)
	ДанныйНомерСчетаЗанят(Отказ, Заголовок, ВладелецСчета);
	Если Отказ Тогда
		Возврат;
	Конецесли;
	
	Если ТипЗнч(ВладелецСчета) = Тип("СправочникСсылка.МестаХранения") Тогда
		ТипСпр = "СчетаДепоМХ";
	Иначе
		ТипСпр = "СчетаДепо";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СчетДепо) ИЛИ (СчетДепо.ПолучитьОбъект() = Неопределено) Тогда
		нашли = Ложь;
		Отбор = Новый Структура("Код", НомерСчета);
		Выборка = Справочники[ТипСпр].Выбрать(,,Отбор);
		Пока Выборка.Следующий() Цикл
			СпрСсылка = Выборка.Ссылка;
			Если СпрСсылка.ВходящийНомерПоручения = ДокументОснование Тогда
				НовыйОбъект	= СпрСсылка.ПолучитьОбъект();
				нашли = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не нашли Тогда
			НовыйОбъект =	Справочники[ТипСпр].СоздатьЭлемент();
		КонецЕсли;
	Иначе
		НовыйОбъект	= СчетДепо.ПолучитьОбъект();
		Если НовыйОбъект.ПометкаУдаления Тогда
			НовыйОбъект.ПометкаУдаления = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	
	НовыйОбъект.Владелец							=   ВладелецСчета;
	НовыйОбъект.ВходящийНомерПоручения				=	ДокументОснование.Ссылка;
	Если ТипЗнч(НовыйОбъект.ссылка)=Тип("СправочникСсылка.СчетаДепоМХ") Тогда
		НовыйОбъект.ДатаДоговора					=	ДатаДепозитарногоДоговора;
		НовыйОбъект.НомерДоговора					=	НомерДепозитарногоДоговора;
		НовыйОбъект.ТипСчета						=	ТипСчетаДепо;
	Иначе
		НовыйОбъект.ДатаЗаключенияДепозитарногоДоговора	=	ДатаДепозитарногоДоговора;
		НовыйОбъект.НомерДепозитарногоДоговора			=	НомерДепозитарногоДоговора;
		НовыйОбъект.ТипСчетаДепо						=	ТипСчетаДепо;
		НовыйОбъект.ПризнакСчетаДепо					=	Перечисления.ПризнакиСчетаДепо.СчетДепонента;		
		
		ТипСчетаДепоFCDR_2017_02						= 	ЗаполнитьТипСчетаДепоFCDR_2017_02();
		УстановитьТипДепонентаВладельцу(НовыйОбъект.Владелец);
		
		Если ЗначениеЗаполнено(ТипСчетаДепоFCDR_2017_02) Тогда			
			
			НовыйОбъект.ТипСчетаДепоFCDR_2017_02 = ТипСчетаДепоFCDR_2017_02;
			
			Если ТипСчетаДепоFCDR_2017_02.ЕстьБенефициар Тогда
				
				НовыйОбъект.ТипСчетаБенефициараFCDR_2017_02 = ТипСчетаДепоFCDR_2017_02.ТипСчетаБенефициара;		
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	НовыйОбъект.ВидСчетаДепо						=	ВидСчетаДепо;
	НовыйОбъект.ДатаОткрытияСчета					=	Дата;  
	НовыйОбъект.СтатусСчетаДепо						=	Перечисления.СтатусыСчетовДепо.Открыт;
	НовыйОбъект.Наименование						=	ВладелецСчета.Наименование;
	НовыйОбъект.Код									=	НомерСчета;
	Если ТипЗнч(НовыйОбъект) = Тип("СправочникОбъект.СчетаДепо") Тогда
		НовыйОбъект.СчетДепоМХ						=	СчетДепоМХ;
	КонецЕсли;
	НовыйОбъект.Записать();
	НомерСчета										=	НовыйОбъект.Код;
	
	Если Не ЗначениеЗаполнено(СчетДепо) или (СчетДепо.ПолучитьОбъект() = Неопределено) Тогда
		СчетДепо =	НовыйОбъект.Ссылка;
	КонецЕсли;
	
КонецПроцедуры //СоздатьОбновитьСчетДепоДепонента()

Функция ЗаполнитьТипСчетаДепоFCDR_2017_02()
	
	Если ЗначениеЗаполнено(ТипСчетаДепо) Тогда
			
		СоответствиеТиповСчетов = Новый Соответствие();
		СоответствиеТиповСчетов.Вставить(Перечисления.ТипыСчетовДепо.Владельца,"OWNE");
		СоответствиеТиповСчетов.Вставить(Перечисления.ТипыСчетовДепо.ВладельцаТорговый,"OWNE");
		СоответствиеТиповСчетов.Вставить(Перечисления.ТипыСчетовДепо.ИностранногоНоминальногоДержателя,"OWNE");
		СоответствиеТиповСчетов.Вставить(Перечисления.ТипыСчетовДепо.ИностранногоНоминальногоДержателяТорговый,"OWNE");
		СоответствиеТиповСчетов.Вставить(Перечисления.ТипыСчетовДепо.ДоверительногоУправляющего,"TRUS");
		СоответствиеТиповСчетов.Вставить(Перечисления.ТипыСчетовДепо.ДоверительногоУправляющегоТорговый,"TRUS");
		СоответствиеТиповСчетов.Вставить(Перечисления.ТипыСчетовДепо.ИностранногоУполномоченногоДержателя,"FTRS");
		СоответствиеТиповСчетов.Вставить(Перечисления.ТипыСчетовДепо.ИностранногоУполномоченногоДержателяТорговый,"FTRS");
			
		Возврат Справочники.ТипыСчетовДепоFCDR_2017_02.НайтиПоКоду(СоответствиеТиповСчетов.Получить(ТипСчетаДепо));
			
	КонецЕсли;		
			
КонецФункции

// Проверяет возможность использования счета
//
// Параметры
//  Нет
//
// Возвращаемое значение:
//  Булево       - Истина - номер не занят, Ложь - занят
Процедура ДанныйНомерСчетаЗанят(Отказ, Заголовок, ВладелецСчета)
	Если ТипЗнч(ВладелецСчета) = Тип("СправочникСсылка.МестаХранения") Тогда
		Возврат;
	Иначе
		ТипСпр = "СчетаДепо";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ссылка,
	|	ВходящийНомерПоручения,
	|	ПризнакСчетаДепо
	|ИЗ
	|	Справочник.СчетаДепо КАК СчетаДепо
	|ГДЕ
	|
	|	НЕ ПометкаУдаления
	|	И
	|	ПризнакСчетаДепо = ЗНАЧЕНИЕ(Перечисление.ПризнакиСчетаДепо.СчетДепонента)
	|	И
	|	Код = &Код
	|	И
	|	НЕ Ссылка = &СчетДепо";

	Запрос.УстановитьПараметр("Код"		, НомерСчета);
	Запрос.УстановитьПараметр("СчетДепо", СчетДепо);
	
	Результат = Запрос.Выполнить().Выгрузить();	
	
	Для Каждого Строка ИЗ Результат Цикл
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Если Строка.ВходящийНомерПоручения = ДокументОснование Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Отказ = Истина;
		СтрокаСообщения = "Данный номер счета занят у "+СокрЛП(Строка.Ссылка.Владелец.Наименование);
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаСообщения, Истина, Заголовок);
		Прервать;
	КонецЦикла;
КонецПроцедуры // ДанныйНомерСчетаНеЗанят()

Функция НомерСчетаДепо()
	
	Если ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ Тогда
		Постфикс = "FI";
	Иначе
		Постфикс = РегистрыСведений.ПравилаГенерацииНомеровСчетовДепо.ПостфиксНаДату(ТекущаяДатаСеанса(), СчетДепоМХ,
			ВидСчетаДепо, ТипСчетаДепо);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(СчетаДепо.Ссылка) КАК КоличествоСчетов
	|ИЗ
	|	Справочник.СчетаДепо КАК СчетаДепо
	|ГДЕ
	|	СчетаДепо.ВидСчетаДепо = &ВидСчетаДепо
	|	И &УсловиеПоТипуСчетаДепо
	|	И СчетаДепо.Код ПОДОБНО &НомерДепозитарногоДоговора + ""%""";
	
	мНомерДоговора = СокрЛП(НомерДепозитарногоДоговора);
	Запрос.УстановитьПараметр("НомерДепозитарногоДоговора", мНомерДоговора);
	Запрос.УстановитьПараметр("ВидСчетаДепо", ВидСчетаДепо);
	
	Если Постфикс = Неопределено Тогда
		Постфикс = "";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоТипуСчетаДепо", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоТипуСчетаДепо", "СчетаДепо.ТипСчетаДепо = &ТипСчетаДепо");
		Запрос.УстановитьПараметр("ТипСчетаДепо", ТипСчетаДепо);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если Выборка.КоличествоСчетов = 0 Тогда
		НомерПоПорядку = "";
	Иначе
		НомерПоПорядку = Формат(Выборка.КоличествоСчетов, "ЧГ=");
	КонецЕсли;
	
	НомерСчетаДепо = мНомерДоговора + Постфикс + НомерПоПорядку;
	Возврат НомерСчетаДепо;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыПечати

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	СтруктураПечатныхФорм = Новый Структура;
	СтруктураПечатныхФорм.Вставить("Уведомление","Уведомление об открытии счета ДЕПО");
	Возврат СтруктураПечатныхФорм;
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	Если ИмяМакета = "Уведомление" Тогда
		Если ВладелецСчета = Неопределено Тогда
			Сообщить("Не определен владелец счета депо.");
			Возврат;
		КонецЕсли;	
		
		Если ТипЗнч(ВладелецСчета) = Тип("СправочникСсылка.МестаХранения") Тогда
			#Если ТолстыйКлиентобычноеПриложение Тогда
			Предупреждение("Печатная форма не определена для владельца счета с типом ""Место хранения""");
			#иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печатная форма не определена для владельца счета с типом ""Место хранения""");
			#КонецЕсли
			Возврат;
		КонецЕсли;	
		
		ТабДок = Новый ТабличныйДокумент;
		Макет = Документы.ОткрытиеСчетаДепо.ПолучитьМакет(ИмяМакета);
		// Заголовок
		Область = Макет.ПолучитьОбласть("Заголовок");
		
		Депозитарий = Константы.ОрганизацияПоУмолчанию.Получить();
		Если Депозитарий.Пустая() тогда
			Сообщить("Не выбрано значение организации, используемое по умолчанию!!!");
			Возврат;
		КонецЕсли;

		Область.Параметры.Организация	= "Депозитарий "+Депозитарий.Наименование; 
		ДанныеЛицензии					= ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Депозитарий);
		Область.Параметры.ДатаЛицензии	= Формат(ДанныеЛицензии.ДатаЛицензии,"ДЛФ=DD");
		Область.Параметры.НомерЛицензии	= "Лицензия № " +ДанныеЛицензии.НомерЛицензии; 
		Область.Параметры.ФактАдрес		= КонтактнаяИнформация.ПолучитьАдресИзКонтактнойИнформации(Депозитарий,"Фактический");
		Область.Параметры.ТелФакс		= КонтактнаяИнформация.ПолучитьТелефонИзКонтактнойИнформации(Депозитарий);
		ТабДок.Вывести(Область);
	    	
		// Шапка
		Область = Макет.ПолучитьОбласть("Шапка");
		ОбластьЮр = Макет.ПолучитьОбласть("ШапкаЮр");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		Область.Параметры.ДанныеДоговор	 	= "   Настоящим извещаем, что согласно договора счета депо "
											+ "(договора о междепозитарных отношениях) №"
											+ ВладелецСчета.ОсновнойДоговорКонтрагента.Код+ " от "
											+ Формат(ВладелецСчета.ОсновнойДоговорКонтрагента.ДатаНачалоДействия,"ДЛФ=DD");
		Область.Параметры.ДанныеДепонент 	= "Депоненту   ["+ ВладелецСчета.НаименованиеПолное + "]";
		Область.Параметры.ДанныеОрганизация = "в Депозитарии " + Депозитарий.НаименованиеПлательщикаПриПеречисленииНалогов + " открыт счет депо:";
		//установка типа счета
		Если ТипСчетаДепо = Перечисления.ТипыСчетовДепо.Залогодержателя Тогда
			Область.Параметры.Собственник 			= "[ ]";
			Область.Параметры.Залогодержатель		= "[Х]";
			ОбластьЮр.Параметры.ДУ                    = "[ ]";
			ОбластьЮр.Параметры.НД                    = "[ ]"; 
			
		ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.Владельца  Тогда	
			Область.Параметры.Собственник 			= "[Х]";
			Область.Параметры.Залогодержатель		= "[ ]";
			ОбластьЮр.Параметры.ДУ                    = "[ ]";
			ОбластьЮр.Параметры.НД                    = "[ ]";
		ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ДоверительногоУправляющего  Тогда	
			Область.Параметры.Собственник 			= "[ ]";
			Область.Параметры.Залогодержатель		= "[ ]";
			ОбластьЮр.Параметры.ДУ                    = "[Х]";
			ОбластьЮр.Параметры.НД                    = "[ ]";
		ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.НоминальногоДержателя  Тогда	
			Область.Параметры.Собственник 			= "[ ]";
			Область.Параметры.Залогодержатель		= "[ ]";
			ОбластьЮр.Параметры.ДУ                    = "[ ]";
			ОбластьЮр.Параметры.НД                    = "[Х]";
		Иначе
			Область.Параметры.Собственник 			= "[ ]";
			Область.Параметры.Залогодержатель		= "[ ]";
			ОбластьЮр.Параметры.ДУ                    = "[ ]";
			ОбластьЮр.Параметры.НД                    = "[ ]";
			Сообщить("Не правильно указан тип счета депо!");
		КонецЕсли;                                    
		
		//установка номера счета депо
		НомерКодаСчета = 1;
		Пока НомерКодаСчета < 12 Цикл
		
			ОбластьПодвал.Параметры["П"+НомерКодаСчета]        = Сред(СокрЛП(НомерСчета),НомерКодаСчета,1);
	        НомерКодаСчета	 =	НомерКодаСчета + 1;
			
		КонецЦикла; 
		
		ОбластьПодвал.Параметры.Дата 		= Формат(Дата,"ДЛФ=DD");
		ОбластьПодвал.Параметры.Номер 	= Номер;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда 
		ОбластьПодвал.Параметры.РасшифровкаИсполнитель = глТекущийПользователь.Наименование;
		#КонецЕсли
		
		ТабДок.Вывести(Область);
		Если типЗнч(ВладелецСчета) = Тип("СправочникСсылка.Контрагенты") Тогда
			Если ВладелецСчета.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
				
				ТабДок.Вывести(ОбластьЮр);
				
			КонецЕсли;
		иначе
			
			ТабДок.Вывести(ОбластьЮр);
			
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьПодвал);
		
		ТабДок.ОтображатьСетку 		= Ложь;
		ТабДок.Защита 				= Ложь;
		ТабДок.ТолькоПросмотр 		= Истина;
		ТабДок.ОтображатьЗаголовки 	= Ложь;
		ТабДок.АвтоМасштаб			= Истина;
		ТабДок.Показать();	
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	СтандартнаяОбработка = Ложь;
	Если РучнойВвод Тогда
		Возврат;
	КонецЕсли;
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
КонецПроцедуры

#КонецОбласти

Процедура УстановитьТипДепонентаВладельцу(ДепонентСсылка)
	Если ДепонентСсылка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		ФизическоеЛицо = ДепонентСсылка.ЮридическиеФизическиеЛица;
		Если Не ЗначениеЗаполнено(ФизическоеЛицо.ТипДепонента) И Не ДепонентСсылка.Резидент Тогда
			ФизическоеЛицоОбъект = ФизическоеЛицо.ПолучитьОбъект();
			КодТипаДепонентаДляНаселенияИНКО = "S14";
			ФизическоеЛицоОбъект.ТипДепонента = Справочники.ТипыДепонентов.НайтиПоКоду(КодТипаДепонентаДляНаселенияИНКО);
			ФизическоеЛицоОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
