
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТабличныйДокумент = Объект.Ссылка.НастройкиОтображения.Получить();
		СКД = Объект.Ссылка.СхемаКомпоновкиДанных.Получить();
		Если СКД = Неопределено Тогда
			СКД = Справочники.ВидыИнвентарныхПоручений.ПолучитьМакет("РеквизитыПоручения");
		КонецЕсли; 
	Иначе
		СКД = Справочники.ВидыИнвентарныхПоручений.ПолучитьМакет("РеквизитыПоручения");
	КонецЕсли; 
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	
	Колонки = Новый Соответствие;
	Колонки.Вставить("Группа", 7);
	Колонки.Вставить("Элемент", 6);
	Колонки.Вставить("Значение", 5);
	Колонки.Вставить("НомерГруппы", 9);
	Колонки.Вставить("НомерЭлемента", 10);
	Колонки.Вставить("Отображать", 8);
	Колонки.Вставить("Обязательное", 11);
	Колонки.Вставить("Таблица", 2);
	
	НомераКолонок = Новый ФиксированноеСоответствие(Колонки);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформлениеТабличногоДокумента()
	Для НомерСтроки = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл
		Для НомерКолонки = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
			Если ТабличныйДокумент.Область("R" + НомерСтроки + "C" + НомерКолонки).Формат <> "" Тогда
				ТабличныйДокумент.Область("R" + НомерСтроки + "C" + НомерКолонки).ЦветТекста = WebЦвета.СинийСоСтальнымОттенком;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
	СтандартнаяОбработка = Ложь;
	Область.Текст = "[" + ПараметрыПеретаскивания.Значение[0].Поле + "]";
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.НастройкиОтображения = Новый ХранилищеЗначения(ТабличныйДокумент);
	Если СхемаОтличаетсяОтАктуальной(АдресСхемыКомпоновкиДанных) Тогда
		ТекущийОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных));
	Иначе
		ТекущийОбъект.СхемаКомпоновкиДанных = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьШаблонПоКодуОперации(Команда)
	
	Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
		Если Вопрос("Текущий табличный документ будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	ЗаполнитьШаблонПоКодуОперацииНаСервере();
	
	ОбновитьДеревоОтображения();
	ЭтаФорма.Модифицированность = Истина;
	ПроверитьОтличияМакета();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоОтображения()
	
	ДеревоОтображения.ПолучитьЭлементы().Очистить();
	
	ТаблицаОтображения.Очистить();
	
	Для НомерСтроки = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		ИмяГруппы     = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, НомераКолонок["Группа"]).Текст);
		ИмяЭлемента   = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, НомераКолонок["Элемент"]).Текст);
		НомерГруппы   = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, НомераКолонок["НомерГруппы"]).Текст);
		НомерЭлемента = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, НомераКолонок["НомерЭлемента"]).Текст);
		Отображать    = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, НомераКолонок["Отображать"]).Текст);
		ЭтоТаблица    = ЗначениеЗаполнено(ТабличныйДокумент.Область(НомерСтроки, НомераКолонок["Таблица"]).Текст);
		
		Если ИмяГруппы = "" И ИмяЭлемента = "" Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтрока = ТаблицаОтображения.Добавить();
		НовСтрока.Группа  = ИмяГруппы;
		НовСтрока.Элемент = ИмяЭлемента;
		НовСтрока.НомерГруппы  = НомерГруппы;
		НовСтрока.НомерЭлемента = НомерЭлемента;
		НовСтрока.Отображать = Отображать;
		НовСтрока.ЭтоТаблица = ЭтоТаблица;
		
	КонецЦикла;
	
	ТаблицаОтображения.Сортировать("НомерГруппы, НомерЭлемента");
	
	Для Каждого Строка Из ТаблицаОтображения Цикл
		
		ЭлементДерева = ЭлементДереваПервогоУровня(ДеревоОтображения.ПолучитьЭлементы(), Строка.Группа);
		Если ЭлементДерева = Неопределено Тогда
			НовСтрокаГруппа = ДеревоОтображения.ПолучитьЭлементы().Добавить();
			НовСтрокаГруппа.Элемент = Строка.Группа;
			НовСтрокаГруппа.Отображать = Истина;
		Иначе
			НовСтрокаГруппа = ЭлементДерева;
		КонецЕсли; 
		
		ЭлементДерева = ЭлементДереваПервогоУровня(НовСтрокаГруппа.ПолучитьЭлементы(), Строка.Элемент);
		Если ЭлементДерева = Неопределено Тогда
			НовСтрокаЭлемент = НовСтрокаГруппа.ПолучитьЭлементы().Добавить();
			НовСтрокаЭлемент.Элемент = Строка.Элемент;
			НовСтрокаЭлемент.Отображать = Строка.Отображать;
		КонецЕсли;
		
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Функция ЭлементДереваВГруппе(Дерево, ИмяГруппы, ИмяЭлемента)
	
	Для Каждого СтрокаДерева Из Дерево Цикл
		Если СтрокаДерева.Элемент = ИмяГруппы Тогда
			Для Каждого СтрокаПодчиненная Из СтрокаДерева.ПолучитьЭлементы() Цикл
				Если СтрокаПодчиненная.Элемент = ИмяЭлемента Тогда
					Возврат СтрокаПодчиненная;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ЭлементДереваПервогоУровня(Дерево, ИмяЭлемента)
	
	Для Каждого СтрокаДерева Из Дерево Цикл
		Если СтрокаДерева.Элемент = ИмяЭлемента Тогда
			Возврат СтрокаДерева;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьШаблонПоКодуОперацииНаСервере()
	Макет = Справочники.ВидыИнвентарныхПоручений.ИндивидуальныйМакетВидаПоручения(Объект.Ссылка);
	Если Макет = Неопределено Тогда
	    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден предопределенный шаблон для кода операции '" + Объект.Ссылка + "'");
		ТабличныйДокумент.Очистить();
	Иначе
		ТабличныйДокумент = Макет;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТабличныйДокумент.ФиксацияСверху = 1;
	ОбновитьДеревоОтображения();
	
	УстановитьОформлениеТабличногоДокумента();
	ПроверитьОтличияСхемы();
	ПроверитьОтличияМакета();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДерево(Команда)
	ОбновитьДеревоОтображения();
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзменении(Элемент)
	ОбновитьДеревоОтображения();
	УстановитьОформлениеТабличногоДокумента();
	ЭтаФорма.Модифицированность = Истина;
	ПроверитьОтличияМакета();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтображенияПриИзменении(Элемент)
	ОбновитьИерархиюВТабличномДокументе();
	ЭтаФорма.Модифицированность = Истина;
	ПроверитьОтличияМакета();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИерархиюВТабличномДокументе()
	ТаблицаОтображения.Очистить();
	
	НомерГруппы = 0;
	Для Каждого СтрокаДерево Из ДеревоОтображения.ПолучитьЭлементы() Цикл
		НомерЭлемента = 0;
		
		Для Каждого СтрокаЭлемент Из СтрокаДерево.ПолучитьЭлементы() Цикл
			НовСтрока = ТаблицаОтображения.Добавить();
			НовСтрока.Группа = СтрокаДерево.Элемент;
			НовСтрока.Элемент = СтрокаЭлемент.Элемент;
			НовСтрока.НомерГруппы = НомерГруппы;
			НовСтрока.НомерЭлемента = НомерЭлемента;
			НовСтрока.Отображать = СтрокаЭлемент.Отображать;
			
			НомерЭлемента = НомерЭлемента + 1;
		КонецЦикла;	
		
		НомерГруппы = НомерГруппы + 1;
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаОтображения Цикл
		Если Строка.Группа <> "" Или Строка.Элемент <> "" Тогда
			Для НомерСтроки = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл
				ИмяГруппы   = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, НомераКолонок["Группа"]).Текст);
				Если ИмяГруппы = Строка.Группа Тогда
		Если Строка.Группа <> "" Тогда
					ТабличныйДокумент.Область("R" + НомерСтроки + "C" + НомераКолонок["НомерГруппы"]).Текст = Строка(Строка.НомерГруппы);
		КонецЕсли; 
		Если Строка.Элемент <> "" Тогда
				ИмяЭлемента   = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, НомераКолонок["Элемент"]).Текст);
				Если ИмяЭлемента = Строка.Элемент Тогда
					ТабличныйДокумент.Область("R" + НомерСтроки + "C" + НомераКолонок["НомерЭлемента"]).Текст = Строка(Строка.НомерЭлемента);
					ТабличныйДокумент.Область("R" + НомерСтроки + "C" + НомераКолонок["Отображать"]).Текст = Формат(Строка.Отображать, "БЛ=Нет; БИ=Да");
				КонецЕсли; 
		КонецЕсли; 
				КонецЕсли; 
			КонецЦикла;	
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиВыборДоступныеПоляВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТабличныйДокумент.Область("R" + ТабличныйДокумент.ТекущаяОбласть.Верх + "C" + НомераКолонок["Значение"]).Текст = "[" + ВыбраннаяСтрока + "]";
	ПроверитьОтличияМакета();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтображенияПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ДеревоОтображения.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементИмя = Элементы.ДеревоОтображения.ТекущиеДанные.Элемент;
	
	Для НомерСтроки = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл
		ОбластьГруппа  = ТабличныйДокумент.Область("R"+НомерСтроки + "C" + НомераКолонок["Группа"]);
		ОбластьЭлемент = ТабличныйДокумент.Область("R"+НомерСтроки + "C" + НомераКолонок["Элемент"]);
		
		Если ОбластьГруппа.Текст = ЭлементИмя Тогда
			ТекущаяКолонка = ТабличныйДокумент.ТекущаяОбласть.Право;
			Элементы.ТабличныйДокумент.ТекущаяОбласть =  ТабличныйДокумент.Область("R" + НомерСтроки + "C" + ТекущаяКолонка);
			Прервать;
		КонецЕсли; 
		
		Если ОбластьЭлемент.Текст = ЭлементИмя Тогда
			ТекущаяКолонка = ТабличныйДокумент.ТекущаяОбласть.Право;
			Элементы.ТабличныйДокумент.ТекущаяОбласть =  ТабличныйДокумент.Область("R" + НомерСтроки + "C" + ТекущаяКолонка);
			Прервать;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриАктивизацииОбласти(Элемент)
	
	ТекущаяОбласть = ТабличныйДокумент.ТекущаяОбласть;
	Если ТекущаяОбласть.Верх = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ФорматЯчейки = ТабличныйДокумент.ТекущаяОбласть.Формат;
	
	ИмяГруппы = ТабличныйДокумент.Область("R" + ТекущаяОбласть.Верх + "C" + НомераКолонок["Группа"]).Текст;
	ИмяЭлемента = ТабличныйДокумент.Область("R" + ТекущаяОбласть.Верх + "C" + НомераКолонок["Элемент"]).Текст;
	ЭлементДерева = ЭлементДереваВГруппе(ДеревоОтображения.ПолучитьЭлементы(), ИмяГруппы, ИмяЭлемента);
	Если ЭлементДерева <> Неопределено Тогда
		Элементы.ДеревоОтображения.ТекущаяСтрока = ЭлементДерева.ПолучитьИдентификатор();
		ДеревоОбновлено = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ЗначениеПараметра(Шаблон) Экспорт
	Поручение = Документы.Поручение.ПустаяСсылка();
	
	Выражение = "";
	ОстатокШаблона = Шаблон;
	ПозицияРеквизита = Найти(Шаблон, "[");
	Пока ПозицияРеквизита > 0 Цикл
		Выражение = Выражение+Лев(ОстатокШаблона, ПозицияРеквизита-1)+"Поручение[";
		ОстатокШаблона = Сред(ОстатокШаблона, ПозицияРеквизита+1);
		ПозицияРеквизита = Найти(ОстатокШаблона, "[");
	КонецЦикла;
	Выражение = Выражение+ОстатокШаблона;
	
	Попытка
		Возврат Вычислить(Выражение);
	Исключение
		Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ПроверитьШаблонНомера(Команда)
	Если Не ЗначениеЗаполнено(Объект.ШаблонИсходящегоНомера) Тогда
		Возврат;
	КонецЕсли; 
	Если ЗначениеПараметра(Объект.ШаблонИсходящегоНомера) = Неопределено Тогда
		Сообщить("Ошибка в шаблоне");
	Иначе
		Сообщить("Шаблон настроен корректно");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонИсходящегоНомераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("РегистрСведений.ПараметрыСделокДляЭкспортаВЛуч.Форма.ФормаРедактированияШаблона", Новый Структура("Шаблон, Поручение", Объект.ШаблонИсходящегоНомера, ПредопределенноеЗначение("Документ.Поручение.ПустаяСсылка")), Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСхему(Команда)
	
	#Если ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда                  
		СКД = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
		Конструктор = Новый КонструкторСхемыКомпоновкиДанных(СКД);
		Конструктор.Редактировать(ЭтаФорма);
	#Иначе
		ТекстПредупреждения = НСтр("ru = 'Редактирование схемы компоновки данных доступно только в толстом клиенте'");
		Предупреждение(ТекстПредупреждения);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ИсточникВыбора) = Тип("КонструкторСхемыКомпоновкиДанных") Тогда
		Модифицированность = Истина;
		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(ВыбранноеЗначение, УникальныйИдентификатор);
		
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
		КомпоновщикНастроек.ЗагрузитьНастройки(ВыбранноеЗначение.НастройкиПоУмолчанию);
	КонецЕсли; 
	ПроверитьОтличияСхемы();
КонецПроцедуры

&НаСервере
Процедура УстановитьСхемуПоУмолчаниюНаСервере()
	СКД = Справочники.ВидыИнвентарныхПоручений.ПолучитьМакет("РеквизитыПоручения");
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию); 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСхемуПоУмолчанию(Команда)
	Если Вопрос("Изменения, сделанные в схеме, будут утеряны. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли; 
	
	УстановитьСхемуПоУмолчаниюНаСервере();
	ПроверитьОтличияСхемы();
КонецПроцедуры

&НаКлиенте
Процедура ФорматЯчейкиПриИзменении(Элемент)
	ТабличныйДокумент.ТекущаяОбласть.Формат = ФорматЯчейки;
КонецПроцедуры

&НаКлиенте
Процедура ФорматЯчейкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Конструктор = Новый КонструкторФорматнойСтроки(ФорматЯчейки);
	Если Конструктор.ОткрытьМодально() Тогда
		ТабличныйДокумент.ТекущаяОбласть.Формат = Конструктор.Текст;
		ФорматЯчейки = Конструктор.Текст;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьШаблонПоФорматуПоручения(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ФорматПоручения) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран формат поручения";
		Сообщение.Поле = "ФорматПоручения";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить(); 
		
		Возврат;
	КонецЕсли; 
	
	Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
		Если Вопрос("Текущий табличный документ будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	ЗаполнитьШаблонПоФорматуПорученияНаСервере();
	
	ОбновитьДеревоОтображения();
	ЭтаФорма.Модифицированность = Истина;
	ПроверитьОтличияМакета();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШаблонПоФорматуПорученияНаСервере()
	ТабличныйДокумент = Справочники.ВидыИнвентарныхПоручений.МакетПоФорматуПоручения(Объект.ФорматПоручения);
КонецПроцедуры

&НаКлиенте
Процедура СравнениеСхем(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Перед сравнением необходимо записать элемент!");
		Возврат;
	КонецЕсли; 
	
	ИмяВременногоФайла1 = ПолучитьИмяВременногоФайла(".xml");
	ИмяВременногоФайла2 = ПолучитьИмяВременногоФайла(".xml");
	
	СтруктураСравнения = ПодготовитьСравнениеСхемНаСервере();
	
	Схема1 = ПолучитьИзВременногоХранилища(СтруктураСравнения.АдресФайла1);
	Схема2 = ПолучитьИзВременногоХранилища(СтруктураСравнения.АдресФайла2);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла1);
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Схема1);
	ЗаписьXML.Закрыть();
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла2);
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Схема2);
	ЗаписьXML.Закрыть();
	
	#Если Не ТонкийКлиент Тогда
	СравнениеФайлов = Новый СравнениеФайлов;
	СравнениеФайлов.ПервыйФайл  = ИмяВременногоФайла1;
	СравнениеФайлов.ВторойФайл  = ИмяВременногоФайла2;
	СравнениеФайлов.СпособСравнения = СпособСравненияФайлов.ТекстовыйДокумент;
	СравнениеФайлов.ПоказатьРазличия();
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьСравнениеСхемНаСервере()
	
	Схема1 = Справочники.ВидыИнвентарныхПоручений.ПолучитьМакет("РеквизитыПоручения");
	АдресФайла1 = ПоместитьВоВременноеХранилище(Схема1, УникальныйИдентификатор);
	
	Схема2 = Объект.Ссылка.СхемаКомпоновкиДанных.Получить();
	АдресФайла2 = ПоместитьВоВременноеХранилище(Схема2, УникальныйИдентификатор);
	
	Возврат Новый Структура("АдресФайла1, АдресФайла2", АдресФайла1, АдресФайла2);
КонецФункции
 
&НаКлиенте
Процедура ПроверитьОтличияСхемы()
	Элементы.Декорация1.Видимость = СхемаОтличаетсяОтАктуальной(АдресСхемыКомпоновкиДанных);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОтличияМакета()
	Элементы.Декорация2.Видимость = МакетОтличаетсяОтАктуального();
КонецПроцедуры

&НаСервереБезКонтекста
Функция СхемаОтличаетсяОтАктуальной(АдресСхемыКомпоновкиДанных)
	ЗаписьXML = Новый ЗаписьXML;
	
	ТекущаяСхема = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ТекущаяСхема);
	ТекущаяСхема = ЗаписьXML.Закрыть();
	Хеширование2 = Новый ХешированиеДанных(ХешФункция.CRC32);
	Хеширование2.Добавить(ТекущаяСхема);
	
	АктуальнаяСхема = Справочники.ВидыИнвентарныхПоручений.ПолучитьМакет("РеквизитыПоручения");
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, АктуальнаяСхема);
	АктуальнаяСхема = ЗаписьXML.Закрыть();
	Хеширование1 = Новый ХешированиеДанных(ХешФункция.CRC32);
	Хеширование1.Добавить(АктуальнаяСхема);
	
	Возврат Хеширование1.ХешСумма <> Хеширование2.ХешСумма;
КонецФункции

&НаСервере
Функция МакетОтличаетсяОтАктуального()
	
	ЗаписьXML = Новый ЗаписьXML;
	
	АктуальныйМакет = Справочники.ВидыИнвентарныхПоручений.ИндивидуальныйМакетВидаПоручения(Объект.Ссылка);
	Если АктуальныйМакет = Неопределено Тогда
		Если Объект.ФорматПоручения.Пустая() Тогда
			Возврат Ложь;
		КонецЕсли;
		АктуальныйМакет = Справочники.ВидыИнвентарныхПоручений.МакетПоФорматуПоручения(Объект.ФорматПоручения);
	КонецЕсли;
	
	Если ТабличныйДокумент.ШиринаТаблицы <> АктуальныйМакет.ШиринаТаблицы
		Или ТабличныйДокумент.ВысотаТаблицы <> АктуальныйМакет.ВысотаТаблицы Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для НомерСтроки = 1 По ТабличныйДокумент.ВысотаТаблицы Цикл
		Для НомерКолонки = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
			Область1 = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
			Область2 = АктуальныйМакет.Область(НомерСтроки, НомерКолонки);
			Если Область1.Текст <> Область2.Текст
				Или Область1.Формат <> Область2.Формат Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

