
Процедура ОтразитьСостояниеКорпоративногоДействия(ДокументыКД, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументыКД) = Тип("Массив") Тогда
		МассивСсылок = ДокументыКД;
	ИначеЕсли ОбщегоНазначения.ЗначениеСсылочногоТипа(ДокументыКД) Тогда
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(ДокументыКД);
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(МассивСсылок) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("КорпоративноеДействие");
	
	ТаблицаСостояний = ТаблицаСостоянийКД(МассивСсылок);
	ТаблицаПредыдущихСостояний = ТаблицаПредыдущихСостоянийКД(МассивСсылок);
	
	Для Каждого СтрокаТаблицы Из ТаблицаСостояний Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
		МассивДействующихСостояний = ТаблицаПредыдущихСостояний.НайтиСтроки(СтруктураПоиска);
		
		СостояниеИзменено = Истина;
		
		Если МассивДействующихСостояний.Количество() > 0 Тогда
			ДействующееСостояние = МассивДействующихСостояний[0].Состояние;
			СостояниеИзменено = ДействующееСостояние <> СтрокаТаблицы.Состояние;
		КонецЕсли;
		
		Если СостояниеИзменено Тогда
			НачатьТранзакцию();
			МенеджерЗапись = РегистрыСведений.СостоянияКорпоративныхДействий.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗапись, СтрокаТаблицы);
			МенеджерЗапись.Период = ТекущаяДата();
			
			Попытка
				МенеджерЗапись.Записать(Истина);
				ЗафиксироватьТранзакцию();
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось отразить состояние корпоративного действия: %Ссылка% по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", СтрокаТаблицы.КорпоративноеДействие);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьЖурналаРегистрации("Изменение состояния корпоративного действия", УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Документы.КорпоративноеДействие_Новый, СтрокаТаблицы.КорпоративноеДействие, ТекстСообщения);
				ОтменитьТранзакцию();
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаПредыдущихСостоянийКД(МассивСсылок)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СостоянияКорпоративныхДействийСрезПоследних.КорпоративноеДействие КАК КорпоративноеДействие,
	                      |	СостоянияКорпоративныхДействийСрезПоследних.Состояние КАК Состояние
	                      |ИЗ
	                      |	РегистрСведений.СостоянияКорпоративныхДействий.СрезПоследних(, КорпоративноеДействие В (&МассивКД)) КАК СостоянияКорпоративныхДействийСрезПоследних");
	Запрос.УстановитьПараметр("МассивКД", МассивСсылок);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТаблицаСостоянийКД(МассивСсылок)
	
	ТаблицаСостояний = Новый ТаблицаЗначений;
	ТаблицаСостояний.Колонки.Добавить("КорпоративноеДействие");
	ТаблицаСостояний.Колонки.Добавить("Состояние");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СтатусыКорпоративныхДействийСрезПоследних.КорпоративноеДействие,
	|	СтатусыКорпоративныхДействийСрезПоследних.Статус
	|ИЗ
	|	РегистрСведений.СтатусыКорпоративныхДействий.СрезПоследних(, КорпоративноеДействие В (&МассивКД)) КАК СтатусыКорпоративныхДействийСрезПоследних");
	Запрос.УстановитьПараметр("МассивКД", МассивСсылок);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда 
		
		ТаблицаСтатусов = Результат.Выгрузить();
		Для каждого СтрокаСтатусаКД из ТаблицаСтатусов Цикл
			
			КарточкаКД = СтрокаСтатусаКД.КорпоративноеДействие;
			Если НЕ (Документы.КорпоративноеДействие_Новый.ЭтоВидКДВыкупа(КарточкаКД.ВидКД) ИЛИ Документы.КорпоративноеДействие_Новый.ЭтоВидКДСобрания(КарточкаКД.ВидКД)) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрокаСостояния = ТаблицаСостояний.Добавить();
			НоваяСтрокаСостояния.КорпоративноеДействие = КарточкаКД;
			
			Если СтрокаСтатусаКД.Статус = Перечисления.СтатусыКД.Просмотрено Тогда
				МассивСообщенийОбОшибкахЗаполнения = Новый Массив;
				Документы.КорпоративноеДействие_Новый.ПроверитьДостаточностьДанныхДляОтправкиУведомлений(КарточкаКД, МассивСообщенийОбОшибкахЗаполнения);
				Если МассивСообщенийОбОшибкахЗаполнения.Количество() > 0 Тогда
					НоваяСтрокаСостояния.Состояние = Перечисления.СостоянияКорпоративныхДействий.ТребуетсяУточнение;
					Продолжить;
				КонецЕсли;
				МассивСообщенийОбОшибкахЗаполнения = Новый Массив;
				Документы.КорпоративноеДействие_Новый.ПроверитьКорректностьВводаРаскрытияСпискаВладельцев(КарточкаКД, МассивСообщенийОбОшибкахЗаполнения);
				Если МассивСообщенийОбОшибкахЗаполнения.Количество() > 0 Тогда
					НоваяСтрокаСостояния.Состояние = Перечисления.СостоянияКорпоративныхДействий.ТребуетсяРаскрытиеСписка;
					Продолжить;
				КонецЕсли;
				НоваяСтрокаСостояния.Состояние = Перечисления.СостоянияКорпоративныхДействий.ОжидаетОтправкуУведомления;
			Иначе 
				НоваяСтрокаСостояния.Состояние = Перечисления.СостоянияКорпоративныхДействий.ПустаяСсылка();
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаСостояний;
	
КонецФункции

