
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "";
	Диалог.Каталог = "";
	Диалог.Фильтр = "Файл ответа (*.xlsx)|*.xlsx";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение", ЭтотОбъект, Неопределено);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	
	Если ЗначениеЗаполнено(Объект.Инициатор) Тогда
		ДокСсылка = СоздатьДокументНаСервере();
		ОткрытьЗначение(ДокСсылка);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле Инициатор");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	
	ЗаполнитьТЧНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если (ВыбранныеФайлы = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = ВыбранныеФайлы[0];
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	ПрочитатьНаСервере(Адрес, ТабличныйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере(Адрес, ТабличныйДокумент)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПрочитатьНаСервере(Адрес, ТабличныйДокумент);
	ЗначениеВДанныеФормы(ОбработкаОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьОбласть(ТабличныйДокумент);
	ЗначениеВДанныеФормы(ОбработкаОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокументНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.НовыйДокумент();
КонецФункции

#КонецОбласти
