#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.ПериодНачало = ОбщегоНазначения.ПредыдущийРабочийДень(НачалоДня(ТекущаяДатаСеанса()));
	Отчет.ПериодКонец = Отчет.ПериодНачало;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодНачалоПриИзменении(Элемент)
	ОчиститьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ПериодКонецПриИзменении(Элемент)
	ОчиститьОтчет();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборПериода(Команда)
	Если РаботаСДиалогамиКлиент.ИзмененПериод(Отчет.ПериодНачало, Отчет.ПериодКонец) Тогда
		ОчиститьОтчет();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетСервер();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчетСервер()
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ДанныеДляЗаполнения = ОтчетОбъект.ДанныеДляЗаполнения();
	ОтчетОбъект.ЗаполнитьОтчет(ТабДок, ДанныеДляЗаполнения);
КонецПроцедуры

&НаСервере
Процедура ОчиститьОтчет()
	ТабДок.Очистить();
КонецПроцедуры

#КонецОбласти