
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КонтактнаяИнформацияСервер.ПриСозданииНаСервереФормыВводаКИ(ЭтаФорма, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонтактнаяИнформацияКлиент.ВводКИ_ПередЗакрытием(ЭтаФорма, Отказ);
	// Отключение сообщения о неиспользуемых процедурах и функциях
	Если Ложь Тогда
		Подключаемый_СохранитьИЗакрыть(Неопределено);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НомерПриИзменении(Элемент)	
	Объект.Поле3 = КонтактнаяИнформация.ПривестиНомерТелефонаКШаблону(Объект.Поле3);
	Объект.Представление = КонтактнаяИнформация.СформироватьПредставлениеТелефона(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ВнутреннийПриИзменении(Элемент)
	Объект.Поле4 = КонтактнаяИнформация.ПривестиНомерТелефонаКШаблону(Объект.Поле4);
	Объект.Представление = КонтактнаяИнформация.СформироватьПредставлениеТелефона(Объект);

КонецПроцедуры

&НаКлиенте
Процедура КодСтраныПриИзменении(Элемент)
	
	Поле1 = Объект.Поле1;
	
	Если Лев(СокрЛ(Поле1), 1) <> "+" И НЕ ПустаяСтрока(Поле1) Тогда
		Поле1 = СокрЛП(Поле1);
		Пока Лев(Поле1, 1) = "0" Цикл
			Поле1 = Сред(Поле1, 2);
		КонецЦикла;
		Если НЕ ПустаяСтрока(Поле1) Тогда
			Поле1 = "+" + Поле1;
		КонецЕсли; 
	КонецЕсли; 
	
	Объект.Поле1 = Поле1;	
	Объект.Представление = КонтактнаяИнформация.СформироватьПредставлениеТелефона(Объект);

КонецПроцедуры

&НаКлиенте
Процедура КодГородаПриИзменении(Элемент)
	Объект.Представление = КонтактнаяИнформация.СформироватьПредставлениеТелефона(Объект);

КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	КонтактнаяИнформацияКлиент.ОбновитьПараметрыВыбораДляВидаКИ(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_СохранитьИЗакрыть(Команда)
	КонтактнаяИнформацияКлиент.ВводКИ_СохранитьИЗакрытьНаКлиенте(ЭтаФорма);
КонецПроцедуры

#КонецОбласти


