
// Единообразный обработчик установки соединений для реализации цепочки взаимосвязанных обработок.
//
// Параметры:
//  Параметры	 - Структура	 - Опциональные параметры соединения для следующих обработок в цепочке.
//	* ИмяОбработки	 - Строка
//	* Параметры		 - Структура
//
Процедура ИнициироватьСоединение(Параметры = Неопределено) Экспорт
КонецПроцедуры

// Основной метод обработки. Имитирует успешную выгрузку в СЭД.
Процедура ЗагрузкаДанных() Экспорт
	
	ЗапуститьПриложение("timeout 2", , Истина); // Имитируем медленную работу реальной выгрузки
	
	Если ПараметрыДокумента.Свойство("ВозвращатьСтатусЗагрузки") И ПараметрыДокумента.ВозвращатьСтатусЗагрузки Тогда
		ПараметрыДокумента.Вставить("ДокументУспешноЗарегистрирован", Истина);
	КонецЕсли;
	
	СтрокаДокумент	= ПолучитьСтрокуИнформацииДокументаПоПараметрам(ПараметрыДокумента.ТаблицаПараметров);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ - "+СтрокаДокумент+" как бы зарегистрирован в ЭДО");
КонецПроцедуры

Функция ПолучитьСтрокуИнформацииДокументаПоПараметрам(ТаблицаПараметров)
	СтрокаИнформацииПоДокументу	= "";
	// Определим имя документа
	НайденнаяСтрока		= ТаблицаПараметров.Найти("FileName", "ИмяПараметра");
	Если НайденнаяСтрока <> Неопределено Тогда
		СтрокаИнформацииПоДокументу	= СтрокаИнформацииПоДокументу + СокрЛП(НайденнаяСтрока.ЗначениеПараметра);
	КонецЕсли;
	// Определиим номер документа
	НайденнаяСтрока		= ТаблицаПараметров.Найти("DocumentNumber", "ИмяПараметра");
	Если НайденнаяСтрока <> Неопределено Тогда
		СтрокаИнформацииПоДокументу	= СтрокаИнформацииПоДокументу + ?(ЗначениеЗаполнено(СтрокаИнформацииПоДокументу), " №", "") + СокрЛП(НайденнаяСтрока.ЗначениеПараметра);
	КонецЕсли;
	// Определиим дату документа
	НайденнаяСтрока		= ТаблицаПараметров.Найти("DocumentDate", "ИмяПараметра");
	Если НайденнаяСтрока <> Неопределено Тогда
		СтрокаИнформацииПоДокументу	= СтрокаИнформацииПоДокументу + ?(ЗначениеЗаполнено(СтрокаИнформацииПоДокументу), " от ", "") + СокрЛП(НайденнаяСтрока.ЗначениеПараметра);
	КонецЕсли;
	// Определиим клиента документа
	НайденнаяСтрока		= ТаблицаПараметров.Найти("Client", "ИмяПараметра");
	Если НайденнаяСтрока <> Неопределено Тогда
		СтрокаИнформацииПоДокументу	= СтрокаИнформацииПоДокументу + "(" + СокрЛП(НайденнаяСтрока.ЗначениеПараметра)+ ")";
	КонецЕсли;
	
	Возврат СтрокаИнформацииПоДокументу;
КонецФункции

