
Процедура ОбработкаПроведения(Отказ, Режим)
	ФлагОтказа = ВидОперации = Перечисления.ВидыОперацийРеестраКвалифицированныхИнвесторов.Отказ 
								ИЛИ ВидОперации = Перечисления.ВидыОперацийРеестраКвалифицированныхИнвесторов.Исключение;
	
	Категории = ПолучитьСписокВыбранныхКатегорийЦенныхБумаг(ФлагОтказа);
	
	Для Каждого Категория Из Категории Цикл
		Движение = Движения.РеестрКвалифицированныхИнвесторовРОФР.Добавить();
		Движение.Период			= Дата;
		Движение.Организация	= Организация;
		Движение.ЮрФизЛицо		= ЮрФизЛицо;
		Движение.ВидОперации	= ВидОперации;
		Движение.ВидИнструмента	= Категория.Ключ;
		Движение.Комментарий	= Комментарий;
		Движение.ФлагАктивности	= Категория.Значение;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСписокВыбранныхКатегорийЦенныхБумаг(ФлагОтказа = Ложь) Экспорт
	Категории = Новый Соответствие;
	
	Для каждого Категория Из Метаданные.Перечисления.КатегорииЦенныхБумагДляРеестраКвалифицированныхИнвесторов.ЗначенияПеречисления Цикл
		Если ОбщегоНазначения.ЕстьРеквизитДокумента(Категория.Имя, ЭтотОбъект.Метаданные()) Тогда
			Если Не ФлагОтказа Тогда
				Категории.Вставить(Перечисления.КатегорииЦенныхБумагДляРеестраКвалифицированныхИнвесторов[Категория.Имя], ЭтотОбъект[Категория.Имя]);
			Иначе
				Если ФлагОтказа И ЭтотОбъект[Категория.Имя] Тогда
					Категории.Вставить(Перечисления.КатегорииЦенныхБумагДляРеестраКвалифицированныхИнвесторов[Категория.Имя], Ложь);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Категории;
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
