
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.СписокДепонентов.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ЮридическиеЛица"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	Отчет.СписокСубклиентов.ТипЗначения = Новый ОписаниеТипов(МассивТипов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отчет.НачалоПериода = НачалоМесяца(ТекущаяДата());
	Отчет.КонецПериода = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ВремяНачала = ТекущаяДата();
	СформироватьОтчетНаСервере();
	ВремяОкончания = ТекущаяДата();
	ПоказатьОповещениеПользователя("Отчет сформирован",, "Отчет сформирован за " + (ВремяОкончания-ВремяНачала) + " сек.");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)

	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Новый СтандартныйПериод(Отчет.НачалоПериода, Отчет.КонецПериода);
	Если Диалог.Редактировать() Тогда 
		Отчет.НачалоПериода = Диалог.Период.ДатаНачала;
		Отчет.КонецПериода = Диалог.Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Результат.Очистить();
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	ЭтотОтчет.СформироватьОтчет(Результат);
	
	Результат.АвтоМасштаб 			= Истина;
	Результат.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	Результат.ОтображатьЗаголовки	= Ложь;
	Результат.ОтображатьСетку		= Ложь;
	Результат.ФиксацияСверху		= 4;
	Результат.ТолькоПросмотр		= Истина;
	
КонецПроцедуры
