#Область ОписаниеПеременных

Перем мТекстыЗаголовков; // Тексты заголовков печатной формы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТипОперацииПоОперации(ПоОперации)
	
	Если Не ЗначениеЗаполнено(ПоОперации) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ТипЗнч(ПоОперации) = Тип("ДокументСсылка.ОперацииЦБ") Тогда
		Возврат 1;
	ИначеЕсли ТипЗнч(ПоОперации) = Тип("ДокументСсылка.ГлобальнаяОперация") Тогда
		Возврат 2;
	ИначеЕсли ТипЗнч(ПоОперации) = Тип("ДокументСсылка.УчастиеВКД") Тогда
		Возврат 3;
	ИначеЕсли ТипЗнч(ПоОперации) = Тип("ДокументСсылка.ОтменаПоручения") Тогда
		Возврат 4;
	ИначеЕсли ТипЗнч(ПоОперации) = Тип("ДокументСсылка.ИзменениеАнкетныхДанных") Тогда
		Возврат 5;
	ИначеЕсли ТипЗнч(ПоОперации) = Тип("ДокументСсылка.ОткрытиеРазделаСчетаДепо") Тогда
		Возврат 6;
	ИначеЕсли ТипЗнч(ПоОперации) = Тип("ДокументСсылка.ЗакрытиеРазделаСчетаДепо") Тогда
		Возврат 7;
	ИначеЕсли ТипЗнч(ПоОперации) = Тип("ДокументСсылка.ОткрытиеСчетаДепо") Тогда
		Возврат 8;
	ИначеЕсли ТипЗнч(ПоОперации) = Тип("ДокументСсылка.ЗакрытиеСчетаДепо") Тогда
		Возврат 9;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Процедура ОчисткаСводныхОтчетовНеВЭДО(НачалоПериода, КонецПериода, ПоСчетуДепо)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ПоВсемСчетамДепо", Не ЗначениеЗаполнено(ПоСчетуДепо));
	Запрос.УстановитьПараметр("СчетДепо", ПоСчетуДепо);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СводныйОтчетОСовершенныхОперациях.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СводныйОтчетОСовершенныхОперациях.Операции КАК СводныйОтчетОСовершенныхОперацияхОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СводныйОтчетОСовершенныхОперациях КАК СводныйОтчетОСовершенныхОперациях
	|		ПО СводныйОтчетОСовершенныхОперацияхОперации.Ссылка = СводныйОтчетОСовершенныхОперациях.Ссылка
	|ГДЕ
	|	СводныйОтчетОСовершенныхОперациях.ИсходящийНомер = """"
	|	И НЕ СводныйОтчетОСовершенныхОперациях.ПометкаУдаления
	|	И СводныйОтчетОСовершенныхОперациях.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (&ПоВсемСчетамДепо
	|			ИЛИ СводныйОтчетОСовершенныхОперациях.СчетДепо = &СчетДепо)
	|
	|СГРУППИРОВАТЬ ПО
	|	СводныйОтчетОСовершенныхОперациях.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ДокОбъект.Операции.Очистить();
			ДокОбъект.Комментарий = "";
			ДокОбъект.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТаблицуСводныхОтчетов(Период, СчетаДепо)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СводныйОтчетОСовершенныхОперациях.СчетДепо КАК СчетДепо,
	|	СводныйОтчетОСовершенныхОперациях.Ссылка КАК СводныйОтчетСсылка,
	|	НЕ СводныйОтчетОСовершенныхОперациях.ИсходящийНомер = """" КАК ЕстьВЭДО
	|ИЗ
	|	Документ.СводныйОтчетОСовершенныхОперациях КАК СводныйОтчетОСовершенныхОперациях
	|ГДЕ
	|	НЕ СводныйОтчетОСовершенныхОперациях.ПометкаУдаления
	|	И СводныйОтчетОСовершенныхОперациях.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СводныйОтчетОСовершенныхОперациях.СчетДепо В(&СчетаДепо)";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Период));
	Запрос.УстановитьПараметр("СчетаДепо", СчетаДепо);
	
	СуществующиеСводныеОтчеты = Запрос.Выполнить().Выгрузить();
	
	ТаблицаОтчетов = Новый ТаблицаЗначений;
	ТаблицаОтчетов.Колонки.Добавить("СчетДепо");
	ТаблицаОтчетов.Колонки.Добавить("СводныйОтчетОбъект");
	ТаблицаОтчетов.Колонки.Добавить("ЕстьВЭДО");
	
	Для Каждого СчетДепо Из СчетаДепо Цикл
		
		ЕстьВЭДО = Ложь;
		
		СтруктураПоиска = Новый Структура("СчетДепо", СчетДепо);
		ЕстьСводныеОтчеты = СуществующиеСводныеОтчеты.НайтиСтроки(СтруктураПоиска);
		
		Если ЕстьСводныеОтчеты.Количество() = 0 Тогда
			СводныйОтчетОбъект = Документы.СводныйОтчетОСовершенныхОперациях.СоздатьДокумент();
		Иначе
			ВыборкаДетальныеЗаписи = ЕстьСводныеОтчеты[0];
			Если ВыборкаДетальныеЗаписи.ЕстьВЭДО Тогда
				ЕстьВЭДО = Истина;
			КонецЕсли;
			СводныйОтчетОбъект = ВыборкаДетальныеЗаписи.СводныйОтчетСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		СводныйОтчетОбъект.Дата = Период;
		СводныйОтчетОбъект.ДатаНачПериода = Дата(1, 1, 1);
		СводныйОтчетОбъект.ДатаКонПериода = Дата(1, 1, 1);
		СводныйОтчетОбъект.СчетДепо = СчетДепо;
		СводныйОтчетОбъект.ВладелецСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДепо, "Владелец");
		СводныйОтчетОбъект.СпособОтправкиОтчета = Справочники.СпособыПередачиИнформации.ЭДО;
		
		НовыйОтчет = ТаблицаОтчетов.Добавить();
		НовыйОтчет.СчетДепо = СчетДепо;
		НовыйОтчет.СводныйОтчетОбъект = СводныйОтчетОбъект;
		НовыйОтчет.ЕстьВЭДО = ЕстьВЭДО;
		
	КонецЦикла;
	
	Возврат ТаблицаОтчетов;
	
КонецФункции

Процедура СформироватьСводныеОтчеты(НеобходимоПоместитьВЭДО)
	
	ИмяКолонкиСчетаДепо = "НомерСчетаДепо";
	
	тзДокументыКЭДО = ДокументыКЭДО.ВыгрузитьКолонки();
	
	НомераСчетовДепо = Операции.Выгрузить(, ИмяКолонкиСчетаДепо);
	НомераСчетовДепо.Свернуть(ИмяКолонкиСчетаДепо);
	СчетаДепо = НомераСчетовДепо.ВыгрузитьКолонку(ИмяКолонкиСчетаДепо);
	
	ТаблицаСводныхОтчетов = ПолучитьТаблицуСводныхОтчетов(ДатаФормированияОтчетов, СчетаДепо);
	Для Каждого СводныйОтчет Из ТаблицаСводныхОтчетов Цикл
		
		СтруктураОтбора = Новый Структура(ИмяКолонкиСчетаДепо, СводныйОтчет.СчетДепо);
		НайденыОперации = Операции.НайтиСтроки(СтруктураОтбора);
		
		Для Каждого НайденаОперация Из НайденыОперации Цикл
			
			Если СводныйОтчет.ЕстьВЭДО Тогда
				НайденаОперация.СводныйОтчетОСовершенныхОперациях = СводныйОтчет.СводныйОтчетОбъект.Ссылка;
			КонецЕсли;
			
			Если НеобходимоПоместитьВЭДО Или Не СводныйОтчет.ЕстьВЭДО Тогда
				
				НоваяОперацияДокумента = СводныйОтчет.СводныйОтчетОбъект.Операции.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяОперацияДокумента, НайденаОперация);
				
				НайденаОперация.СтатусОК = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НеобходимоПоместитьВЭДО Или Не СводныйОтчет.ЕстьВЭДО Тогда
			СводныйОтчет.СводныйОтчетОбъект.Комментарий = "Сформирован " + ТекущаяДатаСеанса();
			СводныйОтчет.СводныйОтчетОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		КонецЕсли;
		
		ДокументКЭДО = тзДокументыКЭДО.Добавить();
		ДокументКЭДО.СчетДепо = СводныйОтчет.СчетДепо;
		ДокументКЭДО.Документ = СводныйОтчет.СводныйОтчетОбъект.Ссылка;
		ДокументКЭДО.Кво = НайденыОперации.Количество();
		ДокументКЭДО.Клиент = СводныйОтчет.СчетДепо.Владелец;
		ДокументКЭДО.Основание = СводныйОтчет.СводныйОтчетОбъект.Ссылка;
		
		Если СводныйОтчет.ЕстьВЭДО Тогда
			ДокументКЭДО.ActionType = "UPD";
		Иначе
			ДокументКЭДО.ActionType = "INS";
		КонецЕсли;
		
	КонецЦикла;
	тзДокументыКЭДО.Сортировать("ActionType УБЫВ");
	ДокументыКЭДО.Очистить();
	Для Каждого СтрокаДокументыКЭДО Из тзДокументыКЭДО Цикл
		Если Справочники.Контрагенты.ОсобыеУсловия(СтрокаДокументыКЭДО.Клиент) Тогда
			Если Не РегистрыСведений.ОтветственныеЛицаОрганизаций.ПользовательМожетРедактироватьОсобыеУсловия() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Особые условия: " + СтрокаДокументыКЭДО.Клиент
				+ ". Выполнение операции доступно Ответственному за особых клиентов");
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		СтрокаЭДО = ДокументыКЭДО.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЭДО, СтрокаДокументыКЭДО);
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьИнформационнуюВыписку(ПоВыписке)
	
	тзДокументыКЭДО = ДокументыКЭДО.ВыгрузитьКолонки();
	
	ДокументДляЭДО = тзДокументыКЭДО.Добавить();
	
	Если ЗначениеЗаполнено(ПоВыписке.ИсходящийНомер) Тогда
		ДокументДляЭДО.ActionType = "UPD";
	Иначе
		ДокументДляЭДО.ActionType = "INS";
	КонецЕсли;
	ДокументДляЭДО.СчетДепо = ПоВыписке.СчетДепо;
	ДокументДляЭДО.Документ = ПоВыписке.Ссылка;
	ДокументДляЭДО.Кво = Операции.Количество();
	ДокументДляЭДО.Клиент = ПоВыписке.СчетДепо.Владелец;
	ДокументДляЭДО.Основание = ПоВыписке.Ссылка;
	
	ДокументыКЭДО.Загрузить(тзДокументыКЭДО);
	
КонецПроцедуры

Функция ВыборкаОперацийРаздела(Раздел, ТаблицаОпераций)
	
	ПараметрыОтбора = Новый Структура("Раздел", Раздел);
	
	Возврат ТаблицаОпераций.НайтиСтроки(ПараметрыОтбора);
	
КонецФункции

Процедура УдалитьРегистрациюЭДО()
	
	НачатьТранзакцию();
	Попытка
		// Для каждого док из ДокументыВЭДО -> Удалить запись в РС РегистрацииЭДО, в док. очистить ИсходящийНомер - в транзакции
		ПараметрыОтбора = Новый Структура("ActionType", "UPD");
		ДокументыВЭДО = ДокументыКЭДО.НайтиСтроки(ПараметрыОтбора);
		Для Каждого ДокументыКУдалениюРегистрации Из ДокументыВЭДО Цикл
			
			НаборЗаписей = РегистрыСведений.РегистрацияДокументовВЭДО.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(ДокументыКУдалениюРегистрации.Документ);
			НаборЗаписей.Записать();
			
			ДокОбъект = ДокументыКУдалениюРегистрации.Документ.ПолучитьОбъект();
			ДокОбъект.ИсходящийНомер = "";
			ДокОбъект.Записать();
			
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

#Область ТекстыЗапросов

Функция Операции_1_ОперацииЦБ()
	Возврат
	"ВЫБРАТЬ
	|	1 КАК Раздел,
	|	ОперацииЦБ.Ссылка КАК ДокументОперации,
	|	НАЧАЛОПЕРИОДА(ОперацииЦБ.Дата, ДЕНЬ) КАК ДатаОперации,
	|	ОперацииЦБ.ВидОперацииД КАК ТипОперации,
	|	ОперацииЦБ.ДокументОснование КАК ОснованиеОперации,
	|	ОперацииЦБ.ДокументОснование.Инициатор КАК ИнициаторОперации,
	|	ВЫБОР
	|		КОГДА ОперацииЦБ.ДокументОснование ССЫЛКА Документ.иц_СводноеПоручение
	|			ТОГДА ""По итогам операций на бирже""
	|		КОГДА ОперацииЦБ.ДокументОснование ССЫЛКА Документ.Поручение
	|				И ВЫРАЗИТЬ(ОперацииЦБ.ДокументОснование КАК Документ.Поручение).ПаиТипЗаявки = ЗНАЧЕНИЕ(Перечисление.ПаиТипыЗаявок.MULTI_BUY)
	|			ТОГДА ОперацииЦБ.Комментарий
	|		ИНАЧЕ ОперацииЦБ.ДокументОснование.Комментарий
	|	КОНЕЦ КАК ДопИнформация,
	|	ОперацииЦБ.ЦБ КАК ЦБ,
	|	ОперацииЦБ.ЦБ.НаименованиеВыпуска КАК НаименованиеВыпуска,
	|	ОперацииЦБ.ЦБ.ISIN КАК ISIN,
	|	ОперацииЦБ.ЦБ.НомерРегистрации КАК РегНом,
	|	ОперацииЦБ.СчетДепо КАК НомерСчетаДепо,
	|	ОперацииЦБ.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОперацииЦБ.СчетДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ОперацииЦБ.РазделСчетаДепо.ТипРазделаСчетаДЕПО КАК ТипРазделаСчетаДепо,
	|	"""" КАК СтатусНомерОтменяемого,
	|	0 КАК КоличествоЦБ,
	|	ВЫБОР
	|		КОГДА ОстаткиЦБ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ОперацииЦБ.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОборотЗачислено,
	|	ВЫБОР
	|		КОГДА ОстаткиЦБ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ОперацииЦБ.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОборотСписано,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаФиксации,
	|	0 КАК РазмерВыплатыНа1ЦБ,
	|	0 КАК ОбщаяСуммаНачисленной,
	|	0 КАК СуммаНалогаУдержанного,
	|	0 КАК ДополнительныеУдержания,
	|	0 КАК СуммаКВыплате,
	|	0 КАК КоэффициентД1,
	|	0 КАК КоэффициентД2,
	|	"""" КАК ДоходПеречисленНа
	|ПОМЕСТИТЬ ВТ_Операции
	|ИЗ
	|	Документ.ОперацииЦБ КАК ОперацииЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦБ КАК ОстаткиЦБ
	|		ПО ОперацииЦБ.Ссылка = ОстаткиЦБ.Регистратор
	|			И (ОстаткиЦБ.СтатусЦБ <> ЗНАЧЕНИЕ(Перечисление.СтатусыЦБ.Блокирована))
	|			И ОперацииЦБ.СчетДепо = ОстаткиЦБ.СчетДепо
	|			И ОперацииЦБ.РазделСчетаДепо = ОстаткиЦБ.РазделСчетаДепо
	|ГДЕ
	|	(&ПоВсемОперациям
	|			ИЛИ &ТипОперации = 1
	|				И ОперацииЦБ.Ссылка = &Операция)
	|	И (&ПоВсемСчетамДепо
	|			ИЛИ ОперацииЦБ.СчетДепо = &НомерСчетаДепо)
	|	И ОперацииЦБ.Проведен
	|	И ОперацииЦБ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	ОперацииЦБ.Ссылка,
	|	НАЧАЛОПЕРИОДА(ОперацииЦБ.Дата, ДЕНЬ),
	|	ОперацииЦБ.ВидОперацииД,
	|	ВЫБОР
	|		КОГДА ОперацииЦБ.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|			ТОГДА ОперацииЦБ.ДокументОснованиеВстречный
	|		ИНАЧЕ ОперацииЦБ.ДокументОснование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОперацииЦБ.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|			ТОГДА ОперацииЦБ.ДокументОснованиеВстречный.Инициатор
	|		ИНАЧЕ ОперацииЦБ.ДокументОснование.Инициатор
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОперацииЦБ.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|			ТОГДА ОперацииЦБ.ДокументОснованиеВстречный.Комментарий
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОперацииЦБ.ДокументОснование ССЫЛКА Документ.иц_СводноеПоручение
	|					ТОГДА ""По итогам операций на бирже""
	|				КОГДА ОперацииЦБ.ДокументОснование ССЫЛКА Документ.Поручение
	|						И ВЫРАЗИТЬ(ОперацииЦБ.ДокументОснование КАК Документ.Поручение).ПаиТипЗаявки = ЗНАЧЕНИЕ(Перечисление.ПаиТипыЗаявок.MULTI_BUY)
	|					ТОГДА ОперацииЦБ.Комментарий
	|				ИНАЧЕ ОперацииЦБ.ДокументОснование.Комментарий
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ОперацииЦБ.ЦБ,
	|	ОперацииЦБ.ЦБ.НаименованиеВыпуска,
	|	ОперацииЦБ.ЦБ.ISIN,
	|	ОперацииЦБ.ЦБ.НомерРегистрации,
	|	ОперацииЦБ.СчетДепоПолучатель,
	|	ОперацииЦБ.РазделСчетаДепоПолучатель,
	|	ОперацииЦБ.СчетДепоПолучатель.ТипСчетаДепо,
	|	ОперацииЦБ.РазделСчетаДепоПолучатель.ТипРазделаСчетаДЕПО,
	|	"""",
	|	0,
	|	ВЫБОР
	|		КОГДА ОстаткиЦБ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ОперацииЦБ.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОстаткиЦБ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ОперацииЦБ.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	""""
	|ИЗ
	|	Документ.ОперацииЦБ КАК ОперацииЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦБ КАК ОстаткиЦБ
	|		ПО ОперацииЦБ.Ссылка = ОстаткиЦБ.Регистратор
	|			И (ОстаткиЦБ.СтатусЦБ <> ЗНАЧЕНИЕ(Перечисление.СтатусыЦБ.Блокирована))
	|			И ОперацииЦБ.СчетДепоПолучатель = ОстаткиЦБ.СчетДепо
	|			И ОперацииЦБ.РазделСчетаДепоПолучатель = ОстаткиЦБ.РазделСчетаДепо
	|ГДЕ
	|	(&ПоВсемОперациям
	|			ИЛИ &ТипОперации = 1
	|				И ОперацииЦБ.Ссылка = &Операция)
	|	И (&ПоВсемСчетамДепо
	|			ИЛИ ОперацииЦБ.СчетДепоПолучатель = &НомерСчетаДепо)
	|	И ОперацииЦБ.Проведен
	|	И ОперацииЦБ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ОперацииЦБ.РазделСчетаДепоПолучатель = ЗНАЧЕНИЕ(Справочник.РазделыСчетаДепо.ПустаяСсылка)";
КонецФункции

Функция Операции_2_ГлобальныеОперацииЦБ()
	Возврат
	"ВЫБРАТЬ
	|	2 КАК Раздел,
	|	ГлобальнаяОперация.Ссылка КАК ДокументОперации,
	|	НАЧАЛОПЕРИОДА(ГлобальнаяОперация.Дата, ДЕНЬ) КАК ДатаОперации,
	|	ГлобальнаяОперация.ВидГлобальнойОперации КАК ТипОперации,
	|	ГлобальнаяОперация.ДокументОснование КАК ОснованиеОперации,
	|	ГлобальнаяОперация.ДокументОснование.Инициатор КАК ИнициаторОперации,
	|	ВЫБОР
	|		КОГДА ГлобальнаяОперация.ВидГлобальнойОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Конвертация)
	|			ТОГДА ГлобальнаяОперация.Комментарий
	|		ИНАЧЕ ГлобальнаяОперация.ДокументОснование.Комментарий
	|	КОНЕЦ КАК ДопИнформация,
	|	ОстаткиЦБ.ЦБ КАК ЦБ,
	|	ОстаткиЦБ.ЦБ.НаименованиеВыпуска КАК НаименованиеВыпуска,
	|	ОстаткиЦБ.ЦБ.ISIN КАК ISIN,
	|	ОстаткиЦБ.ЦБ.НомерРегистрации КАК РегНом,
	|	ОстаткиЦБ.СчетДепо КАК НомерСчетаДепо,
	|	ОстаткиЦБ.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБ.СчетДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ОстаткиЦБ.РазделСчетаДепо.ТипРазделаСчетаДЕПО КАК ТипРазделаСчетаДепо,
	|	"""" КАК СтатусНомерОтменяемого,
	|	0 КАК КоличествоЦБ,
	|	ВЫБОР
	|		КОГДА ОстаткиЦБ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ОстаткиЦБ.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОборотЗачислено,
	|	ВЫБОР
	|		КОГДА ОстаткиЦБ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ОстаткиЦБ.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОборотСписано,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаФиксации,
	|	0 КАК РазмерВыплатыНа1ЦБ,
	|	0 КАК ОбщаяСуммаНачисленной,
	|	0 КАК СуммаНалогаУдержанного,
	|	0 КАК ДополнительныеУдержания,
	|	0 КАК СуммаКВыплате,
	|	0 КАК КоэффициентД1,
	|	0 КАК КоэффициентД2,
	|	"""" КАК ДоходПеречисленНа
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ КАК ОстаткиЦБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГлобальнаяОперация КАК ГлобальнаяОперация
	|		ПО ОстаткиЦБ.Регистратор = ГлобальнаяОперация.Ссылка
	|ГДЕ
	|	(&ПоВсемОперациям
	|			ИЛИ &ТипОперации = 2
	|				И ГлобальнаяОперация.Ссылка = &Операция)
	|	И (&ПоВсемСчетамДепо
	|			ИЛИ ОстаткиЦБ.СчетДепо = &НомерСчетаДепо)
	|	И ОстаткиЦБ.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|	И ОстаткиЦБ.Регистратор.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ГлобальнаяОперация.ВидГлобальнойОперации.ДвижениеПоЦБ = ИСТИНА";
КонецФункции

Функция Операции_2_ГлобальныеОперацииДС()
	Возврат
	"ВЫБРАТЬ
	|	3 КАК Раздел,
	|	ГлобальнаяОперация.Ссылка КАК ДокументОперации,
	|	НАЧАЛОПЕРИОДА(ГлобальнаяОперация.Дата, ДЕНЬ) КАК ДатаОперации,
	|	ГлобальнаяОперация.ВидГлобальнойОперации КАК ТипОперации,
	|	ГлобальнаяОперация.ДокументОснование КАК ОснованиеОперации,
	|	ГлобальнаяОперация.ДокументОснование.Инициатор КАК ИнициаторОперации,
	|	ГлобальнаяОперация.Комментарий КАК ДопИнформация,
	|	ГлобальнаяОперацияЦенныеБумаги.ЦеннаяБумага КАК ЦБ,
	|	ГлобальнаяОперацияЦенныеБумаги.ЦеннаяБумага.НаименованиеВыпуска КАК НаименованиеВыпуска,
	|	ГлобальнаяОперацияЦенныеБумаги.ЦеннаяБумага.ISIN КАК ISIN,
	|	ГлобальнаяОперацияЦенныеБумаги.ЦеннаяБумага.НомерРегистрации КАК РегНом,
	|	ГлобальнаяОперация.СчетДепо КАК НомерСчетаДепо,
	|	ГлобальнаяОперацияЦенныеБумаги.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ГлобальнаяОперация.СчетДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ГлобальнаяОперацияЦенныеБумаги.РазделСчетаДепо.ТипРазделаСчетаДЕПО КАК ТипРазделаСчетаДепо,
	|	"""" КАК СтатусНомерОтменяемого,
	|	ГлобальнаяОперацияЦенныеБумаги.Количество КАК КоличествоЦБ,
	|	0 КАК ОборотЗачислено,
	|	0 КАК ОборотСписано,
	|	ГлобальнаяОперация.ДатаФиксации КАК ДатаФиксации,
	|	ГлобальнаяОперация.ВыплатаНа1ЦБ КАК РазмерВыплатыНа1ЦБ,
	|	ГлобальнаяОперацияЦенныеБумаги.Сумма КАК ОбщаяСуммаНачисленной,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Поручение.ВалютаНалога, ГлобальнаяОперация.БанковскийСчет.ВалютаДенежныхСредств) В (&ВалютыРублевогоНалога)
	|			ТОГДА ГлобальнаяОперацияЦенныеБумаги.СуммаНалога
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНалогаУдержанного,
	|	0 КАК ДополнительныеУдержания,
	|	ГлобальнаяОперацияЦенныеБумаги.СуммаБезНалога КАК СуммаКВыплате,
	|	ГлобальнаяОперация.ДокументОснование.КоэффициентД1 КАК КоэффициентД1,
	|	ГлобальнаяОперация.ДокументОснование.КоэффициентД2 КАК КоэффициентД2,
	|	Поручение.БанковскийСчет.НомерСчета КАК ДоходПеречисленНа
	|ИЗ
	|	Документ.ГлобальнаяОперация.ЦенныеБумаги КАК ГлобальнаяОперацияЦенныеБумаги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГлобальнаяОперация КАК ГлобальнаяОперация
	|		ПО ГлобальнаяОперацияЦенныеБумаги.Ссылка = ГлобальнаяОперация.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК Поручение
	|		ПО (ГлобальнаяОперация.ДокументОснование = Поручение.Ссылка)
	|			И (ГлобальнаяОперация.СчетДепо = Поручение.СчетДепо)
	|			И ГлобальнаяОперацияЦенныеБумаги.РазделСчетаДепо = Поручение.РазделСчетаДепо
	|			И ГлобальнаяОперацияЦенныеБумаги.СчетДепоМХ = Поручение.СчетДепоМХ
	|			И ГлобальнаяОперацияЦенныеБумаги.РазделСчетаДепоМХ = Поручение.РазделСчетаДепоМХ
	|ГДЕ
	|	(&ПоВсемОперациям
	|			ИЛИ &ТипОперации = 2
	|				И ГлобальнаяОперация.Ссылка = &Операция)
	|	И (&ПоВсемСчетамДепо
	|			ИЛИ ГлобальнаяОперация.СчетДепо = &НомерСчетаДепо)
	|	И ГлобальнаяОперация.Проведен
	|	И ГлобальнаяОперация.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ГлобальнаяОперация.ВидГлобальнойОперации.ВыплатаДоходаВДенежнойФорме = ИСТИНА";
КонецФункции

Функция Операции_3_УчастиеВКД()
	Возврат
	"ВЫБРАТЬ
	|	4 КАК Раздел,
	|	УчастиеВКД.Ссылка КАК ДокументОперации,
	|	НАЧАЛОПЕРИОДА(УчастиеВКД.Дата, ДЕНЬ) КАК ДатаОперации,
	|	ЗНАЧЕНИЕ(Справочник.ВидыОпераций.УчастиеВКД) КАК ТипОперации,
	|	УчастиеВКД.ДокументОснование КАК ОснованиеОперации,
	|	УчастиеВКД.ДокументОснование.Инициатор КАК ИнициаторОперации,
	|	УчастиеВКД.ДокументОснование.Комментарий КАК ДопИнформация,
	|	УчастиеВКД.ЦеннаяБумага КАК ЦБ,
	|	УчастиеВКД.ЦеннаяБумага.НаименованиеВыпуска КАК НаименованиеВыпуска,
	|	УчастиеВКД.ЦеннаяБумага.ISIN КАК ISIN,
	|	"""" КАК РегНом,
	|	УчастиеВКД.СчетДепо КАК НомерСчетаДепо,
	|	ЗНАЧЕНИЕ(Справочник.РазделыСчетаДепо.ПустаяСсылка) КАК РазделСчетаДепо,
	|	УчастиеВКД.СчетДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.ПустаяСсылка) КАК ТипРазделаСчетаДепо,
	|	"""" КАК СтатусНомерОтменяемого,
	|	УчастиеВКД.КоличествоЦБ КАК КоличествоЦБ,
	|	0 КАК ОборотЗачислено,
	|	0 КАК ОборотСписано,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаФиксации,
	|	0 КАК РазмерВыплатыНа1ЦБ,
	|	0 КАК ОбщаяСуммаНачисленной,
	|	0 КАК СуммаНалогаУдержанного,
	|	0 КАК ДополнительныеУдержания,
	|	0 КАК СуммаКВыплате,
	|	0 КАК КоэффициентД1,
	|	0 КАК КоэффициентД2,
	|	"""" КАК ДоходПеречисленНа
	|ИЗ
	|	Документ.УчастиеВКД КАК УчастиеВКД
	|ГДЕ
	|	(&ПоВсемОперациям
	|			ИЛИ &ТипОперации = 3
	|				И УчастиеВКД.Ссылка = &Операция)
	|	И (&ПоВсемСчетамДепо
	|			ИЛИ УчастиеВКД.СчетДепо = &НомерСчетаДепо)
	|	И УчастиеВКД.Проведен
	|	И УчастиеВКД.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
КонецФункции

Функция Операции_4_ОтменаПоручения()
	Возврат
	"ВЫБРАТЬ
	|	5 КАК Раздел,
	|	ОтменаПоручения.Ссылка КАК ДокументОперации,
	|	НАЧАЛОПЕРИОДА(ОтменаПоручения.Дата, ДЕНЬ) КАК ДатаОперации,
	|	ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ОтменаПоручения) КАК ТипОперации,
	|	ОтменаПоручения.ДокументОснование КАК ОснованиеОперации,
	|	ОтменаПоручения.ДокументОснование.Инициатор КАК ИнициаторОперации,
	|	ОтменаПоручения.ДокументОснование.ПричинаОтмены КАК ДопИнформация,
	|	ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка) КАК ЦБ,
	|	"""" КАК НаименованиеВыпуска,
	|	"""" КАК ISIN,
	|	"""" КАК РегНом,
	|	ОтменаПоручения.ОтменяемоеПоручение.СчетДепо КАК НомерСчетаДепо,
	|	ОтменаПоручения.ОтменяемоеПоручение.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОтменаПоручения.ОтменяемоеПоручение.СчетДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ОтменаПоручения.ОтменяемоеПоручение.РазделСчетаДепо.ТипРазделаСчетаДЕПО КАК ТипРазделаСчетаДепо,
	|	ПРЕДСТАВЛЕНИЕ(ОтменаПоручения.ОтменяемоеПоручение) КАК СтатусНомерОтменяемого,
	|	0 КАК КоличествоЦБ,
	|	0 КАК ОборотЗачислено,
	|	0 КАК ОборотСписано,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаФиксации,
	|	0 КАК РазмерВыплатыНа1ЦБ,
	|	0 КАК ОбщаяСуммаНачисленной,
	|	0 КАК СуммаНалогаУдержанного,
	|	0 КАК ДополнительныеУдержания,
	|	0 КАК СуммаКВыплате,
	|	0 КАК КоэффициентД1,
	|	0 КАК КоэффициентД2,
	|	"""" КАК ДоходПеречисленНа
	|ИЗ
	|	Документ.ОтменаПоручения КАК ОтменаПоручения
	|ГДЕ
	|	(&ПоВсемОперациям
	|			ИЛИ &ТипОперации = 4
	|				И ОтменаПоручения.Ссылка = &Операция)
	|	И (&ПоВсемСчетамДепо
	|			ИЛИ ОтменаПоручения.ОтменяемоеПоручение.СчетДепо = &НомерСчетаДепо)
	|	И ОтменаПоручения.Проведен
	|	И ОтменаПоручения.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
КонецФункции

Функция Операции_5_ИзменениеАнкетныхДанных()
	Возврат
	"ВЫБРАТЬ
	|	5 КАК Раздел,
	|	ИзменениеАнкетныхДанных.Ссылка КАК ДокументОперации,
	|	НАЧАЛОПЕРИОДА(ИзменениеАнкетныхДанных.Дата, ДЕНЬ) КАК ДатаОперации,
	|	&ОперацияИзменениеАнкетныхДанных КАК ТипОперации,
	|	ИзменениеАнкетныхДанных.ДокументОснование КАК ОснованиеОперации,
	|	ИзменениеАнкетныхДанных.ДокументОснование.Инициатор КАК ИнициаторОперации,
	|	ИзменениеАнкетныхДанных.ДокументОснование.Комментарий КАК ДопИнформация,
	|	ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка) КАК ЦБ,
	|	"""" КАК НаименованиеВыпуска,
	|	"""" КАК ISIN,
	|	"""" КАК РегНом,
	|	ИзменениеАнкетныхДанных.ДокументОснование.СчетДепо КАК НомерСчетаДепо,
	|	ИзменениеАнкетныхДанных.ДокументОснование.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ИзменениеАнкетныхДанных.ДокументОснование.СчетДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ИзменениеАнкетныхДанных.ДокументОснование.РазделСчетаДепо.ТипРазделаСчетаДЕПО КАК ТипРазделаСчетаДепо,
	|	"""" КАК СтатусНомерОтменяемого,
	|	0 КАК КоличествоЦБ,
	|	0 КАК ОборотЗачислено,
	|	0 КАК ОборотСписано,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаФиксации,
	|	0 КАК РазмерВыплатыНа1ЦБ,
	|	0 КАК ОбщаяСуммаНачисленной,
	|	0 КАК СуммаНалогаУдержанного,
	|	0 КАК ДополнительныеУдержания,
	|	0 КАК СуммаКВыплате,
	|	0 КАК КоэффициентД1,
	|	0 КАК КоэффициентД2,
	|	"""" КАК ДоходПеречисленНа
	|ИЗ
	|	Документ.ИзменениеАнкетныхДанных КАК ИзменениеАнкетныхДанных
	|ГДЕ
	|	(&ПоВсемОперациям
	|			ИЛИ &ТипОперации = 5
	|				И ИзменениеАнкетныхДанных.Ссылка = &Операция)
	|	И (&ПоВсемСчетамДепо
	|			ИЛИ ИзменениеАнкетныхДанных.ДокументОснование.СчетДепо = &НомерСчетаДепо)
	|	И ИзменениеАнкетныхДанных.Проведен
	|	И ИзменениеАнкетныхДанных.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
КонецФункции

Функция Операции_5_ИзменениеКатегорииСчетовДепонента()
	Возврат
	"ВЫБРАТЬ
	|	5 КАК Раздел,
	|	ИзменениеКатегорииСчетовДепонента.Ссылка КАК ДокументОперации,
	|	НАЧАЛОПЕРИОДА(ИзменениеКатегорииСчетовДепонента.Дата, ДЕНЬ) КАК ДатаОперации,
	|	ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ИзменениеКатегорииСчетовДепонента) КАК ТипОперации,
	|	ИзменениеКатегорииСчетовДепонента.ДокументОснование КАК ОснованиеОперации,
	|	ИзменениеКатегорииСчетовДепонента.ДокументОснование.Инициатор КАК ИнициаторОперации,
	|	ИзменениеКатегорииСчетовДепонента.ДокументОснование.Комментарий КАК ДопИнформация,
	|	ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка) КАК ЦБ,
	|	"""" КАК НаименованиеВыпуска,
	|	"""" КАК ISIN,
	|	"""" КАК РегНом,
	|	СчетаДепо.Ссылка КАК НомерСчетаДепо,
	|	ЗНАЧЕНИЕ(Справочник.РазделыСчетаДепо.ПустаяССылка) КАК РазделСчетаДепо,
	|	СчетаДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.ПустаяСсылка) КАК ТипРазделаСчетаДепо,
	|	"""" КАК СтатусНомерОтменяемого,
	|	0 КАК КоличествоЦБ,
	|	0 КАК ОборотЗачислено,
	|	0 КАК ОборотСписано,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаФиксации,
	|	0 КАК РазмерВыплатыНа1ЦБ,
	|	0 КАК ОбщаяСуммаНачисленной,
	|	0 КАК СуммаНалогаУдержанного,
	|	0 КАК ДополнительныеУдержания,
	|	0 КАК СуммаКВыплате,
	|	0 КАК КоэффициентД1,
	|	0 КАК КоэффициентД2,
	|	"""" КАК ДоходПеречисленНа
	|ИЗ
	|	Документ.ИзменениеКатегорииСчетовДепонента КАК ИзменениеКатегорииСчетовДепонента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
	|		ПО (СчетаДепо.Владелец = ИзменениеКатегорииСчетовДепонента.Депонент)
	|			И (НЕ СчетаДепо.ПометкаУдаления)
	|			И (ВЫБОР
	|				КОГДА СчетаДепо.ДатаОткрытияСчета > ИзменениеКатегорииСчетовДепонента.Дата
	|					ТОГДА ЛОЖЬ
	|				КОГДА СчетаДепо.ДатаЗакрытияСчета <= ИзменениеКатегорииСчетовДепонента.Дата
	|						И СчетаДепо.ДатаЗакрытияСчета <> ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	(&ПоВсемОперациям
	|			ИЛИ &ТипОперации = 5
	|				И ИзменениеКатегорииСчетовДепонента.Ссылка = &Операция)
	|	И (&ПоВсемСчетамДепо
	|			ИЛИ СчетаДепо.Ссылка = &НомерСчетаДепо)
	|	И ИзменениеКатегорииСчетовДепонента.Проведен
	|	И ИзменениеКатегорииСчетовДепонента.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
КонецФункции

Функция Операции_6_ОткрытиеРазделаСчетаДепо()
	Возврат
	"ВЫБРАТЬ
	|	5 КАК Раздел,
	|	ОткрытиеРазделаСчетаДепо.Ссылка КАК ДокументОперации,
	|	НАЧАЛОПЕРИОДА(ОткрытиеРазделаСчетаДепо.Дата, ДЕНЬ) КАК ДатаОперации,
	|	ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ОткрытиеРазделаСчетаДепо) КАК ТипОперации,
	|	ОткрытиеРазделаСчетаДепо.ДокументОснование КАК ОснованиеОперации,
	|	ОткрытиеРазделаСчетаДепо.ДокументОснование.Инициатор КАК ИнициаторОперации,
	|	ОткрытиеРазделаСчетаДепо.Комментарий КАК ДопИнформация,
	|	ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка) КАК ЦБ,
	|	"""" КАК НаименованиеВыпуска,
	|	"""" КАК ISIN,
	|	"""" КАК РегНом,
	|	ОткрытиеРазделаСчетаДепо.СчетДепо КАК НомерСчетаДепо,
	|	ОткрытиеРазделаСчетаДепо.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОткрытиеРазделаСчетаДепо.СчетДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ОткрытиеРазделаСчетаДепо.РазделСчетаДепо.ТипРазделаСчетаДЕПО КАК ТипРазделаСчетаДепо,
	|	"""" КАК СтатусНомерОтменяемого,
	|	0 КАК КоличествоЦБ,
	|	0 КАК ОборотЗачислено,
	|	0 КАК ОборотСписано,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаФиксации,
	|	0 КАК РазмерВыплатыНа1ЦБ,
	|	0 КАК ОбщаяСуммаНачисленной,
	|	0 КАК СуммаНалогаУдержанного,
	|	0 КАК ДополнительныеУдержания,
	|	0 КАК СуммаКВыплате,
	|	0 КАК КоэффициентД1,
	|	0 КАК КоэффициентД2,
	|	"""" КАК ДоходПеречисленНа
	|ИЗ
	|	Документ.ОткрытиеРазделаСчетаДепо КАК ОткрытиеРазделаСчетаДепо
	|ГДЕ
	|	(&ПоВсемОперациям
	|			ИЛИ &ТипОперации = 6
	|				И ОткрытиеРазделаСчетаДепо.Ссылка = &Операция)
	|	И (&ПоВсемСчетамДепо
	|			ИЛИ ОткрытиеРазделаСчетаДепо.СчетДепо = &НомерСчетаДепо)
	|	И ОткрытиеРазделаСчетаДепо.Проведен
	|	И ОткрытиеРазделаСчетаДепо.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОткрытиеРазделаСчетаДепо.РазделСчетаДепо ССЫЛКА Справочник.РазделыСчетаДепо";
КонецФункции

Функция Операции_7_ЗакрытиеРазделаСчетаДепо()
	Возврат
	"ВЫБРАТЬ
	|	5 КАК Раздел,
	|	ЗакрытиеРазделаСчетаДепо.Ссылка КАК ДокументОперации,
	|	НАЧАЛОПЕРИОДА(ЗакрытиеРазделаСчетаДепо.Дата, ДЕНЬ) КАК ДатаОперации,
	|	ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ЗакрытиеРазделаСчетаДепо) КАК ТипОперации,
	|	ЗакрытиеРазделаСчетаДепо.ДокументОснование КАК ОснованиеОперации,
	|	ЗакрытиеРазделаСчетаДепо.ДокументОснование.Инициатор КАК ИнициаторОперации,
	|	ЗакрытиеРазделаСчетаДепо.Комментарий КАК ДопИнформация,
	|	ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка) КАК ЦБ,
	|	"""" КАК НаименованиеВыпуска,
	|	"""" КАК ISIN,
	|	"""" КАК РегНом,
	|	ЗакрытиеРазделаСчетаДепо.СчетДепо КАК НомерСчетаДепо,
	|	ЗакрытиеРазделаСчетаДепо.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ЗакрытиеРазделаСчетаДепо.СчетДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ЗакрытиеРазделаСчетаДепо.РазделСчетаДепо.ТипРазделаСчетаДЕПО КАК ТипРазделаСчетаДепо,
	|	"""" КАК СтатусНомерОтменяемого,
	|	0 КАК КоличествоЦБ,
	|	0 КАК ОборотЗачислено,
	|	0 КАК ОборотСписано,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаФиксации,
	|	0 КАК РазмерВыплатыНа1ЦБ,
	|	0 КАК ОбщаяСуммаНачисленной,
	|	0 КАК СуммаНалогаУдержанного,
	|	0 КАК ДополнительныеУдержания,
	|	0 КАК СуммаКВыплате,
	|	0 КАК КоэффициентД1,
	|	0 КАК КоэффициентД2,
	|	"""" КАК ДоходПеречисленНа
	|ИЗ
	|	Документ.ЗакрытиеРазделаСчетаДепо КАК ЗакрытиеРазделаСчетаДепо
	|ГДЕ
	|	(&ПоВсемОперациям
	|			ИЛИ &ТипОперации = 7
	|				И ЗакрытиеРазделаСчетаДепо.Ссылка = &Операция)
	|	И (&ПоВсемСчетамДепо
	|			ИЛИ ЗакрытиеРазделаСчетаДепо.СчетДепо = &НомерСчетаДепо)
	|	И ЗакрытиеРазделаСчетаДепо.Проведен
	|	И ЗакрытиеРазделаСчетаДепо.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗакрытиеРазделаСчетаДепо.РазделСчетаДепо ССЫЛКА Справочник.РазделыСчетаДепо";
КонецФункции

Функция Операции_8_ОткрытиеСчетаДепо()
	Возврат
	"ВЫБРАТЬ
	|	5 КАК Раздел,
	|	ОткрытиеСчетаДепо.Ссылка КАК ДокументОперации,
	|	НАЧАЛОПЕРИОДА(ОткрытиеСчетаДепо.Дата, ДЕНЬ) КАК ДатаОперации,
	|	ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ОткрытиеСчетаДепо) КАК ТипОперации,
	|	ОткрытиеСчетаДепо.ДокументОснование КАК ОснованиеОперации,
	|	ОткрытиеСчетаДепо.ДокументОснование.Инициатор КАК ИнициаторОперации,
	|	ОткрытиеСчетаДепо.Комментарий КАК ДопИнформация,
	|	ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка) КАК ЦБ,
	|	"""" КАК НаименованиеВыпуска,
	|	"""" КАК ISIN,
	|	"""" КАК РегНом,
	|	ОткрытиеСчетаДепо.СчетДепо КАК НомерСчетаДепо,
	|	ЗНАЧЕНИЕ(Справочник.РазделыСчетаДепо.ПустаяСсылка) КАК РазделСчетаДепо,
	|	ОткрытиеСчетаДепо.СчетДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.ПустаяСсылка) КАК ТипРазделаСчетаДепо,
	|	"""" КАК СтатусНомерОтменяемого,
	|	0 КАК КоличествоЦБ,
	|	0 КАК ОборотЗачислено,
	|	0 КАК ОборотСписано,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаФиксации,
	|	0 КАК РазмерВыплатыНа1ЦБ,
	|	0 КАК ОбщаяСуммаНачисленной,
	|	0 КАК СуммаНалогаУдержанного,
	|	0 КАК ДополнительныеУдержания,
	|	0 КАК СуммаКВыплате,
	|	0 КАК КоэффициентД1,
	|	0 КАК КоэффициентД2,
	|	"""" КАК ДоходПеречисленНа
	|ИЗ
	|	Документ.ОткрытиеСчетаДепо КАК ОткрытиеСчетаДепо
	|ГДЕ
	|	(&ПоВсемОперациям
	|			ИЛИ &ТипОперации = 8
	|				И ОткрытиеСчетаДепо.Ссылка = &Операция)
	|	И (&ПоВсемСчетамДепо
	|			ИЛИ ОткрытиеСчетаДепо.СчетДепо = &НомерСчетаДепо)
	|	И ОткрытиеСчетаДепо.Проведен
	|	И ОткрытиеСчетаДепо.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОткрытиеСчетаДепо.СчетДепо ССЫЛКА Справочник.СчетаДепо";
КонецФункции

Функция Операции_9_ЗакрытиеСчетаДепо()
	Возврат
	"ВЫБРАТЬ
	|	5 КАК Раздел,
	|	ЗакрытиеСчетаДепо.Ссылка КАК ДокументОперации,
	|	НАЧАЛОПЕРИОДА(ЗакрытиеСчетаДепо.Дата, ДЕНЬ) КАК ДатаОперации,
	|	ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ЗакрытиеСчетаДепо) КАК ТипОперации,
	|	ЗакрытиеСчетаДепо.ДокументОснование КАК ОснованиеОперации,
	|	ЗакрытиеСчетаДепо.ДокументОснование.Инициатор КАК ИнициаторОперации,
	|	ЗакрытиеСчетаДепо.Комментарий КАК ДопИнформация,
	|	ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка) КАК ЦБ,
	|	"""" КАК НаименованиеВыпуска,
	|	"""" КАК ISIN,
	|	"""" КАК РегНом,
	|	ЗакрытиеСчетаДепо.СчетДепо КАК НомерСчетаДепо,
	|	ЗНАЧЕНИЕ(Справочник.РазделыСчетаДепо.ПустаяСсылка) КАК РазделСчетаДепо,
	|	ЗакрытиеСчетаДепо.СчетДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.ПустаяСсылка) КАК ТипРазделаСчетаДепо,
	|	"""" КАК СтатусНомерОтменяемого,
	|	0 КАК КоличествоЦБ,
	|	0 КАК ОборотЗачислено,
	|	0 КАК ОборотСписано,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаФиксации,
	|	0 КАК РазмерВыплатыНа1ЦБ,
	|	0 КАК ОбщаяСуммаНачисленной,
	|	0 КАК СуммаНалогаУдержанного,
	|	0 КАК ДополнительныеУдержания,
	|	0 КАК СуммаКВыплате,
	|	0 КАК КоэффициентД1,
	|	0 КАК КоэффициентД2,
	|	"""" КАК ДоходПеречисленНа
	|ИЗ
	|	Документ.ЗакрытиеСчетаДепо КАК ЗакрытиеСчетаДепо
	|ГДЕ
	|	(&ПоВсемОперациям
	|			ИЛИ &ТипОперации = 9
	|				И ЗакрытиеСчетаДепо.Ссылка = &Операция)
	|	И (&ПоВсемСчетамДепо
	|			ИЛИ ЗакрытиеСчетаДепо.СчетДепо = &НомерСчетаДепо)
	|	И ЗакрытиеСчетаДепо.Проведен
	|	И ЗакрытиеСчетаДепо.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗакрытиеСчетаДепо.СчетДепо ССЫЛКА Справочник.СчетаДепо";
КонецФункции

Функция ОперацииСводно()
	
	Возврат
	"ВЫБРАТЬ
	|	ВТ_Операции.ДокументОперации КАК ДокументОперации,
	|	ЕСТЬNULL(СводныйОтчетОСовершенныхОперациях.Ссылка, НЕОПРЕДЕЛЕНО) КАК СводныйОтчетОСовершенныхОперациях
	|ПОМЕСТИТЬ ВТ_Свод
	|ИЗ
	|	ВТ_Операции КАК ВТ_Операции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СводныйОтчетОСовершенныхОперациях.Операции КАК СводныйОтчетОСовершенныхОперацияхОперации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СводныйОтчетОСовершенныхОперациях КАК СводныйОтчетОСовершенныхОперациях
	|			ПО СводныйОтчетОСовершенныхОперацияхОперации.Ссылка = СводныйОтчетОСовершенныхОперациях.Ссылка
	|		ПО ВТ_Операции.ДокументОперации = СводныйОтчетОСовершенныхОперацияхОперации.ДокументОперации
	|			И (НЕ СводныйОтчетОСовершенныхОперациях.ПометкаУдаления)
	|			И (ВТ_Операции.НомерСчетаДепо = СводныйОтчетОСовершенныхОперациях.СчетДепо)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Операции.ДокументОперации,
	|	СводныйОтчетОСовершенныхОперациях.Ссылка";
	
КонецФункции

Функция ОбъединитьВсе()
	Возврат
	"
	|
	| ОБЪЕДИНИТЬ ВСЕ
	|
	|";
КонецФункции

Функция Разделитель()
	Возврат
	"
	|
	|";
КонецФункции

Функция ОперацииВыборкаОпераций()
	Возврат
	"ВЫБРАТЬ
	|	ВТ_Операции.Раздел КАК Раздел,
	|	ВТ_Операции.ДокументОперации КАК ДокументОперации,
	|	ВТ_Операции.ДатаОперации КАК ДатаОперации,
	|	ВТ_Операции.ТипОперации КАК ТипОперации,
	|	ВТ_Операции.ОснованиеОперации КАК ОснованиеОперации,
	|	ВТ_Операции.ИнициаторОперации КАК ИнициаторОперации,
	|	ВТ_Операции.ДопИнформация КАК ДопИнформация,
	|	ВТ_Операции.ЦБ КАК ЦБ,
	|	ВТ_Операции.НаименованиеВыпуска КАК НаименованиеВыпуска,
	|	ВТ_Операции.ISIN КАК ISIN,
	|	ВТ_Операции.РегНом КАК РегНом,
	|	ВТ_Операции.НомерСчетаДепо КАК НомерСчетаДепо,
	|	ВТ_Операции.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ВТ_Операции.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ВТ_Операции.ТипРазделаСчетаДепо КАК ТипРазделаСчетаДепо,
	|	ВТ_Операции.СтатусНомерОтменяемого КАК СтатусНомерОтменяемого,
	|	ВТ_Операции.КоличествоЦБ КАК КоличествоЦБ,
	|	ВТ_Операции.ОборотЗачислено КАК ОборотЗачислено,
	|	ВТ_Операции.ОборотСписано КАК ОборотСписано,
	|	ВТ_Операции.ДатаФиксации КАК ДатаФиксации,
	|	ВТ_Операции.РазмерВыплатыНа1ЦБ КАК РазмерВыплатыНа1ЦБ,
	|	ВТ_Операции.ОбщаяСуммаНачисленной КАК ОбщаяСуммаНачисленной,
	|	ВТ_Операции.СуммаНалогаУдержанного КАК СуммаНалогаУдержанного,
	|	ВТ_Операции.ДополнительныеУдержания КАК ДополнительныеУдержания,
	|	ВТ_Операции.СуммаКВыплате КАК СуммаКВыплате,
	|	ВТ_Операции.КоэффициентД1 КАК КоэффициентД1,
	|	ВТ_Операции.КоэффициентД2 КАК КоэффициентД2,
	|	ВТ_Операции.ДоходПеречисленНа КАК ДоходПеречисленНа,
	|	ВТ_Свод.СводныйОтчетОСовершенныхОперациях КАК СводныйОтчетОСовершенныхОперациях
	|ИЗ
	|	ВТ_Операции КАК ВТ_Операции
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Свод КАК ВТ_Свод
	|		ПО ВТ_Операции.ДокументОперации = ВТ_Свод.ДокументОперации
	|ГДЕ
	|	(&ВключаяОтправленныеВЭДО
	|			ИЛИ ВТ_Свод.СводныйОтчетОСовершенныхОперациях = НЕОПРЕДЕЛЕНО)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Раздел,
	|	ТипОперации,
	|	ДокументОперации";
КонецФункции

Функция ТекстЗапросаВыборкиОпераций()
	
	Возврат Операции_1_ОперацииЦБ() 						+ ОбъединитьВсе()
	+ Операции_2_ГлобальныеОперацииЦБ() 					+ ОбъединитьВсе()
	+ Операции_2_ГлобальныеОперацииДС() 					+ ОбъединитьВсе()
	+ Операции_3_УчастиеВКД() 								+ ОбъединитьВсе()
	+ Операции_4_ОтменаПоручения() 							+ ОбъединитьВсе()
	+ Операции_5_ИзменениеАнкетныхДанных() 					+ ОбъединитьВсе()
	+ Операции_5_ИзменениеКатегорииСчетовДепонента()		+ ОбъединитьВсе()
	+ Операции_6_ОткрытиеРазделаСчетаДепо() 				+ ОбъединитьВсе()
	+ Операции_7_ЗакрытиеРазделаСчетаДепо() 				+ ОбъединитьВсе()
	+ Операции_8_ОткрытиеСчетаДепо() 						+ ОбъединитьВсе()
	+ Операции_9_ЗакрытиеСчетаДепо() + "; " 				+ Разделитель()
	+ ОперацииСводно()				 + "; " 				+ Разделитель()
	+ ОперацииВыборкаОпераций();
	
КонецФункции

#КонецОбласти

#Область ФормированиеПечатныхФорм

Функция ПолучитьИмяМакета(Контрагент, ОтчетыНаАнглийскомЯзыке, Период)
	
	ЗначениеПоУмолчанию = ДАТА(1, 1, 1);
	ДатаПереходаНаПечатнуюФорму2026 =
		РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("3490.ДатаПереходаНаПечатныеФормыВыписок2026",
			ЗначениеПоУмолчанию);
	
	Если Период >= ДатаПереходаНаПечатнуюФорму2026 Тогда
		ИмяМакета = "Макет2026";
	Иначе
		ИмяМакета = "Макет2023";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) И ОтчетыНаАнглийскомЯзыке Тогда
		ИмяМакета = ИмяМакета + "en";
	КонецЕсли;
	
	Возврат ИмяМакета;
	
КонецФункции

Функция СформироватьПараметрыЗаголовкаМакета(Период, ВыпискаДокумент, Контрагент, ОтчетыНаАнглийскомЯзыке, СчетДЕПО, ИмяМакета)
	
	стПараметры = Новый Структура;
	
	ОрганизацияПоУмолчанию = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ОрганизацияПоУмолчанию");
	
	НачПериода = НачалоДня(Период);
	КонПериода = КонецДня(Период);
	
	Депозитарий			= ОрганизацияПоУмолчанию;
	ДанныеЛицензии		= ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(ОрганизацияПоУмолчанию);
	
	стПараметры.Вставить("Дата", 			"с " + Формат(НачПериода, "ДЛФ=DD") + " по " + Формат(КонПериода, "ДЛФ=DD"));
	стПараметры.Вставить("ИсходящийНомер", СокрЛП(ВыпискаДокумент.Номер));
	стПараметры.Вставить("Депозитарий",		"ДЕПОЗИТАРИЙ" + Символы.ПС + СокрЛП(Депозитарий.Наименование));
	стПараметры.Вставить("Лицензия",		"Лицензия № " + СокрЛП(ДанныеЛицензии.НомерЛицензии));
	стПараметры.Вставить("ЛицензияДата",	"выдана " + Формат(ДанныеЛицензии.ДатаЛицензии, "ДФ=dd.MM.yyyy") + " г. ФСФР России");
	стПараметры.Вставить("Custody",			"");
	
	Если ОтчетыНаАнглийскомЯзыке Тогда
		стПараметры.Депозитарий = стПараметры.Депозитарий + Символы.ПС + стПараметры.Лицензия + Символы.ПС + стПараметры.ЛицензияДата;
		стПараметры.Custody     = "CUSTODY" + Символы.ПС + СокрЛП(Депозитарий.АнглийскоеНаименование) + Символы.ПС
			+ "License No. " + СокрЛП(ДанныеЛицензии.НомерЛицензии) + Символы.ПС
			+ "issued by FFMS of Russia on " + Формат(ДанныеЛицензии.ДатаЛицензии, "ДЛФ=D");
		
		Для Индекс = 1 По 12 Цикл
			стПараметры.Вставить("ор" + Индекс, Сред(стПараметры.ИсходящийНомер, Индекс, 1));
		КонецЦикла;
		
	КонецЕсли;
	
	стПараметры.Вставить("НомерВыписки", "Отчет № " + стПараметры.ИсходящийНомер + " о совершенных операциях по счету ДЕПО");
	
	стПараметры.Вставить("НаименованиеДепонента",
		ОбщегоНазначенияКлиентСервер.НаименованиеЮрФизЛицаКлиента(Контрагент, Период, ОтчетыНаАнглийскомЯзыке));
	стПараметры.Вставить("ДокументыДепонента",
		ОбщегоНазначенияКлиентСервер.ДокументКлиента(Контрагент, Период));
	стПараметры.Вставить("НаименованиеСчетаДЕПО",
		ОбщегоНазначенияКлиентСервер.НаименованиеКлиента(Контрагент, ОтчетыНаАнглийскомЯзыке));
	стПараметры.Вставить("НомерСчетаДЕПО",
		?(ЗначениеЗаполнено(СчетДЕПО), СокрЛП(СчетДЕПО.Код), ""));
	
	ФормированиеПечатныхФорм.СформироватьДатуДДММГГ(стПараметры, "", Период);
	
	ФормированиеПечатныхФорм.СформироватьДатуДДММГГ(стПараметры, "С", НачПериода);
	ФормированиеПечатныхФорм.СформироватьДатуДДММГГ(стПараметры, "По", КонПериода);
	
	Если СтрНайти(ИмяМакета, "Макет2023") > 0 Тогда
		Инфо = ФормированиеПечатныхФорм.ИнформацияОДепозитарии(Период, СчетДЕПО.ВидСчетаДепо)
		+ Символы.ПС + Символы.ПС + ФормированиеПечатныхФорм.ИнформацияОДепозитарииНаАнглийском(Период, СчетДЕПО.ВидСчетаДепо);
		стПараметры.Вставить("ИнформацияОДепозитарии", Инфо);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетДЕПО) Тогда
		Если РегистрыСведений.КлиентыСУчетомНаСчетахТипаC.ЦБКлиентаУчитываютсяНаСчетеТипаС(Период, Контрагент) Тогда
			ТипСчетаДепо = "" + СчетДЕПО.ТипСчетаДепо + " типа С";
		Иначе
			ТипСчетаДепо = СчетДЕПО.ТипСчетаДепо;
		КонецЕсли;
		НаименованиеСчетаДЕПО =
			?(ОтчетыНаАнглийскомЯзыке, ПереводТекстаНаДругиеЯзыки.ДополнитьТекстПереводом(ТипСчетаДепо), СокрЛП(ТипСчетаДепо));
	Иначе
		НаименованиеСчетаДЕПО = "";
	КонецЕсли;
	стПараметры.Вставить("НаименованиеСчетаДЕПО", НаименованиеСчетаДЕПО);
	
	Возврат стПараметры;
	
КонецФункции

Функция СформироватьПараметрыПодвалаМакета(Период, Контрагент, ОтчетыНаАнглийскомЯзыке, СчетДепо, ИмяМакета)
	
	стПараметры = Новый Структура;
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь; 
	Если Не ЗначениеЗаполнено(ТекПользователь) Или Не РольДоступна("ПравоПодписанияОтчетов") Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.ПодписантОтчетовПоУмолчанию);
		ОтветственноеЛицо = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьПоследнее(Период, Отбор).ФизическоеЛицо;
	Иначе
		ОтветственноеЛицо	= ТекПользователь.ФизЛицо;
	КонецЕсли;
	
	стПараметры.Вставить("ФИО",
		?(ОтветственноеЛицо = Неопределено, ПараметрыСеанса.ТекущийПользователь.ПолноеНаименование(), ОтветственноеЛицо.Наименование));
	
	Если ОтчетыНаАнглийскомЯзыке Тогда
		стПараметры.ФИО = стПараметры.ФИО + " / " + ОбщегоНазначенияКлиентСервер.Транслит(стПараметры.ФИО);
	КонецЕсли;
	
	ФормированиеПечатныхФорм.СформироватьДатуВремяДДММГГЧЧММ(стПараметры, "", Период);
	
	Если СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетДЕПО Тогда
		стПараметры.Вставить("РеквизитыПриказа", РегистрыСведений.РеквизитыПриказовПриложенийКРДО.Реквизиты(Период));
	КонецЕсли;
	
	Возврат стПараметры;
	
КонецФункции

Процедура ВывестиСекциюСтрокаОборот(
	ВыборкаОпераций,
	ТабличныйДокумент,
	СтрокаОборот,
	ОтчетыНаАнглийскомЯзыке,
	ВидСчетаДепо,
	ПараметрыПереносаСтраницы)
	
	// --> Проверка на "разрыв" страницы: не отделять первую строку таблицы от шапки
	// 			Заполнение данными области первой строки таблицы
	ПерваяСтрока = ВыборкаОпераций[0];
	ОбластьСтрока = ПараметрыПереносаСтраницы.ОбластьСтрока;
	ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ПерваяСтрока);
	Если ПерваяСтрока.Раздел <> "5" Тогда
		ОбластьСтрока.Параметры.ПредставлениеЦБ = ОбщегоНазначенияКлиентСервер.ПредставлениеЦБ(ПерваяСтрока.ЦБ, ОтчетыНаАнглийскомЯзыке);
	КонецЕсли;
	ТипОперацииСтрокой = ОбщегоНазначенияКлиентСервер.ТипОперацииСтрокой(ПерваяСтрока.ТипОперации, ОтчетыНаАнглийскомЯзыке, ВидСчетаДепо);
	ОбластьСтрока.Параметры.ТипОперации = ТипОперацииСтрокой;
	ОснованиеОперации = ОбщегоНазначенияКлиентСервер.ДокументОснованиеСтрокой(ПерваяСтрока.ОснованиеОперации, ОтчетыНаАнглийскомЯзыке);
	ОбластьСтрока.Параметры.ОснованиеОперации = ОснованиеОперации;
	// 			Подготовка массива областей макета, проверяемых на потенциальный "разрыв" страницы между ними
	// 			: области "шапка" таблицы и "первая строка" таблицы должны быть на одном листе
	СтрокаСШапкой = Новый Массив;
	СтрокаСШапкой.Добавить(ПараметрыПереносаСтраницы.ШапкаРаздела);
	СтрокаСШапкой.Добавить(ОбластьСтрока);
	// 			Подготовка массива областей макета, проверяемых на потенциальный "разрыв" страницы между ними
	// 			: если таблица последняя и в ней одна строка, то на одном листе должна быть и таблица, и "подвал"
	Если ПараметрыПереносаСтраницы.ПоследняяСтрока = 1 Тогда
		СтрокаСШапкой.Добавить(ПараметрыПереносаСтраницы.ОбластьПустаяСтрокаОборот);
		СтрокаСШапкой.Добавить(ПараметрыПереносаСтраницы.Подвал);
	КонецЕсли;
	БылПереносСПодвалом = Ложь;
	// Если проверяемые области не помещаются на один лист - начать их вывод с нового листа
	Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, СтрокаСШапкой) Тогда
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		БылПереносСПодвалом = ПараметрыПереносаСтраницы.ПоследняяСтрока = 1;
	КонецЕсли;
	// <--
	
	ТабличныйДокумент.Вывести(ПараметрыПереносаСтраницы.ШапкаРаздела);
	
	НомерТекущейСтроки = 0;
	СквозныеПараметры = Новый Структура;
	СквозныеПараметры.Вставить("ВидСчетаДепо", 				ВидСчетаДепо);
	СквозныеПараметры.Вставить("ОтчетыНаАнглийскомЯзыке",	ОтчетыНаАнглийскомЯзыке);
	СквозныеПараметры.Вставить("НомерТекущейСтроки", 		0);
	СквозныеПараметры.Вставить("БылПереносСПодвалом", 		БылПереносСПодвалом);
	Для Каждого Данные Из ВыборкаОпераций Цикл
		ВывестиОднуСтрокуСекцииСтрокаОборот(ТабличныйДокумент, Данные, СтрокаОборот, ПараметрыПереносаСтраницы, СквозныеПараметры);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиОднуСтрокуСекцииСтрокаОборот(ТабличныйДокумент, Данные, СтрокаОборот, ПараметрыПереносаСтраницы, СквозныеПараметры)
	СквозныеПараметры.НомерТекущейСтроки = СквозныеПараметры.НомерТекущейСтроки + 1;
	Раздел = Данные.Раздел;
	ОтчетыНаАнглийскомЯзыке = СквозныеПараметры.ОтчетыНаАнглийскомЯзыке;
	
	ЗаполнитьЗначенияСвойств(СтрокаОборот.Параметры, Данные);
	
	Если Раздел <> "5" Тогда
		СтрокаОборот.Параметры.ПредставлениеЦБ = ОбщегоНазначенияКлиентСервер.ПредставлениеЦБ(Данные.ЦБ, ОтчетыНаАнглийскомЯзыке);
	КонецЕсли;
	
	Если Раздел = "1" Или Раздел = "2" Или Раздел = "5" Тогда
		Представление = ОбщегоНазначенияКлиентСервер.ПредставлениеРазделаСчетаДепо(Данные.РазделСчетаДепо, ОтчетыНаАнглийскомЯзыке);
		СтрокаОборот.Параметры.РазделСчетаДепо = Представление;
	КонецЕсли;
	
	Если Раздел = "5" Тогда
		Представление = ОбщегоНазначенияКлиентСервер.ПредставлениеТипаРазделаСчетаДепоДляОтчета(Данные.ТипРазделаСчетаДепо,
																									ОтчетыНаАнглийскомЯзыке);
		СтрокаОборот.Параметры.ТипРазделаСчетаДепо = Представление;
	КонецЕсли;
	
	Если Раздел = "5" Тогда
		Если РегистрыСведений.КлиентыСУчетомНаСчетахТипаC.ЦБКлиентаУчитываютсяНаСчетеТипаС(Данные.ДатаОперации, Данные.ИнициаторОперации) Тогда
			ТипСчетаДепо = "" + Данные.ТипСчетаДепо + " типа С";
		Иначе
			ТипСчетаДепо = Данные.ТипСчетаДепо;
		КонецЕсли;
		НаименованиеСчетаДЕПО =
		?(ОтчетыНаАнглийскомЯзыке, ПереводТекстаНаДругиеЯзыки.ДополнитьТекстПереводом(ТипСчетаДепо), СокрЛП(ТипСчетаДепо));
		СтрокаОборот.Параметры.ТипСчетаДепо = НаименованиеСчетаДЕПО;
	КонецЕсли;
		
	СтрокаОборот.Параметры.ТипОперации = ОбщегоНазначенияКлиентСервер.ТипОперацииСтрокой(Данные.ТипОперации,
												 							ОтчетыНаАнглийскомЯзыке, СквозныеПараметры.ВидСчетаДепо);
	
	ОснованиеОперации = ОбщегоНазначенияКлиентСервер.ДокументОснованиеСтрокой(Данные.ОснованиеОперации, ОтчетыНаАнглийскомЯзыке);
	СтрокаОборот.Параметры.ОснованиеОперации = ОснованиеОперации;
	
	// --> Проверка на "разрыв" страницы: если подвал не вмещается на страницу, то вывести его с последней строкой таблицы на след. лист
	Если Не СквозныеПараметры.БылПереносСПодвалом И СквозныеПараметры.НомерТекущейСтроки = ПараметрыПереносаСтраницы.ПоследняяСтрока Тогда
	// 		Подготовка массива областей макета, проверяемых на потенциальный "разрыв" страницы между ними
	// 		: области "последняя строка" последней таблицы и "подвал" таблицы должны быть на одном листе
		СтрокаСПодвалом = Новый Массив;
		СтрокаСПодвалом.Добавить(СтрокаОборот);
		СтрокаСПодвалом.Добавить(ПараметрыПереносаСтраницы.ОбластьПустаяСтрокаОборот);
		СтрокаСПодвалом.Добавить(ПараметрыПереносаСтраницы.Подвал);
		Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, СтрокаСПодвалом) Тогда
			// Если проверяемые области не помещаются на один лист - начать их вывод с нового листа
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	КонецЕсли;
	// <--
	
	ТабличныйДокумент.Вывести(СтрокаОборот);
КонецПроцедуры

Процедура СформироватьПечатныеФормы(ПоказатьПечатьИПодписьВДокументе, ТаблицаОпераций = Неопределено)
	
	Для Каждого СтрокаСДокументом Из ДокументыКЭДО Цикл
		
		Адрес = Документы.СводныйОтчетОСовершенныхОперациях.АдресПечатнойФормы(
			СтрокаСДокументом.Документ,
			ТаблицаОпераций,
			ПоказатьПечатьИПодписьВДокументе,
			Новый УникальныйИдентификатор);
		Описатель = ПолучитьИзВременногоХранилища(Адрес);
		
		Если Описатель.Свойство("Ошибка") Тогда
			СтрокаСДокументом.АдресТаблицы = "";
		Иначе
			СтрокаСДокументом.АдресТаблицы = ПоместитьВоВременноеХранилище(Описатель.ТабДок);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОпределитьПечатьПодпись(ОпределяющаяДата, ПоказатьПечатьПодписьВОтчете, ПечатьКартинка, FaksimilieКартинка)
	
	FaksimilieКартинка	= Новый Картинка;
	ПечатьКартинка		= Новый Картинка;
	Если Не ПоказатьПечатьПодписьВОтчете Тогда
		Возврат;
	КонецЕсли;
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если Не ЗначениеЗаполнено(ТекПользователь) Или Не РольДоступна("ПравоПодписанияОтчетов") Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.ПодписантОтчетовПоУмолчанию);
		ОтветственноеЛицо 	= РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьПоследнее(ОпределяющаяДата, Отбор).ФизическоеЛицо;
	Иначе
		ОтветственноеЛицо	= ТекПользователь.ФизЛицо;
	КонецЕсли;
	
	ФормированиеПечатныхФорм.ПолучитьФаксимилье(ОтветственноеЛицо, FaksimilieКартинка);
	ПечатьКартинка		= БиблиотекаКартинок.ПечатьДепозитарий;
	
КонецПроцедуры

#КонецОбласти

#Область ОтправкаВЭДО

Процедура ЗаполнитьПараметрыДляДокументооборота(ТаблицаПараметров, Параметры1С, ТипыНаправленийПараметраADO, НачПериода, КонПериода)
	
	ТипДокументСсылкаВыписка = Тип("ДокументСсылка.Выписка");
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "Client";
	НовыйПараметр.ЗначениеПараметра		= СокрЛП(Параметры1С.Клиент);
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Входящий;
		
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "OpenPeriod";
	НовыйПараметр.ЗначениеПараметра		= НачалоДня(НачПериода);
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Входящий;
		
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "ClosePeriod";
	НовыйПараметр.ЗначениеПараметра		= КонецДня(КонПериода);
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Входящий;
		
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "Param1";
	НовыйПараметр.ЗначениеПараметра		= СокрЛП(Параметры1С.Основание.ВидОтчета);
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Входящий;
		
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "Param2";
	НовыйПараметр.ЗначениеПараметра		=
		?(ЗначениеЗаполнено(Параметры1С.Основание) И ТипЗнч(Параметры1С.Основание) = ТипДокументСсылкаВыписка,
		СокрЛП(Параметры1С.Основание.ДокументОснование.ВходящийномерПоручения), "");
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Входящий;
		
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "Param3";
	НовыйПараметр.ЗначениеПараметра		=
		?(ЗначениеЗаполнено(Параметры1С.Основание) И ТипЗнч(Параметры1С.Основание) = ТипДокументСсылкаВыписка,
		Формат(Параметры1С.Основание.ДокументОснование.Дата, "ДФ='dd/MM/yyyy HH:mm:ss'"), "");
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Входящий;
		
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "FileName";
	Если ТипЗнч(Параметры1С.Основание) = ТипДокументСсылкаВыписка Тогда
		НовыйПараметр.ЗначениеПараметра		= "Отчет об операциях по счету ДЕПО";
	Иначе
		НовыйПараметр.ЗначениеПараметра		= "Отчет о выполненной операции";
	КонецЕсли;
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Входящий;
		
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "DocumentDate";
	НовыйПараметр.ЗначениеПараметра		= Параметры1С.Основание.Дата;
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Входящий;
		
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "DocumentNumber";
	НовыйПараметр.ЗначениеПараметра		= СокрЛП(Параметры1С.Основание.Номер);
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.ВходящийИсходящий;
		
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "ClientId";
	НовыйПараметр.ЗначениеПараметра		= УправлениеОтчетами.ПолучитьИдентификаторКлиента(Параметры1С.Клиент);
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Входящий;
		
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "ContractNumber";
	НовыйПараметр.ЗначениеПараметра		= СокрЛП(Параметры1С.СчетДепо.Владелец.Код);
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Входящий;
		
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "TypeId";
	НовыйПараметр.ЗначениеПараметра		= 6;
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Входящий;
		
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "FileExt";
	НовыйПараметр.ЗначениеПараметра		= "pdf";
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Входящий;
		
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "StatusId";
	НовыйПараметр.ЗначениеПараметра		= 1;
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Входящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "ScenariosCode";
	НовыйПараметр.ЗначениеПараметра		= "BackOffice";
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Входящий;
		
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "ExportQuik";
	НовыйПараметр.ЗначениеПараметра		= 0;
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Исходящий;
		
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "ResultMessage";
	НовыйПараметр.ЗначениеПараметра		= "";
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Исходящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра			= "ErrorCode";
	НовыйПараметр.ЗначениеПараметра		= 0;
	НовыйПараметр.НаправлениеПараметра	= ТипыНаправленийПараметраADO.Исходящий;
	
	ВнешниеДанные.ДобавитьПараметрВТаблицу(ТаблицаПараметров, "NewDocId", 0, ТипыНаправленийПараметраADO.Исходящий);
	
КонецПроцедуры

Процедура ПоместитьОтчетыВЭДО(ТаблицаОтчетовЭДО, НачПериода, КонПериода)
	Перем Соединение, КомандаADO, RS;
	
	ВнешниеДанные.ADOConnect(Соединение, КомандаADO, RS, ПланыВидовХарактеристик.ВнешниеИсточники.Документооборот);
	
	ТаблицаПараметров = Новый ТаблицаЗначений();
	ТаблицаПараметров.Колонки.Добавить("ИмяПараметра");
	ТаблицаПараметров.Колонки.Добавить("ЗначениеПараметра");
	ТаблицаПараметров.Колонки.Добавить("НаправлениеПараметра");
	
	ОбработкаДокументооборот = Обработки.Документооборот.Создать();
	ОбработкаДокументооборот.Автовыгрузка = Истина;
	СписокПолейДляСтруктуры = "ПроцедураЗапроса, Клиент, ПолноеИмяФайла, ИмяФайла, ДатаДокумента, ИдентификаторКлиента, НомерДоговора,"
							+ "Комментарий, РасширениеДокумента, СтатусДокумента, ВходящийНомер, ДатаПоступления, ИсходящийНомер, ДатаОтправления,"
							+ "ТипДокумента, ДатаОткрытия, ДатаЗакрытия, Параметр1, Параметр2, Параметр3";
	ОбработкаДокументооборот.ПараметрыДокумента = Новый Структура(СписокПолейДляСтруктуры);
	
	ТипыНаправленийПараметраADO	= ВнешниеДанные.ИнициализацияТиповНаправленияПараметровADO();
	
	Для Каждого ДанныеОбработки Из ТаблицаОтчетовЭДО Цикл
		// Проверим, что выписка еще не была выгружена в ЭДО
		Если ЗначениеЗаполнено(ДанныеОбработки.Основание)
			И РегистрыСведений.РегистрацияДокументовВЭДО.ДокументВыгруженВЭДО(ДанныеОбработки.Основание) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Документ уже был помещен в ЭДО ранее: " + ДанныеОбработки.Основание;
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		// Очистим параметры для передачи файла в ЭДО перед перезаполнением
		ТаблицаПараметров.Очистить();
		// Сохраним файл в формате PDF для передачи в ЭДО
		ДанныеХранилища	= ПолучитьИзВременногоХранилища(ДанныеОбработки.АдресТаблицы);
		ФайлПриемник	= ПолучитьИмяВременногоФайла("PDF");
		ДанныеХранилища.Записать(ФайлПриемник, ТипФайлаТабличногоДокумента.PDF);
		// Заполним данные параметров для ЭДО 
		ЗаполнитьПараметрыДляДокументооборота(ТаблицаПараметров, ДанныеОбработки, ТипыНаправленийПараметраADO, НачПериода, КонПериода);
		// Выгружаем данные
		ОбработкаДокументооборот.ПараметрыДокумента = Новый Структура("ПроцедураЗапроса, ПолноеИмяФайла, ТаблицаПараметров");
		ОбработкаДокументооборот.ПараметрыДокумента.ПроцедураЗапроса	= "CreateDocumentFrom1C";
		ОбработкаДокументооборот.ПараметрыДокумента.ПолноеИмяФайла		= ФайлПриемник;
		ОбработкаДокументооборот.ПараметрыДокумента.ТаблицаПараметров	= ТаблицаПараметров;
		ОбработкаДокументооборот.ПараметрыДокумента.Вставить("ВозвращатьСтатусЗагрузки", Истина); // Требование возврата статуса из обработки
		// Вызываем функцию выгрузки
		ОбработкаДокументооборот.ЗагрузкаДанных();
		// Регистрация успешной выгрузки документа
		Если ОбработкаДокументооборот.ПараметрыДокумента.Свойство("ДокументУспешноЗарегистрирован")
			И ОбработкаДокументооборот.ПараметрыДокумента.ДокументУспешноЗарегистрирован
			И ЗначениеЗаполнено(ДанныеОбработки.Основание) Тогда
			
			РегистрыСведений.РегистрацияДокументовВЭДО.РегистрироватьВыгрузкуДокументаВЭДО(ДанныеОбработки.Основание, ТаблицаПараметров);
			
			ДокВыписка = ДанныеОбработки.Документ.ПолучитьОбъект();
			ДокВыписка.ИсходящийНомер = ДанныеОбработки.Документ.Номер;
			ДокВыписка.ОбменДанными.Загрузка = Истина;
			ДокВыписка.Записать(РежимЗаписиДокумента.Запись);
			
			ДанныеОбработки.ЭДО = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОтправкаВKafka

Функция НаименованиеПоВидуОтчета(ДанныеКОтправке, ФорматДатыОпераций = "ДФ=dd.MM.yyyy", ОриентацияОтчетаПортрет = Ложь)
	
	ТипДокументСсылкаВыписка = Тип("ДокументСсылка.Выписка");
	Если ТипЗнч(ДанныеКОтправке.Основание) = ТипДокументСсылкаВыписка Тогда
		ВидОтчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКОтправке.Основание, "ВидОтчета");
		Если 		ВидОтчета = Перечисления.ВидыОтчетов.СводныйОтчетОСовершеннойОперации Тогда
			НаименованиеОтчета		= "Отчет о совершенной операции";
		ИначеЕсли 	ВидОтчета = Перечисления.ВидыОтчетов.ВыпискаОСостоянииСчетаДЕПО Тогда
			НаименованиеОтчета		= "Выписка о состоянии счета депо";
			ОриентацияОтчетаПортрет = Истина;
		ИначеЕсли 	ВидОтчета = Перечисления.ВидыОтчетов.ОтчетОбОперацияхПоСчетуДЕПО Тогда
			НаименованиеОтчета		= "Отчет об операциях депо";
		Иначе
			НаименованиеОтчета		= "Выписка";
		КонецЕсли;
	Иначе
		НаименованиеОтчета			= "Сводный отчет о совершенных операциях";
	КонецЕсли;
	
	НаименованиеОтчетаДетально = СтрШаблон("%1 по счету %2%3",
		НаименованиеОтчета,
		СокрЛП(ДанныеКОтправке.СчетДепо),
		?(ЗначениеЗаполнено(ДатаОпераций), " за " + Формат(ДатаОпераций, ФорматДатыОпераций), ""));
	
	Возврат НаименованиеОтчетаДетально;
	
КонецФункции

Функция СформироватьЗаписиВЖурналИсходящихСообщенийКафка(ТипДокумента, ДанныеКОтправке, ТипШтампа, ТипФаксимиле)
	
	ДанныеДляJSON = ПодготовленныеДанныеДляJSON(ДанныеКОтправке);
	
	ТекстJSON = СформироватьJSON(ДанныеДляJSON, ТипДокумента, ДанныеКОтправке, ТипШтампа, ТипФаксимиле);
	
	Если ЗначениеЗаполнено(ТекстJSON) Тогда
		Кафка.ПоместитьСообщениеВРегистрКОтправке(ДанныеДляJSON.ВнешнийИсточник, ДанныеДляJSON.Сущность, ТекстJSON,
			ДанныеДляJSON.УИДСообщения, ДанныеКОтправке.Документ);
		УИДСообщения = ДанныеДляJSON.УИДСообщения;
	Иначе
		УИДСообщения = "";
	КонецЕсли;
	
	Возврат УИДСообщения;
	
КонецФункции

Функция ПодготовленныеДанныеДляJSON(ДанныеКОтправке)
	
	ДанныеДляJSON = Новый Структура(
		"ВнешнийИсточник, Сущность, ActionType, CrmClientId, ЮридическиеФизическиеЛица, ЭтоЮрЛицо,УИДСообщения, УИДДокумента");
	
	ДанныеКлиента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеКОтправке.Клиент,
		"ЮридическиеФизическиеЛица, ЮрФизЛицо, Код, СпособОтправкиОтчетов");
	
	СпособОтправкиОтчетов = СпособОтправкиОтчетовСУчетомВыбораПользователя(ДанныеКОтправке, ДанныеКлиента);
	НастройкиОтправки = Справочники.Контрагенты.НастройкиОтправкиОтчетовПоСпособуОтправки(СпособОтправкиОтчетов);
	
	ДанныеДляJSON.Вставить("СпособОтправкиОтчетов" , СпособОтправкиОтчетов);
	ДанныеДляJSON.Вставить("ContractNumber" , ДанныеКлиента.Код);
	
	ДанныеДляJSON.CrmClientId = Обработки.РегистрацияКлиентаЧерезKafka.CrmClientId(ДанныеКлиента.ЮридическиеФизическиеЛица);
	
	ЭтоЮрЛицо = ДанныеКлиента.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
	ДанныеДляJSON.ЭтоЮрЛицо = ЭтоЮрЛицо;
	ДанныеДляJSON.Сущность = НастройкиОтправки.Сущность;
	ДанныеДляJSON.ВнешнийИсточник = НастройкиОтправки.ВнешнийИсточник;
	ДанныеДляJSON.ЮридическиеФизическиеЛица = ДанныеКлиента.ЮридическиеФизическиеЛица;
	
	УИДДокумента = Строка(ДанныеКОтправке.Документ.УникальныйИдентификатор());
	ОтправлялсяВЭДО = Документы.СводныйОтчетОСовершенныхОперациях.БылОтправленВЭДО(ДанныеКОтправке.Документ);
	
	Если ДанныеКОтправке.ActionType = "INS" И Не ОтправлялсяВЭДО Тогда
		УИДСообщения = УИДДокумента;
		ActionType = "INS";
	Иначе
		УИДСообщения = Строка(Новый УникальныйИдентификатор);
		ActionType = "UPD";
	КонецЕсли;
	
	ДанныеДляJSON.УИДСообщения = УИДСообщения;
	ДанныеДляJSON.ActionType = ActionType;
	ДанныеДляJSON.УИДДокумента = УИДДокумента;
	
	Возврат ДанныеДляJSON;

КонецФункции

Функция СформироватьJSON(ДанныеДляJSON, ТипДокумента, ДанныеКОтправке, ТипШтампа, ТипФаксимиле)

	ContractNumber = ДанныеДляJSON.ContractNumber;
	CrmClientId = ДанныеДляJSON.CrmClientId;
	УИДДокумента = ДанныеДляJSON.УИДДокумента;
	УИДСообщения = ДанныеДляJSON.УИДСообщения;
	
	FileData = ДанныеFileData(ДанныеКОтправке, ТипШтампа, ТипФаксимиле);
	
	Если ДанныеДляJSON.СпособОтправкиОтчетов = Перечисления.СпособыОтправкиОтчетов.МП Тогда
		Если ЗначениеЗаполнено(CrmClientId) Тогда
			FilesData = Новый Массив;
			FilesData.Добавить(Новый Структура("FileData", FileData));
			Data = ДанныеData(CrmClientId, ContractNumber, ТипДокумента, ДанныеКОтправке, УИДДокумента, FilesData);
		Иначе
			ДанныеКОтправке.ТекстОшибки = "[CrmClientID] Нет кода загрузки: " + ДанныеДляJSON.ЮридическиеФизическиеЛица;
		КонецЕсли;
	ИначеЕсли ДанныеДляJSON.СпособОтправкиОтчетов = Перечисления.СпособыОтправкиОтчетов.EmailКлиента
		Или ДанныеДляJSON.СпособОтправкиОтчетов = Перечисления.СпособыОтправкиОтчетов.EmailCustody Тогда
		
		file = Новый Структура("fileName, fileExt, fileBody");
		ЗаполнитьЗначенияСвойств(file, FileData);
		attachments = Новый Массив;
		attachments.Добавить(Новый Структура("file", file));
		
		Если ДанныеДляJSON.СпособОтправкиОтчетов = Перечисления.СпособыОтправкиОтчетов.EmailКлиента Тогда
			Data = ДанныеДляЮрЛицData(CrmClientId, ДанныеКОтправке, attachments);
		Иначе
			Email = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("EmailДепозитарногоОтдела");
			Data = ДанныеДляЮрЛицData(CrmClientId, ДанныеКОтправке, attachments, Email);
		КонецЕсли;
		
	Иначе
		ДанныеКОтправке.ТекстОшибки = "Не удалось определить ""Способ отправки отчетов""";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеКОтправке.ТекстОшибки) Тогда
		ТекстJSON = "";
	Иначе
		MessageInfo = ОбменДаннымиКафка.ТиповыеДанныеMessageInfo(ДанныеДляJSON.Сущность, ДанныеДляJSON.ActionType, "1.0.0", УИДСообщения);
		MessageInfo.SystemSource = ВРЕГ(MessageInfo.SystemSource); //Необходимо для обхода обогащения сообщения данными клиента на стороне CRM
		ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	КонецЕсли;
	
	Возврат ТекстJSON;
	
КонецФункции

Функция ДанныеData(CrmClientId, ContractNumber, ТипДокумента, ДанныеКОтправке, УИДДокумента, FilesData)
	
	Док = ДанныеКОтправке.Документ;
	ЭтоВыписка = ТипЗнч(Док) = Тип("ДокументСсылка.Выписка");
	ДокНомер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док, "Номер");
	ДокДата  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док, "Дата");
	ДокДатаНачПериода = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док, "ДатаНачПериода");
	Если Не ЗначениеЗаполнено(ДокДатаНачПериода) Тогда
		Если ЭтоВыписка Тогда
			ДокДатаНачПериода = НачалоДня(ДатаОпераций);
		Иначе
			ДокДатаНачПериода = НачалоДня(ДокДата);
		КонецЕсли;
	КонецЕсли;
	ДокДатаКонПериода = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док, "ДатаКонПериода");
	Если Не ЗначениеЗаполнено(ДокДатаКонПериода) Тогда
		Если ЭтоВыписка Тогда
			ДокДатаКонПериода = КонецДня(ДатаОпераций);
		Иначе
			ДокДатаКонПериода = КонецДня(ДокДата);
		КонецЕсли;
	КонецЕсли;
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("DocumentId",					 УИДДокумента);
	ДанныеДокумента.Вставить("DocumentTypeCode",			 ТипДокумента);
	ДанныеДокумента.Вставить("ContractNumber",				 СокрЛП(ContractNumber));
	ДанныеДокумента.Вставить("CrmClientId",					 СокрЛП(CrmClientId));
	ДанныеДокумента.Вставить("DocumentNumber",				 ДокНомер);
	ДанныеДокумента.Вставить("CreateDate",					 ЗаписатьДатуJSON(ДокДата, ФорматДатыJSON.ISO));
	ДанныеДокумента.Вставить("OpenPeriodDate",				 ЗаписатьДатуJSON(ДокДатаНачПериода, ФорматДатыJSON.ISO));
	ДанныеДокумента.Вставить("ClosePeriodDate",				 ЗаписатьДатуJSON(ДокДатаКонПериода, ФорматДатыJSON.ISO));
	ДанныеДокумента.Вставить("Comment",						 ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док, "Комментарий"));
	ДанныеДокумента.Вставить("Destination",					 ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("145.Destination", "MAPP"));
	
	ДанныеДокумента.Вставить("FilesData", FilesData);
	Возврат ДанныеДокумента;
	
КонецФункции

Функция ДанныеFileData(ДанныеКОтправке, ТипШтампа, ТипФаксимиле)
	
	ДанныеХранилища = ПолучитьИзВременногоХранилища(ДанныеКОтправке.АдресТаблицы);
	ФайлПриемник	= ПолучитьИмяВременногоФайла("PDF");
	ДанныеХранилища.Записать(ФайлПриемник, ТипФайлаТабличногоДокумента.PDF);
	ДанныеФайла = Новый ДвоичныеДанные(ФайлПриемник);
	FileBody = Base64Строка(ДанныеФайла);
	УдалитьФайлы(ФайлПриемник);
	
	IsPortraitOrientation = Ложь;
	НаименованиеОтчетаДетально = НаименованиеПоВидуОтчета(ДанныеКОтправке, "ДФ=dd_MM_yyyy", IsPortraitOrientation);
	
	FileData = Новый Структура;
	FileData.Вставить("FileName"				, НаименованиеОтчетаДетально);
	FileData.Вставить("FileExt"					, "PDF");
	FileData.Вставить("FileBody"				, FileBody);
	FileData.Вставить("Number"					, 1);
	FileData.Вставить("CreateDate"				, ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO));
	FileData.Вставить("StampType"				, ТипШтампа);
	FileData.Вставить("FacsimileType"			, ТипФаксимиле);
	FileData.Вставить("ConvertToPdf"			, Ложь);
	FileData.Вставить("IsPortraitOrientation"	, IsPortraitOrientation);
	
	FileData.Вставить("SignaturesData"	, Неопределено);
	
	Возврат FileData;
	
КонецФункции

Функция ДанныеДляЮрЛицData(CrmClientId, ДанныеКОтправке, attachments, Email = Неопределено)
	
	ДанныеДокумента = Новый Структура();
	Если Email = Неопределено Тогда
		ДанныеДокумента.Вставить("NotificationType", "Client");
		ДанныеДокумента.Вставить("CrmClientId", CrmClientId);
	КонецЕсли;
	ДанныеДокумента.Вставить("Email", Email);
	ДанныеДокумента.Вставить("MailTemplateId", Неопределено);
	ДанныеДокумента.Вставить("MailTemplateTitle", "ОтправкаОтчетаКлиентуЮЛ");
	
	ТемаПисьма = НаименованиеПоВидуОтчета(ДанныеКОтправке);
	ReplaceFields = Новый Структура;
	ReplaceFields.Вставить("ЗаголовокСообщения", ТемаПисьма);
	
	ДанныеДокумента.Вставить("ReplaceFields", ReplaceFields);
	
	ДанныеДокумента.Вставить("Attachments", attachments);
	Возврат ДанныеДокумента;
	
КонецФункции

Функция ЕстьРеквизитВДанныхКОтправке(ДанныеКОтправке, ИмяРеквизита)
	
	ТипДанныеКОтправке = ТипЗнч(ДанныеКОтправке);
	Если ТипДанныеКОтправке = Тип("Структура") Тогда
		ЕстьРеквизит = ДанныеКОтправке.Свойство(ИмяРеквизита);
	Иначе
		ОбъектМетаданныхПоТипу = Метаданные.НайтиПоТипу(ТипДанныеКОтправке);
		ЕстьРеквизит = ОбъектМетаданныхПоТипу.Реквизиты.Найти(ИмяРеквизита) <> Неопределено;
	КонецЕсли;
	Возврат ЕстьРеквизит;
	
КонецФункции

Функция СпособОтправкиОтчетовСУчетомВыбораПользователя(ДанныеКОтправке, ДанныеКлиента)
	
	СпособОтправкиОтчетов = Неопределено;
	ИмяРеквизитаСпособаОтправки = "СпособОтправкиОтчетов";
	Если ЕстьРеквизитВДанныхКОтправке(ДанныеКОтправке, ИмяРеквизитаСпособаОтправки) Тогда
		СпособОтправкиОтчетов = ДанныеКОтправке[ИмяРеквизитаСпособаОтправки];
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СпособОтправкиОтчетов) Тогда
		СпособОтправкиОтчетов = ДанныеКлиента[ИмяРеквизитаСпособаОтправки];
	КонецЕсли;
	
	Возврат СпособОтправкиОтчетов;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Сформировать
//
// Параметры:
//  ВключаяОтправленныеВЭДО	 - Булево		 - Признак того, брать ли операции уже переданные в ЭДО
//  НеобходимоПоместитьВЭДО	 - Булево		 - Признак необходимости помещения отчетов в ЭДО
//  ФаксимилеВОтчетах		 - Булево		 - Признак необходимости показать печать подпись
//  ПоСчетуДепо				 - СправочникСсылка.СчетаДепо	 - Отбор по счету депо
//  ПоВыписке				 - ДокументСсылка				 - Выписка по которой получаются данные
//  ПоОперации				 - ДокументСсылка				 - Операция по которой получаются данные
//
Процедура Сформировать(
	ВключаяОтправленныеВЭДО,
	НеобходимоПоместитьВЭДО,
	ФаксимилеВОтчетах,
	ПоСчетуДепо,
	ПоВыписке = Неопределено,
	ПоОперации = Неопределено) Экспорт
	
	ЭтоИнформационнаяВыписка = ЗначениеЗаполнено(ПоОперации);
	
	// Отправка в ЭДО (0) или в Kafka (1)
	ВыгрузкаВЭДО = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("83.СводныеОтчетыВЭДОилиВKafka", 1) = 0;
	
	// 1 Очистить сводные отчеты о совершенных операциях +\- ДнейОчистки от даты формирования отчетов
	Если Не ЭтоИнформационнаяВыписка Тогда
		ДнейОчистки = 0;
		НачалоПериодаОчистки = ДатаФормированияОтчетов - ДнейОчистки;
		КонецПериодаОчистки  = ДатаФормированияОтчетов + ДнейОчистки;
		Попытка
			ОчисткаСводныхОтчетовНеВЭДО(НачалоПериодаОчистки, КонецПериодаОчистки, ПоСчетуДепо);
		Исключение
			ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;
	КонецЕсли;
	
	// 2 Получить операции
	ЗаполнитьТаблицуОпераций(ДатаОпераций, ВключаяОтправленныеВЭДО, ПоСчетуДепо, ПоОперации);
	
	// 3 Сформировать сводные отчеты о совершенных операциях
	Если ЭтоИнформационнаяВыписка Тогда
		СформироватьИнформационнуюВыписку(ПоВыписке);
	Иначе
		СформироватьСводныеОтчеты(НеобходимоПоместитьВЭДО);
	КонецЕсли;
	
	Если НеобходимоПоместитьВЭДО Тогда
		// 4 Удалить Регистрацию в Документообороте для UPD
		УдалитьРегистрациюЭДО();
		
		// 5 Создать табличные документы печатных форм
		ПоказатьПечатьИПодписьВДокументе = ФаксимилеВОтчетах И (ВыгрузкаВЭДО Или Не НеобходимоПоместитьВЭДО);
		Если ЭтоИнформационнаяВыписка Тогда
			ТаблицаОпераций = Операции.Выгрузить();
			СформироватьПечатныеФормы(ПоказатьПечатьИПодписьВДокументе, ТаблицаОпераций);
		Иначе
			СформироватьПечатныеФормы(ПоказатьПечатьИПодписьВДокументе);
		КонецЕсли;
		
		// 6 Отправка в ЭДО (0) или в Kafka (любое число, кроме 0)
		Если ВыгрузкаВЭДО Тогда
			ПоместитьОтчетыВЭДО(ДокументыКЭДО, ДатаОпераций, ДатаОпераций);
		Иначе
			ОтправитьПечатьПодписьВОтчете 	= ФаксимилеВОтчетах И НеобходимоПоместитьВЭДО;
			
			ПоместитьОтчетыВKafka("DepoReport", ДокументыКЭДО, ОтправитьПечатьПодписьВОтчете);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Заполнить таблицу операций
//
// Параметры:
//  Период					 - Дата							 - День, за который выбираются операции
//  ВключаяОтправленныеВЭДО	 - Булево						 - Признак того, брать ли операции уже переданные в ЭДО
//  ПоСчетуДепо				 - СправочникСсылка.СчетаДепо	 - Отбор по счету депо
//  ПоОперации				 - ДокументСсылка				 - Операция по которой получаются данные
//
Процедура ЗаполнитьТаблицуОпераций(Период, ВключаяОтправленныеВЭДО, ПоСчетуДепо = Неопределено, ПоОперации = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаВыборкиОпераций();
	Запрос.УстановитьПараметр("ПоВсемСчетамДепо", Не ЗначениеЗаполнено(ПоСчетуДепо));
	Запрос.УстановитьПараметр("НомерСчетаДепо", ПоСчетуДепо);
	Запрос.УстановитьПараметр("ПоВсемОперациям", Не ЗначениеЗаполнено(ПоОперации));
	Запрос.УстановитьПараметр("Операция", ПоОперации);
	Запрос.УстановитьПараметр("ТипОперации", ТипОперацииПоОперации(ПоОперации));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Период));
	Запрос.УстановитьПараметр("ОперацияИзменениеАнкетныхДанных", Справочники.ВидыОпераций.ВидОперацииИзменениеАнкетныхДанных());
	
	Запрос.УстановитьПараметр("ВключаяОтправленныеВЭДО", ВключаяОтправленныеВЭДО);
	ВалютыРублевогоНалога = Новый Массив;
	ВалютыРублевогоНалога.Добавить(Справочники.Валюты.ПустаяСсылка());
	ВалютыРублевогоНалога.Добавить(ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ВалютаРегламентированногоУчета"));
	Запрос.УстановитьПараметр("ВалютыРублевогоНалога", ВалютыРублевогоНалога);
	Выборка = Запрос.Выполнить().Выбрать();
	Операции.Очистить();
	Пока Выборка.Следующий() Цикл
		Если Справочники.Контрагенты.ОсобыеУсловия(Выборка.НомерСчетаДепо.Владелец) Тогда
			Если Не РегистрыСведений.ОтветственныеЛицаОрганизаций.ПользовательМожетРедактироватьОсобыеУсловия() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Особые условия: " + Выборка.НомерСчетаДепо.Владелец
				+ ". Выполнение операции доступно Ответственному за особых клиентов");
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		СтрокаОпераций = Операции.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОпераций, Выборка);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает табличный документ сводного отчета
//
// Параметры:
//  ПараметрыПечати				 - Структура		 - Структура с полями:
//  	*Период						 - Дата		 - Дата операции
//  	*ДатаОтчета					 - Дата		 - Дата\время формирования отчета
//  	*СчетДепо					 - СправочникСсылка.СчетаДепо	 - Счет депо
//  	*ДокументОснование			 - ДокументСсылка				 - Документ , на основании которого формируется сводный отчет
//  	*Клиент						 - СправочникСсылка.Контрагенты	 - Клиент
//  	*ОтчетыНаАнглийскомЯзыке	 - Булево						 - Признак формирование печатных форм с английским языком
//  	*ТаблицаОпераций			 - ТаблицаЗначений				 - Таблица операций, соотвествует табличной части Операции
//  	*ВыводитьФаксимилеВОтчетах	 - Булево						 - Признак вывода Факсимиле
// 
// Возвращаемое значение:
//   - ТабличныйДокумент - Табличный документ сформированного отчета
//
Функция СформироватьПечатнуюФорму(ПараметрыПечати) Экспорт
	
	ВсегоРазделов = 5;
	
	Период = 					ПараметрыПечати.Период;
	ДатаОтчета = 				ПараметрыПечати.ДатаОтчета;
	СчетДепо = 					ПараметрыПечати.СчетДепо;
	ДокументОснование = 		ПараметрыПечати.ДокументОснование;
	Клиент = 					ПараметрыПечати.Клиент;
	ОтчетНаАнглийскомЯзыке = 	ПараметрыПечати.ОтчетыНаАнглийскомЯзыке;
	ТаблицаОпераций = 			ПараметрыПечати.ТаблицаОпераций;
	ПоказатьФаксимилеВОтчете = 	ПараметрыПечати.ВыводитьФаксимилеВОтчетах;
	
	ИмяМакета = ПолучитьИмяМакета(Клиент, ОтчетНаАнглийскомЯзыке, Период);
	Макет = ПолучитьМакет(ИмяМакета);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб		 = Истина;
	ТабличныйДокумент.ТолькоПросмотр	 = Истина;
	ТабличныйДокумент.РазмерСтраницы	 = "A4";
	
	ВидСчетаДепо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДепо, "ВидСчетаДепо");
	
	Основание = ДокументОснование.Ссылка;
	
	ОпределяющаяДата = Основание.Дата;
	
	ИмяСекции = "Заголовок";
	Область = Макет.ПолучитьОбласть(ИмяСекции);
	ПараметрыЗаголовка = СформироватьПараметрыЗаголовкаМакета(Период, ДокументОснование, Клиент, ОтчетНаАнглийскомЯзыке, СчетДепо, ИмяМакета);
	Область.Параметры.Заполнить(ПараметрыЗаголовка);
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(Область.Параметры, ИмяМакета, ИмяСекции, мТекстыЗаголовков, ВидСчетаДепо);
	ТабличныйДокумент.Вывести(Область);
	
	/////////////////////////////////////////////////////////////////////////////
	
	ПараметрыПереносаСтраницы = Новый Структура;
	// Структура ПараметрыПереносаСтраницы - содержит параметры необходимые для проверки размещения областей макета на одном листе
	//  * ПоследняяСтрока			 - Номер последней строки в последней таблице отчета (для "не последних" таблиц равен 0)
	//  * ШапкаРаздела				 - Область "Шапки" раздела (таблицы) отчета
	//  * ОбластьСтрока				 - Область "Строки" раздела (таблицы) отчета
	//  * ОбластьПустаяСтрокаОборот	 - Область "Пустой" строки - разделителя разделов (таблиц) в отчете
	//  * Подвал					 - Область "Подвала" отчета
	
	ОбластьПустаяСтрокаОборот = Макет.ПолучитьОбласть("ПустаяСтрокаОборот");
	ПараметрыПереносаСтраницы.Вставить("ОбластьПустаяСтрокаОборот", ОбластьПустаяСтрокаОборот);
	
	ИмяСекции = "Подвал";
	Подвал = Макет.ПолучитьОбласть(ИмяСекции);
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(Подвал.Параметры, ИмяМакета, ИмяСекции, мТекстыЗаголовков, ВидСчетаДепо);
	ПараметрыПодвала = СформироватьПараметрыПодвалаМакета(ДатаОтчета, Клиент, ОтчетНаАнглийскомЯзыке, СчетДепо, ИмяМакета);
	Подвал.Параметры.Заполнить(ПараметрыПодвала);
	
	ОпределитьПечатьПодпись(ОпределяющаяДата, ПоказатьФаксимилеВОтчете, Подвал.Рисунки.Печать.Картинка, Подвал.Рисунки.Faksimilie.Картинка);
	ПараметрыПереносаСтраницы.Вставить("Подвал", Подвал);
	
	НомерРазделаПоследний = 0;
	Для НомерРаздела = 1 По ВсегоРазделов Цикл
		НомерРазделаСтрокой = Формат(НомерРаздела, "ЧГ=0");
		
		ВыборкаОпераций = ВыборкаОперацийРаздела(НомерРазделаСтрокой, ТаблицаОпераций);
		Если ВыборкаОпераций.Количество() > 0 Тогда
			НомерРазделаПоследний = НомерРаздела;
		КонецЕсли;
	КонецЦикла;
	
	/////////////////////////////////////////////////////////////////////////////
	
	Для НомерРаздела = 1 По ВсегоРазделов Цикл
		НомерРазделаСтрокой = Формат(НомерРаздела, "ЧГ=0");
		
		ВыборкаОпераций				 = ВыборкаОперацийРаздела(НомерРазделаСтрокой, ТаблицаОпераций);
		ВыборкаОперацийКоличество	 = ВыборкаОпераций.Количество();
		Если ВыборкаОперацийКоличество > 0 Тогда
			
			Если НомерРаздела = НомерРазделаПоследний Тогда
				ПоследняяСтрока = ВыборкаОперацийКоличество;
			Иначе
				ПоследняяСтрока = 0;
			КонецЕсли;
			ПараметрыПереносаСтраницы.Вставить("ПоследняяСтрока", ПоследняяСтрока);
			
			ИмяСекции = "ШапкаРаздел" + НомерРазделаСтрокой;
			ШапкаРаздела = Макет.ПолучитьОбласть(ИмяСекции);
			ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ШапкаРаздела.Параметры, ИмяМакета, ИмяСекции, мТекстыЗаголовков, ВидСчетаДепо);
			ПараметрыПереносаСтраницы.Вставить("ШапкаРаздела", ШапкаРаздела);
			
			СтрокаОборот = Макет.ПолучитьОбласть("СтрокаРаздел" + НомерРазделаСтрокой);
			ПараметрыПереносаСтраницы.Вставить("ОбластьСтрока", СтрокаОборот);
			
			ВывестиСекциюСтрокаОборот(ВыборкаОпераций, ТабличныйДокумент, СтрокаОборот, ОтчетНаАнглийскомЯзыке, ВидСчетаДепо,
				ПараметрыПереносаСтраницы);
			
			ТабличныйДокумент.Вывести(ОбластьПустаяСтрокаОборот);
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(Подвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Процедура - Поместить отчеты в kafka
//
// Параметры:
//  ТипДокумента					 - Строка			 - см. модель данных, поле DocumentTypeCode (название типа документа)
//  ТаблицаОтчетовЭДО				 - ТаблицаЗначений	 - см. таблицу Обработки\ФормированиеОтчетовОСовершенныхОперациях\ДокументыКЭДО
//  ОтправитьПечатьПодписьВОтчете	 - Булево			 - Признак отправки печати и подписи с отчетом
//
Процедура ПоместитьОтчетыВKafka(ТипДокумента, ТаблицаОтчетовЭДО, ОтправитьПечатьПодписьВОтчете) Экспорт
	
	Если ОтправитьПечатьПодписьВОтчете Тогда
		ТипШтампа	 = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("189.ТипШтампа", Неопределено);
		ТипФаксимиле = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("189.ТипФаксимиле", Неопределено);
	Иначе
		ТипШтампа	 = Неопределено;
		ТипФаксимиле = Неопределено;
	КонецЕсли;
	
	Для Каждого ДанныеОбработки Из ТаблицаОтчетовЭДО Цикл
		ОбработатьДанныеОтчетаДляПередачиВКафку(ДанныеОбработки, ТипДокумента, ТипШтампа, ТипФаксимиле);
	КонецЦикла;
	
КонецПроцедуры

// Процедура обрабатывает данные по сводному отчету и передает в Кафку
//
// Параметры:
//  ДанныеОбработки	 - ОбработкаТабличнаяЧастьСтрока.ФормированиеОтчетовОСовершенныхОперациях.ДокументыКЭДО - данные по отчету к обработке
//  ТипДокумента	 - Строка - тип документа для передачи в Кафка
//  ТипШтампа		 - Строка - тип штампа для передачи в Кафка
//  ТипФаксимиле	 - Строка - тип факсимиле для передачи в Кафка
//
Процедура ОбработатьДанныеОтчетаДляПередачиВКафку(ДанныеОбработки, ТипДокумента, ТипШтампа, ТипФаксимиле) Экспорт
	ДанныеОбработки.ТекстОшибки = "";
	УИДСообщения = "";
	Попытка
		УИДСообщения = СформироватьЗаписиВЖурналИсходящихСообщенийКафка(ТипДокумента, ДанныеОбработки, ТипШтампа, ТипФаксимиле);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДанныеОбработки.ТекстОшибки = ТекстОшибки;
	КонецПопытки;
	УспешнаяОтправка = ЗначениеЗаполнено(УИДСообщения);
	
	Если УспешнаяОтправка Тогда
		ДокВыписка = ДанныеОбработки.Документ.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(ДокВыписка.ИсходящийНомер) Тогда
			ДокВыписка.ИсходящийНомер = УИДСообщения;
			ДокВыписка.СпособОтправкиОтчета = Справочники.СпособыПередачиИнформации.ЭДО;
			ДокВыписка.ОбменДанными.Загрузка = Истина;
			ДокВыписка.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		ДанныеОбработки.ЭДО = Истина;
		ОбменДаннымиКафка.ЗаписатьОбъектВИсходящиеСообщенияКафкаПриЗаписиДокумента(ДокВыписка);
		
		Запись = РегистрыСведений.УведомленияОтправленныеЧерезЛичныйКабинет.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДатаСеанса();
		Запись.КД = ДанныеОбработки.Документ;
		Запись.Клиент = ДанныеОбработки.Клиент;
		Запись.СчетДепо = ДанныеОбработки.СчетДепо;
		Запись.ИдентификаторУведомления = УИДСообщения;
		Запись.СтатусДоставкиУведомления = Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ВыгруженИз1С;
		Запись.Записать();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Инициализация

мТекстыЗаголовков = ФормированиеПечатныхФорм.ТекстыЗаголовковОтчетов(ПолучитьМакет("Заголовки").ПолучитьТекст());

#КонецОбласти
