
Процедура ОтразитьСтатусКорпоративногоДействия(ДокументыКД, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументыКД) = Тип("Массив") Тогда
		МассивСсылок = ДокументыКД;
	ИначеЕсли ОбщегоНазначения.ЗначениеСсылочногоТипа(ДокументыКД) Тогда
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(ДокументыКД);
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(МассивСсылок) Тогда
		Возврат;
	КонецЕсли;
		
	СтруктураПоиска = Новый Структура("КорпоративноеДействие");
	
	ТаблицаСтатусов = ТаблицаСтатусовКорпоративныхДействий(МассивСсылок);
	ТаблицаПредыдущихСтатусов = ТаблицаПредыдущихСтатусовКД(МассивСсылок);
	
	Для Каждого СтрокаТаблицы Из ТаблицаСтатусов Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицы);
		МассивДействующихСтатусов = ТаблицаПредыдущихСтатусов.НайтиСтроки(СтруктураПоиска);
		
		СтатусИзменен = Истина;
		
		Если МассивДействующихСтатусов.Количество() > 0 Тогда
			ДействующийСтатус = МассивДействующихСтатусов[0].Статус;
			СтатусИзменен = ДействующийСтатус <> СтрокаТаблицы.Статус;
		КонецЕсли;
		
		Если СтатусИзменен Тогда
			НачатьТранзакцию();
			МенеджерЗапись = РегистрыСведений.СтатусыКорпоративныхДействий.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗапись, СтрокаТаблицы);
			МенеджерЗапись.Период = ТекущаяДата();
					
			Попытка
				МенеджерЗапись.Записать(Истина);
				ЗафиксироватьТранзакцию();
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось отразить статус корпоративного действия: %Ссылка% по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", СтрокаТаблицы.КорпоративноеДействие);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьЖурналаРегистрации("Изменение статуса корпоративного действия", УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Документы.КорпоративноеДействие_Новый, СтрокаТаблицы.КорпоративноеДействие, ТекстСообщения);
				ОтменитьТранзакцию();
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаПредыдущихСтатусовКД(МассивСсылок)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СтатусыКорпоративныхДействийСрезПоследних.КорпоративноеДействие КАК КорпоративноеДействие,
	|	СтатусыКорпоративныхДействийСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыКорпоративныхДействий.СрезПоследних(,КорпоративноеДействие В(&МассивКД)) КАК СтатусыКорпоративныхДействийСрезПоследних");
	Запрос.УстановитьПараметр("МассивКД", МассивСсылок);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТаблицаСтатусовКорпоративныхДействий(МассивСсылок)
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КорпоративноеДействие_Новый.УведомлениеОтправлено
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыКД.ОтправленоУведомление)
	|		КОГДА НЕ КорпоративноеДействие_Новый.Проведен
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыКД.Создано)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыКД.Просмотрено)
	|	КОНЕЦ КАК Статус,
	|	КорпоративноеДействие_Новый.Ссылка КАК КорпоративноеДействие
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый КАК КорпоративноеДействие_Новый
	|ГДЕ
	|	КорпоративноеДействие_Новый.Ссылка В(&МассивКД)";	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивКД", МассивСсылок);
	ТаблицаСтатусов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаСтатусов;
	
КонецФункции

