
Функция ОбщийКаталогПеремещаемогоФайлаВАрхив(КаталогАрхива, ВидОтчета, ТолькоКаталогАрхиваНаДату = Ложь,
												СоздаватьНедостающиеКаталоги = Истина) Экспорт
		
	// 1. каталоги даты  (Год\Месяц\День)
	ТекущаяДата 	= ТекущаяДатаСеанса();
	
	ТекущийГод 		= Формат(Год(ТекущаяДата),		"ЧГ=0");
	ТекущийМесяц 	= Формат(Месяц(ТекущаяДата),	"ЧЦ=2; ЧВН=; ЧГ=0");
	ТекущийДень 	= Формат(День(ТекущаяДата),		"ЧЦ=2; ЧВН=; ЧГ=0");
	
	ТекущийКаталогПоДате = ТекущийГод + "\" + ТекущийМесяц + "\" + ТекущийДень;
	Если СоздаватьНедостающиеКаталоги Тогда
		ПроверитьНаличиеКаталоговВСтруктуре(КаталогАрхива, ТекущийКаталогПоДате);
	КонецЕсли;
	ТекущийКаталогАрхиваНаДату = КаталогАрхива + "\" + ТекущийКаталогПоДате;
	
	Если ТолькоКаталогАрхиваНаДату Тогда
		Возврат ТекущийКаталогАрхиваНаДату;
	КонецЕсли;
	
	// 2. Система = Депо
	ТекущийКаталогПоСистеме = "Депо";
	Если СоздаватьНедостающиеКаталоги Тогда
		ПроверитьНаличиеКаталоговВСтруктуре(ТекущийКаталогАрхиваНаДату, ТекущийКаталогПоСистеме);
	КонецЕсли;
	ТекущийКаталогАрхиваНаДатуПоСистеме = ТекущийКаталогАрхиваНаДату + "\" + ТекущийКаталогПоСистеме;
		
	// 3. Вид отчета
	ТекущийКаталогПоВидуОтчета = ВидОтчета;
	Если СоздаватьНедостающиеКаталоги Тогда
		ПроверитьНаличиеКаталоговВСтруктуре(ТекущийКаталогАрхиваНаДатуПоСистеме, ТекущийКаталогПоВидуОтчета);
	КонецЕсли;
	ТекущийКаталогАрхиваНаДатуПоСистемеПоВидуОтчета = ТекущийКаталогАрхиваНаДатуПоСистеме + "\" + ТекущийКаталогПоВидуОтчета;
	
	Возврат ТекущийКаталогАрхиваНаДатуПоСистемеПоВидуОтчета;
	
КонецФункции

Процедура ПроверитьНаличиеКаталоговВСтруктуре(ИмяКорневогоКаталога, ИмяТекущегоКаталога)
	
	ТекущийКаталогНайден = Ложь;
	
	ФайлыКаталога = НайтиФайлы(ИмяКорневогоКаталога, ИмяТекущегоКаталога);
	
	Для Каждого НайденныйФайл Из ФайлыКаталога Цикл
		Если НайденныйФайл.ЭтоКаталог() Тогда
			ТекущийКаталогНайден = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ТекущийКаталогНайден Тогда
		СоздатьКаталог(ИмяКорневогоКаталога + "\" + ИмяТекущегоКаталога);
	КонецЕсли;
	
КонецПроцедуры

