//**************************************************************************************************
// ОБРАБОТЧИКИ СОБЫТИЙ
//**************************************************************************************************

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОбработкаКомандыНаСервере(ПараметрКоманды);
КонецПроцедуры

//**************************************************************************************************
// СЛУЖЕБНЫЕ ФУНКЦИИ
//**************************************************************************************************

&НаСервере
Процедура ОбработкаКомандыНаСервере(ПараметрКоманды)
	Для Каждого Документ ИЗ ПараметрКоманды Цикл
		Если Не ЗначениеЗаполнено(Документ) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(
				"Выгрузка списка раскрытия возможна только для записанного документа без изменений!");
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗаполненыВсеНеобходимыеРеквизитыДокумента(Документ) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(
				"Заполнены не все необходимые для формирования списка раскрытия реквизиты документа "+Документ);
			Продолжить;
		КонецЕсли;	
		
		Если Документ.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.PARTAD Тогда
			Если Документ.ВыгрузкаPARTADВCоответствииCоCтатьей8_6_1 Тогда
				ВыгрузитьСписокСерверPARTADДепонентыССубклиентамиXLS(Документ);
			КонецЕсли;
			ВыгрузитьСписокСерверPARTAD(Документ);	
			
		ИначеЕсли Документ.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.ISO20022 Тогда
			Если ВыполненыУсловияВыгрузкиПоИСО20022(Документ) Тогда
				ДокументОбъект = Документ.ПолучитьОбъект();
				ДокументОбъект.СформироватьФайлПоЦБвФШ_ISO();
			КонецЕсли;
		ИначеЕсли Документ.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.FCDR_2017_02 Тогда
			ОписаниеОшибки = "";
			Обработки.РаскрытиеСписковВладельцевFCDR_2017_02.ВыгрузитьРаскрытиеСпискаВ_ФШ(Документ,ОписаниеОшибки);
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(
					"Ошибка выгрузки списка раскрытия "+Документ+": "+ОписаниеОшибки);
			КонецЕсли;
			
		Иначе
			ОбщегоНазначения.СообщитьОбОшибке("Не определен тип используемой выгрузки для " + Документ);
		КонецЕсли;			
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ЗаполненыВсеНеобходимыеРеквизитыДокумента(ПараметрПроверки)
	МетаданныеПроверка = ПараметрПроверки.Метаданные();
	
	Для Каждого Реквизит из МетаданныеПроверка.Реквизиты Цикл
		Если Реквизит.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку Тогда
			Если НЕ ЗначениеЗаполнено(ПараметрПроверки[Реквизит.Имя]) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	Если ПараметрПроверки.Дораскрытие И НЕ ЗначениеЗаполнено(ПараметрПроверки.ДораскрытиеДокумент) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

&НаСервере
Функция ВыполненыУсловияВыгрузкиПоИСО20022(Документ)
	МожноВыгружать = Ложь;
	Если ЗначениеЗаполнено(Документ.СвязанныйВидКД1) И Документ.СвязанныйВидКД1.Код = "WTRC" Тогда
		ОбщегоНазначения.СообщитьОбОшибке(
			"Подтверждение освобождения от налогов не требует выгрузки РСВ. 
			|	Используйте кнопку Выгрузить на вкладке Сводное раскрытие");
	ИначеЕсли Не Документ.Проведен Тогда
		ОписаниеОшибки = "Документ " + Документ + " не проведен. Файл раскрытия не может быть сформирован";
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка выгрузки списка раскрытия " + Документ + ": " + ОписаниеОшибки);
	Иначе
		МожноВыгружать = Истина;
	КонецЕсли;
	Возврат МожноВыгружать;
КонецФункции

//**************************************************************************************************
// РАБОТА С XML ВЫГРУЗКОЙ ПАРТАД
//**************************************************************************************************

&НаСервере
Процедура ВыгрузитьСписокСерверPARTAD(ПараметрКоманды)
	// Контроль заполненности документа
	Если Не ПараметрКоманды.Проведен Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Файл раскрытия списка не сформирован - Не заполнен и не проведен документ!");
	КонецЕсли;
	// Получим код LEI
	КодLEI = СокрЛП(ПараметрКоманды.Организация.LEI);
	Если Не ЗначениеЗаполнено(КодLEI) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Файл раскрытия списка не сформирован - Не заполнен LEI код у организации!");
		Возврат;
	КонецЕсли;	
	// Если список владельцев пуст, то не формируем
	Если ПараметрКоманды.СписокВладельцев.Количество()=0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Файл раскрытия списка не сформирован - список владельцев не заполнен!");
		Возврат;
	КонецЕсли;	
	// Определим пространство имен
	ПространствоИмен = "PARTAD";
	// Объявим объект для записи XML
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	// Подготовим запросы по информации клиента
	ЗапросКодНДЦЮрЛица			= ПодготовитьЗапросДляКодаЗагрузкиНДЦЮрЛица(ПараметрКоманды);
	ЗапросСпискаEmail			= ПодготовитьЗапросДляСпискаEmailКлиента(ПараметрКоманды);
	ЗапросСпискаТелефонов		= ПодготовитьЗапросДляСпискаТелефоновКлиента(ПараметрКоманды);
	ЗапросСпискаКодовЗагрузкиЦБ	= Документы.РаскрытиеСпискаВладельцев.ЗапросДляСпискаКодовЗагрузкиЦБ(ПараметрКоманды.Дата);
	//************************************************************************************
	// REGISTER_OF_SHAREHOLDERS
	//************************************************************************************
	REGISTER_OF_SHAREHOLDERS_Тип	= ФабрикаXDTO.Пакеты.Получить(ПространствоИмен).КорневыеСвойства.Получить(
		"REGISTER_OF_SHAREHOLDERS").Тип;
	REGISTER_OF_SHAREHOLDERS		= ФабрикаXDTO.Создать(REGISTER_OF_SHAREHOLDERS_Тип);
	//************************************************************************************
	// Заполним реквизиты базового типа REGISTER_OF_SHAREHOLDERS (version / header)	
	//************************************************************************************
	REGISTER_OF_SHAREHOLDERS_База_Тип	= ФабрикаXDTO.Тип(ПространствоИмен, "answer_doc_t");
	REGISTER_OF_SHAREHOLDERS_База		= ФабрикаXDTO.Создать(REGISTER_OF_SHAREHOLDERS_База_Тип);
	// version
	REGISTER_OF_SHAREHOLDERS_База.version	= "3";
	// header
	REGISTER_OF_SHAREHOLDERS_База_header	= ФабрикаXDTO.Создать(REGISTER_OF_SHAREHOLDERS_База_Тип.Свойства.Получить("header").Тип);
	// header - doc_num
	REGISTER_OF_SHAREHOLDERS_База_header.doc_num	= ОбщегоНазначенияКлиентСервер.Транслит(СокрЛП(ПараметрКоманды.Номер));
	// header - doc_date
	header_doc_date	= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИмен, "date_or_datetime_t"));
	header_doc_date.date	= ПараметрКоманды.Дата;
	
	REGISTER_OF_SHAREHOLDERS_База_header.doc_date	= header_doc_date;
	// header - link
	header_link	= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИмен, "doc_link_t"));
	// Исходящий номер и дата документа
	header_link.out_doc_num = ?(ЗначениеЗаполнено(ПараметрКоманды.ВходящийДокументНомер),
		СокрЛП(ПараметрКоманды.ВходящийДокументНомер), "NONREF");	
	header_link_out_doc_date = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИмен, "date_or_datetime_t"));
	header_link_out_doc_date.date = ?(ЗначениеЗаполнено(ПараметрКоманды.ВходящийДокументДата),
		ПараметрКоманды.ВходящийДокументДата, Дата(1900,1,1));
	header_link.out_doc_date = header_link_out_doc_date;
	// Входящий номер и дата документа
	header_link.in_doc_num = "UKWN";
	// заполним ссылку на документ
	REGISTER_OF_SHAREHOLDERS_База_header.link = header_link;
	
	REGISTER_OF_SHAREHOLDERS.header = REGISTER_OF_SHAREHOLDERS_База_header;
	//************************************************************************************
	// Реквизиты базового типа зполнены, заполняем остальные реквизиты по определению типа
	//************************************************************************************
	// issuer (тип XDTO: party_id_name_t)
	//************************************************************************************
	ПараметрыТега_ISSUER = Новый Соответствие;
	ПараметрыТега_ISSUER.Вставить("party_id_name", СокрЛП(ПараметрКоманды.Эмитент.ЮридическиеФизическиеЛица.Наименование));
	
	Список_ISSUER_ID = Новый СписокЗначений;
	
	ЗапросКодНДЦЮрЛица.УстановитьПараметр("Владелец", ПараметрКоманды.Эмитент.ЮридическиеФизическиеЛица);
	СписокКодовНДЦ	= ЗапросКодНДЦЮрЛица.Выполнить().Выгрузить();	
	Для Каждого СтрокаКодовНДЦ ИЗ СписокКодовНДЦ Цикл
		ПараметрыТега_ISSUER_ID	= Новый Соответствие;
		ПараметрыТега_ISSUER_ID.Вставить("id", СокрЛП(СтрокаКодовНДЦ.Код));
		Список_ISSUER_ID.Добавить(ПараметрыТега_ISSUER_ID);
	КонецЦикла;
	
	ПараметрыТега_ISSUER.Вставить("id_t", Список_ISSUER_ID);
	
	REGISTER_OF_SHAREHOLDERS.issuer.Добавить(РаскрытиеСпискаВладельцев.Partad_СформироватьТег_party_id_name_t(
		ПространствоИмен, ПараметрыТега_ISSUER));
	//************************************************************************************
	// account_dtls (тип XDTO: account_dtls_t)
	//************************************************************************************
	ПараметрыТега_account_dtls = Новый Соответствие;
	
	ПараметрыТега_account_dtls_ID = Новый Соответствие;
	ПараметрыТега_account_dtls_ID.Вставить("id", СокрЛП(ПараметрКоманды.СчетДЕПО.Код));
	
	ПараметрыТега_account_dtls.Вставить("id_t", ПараметрыТега_account_dtls_ID);
	
	REGISTER_OF_SHAREHOLDERS.account_dtls = РаскрытиеСпискаВладельцев.Partad_СформироватьТег_account_dtls_t(
		ПространствоИмен, ПараметрыТега_account_dtls);
	//************************************************************************************
	// account_holder (тип XDTO: party_dtls_t)
	//************************************************************************************
	ПараметрыТега_account_holder = Новый Соответствие;
	
	ПараметрыТега_account_holder_ID = Новый Соответствие;
	ПараметрыТега_account_holder_ID.Вставить("id", "MC0292900000");
	
	ПараметрыТега_account_holder.Вставить("id_t", ПараметрыТега_account_holder_ID);
	
	REGISTER_OF_SHAREHOLDERS.account_holder	= РаскрытиеСпискаВладельцев.Partad_СформироватьТег_party_dtls_t(
		ПространствоИмен, ПараметрыТега_account_holder);
	//************************************************************************************
	// corporate_action_code - Вид корпоративного действия/события
	//************************************************************************************
	REGISTER_OF_SHAREHOLDERS.corporate_action_code	= СокрЛП(ПараметрКоманды.ВидКорпоративногоДействия.Код);
	//************************************************************************************
	// corporate_action_reference - Ссылка на корп действие - текст
	//************************************************************************************
	Если ЗначениеЗаполнено(ПараметрКоманды.КДРеференс) Тогда
		REGISTER_OF_SHAREHOLDERS.corporate_action_reference_NDC	=
			Документы.РаскрытиеСпискаВладельцев.КДРеференсБезСуффикса(ПараметрКоманды.КДРеференс);
	КонецЕсли;
	//************************************************************************************
	// record_date - Дата, на окончание операционного дня, которой составлены данные
	//************************************************************************************
	REGISTER_OF_SHAREHOLDERS.record_date = ?(ЗначениеЗаполнено(ПараметрКоманды.ДатаФиксации),
		ПараметрКоманды.ДатаФиксации, ПараметрКоманды.Дата);
	//************************************************************************************
	// message_function - Назначение предоставляемой информации
	// NEWM - Первиный список;
	// AMND - Дораскрытие;
	//************************************************************************************
	REGISTER_OF_SHAREHOLDERS.message_function = ?(ПараметрКоманды.Дораскрытие, "AMND", "NEWM");
	//************************************************************************************
	// information_indicator - Тип предоставляемой информации (тип списка)
	//************************************************************************************
	REGISTER_OF_SHAREHOLDERS.information_indicator = СокрЛП(ПараметрКоманды.ТипСписка.Код);
	//************************************************************************************
	// doc_link - Связанные ссылки (сообщения)
	//************************************************************************************
	Если ПараметрКоманды.Дораскрытие Тогда
		ПараметрыТега_doc_link	= Новый Соответствие;
		
		ВходящийДокументДата = ?(ПараметрКоманды.Дораскрытие,
			ПараметрКоманды.ДораскрытиеДокумент.ВходящийДокументДата, ПараметрКоманды.ВходящийДокументДата);
		ВходящийДокументНомер = ?(ПараметрКоманды.Дораскрытие,
			ПараметрКоманды.ДораскрытиеДокумент.ВходящийДокументНомер, ПараметрКоманды.ВходящийДокументНомер);
		
		Если Не ЗначениеЗаполнено(ВходящийДокументДата) Тогда
			ВходящийДокументДата = Дата(1900,1,1,0,0,0);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВходящийДокументНомер) Тогда
			ВходящийДокументНомер = "UKWN";
		КонецЕсли;
		
		ПараметрыТега_doc_link_in_reg_date	= Новый Соответствие;
		ПараметрыТега_doc_link_in_reg_date.Вставить("date"	, ВходящийДокументДата);
		
		ПараметрыТега_doc_link.Вставить("in_reg_date"	, ПараметрыТега_doc_link_in_reg_date);
		ПараметрыТега_doc_link.Вставить("in_doc_num"	, ВходящийДокументНомер);
		
		ДораскрытиеДата = ?(ЗначениеЗаполнено(ПараметрКоманды.ДораскрытиеДокумент.Дата),
			ПараметрКоманды.ДораскрытиеДокумент.Дата, Дата(1900,1,1,0,0,0));
		ДораскрытиеНомер = ОбщегоНазначенияКлиентСервер.Транслит(
			?(ЗначениеЗаполнено(ПараметрКоманды.ДораскрытиеДокумент.Номер),
				ПараметрКоманды.ДораскрытиеДокумент.Номер, "NONREF"));
		
		ПараметрыТега_doc_link_out_doc_date	= Новый Соответствие;
		ПараметрыТега_doc_link_out_doc_date.Вставить("date"	, ДораскрытиеДата);
		
		ПараметрыТега_doc_link.Вставить("out_doc_num"	, ДораскрытиеНомер);
		ПараметрыТега_doc_link.Вставить("out_doc_date"	, ПараметрыТега_doc_link_out_doc_date);
		
		REGISTER_OF_SHAREHOLDERS.doc_link = РаскрытиеСпискаВладельцев.Partad_СформироватьТег_doc_link_t(
			ПространствоИмен, ПараметрыТега_doc_link);
	КонецЕсли;
	//************************************************************************************
	// register_list - Список информации о владельцах ЦБ
	//************************************************************************************
	register_list_Тип	= REGISTER_OF_SHAREHOLDERS_Тип.Свойства.Получить("register_list").Тип;
	register_list		= ФабрикаXDTO.Создать(register_list_Тип);
	// Параметр register_list_category
	register_list.register_list_category	= "ADD";
	// Заполним список информации о владельцах
	ДанныеСпискаВладельцев = ПолучитьДанныеСпискаВладельцев(ПараметрКоманды.Ссылка);
	ВыборкаКлиенты = ДанныеСпискаВладельцев.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаКлиенты.Следующий() Цикл
		ВыборкаСубклиенты = ВыборкаКлиенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаСубклиенты.Следующий() Цикл
			ВыборкаДоговор = ВыборкаСубклиенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			Пока ВыборкаДоговор.Следующий() Цикл
				Клиент = ВыборкаДоговор.Клиент;
				Если Клиент.Субброкер Тогда
					Если НЕ ЗначениеЗаполнено(ВыборкаСубклиенты.Субклиент) Тогда
						ОбщегоНазначения.СообщитьОбОшибке("Файл раскрытия списка не сформирован - "
							+ "не указан выгодоприобретатель (субклиент)!");
						Возврат;
					КонецЕсли;	
					ЮрФизЛицо = ВыборкаСубклиенты.Субклиент.ЮридическиеФизическиеЛица;
					ТипЛица = ВыборкаСубклиенты.Субклиент.ЮрФизЛицо;
				Иначе
					ЮрФизЛицо = Клиент.ЮридическиеФизическиеЛица;
					ТипЛица = Клиент.ЮрФизЛицо;
				КонецЕсли;
			
				//************************************************************************************
				// shareholder - Блок информации о владельце ЦБ
				//************************************************************************************
				shareholder_Тип	= register_list_Тип.Свойства.Получить("shareholder").Тип;
				shareholder		= ФабрикаXDTO.Создать(shareholder_Тип);
				// shareholder - shareholder_id
				ПараметрыТега__shareholder_id = Новый Соответствие;
			
				Если Клиент.Субброкер Тогда
					КодКлиента = СокрЛП(ВыборкаДоговор.Договор.Код) + ВыборкаСубклиенты.Субклиент.Код;
				Иначе
					КодКлиента = СокрЛП(Клиент.Код);
				КонецЕсли;
				ПараметрыТега__shareholder_id.Вставить("id", КодКлиента);			
			
				shareholder.shareholder_id	= РаскрытиеСпискаВладельцев.Partad_СформироватьТег_Id_t(ПространствоИмен,
					ПараметрыТега__shareholder_id);
				// shareholder - account_dtls
				ПараметрыТега_account_dtls = Новый Соответствие;
				ПараметрыТега_account_dtls.Вставить("id_t", ПараметрыТега__shareholder_id);
			
				ВыборкаТипСчетаДепо	= ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
				Пока ВыборкаТипСчетаДепо.Следующий() Цикл
					ПараметрыТега_account_dtls.Вставить("account_type", КодТипаСчетаДЕПО(ВыборкаТипСчетаДепо.ТипСчетаДепо));
					Если НЕ ЗначениеЗаполнено(ПараметрыТега_account_dtls["account_type"]) Тогда
						ОбщегоНазначения.СообщитьОбОшибке("Файл раскрытия списка не сформирован - "
							+ "не указан код типа счета депо!");
						Возврат;
					КонецЕсли;	
		        
					shareholder.account_dtls = РаскрытиеСпискаВладельцев.Partad_СформироватьТег_account_dtls_t(
						ПространствоИмен, ПараметрыТега_account_dtls);
					// shareholder - shareholder_info
				    shareholder_info_Тип= shareholder_Тип.Свойства.Получить("shareholder_info").Тип;
					shareholder_info	= ФабрикаXDTO.Создать(shareholder_info_Тип);
			        // inn
					Если ЗначениеЗаполнено(ЮрФизЛицо.ИНН) Тогда
						shareholder_info.inn = ЮрФизЛицо.ИНН;
					КонецЕсли;
					
					Если ТипЛица = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
						// birthday
						Если ЗначениеЗаполнено(ЮрФизЛицо.ДатаРождения) Тогда
							shareholder_info.birthday = Формат(ЮрФизЛицо.ДатаРождения, "ДФ=yyyy-MM-dd");
						КонецЕсли;
						// ssn
						Если ЗначениеЗаполнено(ЮрФизЛицо.СтраховойНомерПФР) Тогда
							СтраховойНомерПФР		= СокрЛП(ЮрФизЛицо.СтраховойНомерПФР);
							СтраховойНомерПФР		= СтрЗаменить(СтраховойНомерПФР, " ", "");	// Удалить пробелы
							СтраховойНомерПФР		= СтрЗаменить(СтраховойНомерПФР, "-", "");	// Удалить дефисы
							shareholder_info.ssn	= СтраховойНомерПФР;
						КонецЕсли;
						// nationality
						ИнформацияОГражданстве	= РегистрыСведений.ГражданствоФизЛиц.СрезПоследних(,
							Новый Структура("ФизЛицо", ЮрФизЛицо));
						Если ИнформацияОГражданстве.Количество()>0 Тогда
							Гражданство	= СокрЛП(ИнформацияОГражданстве[0].Страна.КодАльфа2);
							Если ЗначениеЗаполнено(Гражданство) Тогда
								shareholder_info.nationality = Гражданство;
							КонецЕсли;
						КонецЕсли;
					Иначе
						// kpp
						Если ЗначениеЗаполнено(ЮрФизЛицо.КПП) Тогда
							shareholder_info.kpp = СокрЛП(ЮрФизЛицо.КПП);
						КонецЕсли;
						// okpo
						Если ЗначениеЗаполнено(ЮрФизЛицо.КодПоОКПО) Тогда
							shareholder_info.okpo = СокрЛП(ЮрФизЛицо.КодПоОКПО);
						КонецЕсли;	
						// okved
						Если ЗначениеЗаполнено(ЮрФизЛицо.КодПоОКВЭД) Тогда
							shareholder_info.okved = СокрЛП(ЮрФизЛицо.КодПоОКВЭД);
						КонецЕсли;
						// manager_info
						ФИОРуководителя = ФИО(Клиент.Руководитель.Фамилия, Клиент.Руководитель.Имя, Клиент.Руководитель.Отчество);
						Если ЗначениеЗаполнено(ФИОРуководителя) Тогда
							shareholder_info.manager_info = ФИОРуководителя;
						КонецЕсли;
					КонецЕсли;
					// shareholder - shareholder_info - postal_name
					Контакты = Документы.РаскрытиеСпискаВладельцев.Контакты(Клиент, ЮрФизЛицо, ТипЛица);
					ПараметрыТега_address_t = Новый Соответствие;
					Если ЗначениеЗаполнено(Контакты.Страна) Тогда
						Если Контакты.АдресНеРФ Тогда
							Адрес = Контакты.ПредставлениеАдреса;
						Иначе
							Если ЗначениеЗаполнено(Контакты.Индекс) Тогда
								Адрес = СокрЛП(СтрЗаменить(Контакты.ПредставлениеАдреса, Контакты.Индекс+",", ""));
							Иначе
								Адрес = Контакты.ПредставлениеАдреса;
							КонецЕсли;
						КонецЕсли;
						Если ЗначениеЗаполнено(Адрес) Тогда
							postal_name_тип	= shareholder_info_Тип.Свойства.Получить("postal_name").Тип;
							postal_name		= ФабрикаXDTO.Создать(postal_name_тип);
							postal_name.name= СокрЛП(ЮрФизЛицо.Наименование);
							
							ПараметрыТега_address_partad_t = Новый Соответствие;
							ПараметрыТега_address_partad_t.Вставить("country", СокрЛП(Контакты.Страна.КодАльфа2));
							ПараметрыТега_address_partad_t.Вставить("address", Адрес);
							Если ЗначениеЗаполнено(Контакты.Индекс) Тогда
								ПараметрыТега_address_partad_t.Вставить("index", Контакты.Индекс);
							КонецЕсли;
							
							ПараметрыТега_address_t.Вставить("partad", ПараметрыТега_address_partad_t);
							// address
							postal_name.address	= РаскрытиеСпискаВладельцев.Partad_СформироватьТег_address_t(
								ПространствоИмен, ПараметрыТега_address_t);
							
							shareholder_info.postal_name = postal_name;
						КонецЕсли;	
					КонецЕсли;
					// shareholder - shareholder_info - shareholder_dtls
					ПараметрыТега_shareholder_dtls_id = Новый СписокЗначений;
					
					ПараметрыТега_shareholder_dtls_id_Элемент = Новый Соответствие;
					ПараметрыТега_shareholder_dtls_id_Элемент.Вставить("id", КодКлиента);
					
					ПараметрыТега_shareholder_dtls_id.Добавить(ПараметрыТега_shareholder_dtls_id_Элемент);
					
					ПараметрыТега_shareholder_dtls_id_Элемент = Новый Соответствие;
					Если Клиент.Субброкер Тогда
						Если НЕ ЗначениеЗаполнено(Клиент.LEI) Тогда
							ВызватьИсключение "Для субброкера '" + Клиент + "' не указан код LEI!";
						КонецЕсли;						
						ПараметрыТега_shareholder_dtls_id_Элемент.Вставить("id",	Клиент.LEI);
					Иначе 
						ПараметрыТега_shareholder_dtls_id_Элемент.Вставить("id",	КодLEI);
					КонецЕсли;
					ПараметрыТега_shareholder_dtls_id_Элемент.Вставить("issuer","LEI");
					
					ПараметрыТега_shareholder_dtls_id.Добавить(ПараметрыТега_shareholder_dtls_id_Элемент);
					
					ПараметрыТега_shareholder_dtls = Новый Соответствие;
					Если ТипЛица = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
						ПолноеНаименованиеКлиента = ЮрФизЛицо.Наименование;
					Иначе
						ПолноеНаименованиеКлиента = ?(ЗначениеЗаполнено(ЮрФизЛицо.ПолноеНаименование),
							ЮрФизЛицо.ПолноеНаименование, ЮрФизЛицо.Наименование);
					КонецЕсли;
					
					ПараметрыТега_shareholder_dtls.Вставить("id_t", ПараметрыТега_shareholder_dtls_id);
					ПараметрыТега_shareholder_dtls.Вставить("name", СокрЛП(ПолноеНаименованиеКлиента));
					
					Если ТипЛица = Перечисления.ЮрФизЛицо.ЮрЛицо
						И ЮрФизЛицо.Страна = Справочники.КлассификаторСтранМира.РОССИЯ Тогда
						
						ОГРН = ?(ЗначениеЗаполнено(ЮрФизЛицо.ОГРН), ЮрФизЛицо.ОГРН, Клиент.ОГРН);
						ПараметрыТега_shareholder_dtls.Вставить("ogrn", СокрЛП(ОГРН));
					КонецЕсли;
					
					Если ПараметрыТега_address_t.Количество() > 0 тогда
						ПараметрыТега_shareholder_dtls.Вставить("address_t", ПараметрыТега_address_t);
					КонецЕсли;
					
					ПараметрыТега_shareholder_dtls.Вставить("individual_or_entity",
						?(ТипЛица = Перечисления.ЮрФизЛицо.ФизЛицо, "INDV", "LEGL"));
					
					Если ТипЛица = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
						//individual_document
						ПараметрыТега_individual_document = Новый Соответствие;
						
						ДанныеУдостоверения	= РегистрыСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(,
							Новый Структура("ФизЛицо", ЮрФизЛицо));
						
						Если ДанныеУдостоверения.Количество() > 0 Тогда
							doc_type	= СокрЛП(ДанныеУдостоверения[0].ДокументВид.КодИМНС);
							
							doc_ser		= СокрЛП(ДанныеУдостоверения[0].ДокументСерия);
							doc_num		= СокрЛП(ДанныеУдостоверения[0].ДокументНомер);
							doc_date	= ДанныеУдостоверения[0].ДокументДатаВыдачи;
							org			= СокрЛП(ДанныеУдостоверения[0].ДокументКемВыдан);
							Если ЗначениеЗаполнено(doc_type) Тогда
								ПараметрыТега_doc_type	= Новый Соответствие;
								ПараметрыТега_doc_type.Вставить("individual_document_type_code", doc_type);
								
								ПараметрыТега_individual_document.Вставить("doc_type", ПараметрыТега_doc_type); 
								Если ЗначениеЗаполнено(doc_ser) Тогда
									ПараметрыТега_individual_document.Вставить("doc_ser", doc_ser); 
								КонецЕсли;
								Если ЗначениеЗаполнено(doc_num) Тогда
									ПараметрыТега_individual_document.Вставить("doc_num", doc_num); 
								КонецЕсли;
								Если ЗначениеЗаполнено(doc_date) Тогда
									ПараметрыТега_individual_document.Вставить("doc_date", doc_date); 
								КонецЕсли;
								Если ЗначениеЗаполнено(org) Тогда
									ПараметрыТега_individual_document.Вставить("org", org); 
								КонецЕсли;
								
								ПараметрыТега_shareholder_dtls.Вставить("individual_document",
									ПараметрыТега_individual_document); 
							КонецЕсли;
						КонецЕсли;
					Иначе
						// entity_reg_dtls	
						ПараметрыТега_reg_doc_type = Новый Соответствие;
						ПараметрыТега_reg_doc_type.Вставить("entity_reg_doc_type_code",
							?(ЮрФизЛицо.НеРезидент, "INCR", "OGRN"));
						
						ПараметрыТега_entity_reg_dtls = Новый Соответствие;
						Если ЗначениеЗаполнено(ЮрФизЛицо.РегНомер) ИЛИ ЗначениеЗаполнено(ЮрФизЛицо.ОГРН) Тогда
							ПараметрыТега_entity_reg_dtls.Вставить("reg_num",
								?(ЗначениеЗаполнено(ЮрФизЛицо.ОГРН), ЮрФизЛицо.ОГРН, ЮрФизЛицо.РегНомер));
						КонецЕсли;
						Если ЗначениеЗаполнено(ЮрФизЛицо.ДатаГосРегистрации) Тогда
							ПараметрыТега_entity_reg_dtls.Вставить("date_of_incorporation",
								ЮрФизЛицо.ДатаГосРегистрации);
						КонецЕсли;
						Если ЗначениеЗаполнено(ЮрФизЛицо.РегистрирующийОрган) Тогда
							ПараметрыТега_entity_reg_dtls.Вставить("reg_org", ЮрФизЛицо.РегистрирующийОрган);
						КонецЕсли;
						Если ПараметрыТега_entity_reg_dtls.Количество() > 0 Тогда
							ПараметрыТега_entity_reg_dtls.Вставить("reg_doc_type",		ПараметрыТега_reg_doc_type);
							ПараметрыТега_shareholder_dtls.Вставить("entity_reg_dtls",	ПараметрыТега_entity_reg_dtls); 
						КонецЕсли;
					КонецЕсли;
					
					shareholder_info.shareholder_dtls = РаскрытиеСпискаВладельцев.Partad_СформироватьТег_party_dtls_t(
						ПространствоИмен, ПараметрыТега_shareholder_dtls);
					
					shareholder.shareholder_info		= shareholder_info;
					// shareholder - shareholder_contacts
					ПараметрыТега_shareholder_contacts	= Новый Соответствие;
					СписокEmail							= Новый СписокЗначений;
					СписокПараметровТелефонов			= Новый СписокЗначений;				
					// обработаем почтовые адреса
					ДобавитьАдресаЭлПочты(СписокEmail, ЗапросСпискаEmail, Клиент);
					ДобавитьАдресаЭлПочты(СписокEmail, ЗапросСпискаEmail, ЮрФизЛицо);
					Если СписокEmail.Количество() > 0 Тогда
						ПараметрыТега_shareholder_contacts.Вставить("e_mail", СписокEmail);
					КонецЕсли;
					// обработаем телефонные номера
					ДобавитьПараметрыТелефонов(СписокПараметровТелефонов, ЗапросСпискаТелефонов, Клиент);
					ДобавитьПараметрыТелефонов(СписокПараметровТелефонов, ЗапросСпискаТелефонов, ЮрФизЛицо);					
					Если СписокПараметровТелефонов.Количество()>0 Тогда
						ПараметрыТега_shareholder_contacts.Вставить("phone_t", СписокПараметровТелефонов);
					КонецЕсли;
					
					Если ПараметрыТега_shareholder_contacts.Количество()>0 Тогда
						shareholder.shareholder_contacts = РаскрытиеСпискаВладельцев.Partad_СформироватьТег_party_contacts_t(
							ПространствоИмен, ПараметрыТега_shareholder_contacts);
					КонецЕсли;
					// shareholder - payment_from_nominee
					shareholder.payment_from_nominee	= "Yes";
					// shareholder - tax_category
					ПараметрыТега_tax_category	= Новый Соответствие;
					ПараметрыТега_tax_category.Вставить("tax_status_code"		, ?(Клиент.Резидент, 2, 1));
					ПараметрыТега_tax_category.Вставить("tax_exempt_indicator"	, "No");
					
					shareholder.tax_category = РаскрытиеСпискаВладельцев.Partad_СформироватьТег_tax_category_t(
						ПространствоИмен, ПараметрыТега_tax_category);
					// shareholder - security_balances
					ВыборкаЦБ = ВыборкаТипСчетаДепо.Выбрать();
					Пока ВыборкаЦБ.Следующий() Цикл
						security_balances = ФабрикаXDTO.Создать(shareholder_Тип.Свойства.Получить("security_balances").Тип);
						КоличествоЦБ = ВыборкаЦБ.Количество;
						//ВыборкаДоговор
						Параметры_security			= Новый Соответствие;
						Параметры_security_balance	= Новый Соответствие;
						// заполним параметры security
						Если ЗначениеЗаполнено(ВыборкаЦБ.ЦеннаяБумага.НомерРегистрации) Тогда
							Параметры_security.Вставить("state_reg_num", СокрЛП(ВыборкаЦБ.ЦеннаяБумага.НомерРегистрации));
						КонецЕсли;
						Если ЗначениеЗаполнено(ВыборкаЦБ.ЦеннаяБумага.ISIN) Тогда
							Параметры_security.Вставить("ISIN_identifier", СокрЛП(ВыборкаЦБ.ЦеннаяБумага.ISIN));
						КонецЕсли;
						
						ЗапросСпискаКодовЗагрузкиЦБ.УстановитьПараметр("Владелец", ВыборкаЦБ.ЦеннаяБумага);
						СписокКодовЗагрузкиЦБ = ЗапросСпискаКодовЗагрузкиЦБ.Выполнить().Выгрузить();
						Если СписокКодовЗагрузкиЦБ.Количество() > 0 Тогда
							Параметры_proprietary_security_code	= Новый Соответствие;
							
							Параметры_proprietary_security_code.Вставить("id"		, СокрЛП(СписокКодовЗагрузкиЦБ[0].Код));
							Параметры_proprietary_security_code.Вставить("issuer"	, "NADC");
							
							Параметры_security.Вставить("proprietary_security_code", Параметры_proprietary_security_code);
						КонецЕсли;
						
						Параметры_security_balance.Вставить("security", Параметры_security);
						// заполним параметры total
						Параметры_total	= Новый Соответствие;
						Параметры_total.Вставить("units", КоличествоЦБ);
						Параметры_security_balance.Вставить("total", Параметры_total);
						
						security_balances.security_balance.Добавить(РаскрытиеСпискаВладельцев.Partad_СформироватьТег_security_balance_t(ПространствоИмен, Параметры_security_balance));
						shareholder.security_balances.Добавить(security_balances);
					КонецЦикла;
					
					// shareholder - bank_prop_rub
					Параметры_bank_prop_rub		= Новый Соответствие;
					Параметры_cash_rub_dtls		= Новый Соответствие;
					Параметры_account			= Новый Соответствие;
					Параметры_bank_corr			= Новый Соответствие;
					
					Параметры_account.Вставить("id", СокрЛП(ПараметрКоманды.БанковскийСчет.НомерСчета));
					Параметры_bank_corr.Вставить("id", СокрЛП(ПараметрКоманды.БанковскийСчет.Банк.КоррСчет));
					
					Параметры_cash_rub_dtls.Вставить("account"	, Параметры_account);
					Параметры_cash_rub_dtls.Вставить("bank_name", СокрЛП(ПараметрКоманды.БанковскийСчет.Банк.Наименование));
					Параметры_cash_rub_dtls.Вставить("bank_city", СокрЛП(ПараметрКоманды.БанковскийСчет.Банк.Город));
					Параметры_cash_rub_dtls.Вставить("ruic"		, СокрЛП(ПараметрКоманды.БанковскийСчет.Банк.Код));
					Параметры_cash_rub_dtls.Вставить("bank_corr", Параметры_bank_corr);
					
					Параметры_bank_prop_rub.Вставить("pay_name"		, СокрЛП(ПараметрКоманды.Организация.Наименование));
					Параметры_bank_prop_rub.Вставить("inn"			, СокрЛП(ПараметрКоманды.Организация.ИНН));
					Параметры_bank_prop_rub.Вставить("cash_rub_dtls", Параметры_cash_rub_dtls);
					
					shareholder.bank_prop_rub = РаскрытиеСпискаВладельцев.Partad_СформироватьТег_bank_prop_rub_t(ПространствоИмен, Параметры_bank_prop_rub);
					// Параметр shareholder заполнен, добавим его в реквизит
					register_list.shareholder.Добавить(shareholder);
				КонецЦикла; // ТипСчетаДепо
			КонецЦикла; // Договор
		КонецЦикла; // Субклиенты
	КонецЦикла; // Клиенты
	
	// Параметр register_list заполнен, добавим его в реквизит
	REGISTER_OF_SHAREHOLDERS.register_list.Добавить(register_list);
	// </REGISTER_OF_SHAREHOLDERS> 
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, REGISTER_OF_SHAREHOLDERS, "REGISTER_OF_SHAREHOLDERS");
	СтрокаXML = ЗаписьXML.Закрыть();
	
	СтрокаXML = СтрЗаменить(СтрокаXML,
		"<REGISTER_OF_SHAREHOLDERS xmlns=""PARTAD"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"">",
		"<REGISTER_OF_SHAREHOLDERS>");

	ТекстXML = Новый ТекстовыйДокумент;
	ТекстXML.ДобавитьСтроку(СтрокаXML);
	
	НеобходимоЗафиксироватьВыгрузкуЭтапа = Ложь;
	Попытка
		ПапкаДанных	= СокрЛП(ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(
			ПланыВидовХарактеристик.ВнешниеИсточники.КаталогВыгрузкиРаскрытияСпискаВладельцевPartad).Папка);
		ТекстXML.Записать(ПапкаДанных+"\"+ПараметрКоманды.Номер+"_"+Формат(ТекущаяДата(), "ДФ=ddMMyyyy")+".xml");
		НеобходимоЗафиксироватьВыгрузкуЭтапа = Истина;
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(
			"Не удалось записать файл!
			|
			|Возможно указанный в настройках каталог 'Каталог ПАРТАД' недоступен или путь некорректен!");
	КонецПопытки;
	
	Если НеобходимоЗафиксироватьВыгрузкуЭтапа Тогда
		Документы.РаскрытиеСпискаВладельцев.ЗарегистрироватьЭтапКД(ПараметрКоманды, REGISTER_OF_SHAREHOLDERS_База_header.doc_num);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПодготовитьЗапросДляКодаЗагрузкиНДЦЮрЛица(ПараметрКоманды)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Код
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	НЕ ПометкаУдаления
	|	И Биржа = &Биржа
	|	И Владелец = &Владелец
	|	И 
	|		(
	|		НАЧАЛОПЕРИОДА(ДатаОкончанияДействия, ДЕНЬ) = НАЧАЛОПЕРИОДА(ДАТАВРЕМЯ(1,1,1), ДЕНЬ)
	|		ИЛИ
	|		НАЧАЛОПЕРИОДА(ДатаОкончанияДействия, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|		ИЛИ
	|		НАЧАЛОПЕРИОДА(ДатаОкончанияДействия, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаФиксации, ДЕНЬ)
	|		)");

	Запрос.УстановитьПараметр("Биржа"			, Справочники.КлассификаторыЗагрузки.НДЦ());
	Запрос.УстановитьПараметр("Дата"			, ПараметрКоманды.Дата);
	Запрос.УстановитьПараметр("ДатаФиксации"	, ПараметрКоманды.ДатаФиксации);
	
	Возврат Запрос;
КонецФункции

&НаСервере
Функция ПодготовитьЗапросДляСпискаEmailКлиента(ПараметрКоманды)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Представление,
	|	Объект
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних
	|ГДЕ
	|	Тип = &Тип
	|	И
	|	Объект = &Объект");

	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	Возврат Запрос;
КонецФункции

&НаСервере
Функция ПодготовитьЗапросДляСпискаТелефоновКлиента(ПараметрКоманды)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(Вид) 	КАК Вид,
	|	Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних
	|ГДЕ
	|	Тип = &Тип
	|	И
	|	Объект = &Объект");

	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);

	Возврат Запрос;
КонецФункции

&НаСервере
Функция ПолучитьДанныеСпискаВладельцев(Документ)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РСВ.Клиент КАК Клиент,
	|	ВЫБОР
	|		КОГДА РСВ.Клиент.Субброкер
	|			ТОГДА РСВ.Выгодоприобретатель
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субклиент,
	|	РСВ.Договор КАК Договор,
	|	РСВ.СчетДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	РСВ.ЦеннаяБумага КАК ЦеннаяБумага,
	|	РСВ.Количество КАК Количество
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев.СписокВладельцев КАК РСВ
	|ГДЕ
	|	РСВ.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Клиент,
	|	Субклиент,
	|	Договор,
	|	ТипСчетаДепо");

	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	Возврат Запрос.Выполнить();
КонецФункции

&НаСервере
Функция КодТипаСчетаДЕПО(ТипСчетаДепо)
	
	Возврат Справочники.СчетаДепо.КодТипаСчетаДЕПО(ТипСчетаДепо);
	
КонецФункции

&НаСервере
Функция ФИО(Фамилия, Имя, Отчество)
	ФИО	= СокрЛП(Фамилия);
	ФИО	= СокрЛП(ФИО) + ?(ЗначениеЗаполнено(ФИО), " ", "") + СокрЛП(Имя);
	ФИО	= СокрЛП(ФИО) + ?(ЗначениеЗаполнено(ФИО), " ", "") + СокрЛП(Отчество);
	Возврат СокрЛП(ФИО);
КонецФункции

&НаСервере
Процедура ДобавитьАдресаЭлПочты(СписокEmail, ЗапросСпискаEmail, Клиент)
	ЗапросСпискаEmail.УстановитьПараметр("Объект", Клиент);
	EmailКлиента = ЗапросСпискаEmail.Выполнить().Выгрузить();
	Для Каждого СтрокаEmail ИЗ EmailКлиента Цикл
		email = СокрЛП(СтрокаEmail.Представление);
		Если ЗначениеЗаполнено(email) И СписокEmail.НайтиПоЗначению(email) = Неопределено Тогда
			СписокEmail.Добавить(email);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьПараметрыТелефонов(СписокПараметровТелефонов, ЗапросСпискаТелефонов, Клиент)
	ТипыТелефонов = Новый Соответствие;
	ТипыТелефонов.Вставить("ФАКС",	"FAXI");
	ТипыТелефонов.Вставить("МОБ",	"MOBI");
	ТипыТелефонов.Вставить("РАБ",	"BIZZ");
	ТипыТелефонов.Вставить("ДОМ",	"HOME");
	
	ЗапросСпискаТелефонов.УстановитьПараметр("Объект", Клиент);
	ТелефоныКлиента	= ЗапросСпискаТелефонов.Выполнить().Выгрузить();
	Для Каждого СтрокаТелефон Из ТелефоныКлиента Цикл
		Телефон			= СокрЛП(СтрокаТелефон.Представление);
		ВидТелефона		= ВРег(СтрокаТелефон.Вид);
		ТелефонПроверка	= СокрЛП(СтрЗаменить(Телефон, "(", ""));
		ТелефонПроверка	= СокрЛП(СтрЗаменить(ТелефонПроверка, ")", ""));
		Если ЗначениеЗаполнено(ТелефонПроверка) Тогда
			ПараметрыТелефона = Новый Соответствие;
			ПараметрыТелефона.Вставить("phone_num", Телефон);
			
			Для Каждого Элемент Из ТипыТелефонов Цикл
				Если Найти(ВидТелефона, Элемент.Ключ) > 0 Тогда
					ПараметрыТелефона.Вставить("phone_type", Элемент.Значение);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ПараметрыТелефона["phone_type"] = Неопределено Тогда
				ПараметрыТелефона.Вставить("phone_type", ТипыТелефонов["РАБ"]);
			КонецЕсли;
			
			СписокПараметровТелефонов.Добавить(ПараметрыТелефона);
		КонецЕсли;			
	КонецЦикла;
КонецПроцедуры

//**************************************************************************************************
// РАБОТА С XLS ВЫГРУЗКОЙ ПАРТАД
//**************************************************************************************************

&НаСервере
Процедура ВыгрузитьСписокСерверPARTADДепонентыССубклиентамиXLS(ДокументСсылка)
	// Контроль заполненности документа
	ТекстСообщенияОбОшибке = "";
	
	Если Не ДокументСсылка.Проведен Тогда
		ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Не проведен документ." + Символы.ПС;
	КонецЕсли;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	ПодготовитьВТ_СубклиентыСОтборомПоПериоду(ДокументСсылка, МВТ);
	
	Если КоличествоДепонентовССубклиентами(ДокументСсылка.СписокВладельцев.ВыгрузитьКолонку("Клиент"), МВТ) = 0 Тогда
		ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "В табличной части нет депонентов с субклиентами." + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщенияОбОшибке) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Файл раскрытия списка по субклиентам не сформирован:" + Символы.ПС
			+ ТекстСообщенияОбОшибке);
		Возврат;
	КонецЕсли; 
	
	ТаблицаXLS = Новый ТабличныйДокумент;
	Макет = ДокументСсылка.ПолучитьОбъект().ПолучитьМакет("РаскрытиеСпискаПоСубклиентам");
	
	// Вывод шапки
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ТаблицаXLS.Вывести(ОбластьМакета);
	
	// Вывод табличной части
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	CODE_SEC_Разделитель = Символы.ПС;
	ТаблицаПолей = ПоляВыгрузкиДепонентовССубклиентами(ДокументСсылка, МВТ, CODE_SEC_Разделитель);
	Для каждого Строка Из ТаблицаПолей Цикл
		ОбластьМакета.Параметры.Заполнить(Строка);
		ТаблицаXLS.Вывести(ОбластьМакета);
	КонецЦикла;
	
	Попытка
		ПапкаДанных	= СокрЛП(ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(
			ПланыВидовХарактеристик.ВнешниеИсточники.КаталогВыгрузкиРаскрытияСпискаВладельцевССубклиентамиPartadXLS).Папка);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(
		"Файл раскрытия списка по субклиентам не сформирован.
		|В плане видов характеристик ""Внешние источники"" у ""Выгрузка РСВ с субклиентами (Partad) XLS"" тип должен быть ""Папка"".
		|В регистре сведений ""Внешние источники"" для него необходимо указать папку выгрузки.");
		Возврат;							
	КонецПопытки;
	
	ИмяФайла = ПапкаДанных+"\"+ДокументСсылка.Номер+"_"+Формат(ТекущаяДата(), "ДФ=ddMMyyyy")+".xls";
	Попытка
		ТаблицаXLS.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(
		"Файл раскрытия списка по субклиентам не сформирован.
		|Не удалось записать файл " + ИмяФайла + Символы.ПС	+ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция CODE_SEC_СКодамиЗагрузки(Поля, CODE_SEC_Разделитель)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КлассификаторЗагрузки", Справочники.КлассификаторыЗагрузки.НДЦ());
	Запрос.УстановитьПараметр("ЦеннаяБумага", Поля.ЦеннаяБумага);
	Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КодыЗагрузки.Код КАК КодЗагрузки
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	КодыЗагрузки.Владелец = &ЦеннаяБумага
	|	И КодыЗагрузки.Биржа = &КлассификаторЗагрузки
	|	И КодыЗагрузки.ДатаОкончанияДействия = &ПустаяДата";
	Выборка = Запрос.Выполнить().Выбрать();
	КодыЗагрузки = "";
	КодыЗагрузки = КодыЗагрузки + ?(КодыЗагрузки <> "", CODE_SEC_Разделитель, "") + СокрЛП(Поля.ISIN);
	КодыЗагрузки = КодыЗагрузки + ?(КодыЗагрузки <> "", CODE_SEC_Разделитель, "") + СокрЛП(Поля.НомерРегистрации);
	Пока Выборка.Следующий() Цикл
		КодыЗагрузки = КодыЗагрузки + ?(КодыЗагрузки <> "", CODE_SEC_Разделитель, "") + СокрЛП(Выборка.КодЗагрузки);
	КонецЦикла;
    Возврат КодыЗагрузки;
КонецФункции
 
&НаСервере
Функция ПоляВыгрузкиДепонентовССубклиентами(ДокументСсылка, МВТ, CODE_SEC_Разделитель)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("РазделительСерииНомера", " ");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Субклиенты.Объект КАК Объект,
	|	ЕСТЬNULL(ЮридическиеЛица.ПолноеНаименование, Субклиенты.Клиент.Наименование) КАК BENEF_NAME,
	|	ВЫБОР
	|		КОГДА Субклиенты.Клиент ССЫЛКА Справочник.ЮридическиеЛица
	|				И НЕ Субклиенты.Клиент.НеРезидент
	|			ТОГДА ""OGRN""
	|		КОГДА Субклиенты.Клиент ССЫЛКА Справочник.ЮридическиеЛица
	|				И Субклиенты.Клиент.НеРезидент
	|			ТОГДА ""INCR""
	|		КОГДА Субклиенты.Клиент ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид.КодНРД
	|	КОНЕЦ КАК DOCTYPE,
	|	ВЫБОР
	|		КОГДА Субклиенты.Клиент ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА Субклиенты.Клиент.ОГРН
	|		КОГДА Субклиенты.Клиент ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия + &РазделительСерииНомера + ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер
	|	КОНЕЦ КАК DOCNUM,
	|	ВЫБОР
	|		КОГДА Субклиенты.Клиент ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА Субклиенты.Клиент.ДатаГосРегистрации
	|		КОГДА Субклиенты.Клиент ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи
	|	КОНЕЦ КАК DOCDATE
	|ПОМЕСТИТЬ ВТ_Субклиенты
	|ИЗ
	|	ВТ_СубклиентыСОтборомПоПериоду КАК Субклиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО (ЮридическиеЛица.Ссылка = Субклиенты.Клиент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО (ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо = Субклиенты.Клиент)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субклиенты.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокВладельцев.ЦеннаяБумага.Ссылка КАК ЦеннаяБумага,
	|	СписокВладельцев.ЦеннаяБумага.ISIN КАК ISIN,
	|	СписокВладельцев.ЦеннаяБумага.НомерРегистрации КАК НомерРегистрации,
	|	СписокВладельцев.ЦеннаяБумага.Эмитент.ЮридическиеФизическиеЛица.Наименование КАК NAME_ISSUER,
	|	СписокВладельцев.Ссылка.ДатаФиксации КАК RECDATE,
	|	СписокВладельцев.Ссылка.Организация.LEI КАК LEI_DEP,
	|	СписокВладельцев.Клиент.Код КАК OWNER_ID,
	|	ЕСТЬNULL(ЮридическиеЛица.ПолноеНаименование, СписокВладельцев.Клиент.ЮридическиеФизическиеЛица.Наименование) КАК OWNER_NAME,
	|	1 КАК BENEF_TYPE,
	|	ВТ_Субклиенты.BENEF_NAME КАК BENEF_NAME,
	|	ВТ_Субклиенты.DOCTYPE КАК DOCTYPE,
	|	ВТ_Субклиенты.DOCNUM КАК DOCNUM,
	|	ВТ_Субклиенты.DOCDATE КАК DOCDATE,
	|	"""" КАК ADDRESS,
	|	СписокВладельцев.Количество КАК QTY,
	|	"""" КАК QTY_NOM,
	|	"""" КАК QTY_DENOM
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев.СписокВладельцев КАК СписокВладельцев
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Субклиенты КАК ВТ_Субклиенты
	|		ПО (ВТ_Субклиенты.Объект = СписокВладельцев.Клиент.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО (ЮридическиеЛица.Ссылка = СписокВладельцев.Клиент.ЮридическиеФизическиеЛица)
	|ГДЕ
	|	СписокВладельцев.Ссылка = &ДокументСсылка
	|";
    ТаблицаПолей = Запрос.Выполнить().Выгрузить();
	ТаблицаПолей.Колонки.Добавить("CODE_SEC");
	Для каждого Строка Из ТаблицаПолей Цикл
		Строка.CODE_SEC = CODE_SEC_СКодамиЗагрузки(Строка, CODE_SEC_Разделитель);
	КонецЦикла;
	Возврат ТаблицаПолей;
КонецФункции

&НаСервере
Функция КоличествоДепонентовССубклиентами(МассивКонтрагентов, МВТ)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВложенныйЗапрос.Контрагент) КАК КоличествоДепонентовССубклиентами
	|ИЗ
	|	(ВЫБРАТЬ
	|		Контрагенты.Ссылка КАК Контрагент,
	|		СУММА(ВЫБОР
	|				КОГДА Субклиенты.Клиент ЕСТЬ NULL 
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ) КАК КоличествоСубклиентов
	|	ИЗ
	|		Справочник.Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СубклиентыСОтборомПоПериоду КАК Субклиенты
	|			ПО (Субклиенты.Объект = Контрагенты.Ссылка)
	|	ГДЕ
	|		Контрагенты.Ссылка В(&МассивКонтрагентов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Контрагенты.Ссылка) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.КоличествоСубклиентов > 0";
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоДепонентовССубклиентами
	Иначе
		Возврат 0;
	КонецЕсли; 
КонецФункции

&НаСервере
Процедура ПодготовитьВТ_СубклиентыСОтборомПоПериоду(ДокументРаскрытия, МВТ)
	// Получить дату фиксации
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", ДокументРаскрытия);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РаскрытиеСпискаВладельцев.ДатаФиксации
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|ГДЕ
	|	РаскрытиеСпискаВладельцев.Ссылка = &Документ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаФиксации = Выборка.ДатаФиксации
	Иначе
		Возврат;
	КонецЕсли; 
	
	// Получить ВТ_СубклиентыСОтборомПоПериоду
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("ДатаФиксации", ДатаФиксации);
	Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Субклиенты.Объект КАК Объект,
	|	Субклиенты.Клиент КАК Клиент
	|ПОМЕСТИТЬ ВТ_СубклиентыСОтборомПоПериоду
	|ИЗ
	|	РегистрСведений.Субклиенты КАК Субклиенты
	|ГДЕ
	|	Субклиенты.ДатаОбслуживанияНачало <= &ДатаФиксации
	|	И Субклиенты.ДатаОбслуживанияКонец >= &ДатаФиксации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Субклиенты.Объект,
	|	Субклиенты.Клиент
	|ИЗ
	|	РегистрСведений.Субклиенты КАК Субклиенты
	|ГДЕ
	|	Субклиенты.ДатаОбслуживанияНачало <= &ДатаФиксации
	|	И Субклиенты.ДатаОбслуживанияКонец = &ПустаяДата
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субклиенты.Объект";
    Запрос.Выполнить();
КонецПроцедуры


