
#Область ПрограммныйИнтерфейс

Функция ТипРазделаСчетаДляKafka(ТипРазделаСчетаДЕПО) Экспорт
	
	СоответствиеТипов = Новый Соответствие;
	СоответствиеТипов.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.Основной						, "Basic");
	СоответствиеТипов.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.Обеспечения					, "Ensuring");
	СоответствиеТипов.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.ОбеспеченияДержатель			, "Ensuring");
	СоответствиеТипов.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.Торговый						, "Trade");
	СоответствиеТипов.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоКД				, "BlockedCA");
	СоответствиеТипов.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоРасчеты			, "BlockedCalc");
	СоответствиеТипов.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоПоАресту			, "BlockedArrest");
	СоответствиеТипов.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоЗапретОпераций	, "ProhibitOperations");
	СоответствиеТипов.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоОбособленный		, "BlockedIsolated");
	СоответствиеТипов.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоВЗалоге			, "Collateral");
	СоответствиеТипов.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.Налоговый					, "Tax");
	СоответствиеТипов.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.ДляРаспределения				, "Distribution");
	СоответствиеТипов.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.НИФИ							, "?");
	
	Возврат СоответствиеТипов[ТипРазделаСчетаДЕПО];
	
КонецФункции

// Определяет, является ли переданный тип раздела, блокированным
//
// Параметры:
//  ТипРаздела	 - ПеречислениеСсылка.ТипыРазделовСчетовДЕПО - Тип раздела
// 
// Возвращаемое значение:
//  Булево - признак того, что переданный тип раздела является блокированным
//
Функция ЭтоБлокировочныйТипРазделаСчетаДепо(ТипРаздела) Экспорт
	
	Возврат ТипРаздела = БлокированоКД Или ТипРаздела = БлокированоВЗалоге Или ТипРаздела = БлокированоЗапретОпераций
		Или ТипРаздела = БлокированоОбособленный Или ТипРаздела = БлокированоПоАресту Или ТипРаздела = БлокированоРасчеты
		Или ТипРаздела = БлокированоИное;
	
КонецФункции

#КонецОбласти

