
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДополнительнаяОбработкаСсылка", ДопОбработка);
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Версия = ТекОбъект.СведенияОВнешнейОбработке().Версия;
	Заголовок = Заголовок + "v."+Версия;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокИндексовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Индексы"));
	
	ДопустимыйТип = Новый ОписаниеТипов(МассивТипов);
	Объект.СписокИндексов.ТипЗначения = ДопустимыйТип;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапроскСервису(Команда)
	
	Отказ = Ложь;
	
	ЗапросКСервисуНаСервере(Отказ);
	
	Если Отказ Тогда
		Сообщить("Во время загрузки произошли ошибки", СтатусСообщения.Важное);
	Иначе
		Сообщить("Чтение успешно завершено", СтатусСообщения.Информация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Лог = ЗагрузитьНаСервере();
	Лог.Лог.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДанныеИндекса(Команда)
	
	Отбор = Новый Структура("Комментарий", "WEB-SERVICE VTB");
	П = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.ДанныеИндекса.ФормаСписка",П);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоставыИндексов(Команда)
	УстановитьСоставыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ДопОбработка", ДопОбработка);
	ОткрытьФорму("ВнешняяОбработка.внЗагрузкаИндексов.Форма.ФормаНастроек", ДопПараметры, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ЗапросКСервисуНаСервере(Отказ)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Объект.СписокИндексов.Количество() = 0 Тогда
		ТекОбъект.ЗаполнитьСписокИндексов();
	КонецЕсли;
	
	ТекОбъект.ЗагрузитьОбъекты(Отказ,,Объект.СписокИндексов);
	
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
функция ЗагрузитьНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
    ТекОбъект.СоздатьДанныеИндексов();
	
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
	Возврат Объект;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьСоставы(Команда)
	Отбор = Новый Структура("Комментарий", "WEB-SERVICE VTB");
	П = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Документ.УстановкаСоставаИндекса.ФормаСписка",П);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСоставыНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.СоздатьСоставыИндексов();
	
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	ЭтаФорма.Элементы.ФормаИспользоватьTIBCO.Пометка = (Объект.СервисИсточник = 1);
	ЭтаФорма.Элементы.ФормаИспользоватьMICROAPI.Пометка = (Объект.СервисИсточник = 0);
КонецПроцедуры // УправлениеФормой()

&НаКлиенте
Процедура ИспользоватьTIBCO(Команда)
	Объект.СервисИсточник = 1;
	
	УправлениеФормой();
КонецПроцедуры // ИспользоватьTIBCO()

&НаКлиенте
Процедура ИспользоватьMICROAPI(Команда)
	Объект.СервисИсточник = 0;
	
	УправлениеФормой();
КонецПроцедуры // ИспользоватьMICROAPI()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры // ПриОткрытии()

#КонецОбласти