//////////////////////////////////////////////////////////////////////////////////
//// Подсистема "Базовая функциональность".
////  
//////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////
//// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Заполняет переименования тех объектов метаданных, которые невозможно
// автоматически найти по типу, но ссылки на которые требуется сохранять
// в базе данных (например: подсистемы, роли).
//
// Подробнее: см. ОбщегоНазначения.ДобавитьПереименование().
//
Процедура ЗаполнитьТаблицуПереименованияОбъектовМетаданных(Итог) Экспорт
	
	// _Демо начало примера
	//_ДемоСтандартныеПодсистемы.ПриДобавленииПереименованийОбъектовМетаданных(Итог);
	// _Демо конец примера
	
КонецПроцедуры

// Устарела. Будет удалена в следующей редакции. См. ПриОпределенииОбщихПараметровБазовойФункциональности.
Процедура ИмяФормыПерсональныхНастроек(ИмяФормы) Экспорт
	
	
	
КонецПроцедуры

// Устарела. Будет удалена в следующей редакции. См. ПриОпределенииОбщихПараметровБазовойФункциональности.
Процедура ПолучитьМинимальноНеобходимуюВерсиюПлатформы(ПараметрыПроверки) Экспорт
	
КонецПроцедуры

// Позволяет настроить общие параметры базовой функциональности.
//
// Параметры:
//  ОбщиеПараметры (Структура) Набор параметров базовой функциональности:
//    Ранее определялись в ОбщегоНазначенияПереопределяемый.ИмяФормыПерсональныхНастроек():
//      |- ИмяФормыПерсональныхНастроек (Строка) Имя формы для редактирования персональных настроек.
//    Ранее определялись в ОбщегоНазначенияПереопределяемый.ПолучитьМинимальноНеобходимуюВерсиюПлатформы():
//      |- МинимальноНеобходимаяВерсияПлатформы (Строка) Номер версии платформы для запуска программы.
//      |- РаботаВПрограммеЗапрещена (Булево) Начальное значение Ложь.
//    Не имеют аналогов в переопределяемых модулях:
//      |- ЗапрашиватьПодтверждениеПриЗавершенииПрограммы (Булево) Определяет значение по умолчанию для флажка
//         "Больше не задавать этот вопрос" диалога "Завершить работу с программой?".
//         Значение по умолчанию Истина.
//         Если установить Ложь, то пользователь не увидит диалог, пока явно не включит его отображение через свои настройки.
//      |- ОтключитьСправочникИдентификаторыОбъектовМетаданных (Булево) - отключает заполнение справочника
//         ИдентификаторыОбъектовМетаданных, процедуры выгрузки и загрузки элементов справочника в узлах РИБ.
//         Востребовано при частичном встраивании БСП в конфигурации на платформе 8.1
//
Процедура ПриОпределенииОбщихПараметровБазовойФункциональности(ОбщиеПараметры) Экспорт
	
	// _Демо начало примера
	//_ДемоСтандартныеПодсистемы.ПриОпределенииОбщихПараметровБазовойФункциональности(ОбщиеПараметры);
	// _Демо конец примера
	
КонецПроцедуры

// BSLLS:CognitiveComplexity-off

// Массив структур в таблицу значений.
// 
// Параметры:
//  МассивСтруктур - Массив Из Структура:
//   * Поля - Произвольный - поля соответствуют колонкам таблицы.
//  ПереименованияКолонок - Соответствие Из КлючИЗначение:
//   * Ключ - Строка
//   * Значение - см. ОписаниеКолонки
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Поля - Произвольный - набор колонок, соответствует полям структур массива.
Функция МассивСтруктурВТаблицуЗначений(МассивСтруктур, ПереименованияКолонок = Неопределено) Экспорт

	Результат = Новый ТаблицаЗначений;
	Для Каждого Структура Из МассивСтруктур Цикл
		Для Каждого КлючЗначение Из Структура Цикл
			ТипКолонки = Неопределено;
			Если ПереименованияКолонок <> Неопределено Тогда
				ЗначениеПереименования = ПереименованияКолонок.Получить(КлючЗначение.Ключ);
				Если ЗначениеЗаполнено(ЗначениеПереименования) И ТипЗнч(ЗначениеПереименования) = Тип("Структура") Тогда
					ТипКолонки = ЗначениеПереименования.Тип;
				КонецЕсли;
				Если Результат.Колонки.Найти(КлючЗначение.Ключ) = Неопределено Тогда
					Результат.Колонки.Добавить(КлючЗначение.Ключ, ТипКолонки);
				КонецЕсли;
			КонецЕсли;
			Если ТипКолонки <> Неопределено Тогда
				Структура[КлючЗначение.Ключ] = ЗначениеПоТипу(ТипКолонки, КлючЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), Структура);
	КонецЦикла;

	Если ПереименованияКолонок <> Неопределено Тогда
		Для Каждого Элемент Из ПереименованияКолонок Цикл
			Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда
				ИмяКолонки = Элемент.Значение;
				ТипКолонки = Неопределено;
			Иначе
				ИмяКолонки = Элемент.Значение.Имя;
				ТипКолонки = Элемент.Значение.Тип;
			КонецЕсли;
			Если Результат.Колонки.Найти(Элемент.Ключ) <> Неопределено Тогда
				Колонка = Результат.Колонки[Элемент.Ключ]; // КолонкаТаблицыЗначений
				Колонка.Имя = ИмяКолонки;
			Иначе
				Результат.Колонки.Добавить(ИмяКолонки, ТипКолонки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// BSLLS:CognitiveComplexity-on

// Таблица значений в массив структур.
// 
// Параметры:
//  ТаблицаЗначений - ТаблицаЗначений:
//   * Поля - Произвольный - произвольный набор полей.
// ПереименованияСвойств - Соответствие из КлючИЗначение:
//   * Ключ - Строка
//   * Значение - см. ОписаниеКолонки
// 
// Возвращаемое значение:
//  Массив Из Структура:
//   * Поля - Произвольный - поля соответствуют колонкам таблицы.
Функция ТаблицаЗначенийВМассивСтруктур(ТаблицаЗначений, ПереименованияСвойств) Экспорт
	
	Результат = Новый Массив;
	Для Каждого Строка Из ТаблицаЗначений Цикл
		Элемент = Новый Структура;
		Для Каждого КлючЗначение Из ПереименованияСвойств Цикл
			Значение = Строка[КлючЗначение.Значение.Имя];
			Если КлючЗначение.Значение.Тип.СодержитТип(Тип("УникальныйИдентификатор")) Тогда
				Значение = Строка(Значение);
			КонецЕсли; 
			Элемент.Вставить(КлючЗначение.Ключ, Значение);
		КонецЦикла; 
		Результат.Добавить(Элемент);
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

// Процедура - Сортировать массив структур
//
// Параметры:
//  МассивСтруктур			 - Массив	 - Массив структур к сортировке
//  НаправлениеСортировки	 - Строка	 - Направление сортировки "УБЫВ" или "ВОЗР"
//  ПолеСортировки			 - Строка	 - Имя реквизита структуры, по которому произвести сортировку
//
Процедура СортироватьМассивСтруктур(МассивСтруктур, НаправлениеСортировки, ПолеСортировки = "Код") Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ПолеСортировки");
	Таблица.Колонки.Добавить("Структура");
	
	Для Каждого Элемент Из МассивСтруктур Цикл
		СтрокаТЗ = Таблица.Добавить();
		СтрокаТЗ.ПолеСортировки = Элемент[ПолеСортировки];
		СтрокаТЗ.Структура = Элемент;
	КонецЦикла;
	
	Таблица.Сортировать("ПолеСортировки " + НаправлениеСортировки);
	
	МассивСтруктур = Таблица.ВыгрузитьКолонку("Структура");
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеПоТипу(ТипЗначения, Значение)
	
	Если ТипЗначения.СодержитТип(Тип("УникальныйИдентификатор")) Тогда
		Возврат Новый УникальныйИдентификатор(Значение);
	Иначе
		Возврат Значение;
	КонецЕсли;
	
КонецФункции

// Возвращает описание колонки таблицы переименования полей.
// 
// Параметры:
//	Имя - Строка - имя переименования.
//	Тип - ОписаниеТипов - тип значения.
//	
// Возвращаемое значение:
//	Структура:
//	 * Имя - Строка - имя переименования.
//	 * Тип - ОписаниеТипов - тип значения.
Функция ОписаниеКолонки(Имя, Тип) Экспорт

	Возврат Новый Структура("Имя, Тип", Имя, Тип);

КонецФункции

#КонецОбласти
