
Функция Печать(МассивОбъектов, ИспользоватьФаксимиле = Истина) Экспорт

	Если ТипЗнч(МассивОбъектов) = Тип("Массив") Тогда
		Возврат ПечатьДокумента(МассивОбъектов, ИспользоватьФаксимиле);
	Иначе
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(МассивОбъектов);
		Возврат ПечатьДокумента(МассивДокументов, ИспользоватьФаксимиле);
	КонецЕсли;
	
КонецФункции

Функция ПечатьДокумента(МассивДокументов, ИспользоватьФаксимиле = Истина) Экспорт
	
	РезультатПодготовкиЗапроса	= ПодготовитьЗапросСтандарт(МассивДокументов);
	РезультатЗапроса			= РезультатПодготовкиЗапроса[1];
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДепозитарий = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Организация = ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию();
	
	ВывестиРазделитель = Ложь;
	
	ОснованиеСПДПоБиржевымОперациям = "Регламент обслуживания на финансовых рынках " + СокрЛП(ПараметрыСеанса.Организация.Наименование);
	
	Пока ВыборкаДепозитарий.Следующий() Цикл
		
		ИмяМакета = "МакетРебрендинг";
		
		Макет = ПолучитьМакет(ИмяМакета);
		ОбластьЗаголовок   = Макет.ПолучитьОбласть("Шапка");
		ОбластьПодвал 	   = Макет.ПолучитьОбласть("Подвал");
		ОбластьЗаголовок.Параметры.ЗаголовокRU = "СВОДНОЕ ПОРУЧЕНИЕ ДЕПО (подается Представителем Депонента)";
		ОбластьЗаголовок.Параметры.ЗаголовокEN = "SUMMARY CUSTODY INSTRUCTION (submitted by client`s representative)";
		
		ВыборкаСчетДЕПО  = ВыборкаДепозитарий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСчетДЕПО.Следующий() Цикл
			ВыборкаДвижений = ВыборкаСчетДЕПО.Выбрать(ОбходРезультатаЗапроса.Прямой);
			
			Если ВывестиРазделитель Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ВывестиРазделитель = Истина;
			
			ВывестиЗаголовок(ВыборкаСчетДЕПО, ОбластьЗаголовок, Организация, ТабДок);
			ПодготовитьПодвал(ВыборкаДепозитарий, ВыборкаСчетДЕПО, ИспользоватьФаксимиле, ОбластьПодвал, Организация);
			ВывестиТаблицу(ВыборкаДвижений, Макет, ОснованиеСПДПоБиржевымОперациям, ТабДок, ОбластьПодвал);
			ВывестиПодвал(ВыборкаСчетДЕПО, ОбластьПодвал, ТабДок);
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Процедура ПодготовитьПодвал(ВыборкаДепозитарий, ВыборкаСчетДЕПО, ИспользоватьФаксимиле, ОбластьПодвал, Организация)
	
	СтруктураДанныхОтветственногоЛица = Новый Структура();
	ДолжностьОтвЛица = Справочники.ДолжностиОрганизаций.ГенеральныйДиректор;
	Ответственный = ПодписантСПД(Организация, ВыборкаДепозитарий.ДатаФормирования);
	Если Ответственный = Неопределено Тогда
		СтруктураДанныхОтветственногоЛица.Вставить("Должность", ДолжностьОтвЛица.Наименование);
		СтруктураДанныхОтветственногоЛица.Вставить("ФамилияИО", "");
	Иначе
		СтруктураДанныхОтветственногоЛица.Вставить("Должность", Ответственный.Должность);
		СтруктураДанныхОтветственногоЛица.Вставить("ФамилияИО",
			ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(Ответственный.ОтветственноеЛицо));
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, СтруктураДанныхОтветственногоЛица);
	
	Если Не ИспользоватьФаксимиле Тогда
		СкрытьРисунок(ОбластьПодвал.Рисунки.Подпись);
	Иначе
		УстановитьФаксимиле(ОбластьПодвал.Рисунки, ВыборкаСчетДЕПО.ДатаФормирования, Ответственный);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиПодвал(ВыборкаСчетДЕПО, ОбластьПодвал, ТабДок)
	
	ЗаполнитьПараметрыДатыПечатнойФормы(ОбластьПодвал.Параметры, "", ВыборкаСчетДЕПО.ДатаФормирования, Ложь);
	ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры

Процедура ВывестиТаблицу(Знач ВыборкаДвижений, Знач Макет, Знач ОснованиеСПДПоБиржевымОперациям, Знач ТабДок, ОбластьПодвал)
	
	НомерТекущейСтроки = 0;
	Пока ВыборкаДвижений.Следующий() Цикл
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		ЭтоПоследняяСтрока = НомерТекущейСтроки = ВыборкаДвижений.Количество();
		
		ОбластьТаблицы = Макет.ПолучитьОбласть("Тело");
		ОбластьТаблицы.Параметры.Заполнить(ВыборкаДвижений);
		ОбластьТаблицы.Параметры.DEPO = ПолучитьКодСчетаДепо(ВыборкаДвижений.СчетДепо);
		ОбластьТаблицы.Параметры.EXCHANGE = СокрЛП(ВыборкаДвижений.EXCHANGE);
		ОбластьТаблицы.Параметры.REASON = ОснованиеСПДПоБиржевымОперациям;
		
		Если ЭтоПоследняяСтрока Тогда
			ОбластиКПроверке = Новый Массив;
			ОбластиКПроверке.Добавить(ОбластьТаблицы);
			ОбластиКПроверке.Добавить(ОбластьПодвал);
			ФормированиеПечатныхФорм.ВывестиГоризонтальныйРазделитель(ТабДок, ОбластиКПроверке);
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиЗаголовок(ВыборкаСчетДЕПО, ОбластьЗаголовок, Организация, ТабДок)
	
	ОбластьЗаголовок.Параметры.Текст2 = ?(ЗначениеЗаполнено(Организация.НаименованиеПолное),
		СокрЛП(Организация.НаименованиеПолное), СокрЛП(Организация.Наименование));
	ЗаполнитьПараметрыДатыПечатнойФормы(ОбластьЗаголовок.Параметры, "", ВыборкаСчетДЕПО.ДатаФормирования);
	
	ОбластьЗаголовок.Параметры.НомерПоручения = ВыборкаСчетДЕПО.НомерСПД;
	
	ТабДок.Вывести(ОбластьЗаголовок);

КонецПроцедуры

Процедура ЗаполнитьПараметрыДатыПечатнойФормы(ПараметрыМакета, ИмяПараметра, Дата, ЕстьВремяВПараметрах = Истина)
	
	ФорматДаты = "ЧЦ=2; ЧН=; ЧВН=";
	ЧасыСтрокой 	= Формат(Час(Дата), ФорматДаты);
	МинутыСтрокой 	= Формат(Минута(Дата), ФорматДаты);
	ДеньСтрокой 	= Формат(День(Дата), ФорматДаты);
	ГодСтрокой 		= Прав(Формат(Год(Дата), "ЧЦ=4; ЧН=; ЧВН=; ЧГ=0"), 2);

	Если ЕстьВремяВПараметрах Тогда
		ПараметрыМакета.Время1 = Лев(ЧасыСтрокой, 1);
		ПараметрыМакета.Время2 = Прав(ЧасыСтрокой, 1);
		ПараметрыМакета.Время3 = Лев(МинутыСтрокой, 1);
		ПараметрыМакета.Время4 = Прав(МинутыСтрокой, 1);
	КонецЕсли;
	
	ПараметрыМакета[ИмяПараметра + "День1"] = Лев(ДеньСтрокой, 1);
	ПараметрыМакета[ИмяПараметра + "День2"] = Прав(ДеньСтрокой, 1);
	
	ПараметрыМакета[ИмяПараметра + "Месяц"] = СтрЗаменить(Формат(НачалоМесяца(Дата), "ДФ='дд ММММ'"), "01 ", "");
	
	ПараметрыМакета[ИмяПараметра + "Год1"] = Лев(ГодСтрокой, 1);
	ПараметрыМакета[ИмяПараметра + "Год2"] = Прав(ГодСтрокой, 1);

КонецПроцедуры

Функция ПолучитьКодСчетаДепо(СчетДепо) Экспорт
	Возврат СокрЛП(СчетДепо.Код);
КонецФункции

Процедура СкрытьРисунок(Знач Рисунок)
	Рисунок.Картинка = Новый Картинка;
	Рисунок.Высота = 0;
	Рисунок.Ширина = 0;
КонецПроцедуры

Процедура УстановитьФаксимиле(ОбластьРисунков, КонецПериода, ОтветственныеЛица)
	
	Если Не ОтветственныеЛица = Неопределено Тогда
		ФайлФаксимиле = СсылкаНаФайлПоТипу(ОтветственныеЛица.ОтветственноеЛицо, Перечисления.ДополнительныеПризнакиФайлов.Факсимилье);
		Если Не ФайлФаксимиле = Неопределено Тогда
			УстановитьКартинкуПоФайлу(ОбластьРисунков.Подпись.Картинка, ФайлФаксимиле);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Получает ссылку на первый элемент справочника Файлы (не помеченный на удаление) где хранится данный тип файла данного объекта
// Параметры:
//  ОбъектСсылка - Ссылка - объект, для которого получаем ссылку на файл
//  ТипФайла - ПеречислениеСсылка.ДополнительныеПризнакиФайлов - тип получаемого файла
// Возвращаемое значение:
//  СправочникСсылка.Файлы - элемент спр-ка Файлы
//
Функция СсылкаНаФайлПоТипу(ОбъектСсылка, ТипФайла) Экспорт
	// Находим факсимиле в справочнике файлов
	Запрос	= Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Файлы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	НЕ Файлы.ПометкаУдаления
	|	И Файлы.Объект = &Объект
	|	И Файлы.ДополнительныйПризнакФайла = &ТипФайла";
	Запрос.УстановитьПараметр("Объект", ОбъектСсылка);
	Запрос.УстановитьПараметр("ТипФайла", ТипФайла);
	
	Результат	= Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0].Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Устанавливает картинку из справочника файлы в поле картинки
// Параметры:
//  ПолеКартинки - Картинка - сюда установится картинка, если существует ее файл
//  СсылкаФайл - СправочникСсылка.Файлы - элемент спр-ка Файлы
Процедура УстановитьКартинкуПоФайлу(ПолеКартинки, СсылкаФайл) Экспорт
	Если ЗначениеЗаполнено(СсылкаФайл) Тогда
		ПолеКартинки = Новый Картинка(СсылкаФайл.Данные.Получить(), Истина);
	Иначе
		ПолеКартинки = Новый Картинка;
	КонецЕсли;
КонецПроцедуры

Функция ПодготовитьЗапросСтандарт(МассивДокументов)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СПД", МассивДокументов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	"""" КАК СчетДЕПОПолучателя,
	|	ТЧСоставПоручения.ВидОперацииД КАК ВидОперации,
	|	СводноеПоручение.СчетДЕПО КАК СчетДЕПО,
	|	СводноеПоручение.СчетДЕПО.Владелец КАК Депонент,
	|	ТЧСоставПоручения.СчетДЕПОМХ.Владелец КАК Депозитарий,
	|	ТЧСоставПоручения.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ТЧСоставПоручения.Количество КАК Количество,
	|	ТЧСоставПоручения.Сумма КАК Сумма,
	|	СводноеПоручение.Дата КАК ДатаФормирования,
	|	СводноеПоручение.Номер КАК НомерСПД,
	|	ТЧСоставПоручения.СчетДЕПОМХ КАК СчетДЕПОМХ,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Получатель,
	|	ТЧСоставПоручения.РазделСчетаДЕПОМХ КАК РазделСчетаДЕПОМХ,
	|	ТЧСоставПоручения.РазделСчетаДЕПО КАК РазделСчетаДЕПО
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	Документ.иц_СводноеПоручение КАК СводноеПоручение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.иц_СводноеПоручение.СоставПоручения КАК ТЧСоставПоручения
	|		ПО (ТЧСоставПоручения.Ссылка = СводноеПоручение.Ссылка)
	|ГДЕ
	|	СводноеПоручение.Ссылка В(&СПД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ИсходныеДанные.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Депонирование)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Порядок,
	|	ВЫБОР
	|		КОГДА ИсходныеДанные.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Депонирование)
	|			ТОГДА ""Зачисление""
	|		ИНАЧЕ ""Списание""
	|	КОНЕЦ КАК OPER_TYPE,
	|	ВЫБОР
	|		КОГДА ИсходныеДанные.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СнятиеСДепонирования)
	|			ТОГДА ""Зачисление""
	|		ИНАЧЕ ""Списание""
	|	КОНЕЦ КАК OPER_TYPE_Получатель,
	|	ПОДСТРОКА(ИсходныеДанные.СчетДЕПО.Наименование, 1, 10) КАК DEPOCODE,
	|	ИсходныеДанные.Получатель КАК Получатель,
	|	ИсходныеДанные.Депонент КАК Депонент,
	|	ИсходныеДанные.Депозитарий КАК Депозитарий,
	|	ИсходныеДанные.РазделСчетаДЕПО.Код КАК EXCHANGE,
	|	ИсходныеДанные.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ИсходныеДанные.ЦеннаяБумага.Эмитент КАК Эмитент,
	|	ИсходныеДанные.ЦеннаяБумага.НомерРегистрации КАК НомерРегистрации,
	|	ИсходныеДанные.ЦеннаяБумага.ISIN КАК ISIN,
	|	СУММА(ИсходныеДанные.Количество) КАК QUANTITY,
	|	СУММА(ИсходныеДанные.Сумма) КАК СуммаОборот,
	|	ИсходныеДанные.ДатаФормирования КАК ДатаФормирования,
	|	ИсходныеДанные.НомерСПД КАК НомерСПД,
	|	ИсходныеДанные.СчетДЕПОПолучателя КАК СчетДЕПОПолучателя,
	|	ИсходныеДанные.ВидОперации КАК ВидОперации,
	|	ИсходныеДанные.РазделСчетаДЕПОМХ КАК РазделСчетаДЕПОМХ,
	|	ИсходныеДанные.СчетДЕПО КАК СчетДЕПО,
	|	ИсходныеДанные.СчетДЕПОМХ.Владелец.Наименование КАК ВышестоящийДепозитарий
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ИсходныеДанные.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Депонирование)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныеДанные.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Депонирование)
	|			ТОГДА ""Зачисление""
	|		ИНАЧЕ ""Списание""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныеДанные.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СнятиеСДепонирования)
	|			ТОГДА ""Зачисление""
	|		ИНАЧЕ ""Списание""
	|	КОНЕЦ,
	|	ИсходныеДанные.СчетДЕПОМХ,
	|	ИсходныеДанные.СчетДЕПОПолучателя,
	|	ИсходныеДанные.Получатель,
	|	ИсходныеДанные.Депонент,
	|	ИсходныеДанные.Депозитарий,
	|	ИсходныеДанные.ЦеннаяБумага,
	|	ИсходныеДанные.ДатаФормирования,
	|	ИсходныеДанные.НомерСПД,
	|	ИсходныеДанные.ВидОперации,
	|	ИсходныеДанные.ЦеннаяБумага.Эмитент,
	|	ИсходныеДанные.ЦеннаяБумага.НомерРегистрации,
	|	ИсходныеДанные.ЦеннаяБумага.ISIN,
	|	ПОДСТРОКА(ИсходныеДанные.СчетДЕПО.Наименование, 1, 10),
	|	ИсходныеДанные.РазделСчетаДЕПОМХ,
	|	ИсходныеДанные.СчетДЕПО,
	|	ИсходныеДанные.СчетДЕПОМХ.Владелец.Наименование,
	|	ИсходныеДанные.РазделСчетаДЕПО.Код
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсходныеДанные.СчетДЕПОМХ.Наименование,
	|	Порядок,
	|	ИсходныеДанные.ЦеннаяБумага.Эмитент.Наименование
	|ИТОГИ
	|	МАКСИМУМ(ДатаФормирования),
	|	МАКСИМУМ(НомерСПД),
	|	МАКСИМУМ(СчетДЕПО)
	|ПО
	|	Депозитарий,
	|	DEPOCODE";
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

Функция ПодписантСПД(Организация, ДатаФормирования)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОтветственныеЛица.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ОтветственныеЛица.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ОтветственныеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОтветственныеЛица.Должность.Наименование КАК Должность
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|			&ДатаФормирования,
	|			СтруктурнаяЕдиница = &Организация
	|				И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ПодписантСПД)) КАК ОтветственныеЛица");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаФормирования", ДатаФормирования);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("ОтветственноеЛицо, Должность", Выборка.ФизическоеЛицо, Выборка.Должность);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции