
#Область ПрограммныйИнтерфейс

Функция ВладелецКИ(Форма) Экспорт
	Перем Результат;
	
	ИмяРеквизитаВладельца = Форма.ПараметрыКонтактнойИнформации.ИмяРеквизитаВладельца;
	
	ЗначениеКопирования = Неопределено;	
	Форма.Параметры.Свойство("ЗначениеКопирования", ЗначениеКопирования);
	
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеКопирования, ИмяРеквизитаВладельца);		
	Иначе
		Результат = Форма.Объект[ИмяРеквизитаВладельца];
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 