
&НаСервере
Перем мТекущийОбъектНаСервере;

&НаСервере
Функция ТекущийОбъект()
	
	Если мТекущийОбъектНаСервере = Неопределено Тогда
		мТекущийОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	КонецЕсли; 
	
	Возврат мТекущийОбъектНаСервере;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = Не ПравоДоступа("Администрирование", Метаданные);
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно прав доступа!");
	КонецЕсли;
	Отказ = Отказ Или ОпределитьЭтаИнформационнаяБазаФайловая();

	ТекущийОбъект().ПолучитьПараметрыБлокировки();
	ЗначениеВРеквизитФормы(ТекущийОбъект(), "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	Элементы.ГруппаКластерСерверов.Доступность = Объект.КластерТребуетАвторизации;
	Элементы.ГруппаПорты.Доступность = Объект.НестандартныеПорты;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура КластерТребуетАвторизацииПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура НестандартныеПортыПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ПроверитьПараметрыАдминистрированияИБНаСервере() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыАдминистрированияИБ = СформироватьПараметрыАдминистрированияИБНаСервере();
	УправлениеСоединениямиИБ.ЗаписатьПараметрыАдминистрированияИБ(ПараметрыАдминистрированияИБ);
	
	Закрыть();
	
КонецПроцедуры

Функция СформироватьПараметрыАдминистрированияИБНаСервере()
	
	Возврат ТекущийОбъект().СформироватьПараметрыАдминистрированияИБ();
	
КонецФункции

&НаСервере
Функция ПроверитьПараметрыАдминистрированияИБНаСервере()
	
	Возврат ТекущийОбъект().ПроверитьПараметрыАдминистрированияИБ();
	
КонецФункции