#Область ПрограммныйИнтерфейс

// Позволяет понять включен режим тетсирование или нет
// Возвращаемое значение:
//	Булево
Функция ЭтоТест() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ПараметрыСеанса.ЭтоТестированиеVanessa;
КонецФункции

// Включает режим тетсирования
Процедура ВключитьРежимТеста() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСеанса.ЭтоТестированиеVanessa = Истина;
КонецПроцедуры

// Отключает режим тетсирования
Процедура ВыключитьРежимТеста() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСеанса.ЭтоТестированиеVanessa = Ложь;
КонецПроцедуры

// Возвращает тестовые данные
// Параметры:
//	ИмяНабора - Строка
//	ЗначениеПоУмолчанию - Структура - или любой другой тип
// Возвращаемое значение:
//	 - Структура - или другой тип
Функция ТестовыеДанные(ИмяНабора, ЗначениеПоУмолчанию = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ВсеТестовыеДанныеСеанса = ПараметрыСеанса.ТестовыеДанныеVanessa;
	Если ТипЗнч(ВсеТестовыеДанныеСеанса) = Тип("ФиксированноеСоответствие")
		И ВсеТестовыеДанныеСеанса.Получить(ИмяНабора) <> Неопределено Тогда
		Возврат ВсеТестовыеДанныеСеанса.Получить(ИмяНабора);
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли; 
КонецФункции

// Добавлет поименованный набор тестовых данных в совокупность всех тестовых данных, используемых в текущем сеансе
// Параметры:
//	ИмяНабора - Строка
//	ТестовыеДанныеНабора - Структура - или любой другой тип
Процедура УстановитьТестовыеДанные(ИмяНабора, ТестовыеДанныеНабора) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущиеТестовыеДанныеСеанса = ПараметрыСеанса.ТестовыеДанныеVanessa;
	Если ТипЗнч(ТекущиеТестовыеДанныеСеанса) = Тип("ФиксированноеСоответствие") Тогда
		НовыеТестовыеДанныеСеанса = Новый Соответствие(ТекущиеТестовыеДанныеСеанса);
	Иначе
		НовыеТестовыеДанныеСеанса = Новый Соответствие;
	КонецЕсли;
	
	НовыеТестовыеДанныеСеанса[ИмяНабора] = ТестовыеДанныеНабора;
	ПараметрыСеанса.ТестовыеДанныеVanessa = Новый ФиксированноеСоответствие(НовыеТестовыеДанныеСеанса);
КонецПроцедуры

// Возвращает первое значение из очереди тестовых данных, если набор тестовых данных не является фиксированным
// массивом, возвращает значение по умолчанию.
// Параметры:
//	ИмяНабора - Строка
//	ЗначениеПоУмолчанию - Структура - или любой другой тип
// Возвращаемое значение:
//	 - Структура - или другой тип
Функция ВзятьЗначениеИзОчередиТестовыхДанных(ИмяНабора, ЗначениеПоУмолчанию = Неопределено) Экспорт
	ОчередьДанных = ТестовыеДанные(ИмяНабора);
	Если ТипЗнч(ОчередьДанных) = Тип("ФиксированныйМассив") И ОчередьДанных.Количество() > 0 Тогда
		ДанныеКВозврату = ОчередьДанных[0];
		ОчередьДанныхБезПервогоЗначения = Новый Массив(ОчередьДанных);
		ОчередьДанныхБезПервогоЗначения.Удалить(0);
		УстановитьТестовыеДанные(ИмяНабора, Новый ФиксированныйМассив(ОчередьДанныхБезПервогоЗначения));
		Возврат ДанныеКВозврату;
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли; 
КонецФункции

// Возвращает новое значение в конец очереди тестовых данных
// Параметры:
//	ИмяНабора - Строка
//	ДобавляемоеЗначение - Структура - или любой другой тип
Процедура ДобавитьЗначениеВОчередьТестовыхДанных(ИмяНабора, ДобавляемоеЗначение) Экспорт
	ОчередьДанных = ТестовыеДанные(ИмяНабора);
	Если ТипЗнч(ОчередьДанных) = Тип("ФиксированныйМассив") Тогда
		ОчередьДанныхСДобавленнымЗначением = Новый Массив(ОчередьДанных);
	Иначе
		ОчередьДанныхСДобавленнымЗначением = Новый Массив;
	КонецЕсли;
	
	ОчередьДанныхСДобавленнымЗначением.Добавить(ДобавляемоеЗначение);
	УстановитьТестовыеДанные(ИмяНабора, Новый ФиксированныйМассив(ОчередьДанныхСДобавленнымЗначением));
КонецПроцедуры

// Возвращает обработку TEST_ADO, имеющую идентичный интерфейс с обработкой АДО.
//
// Возвращаемое значение:
//   Обработка.TEST_ADO
//
Функция НовыйИмитаторАДО() Экспорт
	Возврат Обработки.TEST_ADO.Создать();
КонецФункции

// Возвращает параметры тестирования по умолчанию (режим тестирования выключен, нет тестовых данных),
// кроме случая запуска фонового задания - тогда проверяется наличие назначенных тестовых данных для
// этого ФЗ, в Хранилище общих настроек. 
// 
// Возвращаемое значение:
//   Структура - структура со значениями
//     * ЭтоТестированиеVanessa - Булево
//     * ТестовыеДанныеVanessa - ФиксированноеСоответствие
//
Функция ДействующиеПараметрыТестирования() Экспорт
	Параметры = Новый Структура;
	Параметры.Вставить("ЭтоТестированиеVanessa", Ложь);
	Параметры.Вставить("ТестовыеДанныеVanessa", Новый ФиксированноеСоответствие(Новый Соответствие));
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	Если ФоновоеЗадание <> Неопределено Тогда
		ПодстановочныеДанные = ПодстановочныеДанныеФоновыхЗаданий();
		Для Каждого Строка Из ПодстановочныеДанные Цикл
			ДанныеНеДляЭтогоЗадания = (ЗначениеЗаполнено(Строка.ОтборПоКлючу) И Строка.ОтборПоКлючу <> ФоновоеЗадание.Ключ)
										Или (ЗначениеЗаполнено(Строка.ОтборПоИмениМетода) И Строка.ОтборПоИмениМетода <> ФоновоеЗадание.ИмяМетода)
										Или (ЗначениеЗаполнено(Строка.ОтборПоНаименованию) И Строка.ОтборПоНаименованию <> ФоновоеЗадание.Наименование);
			Если ДанныеНеДляЭтогоЗадания Тогда
				Продолжить;
			КонецЕсли;
			Параметры.ЭтоТестированиеVanessa = Параметры.ЭтоТестированиеVanessa Или Строка.ЭтоТестированиеVanessa;
			ДополнитьФиксированноеСоответствие(Параметры.ТестовыеДанныеVanessa, Строка.ТестовыеДанныеVanessa);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Параметры;
КонецФункции

// Возвращает пустую таблицу подстановочных данных. Таблица используется для
// передачи тестовых данных в фоновые задания (ФЗ).
//
// Возвращаемое значение:
//	ТаблицаЗначений - с колонками
//     * ОтборПоКлючу - Строка - значение для фильтрации по ключу ФЗ (необязательное)
//     * ОтборПоИмениМетода - Строка - значение для фильтрации по имени метода ФЗ (необязательное)
//     * ОтборПоНаименованию - Строка - значение для фильтрации по наименованию ФЗ (необязательное)
//     * ЭтоТестированиеVanessa - Булево - признак для подстановки в параметр сеанса ФЗ
//     * ТестовыеДанныеVanessa - ФиксированноеСоответствие - тестовые данные для подстановки в параметр сеанса ФЗ
//
Функция НовыеПодстановочныеДанныеФоновыхЗаданий() Экспорт
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	
	ПодстановочныеДанные = Новый ТаблицаЗначений;
	ПодстановочныеДанные.Колонки.Добавить("ОтборПоКлючу", ОписаниеТипаСтрока);
	ПодстановочныеДанные.Колонки.Добавить("ОтборПоИмениМетода", ОписаниеТипаСтрока);
	ПодстановочныеДанные.Колонки.Добавить("ОтборПоНаименованию", ОписаниеТипаСтрока);
	ПодстановочныеДанные.Колонки.Добавить("ЭтоТестированиеVanessa", ОписаниеТипаБулево);
	ПодстановочныеДанные.Колонки.Добавить("ТестовыеДанныеVanessa");
	Возврат ПодстановочныеДанные;
КонецФункции

// Возвращает таблицу данных, настроенную для установки в фоновые задания через хранилище общих настроек.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица подстановочных данных, описание см. НовыеПодстановочныеДанныеФоновыхЗаданий()
//
Функция ПодстановочныеДанныеФоновыхЗаданий() Экспорт
	ПараметрыХранения = ПараметрыХраненияПодстановочныхДанных();
	ПодстановочныеДанные = ХранилищеОбщихНастроек.Загрузить(ПараметрыХранения.КлючОбъекта, ПараметрыХранения.КлючНастроек);
	Если ТипЗнч(ПодстановочныеДанные) = Тип("ТаблицаЗначений") Тогда
		Возврат ПодстановочныеДанные;
	Иначе
		Возврат НовыеПодстановочныеДанныеФоновыхЗаданий();
	КонецЕсли;
КонецФункции

// Устанавливает таблицу данных для установки в фоновые задания, помещая ее в хранилище общих настроек.
//
// Параметры:
//   ПодстановочныеДанные - ТаблицаЗначений - таблица с данными, описание см. НовыеПодстановочныеДанныеФоновыхЗаданий()
//
Процедура УстановитьПодстановочныеДанныеФоновыхЗаданий(ПодстановочныеДанные) Экспорт
	ПараметрыХранения = ПараметрыХраненияПодстановочныхДанных();
	ХранилищеОбщихНастроек.Сохранить(ПараметрыХранения.КлючОбъекта, ПараметрыХранения.КлючНастроек, ПодстановочныеДанные);
КонецПроцедуры

// Возвращает содержимое из хранилища значений, либо само переданное значение
//
// Параметры:
//   ЗначениеВХранилище - Произвольный, ХранилищеЗначения - полезное значение, возможно обернутое в ХЗ
//
// Возвращаемое значение:
//   Произвольный - значение, полученное из Хранилища значения, или само значение
//
Функция СодержимоеИзХранилищаЗначений(ЗначениеВХранилище) Экспорт
	Если ТипЗнч(ЗначениеВХранилище) = Тип("ХранилищеЗначения") Тогда
		Возврат ЗначениеВХранилище.Получить();
	Иначе
		Возврат ЗначениеВХранилище;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыХраненияПодстановочныхДанных()
	ПараметрыХранения = Новый Структура;
	ПараметрыХранения.Вставить("КлючОбъекта", "ТестированиеVanessa");
	ПараметрыХранения.Вставить("КлючНастроек", "ПараметрыХраненияПодстановочныхДанных");
	
	Возврат ПараметрыХранения;
КонецФункции

Процедура ДополнитьФиксированноеСоответствие(Приемник, Источник)
	Если Не ЗначениеЗаполнено(Источник) Тогда
		Возврат;
	КонецЕсли;
	ПриемникНефиксированный = Новый Соответствие(Приемник);
	Для Каждого ЭлементИсточника Из Источник Цикл
		ПриемникНефиксированный[ЭлементИсточника.Ключ] = ЭлементИсточника.Значение;
	КонецЦикла; 
	Приемник = Новый ФиксированноеСоответствие(ПриемникНефиксированный);
КонецПроцедуры

#КонецОбласти
