// Модуль формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.НачалоПериода = Дата("20250901");
	Объект.КонецПериода = Дата("20250902235959");
	Объект.ВидОперации = Перечисления.ВидыОперацийСделка.Поступление;
КонецПроцедуры


&НаСервере
Функция ПолучитьМакетНаСервере()
	Попытка
		ОтчетОбъект = РеквизитФормыВЗначение("Объект");
		Макет = ОтчетОбъект.ПолучитьМакет("Данные");
		
		
		Если Макет = Неопределено Тогда
			ВызватьИсключение "Макет не найден. Проверьте имя макета и его наличие в обработке.";
		КонецЕсли;
		
		Возврат Макет;
	Исключение
		Сообщить("Ошибка получения макета: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
КонецФункции


&НаСервере
Процедура СоздатьПриходыНаСервере()
	ДатаДок = Объект.НачалоПериода - 1;
	
	
	Попытка
		Макет = ПолучитьМакетНаСервере();
		Если Макет = Неопределено Тогда
			Сообщить("Не удалось получить макет!");
			Возврат;
		КонецЕсли;
		
		ТаблицаДанных = ЗагрузитьДанныеИзМакета(Макет);
		
		//ТаблицаДанных = Новый ТаблицаЗначений;
		//ТаблицаДанных.Колонки.Добавить("НомСтр", Новый ОписаниеТипов("Число"));
		//ТаблицаДанных.Колонки.Добавить("ПИФ", Новый ОписаниеТипов("Строка"));
		//ТаблицаДанных.Колонки.Добавить("РежимТоргов", Новый ОписаниеТипов("Строка"));
		//ТаблицаДанных.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("Строка"));
		//ТаблицаДанных.Колонки.Добавить("ФизическоеМестоХраненияДС", Новый ОписаниеТипов("Строка"));
		//ТаблицаДанных.Колонки.Добавить("ДоговорКонтрагента", Новый ОписаниеТипов("Строка"));
		//ТаблицаДанных.Колонки.Добавить("ВалютаДокумента", Новый ОписаниеТипов("Строка"));
		//ТаблицаДанных.Колонки.Добавить("Актив", Новый ОписаниеТипов("Строка"));
		//ТаблицаДанных.Колонки.Добавить("ВалютаЦБ", Новый ОписаниеТипов("Строка"));
		//ТаблицаДанных.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		//ТаблицаДанных.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
		//ТаблицаДанных.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
		// 
		Сообщить("=========================================");
		Для Каждого СтрДок Из ТаблицаДанных Цикл 
			Сообщить("[== " + СтрДок.НомСтр + " ==]");
			ПИФ = Справочники.ПИФ.НайтиПоНаименованию(СтрДок.ПИФ);
			Сообщить("ПИФ = " + ПИФ);
			
			РежимТоргов = Справочники.РежимыТоргов.НайтиПоНаименованию(СтрДок.РежимТоргов);
			Сообщить("РежимТоргов = " + РежимТоргов);
			
			Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(СтрДок.Контрагент);
			Если Не ЗначениеЗаполнено(Контрагент) Тогда
				Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("ООО СБ-Брокер");
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Контрагент) Тогда
				Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("ООО CБ-Брокер");
			КонецЕсли;
			Сообщить("Контрагент = " + Контрагент);
			
			ФизическоеМестоХраненияДС = Справочники.ТорговыеКоды.НайтиПоНаименованию(СтрДок.ФизическоеМестоХраненияДС);
			Сообщить("ФизическоеМестоХраненияДС = " + ФизическоеМестоХраненияДС);
			
			ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию(СтрДок.ДоговорКонтрагента,,,Контрагент);
			Сообщить("ДоговорКонтрагента = " + ДоговорКонтрагента);
			
			ВалютаДокумента = Справочники.Валюты.НайтиПоНаименованию(СтрДок.ВалютаДокумента);
			Сообщить("ВалютаДокумента = " + ВалютаДокумента);
			
			Актив = Справочники.Активы.НайтиПоНаименованию(СтрДок.Актив);
			Сообщить("Актив = " + Актив);
			
			ВалютаЦБ = Справочники.Валюты.НайтиПоНаименованию(СтрДок.ВалютаЦБ);
			Сообщить("ВалютаЦБ = " + ВалютаЦБ);
			
			Количество = 1*УбратьНецифровые(СтрДок.Количество);
			Сообщить("Количество = " + Количество);
			Сумма = 1*УбратьНецифровые(СтрДок.Сумма);
			Сообщить("Сумма = " + Сумма);
			Цена = 1*УбратьНецифровые(СтрДок.Цена);
			Сообщить("Цена = " + Цена);
			
			
			// СОЗДАЕМ ДОКУМЕНТЫ
			ДокСделка = Документы.СделкаЦБ.СоздатьДокумент();
			ДокСделка.ВидОперации = Объект.ВидОперации;
			ДокСделка.Дата = ДатаДок;
			
			ДокСделка.ПИФ = ПИФ;
			ДокСделка.РежимТоргов = РежимТоргов;
			ДокСделка.Контрагент = Контрагент;
			ДокСделка.ФизическоеМестоХраненияДС = ФизическоеМестоХраненияДС;
			ДокСделка.ДоговорКонтрагента = ДоговорКонтрагента;
			ДокСделка.ВалютаДокумента = ВалютаДокумента;
			ДокСделка.Актив = Актив;
			ДокСделка.ВалютаЦБ = ВалютаЦБ;
			ДокСделка.Количество = Количество;
			ДокСделка.Сумма = Сумма;
			ДокСделка.Цена = Цена;
			
			ДокСделка.БрокерскийСчет = ФизическоеМестоХраненияДС;
			ДокСделка.ВУ = Истина;
			ДокСделка.МСФО = Истина;
			ДокСделка.КурсВзаиморасчетов = 1;
			ДокСделка.КратностьВзаиморасчетов = 1;
			ДокСделка.ВалютаДокументаПоПриоритету = ВалютаДокумента;
			ДокСделка.ВалютаЦБПоПриоритету = ВалютаДокумента;
			ДокСделка.СчетУчетаАктива = ПланыСчетов.Управленческий.НайтиПоКоду("58.01.4");
			ДокСделка.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Управленческий.НайтиПоКоду("76.07.3");
			ДокСделка.СчетУчетаРасчетовПоАвансам = ПланыСчетов.Управленческий.НайтиПоКоду("76.07.3");
			ДокСделка.СчетУчетаДопРасходов = ПланыСчетов.Управленческий.НайтиПоКоду("76.07.7");
			
			ДокСделка.Записать(РежимЗаписиДокумента.Запись);
			Попытка
				ДокСделка.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				Сообщить("Док " + ДокСделка + " не могу провести !");
			КонецПопытки;
			
			//ПРЕРВАТЬ;
			
			
			//
		КонецЦикла;
		//
		Сообщить("Данные успешно загружены!");
	Исключение
		Сообщить("Ошибка при загрузке данных: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПриходы(Команда)
	СоздатьПриходыНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьДанныеИзМакета(Макет)
	Если Макет = Неопределено Тогда
		ВызватьИсключение "Передан пустой макет!";
	КонецЕсли;
	
	ТабДок = Макет;
	ТаблицаДанных = Новый ТаблицаЗначений;
	ПоследняяСтрока = ТабДок.ВысотаТаблицы;
	ПоследняяКолонка = ТабДок.ШиринаТаблицы;
	
	ОбластьЯчеек = ТабДок.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка); 
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	
	ТаблицаДанных = ПостроительОтчета.Результат.Выгрузить();
	Возврат ТаблицаДанных;
КонецФункции

&НаСервереБезКонтекста
Функция УбратьНецифровые(Текст)
	Результат = "";
	Для i = 1 По СтрДлина(Текст) Цикл
		Символ = Сред(Текст, i, 1);
		Если Найти("0123456789.,", Символ) > 0 Тогда
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции


