   
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ТипЗнч(Параметры) = Тип("ДанныеФормыСтруктура") Тогда

		Если Параметры.Свойство("ДатаНачала") <> Неопределено Тогда
			Объект.ДатаНачала = Параметры.ДатаНачала;	
		КонецЕсли;

		Если Параметры.Свойство("ДатаОкончания") <> Неопределено Тогда
			Объект.ДатаОкончания = Параметры.ДатаОкончания;	
		КонецЕсли;

		Если Параметры.Свойство("ПлатежныеДокументы_РДУ") <> Неопределено Тогда
			Объект.ПлатежныеДокументы_РДУ.Загрузить(ПолучитьИзВременногоХранилища(Параметры.ПлатежныеДокументы_РДУ));
		КонецЕсли;
				
	КонецЕсли;

КонецПроцедуры  
   
&НаСервере
Процедура ЗаполнитьПоРеестрамНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ПрочитатьРеестры(Объект.ДатаНачала, Объект.ДатаОкончания);	
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект"); 
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРеестрам(Команда)
	
	ЗаполнитьПоРеестрамНаСервере();
	
	Сообщить("Заполнение завершено");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПоступленияНаРСНаСервере()

	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.СоздатьДокументыПоступления();	
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект"); 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступленияНаРС(Команда)
	
	СоздатьПоступленияНаРСНаСервере();
	
	Сообщить("Создание документов завершено");
КонецПроцедуры

&НаСервере
Процедура ОтметитьВсёНаСервере()
	
	для Каждого Стр из Объект.Реестры Цикл
		Стр.Отм = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсё(Команда)
	ОтметитьВсёНаСервере();
КонецПроцедуры

&НаСервере
Процедура СнятьВсёНаСервере()
	
	для Каждого Стр из Объект.Реестры Цикл
		Стр.Отм = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсё(Команда)
	СнятьВсёНаСервере();
КонецПроцедуры
