
Функция СоединениеKafka(ПараметрыОбмена)
	Соединение = Неопределено;
	Попытка
		Соединение = Новый COMОбъект("Kafka1C.ConnectKafka");
	Исключение
		ОписаниеОшибки = "Ошибка подключения Kafka: "
			+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Подключение Kafka", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
	КонецПопытки;
	Возврат Соединение;
КонецФункции

Функция РезультатЧтенияСообщенияПоВнешнемуИсточнику(ВнешнийИсточник) Экспорт
	Если ТипЗнч(ВнешнийИсточник) = Тип("ПланВидовХарактеристикСсылка.ВнешниеИсточники") Тогда
		ПараметрыОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	Иначе
		ПараметрыОбмена = ВнешнийИсточник;
	КонецЕсли;
	ПараметрыОтправкиСообщения = СтруктураПараметровОтправкиСообщения(ПараметрыОбмена);
	ПараметрыОтправкиСообщения.Вставить("ВнешнийИсточник", ВнешнийИсточник);
	СоединениеКафка = СоединениеKafka(ПараметрыОбмена);
	
	Кафка.СоздатьПодписчика(СоединениеКафка, ПараметрыОтправкиСообщения);
	Сообщение = Кафка.РезультатЧтенияСообщения(СоединениеКафка, ПараметрыОтправкиСообщения);
	Кафка.УдалитьПодписчика(СоединениеКафка, ПараметрыОтправкиСообщения);
	СоединениеКафка = NULL;
	
	СообщениеМассив = Сообщение.Выгрузить();
	Если СообщениеМассив[1] = "ERROR" Тогда
		ОписаниеОшибки = "Ошибка при чтении сообщения из Kafka: " + СообщениеМассив[2] + Символы.ПС
						+ "Внешний источник:" + Строка(ВнешнийИсточник) + " Настройка" + Строка(ПараметрыОбмена);
		Если СообщениеМассив[2] = "Broker: Group authorization failed" Тогда
			ОписаниеОшибки = ОписаниеОшибки
								+ Символы.ПС + "KafkaТопик = " + ПараметрыОтправкиСообщения.KafkaТопик
								+ Символы.ПС + "KafkaАдрес = " + ПараметрыОтправкиСообщения.KafkaАдрес
								+ Символы.ПС + "KafkaПодписчик = " + ПараметрыОтправкиСообщения.KafkaПодписчик
								+ Символы.ПС + "KafkaСертификат = " + ПараметрыОтправкиСообщения.KafkaСертификат
								+ Символы.ПС + "KafkaПользователь = " + ПараметрыОтправкиСообщения.KafkaПользователь;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
		
	Возврат СообщениеМассив;
КонецФункции

Функция РезультатОтправкиСообщенияПоВнешнемуИсточнику(ДанныеОтправкиСообщения) Экспорт
	ВнешнийИсточник = ?(ЗначениеЗаполнено(ДанныеОтправкиСообщения.ВнешнийИсточник),
						ДанныеОтправкиСообщения.ВнешнийИсточник,
						Неопределено);
	Если НЕ ВнешнийИсточник = Неопределено Тогда
		ПараметрыОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	Иначе
		ПараметрыОбмена = ДанныеОтправкиСообщения;
	КонецЕсли;
	Если ПараметрыОбмена = Неопределено Тогда
		Возврат "Не определена настройка для топика";
	КонецЕсли;
	ПараметрыОтправкиСообщения = СтруктураПараметровОтправкиСообщения(ПараметрыОбмена);
	ПараметрыОтправкиСообщения.Вставить("ВнешнийИсточник", ВнешнийИсточник);
	СоединениеКафка = СоединениеKafka(ПараметрыОбмена);

	Кафка.СоздатьОтправителя(СоединениеКафка, ПараметрыОтправкиСообщения);
	ПараметрыОтправкиСообщения.Вставить("КлючСообщения", ДанныеОтправкиСообщения.Ключ);
	ПараметрыОтправкиСообщения.Вставить("ТекстСообщения", ДанныеОтправкиСообщения.Сообщение);
	Ответ = Кафка.РезультатОтправкиСообщения(СоединениеКафка, ПараметрыОтправкиСообщения);
	Кафка.УдалитьОтправителя(СоединениеКафка, ПараметрыОтправкиСообщения);
	СоединениеКафка = NULL;
	Возврат Ответ;
	
КонецФункции

Функция СтруктураПараметровОтправкиСообщения(Настройка)
	Параметры = Новый Структура("KafkaАдрес,KafkaПользователь,KafkaПароль,KafkaСертификат,KafkaТопик,KafkaПодписчик");
	ЗаполнитьЗначенияСвойств(Параметры, Настройка);
	Возврат Параметры;
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);