///////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ФайлИлиКаталогПриИзменении(Элемент)
	ВидимостьФайлИлиКаталог();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьФайлИлиКаталог();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьФайлИлиКаталог()
	ЭтотОбъект.Элементы.ИмяФайла.Видимость = Объект.ФайлИлиКаталог;
	ЭтотОбъект.Элементы.КаталогФайлов.Видимость = Не Объект.ФайлИлиКаталог;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбора.Заголовок                   = "Выберите файл для загрузки данных";
	ДиалогВыбора.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбора.ИндексФильтра               = 0;
	ДиалогВыбора.ПолноеИмяФайла              = Элемент.ТекстРедактирования;
	ДиалогВыбора.ПроверятьСуществованиеФайла = Ложь;
	
	ФорматФайла = "xml";
	
	Фильтр = НСтр("ru = 'Файлы " + ФорматФайла + "|*." + ФорматФайла + "'");
	ДиалогВыбора.Фильтр = Фильтр;	
	
	Если ДиалогВыбора.Выбрать() Тогда
		Объект.ИмяФайла = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.Каталог = Объект.КаталогФайлов;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите путь к каталогу файлов агентов'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ИмяКаталога = ДиалогОткрытияФайла.Каталог;
		ИмяКаталога = ИмяКаталога + ФайловыеФункцииКлиентСервер.ПолучитьСлеш(ФайловыеФункцииКлиентПовтИсп.ТипПлатформыКлиента());
		Объект.КаталогФайлов = ИмяКаталога;
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура СчитатьФайл(Команда)
	
	Если Объект.ФайлИлиКаталог И Не ЗначениеЗаполнено(Объект.ИмяФайла) Тогда
		Сообщить("Не заполнено Имя файла");
		Возврат;
	КонецЕсли;
	Если Не Объект.ФайлИлиКаталог И Не ЗначениеЗаполнено(Объект.КаталогФайлов) Тогда
		Сообщить("Не заполнен Каталог файлов");
		Возврат;
	КонецЕсли;
	
	Объект.БумагиИзФайла.Очистить();
	Объект.КупоныИзФайла.Очистить();
	Объект.ОперацииДляСоздания.Очистить();
	
	Если Не Объект.ФайлИлиКаталог Тогда 
		МассивФайлов = НайтиФайлы(Объект.КаталогФайлов, "*.xml", Ложь);
	Иначе
		МассивФайлов = Новый Массив;
		МассивФайлов.Добавить(Объект.ИмяФайла);
	КонецЕсли;
	
	Для Каждого ТекФайл ИЗ МассивФайлов Цикл
		Если ТипЗнч(ТекФайл) = Тип("Файл") Тогда 
			ТекФайлИмя = ТекФайл.ПолноеИмя;
		Иначе
			ТекФайлИмя = ТекФайл;
		КонецЕсли;
			
		АдресФайлаНаСервере = "";
		Отказ = Ложь;
		Попытка
			ПоместитьФайл(АдресФайлаНаСервере, ТекФайлИмя, , Ложь, УникальныйИдентификатор);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось прочитать файл " + ТекФайлИмя + "! Проверьте правильность пути к файлу.", , , ,Отказ);
		КонецПопытки;
		Если НЕ Отказ Тогда
			СчитатьФайлСервер(АдресФайлаНаСервере);	
		КонецЕсли;
	КонецЦикла;	
	
	СоздатьОперацииДляСоздания();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Версия = ТекОбъект.СведенияОВнешнейОбработке().Версия;
	Заголовок = "v." + Версия;

КонецПроцедуры

&НаСервере
Процедура СчитатьФайлСервер(АдресФайлаНаСервере)
	
	УникальноеИмяФайла = Новый УникальныйИдентификатор;	
	ИмяФайлаНаСервере = КаталогВременныхФайлов() + УникальноеИмяФайла + ".xml";	
	ФайлДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаНаСервере);
	ФайлДвоичныеДанные.Записать(ИмяФайлаНаСервере);
	
	ЕстьБлок1 = Ложь;
	ЕстьСтрока1 = Ложь;
	ЕстьБлок21 = Ложь;
	ЕстьБлок22 = Ложь;
	ЕстьСтрока2 = Ложь;
	
	Account1 = "";
	Account2 = "";
	Currency = "";
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайлаНаСервере);	
	Пока ЧтениеXML.Прочитать() Цикл
		
		//	БамагиИзФайла
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Securities" Тогда
			ЕстьБлок1 = Истина;
		КонецЕсли;
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "Securities" Тогда
			ЕстьБлок1 = Ложь;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Account" И ЕстьБлок1 Тогда
			ЧтениеXML.Прочитать();
			Account1 = ЧтениеXML.Значение;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "SecuritiesHoldings" И ЕстьБлок1 Тогда
			НовСтр1 = Объект.БумагиИзФайла.Добавить();
			НовСтр1.ИмяФайла = ИмяФайлаНаСервере;
			НовСтр1.Account = Account1;
			ЕстьСтрока1 = Истина;
		КонецЕсли;
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "SecuritiesHoldings" И ЕстьБлок1 Тогда
			ЕстьСтрока1 = Ложь;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Security" И ЕстьСтрока1 Тогда
			ЧтениеXML.Прочитать();
			НовСтр1.Security = ЧтениеXML.Значение;
		КонецЕсли;
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "ISIN" И ЕстьСтрока1 Тогда
			ЧтениеXML.Прочитать();
			НовСтр1.ISIN = ЧтениеXML.Значение;
		КонецЕсли;
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "StateRegNo" И ЕстьСтрока1 Тогда
			ЧтениеXML.Прочитать();
			НовСтр1.StateRegNo = ЧтениеXML.Значение;
		КонецЕсли;
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "OpeningBalance" И ЕстьСтрока1 Тогда
			ЧтениеXML.Прочитать();
			НовСтр1.OpeningBalance = ЧтениеXML.Значение;
		КонецЕсли;
		
		//	КупоныИзФайла
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Cash" Тогда
			ЕстьБлок21 = Истина;
		КонецЕсли;
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "Cash" Тогда
			ЕстьБлок21 = Ложь;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Account" И ЕстьБлок21 Тогда
			ЧтениеXML.Прочитать();
			Account2 = ЧтениеXML.Значение;
		КонецЕсли;
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Currency" И ЕстьБлок21 Тогда
			ЧтениеXML.Прочитать();
			Currency = ЧтениеXML.Значение;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Movements" И ЕстьБлок21 Тогда
			ЕстьБлок22 = Истина;
		КонецЕсли;
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "Movements" И ЕстьБлок21 Тогда
			ЕстьБлок22 = Ложь;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "CashTransactions" И ЕстьБлок22 Тогда
			НовСтр2 = Объект.КупоныИзФайла.Добавить();
			НовСтр2.ИмяФайла = ИмяФайлаНаСервере;
			НовСтр2.Account = Account2;
			НовСтр2.Currency = Currency;
			ЕстьСтрока2 = Истина;
		КонецЕсли;
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "CashTransactions" И ЕстьБлок22 Тогда
			ЕстьСтрока2 = Ложь;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "TransactionNo" И ЕстьСтрока2 Тогда
			ЧтениеXML.Прочитать();
			НовСтр2.TransactionNo = ЧтениеXML.Значение;
		КонецЕсли;
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "RealPaymentDT" И ЕстьСтрока2 Тогда
			ЧтениеXML.Прочитать();
			НовСтр2.RealPaymentDT = ПреобразоватьСтрокуВДату(ЧтениеXML.Значение);
		КонецЕсли;
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Security" И ЕстьСтрока2 Тогда
			ЧтениеXML.Прочитать();
			НовСтр2.Security = ЧтениеXML.Значение;
		КонецЕсли;
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Quantity" И ЕстьСтрока2 Тогда
			ЧтениеXML.Прочитать();
			НовСтр2.Quantity = ЧтениеXML.Значение;
		КонецЕсли;
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "TransactionType" И ЕстьСтрока2 Тогда
			ЧтениеXML.Прочитать();
			НовСтр2.TransactionType = ЧтениеXML.Значение;
		КонецЕсли;
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Amount" И ЕстьСтрока2 Тогда
			ЧтениеXML.Прочитать();
			НовСтр2.Amount = ПреобразоватьСтрокуВЧисло(ЧтениеXML.Значение);
		КонецЕсли;
		
	КонецЦикла;
	ЧтениеXML.Закрыть();
//	ТорговыйКод = ЧтениеXML.ПолучитьАтрибут("Account");
    
КонецПроцедуры // СчитатьФайлСервер()

///////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура СоздатьОперацииДляСоздания()
	
	Для Каждого Х Из Объект.КупоныИзФайла Цикл
		Если Не Найти(ВРег(Х.TransactionType),ВРег("Выплата купона")) И Не Найти(ВРег(Х.TransactionType),ВРег("Coupon payment")) Тогда Продолжить; КонецЕсли;
		НовСтр = Объект.ОперацииДляСоздания.Добавить();
		НовСтр.ИмяФайла = Х.ИмяФайла;
		ЗаполнитьЗначенияСвойств(НовСтр,НайтиОблигацию(Х.Security,Х.ИмяФайла));
		НовСтр.БрокерскийСчет = Х.Account;
		НовСтр.ВалютаДокумента = Справочники.Валюты.НайтиПоНаименованию(Х.Currency);
		НовСтр.СуммаДокумента = Х.Amount;
		НовСтр.Дата = Х.RealPaymentDT + 9*60*60;
		ЗаполнитьЗначенияСвойств(НовСтр,НайтиТорговыйКод(НовСтр.БрокерскийСчет,НовСтр.ДепоСчет));
		НайтиПогашениеНКД(НовСтр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НайтиОблигацию(Security,ИмяФайла)
	Рез = Новый Структура();
	Рез.Вставить("Облигация", Справочники.Облигации.ПустаяСсылка());
	Рез.Вставить("ДепоСчет", "яяяяя");
	
	Стр = Security;
	Х = Найти(Стр,"/");
	Если Х Тогда Стр = Лев(Стр,Х-1); КонецЕсли; 
	Х = Найти(Стр,",");
	Если Х Тогда Стр = Лев(Стр,Х-1); КонецЕсли; 
	Стр = СтрЗаменить(Стр,".","");
	Стр = СтрЗаменить(Стр," ","");
	
	Для Каждого Х Из Объект.БумагиИзФайла Цикл
		Если Найти(СтрЗаменить(СтрЗаменить(Х.Security,".","")," ",""),Стр) И Х.ИмяФайла = ИмяФайла Тогда
			Рез.ДепоСчет = Х.Account;
			Рез.Облигация = Справочники.Облигации.ОблигацияПоISIN(Х.ISIN);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Рез.Облигация = Справочники.Облигации.ПустаяСсылка() Тогда
		Сообщить("Не определена Облигация");
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

&НаСервере
Функция НайтиТорговыйКод(БрокерскийСчет,ДепоСчет)
	Рез = Новый Структура();
	Рез.Вставить("ДоговорДУ", Справочники.ДоговорДУ.ПустаяСсылка());
	Рез.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	Рез.Вставить("ДоговорКонтрагента", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	Рез.Вставить("АналитическийСчетБрокера", Справочники.АналитическиеСчета.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	     "ВЫБРАТЬ
	     |	ТорговыеКоды.ДоговорДУ КАК ДоговорДУ,
	     |	ТорговыеКоды.Брокер КАК Контрагент,
	     |	ТорговыеКоды.ДоговорБрокера КАК ДоговорКонтрагента,
	     |	ТорговыеКоды.АналитическийСчетДС КАК АналитическийСчетБрокера,
	     |	10 КАК Порядок
	     |ИЗ
	     |	Справочник.ТорговыеКоды КАК ТорговыеКоды
	     |ГДЕ
	     |	ТорговыеКоды.ТорговыйКод ПОДОБНО ""%"" + &ТорговыйКод + ""%""
	     |	И НЕ ТорговыеКоды.ПометкаУдаления
	     |
	     |ОБЪЕДИНИТЬ ВСЕ
	     |
	     |ВЫБРАТЬ
	     |	АналитическиеСчета.ДоговорДУ,
	     |	АналитическиеСчета.СубъектМестаХранения,
	     |	АналитическиеСчета.ДоговорКонтрагента,
	     |	АналитическиеСчета.Ссылка,
	     |	20
	     |ИЗ
	     |	Справочник.АналитическиеСчета КАК АналитическиеСчета
	     |ГДЕ
	     |	АналитическиеСчета.НомерСчета ПОДОБНО ""%"" + &НомерДоговора + ""%""
	     |	И НЕ АналитическиеСчета.ПометкаУдаления
	     |
	     |УПОРЯДОЧИТЬ ПО
	     |	Порядок";
	Запрос.УстановитьПараметр("ТорговыйКод",ДепоСчет);	 
	Запрос.УстановитьПараметр("НомерДоговора",БрокерскийСчет);	 
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Рез,ВыборкаДетальныеЗаписи);
		Прервать;
	КонецЦикла;
	
	Если Рез.ДоговорДУ = Справочники.ДоговорДУ.ПустаяСсылка() Тогда
		Сообщить("Не определен ДоговорДУ");
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

&НаСервере
Процедура НайтиПогашениеНКД(НовСтр)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	     "ВЫБРАТЬ
	     |	НачисленныйКупонныйДоходУправленческий.Регистратор КАК ДокументОснование,
	     |	НачисленныйКупонныйДоходУправленческий.КупонныйПериод КАК КупонныйПериод,
	     |	НачисленныйКупонныйДоходУправленческий.Сумма КАК СуммаДокументаРуб
	     |ИЗ
	     |	РегистрНакопления.НачисленныйКупонныйДоходУправленческий КАК НачисленныйКупонныйДоходУправленческий
	     |ГДЕ
	     |	НачисленныйКупонныйДоходУправленческий.ДоговорДУ = &ДоговорДУ
	     |	И НачисленныйКупонныйДоходУправленческий.Облигация = &Облигация
	     |	И НачисленныйКупонныйДоходУправленческий.Период >= &Период1
	     |	И НачисленныйКупонныйДоходУправленческий.Период <= &Период2
	     |	И НачисленныйКупонныйДоходУправленческий.Валюта = &Валюта
	     |	И НачисленныйКупонныйДоходУправленческий.Регистратор ССЫЛКА Документ.ПереводНКДВЗадолженностьЭмитента";
	Запрос.УстановитьПараметр("ДоговорДУ",НовСтр.ДоговорДУ);
	Запрос.УстановитьПараметр("Облигация",НовСтр.Облигация);
	Запрос.УстановитьПараметр("Период1",ДобавитьМесяц(НовСтр.Дата,-1));
	Запрос.УстановитьПараметр("Период2",НовСтр.Дата);
	Запрос.УстановитьПараметр("Валюта",НовСтр.ВалютаДокумента);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НовСтр,ВыборкаДетальныеЗаписи);
	КонецЦикла;

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////

&НаСервереБезКонтекста
Функция ПреобразоватьСтрокуВДату(ДатаВремяСтрока)
	
	ДатаСтрока = Лев(ДатаВремяСтрока, 10);
	ВремяСтрока = Прав(ДатаВремяСтрока, 8);
	ПреобразованнаяДата = '00010101';
	
	Если ЗначениеЗаполнено(ДатаСтрока) Тогда
		ПреобразованнаяДата = Дата(Прав(ДатаСтрока, 4) + Сред(ДатаСтрока, 4, 2) + Лев(ДатаСтрока, 2));
//		ПреобразованнаяДата = Дата(Прав(ДатаСтрока, 4) + Сред(ДатаСтрока, 4, 2) + Лев(ДатаСтрока, 2) + Лев(ВремяСтрока, 2) + Сред(ВремяСтрока,4, 2) + Прав(ВремяСтрока, 2));
	КонецЕсли;	
	
	Возврат ПреобразованнаяДата;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПреобразоватьСтрокуВЧисло(ЧислоСтрока)
	
	Рез = ЧислоСтрока;
	Рез = СтрЗаменить(Рез,",","");
	Рез = СтрЗаменить(Рез," ","");
	Рез = СтрЗаменить(Рез,"+","");
	
	Возврат Число(Рез);
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура СоздатьОбъекты(Команда)
	СоздатьОбъектыСервер();
КонецПроцедуры

&НаСервере
Процедура СоздатьОбъектыСервер()
	
	Для каждого Х Из Объект.ОперацииДляСоздания Цикл
		
		Если Не ЗначениеЗаполнено(Х.Дата) Или
			 Не ЗначениеЗаполнено(Х.ДоговорДУ) Или
			 Не ЗначениеЗаполнено(Х.Контрагент) Или
			 Не ЗначениеЗаполнено(Х.ДоговорКонтрагента) Или
			 Не ЗначениеЗаполнено(Х.АналитическийСчетБрокера) Или
			 Не ЗначениеЗаполнено(Х.Облигация) Или
			 Не ЗначениеЗаполнено(Х.ВалютаДокумента) Или
			 Не ЗначениеЗаполнено(Х.СуммаДокумента) Тогда
			Сообщить("Не заполнены необходимые параметры для строки " + Строка(Х.НомерСтроки));
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Х.ДокументОснование) Тогда
			Сообщить("Не найден документ ""Погашение НКД"" для строки " + Строка(Х.НомерСтроки));
			Продолжить;
			
			НовДок = Документы.ПереводНКДВЗадолженностьЭмитента.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(НовДок,Х);
			НовДок.УУ = Истина;
			НовДок.БУ = Истина;
			НовДок.ЗаполнитьКупоннымиПериодами();
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Создан документ ""Погашение НКД"" для строки " + Строка(Х.НомерСтроки));
			НайтиПогашениеНКД(Х);
			Если Не ЗначениеЗаполнено(Х.ДокументОснование) Тогда
				Сообщить("Расхождение в сумме документа в ""Погашение НКД"" и ""Отчет Брокера"" для строки " + Строка(Х.НомерСтроки));
				Х.ДокументОснование = НовДок.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		НовДок = Документы.ОперацияПоСчетуБрокера.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(НовДок,Х);
		НовДок.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Зачисление;
		НовДок.БУ = Истина;
		НовДок.ВУ = Истина;
		НовДок.УУ = Истина;
		НовДок.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД");
		НовДок.СтатьяЗатрат = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Расчеты по НКД");
		Т = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовДок.ВалютаДокумента,НовДок.Дата);
		НовДок.КурсВзаиморасчетов = Т.Курс;
		НовДок.КурсКорреспондента = Т.Курс;
		НовДок.КратностьВзаиморасчетов = Т.Кратность;
		НовДок.КратностьКорреспондента = Т.Кратность;
		НовДок.СуммаДокументаРуб = Окр(НовДок.СуммаДокумента * НовДок.КурсВзаиморасчетов,2);
		НовДок.КоррСчет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.04.2.1");
		НовДок.Корреспондент = Х.Облигация.Эмитент;
		НовДок.СубконтоКоррСчета1 = Х.Облигация.Эмитент;
		НовДок.СубконтоКоррСчета2 = Х.Облигация;
		НовДок.СубконтоКоррСчета3 = Х.КупонныйПериод;
		НовДок.СуммаКорреспондента = НовДок.СуммаДокумента;
		НовДок.ВалютаКорреспондента = НовДок.ВалютаДокумента;
		НовДок.СтатьяЗатратКорреспондента = НовДок.СтатьяЗатрат;
		
		НовДок.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Создан документ ""Отчет Брокера"" для строки " + Строка(Х.НомерСтроки));
		Х.ОперацияПоСчетуБрокера = НовДок.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры // СоздатьОбъектыСервер()

///////////////////////////////////////////////////////////////////////////////

