#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

&Вместо("ПроверкаИОтправка")
Функция FO_LimitProfile_ПроверкаИОтправка(ПараметрыВходящие, АдресРезультата = Неопределено)

	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Попытка
		Результат = ПродолжитьВызов(ПараметрыВходящие, АдресРезультата);
		FO_LimitProfile_Замеры.Добавить("Распорядители.ПроверкаИОтправка", ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт);
		Возврат Результат;
	Исключение
		FO_LimitProfile_Замеры.Добавить("Распорядители.ПроверкаИОтправка", ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт);
		ВызватьИсключение;
	КонецПопытки;

КонецФункции

#КонецОбласти

#КонецЕсли
