&НаКлиенте
Процедура ОбновитьОтображениеЭлементов()
	Если Не Лев(СокрЛП(Объект.Код), 2)="04" Тогда
		Элементы.Страна.Видимость	= Истина;
	Иначе
		Элементы.Страна.Видимость	= Ложь;
		Если ЗначениеЗаполнено(Объект.Страна) Тогда
			Объект.Страна			= ПредопределенноеЗначение("Справочник.КлассификаторСтранМира.ПустаяСсылка");
			Модифицированность		= Истина;
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры
	
&НаКлиенте
Процедура КодПриИзменении(Элемент)
	ОбновитьОтображениеЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображениеЭлементов();
КонецПроцедуры