#Область ПрограммныйИнтерфейс

// Возвращает массив всех типов ЦБ, которые можно отнести к депозитарным распискам
// Возвращаемое значение:
//	- Массив
Функция ВсеТипыДепозитарныхРасписок() Экспорт
	ТипыДепозитарныхРасписок = Новый Массив;
	ТипыДепозитарныхРасписок.Добавить(Перечисления.ТипыЦБ.ДепозитарнаяРасписка);
	ТипыДепозитарныхРасписок.Добавить(Перечисления.ТипыЦБ.АДР);
	ТипыДепозитарныхРасписок.Добавить(Перечисления.ТипыЦБ.ГДР);
	
	Возврат ТипыДепозитарныхРасписок;
КонецФункции

// Возвращает Истина, если указанный тип ЦБ можно отнести к депозитарным распискам
// Параметры:
// 	ТипЦБ - ПеречислениеСсылка.ТипыЦБ
// Возвращаемое значение:
//	- Булево
Функция ЭтоДепозитарнаяРасписка(ТипЦБ) Экспорт
	ЭтоДепозитарнаяРасписка = ТипЦБ = Перечисления.ТипыЦБ.ДепозитарнаяРасписка
								Или ТипЦБ = Перечисления.ТипыЦБ.АДР
								Или ТипЦБ = Перечисления.ТипыЦБ.ГДР;
								
	Возврат ЭтоДепозитарнаяРасписка;
КонецФункции

// Возвращает массив всех типов ЦБ, у которых нет номинала
// Возвращаемое значение:
//	- Массив
Функция ТипыЦББезНоминала() Экспорт
	ТипыЦББезНоминала = ВсеТипыДепозитарныхРасписок();
	ТипыЦББезНоминала.Добавить(Перечисления.ТипыЦБ.Пай);

	Возврат ТипыЦББезНоминала;
КонецФункции

#КонецОбласти