Перем СоединениеАДО;
Перем КомандаАДО;
Перем НаборЗаписейАДО;

Перем НаправлениеПараметра;
Перем ТипыЗапросов;

Процедура ИнициироватьСоединение(Параметры = Неопределено) Экспорт
	
	Если Макет.Высота = 0 Тогда
		Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("Макет") Тогда
			Параметры.Свойство("Макет", Макет);
		ИначеЕсли ТипЗнч(Параметры) = Тип("ТабличныйДокумент") Тогда
			Макет = Параметры;
		КонецЕсли;
		Если Макет.Высота = 0 Тогда
			ВызватьИсключение("Не задан источник данных (табличный документ)!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ВыполнитьХранимуюПроцедуру(Наименование, СтруктураВходныхПараметров = Неопределено, СтруктураВыходныхПараметров = Неопределено) Экспорт
		
	Возврат ДанныеИзТаблицыМакета(Наименование);
	
КонецФункции

Функция ВыполнитьЗапрос(ТекстЗапроса, СтруктураВходныхПараметров = Неопределено, СтруктураВыходныхПараметров = Неопределено) Экспорт
	
	Возврат ДанныеИзТаблицыМакета(ТекстЗапроса);
	
КонецФункции

Функция ДанныеИзТаблицыМакета(ИмяПроцедуры)
	ИндексСтроки = 1;
	ИндексКолонки = 2;
	КоличествоПропусков = 0;
	НашлиМетод = Ложь;
	ТаблицаВозврата = Новый ТаблицаЗначений;
	//ищем имя процедуры
	Пока Истина Цикл 
		ОбластьЗаголовок = Макет.Область(ИндексСтроки,1,ИндексСтроки,1).Текст;
		Если ЗначениеЗаполнено(ОбластьЗаголовок) Тогда 
			Если ОбластьЗаголовок = ИмяПроцедуры Тогда 
				НашлиМетод = Истина;
				Прервать;
			КонецЕсли;
			КоличествоПропусков = 0;
		Иначе 
			КоличествоПропусков = КоличествоПропусков + 1;
		КонецЕсли;
		Если  КоличествоПропусков > 20 Тогда  // если данных больше добавляем увеличиваем порог
			КоличествоПропусков = 0;
			Прервать;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	Если Не НашлиМетод Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю( "Не найдена процедура в макете тестирования: " + ИмяПроцедуры);
		Возврат ТаблицаВозврата;
	КонецЕсли;
	//читаем поля таблицы и типы
	ИндексСтрокиИмени = ИндексСтроки + 1; // тут будет имена полей таблици возврата
	ИндексСтрокиТипа = ИндексСтрокиИмени + 1; // тут будут типы полей  таблици возврата
	Пока Истина Цикл 
		ИмяПоляТаблицы = Макет.Область(ИндексСтрокиИмени,ИндексКолонки,ИндексСтрокиИмени,ИндексКолонки).Текст;
		ТипПоляТаблицы = Макет.Область(ИндексСтрокиТипа,ИндексКолонки,ИндексСтрокиТипа,ИндексКолонки).Текст;
		Если ЗначениеЗаполнено(ИмяПоляТаблицы) И ЗначениеЗаполнено(ТипПоляТаблицы) Тогда 
			ИндексПоискаНачало  = Найти(ТипПоляТаблицы,"(");
			ИндексПоискаКонец  = Найти(ТипПоляТаблицы,")");
			Если ИндексПоискаНачало > 0 Тогда //орбаботка для строки
				ИндексПоискаНачало = ИндексПоискаНачало + 1;
				ИскомоеЧисло = Сред(ТипПоляТаблицы, ИндексПоискаНачало, ИндексПоискаКонец - ИндексПоискаНачало);
				ИскомыйТип   = Лев(ТипПоляТаблицы, ИндексПоискаНачало - 2);
				Если Лев(ТипПоляТаблицы,1) = "С" Тогда 
					КС = Новый КвалификаторыСтроки(ИскомоеЧисло);
					ОписаниеТипов = Новый ОписаниеТипов(ИскомыйТип,,КС);
				Иначе 
					КЧ = Новый КвалификаторыЧисла(ИскомоеЧисло);
					ОписаниеТипов = Новый ОписаниеТипов(ИскомыйТип,,,КЧ);
				КонецЕсли;
			Иначе
				ОписаниеТипов = Новый ОписаниеТипов(ТипПоляТаблицы);
			КонецЕсли;
			ТаблицаВозврата.Колонки.Добавить(ИмяПоляТаблицы, ОписаниеТипов);
			ИндексКолонки = ИндексКолонки + 1;
		Иначе 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//Читаем данные в таблицу возврата
	Колонки = ТаблицаВозврата.Колонки;
	Если Колонки.Количество() = 0 Тогда 
		Возврат ТаблицаВозврата;
	КонецЕсли;
	ВсегоКолонок = ИндексКолонки -1;
	ИндексСтроки = ИндексСтрокиТипа;
	Пока Истина Цикл 
		ИндексКолонки = 2;
		ИндексСтроки = ИндексСтроки + 1; //строка данных
		ЗначениеПоляТаблицы = Макет.Область(ИндексСтроки,ИндексКолонки,ИндексСтроки,ИндексКолонки).Текст;
		Если ЗначениеЗаполнено(ЗначениеПоляТаблицы) И ЗначениеПоляТаблицы <> "Ограничитель" Тогда 
			НоваяСтрока = ТаблицаВозврата.Добавить();
			УстановитьЗначениеВТаблицу(НоваяСтрока,Колонки,ИндексКолонки,ЗначениеПоляТаблицы);
			ИндексКолонки = ИндексКолонки + 1;
			Пока  ИндексКолонки <= ВсегоКолонок Цикл 
				ЗначениеПоляТаблицы = Макет.Область(ИндексСтроки,ИндексКолонки,ИндексСтроки,ИндексКолонки).Текст;
				Если ЗначениеЗаполнено(ЗначениеПоляТаблицы) Тогда 
					УстановитьЗначениеВТаблицу(НоваяСтрока,Колонки,ИндексКолонки,ЗначениеПоляТаблицы);
				КонецЕсли;
				ИндексКолонки = ИндексКолонки + 1;
			КонецЦикла;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ТаблицаВозврата;
КонецФункции

Процедура УстановитьЗначениеВТаблицу(НоваяСтрока,Колонки,ИндексКолонки,ЗначениеПоляТаблицы)
	Колонка		= Колонки[ИндексКолонки -2];
	ИмяКолонки	= Колонка.Имя;
	ТипКолонки	= Колонка.ТипЗначения;
	НоваяСтрока[ИмяКолонки] = ТипизироватьЗначение(ЗначениеПоляТаблицы,ТипКолонки);
КонецПроцедуры

Функция ТипизироватьЗначение(ЗначениеПоляТаблицы,ТипКолонки)
	Результат = ЗначениеПоляТаблицы;
	Если ТипКолонки.Типы().Найти(Тип("Дата")) <> Неопределено Тогда 
		Результат = Дата(ЗначениеПоляТаблицы);
	ИначеЕсли ТипКолонки.Типы().Найти(("Число")) <> Неопределено Тогда 
		Результат = Число(ЗначениеПоляТаблицы);
	ИначеЕсли ТипКолонки.Типы().Найти(Тип("Булево")) <> Неопределено Тогда 
		Результат = ?(ЗначениеПоляТаблицы = "1", Истина, Ложь);
	КонецЕсли;
	Возврат Результат;
КонецФункции

НаправлениеПараметра = ВнешниеДанные.ИнициализацияТиповНаправленияПараметровADO();
ТипыЗапросов = ВнешниеДанные.ИнициализацияТиповADO();
ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
