
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НомерБД") Тогда 
		НомерБД = Параметры.НомерБД;
	Иначе 
		НомерБД = 1;
	КонецЕсли;
	Если Параметры.Свойство("Текущая") Тогда 
		Текущая = Параметры.Текущая;
	Иначе 
		Текущая = Истина;
	КонецЕсли;
	Если Параметры.Свойство("ТекущийОбъект") Тогда 
		ТекущийОбъект = Параметры.ТекущийОбъект;
	Иначе 
		ТекущийОбъект = "Объект1";
	КонецЕсли;
	Если Параметры.Свойство("СтрокаСоединения") Тогда 
		СтрокаСоединения = Параметры.СтрокаСоединения;
	Иначе 
		СтрокаСоединения = "";
	КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Если Текущая Тогда 
		Данные = ОбработкаОбъект.ПолучитьДанныеТекущейБД(ТекущийОбъект ,НомерБД, Ложь);
	Иначе 
		Данные = ОбработкаОбъект.ПолучитьДанныеУдаленнойБД(ТекущийОбъект, НомерБД, СтрокаСоединения, Ложь);
	КонецЕсли;
	
	ОписаниеТипаNull = Новый ОписаниеТипов("Null");
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого Колонка Из Данные.Колонки Цикл 
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, ?(Колонка.ТипЗначения = ОписаниеТипаNull, ОписаниеТипаСтрока, Колонка.ТипЗначения), "ТЗ", Колонка.Заголовок));
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	СтрокаСвойств = "";
	Для Каждого Колонка Из Данные.Колонки Цикл 
		ЭлементФормы = Элементы.Добавить("ТЗ" + Колонка.Имя, Тип("ПолеФормы"), Элементы["ТЗ"]);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным = "ТЗ" + "." + Колонка.Имя;
		
		СтрокаСвойств = СтрокаСвойств + Колонка.Имя + ",";
	КонецЦикла;
	
	Элементы["ТЗСсылка"].Видимость = Ложь;
	
	СтруктураВозврата = Новый Структура(СтрокаСвойств);
	ЗначениеВРеквизитФормы(Данные, "ТЗ");
	
КонецПроцедуры


&НаКлиенте
Процедура ТЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, ТЗ[ВыбраннаяСтрока]);
	ОповеститьОВыборе(СтруктураВозврата);
	
КонецПроцедуры

