#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИнформациюССайтаММВБ(Команда)
	ЗагрузитьИнформациюССайтаММВБНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюВСправочникеЦБ(Команда)
	ОбновитьИнформациюВСправочникеЦБНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУведомлениеОбИзменениях(Команда)
	ОтправитьУведомлениеОбИзмененияхНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьИнформациюССайтаММВБНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьИнформациюССайтаММВБ();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюВСправочникеЦБНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОбновитьИнформациюВСправочникеЦБ();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ОтправитьУведомлениеОбИзмененияхНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОтправитьУведомлениеОбИзменениях();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");	
КонецПроцедуры

#КонецОбласти