
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ВнешнийИсточникПриИзменении(Элемент)
	Отчет.Каталог = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(Отчет.ВнешнийИсточник).Папка;
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбменДаннымиКлиент.ОбработчикВыбораФайла(Отчет, "ПолноеИмяФайла", СтандартнаяОбработка, "Excel 2007|*.xlsx");
КонецПроцедуры

&НаКлиенте
Процедура ВариантСверкиПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Элементы.ПолноеИмяФайла.Видимость = Отчет.ВариантСверки;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусы(Команда)
	ОткрытьФорму(СтрЗаменить(ИмяФормы, "ФормаОтчета", "ФормаУстановкиСтатусов"), Новый Структура("РезультатСверки", Отчет.РезультатСверки), ЭтаФорма);
КонецПроцедуры

