// Добавляет соответствие документа услуг депозитария к основанию
//
// Параметры:
//  УслугиДепозитария	 - ДокументСсылка.УслугиДепозитария
//  Основание			 - ДокументСсылка.Поручение, СправочникСсылка.ФормыW8
//
Процедура ДобавитьЗапись(УслугиДепозитария, Основание) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОснованияУслугДепозитария.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УслугиДепозитария = УслугиДепозитария;
	МенеджерЗаписи.Основание = Основание;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

// Возвращает данные оснований по документу услуги депозитария, сумма и валюта документа добавлены
// для структуры подчиненности
//
// Параметры:
//  УслугиДепозитария	 - ДокументСсылка.УслугиДепозитария
// 
// Возвращаемое значение:
//  ВыборкаДанных - Выборка с данными оснований
//
Функция ДанныеОснованийУслуги(УслугиДепозитария) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ОснованияУслугДепозитария.Основание) КАК Представление,
	|	ОснованияУслугДепозитария.Основание КАК Ссылка,
	|	ОснованияУслугДепозитария.Основание.Проведен КАК Проведен,
	|	ОснованияУслугДепозитария.Основание.ПометкаУдаления КАК ПометкаУдаления,
	|	NULL КАК СуммаДокумента,
	|	NULL КАК ВалютаДокумента
	|ИЗ
	|	РегистрСведений.ОснованияУслугДепозитария КАК ОснованияУслугДепозитария
	|ГДЕ
	|	ОснованияУслугДепозитария.УслугиДепозитария = &УслугиДепозитария";
	
	Запрос.УстановитьПараметр("УслугиДепозитария", УслугиДепозитария);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выбрать();
	КонецЕсли;
	
КонецФункции

// Возвращает данные услуг депозитария по основанию, валюта документа добавлена для структуры подчиненности
//
// Параметры:
//  Основание	 - ДокументСсылка.Поручение, СправочникСсылка.ФормыW8
// 
// Возвращаемое значение:
//  ВыборкаДанных - Выборка с данными услуг
//
Функция ДанныеУслугПоОснованию(Основание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ОснованияУслугДепозитария.УслугиДепозитария) КАК Представление,
	|	ОснованияУслугДепозитария.УслугиДепозитария КАК Ссылка,
	|	ОснованияУслугДепозитария.УслугиДепозитария.Проведен КАК Проведен,
	|	ОснованияУслугДепозитария.УслугиДепозитария.ПометкаУдаления КАК ПометкаУдаления,
	|	ОснованияУслугДепозитария.УслугиДепозитария.СуммаВсего КАК СуммаДокумента,
	|	NULL КАК ВалютаДокумента
	|ИЗ
	|	РегистрСведений.ОснованияУслугДепозитария КАК ОснованияУслугДепозитария
	|ГДЕ
	|	ОснованияУслугДепозитария.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выбрать();
	КонецЕсли;
	
КонецФункции

// Снимает признак начислить комиссию депо у оснований услуги
//
// Параметры:
//  УслугиДепозитария	 - ДокументСсылка.УслугиДепозитария
//
Процедура СнятьПризнакНачислитьКомиссиюДепоУОснований(УслугиДепозитария) Экспорт
	
	ОснованияУслуги = ДанныеОснованийУслуги(УслугиДепозитария);
	
	Если Не ЗначениеЗаполнено(ОснованияУслуги) Тогда
		Возврат;
	КонецЕсли;
	
	Пока ОснованияУслуги.Следующий() Цикл
		РегистрыСведений.ДокументыКНачислениюКомиссииДепо.Удалить(ОснованияУслуги.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает признак начислить комиссию депо у оснований услуги
//
// Параметры:
//  УслугиДепозитария	 - ДокументСсылка.УслугиДепозитария
//
Процедура УстановитьПризнакНачислитьКомиссиюДепоУОснований(УслугиДепозитария) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОснованияУслугДепозитария.Основание КАК Ссылка
	|ИЗ
	|	РегистрСведений.ОснованияУслугДепозитария КАК ОснованияУслугДепозитария
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыКНачислениюКомиссииДепо КАК ДокументыКНачислениюКомиссииДепо
	|		ПО ОснованияУслугДепозитария.Основание = ДокументыКНачислениюКомиссииДепо.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияУслугДепозитария КАК ПрочиеПроведенныеУслугиДепозитария
	|		ПО ОснованияУслугДепозитария.Основание = ПрочиеПроведенныеУслугиДепозитария.Основание
	|			И (ПрочиеПроведенныеУслугиДепозитария.УслугиДепозитария <> ОснованияУслугДепозитария.УслугиДепозитария)
	|			И (ПрочиеПроведенныеУслугиДепозитария.УслугиДепозитария.Проведен)
	|ГДЕ
	|	ОснованияУслугДепозитария.УслугиДепозитария = &УслугиДепозитария
	|	И ДокументыКНачислениюКомиссииДепо.Документ ЕСТЬ NULL
	|	И ПрочиеПроведенныеУслугиДепозитария.УслугиДепозитария ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("УслугиДепозитария", УслугиДепозитария);
	ДокументыДляУстановкиПризнака = Запрос.Выполнить().Выбрать();
	
	Пока ДокументыДляУстановкиПризнака.Следующий() Цикл
		РегистрыСведений.ДокументыКНачислениюКомиссииДепо.Добавить(ДокументыДляУстановкиПризнака.Ссылка);
	КонецЦикла;
	
КонецПроцедуры


