#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

&Вместо("ПроверитьЛимиты")
Процедура FO_LimitProfile_ПроверитьЛимиты(Запрос, Параметры)

	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПродолжитьВызов(Запрос, Параметры);
	FO_LimitProfile_Замеры.Добавить("ВариантыПроверкиПороговЛимитов.ПроверитьЛимиты", ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт);

КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

&Вместо("НекаяВременнаяТаблица")
Процедура FO_LimitProfile_НекаяВременнаяТаблица(Запрос, Параметры)

	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПродолжитьВызов(Запрос, Параметры);
	FO_LimitProfile_Замеры.Добавить("ВариантыПроверкиПороговЛимитов.НекаяВременнаяТаблица", ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт);

КонецПроцедуры

&Вместо("ДеревоЗначенийПоЭмитентам")
Функция FO_LimitProfile_ДеревоЗначенийПоЭмитентам(Запрос, Параметры)

	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Результат = ПродолжитьВызов(Запрос, Параметры);
	FO_LimitProfile_Замеры.Добавить("ВариантыПроверкиПороговЛимитов.ДеревоЗначенийПоЭмитентам", ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт);
	Возврат Результат;

КонецФункции

&Вместо("ДополненныйТекстЗапроса")
Функция FO_LimitProfile_ДополненныйТекстЗапроса(ТекстЗапроса, Параметры)

	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Результат = ПродолжитьВызов(ТекстЗапроса, Параметры);
	FO_LimitProfile_Замеры.Добавить("ВариантыПроверкиПороговЛимитов.ДополненныйТекстЗапроса", ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт);
	Возврат Результат;

КонецФункции

&Вместо("ОбработатьДерево")
Процедура FO_LimitProfile_ОбработатьДерево(Параметры, Дерево)

	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПродолжитьВызов(Параметры, Дерево);
	FO_LimitProfile_Замеры.Добавить("ВариантыПроверкиПороговЛимитов.ОбработатьДерево", ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
