Перем ТаблицаЗначенийСчета;

Функция ЗаголовокОтчета() Экспорт
	Возврат  "Количество счетов депо ";
КонецФункции

//Функция возвращет количество счетов депо за период.
//
//Результат:
//		ТаблицаЗначений
//
Функция КоличествоСчетовДепоЗаПериод()  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетаДепо.Владелец.ЮрФизЛицо КАК ВладелецЮрФизЛицо,
	               |	СчетаДепо.Владелец.Резидент КАК ВладелецРезидент,
	               |	СчетаДепо.Владелец.ФизЛицо.ПБОЮЛ КАК ВладелецФизЛицоПБОЮЛ,
	               |	СчетаДепо.Ссылка КАК СчетаНачало,
	               |	NULL КАК СчетаКонец
	               |ИЗ
	               |	Справочник.СчетаДепо КАК СчетаДепо
	               |ГДЕ
	               |	СчетаДепо.ПризнакСчетаДепо = &ПризнакСчетаДепо
	               |	И СчетаДепо.ДатаОткрытияСчета <= &НачПериода
	               |	И ((СчетаДепо.ДатаЗакрытияСчета > &НачПериода
				   |	И СчетаДепо.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Закрыт))
				   |	ИЛИ СчетаДепо.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Открыт))
	               |	И НЕ СчетаДепо.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СчетаДепо.Владелец.ЮрФизЛицо,
	               |	СчетаДепо.Владелец.Резидент,
	               |	СчетаДепо.Владелец.ФизЛицо.ПБОЮЛ,
	               |	NULL,
	               |	СчетаДепо.Ссылка
	               |ИЗ
	               |	Справочник.СчетаДепо КАК СчетаДепо
	               |ГДЕ
	               |	СчетаДепо.ПризнакСчетаДепо = &ПризнакСчетаДепо
	               |	И СчетаДепо.ДатаОткрытияСчета <= &КонПериода
	               |	И ((СчетаДепо.ДатаЗакрытияСчета > &КонПериода
				   |	И СчетаДепо.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Закрыт))
				   |	ИЛИ СчетаДепо.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Открыт))
	               |	И НЕ СчетаДепо.ПометкаУдаления
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетаНачало),
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетаКонец)
	               |ПО
	               |	ВладелецЮрФизЛицо,
	               |	ВладелецРезидент,
	               |	ВладелецФизЛицоПБОЮЛ";
				   
	Запрос.УстановитьПараметр("ПризнакСчетаДепо", Перечисления.ПризнакиСчетаДепо.СчетДепонента);			   
	Запрос.УстановитьПараметр("НачПериода",НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("КонПериода",КонецДня(КонПериода));
	
	Результат = Запрос.Выполнить();	
	
	Возврат Результат;	
	
КонецФункции

//Функцмя возвращает количество счетов депо МХ за период.
//
//Результат:
//		ТаблицаЗначений
//
Функция КоличествоСчетовДепоМХЗаПериод() Экспорт
	
Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетаДепоМХ.Ссылка,
	               |	СчетаДепоМХ.ДатаОткрытияСчета,
	               |	""СчетМХ"" КАК СчетМХ,
	               |	ВЫБОР
	               |		КОГДА СчетаДепоМХ.ДатаОткрытияСчета <= &НачДата
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КолНач,
	               |	ВЫБОР
	               |		КОГДА СчетаДепоМХ.ДатаОткрытияСчета <= &КонДата
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КолКон
	               |ИЗ
	               |	Справочник.СчетаДепоМХ КАК СчетаДепоМХ
	               |ГДЕ
	               |	СчетаДепоМХ.СтатусСчетаДепо = &СтатусСчетаДепо
	               |ИТОГИ
	               |	СУММА(КолНач),
	               |	СУММА(КолКон)
	               |ПО
	               |	СчетМХ";
	
	Запрос.УстановитьПараметр("СтатусСчетаДепо",Перечисления.СтатусыСчетовДепо.Открыт);
	Запрос.УстановитьПараметр("КонДата",КонПериода);
	Запрос.УстановитьПараметр("НачДата",НачПериода);
	
	Результат = Запрос.Выполнить();

	Возврат Результат;
	
КонецФункции

Процедура Сформировать(ТабличныйДокумент) Экспорт
	
	РезультатЗапроса = КоличествоСчетовДепоЗаПериод();
	ТаблицаЗначенийСчета.Очистить();
	Дерево = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВеткаФизик		=	Дерево.Строки.Найти(Перечисления.ЮрФизЛицо.ФизЛицо,"ВладелецЮрФизЛицо",Истина);
	ВеткаПБОЮЛ		=	Дерево.Строки.Найти(Перечисления.ЮрФизЛицо.ПустаяСсылка(),"ВладелецЮрФизЛицо",Истина);
	ВеткаЮрик		=	Дерево.Строки.Найти(Перечисления.ЮрФизЛицо.ЮрЛицо,"ВладелецЮрФизЛицо",Истина);
	
	Если ВеткаФизик = Неопределено Тогда
		КоличествоСчетовФизиковРезидентов(0,0);
		КоличествоСчетовФизиковНеРезидентов(0,0);
	Иначе 	
		
		ВеткаФизикРезидент		=	ВеткаФизик.Строки.Найти(Ложь,"ВладелецРезидент",Ложь);
		Если ВеткаФизикРезидент = Неопределено  Тогда
			КоличествоСчетовФизиковРезидентов(0,0);
		Иначе					
			КоличествоСчетовФизиковРезидентов(ВеткаФизикРезидент.СчетаНачало,ВеткаФизикРезидент.СчетаКонец);			  		
		КонецЕсли; 
		
		ВеткаФизикНеРезидент	=	ВеткаФизик.Строки.Найти(Истина,"ВладелецРезидент",Истина);
		Если ВеткаФизикНеРезидент = Неопределено Тогда
			КоличествоСчетовФизиковНеРезидентов(0,0);
		Иначе	
			КоличествоСчетовФизиковНеРезидентов(ВеткаФизикНеРезидент.СчетаНачало,ВеткаФизикНеРезидент.СчетаКонец);
		КонецЕсли; 
		
	КонецЕсли;
	//
	Если ВеткаЮрик = Неопределено Тогда
		КоличествоСчетовЮриковРезидентов(0,0);
		КоличествоСчетовЮриковНеРезидентов(0,0);
	Иначе	
		
		ВеткаЮрикРезидент		=	ВеткаЮрик.Строки.Найти(Ложь,"ВладелецРезидент",Ложь);
		Если ВеткаФизикРезидент = Неопределено  Тогда
			КоличествоСчетовЮриковРезидентов(0,0);
		Иначе					
			КоличествоСчетовЮриковРезидентов(ВеткаЮрикРезидент.СчетаНачало,ВеткаЮрикРезидент.СчетаКонец);			  		
		КонецЕсли; 
		
		ВеткаЮрикНеРезидент	=	ВеткаЮрик.Строки.Найти(Истина,"ВладелецРезидент",Истина);
		Если ВеткаЮрикНеРезидент = Неопределено Тогда
			КоличествоСчетовЮриковНеРезидентов(0,0);
		Иначе	
			КоличествоСчетовЮриковНеРезидентов(ВеткаЮрикНеРезидент.СчетаНачало,ВеткаЮрикНеРезидент.СчетаКонец);
		КонецЕсли; 
		
	КонецЕсли;
	//
	Если ВеткаПБОЮЛ = Неопределено Тогда
		КоличествоСчетовПБОЮЛРезидент(0,0);
		КоличествоСчетовПБОЮЛНеРезидент(0,0);
	Иначе	
		
		ВеткаПБОЮЛРезидент		=	ВеткаПБОЮЛ.Строки.Найти(Ложь,"ВладелецРезидент",Ложь);
		Если ВеткаПБОЮЛРезидент = Неопределено  Тогда
			КоличествоСчетовПБОЮЛРезидент(0,0);
		Иначе					
			КоличествоСчетовПБОЮЛРезидент(ВеткаПБОЮЛРезидент.СчетаНачало,ВеткаПБОЮЛРезидент.СчетаКонец);			  		
		КонецЕсли; 
		
		ВеткаПБОЮЛНеРезидент	=	ВеткаПБОЮЛ.Строки.Найти(Истина,"ВладелецРезидент",Истина);
		Если ВеткаПБОЮЛНеРезидент = Неопределено Тогда
			КоличествоСчетовПБОЮЛНеРезидент(0,0);
		Иначе	
			КоличествоСчетовПБОЮЛНеРезидент(ВеткаПБОЮЛНеРезидент.СчетаНачало,ВеткаПБОЮЛНеРезидент.СчетаКонец);
		КонецЕсли; 
		
	КонецЕсли;
	//Счета МХ;	
	КоличествоСчетовДепоМХ();
	//предварительная очистка табличного документа.
	ТабличныйДокумент.Очистить();
	Макет	=	ПолучитьМакет("Макет");	
	Шапка	=	Макет.ПолучитьОбласть("Шапка");
	
	Если НачПериода = '00010101000000' И КонПериода = '00010101000000' Тогда
		
		ОписаниеПериода     = "Период: без ограничения.";
		
	Иначе
		
		Если НачПериода = '00010101000000' ИЛИ КонПериода = '00010101000000' Тогда
			ОписаниеПериода = "Период: " + Формат(НачПериода, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""") 
			+ " - "      + Формат(КонПериода, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""");
		Иначе
			ОписаниеПериода = "Период: " + ПредставлениеПериода(НачалоДня(НачПериода), КонецДня(КонПериода), "ФП = Истина");
		КонецЕсли;
		
	КонецЕсли;
	Шапка.Параметры.ОписаниеПериода  =  ОписаниеПериода;
	ТабличныйДокумент.Вывести(Шапка);		
	
	Строка  = Макет.ПолучитьОбласть("Строка");
	Для каждого ТекущаяСтрока Из ТаблицаЗначенийСчета Цикл
		
		Строка.Параметры.Заполнить(ТекущаяСтрока);
		ТабличныйДокумент.Вывести(Строка);
		
	КонецЦикла; 
	
	ТабличныйДокумент.ОтображатьСетку 		= Ложь;
	//ТабличныйДокумент.Защита 				= Истина;   //Не возможно сохранять в файл
	ТабличныйДокумент.ТолькоПросмотр 		= Истина;
	ТабличныйДокумент.ОтображатьЗаголовки 	= Ложь;
	
		
КонецПроцедуры 

Процедура КоличествоСчетовФизиковРезидентов(НачКол=0,КонКол=0)
	
	НоваяСтрока	=	ТаблицаЗначенийСчета.Добавить();
	НоваяСтрока.НПП         = 1;
	НоваяСтрока.СчетОтбор	= "Счета депо физических лиц - резидентов";
	НоваяСтрока.КолНач		= НачКол;	
	НоваяСтрока.КолКон		= КонКол;	
	
КонецПроцедуры	

//Процедура заполнения  ТаблицаЗначенийСчета по физикам.
//
Процедура КоличествоСчетовФизиковНеРезидентов(НачКол=0,КонКол=0)
	
	НоваяСтрока	=	ТаблицаЗначенийСчета.Добавить();
	НоваяСтрока.НПП         = 2;
	НоваяСтрока.СчетОтбор	= "Счета депо физических лиц - нерезидентов";
	НоваяСтрока.КолНач		= НачКол;	
	НоваяСтрока.КолКон		= КонКол;
	
КонецПроцедуры	

//Процедура заполнения  ТаблицаЗначенийСчета по юрикам.
//
Процедура КоличествоСчетовЮриковРезидентов(НачКол=0,КонКол=0)
	
	НоваяСтрока	=	ТаблицаЗначенийСчета.Добавить();
	НоваяСтрока.НПП         = 3;
	НоваяСтрока.СчетОтбор	= "Счета депо юридических лиц - резидентов";
	НоваяСтрока.КолНач		= НачКол;	
	НоваяСтрока.КолКон		= КонКол;	
	
КонецПроцедуры	

//Процедура заполнения  ТаблицаЗначенийСчета по юрикам.
//
Процедура КоличествоСчетовЮриковНеРезидентов(НачКол=0,КонКол=0)
	
	НоваяСтрока	=	ТаблицаЗначенийСчета.Добавить();
	НоваяСтрока.НПП         = 4;
	НоваяСтрока.СчетОтбор	= "Счета депо юридических лиц - нерезидентов";
	НоваяСтрока.КолНач		= НачКол;	
	НоваяСтрока.КолКон		= КонКол;
	
КонецПроцедуры	

//Процедура заполнения  ТаблицаЗначенийСчета по ПБОЮЛ.
//
Процедура КоличествоСчетовПБОЮЛРезидент(НачКол=0,КонКол=0)
	
	НоваяСтрока	=	ТаблицаЗначенийСчета.Добавить();
	НоваяСтрока.НПП         = 5;
	НоваяСтрока.СчетОтбор	= "Счета депо ПБОЮЛ - резидентов";
	НоваяСтрока.КолНач		= НачКол;	
	НоваяСтрока.КолКон		= КонКол;	
		
КонецПроцедуры	

//Процедура заполнения  ТаблицаЗначенийСчета по ПБОЮЛ.
//
Процедура КоличествоСчетовПБОЮЛНеРезидент(НачКол=0,КонКол=0)
	
	НоваяСтрока	=	ТаблицаЗначенийСчета.Добавить();
	НоваяСтрока.НПП         = 6;
	НоваяСтрока.СчетОтбор	= "Счета депо ПБОЮЛ - нерезидентов";
	НоваяСтрока.КолНач		= НачКол;	
	НоваяСтрока.КолКон		= КонКол;
	
КонецПроцедуры	

//Процедура заполнения ТаблицаЗначенийСчета по МХ
//
Процедура КоличествоСчетовДепоМХ()
	
	Результат = КоличествоСчетовДепоМХЗаПериод();
	
	Если НЕ Результат.Пустой() Тогда
		
		Дерево = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);	
		Для каждого ВеткаСчета Из Дерево.Строки Цикл
			
			НоваяСтрока	=	ТаблицаЗначенийСчета.Добавить();
			НоваяСтрока.НПП         = 7;
			НоваяСтрока.СчетОтбор	= "в т.ч. междепозитарные счета депо";
			НоваяСтрока.КолНач		= ВеткаСчета.КолНач;	
			НоваяСтрока.КолКон		= ВеткаСчета.КолКон;
			
		КонецЦикла;
		
	КонецЕсли; 
	    	
КонецПроцедуры
/////////////////////////////////

//////////////////////////////////////////////////////////////////////////////// 
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 
//

//таблица значений для вывода остатков по счету депо.
ТаблицаЗначенийСчета = Новый ТаблицаЗначений;
ТаблицаЗначенийСчета.Колонки.Добавить("НПП"); 
ТаблицаЗначенийСчета.Колонки.Добавить("СчетОтбор"); 
ТаблицаЗначенийСчета.Колонки.Добавить("КолНач"); 
ТаблицаЗначенийСчета.Колонки.Добавить("КолКон");

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
