&НаКлиенте
Процедура ВыборФайлаДляПрикрепления(Отказ)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла			= "";
	ДиалогОткрытияФайла.МножественныйВыбор		= Ложь;
	ДиалогОткрытияФайла.ПредварительныйПросмотр	= Истина;
	ДиалогОткрытияФайла.Заголовок				= "Выберите файл для прикрепления";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ПутьКФайлу	= ДиалогОткрытияФайла.ПолноеИмяФайла;
		// Поместим файл в хранилище для записи на севрере
		ПоместитьФайл(АдресФайла, ПутьКФайлу, , Ложь, УникальныйИдентификатор);
		
        ВыбФайл = Новый Файл(ПутьКФайлу);
		
		Объект.Наименование		= ВыбФайл.Имя;
		Объект.ИмяФайла			= ВыбФайл.ИмяБезРасширения;
		Объект.РасширениеФайла	= ВыбФайл.Расширение;
	Иначе
	    Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!""";
	    Предупреждение(НСтр(Текст));
		Отказ	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный				= ТекущийПользователь();
		Объект.ДатаСоздания					= ТекущаяДата();
		Объект.ДополнительныйПризнакФайла	= ПредопределенноеЗначение("Перечисление.ДополнительныеПризнакиФайлов.Прочее");
		
		ВыборФайлаДляПрикрепления(Отказ);
		
		СписокФормы		= ЭтаФорма.ВладелецФормы.Родитель.Список;
		ПолеСравнения	= СписокФормы.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Объект").Поле;
		
		Для Каждого ЭлементОтбора ИЗ СписокФормы.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = ПолеСравнения И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно И Не ЭлементОтбора.ПравоеЗначение.Пустая() Тогда
				Объект.Объект	= ЭлементОтбора.ПравоеЗначение;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//---
	Если Объект.Объект.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан владелец файла!!!", Отказ);
		Возврат;
	КонецЕсли;
	//---
	Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
		ТекущийОбъект.Данные	= Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайла));		
	КонецЕсли;
	// Отметим изменившего если это не новый
	Если Не Объект.Ссылка.Пустая() Тогда
		ТекущийОбъект.Изменил		= ПараметрыСеанса.ТекущийПользователь;
		ТекущийОбъект.ДатаИзменения	= ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФайл(Команда)
	Отказ	= Ложь;
	ВыборФайлаДляПрикрепления(Отказ);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущийПользователь()
	Возврат ПараметрыСеанса.ТекущийПользователь;	
КонецФункции

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	Данные = ДанныеПрисоединенногоФайла();
	ПолноеИмяФайла = ПолучитьИмяВременногоФайла(Объект.РасширениеФайла);
	Данные.Записать(ПолноеИмяФайла);
	ЗапуститьПриложение(ПолноеИмяФайла);
	
КонецПроцедуры

&НаСервере
Функция ДанныеПрисоединенногоФайла()
	
	ДанныеПрисоединенногоФайла = Объект.Ссылка.Данные.Получить();
	Возврат ДанныеПрисоединенногоФайла;
	
КонецФункции

&НаКлиенте
Процедура СохранитьФайл(Команда)
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохраненияФайла.ПолноеИмяФайла = "" + Объект.ИмяФайла;
	ДиалогСохраненияФайла.Фильтр = "(*" + Объект.РасширениеФайла + ")|*" + Объект.РасширениеФайла;
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
	ДиалогСохраненияФайла.Заголовок = "Выберете место для хранения";
	Если ДиалогСохраненияФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогСохраненияФайла.ПолноеИмяФайла;
		Данные = ДанныеПрисоединенногоФайла();
		Данные.Записать(ПутьКФайлу);
	КонецЕсли;
КонецПроцедуры
