
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборПоВладельцуСписка(СчетаДепо);
	УстановитьОтборПоВладельцуСписка(РазделыСчетаДепо);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	Если ТекущийКонтрагент = Элемент.ТекущаяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКонтрагент = Элемент.ТекущаяСтрока;
	УстановитьОтборПоВладельцуСписка(СчетаДепо, ТекущийКонтрагент);
	ОбновитьОтображениеДанных(Элементы.СчетаДепо);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаДепоПриАктивизацииСтроки(Элемент)

	Если ТекущийСчетДЕПО = Элемент.ТекущаяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийСчетДЕПО = Элемент.ТекущаяСтрока;
	УстановитьОтборПоВладельцуСписка(РазделыСчетаДепо, ТекущийСчетДЕПО);
	Элементы.РазделыСчетаДепо.Обновить();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоВладельцуСписка(ДинСписок, Владелец = Неопределено)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДинСписок, "Владелец", Владелец);
КонецПроцедуры 