
#Область ОписаниеПеременных

Перем Отказ;
Перем ЕстьПредупреждения;
Перем ОбъектНазначения;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид","ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", "Распространение правил с одного клиента на список клиентов");
	ПараметрыРегистрации.Вставить("Версия", "1.14");
	ПараметрыРегистрации.Вставить("БезопасныйРежим",Ложь);
	ПараметрыРегистрации.Вставить("Информация","Распространение правил с одного клиента на список клиентов");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "2.1.1.12");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд,"Распространение правил с одного клиента на список клиентов", "РаспространениеПравил", "ОткрытиеФормы");
	ДобавитьКоманду(ТаблицаКоманд,"Информация о портфелях, для которых отсутствует установка лимитов (в фоне)", "ФоновоеВыполнение", "ВызовСерверногоМетода");
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	// Настройки
	ДопОбработка = ПараметрыВыполненияКоманды.ДополнительнаяОбработкаСсылка;
	
	Если ИдентификаторКоманды <> "ФоновоеВыполнение" Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = ДопОбработка.ХранилищеНастроек;
	
	Если ТипЗнч(Настройки) = Тип("ХранилищеЗначения") Тогда
		Настройки = Настройки.Получить();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Настройки);
	
	ЕстьОшибки = Ложь;
	ЕстьПредупреждения = Ложь;
	ТекстСообщения = "";
	
	// IMAPPS-35924 ++
	//ТекущаяДата = ТекущаяДатаСеанса();
	//ДатаОкончания = НачалоДня(ТекущаяДата) + 9 *60 * 60; // 9:00:00 
	ДатаОкончания = ТекущаяДатаСеанса();
	// IMAPPS-35924 --
	ДатаНачала = ДатаОкончания - 24 * 60 * 60;
	
	Попытка
		НайтиПортфелиБезУстановокЛимитов(ДатаНачала, ДатаОкончания, КлассЛимитовКомплаенс, ТекстСообщения);
		
		Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда
			ТекстСообщения = "Ок";
		КонецЕсли;
		
	Исключение
		ЕстьОшибки = Истина;
		ДобавитьТекстСообщения(ТекстСообщения, ОписаниеОшибки());
	КонецПопытки;
	
	Если ЕстьОшибки ИЛИ ЕстьПредупреждения Тогда // IMAPPS-35924 
		Тема = "Аванкор ФО: Информация о портфелях, для которых отсутствует установка лимитов с " + ДатаНачала + " по " + ДатаОкончания;
		РассылкаСообщенияПоУстановкам(
			НастройкаРассылкиКомплаенс,
			Тема,
			ТекстСообщения,
			ЕстьОшибки,
			ЕстьПредупреждения
		);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьРаспространение(ПараметрыВыполнения, АдресХранилища) Экспорт
	
	//Путь = "\\corp\Applications\VTBAM\1C\test\svc_im_avancore_uat\asharunov\внРаспространениеПравилСОдногоКлиентаНаСписокКлиентов.epf";
	//Обр = ВнешниеОбработки.Создать(Путь, Ложь);
	//ЗаполнитьЗначенияСвойств(Обр, ЭтотОбъект);
	//Обр.ВыполнитьРаспространение(ПараметрыВыполнения, АдресХранилища);
	//Возврат;
	
	ДопОбработка = ПараметрыВыполнения.ДополнительнаяОбработкаСсылка;
	Источник = ПараметрыВыполнения.Источник;
	ИдентификаторПроцесса = ПараметрыВыполнения.ИдентификаторПроцесса;
	ИдентификаторКоманды = ПараметрыВыполнения.ИдентификаторКоманды;
	
	Если ИдентификаторКоманды <> "ФоновоеВыполнение" Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = ДопОбработка.ХранилищеНастроек;
	
	Если ТипЗнч(Настройки) = Тип("ХранилищеЗначения") Тогда
		Настройки = Настройки.Получить();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Настройки);
	
	Если ИдентификаторПроцесса = "ЗаписьУстановкиЛимитов" Тогда
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.Ссылка, "КлассЛимита, ОбъектНазначения");
		ОбъектНазначения = РеквизитыДокумента.ОбъектНазначения;
		
		Если РеквизитыДокумента.КлассЛимита = КлассЛимитовРиски Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДополнительныеСведения.Значение КАК ЭталонныйПортфель
			|ИЗ
			|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			|ГДЕ
			|	ДополнительныеСведения.Объект = &Объект
			|	И ДополнительныеСведения.Свойство = &Свойство";
			
			Запрос.УстановитьПараметр("Объект", Источник.Ссылка);
			Запрос.УстановитьПараметр("Свойство", Эталонный_портфель_лимитов);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				Если ВыборкаДетальныеЗаписи.ЭталонныйПортфель = РеквизитыДокумента.ОбъектНазначения Тогда
					ПерезаполнитьУстановкиЛимитов(Источник.Ссылка, ВыборкаДетальныеЗаписи.ЭталонныйПортфель);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИдентификаторПроцесса = "ЗаписьДопСведений" Тогда
		
		Если ТипЗнч(Источник.Объект) <> Тип("СправочникСсылка.Портфели") Тогда
			Возврат;
		КонецЕсли;
		ОбъектНазначения = Источник.Объект;
		Если Источник.Свойство = Эталонный_портфель_лимитов_комплаенс Тогда
			СоздатьУстановкиЛимитов(Источник.Объект, Дата_распространения_правил_комплаенс, Эталонный_портфель_лимитов_комплаенс, КлассЛимитовКомплаенс, Источник.Значение, НастройкаРассылкиКомплаенс);
		ИначеЕсли Источник.Свойство = Эталонный_портфель_лимитов_риски Тогда
			СоздатьУстановкиЛимитов(Источник.Объект, Дата_распространения_правил_риски, Эталонный_портфель_лимитов_риски, КлассЛимитовРиски, Источник.Значение, НастройкаРассылкиРиски);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьРаспространениеПравилПослеОбмена() Экспорт
	
	//Путь = "\\corp\Applications\VTBAM\1C\test\svc_im_avancore_uat\asharunov\внРаспространениеПравилСОдногоКлиентаНаСписокКлиентов.epf";
	//Обр = ВнешниеОбработки.Создать(Путь, Ложь);
	//Обр.ВыполнитьРаспространениеПравилПослеОбмена();
	//Возврат;
	
	СсылкаНаОбработку = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Распространение правил с одного клиента на список клиентов", Истина);
	
	Настройки = СсылкаНаОбработку.ХранилищеНастроек;
	
	Если ТипЗнч(Настройки) = Тип("ХранилищеЗначения") Тогда
		Настройки = Настройки.Получить();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Настройки);
	
	списКлассы = новый Массив;
	элКласс = новый Структура;
	элКласс.Вставить("Представление", "комплаенс");
	элКласс.Вставить("КлассЛимитов", КлассЛимитовКомплаенс);
	элКласс.Вставить("СвойствоЭталонныйПортфельЛимитов", Эталонный_портфель_лимитов_комплаенс);
	элКласс.Вставить("СвойствоДатаАвтоустановкиЛимитов", ДатаАвтоустановкиЛимитовКомплаенс);
	элКласс.Вставить("ВнешнийКодЭталонногоПортфеля", ВнешнийКодЭталонногоПортфеляКомплаенс);
	элКласс.Вставить("ЛимитыЗаведены", ЛимитыЗаведеныКомплаенс);
	элКласс.Вставить("НастройкаРассылки", НастройкаРассылкиКомплаенс);
	элКласс.Вставить("СписокТиповКлиентов", СписокТиповКлиентовКомплаенс);
	списКлассы.Добавить(элКласс);
	
	Если ЭтоБазаРозничногоДУ Тогда
	
		элКласс = новый Структура;
		элКласс.Вставить("Представление", "риски");
		элКласс.Вставить("КлассЛимитов", КлассЛимитовРиски);
		элКласс.Вставить("СвойствоЭталонныйПортфельЛимитов", Эталонный_портфель_лимитов_риски);
		элКласс.Вставить("СвойствоДатаАвтоустановкиЛимитов", ДатаАвтоустановкиЛимитовРиски);
		элКласс.Вставить("ВнешнийКодЭталонногоПортфеля", ВнешнийКодЭталонногоПортфеляРиски);
		элКласс.Вставить("ЛимитыЗаведены", ЛимитыЗаведеныРиски);
		элКласс.Вставить("НастройкаРассылки", НастройкаРассылкиРиски);
		элКласс.Вставить("СписокТиповКлиентов", СписокТиповКлиентовРиски);
		списКлассы.Добавить(элКласс);
		
	КонецЕсли;
	
	Для каждого элКласс Из списКлассы Цикл
		
		Если ЭтоБазаРозничногоДУ Тогда
			ТЗНовыхКлиентов = НайтиНовыхКлиентовРозничногоДУ(элКласс.КлассЛимитов, элКласс.СвойствоДатаАвтоустановкиЛимитов,
				элКласс.ВнешнийКодЭталонногоПортфеля, элКласс.ЛимитыЗаведены, элКласс.СписокТиповКлиентов);
		Иначе
			ТЗНовыхКлиентов = НайтиНовыхКлиентов(элКласс.КлассЛимитов, элКласс.СвойствоДатаАвтоустановкиЛимитов,
				элКласс.ЛимитыЗаведены, элКласс.СписокТиповКлиентов);
		КонецЕсли;
		
		НужнаРассылка = Ложь;
		ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
		ТекстовыйЛог.Очистить();
		ЕстьПредупреждения = Ложь;
		ЕстьПортфелиБезАвтоустановки = Ложь;
		
		МассивСообщений1 = Новый Массив;
		МассивСообщений2 = Новый Массив;
		МассивСообщений3 = Новый Массив;
		МассивСообщений4 = Новый Массив;
		МассивСообщений5 = Новый Массив;
		
		Для каждого ТекСтрока Из ТЗНовыхКлиентов Цикл
			Если ЭтоБазаРозничногоДУ Тогда
				
				Если ТекСтрока.ЕстьУстановкаЛимитов Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ТекСтрока.ВнешнийКодПортфеля) Тогда
					Если ЗначениеЗаполнено(ТекСтрока.ЭталонныйПортфель) Тогда
						Если ЗначениеЗаполнено(ТекСтрока.ЭталоннаяУстановкаЛимитов) Тогда
							УстановитьЭталонныйПортфельЛимитов(ТекСтрока.Портфель, ТекСтрока.ЭталонныйПортфель, элКласс.СвойствоЭталонныйПортфельЛимитов);
							УстановитьДатуАвтоустановкиЛимитов(ТекСтрока.Портфель, ТекущаяДата, элКласс.СвойствоДатаАвтоустановкиЛимитов);
							НужнаРассылка = Истина;
							МассивСообщений1.Добавить("На портфель """ + ТекСтрока.Портфель + """ выполнено распространение правил с эталонного портфеля (" + элКласс.Представление + ") """
								+ ТекСтрока.ЭталонныйПортфель + """.");
						Иначе
							НужнаРассылка = Истина;
							МассивСообщений2.Добавить("По портфелю """ + ТекСтрока.Портфель + """ - для эталонного портфеля """ + ТекСтрока.ЭталонныйПортфель
								+ """ не найден документ Установка лимитов (" + элКласс.Представление + ").");
							ЕстьПортфелиБезАвтоустановки = Истина;
						КонецЕсли;
					Иначе
						НужнаРассылка = Истина;
						МассивСообщений3.Добавить("По портфелю """ + ТекСтрока.Портфель + """ не найден эталонный портфель (" + элКласс.Представление + ") по внешнему коду """
							+ ТекСтрока.ВнешнийКодПортфеля + """.");
						ЕстьПортфелиБезАвтоустановки = Истина;
					КонецЕсли;
				Иначе
					МассивСообщений4.Добавить("По портфелю """ + ТекСтрока.Портфель + """ не заполнен ""Внешний код эталонного портфеля (" + элКласс.Представление + ")" + """.");
					Если ТекСтрока.ЛимитыЗаведеныКомплаенс = Ложь Тогда
						МассивСообщений4.Добавить("По портфелю """ + ТекСтрока.Портфель + """ не заполнено ""Лимиты заведены_" + элКласс.Представление + """.");
					КонецЕсли;
					НужнаРассылка = Истина;
					ЕстьПортфелиБезАвтоустановки = Истина;
				КонецЕсли;
				
			Иначе
				Если Не ЗначениеЗаполнено(ТекСтрока.Стратегия) Тогда
					НужнаРассылка = Истина;
					МассивСообщений2.Добавить("У портфеля """ + ТекСтрока.Портфель + """ не заполнен реквизит ""Стратегия"".");
					ЕстьПортфелиБезАвтоустановки = Истина;
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекСтрока.ЭталонныйПортфель) Тогда
					Если ЗначениеЗаполнено(ТекСтрока.ЭталоннаяУстановкаЛимитов) Тогда
						Если ТекСтрока.ПрименятьАвтосозданиеУстановокЛимитов Тогда
							УстановитьВнешнийКодЭталонногоПортфеля(ТекСтрока.Портфель, ТекСтрока.ВнешнийКодПортфеля, элКласс.ВнешнийКодЭталонногоПортфеля);
							УстановитьЭталонныйПортфельЛимитов(ТекСтрока.Портфель, ТекСтрока.ЭталонныйПортфель, элКласс.СвойствоЭталонныйПортфельЛимитов);
							УстановитьДатуАвтоустановкиЛимитов(ТекСтрока.Портфель, ТекущаяДата, элКласс.СвойствоДатаАвтоустановкиЛимитов);
							НужнаРассылка = Истина;
							МассивСообщений1.Добавить("На портфель """ + ТекСтрока.Портфель + """ выполнено распространение правил с эталонного портфеля (" + элКласс.Представление + ") """
								+ ТекСтрока.ЭталонныйПортфель + """.");
						Иначе
							НужнаРассылка = Истина;
							МассивСообщений5.Добавить("По портфелю """ + ТекСтрока.Портфель + """ отключено Автосоздание установок лимитов по стратегии """
								+ ТекСтрока.Стратегия + """.");
							ЕстьПортфелиБезАвтоустановки = Истина;
						КонецЕсли;
					Иначе
						НужнаРассылка = Истина;
						МассивСообщений4.Добавить("По портфелю """ + ТекСтрока.Портфель + """ - для эталонного портфеля """ + ТекСтрока.ЭталонныйПортфель
							+ """ не найден документ Установка лимитов (" + элКласс.Представление + ").");
						ЕстьПортфелиБезАвтоустановки = Истина;
					КонецЕсли;
				Иначе
					НужнаРассылка = Истина;
					МассивСообщений3.Добавить("По портфелю """ + ТекСтрока.Портфель + """ не найден эталонный портфель (" + элКласс.Представление + ") по стратегии """
						+ ТекСтрока.Стратегия + """.");
					ЕстьПортфелиБезАвтоустановки = Истина;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		ТекстСообщения = "";
		
		Если МассивСообщений5.Количество() > 0 Тогда
			Для каждого ТекСтрока Из МассивСообщений5 Цикл
				ТекстСообщения = ТекстСообщения + ТекСтрока + Символы.ПС;
			КонецЦикла;
			ТекстСообщения = ТекстСообщения + Символы.ПС;
		КонецЕсли;
		
		Если МассивСообщений1.Количество() > 0 Тогда
			Для каждого ТекСтрока Из МассивСообщений1 Цикл
				ТекстСообщения = ТекстСообщения + ТекСтрока + Символы.ПС;
			КонецЦикла;
			ТекстСообщения = ТекстСообщения + Символы.ПС;
		КонецЕсли;
		
		Если МассивСообщений2.Количество() > 0 Тогда
			Для каждого ТекСтрока Из МассивСообщений2 Цикл
				ТекстСообщения = ТекстСообщения + ТекСтрока + Символы.ПС;
			КонецЦикла;
			ТекстСообщения = ТекстСообщения + Символы.ПС;
		КонецЕсли;
		
		Если МассивСообщений3.Количество() > 0 Тогда
			Для каждого ТекСтрока Из МассивСообщений3 Цикл
				ТекстСообщения = ТекстСообщения + ТекСтрока + Символы.ПС;
			КонецЦикла;
			ТекстСообщения = ТекстСообщения + Символы.ПС;
		КонецЕсли;
		
		Для каждого ТекСтрока Из МассивСообщений4 Цикл
			ТекстСообщения = ТекстСообщения + ТекСтрока + Символы.ПС;
		КонецЦикла;
		
		Если ЕстьПортфелиБезАвтоустановки = Истина Тогда
			ЕстьПредупреждения = Истина;
		КонецЕсли;
		
		ТекстовыйЛог.ДобавитьСтроку(ТекстСообщения);
		
		Если НужнаРассылка = Истина Тогда
			РассылкаСообщения(элКласс.НастройкаРассылки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура ПерезаполнитьУстановкиЛимитов(УстановкаЛимитов, ЭталонныйПортфель)
	
	Дата = ТекущаяДатаСеанса();
	ТекстовыйЛог.Очистить();
	ЛогПорогов.Очистить();
	
	ТекстовыйЛог.ДобавитьСтроку(КлассЛимитовРиски);
	ТекстовыйЛог.ДобавитьСтроку(СтрШаблон("[%1] Начало обработки", Дата));
	ТекстовыйЛог.ДобавитьСтроку(СтрШаблон("Перезаполнение текуших установок лимитов по эталонному портфелю ""%1""", ЭталонныйПортфель));
	
	Отказ = Ложь;
	ЕстьПредупреждения = Ложь;
	ЕстьДанные = Ложь;
	ВыводитьПорогиВРассылку = Ложь;
	
	Макет = ПолучитьМакет("Пороги");
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	
	ЛогПорогов.Вывести(ОблШапка);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаЛимитовЛимиты.Лимит КАК Лимит,
	|	УстановкаЛимитовЛимиты.НастройкиЛимита КАК НастройкиЛимита,
	|	УстановкаЛимитовЛимиты.НастройкиУстановлены КАК НастройкиУстановлены
	|ПОМЕСТИТЬ ЭталоннаяУстановкаЛимитов
	|ИЗ
	|	Документ.УстановкаЛимитов.Лимиты КАК УстановкаЛимитовЛимиты
	|ГДЕ
	|	УстановкаЛимитовЛимиты.Ссылка = &Ссылка
	|	И УстановкаЛимитовЛимиты.Ссылка.Проведен
	|	И НЕ УстановкаЛимитовЛимиты.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭталоннаяУстановкаЛимитов.Лимит КАК Лимит,
	|	ЭталоннаяУстановкаЛимитов.НастройкиЛимита КАК НастройкиЛимита,
	|	ПРЕДСТАВЛЕНИЕ(ЭталоннаяУстановкаЛимитов.Лимит) КАК ЛимитПредставление,
	|	ЭталоннаяУстановкаЛимитов.НастройкиУстановлены КАК НастройкиУстановлены
	|ИЗ
	|	ЭталоннаяУстановкаЛимитов КАК ЭталоннаяУстановкаЛимитов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭталоннаяУстановкаЛимитов.Лимит.Наименование";
	
	Запрос.УстановитьПараметр("Ссылка", УстановкаЛимитов);
	
	ЭталонныеЛимиты = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Объект КАК Портфель
	|ПОМЕСТИТЬ ПортфелиПоСтратегии
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство = &Свойство
	|	И ДополнительныеСведения.Значение = &Значение
	|	И ДополнительныеСведения.Объект <> &Портфель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УстановкаЛимитов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ УстановкиЛимитовПоСтратегии
	|ИЗ
	|	Документ.УстановкаЛимитов КАК УстановкаЛимитов
	|ГДЕ
	|	УстановкаЛимитов.ОбъектНазначения В
	|			(ВЫБРАТЬ
	|				ПортфелиПоСтратегии.Портфель КАК Портфель
	|			ИЗ
	|				ПортфелиПоСтратегии КАК ПортфелиПоСтратегии)
	|	И УстановкаЛимитов.КлассЛимита = &КлассЛимита
	|	И УстановкаЛимитов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУстановкиЛимитов.ПоПортфелю)
	|	И УстановкаЛимитов.Проведен
	|	И УстановкаЛимитов.Дата < &Дата
	|	И (УстановкаЛимитов.ДатаОкончанияДействия >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|			ИЛИ УстановкаЛимитов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПортфелиПоСтратегии.Портфель КАК Портфель,
	|	УстановкиЛимитовПоСтратегии.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ПортфелиПоСтратегии.Портфель) КАК ПортфельПредставление,
	|	ПРЕДСТАВЛЕНИЕ(УстановкиЛимитовПоСтратегии.Ссылка) КАК СтратегияПредставление
	|ИЗ
	|	ПортфелиПоСтратегии КАК ПортфелиПоСтратегии
	|		ЛЕВОЕ СОЕДИНЕНИЕ УстановкиЛимитовПоСтратегии КАК УстановкиЛимитовПоСтратегии
	|		ПО ПортфелиПоСтратегии.Портфель = УстановкиЛимитовПоСтратегии.Ссылка.ОбъектНазначения
	|ГДЕ
	|	УстановкиЛимитовПоСтратегии.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Значение", ЭталонныйПортфель);
	Запрос.УстановитьПараметр("Свойство", Эталонный_портфель_лимитов_риски);
	Запрос.УстановитьПараметр("КлассЛимита", КлассЛимитовРиски);
	Запрос.УстановитьПараметр("Портфель", ЭталонныйПортфель);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЕстьДанные = Истина;
		
		УстановкаЛимитовОбъект = Документы.УстановкаЛимитов.СоздатьДокумент();
		УстановкаЛимитовОбъект.Дата = Дата;
		УстановкаЛимитовОбъект.ОбъектНазначения = Выборка.Портфель;
		УстановкаЛимитовОбъект.ВидОперации = Перечисления.ВидыОперацийУстановкиЛимитов.ПоПортфелю;
		УстановкаЛимитовОбъект.КлассЛимита = КлассЛимитовРиски;
		УстановкаЛимитовОбъект.Лимиты.Загрузить(ЭталонныеЛимиты);
		
		ТекстовыйЛог.ДобавитьСтроку("	Портфель: """ + Выборка.Портфель + """:");
		
		Попытка
			УстановкаЛимитовОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ТекстовыйЛог.ДобавитьСтроку("	Создан и проведен документ """ + УстановкаЛимитовОбъект.Ссылка + ":");
		Исключение
			Отказ = Истина;
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстовыйЛог.ДобавитьСтроку("	При проведении документа """ + УстановкаЛимитовОбъект.Ссылка + """ возникла следующая ошибка:");
			ТекстовыйЛог.ДобавитьСтроку("		" + ТекстОшибки);
			Попытка
				УстановкаЛимитовОбъект.Записать(РежимЗаписиДокумента.Запись);
				ТекстовыйЛог.ДобавитьСтроку("	Документ """ + УстановкаЛимитовОбъект.Ссылка + """ записан");
			Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстовыйЛог.ДобавитьСтроку("	При записи документа """ + УстановкаЛимитовОбъект.Ссылка + """ возникла следующая ошибка:");
				ТекстовыйЛог.ДобавитьСтроку("		" + ТекстОшибки);
				Продолжить;
			КонецПопытки;
		КонецПопытки;
		
		Для каждого ТекЛимит Из ЭталонныеЛимиты Цикл
			ТекстовыйЛог.ДобавитьСтроку("		Добавлен лимит """ + ТекЛимит.ЛимитПредставление);
		КонецЦикла;
		
		ТаблицаПорогов = ПолучитьПорогиЛимитовЭталонногоПортфеля(ЭталонныйПортфель, Выборка.Портфель, ЭталонныеЛимиты.ВыгрузитьКолонку("Лимит"));
		
		Если ТаблицаПорогов.Количество() = 0 Тогда
			ТекстовыйЛог.ДобавитьСтроку("	У эталонного портфеля отсутствуют пороги по лимитам");
		Иначе
			
			Для Каждого ТекПорог Из ТаблицаПорогов Цикл
				
				Если ТекПорог.ДействующийПорогОтсутствует = Истина Тогда
					НаборЗаписей = РегистрыСведений.ПорогиЛимитов.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Портфель.Установить(Выборка.Портфель);
					НаборЗаписей.Отбор.Лимит.Установить(ТекПорог.Лимит);
					
					Запись = НаборЗаписей.Добавить();
					Запись.Период = Дата;
					Запись.Портфель = Выборка.Портфель;
					Запись.Лимит = ТекПорог.Лимит;
					Запись.НастройкаПороговДляПроверкиЛимитов = ТекПорог.НастройкаПороговДляПроверкиЛимитов;
					
					НаборЗаписей.Записать(Ложь);
				КонецЕсли;
				
				ОблСтрока = Макет.ПолучитьОбласть("Строка");
				ОблСтрока.Параметры.ЭталонныйПортфель = ЭталонныйПортфель;
				ОблСтрока.Параметры.КодСтратегии = ЭталонныйПортфель.Стратегия.Код;
				ОблСтрока.Параметры.Стратегия = ЭталонныйПортфель.Стратегия;
				ОблСтрока.Параметры.Портфель = Выборка.ПортфельПредставление;
				ОблСтрока.Параметры.Лимит = ТекПорог.Лимит;
				ОблСтрока.Параметры.ИспользоватьРасширеннуюУстановкуПорогов = ТекПорог.ИспользоватьРасширеннуюУстановкуПорогов;
				
				Если ТекПорог.ИспользоватьРасширеннуюУстановкуПорогов = Ложь Тогда
					ОблСтрока.Параметры.Заполнить(ТекПорог);
				КонецЕсли;
				
				ВыводитьПорогиВРассылку = Истина;
				
				ЛогПорогов.Вывести(ОблСтрока);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	1 КАК Знак,
	|	УстановкиЛимитовПоСтратегии.Ссылка КАК УстановкаЛимитов,
	|	ЭталоннаяУстановкаЛимитов.Лимит КАК Лимит
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	ЭталоннаяУстановкаЛимитов КАК ЭталоннаяУстановкаЛимитов,
	|	УстановкиЛимитовПоСтратегии КАК УстановкиЛимитовПоСтратегии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	УстановкаЛимитовЛимиты.Ссылка,
	|	УстановкаЛимитовЛимиты.Лимит
	|ИЗ
	|	Документ.УстановкаЛимитов.Лимиты КАК УстановкаЛимитовЛимиты
	|ГДЕ
	|	УстановкаЛимитовЛимиты.Ссылка В
	|			(ВЫБРАТЬ
	|				УстановкиЛимитовПоСтратегии.Ссылка КАК Ссылка
	|			ИЗ
	|				УстановкиЛимитовПоСтратегии КАК УстановкиЛимитовПоСтратегии)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Таблица.Знак) КАК Знак,
	|	Таблица.УстановкаЛимитов КАК УстановкаЛимитов,
	|	Таблица.Лимит КАК Лимит,
	|	ПРЕДСТАВЛЕНИЕ(Таблица.Лимит) КАК ЛимитПредставление,
	|	КОЛИЧЕСТВО(*) = 1 КАК ЕстьИзменения
	|ПОМЕСТИТЬ Итоговая
	|ИЗ
	|	Таблица КАК Таблица
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.УстановкаЛимитов,
	|	Таблица.Лимит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итоговая.Знак КАК Знак,
	|	Итоговая.УстановкаЛимитов КАК УстановкаЛимитов,
	|	Итоговая.УстановкаЛимитов.ОбъектНазначения КАК Портфель,
	|	Итоговая.Лимит КАК Лимит,
	|	Итоговая.ЛимитПредставление КАК ЛимитПредставление,
	|	Итоговая.ЕстьИзменения КАК ЕстьИзменения
	|ИЗ
	|	Итоговая КАК Итоговая
	|
	|УПОРЯДОЧИТЬ ПО
	|	УстановкаЛимитов,
	|	Итоговая.Лимит.Наименование,
	|	Знак
	|ИТОГИ
	|	МАКСИМУМ(Портфель),
	|	МАКСИМУМ(ЕстьИзменения)
	|ПО
	|	УстановкаЛимитов";
	
	Запрос.УстановитьПараметр("ЭталонныйПортфель", ЭталонныйПортфель);
	Запрос.УстановитьПараметр("Свойство", Эталонный_портфель_лимитов_риски);
	Запрос.УстановитьПараметр("КлассЛимита", КлассЛимитовРиски);
	Запрос.УстановитьПараметр("Портфель", ЭталонныйПортфель);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаУстановкаЛимитов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУстановкаЛимитов.Следующий() Цикл
		Если ВыборкаУстановкаЛимитов.ЕстьИзменения Тогда
			
			ЕстьДанные = Истина;
			
			УстановкаЛимитовОбъект = ВыборкаУстановкаЛимитов.УстановкаЛимитов.ПолучитьОбъект();
			УстановкаЛимитовОбъект.Лимиты.Загрузить(ЭталонныеЛимиты);
			
			ТекстовыйЛог.ДобавитьСтроку("	Портфель: """ + ВыборкаУстановкаЛимитов.Портфель + """:");
			
			Попытка
				УстановкаЛимитовОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				УстановкаЛимитовОбъект.Записать(РежимЗаписиДокумента.Проведение);
				ТекстовыйЛог.ДобавитьСтроку("	Проведен документ """ + УстановкаЛимитовОбъект.Ссылка + ":");
			Исключение
				Отказ = Истина;
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстовыйЛог.ДобавитьСтроку("	При проведении документа """ + УстановкаЛимитовОбъект.Ссылка + """ возникла следующая ошибка:");
				ТекстовыйЛог.ДобавитьСтроку("		" + ТекстОшибки);
				Попытка
					УстановкаЛимитовОбъект.Записать(РежимЗаписиДокумента.Запись);
					ТекстовыйЛог.ДобавитьСтроку("	Документ """ + УстановкаЛимитовОбъект.Ссылка + """ записан");
				Исключение
					ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ТекстовыйЛог.ДобавитьСтроку("	При записи документа """ + УстановкаЛимитовОбъект.Ссылка + """ возникла следующая ошибка:");
					ТекстовыйЛог.ДобавитьСтроку("		" + ТекстОшибки);
					Продолжить;
				КонецПопытки;
			КонецПопытки;
			
			ВыборкаДетальныеЗаписи = ВыборкаУстановкаЛимитов.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.Знак = 1 Тогда
					ТекстовыйЛог.ДобавитьСтроку("		Добавлен лимит """ + ВыборкаДетальныеЗаписи.ЛимитПредставление);
				ИначеЕсли ВыборкаДетальныеЗаписи.Знак = 2 Тогда
					ТекстовыйЛог.ДобавитьСтроку("		Удален лимит """ + ВыборкаДетальныеЗаписи.ЛимитПредставление);
				ИначеЕсли ВыборкаДетальныеЗаписи.Знак = 3 Тогда
					ТекстовыйЛог.ДобавитьСтроку("		Лимит без изменений """ + ВыборкаДетальныеЗаписи.ЛимитПредставление);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		ТаблицаПорогов = ПолучитьПорогиЛимитовЭталонногоПортфеля(ЭталонныйПортфель, ВыборкаУстановкаЛимитов.Портфель, ЭталонныеЛимиты.ВыгрузитьКолонку("Лимит"));
		
		Если ТаблицаПорогов.Количество() = 0 Тогда
			ТекстовыйЛог.ДобавитьСтроку("	У эталонного портфеля отсутствуют пороги по лимитам");
		Иначе
			
			Для Каждого ТекПорог Из ТаблицаПорогов Цикл
				
				Если ТекПорог.ДействующийПорогОтсутствует = Истина Тогда
					НаборЗаписей = РегистрыСведений.ПорогиЛимитов.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Портфель.Установить(ВыборкаУстановкаЛимитов.Портфель);
					НаборЗаписей.Отбор.Лимит.Установить(ТекПорог.Лимит);
					
					Запись = НаборЗаписей.Добавить();
					Запись.Период = Дата;
					Запись.Портфель = ВыборкаУстановкаЛимитов.Портфель;
					Запись.Лимит = ТекПорог.Лимит;
					Запись.НастройкаПороговДляПроверкиЛимитов = ТекПорог.НастройкаПороговДляПроверкиЛимитов;
					
					НаборЗаписей.Записать(Ложь);
				КонецЕсли;
				
				ОблСтрока = Макет.ПолучитьОбласть("Строка");
				ОблСтрока.Параметры.ЭталонныйПортфель = ЭталонныйПортфель;
				ОблСтрока.Параметры.КодСтратегии = ЭталонныйПортфель.Стратегия.Код;
				ОблСтрока.Параметры.Стратегия = ЭталонныйПортфель.Стратегия;
				ОблСтрока.Параметры.Портфель = ВыборкаУстановкаЛимитов.Портфель;
				ОблСтрока.Параметры.Лимит = ТекПорог.Лимит;
				ОблСтрока.Параметры.ИспользоватьРасширеннуюУстановкуПорогов = ТекПорог.ИспользоватьРасширеннуюУстановкуПорогов;
				
				Если ТекПорог.ИспользоватьРасширеннуюУстановкуПорогов = Ложь Тогда
					ОблСтрока.Параметры.Заполнить(ТекПорог);
				КонецЕсли;
				
				ВыводитьПорогиВРассылку = Истина;
				
				ЛогПорогов.Вывести(ОблСтрока);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	ТекстовыйЛог.ДобавитьСтроку(СтрШаблон("[%1] Окончание обработки", ТекущаяДатаСеанса()));
	
	Если ЕстьДанные = Истина Тогда
		РассылкаСообщения(НастройкаРассылкиРиски, ВыводитьПорогиВРассылку);
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьУстановкиЛимитов(Портфель, Дата_распространения_правил, Свойство, КлассЛимита, ЭталонныйПортфель, НастройкаРассылки)
	
	Отказ = Ложь;
	ЕстьПредупреждения = Ложь;
	ЕстьДанные = Ложь;
	ВыводитьПорогиВРассылку = Ложь;
	
	Дата = ТекущаяДатаСеанса();
	НачалоДняДата = НачалоДня(Дата);
	
	Макет = ПолучитьМакет("Пороги");
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	
	ТекстовыйЛог.Очистить();
	ЛогПорогов.Очистить();
	
	ЛогПорогов.Вывести(ОблШапка);
	
	ТекстовыйЛог.ДобавитьСтроку(КлассЛимита);
	ТекстовыйЛог.ДобавитьСтроку(СтрШаблон("[%1] Начало обработки", ТекущаяДатаСеанса()));
	ТекстовыйЛог.ДобавитьСтроку("Создание новой установки лимита");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДействующиеЛимитыПоПортфелюСрезПоследних.Регистратор КАК Регистратор,
	|	ДействующиеЛимитыПоПортфелюСрезПоследних.Портфель КАК Портфель
	|ПОМЕСТИТЬ ЭталонныеУстановкиЛимитов
	|ИЗ
	|	РегистрСведений.ДействующиеЛимитыПоПортфелю.СрезПоследних(
	|			&ДатаГраница,
	|			Портфель = &ЭталонныйПортфель
	|				И КлассЛимита = &КлассЛимита
	|				И Регистратор ССЫЛКА Документ.УстановкаЛимитов) КАК ДействующиеЛимитыПоПортфелюСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УстановкаЛимитовЛимиты.Лимит КАК Лимит,
	|	УстановкаЛимитовЛимиты.НастройкиЛимита КАК НастройкиЛимита,
	|	УстановкаЛимитовЛимиты.НастройкиУстановлены КАК НастройкиУстановлены
	|ИЗ
	|	Документ.УстановкаЛимитов.Лимиты КАК УстановкаЛимитовЛимиты
	|ГДЕ
	|	УстановкаЛимитовЛимиты.Ссылка В
	|			(ВЫБРАТЬ
	|				ЭталонныеУстановкиЛимитов.Регистратор КАК Регистратор
	|			ИЗ
	|				ЭталонныеУстановкиЛимитов КАК ЭталонныеУстановкиЛимитов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	УстановкаЛимитовЛимиты.Лимит.Наименование";
	
	Запрос.УстановитьПараметр("ЭталонныйПортфель", ЭталонныйПортфель);
	Запрос.УстановитьПараметр("Портфель", Портфель);
	Запрос.УстановитьПараметр("КлассЛимита", КлассЛимита);
	Запрос.УстановитьПараметр("ДатаГраница", Новый Граница(КонецДня(ТекущаяДатаСеанса())));
	Запрос.УстановитьПараметр("Дата", Дата);
	
	ЭталонныеЛимиты = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДействующиеЛимитыПоПортфелюСрезПоследних.Регистратор КАК Регистратор,
	|	ДействующиеЛимитыПоПортфелюСрезПоследних.Портфель КАК Портфель,
	|	ВЫРАЗИТЬ(ДействующиеЛимитыПоПортфелюСрезПоследних.Регистратор КАК Документ.УстановкаЛимитов).Дата КАК Дата,
	|	&ЭталонныйПортфель КАК ЭталонныйПортфель
	|ПОМЕСТИТЬ ДействующиеЛимиты
	|ИЗ
	|	РегистрСведений.ДействующиеЛимитыПоПортфелю.СрезПоследних(
	|			&ДатаГраница,
	|			Портфель = &Портфель
	|				И КлассЛимита = &КлассЛимита
	|				И Регистратор ССЫЛКА Документ.УстановкаЛимитов
	|				И (ДокументОснование.ДатаОкончанияДействия > &Дата
	|					ИЛИ ДокументОснование.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДействующиеЛимитыПоПортфелюСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭталонныеУстановкиЛимитов.Портфель КАК Портфель,
	|	ПРЕДСТАВЛЕНИЕ(ЭталонныеУстановкиЛимитов.Портфель) КАК ПортфельПредставление,
	|	ЭталонныеУстановкиЛимитов.Портфель.Стратегия КАК Стратегия,
	|	ПРЕДСТАВЛЕНИЕ(ЭталонныеУстановкиЛимитов.Портфель.Стратегия) КАК СтратегияПредставление,
	|	ЭталонныеУстановкиЛимитов.Портфель.Стратегия.Код КАК КодСтратегии,
	|	ЕСТЬNULL(ДействующиеЛимиты.Регистратор, НЕОПРЕДЕЛЕНО) КАК ДействующаяУстановкаЛимитов,
	|	ПРЕДСТАВЛЕНИЕ(ДействующиеЛимиты.Регистратор) КАК ДействующаяУстановкаЛимитовПредставление,
	|	ЕСТЬNULL(ЭталонныеУстановкиЛимитов.Регистратор, НЕОПРЕДЕЛЕНО) КАК ЭталоннаяУстановкаЛимитов
	|ПОМЕСТИТЬ Итоговая
	|ИЗ
	|	ЭталонныеУстановкиЛимитов КАК ЭталонныеУстановкиЛимитов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеЛимиты КАК ДействующиеЛимиты
	|		ПО ЭталонныеУстановкиЛимитов.Портфель = ДействующиеЛимиты.ЭталонныйПортфель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итоговая.Портфель КАК Портфель,
	|	Итоговая.ПортфельПредставление КАК ПортфельПредставление,
	|	Итоговая.Стратегия КАК Стратегия,
	|	Итоговая.СтратегияПредставление КАК СтратегияПредставление,
	|	Итоговая.КодСтратегии КАК КодСтратегии,
	|	Итоговая.ДействующаяУстановкаЛимитов КАК ДействующаяУстановкаЛимитов,
	|	Итоговая.ДействующаяУстановкаЛимитовПредставление КАК ДействующаяУстановкаЛимитовПредставление,
	|	Итоговая.ЭталоннаяУстановкаЛимитов КАК ЭталоннаяУстановкаЛимитов
	|ИЗ
	|	Итоговая КАК Итоговая
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО Итоговая.ДействующаяУстановкаЛимитов = ДополнительныеСведения.Объект
	|			И Итоговая.Стратегия = ДополнительныеСведения.Значение
	|			И (ДополнительныеСведения.Свойство = &Эталонный_портфель_лимитов)
	|ГДЕ
	|	ДополнительныеСведения.Значение ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Запрос.УстановитьПараметр("Эталонный_портфель_лимитов", Эталонный_портфель_лимитов);
	
	НаименованиеСтратегии = "";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЕстьДанные = Истина;
		НаименованиеСтратегии = ВыборкаДетальныеЗаписи.СтратегияПредставление;
		Если ВыборкаДетальныеЗаписи.ЭталоннаяУстановкаЛимитов = Неопределено Тогда
			ТекстовыйЛог.ДобавитьСтроку("По стратегии """ + ВыборкаДетальныеЗаписи.СтратегияПредставление + """ с кодом """ + ВыборкаДетальныеЗаписи.КодСтратегии + """ отсутствует эталонный документ ""Установка лимитов""");
			Отказ = Истина;
			Продолжить;
		Иначе
			ТекстовыйЛог.ДобавитьСтроку("Стратегия """ + ВыборкаДетальныеЗаписи.СтратегияПредставление + """ с кодом """ + ВыборкаДетальныеЗаписи.КодСтратегии + """:");
			
			ТаблицаПорогов = ПолучитьПорогиЛимитовЭталонногоПортфеля(ЭталонныйПортфель, Портфель, ЭталонныеЛимиты.ВыгрузитьКолонку("Лимит"));
		КонецЕсли;
		
		ТекстовыйЛог.ДобавитьСтроку("	Портфель """ + Портфель + """:");
		
		Если ВыборкаДетальныеЗаписи.ДействующаяУстановкаЛимитов = Неопределено Тогда
			
			Если ТаблицаПорогов.Количество() = 0 Тогда
				ТекстовыйЛог.ДобавитьСтроку("	У эталонного портфеля отсутствуют пороги по лимитам");
			Иначе
				Для Каждого ТекПорог Из ТаблицаПорогов Цикл
					
					Если ТекПорог.ДействующийПорогОтсутствует = Истина Тогда
						
						НаборЗаписей = РегистрыСведений.ПорогиЛимитов.СоздатьНаборЗаписей();
						НаборЗаписей.ОбменДанными.Загрузка = Истина;
						
						НаборЗаписей.Отбор.Портфель.Установить(Портфель);
						НаборЗаписей.Отбор.Лимит.Установить(ТекПорог.Лимит);
						НаборЗаписей.Отбор.Период.Установить(НачалоДняДата);
						
						Запись = НаборЗаписей.Добавить();
						Запись.Период = НачалоДняДата;
						Запись.Портфель = Портфель;
						Запись.Лимит = ТекПорог.Лимит;
						Запись.НастройкаПороговДляПроверкиЛимитов = ТекПорог.НастройкаПороговДляПроверкиЛимитов;
						
						Попытка
							НаборЗаписей.Записать();
						Исключение
							Отказ = Истина;
							ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
							ТекстовыйЛог.ДобавитьСтроку("		При записи порогов лимитов по портфелю """ + Портфель + """ возникла следующая ошибка:");
							ТекстовыйЛог.ДобавитьСтроку("			" + ТекстОшибки);
						КонецПопытки;
					КонецЕсли;
					
					ОблСтрока = Макет.ПолучитьОбласть("Строка");
					ОблСтрока.Параметры.ЭталонныйПортфель = ЭталонныйПортфель;
					ОблСтрока.Параметры.КодСтратегии = ВыборкаДетальныеЗаписи.КодСтратегии;
					ОблСтрока.Параметры.Стратегия = ВыборкаДетальныеЗаписи.СтратегияПредставление;
					ОблСтрока.Параметры.Портфель = Портфель;
					ОблСтрока.Параметры.Лимит = ТекПорог.Лимит;
					ОблСтрока.Параметры.ИспользоватьРасширеннуюУстановкуПорогов = ТекПорог.ИспользоватьРасширеннуюУстановкуПорогов;
					
					Если ТекПорог.ИспользоватьРасширеннуюУстановкуПорогов = Ложь Тогда
						ОблСтрока.Параметры.Заполнить(ТекПорог);
					КонецЕсли;
					
					ВыводитьПорогиВРассылку = Истина;
					ЛогПорогов.Вывести(ОблСтрока);
				КонецЦикла;
			КонецЕсли;
			
			УстановкаЛимитовОбъект = Документы.УстановкаЛимитов.СоздатьДокумент();
			УстановкаЛимитовОбъект.Дата = Дата;
			УстановкаЛимитовОбъект.ВидОперации = Перечисления.ВидыОперацийУстановкиЛимитов.ПоПортфелю;
			УстановкаЛимитовОбъект.КлассЛимита = КлассЛимита;
			УстановкаЛимитовОбъект.ОбъектНазначения = Портфель;
			
			УстановкаЛимитовОбъект.Лимиты.Загрузить(ЭталонныеЛимиты);
			
			Попытка
				УстановкаЛимитовОбъект.Записать(РежимЗаписиДокумента.Проведение);
				ТекстовыйЛог.ДобавитьСтроку("		Создан и проведен документ """ + УстановкаЛимитовОбъект.Ссылка + "");
			Исключение
				Отказ = Истина;
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстовыйЛог.ДобавитьСтроку("		При создании и проведении документа """ + УстановкаЛимитовОбъект.Ссылка + """ возникла следующая ошибка:");
				ТекстовыйЛог.ДобавитьСтроку("			" + ТекстОшибки);
				Попытка
					УстановкаЛимитовОбъект.Записать(РежимЗаписиДокумента.Запись);
					ТекстовыйЛог.ДобавитьСтроку("		Документ """ + УстановкаЛимитовОбъект.Ссылка + """ записан");
				Исключение
					ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ТекстовыйЛог.ДобавитьСтроку("		При записи документа """ + УстановкаЛимитовОбъект.Ссылка + """ возникла следующая ошибка:");
					ТекстовыйЛог.ДобавитьСтроку("			" + ТекстОшибки);
				КонецПопытки;
			КонецПопытки;
			
			Для каждого ТекСтрока Из УстановкаЛимитовОбъект.Лимиты Цикл
				ТекстовыйЛог.ДобавитьСтроку("			Добавлен лимит """ + ТекСтрока.Лимит);
			КонецЦикла;
			Попытка
				УстановитьПризнакСтратегии_УстановкаЛимитов(УстановкаЛимитовОбъект.Ссылка, ВыборкаДетальныеЗаписи.Стратегия);
			Исключение
				Отказ = Истина;
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстовыйЛог.ДобавитьСтроку("		При установке признака стратегии """ + УстановкаЛимитовОбъект.Ссылка + """ возникла следующая ошибка:");
				ТекстовыйЛог.ДобавитьСтроку("			" + ТекстОшибки); 			
			КонецПопытки;
		Иначе
			ТекстовыйЛог.ДобавитьСтроку("		У портфеля уже есть документ """ + ВыборкаДетальныеЗаписи.ДействующаяУстановкаЛимитов + ". Новый документ не создан.");
			ЕстьПредупреждения = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	ТекстовыйЛог.ДобавитьСтроку(СтрШаблон("[%1] Окончание обработки", ТекущаяДатаСеанса()));
	
	Если ЕстьДанные = Истина Тогда
		Если ЕстьПредупреждения = Ложь И Отказ = Ложь Тогда
			УстановитьДатуРаспространенияПравил(Портфель, Дата_распространения_правил);
			Если КлассЛимита = КлассЛимитовКомплаенс Тогда
				УстановитьЛимитыЗаведены(Портфель, ЛимитыЗаведеныКомплаенс, ВыполняетсяПодСервиснымПользователем());
				
				Если ВыполняетсяПодСервиснымПользователем() И Не ЭтоБазаРозничногоДУ Тогда
					РассылкаОбУспешномАвтораспространении(НастройкаРассылкиПриУспешномАвтораспространении, Портфель, НаименованиеСтратегии)
				КонецЕсли;
			ИначеЕсли КлассЛимита = КлассЛимитовРиски Тогда
				УстановитьЛимитыЗаведены(Портфель, ЛимитыЗаведеныРиски, ВыполняетсяПодСервиснымПользователем());
			КонецЕсли;
		КонецЕсли;
		РассылкаСообщения(НастройкаРассылки, ВыводитьПорогиВРассылку);
	КонецЕсли;
	
КонецПроцедуры

Функция ПропискаРассылки(Знач НомерРассылки)
	Перем ПараметрыПодключения, ИмяИБ;
	
	Попытка
		ПараметрыПодключения = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПодключенияИзСтрокиСоединенияИнформационнойБазы(СтрокаСоединенияИнформационнойБазы());
		ИмяИБ = ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия;
	Исключение
	КонецПопытки;
	
	Прописка = " {" + НомерРассылки + ", ib: " + ?(ЗначениеЗаполнено(ИмяИБ), ИмяИБ, "< .. >") + "}";
	
	Возврат Прописка;
КонецФункции // ПропискаРассылки()

Функция РассылкаСообщения(Знач НастройкаРассылки, СоздатьУстановкиЛимитов = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НастройкаРассылки.СписокАдресов.Найти(Истина, "ВключенВРассылку") = Неопределено
		И НастройкаРассылки.СписокПользователей.Найти(Истина, "ВключенВРассылку") = Неопределено Тогда
			Возврат "Не установлен список рассылки";
	КонецЕсли;
	
	ПочтаОтправки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаРассылки, "УчетнаяЗаписьЭлектроннойПочты");
	
	Если Не ЗначениеЗаполнено(ПочтаОтправки) Тогда
		ПочтаОтправки = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	КонецЕсли;
	
	ТемаСообщения = "Аванкор ФО: Распространение правил с одного клиента на список клиентов";
	Если ЗначениеЗаполнено(ОбъектНазначения) Тогда
		ТемаСообщения = ТемаСообщения + " (" + ОбъектНазначения + ")";
	КонецЕсли;
	
	Если Отказ = Истина Тогда
		Флаг = "{FAIL} ";
		Важность = ВажностьИнтернетПочтовогоСообщения.Высокая;
	ИначеЕсли ЕстьПредупреждения = Истина Тогда
		Флаг = "{WARN} ";
		Важность = ВажностьИнтернетПочтовогоСообщения.Высокая;
	Иначе
		Флаг = "{OK} ";
		Важность = ВажностьИнтернетПочтовогоСообщения.Обычная;
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста, Важность, Вложения");
	ПараметрыПисьма.Тема = Флаг + ТемаСообщения + ПропискаРассылки("r153");
	ПараметрыПисьма.Важность = Важность;
	
	ПараметрыПисьма.Тело = ТекстовыйЛог.ПолучитьТекст();
	ПараметрыПисьма.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	
	СписокАдресов = "";
	Если НастройкаРассылки.РежимРассылки = 0 Тогда
		Для Каждого СтрТЧ Из НастройкаРассылки.СписокАдресов Цикл
			Если СтрТЧ.ВключенВРассылку Тогда
				СписокАдресов = СписокАдресов + СтрТЧ.Адрес + ",";
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого СтрТЧ Из НастройкаРассылки.СписокПользователей Цикл
			Если СтрТЧ.ВключенВРассылку Тогда
				Адрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(СтрТЧ.Пользователь, Справочники.ВидыКонтактнойИнформации.EmailПользователя, ТекущаяДата());
				СписокАдресов = СписокАдресов + Адрес + ",";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыПисьма.Кому = СписокАдресов;
	
	Если СоздатьУстановкиЛимитов = Истина Тогда
		
		ПутьКФайлуXLS = ПолучитьИмяВременногоФайла(".xls");
		ЛогПорогов.Записать(ПутьКФайлуXLS, ТипФайлаТабличногоДокумента.XLS); 
		
		ПараметрыПисьма.Вложения = Новый Структура("Отчет", ПутьКФайлуXLS);
		
	КонецЕсли;
	
	Попытка
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(ПочтаОтправки, ПараметрыПисьма);
		текстРассылки = "Рассылка завершена";
	Исключение
		текстРассылки = "Рассылка не удалась: "; 
		Сообщения = ПолучитьСообщенияПользователю(Истина);
		Для Каждого Элемент Из Сообщения Цикл
			текстРассылки = текстРассылки + Символы.ПС + Элемент.Текст;
		КонецЦикла;
		ЗаписьЖурналаРегистрации(СведенияОВнешнейОбработке().Наименование, УровеньЖурналаРегистрации.Ошибка, , текстРассылки);
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат текстРассылки;
	
КонецФункции

Функция РассылкаОбУспешномАвтораспространении(Знач НастройкаРассылки, Портфель, НаименованиеСтратегии)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НастройкаРассылки.СписокАдресов.Найти(Истина, "ВключенВРассылку") = Неопределено
		И НастройкаРассылки.СписокПользователей.Найти(Истина, "ВключенВРассылку") = Неопределено Тогда
			Возврат "Не установлен список рассылки";
	КонецЕсли;
	
	ПочтаОтправки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаРассылки, "УчетнаяЗаписьЭлектроннойПочты");
	
	Если Не ЗначениеЗаполнено(ПочтаОтправки) Тогда
		ПочтаОтправки = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	КонецЕсли;
	
	ТемаСообщения = "Правила ДУ" + Портфель.Префикс;
	
	ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста, Вложения");
	ПараметрыПисьма.Тема = ТемаСообщения;
	
	ПараметрыПисьма.Тело = "По ДУ " + Портфель.КодПортфеля + " со стороны комплаенс подключены правила в Аванкор ФО по стратегии """ + НаименованиеСтратегии + """";
	ПараметрыПисьма.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	
	СписокАдресов = "";
	Если НастройкаРассылки.РежимРассылки = 0 Тогда
		Для Каждого СтрТЧ Из НастройкаРассылки.СписокАдресов Цикл
			Если СтрТЧ.ВключенВРассылку Тогда
				СписокАдресов = СписокАдресов + СтрТЧ.Адрес + ",";
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого СтрТЧ Из НастройкаРассылки.СписокПользователей Цикл
			Если СтрТЧ.ВключенВРассылку Тогда
				Адрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(СтрТЧ.Пользователь, Справочники.ВидыКонтактнойИнформации.EmailПользователя, ТекущаяДата());
				СписокАдресов = СписокАдресов + Адрес + ",";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыПисьма.Кому = СписокАдресов;
	
	Попытка
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(ПочтаОтправки, ПараметрыПисьма);
		текстРассылки = "Рассылка завершена";
	Исключение
		текстРассылки = "Рассылка не удалась: "; 
		Сообщения = ПолучитьСообщенияПользователю(Истина);
		Для Каждого Элемент Из Сообщения Цикл
			текстРассылки = текстРассылки + Символы.ПС + Элемент.Текст;
		КонецЦикла;
		ЗаписьЖурналаРегистрации(СведенияОВнешнейОбработке().Наименование, УровеньЖурналаРегистрации.Ошибка, , текстРассылки);
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат текстРассылки;
	
КонецФункции

Функция ПолучитьПорогиЛимитовЭталонногоПортфеля(ЭталонныйПортфель, Портфель, Лимиты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПорогиЛимитовСрезПоследних.Период КАК Период,
		|	ПорогиЛимитовСрезПоследних.Лимит КАК Лимит,
		|	ПРЕДСТАВЛЕНИЕ(ПорогиЛимитовСрезПоследних.Лимит) КАК ЛимитПредставление,
		|	ПорогиЛимитовСрезПоследних.НастройкаПороговДляПроверкиЛимитов КАК НастройкаПороговДляПроверкиЛимитов,
		|	ПРЕДСТАВЛЕНИЕ(ПорогиЛимитовСрезПоследних.НастройкаПороговДляПроверкиЛимитов) КАК НастройкаПороговДляПроверкиЛимитовПредставление
		|ПОМЕСТИТЬ ЭталонныеПороги
		|ИЗ
		|	РегистрСведений.ПорогиЛимитов.СрезПоследних(
		|			&Дата,
		|			Портфель = &ЭталонныйПортфель
		|				И Лимит В (&Лимиты)) КАК ПорогиЛимитовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПорогиЛимитовСрезПоследних.Период КАК Период,
		|	ПорогиЛимитовСрезПоследних.Лимит КАК Лимит,
		|	ПРЕДСТАВЛЕНИЕ(ПорогиЛимитовСрезПоследних.Лимит) КАК ЛимитПредставление,
		|	ПорогиЛимитовСрезПоследних.НастройкаПороговДляПроверкиЛимитов КАК НастройкаПороговДляПроверкиЛимитов,
		|	ПРЕДСТАВЛЕНИЕ(ПорогиЛимитовСрезПоследних.НастройкаПороговДляПроверкиЛимитов) КАК НастройкаПороговДляПроверкиЛимитовПредставление
		|ПОМЕСТИТЬ ДействующиеПороги
		|ИЗ
		|	РегистрСведений.ПорогиЛимитов.СрезПоследних(
		|			&Дата,
		|			Портфель = &Портфель
		|				И Лимит В (&Лимиты)) КАК ПорогиЛимитовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ДействующиеПороги.Период, ЭталонныеПороги.Период) КАК Период,
		|	ЭталонныеПороги.Лимит КАК Лимит,
		|	ЕСТЬNULL(ДействующиеПороги.НастройкаПороговДляПроверкиЛимитов, ЭталонныеПороги.НастройкаПороговДляПроверкиЛимитов) КАК НастройкаПороговДляПроверкиЛимитов,
		|	ЕСТЬNULL(ДействующиеПороги.Лимит, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО КАК ДействующийПорогОтсутствует
		|ПОМЕСТИТЬ НастройкиПорогов
		|ИЗ
		|	ЭталонныеПороги КАК ЭталонныеПороги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеПороги КАК ДействующиеПороги
		|		ПО ЭталонныеПороги.Лимит = ДействующиеПороги.Лимит
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиПорогов.Период КАК Период,
		|	НастройкиПорогов.Лимит КАК Лимит,
		|	НастройкиПорогов.Лимит.Наименование КАК ЛимитНаименование,
		|	НастройкиПорогов.НастройкаПороговДляПроверкиЛимитов КАК НастройкаПороговДляПроверкиЛимитов,
		|	НастройкиПорогов.ДействующийПорогОтсутствует КАК ДействующийПорогОтсутствует,
		|	ЕСТЬNULL(НастройкиПороговДляПроверкиЛимитовСложныеПороги.МинДоляЖелтаяЗона, 0) КАК ПредупреждениеМин,
		|	ЕСТЬNULL(НастройкиПороговДляПроверкиЛимитовСложныеПороги.МаксДоляЖелтаяЗона, 0) КАК ПредупреждениеМакс,
		|	ЕСТЬNULL(НастройкиПороговДляПроверкиЛимитовСложныеПороги.МинСуммаЖелтаяЗона, 0) КАК ПредупреждениеМинСумма,
		|	ЕСТЬNULL(НастройкиПороговДляПроверкиЛимитовСложныеПороги.МаксСуммаЖелтаяЗона, 0) КАК ПредупреждениеМаксСумма,
		|	ЕСТЬNULL(НастройкиПороговДляПроверкиЛимитовСложныеПороги.МинДоляКраснаяЗона, 0) КАК НарушениеМин,
		|	ЕСТЬNULL(НастройкиПороговДляПроверкиЛимитовСложныеПороги.МаксДоляКраснаяЗона, 0) КАК НарушениеМакс,
		|	ЕСТЬNULL(НастройкиПороговДляПроверкиЛимитовСложныеПороги.МинДоляКраснаяЗона, 0) КАК НарушениеМинСумма,
		|	ЕСТЬNULL(НастройкиПороговДляПроверкиЛимитовСложныеПороги.МаксДоляКраснаяЗона, 0) КАК НарушениеМаксСумма,
		|	ЕСТЬNULL(НастройкиПороговДляПроверкиЛимитовСложныеПороги.МинДоляПоручение, 0) КАК ПоручениеМин,
		|	ЕСТЬNULL(НастройкиПороговДляПроверкиЛимитовСложныеПороги.МаксДоляПоручение, 0) КАК ПоручениеМакс,
		|	ЕСТЬNULL(НастройкиПороговДляПроверкиЛимитовСложныеПороги.МинСуммаПоручение, 0) КАК ПоручениеМинСумма,
		|	ЕСТЬNULL(НастройкиПороговДляПроверкиЛимитовСложныеПороги.МаксСуммаПоручение, 0) КАК ПоручениеМаксСумма,
		|	ЕСТЬNULL(НастройкиПороговДляПроверкиЛимитовСложныеПороги.Ссылка.ИспользоватьРасширеннуюУстановкуПорогов, ИСТИНА) КАК ИспользоватьРасширеннуюУстановкуПорогов
		|ИЗ
		|	НастройкиПорогов КАК НастройкиПорогов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиПороговДляПроверкиЛимитов.СложныеПороги КАК НастройкиПороговДляПроверкиЛимитовСложныеПороги
		|		ПО НастройкиПорогов.НастройкаПороговДляПроверкиЛимитов = НастройкиПороговДляПроверкиЛимитовСложныеПороги.Ссылка
		|			И (НастройкиПорогов.НастройкаПороговДляПроверкиЛимитов.ИспользоватьРасширеннуюУстановкуПорогов = ЛОЖЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	Лимиты.Ссылка,
		|	Лимиты.Наименование,
		|	NULL,
		|	ЛОЖЬ,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ЛОЖЬ
		|ИЗ
		|	Справочник.Лимиты КАК Лимиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиПорогов КАК НастройкиПорогов
		|		ПО (НастройкиПорогов.Лимит = Лимиты.Ссылка)
		|ГДЕ
		|	Лимиты.Ссылка В(&Лимиты)
		|	И НастройкиПорогов.Лимит ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛимитНаименование";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Портфель", Портфель);
	Запрос.УстановитьПараметр("ЭталонныйПортфель", ЭталонныйПортфель);
	Запрос.УстановитьПараметр("Лимиты", Лимиты);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура УстановитьПризнакСтратегии_УстановкаЛимитов(УстановкаЛимитов, Стратегия)
	
	НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(УстановкаЛимитов);
	НаборЗаписей.Отбор.Свойство.Установить(Эталонный_портфель_лимитов);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Объект = УстановкаЛимитов;
	НоваяЗапись.Свойство = Эталонный_портфель_лимитов;
	НоваяЗапись.Значение = Стратегия;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УстановитьДатуРаспространенияПравил(Портфель, Дата_распространения_правил)
	
	НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Портфель);
	НаборЗаписей.Отбор.Свойство.Установить(Дата_распространения_правил);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Объект = Портфель;
	НоваяЗапись.Свойство = Дата_распространения_правил;
	НоваяЗапись.Значение = ТекущаяДатаСеанса();
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УстановитьЭталонныйПортфельЛимитов(Портфель, ЭталонныйПортфель, СвойствоЭталонныйПортфельЛимитов)
	
	НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Портфель);
	НаборЗаписей.Отбор.Свойство.Установить(СвойствоЭталонныйПортфельЛимитов);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Объект = Портфель;
	НоваяЗапись.Свойство = СвойствоЭталонныйПортфельЛимитов;
	НоваяЗапись.Значение = ЭталонныйПортфель;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УстановитьВнешнийКодЭталонногоПортфеля(Портфель, ВнешнийКодЭталонногоПортфеля, СвойствоВнешнийКодЭталонногоПортфеля)
	
	НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Портфель);
	НаборЗаписей.Отбор.Свойство.Установить(СвойствоВнешнийКодЭталонногоПортфеля);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Объект = Портфель;
	НоваяЗапись.Свойство = СвойствоВнешнийКодЭталонногоПортфеля;
	НоваяЗапись.Значение = ВнешнийКодЭталонногоПортфеля;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УстановитьДатуАвтоустановкиЛимитов(Портфель, ТекущаяДата, СвойствоДатаАвтоустановкиЛимитов)
	
	НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Портфель);
	НаборЗаписей.Отбор.Свойство.Установить(СвойствоДатаАвтоустановкиЛимитов);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Объект = Портфель;
	НоваяЗапись.Свойство = СвойствоДатаАвтоустановкиЛимитов;
	НоваяЗапись.Значение = ТекущаяДата;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УстановитьЛимитыЗаведены(Портфель, СвойствоЛимитыЗаведены, Значение = Ложь)
	
	НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Портфель);
	НаборЗаписей.Отбор.Свойство.Установить(СвойствоЛимитыЗаведены);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Объект = Портфель;
	НоваяЗапись.Свойство = СвойствоЛимитыЗаведены;
	НоваяЗапись.Значение = Значение;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция НайтиНовыхКлиентовРозничногоДУ(КлассЛимитов, ДатаАвтоустановкиЛимитов, ВнешнийКодЭталонногоПортфеля, ЛимитыЗаведены, СписокТиповКлиентов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Портфели.Ссылка КАК Портфель,
		|	ЕСТЬNULL(ДополнительныеСведенияВнешнийКод.Значение, """") КАК ВнешнийКодПортфеля
		|ПОМЕСТИТЬ тПортфели
		|ИЗ
		|	Справочник.Портфели КАК Портфели
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияДата
		|		ПО Портфели.Ссылка = ДополнительныеСведенияДата.Объект
		|			И (ДополнительныеСведенияДата.Свойство = &ДатаАвтоустановкиЛимитов)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияВнешнийКод
		|		ПО Портфели.Ссылка = ДополнительныеСведенияВнешнийКод.Объект
		|			И (ДополнительныеСведенияВнешнийКод.Свойство = &ВнешнийКодЭталонногоПортфеля)
		|ГДЕ
		|	(ДополнительныеСведенияДата.Значение ЕСТЬ NULL
		|			ИЛИ ДополнительныеСведенияДата.Значение = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	И НЕ Портфели.ПометкаУдаления
		|	И Портфели.ТипКлиента В(&СписокТиповКлиентов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Портфели.Ссылка КАК ЭталонныйПортфель,
		|	Портфели.ВнешнийКод КАК ВнешнийКод
		|ПОМЕСТИТЬ тЭталонныеПортфели
		|ИЗ
		|	Справочник.Портфели КАК Портфели
		|ГДЕ
		|	Портфели.ВнешнийКод В
		|			(ВЫБРАТЬ
		|				тПортфели.ВнешнийКодПортфеля КАК ВнешнийКодПортфеля
		|			ИЗ
		|				тПортфели КАК тПортфели)
		|	И Портфели.ВнешнийКод <> """"
		|	И НЕ Портфели.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДействующиеЛимитыПоПортфелюСрезПоследних.Регистратор КАК ЭталоннаяУстановкаЛимитов,
		|	ДействующиеЛимитыПоПортфелюСрезПоследних.Портфель КАК ЭталонныйПортфель
		|ПОМЕСТИТЬ тЭталонныеУстановкиЛимитов
		|ИЗ
		|	РегистрСведений.ДействующиеЛимитыПоПортфелю.СрезПоследних(
		|			&ДатаГраница,
		|			Портфель В
		|					(ВЫБРАТЬ
		|						тЭталонныеПортфели.ЭталонныйПортфель КАК ЭталонныйПортфель
		|					ИЗ
		|						тЭталонныеПортфели КАК тЭталонныеПортфели)
		|				И КлассЛимита = &КлассЛимита
		|				И Регистратор ССЫЛКА Документ.УстановкаЛимитов) КАК ДействующиеЛимитыПоПортфелюСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДействующиеЛимитыПоПортфелюСрезПоследних.Регистратор КАК УстановкаЛимитов,
		|	ДействующиеЛимитыПоПортфелюСрезПоследних.Портфель КАК Портфель
		|ПОМЕСТИТЬ тУстановкиЛимитов
		|ИЗ
		|	РегистрСведений.ДействующиеЛимитыПоПортфелю.СрезПоследних(
		|			&ДатаГраница,
		|			Портфель В
		|					(ВЫБРАТЬ
		|						тПортфели.Портфель КАК Портфель
		|					ИЗ
		|						тПортфели КАК тПортфели)
		|				И (ДокументОснование.ДатаОкончанияДействия > &Дата
		|					ИЛИ ДокументОснование.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|				И КлассЛимита = &КлассЛимита
		|				И Регистратор ССЫЛКА Документ.УстановкаЛимитов) КАК ДействующиеЛимитыПоПортфелюСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тПортфели.Портфель КАК Портфель,
		|	тПортфели.ВнешнийКодПортфеля КАК ВнешнийКодПортфеля,
		|	ЕСТЬNULL(тЭталонныеПортфели.ЭталонныйПортфель, ЗНАЧЕНИЕ(Справочник.Портфели.ПустаяСсылка)) КАК ЭталонныйПортфель,
		|	ЕСТЬNULL(тЭталонныеУстановкиЛимитов.ЭталоннаяУстановкаЛимитов, ЗНАЧЕНИЕ(Документ.УстановкаЛимитов.ПустаяСсылка)) КАК ЭталоннаяУстановкаЛимитов,
		|	ЕСТЬNULL(ДополнительныеСведенияЛимитыЗаведеныКомплаенс.Значение, ЛОЖЬ) КАК ЛимитыЗаведеныКомплаенс,
		|	НЕ тУстановкиЛимитов.УстановкаЛимитов ЕСТЬ NULL КАК ЕстьУстановкаЛимитов
		|ИЗ
		|	тПортфели КАК тПортфели
		|		ЛЕВОЕ СОЕДИНЕНИЕ тЭталонныеПортфели КАК тЭталонныеПортфели
		|			ЛЕВОЕ СОЕДИНЕНИЕ тЭталонныеУстановкиЛимитов КАК тЭталонныеУстановкиЛимитов
		|			ПО тЭталонныеПортфели.ЭталонныйПортфель = тЭталонныеУстановкиЛимитов.ЭталонныйПортфель
		|		ПО тПортфели.ВнешнийКодПортфеля = тЭталонныеПортфели.ВнешнийКод
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияЛимитыЗаведеныКомплаенс
		|		ПО тПортфели.Портфель = ДополнительныеСведенияЛимитыЗаведеныКомплаенс.Объект
		|			И (ДополнительныеСведенияЛимитыЗаведеныКомплаенс.Свойство = &ЛимитыЗаведены)
		|		ЛЕВОЕ СОЕДИНЕНИЕ тУстановкиЛимитов КАК тУстановкиЛимитов
		|		ПО тПортфели.Портфель = тУстановкиЛимитов.Портфель";
	
	Запрос.УстановитьПараметр("ДатаАвтоустановкиЛимитов", ДатаАвтоустановкиЛимитов);
	Запрос.УстановитьПараметр("ВнешнийКодЭталонногоПортфеля", ВнешнийКодЭталонногоПортфеля);
	Запрос.УстановитьПараметр("КлассЛимита", КлассЛимитов);
	Запрос.УстановитьПараметр("ЛимитыЗаведены", ЛимитыЗаведены);
	Запрос.УстановитьПараметр("СписокТиповКлиентов", СписокТиповКлиентов.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ДатаГраница", Новый Граница(КонецДня(ТекущаяДатаСеанса())));
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция НайтиНовыхКлиентов(КлассЛимитов, ДатаАвтоустановкиЛимитов, ЛимитыЗаведены, СписокТиповКлиентов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"	ВЫБРАТЬ
		|	Портфели.Ссылка КАК Портфель,
		|	Портфели.Стратегия КАК Стратегия
		|ПОМЕСТИТЬ тПортфели
		|ИЗ
		|	Справочник.Портфели КАК Портфели
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияДата
		|		ПО (Портфели.Ссылка = ДополнительныеСведенияДата.Объект)
		|			И (ДополнительныеСведенияДата.Свойство = &ДатаАвтоустановкиЛимитов)
		|ГДЕ
		|	(ДополнительныеСведенияДата.Значение ЕСТЬ NULL
		|			ИЛИ ДополнительныеСведенияДата.Значение = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	И НЕ Портфели.ПометкаУдаления
		|	И Портфели.ТипКлиента В(&СписокТиповКлиентов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДействующиеЛимитыПоПортфелю.Портфель КАК Портфель
		|ПОМЕСТИТЬ тУстановкиЛимитов
		|ИЗ
		|	РегистрСведений.ДействующиеЛимитыПоПортфелю.СрезПоследних(
		|			&ДатаГраница,
		|			КлассЛимита = &КлассЛимита
		|				И (ДокументОснование.ДатаОкончанияДействия > &Дата
		|					ИЛИ ДокументОснование.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|				И Портфель В
		|					(ВЫБРАТЬ
		|						тПортфели.Портфель КАК Портфель
		|					ИЗ
		|						тПортфели КАК тПортфели)) КАК ДействующиеЛимитыПоПортфелю
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тПортфели.Портфель КАК Портфель,
		|	тПортфели.Стратегия КАК Стратегия,
		|	ЕСТЬNULL(ВТБ_ЭталонныйПортфельСтратегии.ЭталонныйПортфель, ЗНАЧЕНИЕ(Справочник.Портфели.ПустаяСсылка)) КАК ЭталонныйПортфель,
		|	ЕСТЬNULL(ВТБ_ЭталонныйПортфельСтратегии.ЭталонныйПортфель.ВнешнийКод, """") КАК ВнешнийКодЭталонногоПортфеля,
		|	ЕСТЬNULL(ВТБ_ЭталонныйПортфельСтратегии.ПрименятьАвтосозданиеУстановокЛимитов, ЛОЖЬ) КАК ПрименятьАвтосозданиеУстановокЛимитов
		|ПОМЕСТИТЬ тЭталонныеПортфели
		|ИЗ
		|	тПортфели КАК тПортфели
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВТБ_ЭталонныйПортфельСтратегии КАК ВТБ_ЭталонныйПортфельСтратегии
		|		ПО тПортфели.Стратегия = ВТБ_ЭталонныйПортфельСтратегии.Стратегия
		|ГДЕ
		|	НЕ тПортфели.Портфель В
		|				(ВЫБРАТЬ
		|					тУстановкиЛимитов.Портфель
		|				ИЗ
		|					тУстановкиЛимитов КАК тУстановкиЛимитов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДействующиеЛимитыПоПортфелюСрезПоследних.Регистратор КАК ЭталоннаяУстановкаЛимитов,
		|	ДействующиеЛимитыПоПортфелюСрезПоследних.Портфель КАК ЭталонныйПортфель
		|ПОМЕСТИТЬ тЭталонныеУстановкиЛимитов
		|ИЗ
		|	РегистрСведений.ДействующиеЛимитыПоПортфелю.СрезПоследних(
		|			&ДатаГраница,
		|			Портфель В
		|					(ВЫБРАТЬ
		|						тЭталонныеПортфели.ЭталонныйПортфель КАК ЭталонныйПортфель
		|					ИЗ
		|						тЭталонныеПортфели КАК тЭталонныеПортфели)
		|				И КлассЛимита = &КлассЛимита
		|				И Регистратор ССЫЛКА Документ.УстановкаЛимитов) КАК ДействующиеЛимитыПоПортфелюСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тЭталонныеПортфели.Портфель КАК Портфель,
		|	тЭталонныеПортфели.Стратегия КАК Стратегия,
		|	тЭталонныеПортфели.ВнешнийКодЭталонногоПортфеля КАК ВнешнийКодПортфеля,
		|	тЭталонныеПортфели.ЭталонныйПортфель КАК ЭталонныйПортфель,
		|	тЭталонныеПортфели.ПрименятьАвтосозданиеУстановокЛимитов КАК ПрименятьАвтосозданиеУстановокЛимитов,
		|	ЕСТЬNULL(тЭталонныеУстановкиЛимитов.ЭталоннаяУстановкаЛимитов, ЗНАЧЕНИЕ(Документ.УстановкаЛимитов.ПустаяСсылка)) КАК ЭталоннаяУстановкаЛимитов,
		|	ЕСТЬNULL(ДополнительныеСведенияЛимитыЗаведеныКомплаенс.Значение, ЛОЖЬ) КАК ЛимитыЗаведеныКомплаенс
		|ИЗ
		|	тЭталонныеПортфели КАК тЭталонныеПортфели
		|		ЛЕВОЕ СОЕДИНЕНИЕ тЭталонныеУстановкиЛимитов КАК тЭталонныеУстановкиЛимитов
		|		ПО тЭталонныеПортфели.ЭталонныйПортфель = тЭталонныеУстановкиЛимитов.ЭталонныйПортфель
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияЛимитыЗаведеныКомплаенс
		|		ПО тЭталонныеПортфели.Портфель = ДополнительныеСведенияЛимитыЗаведеныКомплаенс.Объект
		|			И (ДополнительныеСведенияЛимитыЗаведеныКомплаенс.Свойство = &ЛимитыЗаведены)";
	
	Запрос.УстановитьПараметр("ДатаАвтоустановкиЛимитов", ДатаАвтоустановкиЛимитов);
	Запрос.УстановитьПараметр("КлассЛимита", КлассЛимитов);
	Запрос.УстановитьПараметр("ЛимитыЗаведены", ЛимитыЗаведены);
	Запрос.УстановитьПараметр("СписокТиповКлиентов", СписокТиповКлиентов.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ДатаГраница", Новый Граница(КонецДня(ТекущаяДатаСеанса())));
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ВыполняетсяПодСервиснымПользователем()
	
	Для каждого ТекСервПользователь Из СписокСервисныхПользователей Цикл
		Если ТекСервПользователь.Значение = ПараметрыСеанса.ТекущийПользователь Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция РассылкаСообщенияПоУстановкам(Знач НастройкаРассылки, Знач ТемаСообщения, Знач ТекстСообщения, Знач ЕстьОшибки, Знач ЕстьПредупреждения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НастройкаРассылки.СписокАдресов.Найти(Истина, "ВключенВРассылку") = Неопределено
		И НастройкаРассылки.СписокПользователей.Найти(Истина, "ВключенВРассылку") = Неопределено Тогда
			Возврат "Не установлен список рассылки";
	КонецЕсли;
	
	ПочтаОтправки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаРассылки, "УчетнаяЗаписьЭлектроннойПочты");
	
	Если Не ЗначениеЗаполнено(ПочтаОтправки) Тогда
		ПочтаОтправки = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста, Важность");
	ПараметрыПисьма.Тема = ?(ЕстьОшибки, "{FAIL} ", ?(ЕстьПредупреждения, "{WARN} ", "{OK} ")) + ТемаСообщения + ПропискаРассылки("r306");
	ПараметрыПисьма.Важность = ?(ЕстьОшибки Или ЕстьПредупреждения, ВажностьИнтернетПочтовогоСообщения.Высокая, ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	ПараметрыПисьма.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	
	СписокАдресов = "";
	Если НастройкаРассылки.РежимРассылки = 0 Тогда
		Для Каждого СтрТЧ Из НастройкаРассылки.СписокАдресов Цикл
			Если СтрТЧ.ВключенВРассылку Тогда
				СписокАдресов = СписокАдресов + СтрТЧ.Адрес + ",";
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого СтрТЧ Из НастройкаРассылки.СписокПользователей Цикл
			Если СтрТЧ.ВключенВРассылку Тогда
				Адрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(СтрТЧ.Пользователь, Справочники.ВидыКонтактнойИнформации.EmailПользователя, ТекущаяДата());
				СписокАдресов = СписокАдресов + Адрес + ",";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыПисьма.Кому = СписокАдресов;
	ПараметрыПисьма.Тело = ТекстСообщения;
	
	Попытка
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(ПочтаОтправки, ПараметрыПисьма);
		текстРассылки = "Рассылка завершена";
	Исключение
		текстРассылки = ПараметрыПисьма.Тема + Символы.ПС + "Рассылка не удалась: " + Символы.ПС + ОписаниеОшибки();
		Сообщения = ПолучитьСообщенияПользователю(Истина);
		Для Каждого Элемент Из Сообщения Цикл
			текстРассылки = текстРассылки + Символы.ПС + Элемент.Текст;
		КонецЦикла;
		ЗаписьЖурналаРегистрации(СведенияОВнешнейОбработке().Наименование, УровеньЖурналаРегистрации.Ошибка,,, текстРассылки);
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат текстРассылки;
	
КонецФункции

Процедура НайтиПортфелиБезУстановокЛимитов(ДатаНачала, ДатаОкончания, КлассЛимитов, ТекстСообщения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Портфели.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ т
		|ИЗ
		|	Справочник.Портфели КАК Портфели
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЛимитыПоПортфелю.СрезПоследних(
		|				&ДатаОкончания,
		|				КлассЛимита = &КлассЛимита
		|					И Регистратор ССЫЛКА Документ.УстановкаЛимитов
		|					И Регистратор.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДействующиеЛимитыПоПортфелюСрезПоследних
		|		ПО (ДействующиеЛимитыПоПортфелюСрезПоследних.Портфель = Портфели.Ссылка)
		|ГДЕ
		|	ДействующиеЛимитыПоПортфелюСрезПоследних.Портфель ЕСТЬ NULL
		|	И Портфели.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВерсииОбъектов.Объект КАК Объект,
		|	ВЫРАЗИТЬ(ВерсииОбъектов.Объект КАК Справочник.Портфели).Наименование КАК Наименование,
		|	ВЫРАЗИТЬ(ВерсииОбъектов.Объект КАК Справочник.Портфели).НомерДоговора КАК НомерДоговора,
		|	ВЫРАЗИТЬ(ВерсииОбъектов.Объект КАК Справочник.Портфели).Учредитель.Наименование КАК УчредительНаименование
		|ИЗ
		|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|ГДЕ
		|	ВерсииОбъектов.Объект В
		|			(ВЫБРАТЬ
		|				т.Ссылка
		|			ИЗ
		|				т КАК т)
		|	И ВерсииОбъектов.НомерВерсии = 1
		|	И ВерсииОбъектов.ДатаВерсии МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерДоговора,
		|	Наименование";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("КлассЛимита", КлассЛимитов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДобавитьТекстСообщения(ТекстСообщения, "" + СокрЛП(Выборка.Наименование) + " - ДУ " + СокрЛП(Выборка.НомерДоговора) + " (" + СокрЛП(Выборка.УчредительНаименование) + ")" + Символы.ПС);
		ЕстьПредупреждения = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьТекстСообщения(ТекстСообщения, ДобавляемыйТекст)
	
	ТекстСообщения = ?(ЗначениеЗаполнено(ТекстСообщения), ТекстСообщения + Символы.ПС + ДобавляемыйТекст, ДобавляемыйТекст);
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация


#КонецОбласти
