
////////////////////////////////////////////////////////////////////////////////
// ОбРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЭкспортВЛуч(Команда)
	ПовторнаяВыгрузка = ПоручениеУжеВыгружалось(Объект.Ссылка);
	Если ПовторнаяВыгрузка Тогда
		Текст = "Поручение было выгружено ранее. Повторить выгрузку?";
		Ответ = Вопрос(Текст, РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ЭкспортВЛучНаСервере(Объект.Ссылка);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ

&НаСервереБезКонтекста
Функция ПоручениеУжеВыгружалось(Ссылка)
	Возврат РегистрыСведений.ДокументыВыгруженныеВЛуч.ДокументВыгружен(Ссылка);
КонецФункции

&НаСервере
Процедура ЭкспортВЛучНаСервере(Поручение)
	Обработка = Обработки.ЭкспортПорученийВЛуч.Создать();
	Обработка.ДатаВыгрузки = Поручение.Дата;
	Обработка.ЗаполнитьПоручения(Поручение);
	Если Обработка.Поручения.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не подлежит выгрузке.");
		Возврат;
	КонецЕсли;
	Результат = Обработка.РезультатВыгрузкиПоручений();
	ИмяСобытия = "Экспорт поручений в Луч";
	Если ЗначениеЗаполнено(Результат) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.СообщениеПользователю);
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,	Результат.Данные,
			Результат.СообщениеВЖурнал);
	Иначе
		Сообщение = "Файл сформирован";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, Сообщение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РеквизитыИнвентарныхПорученийСервер.ЗаполнитьРеквизитыПоручения(Объект.Ссылка, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РеквизитыИнвентарныхПорученийСервер.ЗаполнитьРеквизитыПоручения(ТекущийОбъект.Ссылка, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПровереноПриИзменении(Элемент)
	Если Объект.Проверено Тогда
		Объект.Проверено = ОбязательныеРеквизитыЗаполнены();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ОбязательныеРеквизитыЗаполнены()
	Результат = Истина;
	
	МассивОбязательныхРеквизитов = ТаблицаРеквизитов.НайтиСтроки(Новый Структура("Обязательный", истина));
	Для каждого Реквизит Из МассивОбязательныхРеквизитов Цикл
		Если НЕ ЗначениеЗаполнено(ЭтаФорма[Реквизит.ИмяЭлемента]) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнен обязательный реквизит """ + Реквизит.Заголовок + """";
			Сообщение.Поле = Реквизит.ПутьКДанным;
			Сообщение.Сообщить(); 
			
			Результат = Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции // ОбязательныеРеквизитыЗаполнены()

