
&НаКлиенте
Процедура ВызываемыйОтчетОбработкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	
	ОтборМетаданных = Новый СписокЗначений;
	ОтборМетаданных.Добавить("Отчеты");
	ОтборМетаданных.Добавить("Обработки");
	
	Если ОбъектыМетаданных.Количество()>0 Тогда
		ОбъектыМетаданных.Очистить();	
	КонецЕсли; 
	
	Если Не Объект.ВызываемыйОтчетОбработка = "<!!!НЕ ОПРЕДЕЛЕН!!!>" Тогда
		ОбъектыМетаданных.Добавить(Объект.ВызываемыйОтчетОбработка);
	КонецЕсли;	
		
	Результат = ОткрытьФормуМодально("ОбщаяФорма.ВыборОбъектовМетаданных", 
	                  Новый Структура("КоллекцииВыбираемыхОбъектовМетаданных,
	                                  |ВыбранныеОбъектыМетаданных,
	                                  |УникальныйИдентификаторИсточник,
									  |ВыборЕдинственного,
									  |НачальноеЗначениеВыбора",
	                                  ОтборМетаданных,
	                                  ОбъектыМетаданных,
	                                  УникальныйИдентификатор,
					  				  Истина,
					  				  ?(Не Объект.ВызываемыйОтчетОбработка = "<!!!НЕ ОПРЕДЕЛЕН!!!>", Объект.ВызываемыйОтчетОбработка, "")));
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеРеквизитовФормы()
	Если Не Объект.ВызываемыйОтчетОбработка	= "<!!!НЕ ОПРЕДЕЛЕН!!!>" Тогда
		Элементы.ГруппаНастройкиПараметровОбъекта.Видимость	= Истина;
	Иначе
		Элементы.ГруппаНастройкиПараметровОбъекта.Видимость	= Ложь;
	КонецЕсли;
	// Для отправки уведомлений
	Если Объект.ПочтовоеСообщениеТипТекста = ПредопределенноеЗначение("Перечисление.ТипТекстаПочтовогоСообщения.HTML") Тогда
		Элементы.ГруппаОбычныйТекст.Видимость			= Ложь;
		Элементы.ГруппаОбычныйТекст.Доступность			= Ложь;
		//---
		Объект.ПочтовоеСообщенияТекст					= "";
		//---
		Элементы.ГруппаФорматированныйТекст.Видимость	= Истина;
		Элементы.ГруппаФорматированныйТекст.Доступность	= Истина;
	Иначе
		Элементы.ГруппаОбычныйТекст.Видимость			= Истина;
		Элементы.ГруппаОбычныйТекст.Доступность			= Истина;
		//---
		ФорматированныйТекстПисьма.Удалить();
		//---
		Элементы.ГруппаФорматированныйТекст.Видимость	= Ложь;
		Элементы.ГруппаФорматированныйТекст.Доступность	= Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	// Кэш проверки
	ЭтоНовый			= Объект.Ссылка.Пустая();
	//---
	СозданКопированием	= НЕ ЗначениеКопирования.Пустая();
	// Заполняем кэш
	Кэш = ПолучитьКэш();
	// Создадим новое расписание регламентного задания
	Расписание = Новый РасписаниеРегламентногоЗадания;
	// Заполняем реквизиты при создании нового
	Если  ЭтоНовый И Не СозданКопированием Тогда
		Объект.РегламентАвтор				= ПараметрыСеанса.ТекущийПользователь;
		Объект.ПериодичностьРасписания		= Перечисления.ПериодичностиРасписанийРассылокОтчетов.Произвольное;
		Объект.ПочтовоеСообщениеВажность	= Перечисления.ВажностьПочтовогоСообщения.Обычная;
		Объект.ПочтовоеСообщениеТипТекста	= Перечисления.ТипТекстаПочтовогоСообщения.HTML;
		Объект.ВызываемыйОтчетОбработка		= "<!!!НЕ ОПРЕДЕЛЕН!!!>";
		Объект.РегламентУИД					= Новый УникальныйИдентификатор;
		//---
		УстановитьКластерИБазуСервер();
		//---
		ВариантРасписания = Неопределено;
		Параметры.Свойство("ВариантРасписания", ВариантРасписания);
		ЗаполнитьРасписаниеПоВарианту(ВариантРасписания);
	Иначе
		ПрочитатьРасписаниеРегламентногоЗадания();
		Объект.РегламентАвтор				= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	// Заполним необходимые реквизиты
	ВидимостьДоступностьКорректность(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Установим правильную видимость реквизитов формы
	ОбновитьОтображениеРеквизитовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПочтовоеСообщениеТипТекстаПриИзменении(Элемент)
	// Установим правильную видимость реквизитов формы
	ОбновитьОтображениеРеквизитовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВызываемыйОтчетОбработкаПриИзменении(Элемент)
	ОбновитьОтображениеРеквизитовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВыборОбъектовМетаданных" И Источник = УникальныйИдентификатор Тогда
		СтарыйВызываемыйОтчетОбработка	= Объект.ВызываемыйОтчетОбработка;
		//---
		Объект.ВызываемыйОтчетОбработка	= Параметр[0].Значение;
		ОбновитьОтображениеРеквизитовФормы();
		//---
		Если СтарыйВызываемыйОтчетОбработка <> Объект.ВызываемыйОтчетОбработка Тогда
			ПрочитатьРеквизитыОбъекта(, Ложь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Если наименование не заполнено, тогда ругаемся и не сохраняем
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Предупреждение("Не указано наименование настройки отчета!!!");
		Отказ	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьДоступностьКорректность(ЭтаФорма, Изменения = "")
	Объект		= ЭтаФорма.Объект;
	Элементы	= ЭтаФорма.Элементы;
	
	Если Изменения = "" ИЛИ Изменения = "ВыполнятьПоРасписанию" Тогда
		Элементы.ПараметрыВыполненияПоРасписанию.Доступность = Объект.РегламентАктивен;
		Элементы.СтраницыПериодичности.Доступность           = Объект.РегламентАктивен;
	КонецЕсли;
	
	Если Изменения = "" ИЛИ Изменения = "ПериодичностьРасписания" Тогда
		ИмяПеречисления = ЭтаФорма.Кэш.Перечисления.Периодичности[Объект.ПериодичностьРасписания];
		
		Элементы.СтраницыПериодичности.ТекущаяСтраница = Элементы["Страница"+ИмяПеречисления];
		Если ИмяПеречисления = "Произвольное" Тогда
			Элементы.СтраницыВремяИлиИзменить.ТекущаяСтраница = Элементы.СтраницаИзменитьРасписание;
		Иначе
			Элементы.СтраницыВремяИлиИзменить.ТекущаяСтраница = Элементы.СтраницаВремяНачала;
		КонецЕсли;
		
		// Сброс параметров, которые не соответствуют закладкам упрощенного редактирования
		Если Изменения = "ПериодичностьРасписания" И (ИмяПеречисления = "Ежедневно" ИЛИ ИмяПеречисления = "Еженедельно" ИЛИ ИмяПеречисления = "Ежемесячно") Тогда
			
			// Общие параметры
			ЭтаФорма.Расписание.ДатаНачала = '00010101';
			ЭтаФорма.Расписание.ДатаКонца  = '00010101';
			ЭтаФорма.Расписание.ВремяКонца = '00010101';
			ЭтаФорма.Расписание.ВремяЗавершения = '00010101';
			ЭтаФорма.Расписание.ДеньНеделиВМесяце = 0;
			ЭтаФорма.Расписание.ДетальныеРасписанияДня = Новый Массив;
			ЭтаФорма.Расписание.ИнтервалЗавершения = 0;
			ЭтаФорма.Расписание.ПаузаПовтора = 0;
			ЭтаФорма.Расписание.ПериодНедель = 0;
			ЭтаФорма.Расписание.ПериодПовтораВТечениеДня = 0;
			
			Если ИмяПеречисления <> "Ежедневно" Тогда
				ЭтаФорма.Расписание.ПериодПовтораДней = 1;
			КонецЕсли;
			
			Если ИмяПеречисления <> "Еженедельно" Тогда
				ВыбранныеДниНедели = Новый Массив;
				Для н = 1 По 7 Цикл
					ВыбранныеДниНедели.Добавить(н);
				КонецЦикла;
				ЭтаФорма.Расписание.ДниНедели = ВыбранныеДниНедели;
			КонецЕсли;
			
			Если ИмяПеречисления <> "Ежемесячно" Тогда
				ВсеМесяцы = Новый Массив;
				Для н = 1 По 12 Цикл
					ВсеМесяцы.Добавить(н);
				КонецЦикла;
				ЭтаФорма.Расписание.Месяцы = ВсеМесяцы;
				ЭтаФорма.Расписание.ДеньВМесяце = 0;
			КонецЕсли;
		КонецЕсли;
		
		// Восстанавливаем параметры на текущей закладке в соответствии с параметрами расписания
		Если ИмяПеречисления = "Ежедневно" Тогда
			ЭтаФорма.ВремяНачала = ЭтаФорма.Расписание.ВремяНачала;
			ЭтаФорма.ПериодПовтораДней = ЭтаФорма.Расписание.ПериодПовтораДней;
		ИначеЕсли ИмяПеречисления = "Еженедельно" Тогда
			ЭтаФорма.ВремяНачала = ЭтаФорма.Расписание.ВремяНачала;
			Для Каждого КлючИЗначение Из ЭтаФорма.Кэш.Соответствия.ДниНедели Цикл
				ЭтаФорма[КлючИЗначение.Ключ] = (ЭтаФорма.Расписание.ДниНедели.Найти(КлючИЗначение.Значение) <> Неопределено);
			КонецЦикла;
		ИначеЕсли ИмяПеречисления = "Ежемесячно" Тогда
			ЭтаФорма.ВремяНачала = ЭтаФорма.Расписание.ВремяНачала;
			Если ЭтаФорма.Расписание.ДеньВМесяце >= 0 Тогда
				ЭтаФорма.ДеньВМесяце = ЭтаФорма.Расписание.ДеньВМесяце;
				Элементы.ГиперссылкаНачалоКонецМесяца.Заголовок = НСтр("ru = 'начала'");
			Иначе	
				ЭтаФорма.ДеньВМесяце = -ЭтаФорма.Расписание.ДеньВМесяце;
				Элементы.ГиперссылкаНачалоКонецМесяца.Заголовок = НСтр("ru = 'конца'");
			КонецЕсли;
			Для Каждого КлючИЗначение Из ЭтаФорма.Кэш.Соответствия.Месяцы Цикл
				ЭтаФорма[КлючИЗначение.Ключ] = (ЭтаФорма.Расписание.Месяцы.Найти(КлючИЗначение.Значение) <> Неопределено);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли; // Изменения = "" ИЛИ Изменения = "ПериодичностьРасписания"
	
	Если Изменения = "" ИЛИ Изменения = "НачалоКонецМесяца" Тогда
		Элементы.ГиперссылкаНачалоКонецМесяца.Заголовок = ?(ЭтаФорма.Расписание.ДеньВМесяце >= 0, "начала", "конца");
	КонецЕсли;
	
	Если Изменения = "" ИЛИ Элементы.ГруппаНастройкиОбработкиЗадания.ТекущаяСтраница = Элементы.ГруппаНастройкаРасписания Тогда
		ЭтаФорма.ПредставлениеРасписания = Строка(ЭтаФорма.Расписание);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКэш()
	// Преобразование наименований в значения
	ДниНедели = Новый Соответствие;
	ДниНедели.Вставить("Понедельник", 1);
	ДниНедели.Вставить("Вторник",     2);
	ДниНедели.Вставить("Среда",       3);
	ДниНедели.Вставить("Четверг",     4);
	ДниНедели.Вставить("Пятница",     5);
	ДниНедели.Вставить("Суббота",     6);
	ДниНедели.Вставить("Воскресенье", 7);
	ДниНедели = Новый ФиксированноеСоответствие(ДниНедели);
	
	Месяцы = Новый Соответствие;
	Месяцы.Вставить("Январь",   1);
	Месяцы.Вставить("Февраль",  2);
	Месяцы.Вставить("Март",     3);
	Месяцы.Вставить("Апрель",   4);
	Месяцы.Вставить("Май",      5);
	Месяцы.Вставить("Июнь",     6);
	Месяцы.Вставить("Июль",     7);
	Месяцы.Вставить("Август",   8);
	Месяцы.Вставить("Сентябрь", 9);
	Месяцы.Вставить("Октябрь",  10);
	Месяцы.Вставить("Ноябрь",   11);
	Месяцы.Вставить("Декабрь",  12);
	Месяцы = Новый ФиксированноеСоответствие(Месяцы);
	
	//
	Периодичности = Новый Соответствие;
	Периодичности.Вставить(Перечисления.ПериодичностиРасписанийРассылокОтчетов.ПустаяСсылка(), "НеВыбрано");
	Для Каждого ОбъектМД Из Метаданные.Перечисления.ПериодичностиРасписанийРассылокОтчетов.ЗначенияПеречисления Цикл
		Периодичности.Вставить(Перечисления.ПериодичностиРасписанийРассылокОтчетов[ОбъектМД.Имя], ОбъектМД.Имя);
	КонецЦикла;
	Периодичности = Новый ФиксированноеСоответствие(Периодичности);
	
	Кэш = Новый Структура;
	Кэш.Вставить("Соответствия", Новый ФиксированнаяСтруктура("ДниНедели, Месяцы", ДниНедели, Месяцы));
	Кэш.Вставить("Перечисления", Новый ФиксированнаяСтруктура("Периодичности", Периодичности));
	Кэш = Новый ФиксированнаяСтруктура(Кэш);
	//
	Возврат Кэш;
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	// Кэш проверки
	ЭтоНовый			= Объект.Ссылка.Пустая();
	СозданКопированием	= НЕ ЗначениеКопирования.Пустая();
	//----
	Если Не ЭтоНовый Тогда
		Если Объект.ПочтовоеСообщениеТипТекста = Перечисления.ТипТекстаПочтовогоСообщения.HTML Тогда
			ФорматированныйТекстПисьма	= ТекущийОбъект.ПочтовоеСообщенияФорматированныйТекст.Получить();
		КонецЕсли;
		ПрочитатьРеквизитыОбъектаСервер(ТекущийОбъект);
	КонецЕсли; 
	//----
КонецПроцедуры

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// РАБОТА С РАСПИСАНИЕМ
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

&НаСервере
Процедура ПрочитатьРасписаниеРегламентногоЗадания()
	УстановитьПривилегированныйРежим(Истина);
	ИдентификаторЗадания = ?(СозданКопированием, ЗначениеКопирования.РегламентУИД, Объект.РегламентУИД);
	Если ТипЗнч(ИдентификаторЗадания) = Тип("УникальныйИдентификатор") Тогда
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
		Если Задание <> Неопределено Тогда
			Расписание = Задание.Расписание;
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Функция ИзменитьСоставМассива(Добавить, Элемент, Знач Массив)
	Индекс = Массив.Найти(Элемент);
	Если Добавить И Индекс = Неопределено Тогда
		ВГраницаПлюс1 = ?(Массив.Количество() >= Элемент, Элемент, Массив.Количество());
		Для н = 1 По ВГраницаПлюс1 Цикл
			Если Массив[ВГраницаПлюс1-н] < Элемент Тогда
				Массив.Вставить(ВГраницаПлюс1-н+1, Элемент);
				Возврат Массив;
			КонецЕсли;
		КонецЦикла;
		Массив.Вставить(0, Элемент);
	ИначеЕсли НЕ Добавить И Индекс <> Неопределено Тогда
		Массив.Удалить(Индекс);
	КонецЕсли;
	Возврат Массив;
КонецФункции

&НаКлиенте
Процедура РегламентАктивенПриИзменении(Элемент)
	ВидимостьДоступностьКорректность(ЭтаФорма, "ВыполнятьПоРасписанию");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРасписаниеВДиалоге()
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	Если ДиалогРасписания.ОткрытьМодально() Тогда
		Модифицированность = Истина;
		Расписание = ДиалогРасписания.Расписание;
		ВидимостьДоступностьКорректность(ЭтаФорма, "Расписание");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьРасписанияПриИзменении(Элемент)
	ВидимостьДоступностьКорректность(ЭтаФорма, "ПериодичностьРасписания");
	Если Кэш.Перечисления.Периодичности[Объект.ПериодичностьРасписания] = "Произвольное" Тогда
		ИзменитьРасписаниеВДиалоге();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаПриИзменении(Элемент)
	Расписание.ВремяНачала = ВремяНачала;
	ВидимостьДоступностьКорректность(ЭтаФорма, "ВремяНачала");
КонецПроцедуры

&НаКлиенте
Процедура МесяцыПриИзменении(Элемент)
	Если Элемент <> Неопределено Тогда
		Расписание.Месяцы = ИзменитьСоставМассива(ЭтаФорма[Элемент.Имя], Кэш.Соответствия.Месяцы[Элемент.Имя], Расписание.Месяцы);
	КонецЕсли;
	ВидимостьДоступностьКорректность(ЭтаФорма, "Месяцы");
КонецПроцедуры

&НаКлиенте
Процедура ДниНеделиПриИзменении(Элемент)
	Если Элемент <> Неопределено Тогда
		Расписание.ДниНедели = ИзменитьСоставМассива(ЭтаФорма[Элемент.Имя], Кэш.Соответствия.ДниНедели[Элемент.Имя], Расписание.ДниНедели);
	КонецЕсли;
	ВидимостьДоступностьКорректность(ЭтаФорма, "ДниНедели");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРасписание(Команда)
	ИзменитьРасписаниеВДиалоге();
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаНачалоКонецМесяцаНажатие(Элемент)
	Если Расписание.ДеньВМесяце = 0 Тогда
		ДеньВМесяце = 1;
		Расписание.ДеньВМесяце = -1;
	Иначе
		Расписание.ДеньВМесяце = -Расписание.ДеньВМесяце;
	КонецЕсли;
	Модифицированность = Истина;
	ВидимостьДоступностьКорректность(ЭтаФорма, "НачалоКонецМесяца");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасписаниеПоВарианту(Вариант, ОбновитьВидимость = Ложь)
	// Список вариантов - см. РассылкаОтчетовКлиентСервер.СписокВариантовЗаполненияРасписаний()
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	
	// в 7:30 утра
	Расписание.ВремяНачала = '00010101073000';
	
	// каждый день
	Расписание.ПериодПовтораДней = 1;
	
	// по дням недели
	ДеньНеделиМин = 1;
	ДеньНеделиМакс = 7;
	
	// по всем месяцам
	ВсеМесяцы = Новый Массив;
	Для н = 1 По 12 Цикл
		ВсеМесяцы.Добавить(н);
	КонецЦикла;
	Расписание.Месяцы = ВсеМесяцы;
	
	Если Вариант = 1 Тогда // "Каждый день"
		Объект.ПериодичностьРасписания = Перечисления.ПериодичностиРасписанийРассылокОтчетов.Ежедневно;
		
	ИначеЕсли Вариант = 2 Тогда // "Каждый второй день"
		Объект.ПериодичностьРасписания = Перечисления.ПериодичностиРасписанийРассылокОтчетов.Ежедневно;
		Расписание.ПериодПовтораДней = 2;
		
	ИначеЕсли Вариант = 3 Тогда // "Каждый четвертый день"
		Объект.ПериодичностьРасписания = Перечисления.ПериодичностиРасписанийРассылокОтчетов.Ежедневно;
		Расписание.ПериодПовтораДней = 4;
		
	ИначеЕсли Вариант = 4 Тогда // "По будням"
		Объект.ПериодичностьРасписания = Перечисления.ПериодичностиРасписанийРассылокОтчетов.Еженедельно;
		ДеньНеделиМин = 1;
		ДеньНеделиМакс = 5;
		
	ИначеЕсли Вариант = 5 Тогда // "По выходным"
		Объект.ПериодичностьРасписания = Перечисления.ПериодичностиРасписанийРассылокОтчетов.Еженедельно;
		Расписание.ВремяНачала = '00010101220000'; // в 10:00 вечера
		ДеньНеделиМин = 6;
		ДеньНеделиМакс = 7;
		
	ИначеЕсли Вариант = 6 Тогда // "По понедельникам"
		Объект.ПериодичностьРасписания = Перечисления.ПериодичностиРасписанийРассылокОтчетов.Еженедельно;
		ДеньНеделиМин = 1;
		ДеньНеделиМакс = 1;
		
	ИначеЕсли Вариант = 7 Тогда // "По пятницам"
		Объект.ПериодичностьРасписания = Перечисления.ПериодичностиРасписанийРассылокОтчетов.Еженедельно;
		ДеньНеделиМин = 5;
		ДеньНеделиМакс = 5;
		
	ИначеЕсли Вариант = 8 Тогда // "По воскресеньям"
		Объект.ПериодичностьРасписания = Перечисления.ПериодичностиРасписанийРассылокОтчетов.Еженедельно;
		Расписание.ВремяНачала = '00010101220000'; // в 10:00 вечера
		ДеньНеделиМин = 7;
		ДеньНеделиМакс = 7;
		
	ИначеЕсли Вариант = 9 Тогда // "В первый день месяца"
		Объект.ПериодичностьРасписания = Перечисления.ПериодичностиРасписанийРассылокОтчетов.Ежемесячно;
		Расписание.ДеньВМесяце = 1;
		
	ИначеЕсли Вариант = 10 Тогда // "В последний день месяца"
		Объект.ПериодичностьРасписания = Перечисления.ПериодичностиРасписанийРассылокОтчетов.Ежемесячно;
		Расписание.ДеньВМесяце = -1;
		
	ИначеЕсли Вариант = 11 Тогда // "Каждый квартал десятого числа"
		ВсеМесяцы = Новый Массив;
		ВсеМесяцы.Добавить(1);
		ВсеМесяцы.Добавить(4);
		ВсеМесяцы.Добавить(7);
		ВсеМесяцы.Добавить(10);
		Расписание.Месяцы = ВсеМесяцы;
		Объект.ПериодичностьРасписания = Перечисления.ПериодичностиРасписанийРассылокОтчетов.Ежемесячно;
		Расписание.ДеньВМесяце = 10;
		
	ИначеЕсли Вариант = 12 Тогда // "Другое..."
		Объект.ПериодичностьРасписания = Перечисления.ПериодичностиРасписанийРассылокОтчетов.Произвольное;
	
	Иначе
		Объект.ПериодичностьРасписания = Перечисления.ПериодичностиРасписанийРассылокОтчетов.Ежедневно;
		
	КонецЕсли;
	
	// по дням недели
	ВыбранныеДниНедели = Новый Массив;
	Для н = ДеньНеделиМин По ДеньНеделиМакс Цикл
		ВыбранныеДниНедели.Добавить(н);
	КонецЦикла;
	Расписание.ДниНедели = ВыбранныеДниНедели;
	
	Если ОбновитьВидимость Тогда
		ВидимостьДоступностьКорректность(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

// Возвращает набор шаблонов заполнения расписаний регламентного задания
&НаКлиенте
Функция СписокВариантовЗаполненияРасписаний() Экспорт
	
	СписокВариантов = Новый СписокЗначений;
	СписокВариантов.Добавить(1, НСтр("ru = 'Каждый день'"));
	СписокВариантов.Добавить(2, НСтр("ru = 'Каждый второй день'"));
	СписокВариантов.Добавить(3, НСтр("ru = 'Каждый четвертый день'"));
	СписокВариантов.Добавить(4, НСтр("ru = 'По будням'"));
	СписокВариантов.Добавить(5, НСтр("ru = 'По выходным'"));
	СписокВариантов.Добавить(6, НСтр("ru = 'По понедельникам'"));
	СписокВариантов.Добавить(7, НСтр("ru = 'По пятницам'"));
	СписокВариантов.Добавить(8, НСтр("ru = 'По воскресеньям'"));
	СписокВариантов.Добавить(9, НСтр("ru = 'В первый день месяца'"));
	СписокВариантов.Добавить(10, НСтр("ru = 'В последний день месяца'"));
	СписокВариантов.Добавить(11, НСтр("ru = 'Каждый квартал десятого числа'"));
	СписокВариантов.Добавить(12, НСтр("ru = 'Другое...'"));
	
	Возврат СписокВариантов;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	СписокВариантов = СписокВариантовЗаполненияРасписаний();
	
	Вариант = СписокВариантов.ВыбратьЭлемент(НСтр("ru = 'Выберите шаблон расписания'"));
	Если Вариант <> Неопределено Тогда
		ЗаполнитьРасписаниеПоВарианту(Вариант.Значение, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Все операции с регламентными заданиями размещены в модуле объекта
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Расписание", Расписание);
	// Запишем тело Форматированного документа если не простой текст письма
	ТекущийОбъект.ПочтовоеСообщенияФорматированныйТекст	= Новый ХранилищеЗначения(ФорматированныйТекстПисьма);
	// Запишем параметры регламента
	ТаблицаРеквизитов	= ДанныеФормыВЗначение(ЭтаФорма.РеквизитыОО, Тип("ТаблицаЗначений"));
	ТекущийОбъект.РеквизитыОбъекта		= Новый ХранилищеЗначения(ТаблицаРеквизитов);
	// Запишем параметры регламента на основе внесенных реквизитов ТЧ
	СоответствиеТаблиц	= Новый Соответствие;
	Для Каждого РеквизитФормыИмя ИЗ ЭтаФорма.СписокИменТабличныхЧастей Цикл
		ТаблицаРО		= РеквизитФормыВЗначение(РеквизитФормыИмя.Значение, Тип("ТаблицаЗначений"));
		ТаблицаРОИмя	= СтрЗаменить(РеквизитФормыИмя.Значение,"ТЧ_", "");
		
		СоответствиеТаблиц.Вставить(ТаблицаРОИмя, ТаблицаРО);
	КонецЦикла;
	//---
	ТекущийОбъект.РеквизитыОбъектаТабличные	= Новый ХранилищеЗначения(СоответствиеТаблиц);
	// Зафиксируем изменившего регламент
	ТекущийОбъект.РегламентИзменивший	= ПараметрыСеанса.ТекущийПользователь;
	// Зафиксируем автора если это новый
	Если ЭтоНовый Тогда
		ТекущийОбъект.РегламентАвтор	= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
КонецПроцедуры

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

&НаКлиенте
Процедура ФорматированныйТекстПисьмаПриИзменении(Элемент)
	Модифицированность	= Истина;
КонецПроцедуры

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// РАБОТА С МЕТАДАННЫМИ ДЛЯ ПОЛУЧЕНИЯ РЕКВИЗИТОВ ОБЪЕКТА И ИХ ЗАПОЛНЕНИЯ
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

&НаКлиенте
Процедура РеквизитыОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	
	Если Элемент.Родитель.ТекущиеДанные.Тип = Новый ОписаниеТипов() Тогда
		Элемент.ВыбиратьТип		= Истина;
		
	ИначеЕсли Элемент.Родитель.ТекущиеДанные.Тип.Типы().Количество()>1 Тогда
		Элемент.ВыбиратьТип		= Истина;
        Элемент.ОграничениеТипа	= Элемент.Родитель.ТекущиеДанные.Тип;
	
	Иначе
		Элемент.ВыбиратьТип		= Ложь;
		Элемент.ОграничениеТипа	= Элемент.Родитель.ТекущиеДанные.Тип;
	КонецЕсли;
	
	СтандартнаяОбработка	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОбъектаПриИзменении(Элемент)
	Элемент.ВыбиратьТип		= Истина;
	Элемент.ОграничениеТипа	= Новый ОписаниеТипов();
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОбъектаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Не Элемент.ТекущийЭлемент = Неопределено Тогда
		Если Элемент.ТекущийЭлемент.Имя	= "Значение" Тогда
			РеквизитыОбъектаПриИзменении(Элемент.ТекущийЭлемент);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОбъектаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОбъектаПередУдалением(Элемент, Отказ)
	Отказ	= Истина;
КонецПроцедуры

&НаСервере
Процедура ПрочитатьРеквизитыОбъектаСервер(ТекущийОбъект = Неопределено)
	СчетчикТаблицРеквизитов	= 0;	// Максимум 15 таблиц реквизитов
	ТолькоОчистка			= Ложь;
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	// ЧИТАЕМ ДАННЫЕ ПО ОБЫЧНЫМ РЕКВИЗИТАМ И ТАБЛИЧНЫМ ЧАСТЯМ ОБЪЕКТА ОБРАБОТКИ/ОТЧЕТА ДЛЯ ЗАПОЛНЕНИЯ
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	Если ТекущийОбъект = Неопределено Тогда
		//---
		Если Найти(Объект.ВызываемыйОтчетОбработка, "Обработка.")>0 Тогда
			ОО	= Обработки[СтрЗаменить(Объект.ВызываемыйОтчетОбработка, "Обработка.", "")].Создать();
		ИначеЕсли Найти(Объект.ВызываемыйОтчетОбработка, "Отчет.")>0 Тогда
			ОО	= Отчеты[СтрЗаменить(Объект.ВызываемыйОтчетОбработка, "Отчет.", "")].Создать();
		Иначе
			ТолькоОчистка	= Истина;
		КонецЕсли;
		//---
		// Инициируем необходимые объекты метаданных для нас
		МетаданныеОО			= ОО.Метаданные();
		МетаданныеОО_Реквизиты	= МетаданныеОО.Реквизиты;
		МетаданныеОО_ТЧ			= МетаданныеОО.ТабличныеЧасти;
		//---
		// Читаем данные о реквизитах объекта
		РеквизитыОО_Мета	= Новый ТаблицаЗначений;
		РеквизитыОО_Мета.Колонки.Добавить("ПроверкаЗаполнения");
		РеквизитыОО_Мета.Колонки.Добавить("ИД");
		РеквизитыОО_Мета.Колонки.Добавить("Тип");
		РеквизитыОО_Мета.Колонки.Добавить("Значение");
		//---
		Для каждого Реквизит Из МетаданныеОО_Реквизиты Цикл
			НовыйРеквизитОО	= РеквизитыОО_Мета.Добавить();
			
			НовыйРеквизитОО.ИД					= Реквизит.Имя;
			НовыйРеквизитОО.Тип					= Реквизит.Тип;
			НовыйРеквизитОО.ПроверкаЗаполнения	= Реквизит.ПроверкаЗаполнения;
		КонецЦикла; 
		//---
		// Читаем данные о табличных частях объекта
		СоответствиеТЧ_Мета	= Новый Соответствие;
		//---
		Для каждого МетаТабличнаяЧасть Из МетаданныеОО_ТЧ Цикл
			ТабличнаяЧасть	= Новый ТаблицаЗначений;
			//---
			МетаданныеОО_ТЧ_Реквизиты	= МетаТабличнаяЧасть.Реквизиты;
			Для каждого МетаРеквизитТЧ Из МетаданныеОО_ТЧ_Реквизиты Цикл
				ТабличнаяЧасть.Колонки.Добавить(МетаРеквизитТЧ.Имя, МетаРеквизитТЧ.Тип);
			КонецЦикла; 
			//---
			НоваяСтрокаТЧ	= ТабличнаяЧасть.Добавить();
			// Запомним созданную ТЧ
			СоответствиеТЧ_Мета.Вставить(МетаТабличнаяЧасть.Имя, ТабличнаяЧасть);
		КонецЦикла; 
		//---
	Иначе
		//---
		РеквизитыОО_Мета 		= ТекущийОбъект.РеквизитыОбъекта.Получить();
		СоответствиеТЧ_Мета	 	= ТекущийОбъект.РеквизитыОбъектаТабличные.Получить();
		//---
	КонецЕсли;
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	// ЗАПОЛНЯЕМ ОБЫЧНЫЕ РЕКВИЗИТЫ ОБЪЕКТА ОТЧЕТА/ОБРАБОТКИ И ДАННЫЕ ФОРМЫ НА ИХ ОСНОВАНИИ
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	// Создадим список удаления старых колонок чтобы перезаполнить ТЧ Реквизитов на форме
	Если Не РеквизитыОО_Мета = Неопределено Тогда
		Если Тип(РеквизитыОО_Мета) = Тип("ТаблицаЗначений") Тогда
			// Подготовим списки для удаления старых реквизитов и поудаляем старые элементы формы связанные с ними
			МассивУдаляемыхРеквизитов	= Новый Массив;
			
			КоллекцияКолонокРеквизитов	=	ПолучитьРеквизиты("РеквизитыОО");
			Для каждого РеквизитОО Из КоллекцияКолонокРеквизитов Цикл
				НайденныйЭлементРеквизитов	= Элементы.Найти("РеквизитыОО"+РеквизитОО.Имя);
				МассивУдаляемыхРеквизитов.Добавить("РеквизитыОО."+РеквизитОО.Имя);	
				
				Если Не НайденныйЭлементРеквизитов = Неопределено Тогда
					Элементы.Удалить(НайденныйЭлементРеквизитов);
				КонецЕсли;
			КонецЦикла; 
			// Удалим старые реквизиты ТЧ если есть перед заполнением
			ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов);
			//---
			// Если признак только очистки, то не заполняем реквизиты после удаления
			Если Не ТолькоОчистка Тогда
				// Заполним ТЧ Реквизитов
				МассивДобавляемыхРеквизитов	= Новый Массив;
				//---
				Для каждого Колонка Из РеквизитыОО_Мета.Колонки Цикл
					РеквизитФормы	= Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "РеквизитыОО", Колонка.Имя);
					МассивДобавляемыхРеквизитов.Добавить(РеквизитФормы);
				КонецЦикла; 
				//---
				ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
				//---
				Для каждого Колонка Из РеквизитыОО_Мета.Колонки Цикл
					Если Колонка.Имя = "ПроверкаЗаполнения" Тогда
						Продолжить;
					КонецЕсли;
					Элемент	= Элементы.Добавить("РеквизитыОО"+Колонка.Имя, Тип("ПолеФормы"), Элементы.РеквизитыОО);
					
					Элемент.Заголовок		= Колонка.Заголовок;
					Элемент.ПутьКДанным		= "РеквизитыОО."+Колонка.Имя;
					
					Если Колонка.Имя="Значение" Тогда
						Элемент.Вид				= ВидПоляФормы.ПолеВвода;
						Элемент.ТолькоПросмотр	= Ложь;
						Элемент.УстановитьДействие("НачалоВыбора", "РеквизитыОбъектаНачалоВыбора");
						Элемент.УстановитьДействие("ПриИзменении", "РеквизитыОбъектаПриИзменении");
					Иначе
						Элемент.Вид				= ВидПоляФормы.ПолеНадписи;
						Элемент.ТолькоПросмотр	= Истина;
					КонецЕсли;
				КонецЦикла;
				//---
				ЭтаФорма.РеквизитыОО.Загрузить(РеквизитыОО_Мета);
				// Включим раскраску для реквизитов
				ЭтаФорма.УсловноеОформление.Элементы.Очистить();
				//---
				ЭлементУсловногоОформления	= УсловноеОформление.Элементы.Добавить();
				ОформляемыеПоля				= ЭлементУсловногоОформления.Поля.Элементы;
				
				ОформляемоеПоле				= ОформляемыеПоля.Добавить();
				ОформляемоеПоле.Поле		= Новый ПолеКомпоновкиДанных("РеквизитыООИД");
				ОформляемоеПоле				= ОформляемыеПоля.Добавить();
				ОформляемоеПоле.Поле		= Новый ПолеКомпоновкиДанных("РеквизитыООТип");
				ОформляемоеПоле				= ОформляемыеПоля.Добавить();
				ОформляемоеПоле.Поле		= Новый ПолеКомпоновкиДанных("РеквизитыООЗначение");
				
				ЭлементОтбора				= ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("РеквизитыОО.ПроверкаЗаполнения");
				ЭлементОтбора.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение= ПроверкаЗаполнения.ВыдаватьОшибку;
				
				ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЖелтоЗеленый);
				//---
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	// ЗАПОЛНЯЕМ ТАБЛИЧНЫЕ ЧАСТИ ОБЪЕКТА ОТЧЕТА/ОБРАБОТКИ И ЗАПОЛНЯЕМ ДАННЫЕ ФОРМЫ НА ИХ ОСНОВАНИИ
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	Если Не СоответствиеТЧ_Мета = Неопределено Тогда
		Если Тип(СоответствиеТЧ_Мета) = Тип("Соответствие") Тогда
			//---
		    ТипыРеквизита = Новый Массив;
		    ТипыРеквизита.Добавить(Тип("ТаблицаЗначений"));
		    ОписаниеТиповДляТЧ = Новый ОписаниеТипов(ТипыРеквизита);
			//---
			МассивУдаляемыхРеквизитов	= Новый Массив;
			//---	
			Для Каждого РеквизитФормыИмя ИЗ ЭтаФорма.СписокИменТабличныхЧастей Цикл
				МассивУдаляемыхРеквизитов.Добавить(РеквизитФормыИмя.Значение);
				Элементы.Удалить(Элементы["Страница"+РеквизитФормыИмя.Значение]);
			КонецЦикла;
			//---
			ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов);
			//---
			СписокТабличныхЧастей		= Новый Массив;
			//---
			Если Не ТолькоОчистка Тогда
				// Создадим реквизиты формы
				МассивДобавляемыхРеквизитов	= Новый Массив;
				//---
				Для каждого ЭлементСоответствияТЧ Из СоответствиеТЧ_Мета Цикл
					ИмяТаблицы		= ЭлементСоответствияТЧ.Ключ;
					ТабличнаяЧасть	= ЭлементСоответствияТЧ.Значение;
					// Создаем реквизиты формы
					ТабличнаяЧастьРФ = Новый РеквизитФормы("ТЧ_"+ИмяТаблицы, ОписаниеТиповДляТЧ);
					//---
					МассивДобавляемыхРеквизитов.Добавить(ТабличнаяЧастьРФ);
					СписокТабличныхЧастей.Добавить("ТЧ_"+ИмяТаблицы);
					// Получим метаданные колонок тек. ТЧ
					МетаданныеКолонкиТЧ	= ТабличнаяЧасть.Колонки;
					//---
					Для Каждого КолонкаТЧ ИЗ МетаданныеКолонкиТЧ Цикл
						КолонкаТЧРФ	= Новый РеквизитФормы(КолонкаТЧ.Имя, КолонкаТЧ.ТипЗначения, "ТЧ_"+ИмяТаблицы, КолонкаТЧ.Имя, Ложь);
						//---
						МассивДобавляемыхРеквизитов.Добавить(КолонкаТЧРФ);
					КонецЦикла;
				КонецЦикла; 
				//---
				ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
				// Создадим объекты для отображения реквизитов формы
				Для каждого ЭлементСоответствияТЧ Из СоответствиеТЧ_Мета Цикл
					ИмяТаблицы		= ЭлементСоответствияТЧ.Ключ;
					ТабличнаяЧасть	= ЭлементСоответствияТЧ.Значение;
					// Создадим страницу для реквизитов ТЧ
					НовыйЭлементСтраница = Элементы.Добавить("СтраницаТЧ_"+ИмяТаблицы, Тип("ГруппаФормы"), Элементы.ГруппаСтраницыРеквизитовТЧ);
				    НовыйЭлементСтраница.Вид = ВидГруппыФормы.Страница;
					НовыйЭлементСтраница.Заголовок = ИмяТаблицы;
					// Создадим ТЧ на форме
					НовыйЭлементТаблица								= Элементы.Добавить("ТЧ_"+ИмяТаблицы, Тип("ТаблицаФормы"), НовыйЭлементСтраница);
					НовыйЭлементТаблица.Заголовок					= ИмяТаблицы;
					НовыйЭлементТаблица.ПутьКДанным					= "ТЧ_"+ИмяТаблицы;
					НовыйЭлементТаблица.Отображение					= ОтображениеТаблицы.Список;
					НовыйЭлементТаблица.ПоложениеКоманднойПанели	= ПоложениеКоманднойПанелиЭлементаФормы.Верх;
					НовыйЭлементТаблица.ТолькоПросмотр				= Ложь;
					//---
					СписокИменТабличныхЧастей.Добавить("ТЧ_"+ИмяТаблицы);
					// Получим метаданные колонок тек. ТЧ
					МетаданныеКолонкиТЧ	= ТабличнаяЧасть.Колонки;
					//---
					Для Каждого КолонкаТЧ ИЗ МетаданныеКолонкиТЧ Цикл
						// Создадим элемент формы колонка у ТЧ
						НовыйЭлементКолонкаТЧ				= Элементы.Добавить("ТЧ_"+ИмяТаблицы+КолонкаТЧ.Имя, Тип("ПолеФормы"), НовыйЭлементТаблица);
						НовыйЭлементКолонкаТЧ.Вид			= ВидПоляФормы.ПолеВвода;
						НовыйЭлементКолонкаТЧ.Заголовок		= КолонкаТЧ.Имя;
						НовыйЭлементКолонкаТЧ.ПутьКДанным	= "ТЧ_"+ИмяТаблицы+"."+КолонкаТЧ.Имя;
						НовыйЭлементКолонкаТЧ.ТолькоПросмотр= Ложь;
					КонецЦикла;
					//---
					ЭтаФорма["ТЧ_"+ИмяТаблицы].Загрузить(ТабличнаяЧасть);
					//---
				КонецЦикла;
				//---
			КонецЕсли;
			//---
			ЭтаФорма.СписокИменТабличныхЧастей.ЗагрузитьЗначения(СписокТабличныхЧастей);
			//---
		КонецЕсли;
	КонецЕсли;	
	//---
	ОО	= "";
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьРеквизитыОбъекта(Команда=Неопределено, ЗадатьВопрос = Истина)
	Если ЗадатьВопрос Тогда
		Ответ	= Вопрос("Если есть старые настройки, то они будут стерты!
				|Перечитать данные?", РежимДиалогаВопрос.ДаНет);
	Иначе
		Ответ	= КодВозвратаДиалога.Да;
	КонецЕсли;
		
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПрочитатьРеквизитыОбъектаСервер();
		Модифицированность	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыООПриИзменении(Элемент)
	Модифицированность	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыООПриАктивизацииЯчейки(Элемент)
	Если Элемент.ТекущийЭлемент.Имя = "РеквизитыООЗначение" Тогда
		Если Элемент.ТекущиеДанные.Тип = Новый ОписаниеТипов() Тогда
			Элемент.ТекущийЭлемент.ВыбиратьТип		= Истина;
		ИначеЕсли Элемент.ТекущиеДанные.Тип.Типы().Количество()>1 Тогда
			Элемент.ТекущийЭлемент.ВыбиратьТип		= Истина;
	        Элемент.ТекущийЭлемент.ОграничениеТипа	= Элемент.ТекущиеДанные.Тип;
		Иначе
			Элемент.ТекущийЭлемент.ВыбиратьТип		= Ложь;
			Элемент.ТекущийЭлемент.ОграничениеТипа	= Элемент.ТекущиеДанные.Тип;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// РАБОТА С ДАННЫМИ КЛАСТЕРА И БАЗЫ
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

&НаСервере
Процедура УстановитьКластерИБазуСервер()
	Попытка
		Объект.КластерСерверов		= ПараметрыСеанса.ТекущийКластерСерверов;
		Объект.ИнформационнаяБаза	= ПараметрыСеанса.ТекущаяИнформационнаяБаза;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКластерИБазу(Команда)
	УстановитьКластерИБазуСервер();
КонецПроцедуры

