#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сведения = РеквизитФормыВЗначение("Отчет").СведенияОВнешнейОбработке();
	Заголовок = СтрШаблон("Версия: %1", Сведения.Версия);
	
	Если СтрНайти(ВРег(СтрокаСоединенияИнформационнойБазы()), "PROD") = 0 Тогда
		Элементы.ТестовыйРежим.Видимость = Истина;
	Иначе
		Элементы.ТестовыйРежим.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли; 
	
	СформироватьОтчетНаСервере();
	Элементы.ДанныеДляЛиста6.Доступность = Истина;
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Результат.Очистить();
	Сообщить("Старт расчета: " + ТекущаяДатаСеанса());
	РезультатФормированияОтчета = РеквизитФормыВЗначение("Отчет").СформироватьОтчет(УникальныйИдентификатор);
	Сообщить("Расчет завершен: " + ТекущаяДатаСеанса());
	Результат.Вывести(ПолучитьИзВременногоХранилища(РезультатФормированияОтчета.АдресМакета));
	АдресРасшифровкиПоказателей = РезультатФормированияОтчета.АдресРасшифровкиПоказателей;
	
КонецПроцедуры

&НаКлиенте
Процедура Расшифровать(Команда)
	
	РегламентированнаяОтчетностьКлиент.РасшифроватьСуммуОтчета(АдресРасшифровкиПоказателей, Элементы.Результат.ТекущаяОбласть.Имя, Заголовок);
	
КонецПроцедуры

&НаСервере
Функция ДанныеДляЛиста6НаСервере()
	
	ТабДок = РеквизитФормыВЗначение("Отчет").ДанныеДляЛиста6Декларации(Результат);
	Возврат  ТабДок;
	
КонецФункции

&НаКлиенте
Процедура ДанныеДляЛиста6(Команда)
	ТабДок = ДанныеДляЛиста6НаСервере();
	ТабДок.Показать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
