
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФайлВыгрузки = "IBUsers.xml";
	ФайлЗагрузки = "IBUsers.xml";
	ПриоритетФайла = Ложь;
	ФормироватьПротокол = Истина;
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьПользователейНаСервере()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ВыгрузитьПользователей();
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьПользователей(Команда)
	
	Состояние(NStr("ru = 'Выполняется выгрузка списка пользователей...'", "ru"));
	Результат = ВыгрузитьПользователейНаСервере();
	Если НЕ Результат.Статус Тогда
		
		Предупреждение(NStr("ru = 'При выполнении выгрузки пользователей произошла ошибка.'", "ru"));
		Возврат;
		
	КонецЕсли;
	
	Текст = NStr("ru = 'Файл со списком пользователей подготовлен для сохранения на диск. Выполнена выгрузка пользователей: %1'", "ru");
	Текст = СтрЗаменить(Текст, "%1", Результат.Количество);
	Предупреждение(Текст);
	
	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		
		ДиалогСохранения = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогСохранения.Заголовок = NStr("ru = 'Укажите файл для сохранения списка пользователей'", "ru");
		ДиалогСохранения.ПроверятьСуществованиеФайла = Ложь;
		ДиалогСохранения.ПолноеИмяФайла = ФайлВыгрузки;
		ДиалогСохранения.Фильтр = NStr("ru = 'XML-файлы (*.xml)|*.xml'", "ru");
		СостояниеВыгрузки = ДиалогСохранения.Выбрать();
		Если НЕ СостояниеВыгрузки Тогда
			
			Предупреждение(NStr("ru = 'Выгрузка отменена'", "ru"));
			Возврат;
			
		КонецЕсли;
		
		Получаемые = Новый Массив;
		ПолучаемыйФайл = Новый ОписаниеПередаваемогоФайла;
		ПолучаемыйФайл.Имя = ДиалогСохранения.ПолноеИмяФайла;
		ПолучаемыйФайл.Хранение = Результат.Адрес;
		Получаемые.Добавить(ПолучаемыйФайл);
		Полученные = Новый Массив;
		ПолучитьФайлы(Получаемые, Полученные, "", Ложь);
		
	Иначе
		
		ПолучитьФайл(Результат.Адрес, ФайлВыгрузки, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьПользователейНаСервере(Адрес)
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ЗагрузитьПользователей(Адрес, ПриоритетФайла, ФормироватьПротокол);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПользователей(Команда)
	
	ИмяПротокола = "IBUsers.log";
	Адрес = "";
	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		
		ПомещенныеФайлы = Новый Массив;
		ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогВыбора.Заголовок = NStr("ru = 'Укажите файл со списком пользователей'", "ru");
		ДиалогВыбора.МножественныйВыбор = Ложь;
		ДиалогВыбора.ПроверятьСуществованиеФайла = Истина;
		ДиалогВыбора.ПолноеИмяФайла = ФайлЗагрузки;
		ДиалогВыбора.Фильтр = NStr("ru = 'XML-файлы (*.xml)|*.xml'", "ru");
		Результат = ПоместитьФайлы( , ПомещенныеФайлы, ДиалогВыбора, Истина);
		Если Результат = Ложь Тогда
			
			Возврат;
			
		КонецЕсли;
		Адрес = ПомещенныеФайлы[0].Хранение;
		ФайлЗагрузки = ПомещенныеФайлы[0].Имя;
		
	Иначе
		
		Результат = ПоместитьФайл(Адрес, ФайлЗагрузки, ФайлЗагрузки, Истина);
		Если Результат = Ложь Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	Состояние(NStr("ru = 'Выполняется загрузка пользователей информационной базы...'", "ru"));
	Результат = ЗагрузитьПользователейНаСервере(Адрес);
	Если Результат.Статус = Ложь Тогда
		
		Предупреждение(NStr("ru = 'При выполнении загрузки пользователей произошла ошибка.'", "ru"));
		
	Иначе
		
		Текст = NStr("ru = 'Загрузка пользователей завершена. Всего прочитано: %1. Загружено: %2. Совпадений: %3.'", "ru");
		Текст = СтрЗаменить(Текст, "%1", Результат.ИзФайла);
		Текст = СтрЗаменить(Текст, "%2", Результат.Загружено);
		Текст = СтрЗаменить(Текст, "%3", Результат.Совпадений);
		Предупреждение(Текст);
		
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		
		Если ФормироватьПротокол Тогда
			
			ПолучитьФайл(Результат.ФайлПротокола, ИмяПротокола, Истина);
			
		КонецЕсли;
	
	#Иначе

		Если ФормироватьПротокол Тогда
			
			Файл = Новый Файл(ФайлЗагрузки);
			ФайлПротокола = Файл.Путь + ИмяПротокола;
			ПолучитьФайл(Результат.ФайлПротокола, ФайлПротокола, Ложь);
			Текст = Новый ТекстовыйДокумент;
			Текст.Прочитать(ФайлПротокола);
			Текст.Показать("Протокол загрузки пользователей");
			
		КонецЕсли;
	
	#КонецЕсли

КонецПроцедуры
