Перем масСообщения;
Перем ТелоПисьма;
Перем ЭтоВызовСКлиента; // IMAPPS-26041
Перем ИдентификаторКомандыДляЗамера; // IMDEV-8927

/////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ИНТЕРФЕЙСОВ

// Интерфейс для регистрации обработки.
// Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение:
// Структура:
// Вид - строка - возможные значения:	"ДополнительнаяОбработка"
//										"ДополнительныйОтчет"
//										"ЗаполнениеОбъекта"
//										"Отчет"
//										"ПечатнаяФорма"
//										"СозданиеСвязанныхОбъектов"
//
// Назначение - массив строк имен объектов метаданных в формате:
//			<ИмяКлассаОбъектаМетаданного>.[ * | <ИмяОбъектаМетаданных>]
//			Например, "Документ.СчетЗаказ" или "Справочник.*"
//			Прим. параметр имеет смысл только для назначаемых обработок
//
// Наименование - строка - наименование обработки, которым будет заполнено
//						наименование справочника по умолчанию - краткая строка для
//						идентификации обработки администратором
//
// Версия - строка - версия обработки в формате <старший номер>.<младший номер>
//					используется при загрузке обработок в информационную базу
// БезопасныйРежим – Булево – Если истина, обработка будет запущена в безопасном режиме.
//							Более подбробная информация в справке.
//
// Информация - Строка- краткая информация по обработке, описание обработки
//
// ВерсияБСП - Строка - Минимальная версия БСП, на которую рассчитывает код
// дополнительной обработки. Номер версии БСП задается в формате «РР.ПП.ВВ.СС»
// (РР – старший номер редакции; ПП – младший номер ре-дакции; ВВ – номер версии; СС – номер сборки).
//
// Команды - ТаблицаЗначений - команды, поставляемые обработкой, одная строка таблицы соотвествует
//							одной команде
//				колонки: 
//				 - Представление - строка - представление команды конечному пользователю
//				 - Идентификатор - строка - идентефикатор команды. В случае печатных форм
//											перечисление через запятую списка макетов
//				 - Использование - строка - варианты запуска обработки:
//						"ОткрытиеФормы" - открыть форму обработки
//						"ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//						"ВызовСерверногоМетода" - вызов серверного экспортного метода из модуля объекта обработки
//				 - ПоказыватьОповещение – Булево – если Истина, требуется оказывать оповещение при начале
//								и при окончании запуска обработки. Прим. Имеет смысл только
//								при запуске обработки без открытия формы.
//				 - Модификатор – строка - для печатных форм MXL, которые требуется
//										отображать в форме ПечатьДокументов подсистемы Печать
//										требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	// Объявим переменную, в которой мы сохраним и вернем "наружу" необходимые данные
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Назначение", Неопределено);
	ПараметрыРегистрации.Вставить("Наименование", НСтр("ru = 'Пакетный отчет брокера ДУ'"));
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Версия", "2.41");
	ПараметрыРегистрации.Вставить("Информация", НСтр("ru = 'Отчет брокера ВТБ'"));
	
	// Создадим таблицу команд (подробнее смотрим ниже)
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "Открыть обработку ""Пакетный отчет брокера ДУ""", "Напечатать отчет брокера ВТБ", "ОткрытиеФормы", Истина, "");
	ДобавитьКоманду(ТаблицаКоманд, "Запустить обработку ""Пакетный отчет брокера ДУ"" (фон.)", "ФоновоеВыполнение", "ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
КонецФункции

/////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//IMAPPS-11276
Функция ПолучитьТорговыйКод(СубСчет)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТорговыеКоды.Ссылка КАК Ссылка,
		|	ТорговыеКоды.Наименование КАК Наименование,
		|	ТорговыеКоды.АналитическийСчетДС КАК АналитическийСчетДС,
		|	ТорговыеКоды.Брокер КАК Брокер,
		|	ТорговыеКоды.ДоговорБрокера КАК ДоговорБрокера,
		|	ТорговыеКоды.ДоговорДУ КАК ДоговорДУ,
		|	ТорговыеКоды.ТорговыйКод КАК ТорговыйКод
		|ИЗ
		|	Справочник.ТорговыеКоды КАК ТорговыеКоды
		|ГДЕ
		|	ТорговыеКоды.Наименование = &СубСчет
		|	И НЕ ТорговыеКоды.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("СубСчет", СубСчет);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
//IMAPPS-11276

Функция ПолучитьТорговыйКодПоСчетуБрокера(СубСчет, ТорговыйКод, ВалютаКод)
	
	Если ВалютаКод = "RUR" Тогда 
		ВалютаCashFlows = "RUB";
	Иначе
		ВалютаCashFlows = ВалютаКод;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТорговыеКоды.Ссылка КАК Ссылка,
		|	ТорговыеКоды.Наименование КАК Наименование,
		|	ТорговыеКоды.АналитическийСчетДС КАК АналитическийСчетДС,
		|	ТорговыеКоды.Брокер КАК Брокер,
		|	ТорговыеКоды.ДоговорБрокера КАК ДоговорБрокера,
		|	ТорговыеКоды.ДоговорДУ КАК ДоговорДУ,
		|	ТорговыеКоды.ТорговыйКод КАК ТорговыйКод
		|ИЗ
		|	Справочник.ТорговыеКоды КАК ТорговыеКоды
		|ГДЕ
		|	ТорговыеКоды.АналитическийСчетДС.АналитическийПризнакСчетаБрокера.Наименование = &ТорговыйКод
		|	И ВЫРАЗИТЬ(ТорговыеКоды.АналитическийСчетДС.МестоХранения КАК Справочник.БанковскиеСчета).ВалютаДенежныхСредств.Наименование = &ВалютаКод
		|	И ТорговыеКоды.Наименование ПОДОБНО ""%/"" + &СубСчет
		|	И НЕ ТорговыеКоды.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ТорговыеКоды.Ссылка,
		|	ТорговыеКоды.Наименование,
		|	ТорговыеКоды.АналитическийСчетДС,
		|	ТорговыеКоды.Брокер,
		|	ТорговыеКоды.ДоговорБрокера,
		|	ТорговыеКоды.ДоговорДУ,
		|	ТорговыеКоды.ТорговыйКод
		|ИЗ
		|	Справочник.ТорговыеКоды КАК ТорговыеКоды
		|ГДЕ
		|	ВЫРАЗИТЬ(ТорговыеКоды.АналитическийСчетДС.МестоХранения КАК Справочник.БанковскиеСчета).НомерСчета = &ТорговыйКод
		|	И ВЫРАЗИТЬ(ТорговыеКоды.АналитическийСчетДС.МестоХранения КАК Справочник.БанковскиеСчета).ВалютаДенежныхСредств.Наименование = &ВалютаКод
		|	И ТорговыеКоды.Наименование ПОДОБНО ""%/"" + &СубСчет
		|	И НЕ ТорговыеКоды.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ТорговыеКоды.Ссылка,
		|	ТорговыеКоды.Наименование,
		|	ТорговыеКоды.АналитическийСчетДС,
		|	ТорговыеКоды.Брокер,
		|	ТорговыеКоды.ДоговорБрокера,
		|	ТорговыеКоды.ДоговорДУ,
		|	ТорговыеКоды.ТорговыйКод
		|ИЗ
		|	Справочник.ТорговыеКоды КАК ТорговыеКоды
		|ГДЕ
		|	ВЫРАЗИТЬ(ТорговыеКоды.АналитическийСчетДС.МестоХранения КАК Справочник.БанковскиеСчета).НомерСчета = &ТорговыйКод
		|	И ВЫРАЗИТЬ(ТорговыеКоды.АналитическийСчетДС.МестоХранения КАК Справочник.БанковскиеСчета).ВалютаДенежныхСредств.Наименование = &ВалютаКод
		|	И ТорговыеКоды.Наименование = &СубСчет
		|	И НЕ ТорговыеКоды.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ТорговыйКод", ТорговыйКод);
	Запрос.УстановитьПараметр("ВалютаКод", ВалютаCashFlows);
	Запрос.УстановитьПараметр("СубСчет", СубСчет);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция УстановитьНастройки(ПараметрыВыполненияКоманды)
	
	НастройкиВыполнения = ПараметрыВыполненияКоманды.ПараметрыДополнительнойОбработки;
	Если ТипЗнч(НастройкиВыполнения) <> Тип("Структура") тогда возврат "<Настройки не установлены>"; КонецЕсли;
	ЗначенияНастроек = НастройкиВыполнения;
	ПредставлениеНастроек = "";
	УстановитьПользовательскиеНастройки(ЗначенияНастроек,ПредставлениеНастроек);
	
	Возврат ПредставлениеНастроек;
КонецФункции

Процедура УстановитьПользовательскиеНастройки(Настройки, ПредставлениеНастроек="") Экспорт
	
	Если Настройки.Свойство("Значения") тогда
		Почта = Неопределено;
		Если Настройки.Значения.Свойство("ПочтовыйЛогин", Почта) тогда
			ПочтовыйЛогин = Почта;
			Ящики = XMLЗначение(Тип("ХранилищеЗначения"),Настройки.Значения.СписокРассылки);
			СписокРассылки.Загрузить(Ящики.Получить());
		КонецЕсли;
		Настройки.Значения.Свойство("ПериодЧас", ПериодЧас);
		ПредставлениеНастроек = "Период отчета:"+ПериодЧас;
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьТаблицуКоманд()
	
	// Создадим пустую таблицу команд и колонки в ней
	Команды = Новый ТаблицаЗначений;
	
	// Как будет выглядеть описание печатной формы для пользователя
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
	
	// Имя нашего макета, что бы могли отличить вызванную команду в обработке печати
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	
	// Тут задается, как должна вызваться команда обработки
	// Возможные варианты:
	// - ОткрытиеФормы - в этом случае в колонке идентификатор должно быть указано имя формы, которое должна будет открыть система
	// - ВызовКлиентскогоМетода - вызвать клиентскую экспортную процедуру из модуля формы обработки
	// - ВызовСерверногоМетода - вызвать серверную экспортную процедуру из модуля объекта обработки
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	
	// Следующий параметр указывает, необходимо ли показывать оповещение при начале и завершению работы обработки. Не имеет смысла при открытии формы
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	
	// Для печатной формы должен содержать строку ПечатьMXL 
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	// Добавляем команду в таблицу команд по переданному описанию.
	// Параметры и их значения можно посмотреть в функции ПолучитьТаблицуКоманд
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	масСообщения = новый Массив;
	ДополнительнаяОбработкаСсылка = ПараметрыВыполненияКоманды.ДополнительнаяОбработкаСсылка; // IMAPPS-26041
	
	Если ИдентификаторКоманды = "ФоновоеВыполнение" Тогда 
		
		// IMDEV-8927 ++
		ИдентификаторКомандыДляЗамера = ИдентификаторКоманды;
		// IMDEV-8927 --
		
		ВажностьОшибки = 0;
		
		ПредставлениеНастроек = УстановитьНастройки(ПараметрыВыполненияКоманды);
		
		НачДня = НачалоДня(ТекущаяДата());
		ПредРабочийДень = КалендарныеГрафики.ПолучитьПоследнийРабочийДеньПериода(,НачДня-30*24*3600, НачДня-1); //-1*24*3600
		
		Задача = Задачи.ЗадачаИнтеграции.СоздатьЗадачу();
		Задача.Дата = ТекущаяДата();
		
		Задача.ВидОбмена 		= ДополнительнаяОбработкаСсылка;
		Задача.ВерсияОбработки 	= ОбщегоНазначения.ПолучитьЗначениеРеквизита(ДополнительнаяОбработкаСсылка, "Версия");
		Задача.Наименование 	= "Загрузка операций по брокерскому счету в фоновом режиме";
		Задача.ПараметрыВыполнения = ПредставлениеНастроек;
	    Попытка
			СчитатьДанныеSQL(ПредРабочийДень,ВажностьОшибки);
		Исключение    
			Инфо = ИнформацияОбОшибке().Описание;
			ДобавитьСообщение("", Инфо.ИмяМодуля, Инфо.НомерСтроки,  Инфо.ИсходнаяСтрока, Инфо.Описание, СтатусСообщения.ОченьВажное);
			ВажностьОшибки = 2;
		КонецПопытки;			
		
		ТекстТаблицаОпераций = "";
		
		// запишем строки исходной таблицы в текст письма
		ТелоПисьма = "";
		РассылкаСообщения_Заголовок("Не проведенные операции по счету брокера");
		х = новый Массив;
		х.Добавить("№");
		х.Добавить("Торговый код");
		х.Добавить("Дата");
		х.Добавить("Договор ДУ");
		х.Добавить("Брокер");
		х.Добавить("Договор брокера");
		х.Добавить("Назначение платежа");
		х.Добавить("Приход");
		х.Добавить("Расход");
		х.Добавить("Операция в базе 1С");
		РассылкаСообщения_ЗаголовокТаблицы(х);
		
		Попытка
			// IMAPPS-26041++
			// СоздатьОперацииПоБрокерскомуСчету(ВажностьОшибки,ЛОЖЬ);
			СоздатьОперацииПоБрокерскомуСчетуВПотоках(ВажностьОшибки,ЛОЖЬ);
			// IMAPPS-26041--
		Исключение    
			Инфо = ИнформацияОбОшибке();
			ДобавитьСообщение("", Инфо.ИмяМодуля, Инфо.НомерСтроки,  Инфо.ИсходнаяСтрока, Инфо.Описание, СтатусСообщения.ОченьВажное);
			ВажностьОшибки = 2;
		КонецПопытки;	
			
		
		РассылкаСообщения_ПодвалТаблицы();
		
		Если СписокРассылки.Количество()>0 и НЕ ПочтовыйЛогин.Пустая() тогда
			
			текстРассылки = СформироватьИОтправитьПисьмо(ПредРабочийДень,ВажностьОшибки);
			
			Для каждого Сообщение Из масСообщения Цикл
				Задача.Описание = Задача.Описание + Символы.ПС + Сообщение.Текст;
			КонецЦикла;
			
		КонецЕсли;
		
		Задача.Описание = Задача.Описание + Символы.ПС + Символы.ПС + текстРассылки;
		Задача.ВыполнитьЗадачу();
		
		// IMDEV-8927 ++
		ИдентификаторКомандыДляЗамера = Неопределено;
		// IMDEV-8927 --
		
	// IMAPPS-26041++
	ИначеЕсли ИдентификаторКоманды = "КомандаСоздатьОперацииПоБрокерскомуСчетуПоток" Тогда
		
		ПредставлениеНастроек = УстановитьНастройки(ПараметрыВыполненияКоманды);
		СоздатьОперацииПоБрокерскомуСчетуПоток(ПараметрыВыполненияКоманды);
	// IMAPPS-26041--
	
	КонецЕсли;
	
КонецПроцедуры

// IMDEV-8927 ++
// Описание: Добавляет в комментарий замера скорость обработки (вес / время), об/с.
//
// Параметры:
// Вес - Число - количество обработанных объектов
// ВремяНачала - Число - метка начала замера в миллисекундах
//
// Возвращаемое значение:
// Строка - фрагмент комментария вида "; УдельныйВес=1.25 об/с"
//
Функция ДополнениеКомментарияУдельныйВес(Вес, ВремяНачала)
	
	ДлительностьСек = (ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала) / 1000;
	Скорость = ?(ДлительностьСек > 0, Вес / ДлительностьСек, 0);
	
	Возврат "; УдельныйВес=" + Формат(Скорость, "ЧЦ=10; ЧДЦ=2") + " об/с";
	
КонецФункции

// Описание: Формирует имя ключевой операции БСП для замера по этапу и контуру запуска.
//
// Параметры:
// ЭтапЗамера - Строка - этап (ПолучениеSQL, СозданиеОпераций)
//
// Возвращаемое значение:
// Строка - имя ключевой операции в формате ДУ.ПакетныйОтчетБрокера.<Этап>.<Контур>
//
Функция ПолучитьИмяКлючевойОперацииЗамера(Знач ЭтапЗамера)
	
	Возврат "ДУ.ПакетныйОтчетБрокера." + ЭтапЗамера + "."
		+ ?(ЗначениеЗаполнено(ИдентификаторКомандыДляЗамера), ИдентификаторКомандыДляЗамера, "Ручной");
	
КонецФункции
// IMDEV-8927 --

//Процедура КомандаФормыСчитатьФайл(АдресФайлаНаСервере, ИмяФайлаБезРасширения) Экспорт  //IMAPPS-18376
Процедура КомандаФормыСчитатьФайл(АдресФайлаНаСервере, ИмяФайлаБезРасширения, БрокерУИД="") Экспорт   //IMAPPS-18376
	
	масСообщения = новый Массив;
	ДатыПоТорговымКодам.Очистить();
	//ТаблицаДанных.Очистить();
	ТаблицаДанных2.Очистить();
	//ТаблицаДанных3.Очистить();
	//ТаблицаДанных4.Очистить();
	ТаблицаДанных5.Очистить();
	ТаблицаДанных10.Очистить();
	ЛокТаблицаДанных5 = ТаблицаДанных5.Выгрузить();
	тблКешФлоу = Новый ТаблицаЗначений;
	тблКешФлоу.Колонки.Добавить("Счет", ОбщегоНазначения.ОписаниеТипаСтрока(125));
	тблКешФлоу.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	тблКешФлоу.Колонки.Добавить("Описание", ОбщегоНазначения.ОписаниеТипаСтрока(200));
	тблКешФлоу.Колонки.Добавить("Кредит", ОбщегоНазначения.ОписаниеТипаЧисло(20,2));
	тблКешФлоу.Колонки.Добавить("Дебет", ОбщегоНазначения.ОписаниеТипаЧисло(20,2));
	тблКешФлоу.Колонки.Добавить("Валюта", ОбщегоНазначения.ОписаниеТипаСтрока(3));
	
	УникальноеИмяФайла = Новый УникальныйИдентификатор;
	
	//IMAPPS-11276
	Если БрокерУИД = "73fc232b-45e3-11e2-b4e9-005056b100ec" Тогда // Банк ВТБ
		ИмяФайлаНаСервере = КаталогВременныхФайлов() + ИмяФайлаБезРасширения + ".xlsx";
	Иначе
		ИмяФайлаНаСервере = КаталогВременныхФайлов() + ИмяФайлаБезРасширения + ".xls";	
	КонецЕсли;
	//IMAPPS-11276
	
	ФайлДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаНаСервере);
	ФайлДвоичныеДанные.Записать(ИмяФайлаНаСервере);
	
	// Создание объекта установки связи с источником данных
	Connection = Новый COMОбъект("ADODB.Connection");
	
	// Подключение к источнику данных
	ФлагДопПараметр = Ложь;
	СтрокаПодключения = "Provider=Microsoft.ACE.OLEDB.12.0; Data Source=" + ИмяФайлаНаСервере + "; Extended Properties=""Excel 12.0 Xml;HDR=YES;IMEX=1;""";
	Попытка
		Connection.Open(СтрокаПодключения);
		ФлагДопПараметр = Истина;
	Исключение
	КонецПопытки;
	Если НЕ ФлагДопПараметр Тогда  
		СтрокаПодключения = "Provider=Microsoft.Jet.OLEDB.4.0; Data Source=" + ИмяФайлаНаСервере + "; Extended Properties=""Excel 8.0;HDR=YES;IMEX=1""";
		Попытка
			Connection.Open(СтрокаПодключения);
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки; 
	КонецЕсли;
	
	// Создание объекта выполнения команды
	Command = Новый COMОбъект("ADODB.Command");
	
	// Указание активного соединения
	Command.ActiveConnection = Connection;
	
	// Определение текста команды
	Catalog = Новый COMОбъект("ADOX.Catalog");
	Catalog.ActiveConnection = СтрокаПодключения;
	
	//ИмяЛиста = Catalog.Tables.Item(Число(ДополнительныеПараметры["НомерЛистаСДанными"].Значение)).Name;	
	
	МассивЛистов = Новый Массив;
	МассивЛистов.Добавить("Main$");
	//МассивЛистов.Добавить("DayTransactions$");
	МассивЛистов.Добавить("CashFlows$");
	МассивЛистов.Добавить("Cash$");
	//МассивЛистов.Добавить("DepoExtract$");
	//МассивЛистов.Добавить("DepoExtrBlock$");
	МассивЛистов.Добавить("ContractsRecalculation$");
	
	// IMAPPS-28208 ++ Проверка, что листы, которые мы ищем правда в файле существуют
    ЛистыФайлаБрокера = Catalog.Tables;
	МассивЛистовБрокера = Новый Массив;
	
	Для каждого Лист из ЛистыФайлаБрокера Цикл
		МассивЛистовБрокера.Добавить(Лист.Name);
	КонецЦикла;
	
	Для Каждого Лист ИЗ МассивЛистов Цикл
		Если МассивЛистовБрокера.Найти(Лист) <> Неопределено Тогда
			Продолжить;
		Иначе
			МассивЛистов.Удалить(МассивЛистов.Найти(Лист));
		КонецЕсли;
	КонецЦикла;
	// IMAPPS-28208 --
	
	//Данные для подстановки
	ТаблицаАС = АналитическиеСчетаБрокераДС();
	СоответствиеРегНомеровЦБ = ПолучитьСоответствиеРегНомеровЦБ();
	ТаблицаПараметровДоговоров = ПолучитьТаблицуПараметровДоговоров();
	СоответствиеКодЦБНаБирже = ПолучитьСоответствиеКодЦБНаБирже();
	ПустойАктив = Справочники.Активы.ПустаяСсылка();
	ВестиТолькоБухгалтерскийУчет = Константы.ВестиТолькоБухгалтерскийУчет.Получить();
	
	Для каждого ИмяЛиста Из МассивЛистов Цикл
		Попытка
			Command.CommandText = "SELECT * FROM [" + ИмяЛиста + "]";
			
			// Определение типа команды
			Command.CommandType = 1;
			
			// Создание объекта набора записей
			RecordSet = Новый COMОбъект("ADODB.RecordSet");
			
			//Выполнение и получение набора данных
			RecordSet = Command.Execute();
		Исключение
			Сообщить("Не найден лист "+ИмяЛиста+ ". Загрузка данных не возможна. выберите другой файл.");
			Продолжить;
		КонецПопытки;
		// Перебор данных
		СчетчикСтрок = 0;
		СчетчикCash = 0;
		СчетчикDepoExtract = 0;
		НомерСтрокиСДанными = 0;
		ПерваяСтрокаСДанными = 0;
		
		// IMAPPS-30183++
		// Реализация поиска документа из Операции создания в операцию чтения
		ТаблицаСозданныхДокументов = Неопределено;
		// IMAPPS-30183--
		Пока RecordSet.EOF() = 0 Цикл
			
			Актив = Неопределено;
			Если СчетчикСтрок < ПерваяСтрокаСДанными Тогда
				RecordSet.MoveNext();
				//СчетчикСтрок = СчетчикСтрок + 1;
				Продолжить;
			КонецЕсли;
			
			Если ИмяЛиста = "CashFlows$" Тогда
				
				НазначениеПлатежа = СокрЛП(Recordset.Fields(2).Value);
				
				Если (СтрНайти(НазначениеПлатежа, "Выплата") > 0 И СтрНайти(НазначениеПлатежа, "купона") > 0)
					ИЛИ СтрНайти(Врег(НазначениеПлатежа), "ДИВИДЕН") > 0
					ИЛИ СтрНайти(НазначениеПлатежа, "Комиссия за расчетные услуги") > 0
					ИЛИ СтрНайти(НазначениеПлатежа, "Частичное погашение") > 0
					ИЛИ СтрНайти(НазначениеПлатежа, "Полное погашение") > 0
					ИЛИ СтрНайти(НазначениеПлатежа, "Списание комиссии с ИБС клиента") > 0
					// IMAPPS-919
					ИЛИ СтрНайти(НазначениеПлатежа, "Погашение купона") > 0
					ИЛИ СтрНайти(НазначениеПлатежа, "Депозитарная комиссия") > 0
					ИЛИ СтрНайти(НазначениеПлатежа, "Использование брокером ДС клиента") > 0 // IMDEV-621, IMDEV-622
					ИЛИ СтрНайти(Назначениеплатежа, "Комиссия «Проведение расчетных операций с ценными бумагами по итогам сделок»") > 0 // IMAPPS-11276
					ИЛИ СтрНайти(Назначениеплатежа, "Комиссия «Возмещение расходов НКО АО НРД за обслуживание выпуска ценных бумаг»") > 0 // IMAPPS-13993
					ИЛИ СтрНайти(НазначениеПлатежа, "MICEX / Возврат выплат.Исполнение обязательств по передаче дохода Клиринговым центром ") > 0 // IMAPPS-23546
					ИЛИ СтрНайти(НазначениеПлатежа, "Куп. дох. по обл.") > 0 // IMAPPS-28406
					ИЛИ СтрНайти(НазначениеПлатежа, "Ден.ср-ва от погаш. номин.ст-ти обл.") > 0 // IMAPPS-28406
					ИЛИ СтрНайти(НазначениеПлатежа, "Част.погаш.номин. обл.") > 0 // IMAPPS-28903
					ИЛИ СтрНайти(НазначениеПлатежа, "Дивиденды") > 0 // IMAPPS-28903
					
				Тогда
					
					НоваяСтрока	= ТаблицаДанных2.Добавить();
					НоваяСтрока.ТорговыйКод = СокрЛП(Recordset.Fields(0).Value);
					
					Если ТипЗнч(Recordset.Fields(1).Value) = Тип("Дата") Тогда
						ДатаБалланса = Recordset.Fields(1).Value;
					Иначе
						ДатаБалланса = ПреобразоватьСтрокуВДату(СокрЛП(Recordset.Fields(1).Value));
					КонецЕсли;
					
					НоваяСтрока.Дата = ДатаБалланса;
					
					// IMAPPS-30183++
					Если ТаблицаСозданныхДокументов = Неопределено Тогда
						ТаблицаСозданныхДокументов = ПолучитьТаблицуОперацийПоСчетуБрокера(НоваяСтрока.Дата);
					КонецЕсли;
					// IMAPPS-30183--
					
					ИскатьКупон = Ложь;
					Если (СтрНайти(НазначениеПлатежа, "Выплата") > 0 И СтрНайти(НазначениеПлатежа, "купона") > 0) Тогда
						НоваяСтрока.КодЦБ = СокрЛП(Лев(НазначениеПлатежа, СтрНайти(НазначениеПлатежа, "(Выплата")-1));
						ИскатьКупон = Истина;
					//	IMAPPS-919
					ИначеЕсли СтрНайти(НазначениеПлатежа, "Погашение купона") > 0 Тогда
						НоваяСтрока.КодЦБ = НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа);
						ИскатьКупон = Истина;
					ИначеЕсли СтрНайти(НазначениеПлатежа, "Частичное погашение") > 0 Тогда
						НоваяСтрока.КодЦБ = СокрЛП(Лев(НазначениеПлатежа, СтрНайти(НазначениеПлатежа, "(Частичное")-1));
					//	IMAPPS-919
						Если Не ЗначениеЗаполнено(НоваяСтрока.КодЦБ) Тогда  
							НоваяСтрока.КодЦБ = НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа);
						КонецЕсли;
					ИначеЕсли СтрНайти(НазначениеПлатежа, "Полное погашение") > 0 Тогда
						НоваяСтрока.КодЦБ = СокрЛП(Лев(НазначениеПлатежа, СтрНайти(НазначениеПлатежа, "(Полное погашение")-1));    
						Если Не ЗначениеЗаполнено(НоваяСтрока.КодЦБ) Тогда  
							НоваяСтрока.КодЦБ = НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа);
						КонецЕсли;
                    //
					ИначеЕсли СтрНайти(НазначениеПлатежа, "Погашение купона") Тогда
						НоваяСтрока.КодЦБ = НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа);
						ИскатьКупон = Истина;
					// IMAPPS-23546 ++
					ИначеЕсли СтрНайти(Врег(НазначениеПлатежа), "MICEX / ВОЗВРАТ ВЫПЛАТ") > 0 Тогда
						НоваяСтрока.КодЦБ = СокрЛП(Прав(НазначениеПлатежа,12));
						НоваяСтрока.Актив = НайтиАктивПоISIN(НоваяСтрока.КодЦБ);
					// IMAPPS-23546 --
					// IMAPPS-26379 ++
					ИначеЕсли СтрНайти(Врег(НазначениеПлатежа), "ДИВИДЕН") > 0 Тогда
						НоваяСтрока.КодЦБ = НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа);
						// IMAPPS-28903++
						Если НоваяСтрока.КодЦБ = "" Тогда
							НоваяСтрока.КодЦБ = НайтиАкциюПоНомерГосРег(НазначениеПлатежа);
						КонецЕсли;
						// IMAPPS-28903--
					// IMAPPS-26379 --
					// IMAPPS-28406 ++
					ИначеЕсли СтрНайти(НазначениеПлатежа, "Куп. дох. по обл.") > 0 Тогда
						НоваяСтрока.КодЦБ = НайтиПоНомерГосРегВНазначенииПлатежа(НазначениеПлатежа);
						ИскатьКупон = Истина;
					ИначеЕсли СтрНайти(НазначениеПлатежа, "Ден.ср-ва от погаш. номин.ст-ти обл.") > 0 ИЛИ СтрНайти(НазначениеПлатежа, "Част.погаш.номин. обл.") > 0 Тогда //IMAPPS-28903 ++
						НоваяСтрока.КодЦБ = НайтиПоНомерГосРегВНазначенииПлатежа(НазначениеПлатежа);
					КонецЕсли;
					// IMAPPS-28406 --
					НоваяСтрока.НазначениеПлатежа = НазначениеПлатежа;
					
					//IMAPPS-11276
					Если БрокерУИД = "73fc232b-45e3-11e2-b4e9-005056b100ec" Тогда // Банк ВТБ
						НоваяСтрока.Приход = Recordset.Fields(3).Value;
						НоваяСтрока.Расход = Recordset.Fields(4).Value;
					Иначе
						НоваяСтрока.Расход = Recordset.Fields(3).Value;
						НоваяСтрока.Приход = Recordset.Fields(4).Value;
					КонецЕсли;
					
					Если БрокерУИД = "73fc232b-45e3-11e2-b4e9-005056b100ec" Тогда // Банк ВТБ
						ТорговыйКодБрокера = ПолучитьТорговыйКод(Recordset.Fields(5).Value);
						Для Каждого Строка Из ТорговыйКодБрокера Цикл
							НоваяСтрока.АналитическийСчетДС = Строка.АналитическийСчетДС;
							НоваяСтрока.Брокер = Строка.Брокер;
							НоваяСтрока.ДоговорДУ = Строка.ДоговорДУ;
							НоваяСтрока.ДоговорБрокера = Строка.ДоговорБрокера;
						КонецЦикла;
					КонецЕсли;
					//IMAPPS-11276
					
					//Поиск бумаги				
					Если НоваяСтрока.Актив = Справочники.Активы.ПустаяСсылка() Тогда // IMAPPS-23546 ++
						
						АктивОбъект = СоответствиеКодЦБНаБирже.Получить(НоваяСтрока.КодЦБ);
						Если АктивОбъект <> Неопределено Тогда
							НоваяСтрока.Актив = АктивСервер.ПолучитьАктивПоОбъекту(АктивОбъект);
						Иначе
							КонтекстСопоставления = Перечисления.КонтекстСопоставления.ЦенныеБумаги;
							НоваяСтрока.Актив = РегистрыСведений.УниверсальныеСопоставления.ПрочитатьПрямоеСопоставление(КонтекстСопоставления,Справочники.Биржи.ПустаяСсылка(), НоваяСтрока.КодЦБ, Ложь, ДатаБалланса);
						КонецЕсли;
						
					КонецЕсли; // IMAPPS-23546 ++
				
					//Заполним реквизиты по торговому коду
					КодТорг = Справочники.ТорговыеКоды.НайтиПоРеквизиту("ТорговыйКод", НоваяСтрока.ТорговыйКод); 
					ВалютаСчета = Справочники.Валюты.RUB;
					// IMAPPS-18595 ++
					Если КодТорг = Справочники.ТорговыеКоды.ПустаяСсылка() Тогда 
						Если Recordset.Fields(5).Value = "RUR" Тогда 
							ВалютаCashFlows = "RUB";
						Иначе 
							ВалютаCashFlows = Recordset.Fields(5).Value;   
						КонецЕсли;
						Если  НЕ ВалютаCashFlows = "RUB" и НЕ ПустаяСтрока(ВалютаCashFlows) Тогда
							ВалютаСчета = ПолучитьВалютуПоСтроке(ВалютаCashFlows);
						КонецЕсли;	
						КодТорг = ПолучитьТорговыйКодСсылку(НоваяСтрока.ТорговыйКод + "/" + ВалютаCashFlows);// Справочники.ТорговыеКоды.НайтиПоРеквизиту("ТорговыйКод", НоваяСтрока.ТорговыйКод + "/" + ВалютаCashFlows);
					КонецЕсли; 
					НоваяСтрока.Валюта = ВалютаСчета;
					// IMAPPS-18595 --
					Если ЗначениеЗаполнено(КодТорг) Тогда
						//в рамках  http://jira/browse/IMAPPS-3207 изменил логику поиска счета по торговому коду
						Если ЗначениеЗаполнено(КодТорг) Тогда                                                                                   
							НоваяСтрока.АналитическийСчетДС = НайтиАналитическийСчетпоТорговомуКодуиВалюте(НоваяСтрока.ТорговыйКод,ВалютаСчета,КодТорг);
						Иначе
							НоваяСтрока.АналитическийСчетДС = НайтиАналитическийСчетпоТорговомуКодуиВалюте(НоваяСтрока.ТорговыйКод,ВалютаСчета);
						КонецЕсли;
						СтруктураКодТорг = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(КодТорг, "ДоговорДУ, Биржа, Брокер, ДоговорБрокера");			
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураКодТорг);
						 АналитическийСчетДС = НоваяСтрока.АналитическийСчетДС;
						Если НЕ ВестиТолькоБухгалтерскийУчет И ЗначениеЗаполнено(АналитическийСчетДС) Тогда
							НоваяСтрока.ФизическоеМестоХраненияДС = ?(ЗначениеЗаполнено(АналитическийСчетДС.АналитическийПризнакСчетаБрокера),АналитическийСчетДС.АналитическийПризнакСчетаБрокера, АналитическийСчетДС.МестоХранения);
						КонецЕсли;
					КонецЕсли;
					
					//Поиск купона
					Если ИскатьКупон И ЗначениеЗаполнено(НоваяСтрока.Актив)И ЗначениеЗаполнено(НоваяСтрока.ДоговорДУ) Тогда
						НоваяСтрока.Купон = ПолучитьКупон(ДатаБалланса, НоваяСтрока.Актив.Объект, НоваяСтрока.Расход, НоваяСтрока.ДоговорДУ, НоваяСтрока.ТорговыйКод, СчетчикСтрок, ИмяФайлаБезРасширения,,НоваяСтрока.Валюта);
					КонецЕсли;
					
					// IMAPPS-30183--
					Если СтрНайти(НоваяСтрока.НазначениеПлатежа, "Комиссия за расчетные услуги") > 0 ИЛИ СтрНайти(НоваяСтрока.НазначениеПлатежа, "Списание комиссии с ИБС клиента") > 0
							//	IMAPPS-919
							ИЛИ СтрНайти(НоваяСтрока.НазначениеПлатежа, "Депозитарная комиссия") > 0 ИЛИ СтрНайти(НоваяСтрока.НазначениеПлатежа, "Использование брокером ДС") > 0
						Тогда
							НайденныеДокументы = ТаблицаСозданныхДокументов.НайтиСтроки(Новый Структура("Контрагент, ДоговорДУ, СуммаДокумента, ДоговорКонтрагента", НоваяСтрока.Брокер, НоваяСтрока.ДоговорДУ, Число(НоваяСтрока.Приход), НоваяСтрока.ДоговорБрокера));
					Иначе
						НайденныеДокументы = ТаблицаСозданныхДокументов.НайтиСтроки(Новый Структура("Контрагент, ДоговорДУ, СуммаДокумента, ДоговорКонтрагента", НоваяСтрока.Брокер, НоваяСтрока.ДоговорДУ, Число(НоваяСтрока.Расход), НоваяСтрока.ДоговорБрокера));																			
					КонецЕсли;
					Если НайденныеДокументы.Количество() Тогда
						НоваяСтрока.Документ = НайденныеДокументы.Получить(0).Ссылка;
					КонецЕсли;
					// IMAPPS-30183--
					
					СчетчикСтрок = СчетчикСтрок + 1;
				// MPazhukov IMAPPS-11737	
				ИначеЕсли СтрНайти(НазначениеПлатежа, "Перечислено в ТС (Зачисление денег) / Выведено из ТС (Перевод на Основной рынок)") > 0 И БрокерУИД = "73fc232b-45e3-11e2-b4e9-005056b100ec" Тогда
					
					НоваяСтрока = ЛокТаблицаДанных5.Добавить();
					
					Если ТипЗнч(Recordset.Fields(1).Value) = Тип("Дата") Тогда
						НоваяСтрока.Дата = Recordset.Fields(1).Value;
					Иначе
						НоваяСтрока.Дата = ПреобразоватьСтрокуВДату(СокрЛП(Recordset.Fields(1).Value));
					КонецЕсли;					
					
					Приход = 0;
					Попытка
						Приход = Число(Recordset.Fields(3).Value);
					Исключение	
					КонецПопытки;
					
					Расход = 0;
					Попытка
						Расход = Число(Recordset.Fields(4).Value);
					Исключение	
					КонецПопытки;					
					
					НоваяСтрока.Сумма = Макс(Приход, Расход);
					
					ТорговыйКодБрокера = ПолучитьТорговыйКод(Recordset.Fields(5).Value);
					Для Каждого Строка Из ТорговыйКодБрокера Цикл
						Если Приход > 0 Тогда
							НоваяСтрока.ТорговыйКодПриход = Строка.Ссылка;
						ИначеЕсли Расход > 0 Тогда
							НоваяСтрока.ТорговыйКодРасход = Строка.Ссылка	
						КонецЕсли;
						НоваяСтрока.ДоговорДУ = Строка.ДоговорДУ;
					КонецЦикла;
					
					// IMAPPS-30183++
					НоваяСтрока.Описание = Recordset.Fields(2).Value;
					// IMAPPS-30183--
					
					СчетчикСтрок = СчетчикСтрок + 1;
				// MPazhukov IMAPPS-11737	
				// IMDEV-3655 (*	
				ИначеЕсли СтрНайти(НазначениеПлатежа, "Перевод ДС ") > 0 Тогда //И БрокерУИД = "73fc232b-45e3-11e2-b4e9-005056b100ec"
					
					НоваяСтрока = тблКешФлоу.Добавить();
					НоваяСтрока.Счет 	 = Recordset.Fields(0).Value;
					НоваяСтрока.Период 	 = ПреобразоватьСтрокуВДату(СокрЛП(Recordset.Fields(1).Value));
					НоваяСтрока.Описание = Recordset.Fields(2).Value;
					НоваяСтрока.Кредит 	 = Recordset.Fields(3).Value;
					НоваяСтрока.Дебет 	 = Recordset.Fields(4).Value;
					НоваяСтрока.Валюта 	 = Recordset.Fields(5).Value;
					
					СчетчикСтрок = СчетчикСтрок + 1;
				//  *)IMDEV-3655	
				КонецЕсли; 
				
			КонецЕсли;
			
			Если ИмяЛиста = "Cash$" Тогда
				
				Если Recordset.Fields(1).Value = "DATE" Тогда
					Продолжить;
				КонецЕсли;
				
				Если СчетчикCash = 0 Тогда
					
					Если ТипЗнч(Recordset.Fields(1).Value) = Тип("Дата") Тогда
						ДатаБалланса = Recordset.Fields(1).Value;
					Иначе
						ДатаБалланса = ПреобразоватьСтрокуВДату(СокрЛП(Recordset.Fields(1).Value));
					КонецЕсли;
					
					//ТаблицаОстатковИОборотовПоАналитическимСчетамДС = ОстаткиПоАналитическимСчетамБрокераДС(ДатаБалланса);
					СчетчикCash = СчетчикCash + 1;
				КонецЕсли;
				
				Если СчетчикCash>0 И ЗначениеЗаполнено(ДатаБалланса) Тогда
					
					НоваяСтрока	= ТаблицаДанных3.Добавить();
					НоваяСтрока.ТорговыйКод = СокрЛП(Recordset.Fields(0).Value);
					КодТорг = Справочники.ТорговыеКоды.НайтиПоРеквизиту("ТорговыйКод", НоваяСтрока.ТорговыйКод);
					Если ЗначениеЗаполнено(КодТорг) Тогда
						//в рамках  http://jira/browse/IMAPPS-3207 изменил логику поиска счета по торговому коду

						НоваяСтрока.АналитическийСчетДС = НайтиАналитическийСчетпоТорговомуКодуиВалюте(НоваяСтрока.ТорговыйКод,Справочники.Валюты.RUB);
						//		НоваяСтрока.АналитическийСчетДС = ОбщегоНазначения.ПолучитьЗначениеРеквизита(КодТорг, "АналитическийСчетДС");			
						НоваяСтрока.ДоговорДУ = ОбщегоНазначения.ПолучитьЗначениеРеквизита(КодТорг, "ДоговорДУ");
						АналитическийСчетДС = НоваяСтрока.АналитическийСчетДС;
						Если НЕ ВестиТолькоБухгалтерскийУчет И ЗначениеЗаполнено(АналитическийСчетДС) Тогда
							НоваяСтрока.ФизическоеМестоХраненияДС = ?(ЗначениеЗаполнено(АналитическийСчетДС.АналитическийПризнакСчетаБрокера),АналитическийСчетДС.АналитическийПризнакСчетаБрокера, АналитическийСчетДС.МестоХранения);
						КонецЕсли;
					КонецЕсли;
					
					НоваяСтрока.Дата = ДатаБалланса;
					НоваяСтрока.СуммаНачальныйОстаток = Recordset.Fields(2).Value;
					НоваяСтрока.СуммаОборотКт = Recordset.Fields(8).Value;
					НоваяСтрока.СуммаОборотДт = Recordset.Fields(10).Value;
					НоваяСтрока.СуммаКонечныйОстаток = Recordset.Fields(12).Value;
					
					СчетчикCash = СчетчикCash + 1;
				КонецЕсли;
			//	СчетчикСтрок = СчетчикСтрок + 1;
			КонецЕсли;
			
			Если ИмяЛиста = "Main$" Тогда
			
				ClientCode = Recordset.Fields(2).Value;
				PeriodFinish = Recordset.Fields(10).Value;
				
				НоваяСтрока = ДатыПоТорговымКодам.Добавить();
				НоваяСтрока.ТорговыйКодФайл = ClientCode;
				НоваяСтрока.ДатаДокумента = ПреобразоватьСтрокуВДату(PeriodFinish);
			
			КонецЕсли;
			
			Если ИмяЛиста = "ContractsRecalculation$" Тогда
				
				InvAccount = Recordset.Fields(0).Value;
				Security = Recordset.Fields(2).Value;
				TransDate = Recordset.Fields(4).Value;
				VariationMargin = Recordset.Fields(5).Value;
				OptionsProfit = Recordset.Fields(6).Value;
				GO = Recordset.Fields(7).Value;
				GOSeqQtyOne = Recordset.Fields(8).Value;
				ValuationPrice = Recordset.Fields(9).Value;
				Currency = Recordset.Fields(10).Value;
				
				НоваяСтрока	= ТаблицаДанных10.Добавить();
				НоваяСтрока.Ошибка = "";
				НоваяСтрока.ТорговыйКодФайл = InvAccount;
				НоваяСтрока.АктивФайл = Security;
				
				НоваяСтрока.VariationMargin = VariationMargin;
				НоваяСтрока.OptionsProfit = OptionsProfit;
				НоваяСтрока.GO = GO;
				НоваяСтрока.GOSeqQtyOne = GOSeqQtyOne;
				НоваяСтрока.ValuationPrice = ValuationPrice;
				НоваяСтрока.Currency = Currency;
				
				ВалютаСчета = Справочники.Валюты.НайтиПоНаименованию("RUB");
			
				Если ТипЗнч(TransDate) = Тип("Дата") Тогда
					НоваяСтрока.TransDate = TransDate;
				Иначе
					НоваяСтрока.TransDate = ПреобразоватьСтрокуВДату(TransDate);
				КонецЕсли;
				
				КонтекстСопоставленияБиржа = Перечисления.КонтекстСопоставления.Биржа;
				
				Календарь = //РегистрыСведений.УниверсальныеСопоставления.ПрочитатьПрямоеСопоставление(КонтекстСопоставления,,"Календарь_ММВБ");
				НоваяСтрока.TransDate = КалендарныеГрафики.ПолучитьСледующуюРабочуюДату(Календарь,НачалоДня(ТекущаяДата()),-1);
				
				КодТорг = Справочники.ТорговыеКоды.НайтиПоРеквизиту("ТорговыйКод", НоваяСтрока.ТорговыйКодФайл);
				Если ЗначениеЗаполнено(КодТорг) Тогда
				
					НоваяСтрока.АналитическийСчетДС = НайтиАналитическийСчетпоТорговомуКодуиВалюте(НоваяСтрока.ТорговыйКодФайл, ВалютаСчета, КодТорг);
					СтруктураКодТорг = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(КодТорг, "ДоговорДУ, Биржа, Брокер, ДоговорБрокера");
					
					НоваяСтрока.ДоговорДУ = СтруктураКодТорг.ДоговорДУ;
					НоваяСтрока.ДоговорКонтрагента = СтруктураКодТорг.ДоговорБрокера;
				
				КонецЕсли;
				
				Актив = АктивПоКоду(Security, СтруктураКодТорг.Биржа);//РегистрыСведений.УниверсальныеСопоставления.ПрочитатьПрямоеСопоставление(Перечисления.КонтекстСопоставления.ЦенныеБумаги,, Security);
				Если ЗначениеЗаполнено(Актив) Тогда
					НоваяСтрока.Актив = Актив;
				Иначе
					НоваяСтрока.Ошибка = НоваяСтрока.Ошибка + "Не найден Актив. Требуется сопоставление" + Символы.ПС;
				КонецЕсли;
				
			КонецЕсли;
			
			RecordSet.MoveNext();
			
			
		КонецЦикла;
		
		RecordSet.Close();
		
	КонецЦикла;
	
	// MPazhukov IMAPPS-11737
	МассивЛишнихСтрок = Новый Массив;
	
	Для Каждого СтрокаТЧ из ЛокТаблицаДанных5 Цикл
		
		Если МассивЛишнихСтрок.Найти(СтрокаТЧ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Отбор = Новый Структура;
		Отбор.Вставить("Дата", СтрокаТЧ.Дата);
		Отбор.Вставить("ДоговорДУ", СтрокаТЧ.ДоговорДУ);
		Отбор.Вставить("Сумма", СтрокаТЧ.Сумма);
		Если СтрокаТЧ.ТорговыйКодПриход.Пустая() Тогда
			Отбор.Вставить("ТорговыйКодРасход", Справочники.ТорговыеКоды.ПустаяСсылка());
		ИначеЕсли СтрокаТЧ.ТорговыйКодРасход.Пустая() Тогда
			Отбор.Вставить("ТорговыйКодПриход", Справочники.ТорговыеКоды.ПустаяСсылка());	
		КонецЕсли;	
		
		МассивПоиск = ЛокТаблицаДанных5.НайтиСтроки(Отбор);
		Если МассивПоиск.Количество() Тогда
			
			Если СтрокаТЧ.ТорговыйКодПриход.Пустая() Тогда
				СтрокаТЧ.ТорговыйКодПриход = МассивПоиск[0].ТорговыйКодПриход;	
			ИначеЕсли СтрокаТЧ.ТорговыйКодРасход.Пустая() Тогда
				СтрокаТЧ.ТорговыйКодРасход = МассивПоиск[0].ТорговыйКодРасход;		
			КонецЕсли;		
			
			МассивЛишнихСтрок.Добавить(МассивПоиск[0]);
			
			СтрокаНовая = ТаблицаДанных5.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНовая, СтрокаТЧ);
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если тблКешФлоу.Количество() > 0 Тогда
		Запрос = новый Запрос;
		Запрос.УстановитьПараметр("тбл", тблКешФлоу);
		Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	т.Счет,
		//|	т.Период,
		//|	т.Описание,
		//|	т.Кредит,
		//|	т.Дебет,
		//|	т.Валюта
		//|ПОМЕСТИТЬ втСтроки
		//|ИЗ
		//|	&тбл КАК т
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	МАКСИМУМ(ВЫБОР
		//|			КОГДА т.Дебет > 0
		//|				ТОГДА тк.Ссылка
		//|			ИНАЧЕ """"
		//|		КОНЕЦ) КАК ТорговыйКодРасход,
		//|	МАКСИМУМ(ВЫБОР
		//|			КОГДА т.Кредит > 0
		//|				ТОГДА тк.Ссылка
		//|			ИНАЧЕ """"
		//|		КОНЕЦ) КАК ТорговыйКодПриход,
		//|	т.Период КАК Дата,
		//|	т.Описание,
		//|	т.Валюта,
		//|	ВЫБОР
		//|		КОГДА т.Дебет > 0
		//|			ТОГДА т.Дебет
		//|		ИНАЧЕ т.Кредит
		//|	КОНЕЦ КАК Сумма,
		//|	тк.ДоговорДУ
		//|ИЗ
		//|	втСтроки КАК т
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТорговыеКоды КАК тк
		//|		ПО (тк.ТорговыйКод ПОДОБНО т.Счет)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	т.Период,
		//|	т.Описание,
		//|	т.Валюта,
		//|	ВЫБОР
		//|		КОГДА т.Дебет > 0
		//|			ТОГДА т.Дебет
		//|		ИНАЧЕ т.Кредит
		//|	КОНЕЦ,
		//|	тк.ДоговорДУ";
			"ВЫБРАТЬ
			|	т.Счет,
			|	т.Период,
			|	т.Описание,
			|	т.Кредит,
			|	т.Дебет,
			// IMAPPS-24664 ++
			//|	т.Валюта
			|	ВЫБОР
			|		КОГДА т.Валюта = ""RUR""
			|			ТОГДА ""RUB""
			|		ИНАЧЕ т.Валюта
			|	КОНЕЦ КАК Валюта
			// IMAPPS-24664 --
			|ПОМЕСТИТЬ втСтроки
			|ИЗ
			|	&тбл КАК т
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА т.Дебет > 0
			|				ТОГДА ТорговыеКодыСписокКодов.Ссылка
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК ТорговыйКодРасход,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА т.Кредит > 0
			|				ТОГДА ТорговыеКодыСписокКодов.Ссылка
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК ТорговыйКодПриход,
			|	т.Период КАК Дата,
			|	т.Описание,
			|	т.Валюта,
			|	ВЫБОР
			|		КОГДА т.Дебет > 0
			|			ТОГДА т.Дебет
			|		ИНАЧЕ т.Кредит
			|	КОНЕЦ КАК Сумма,
			|	ТорговыеКодыСписокКодов.Ссылка.ДоговорДУ
			|ИЗ
			|	втСтроки КАК т
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТорговыеКоды.СписокКодов КАК ТорговыеКодыСписокКодов
			// IMAPPS-24664 ++
			//|		ПО (ТорговыеКодыСписокКодов.ТорговыйКод ПОДОБНО т.Счет)
			|		ПО (ТорговыеКодыСписокКодов.ТорговыйКод ПОДОБНО т.Счет)
			|			И (т.Валюта = ТорговыеКодыСписокКодов.Ссылка.АналитическийСчетДС.МестоХранения.ВалютаДенежныхСредств.Наименование)
			// IMAPPS-24664 --
			|
			|СГРУППИРОВАТЬ ПО
			|	т.Период,
			|	т.Описание,
			|	т.Валюта,
			|	ВЫБОР
			|		КОГДА т.Дебет > 0
			|			ТОГДА т.Дебет
			|		ИНАЧЕ т.Кредит
			|	КОНЕЦ,
			|	ТорговыеКодыСписокКодов.Ссылка.ДоговорДУ";
		

		таб = запрос.Выполнить().Выгрузить();
		Для каждого СтрокаТаб Из таб Цикл
			Если СтрокаТаб.ТорговыйКодРасход = СтрокаТаб.ТорговыйКодПриход Тогда
				Продолжить;
			КонецЕсли;
			СтрокаНовая = ТаблицаДанных5.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНовая, СтрокаТаб);
		КонецЦикла;
	КонецЕсли;
	
	//Для Каждого Элемент из МассивЛишнихСтрок Цикл
	//	
	//	ЛокТаблицаДанных5.Удалить(Элемент);
	//	
	//КонецЦикла;		
	// MPazhukov IMAPPS-11737	
	
	// После того, как набор записей уже не нужен, его нужно закрыть
	Connection.Close();		
	
	// IMAPPS-30183++
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОперацияПоСчетуБрокера.Ссылка,
	               |	ОперацияПоСчетуБрокера.ДоговорДУ,
	               |	НАЧАЛОПЕРИОДА(ОперацияПоСчетуБрокера.Дата, ДЕНЬ) КАК Дата,
	               |	ОперацияПоСчетуБрокера.СуммаДокумента,
	               |	ОперацияПоСчетуБрокера.АналитическийСчетБрокера,
	               |	ОперацияПоСчетуБрокера.АналитическийСчетКорреспондента
	               |ИЗ
	               |	Документ.ОперацияПоСчетуБрокера КАК ОперацияПоСчетуБрокера
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ОперацияПоСчетуБрокера.Дата, ДЕНЬ) В (&Дата)
	               |	И ОперацияПоСчетуБрокера.ДоговорДУ В(&ДоговорДУ)
	               |	И ОперацияПоСчетуБрокера.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоСчетуБрокера.Перевод)
	               |	И ОперацияПоСчетуБрокера.Комментарий ПОДОБНО &Комментарий
	               |	И НЕ ОперацияПоСчетуБрокера.ПометкаУдаления";
	Запрос.УстановитьПараметр("Дата", ТаблицаДанных5.ВыгрузитьКолонку("Дата"));
	Запрос.УстановитьПараметр("ДоговорДУ", ТаблицаДанных5.ВыгрузитьКолонку("ДоговорДУ"));
	Запрос.УстановитьПараметр("Комментарий", "#Создано обработкой%");
	
	ДокументыВБазе = Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка Из ТаблицаДанных5 Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Дата", Строка.Дата);
		Отбор.Вставить("ДоговорДУ", Строка.ДоговорДУ);
		Отбор.Вставить("СуммаДокумента", Строка.Сумма);
		Отбор.Вставить("АналитическийСчетБрокера", Строка.ТорговыйКодРасход.АналитическийСчетДС);
		Отбор.Вставить("АналитическийСчетКорреспондента", Строка.ТорговыйКодПриход.АналитическийСчетДС);
		
		МассивДок = ДокументыВБазе.НайтиСтроки(Отбор);
		Если МассивДок.Количество() Тогда
			Строка.Документ = МассивДок[0].Ссылка;
		КонецЕсли;

	КонецЦикла;
	// IMAPPS-30183--
	
	Если СчетчикСтрок = 0 Тогда
		//ОбщегоНазначенияДУКлиентСервер.СообщитьОбОшибке("Файл не содержит данных о сделках!");
		ДобавитьСообщение(ИмяФайлаБезРасширения, "", "", "", "Файл не содержит данных о сделках!", СтатусСообщения.Важное);
		Возврат;		
	КонецЕсли;
	
	//ТаблицаДанных.Сортировать("ДатаСделки Возр,ВремяСделки Возр, НомерСделки Возр, ВидСделки Возр");
	//Объект.ТаблицаДанных2.Сортировать("Дата Возр");
		
	Для каждого Сообщение Из масСообщения Цикл
		Сообщить(ТекстСообщения(Сообщение), Сообщение.Статус);
	КонецЦикла;
		
КонецПроцедуры

Функция АктивПоКоду(Знач КодЦБ, Знач Биржа)
	Перем НайденныйАктив;
	Перем Запрос;
	
	СтатусПоискаАктива = "";
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("БиржаЛистинга", Биржа);
	Запрос.УстановитьПараметр("КодЦБ", ПолучитьМассивКодовЦБ(КодЦБ));
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Бумаги.Бумага КАК Бумага
	|ИЗ
	|	(ВЫБРАТЬ
	|		Акции.Ссылка КАК Бумага,
	|		1 * ВЫБОР
	|			КОГДА Акции.ПометкаУдаления
	|				ТОГДА 100
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК Приоритет
	|	ИЗ
	|		Справочник.Акции КАК Акции
	|	ГДЕ
	|		Акции.ISIN В(&КодЦБ)
	|		И Акции.ISIN > """"
	|		И НЕ Акции.ПометкаУдаления
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		АкцииБиржаЛистинга.Ссылка,
	|		2 * ВЫБОР
	|			КОГДА АкцииБиржаЛистинга.Ссылка.ПометкаУдаления
	|				ТОГДА 100
	|			ИНАЧЕ 1
	|		КОНЕЦ
	|	ИЗ
	|		Справочник.Акции.БиржиЛистинга КАК АкцииБиржаЛистинга
	|	ГДЕ
	|		АкцииБиржаЛистинга.КодЦБ В(&КодЦБ)
	|		И АкцииБиржаЛистинга.КодЦБ > """"
	|		И АкцииБиржаЛистинга.БиржаЛистинга = &БиржаЛистинга
	|		И НЕ АкцииБиржаЛистинга.Ссылка.ПометкаУдаления
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		АкцииБиржаЛистинга.Ссылка,
	|		3 * ВЫБОР
	|			КОГДА АкцииБиржаЛистинга.Ссылка.ПометкаУдаления
	|				ТОГДА 100
	|			ИНАЧЕ 1
	|		КОНЕЦ
	|	ИЗ
	|		Справочник.Акции.БиржиЛистинга КАК АкцииБиржаЛистинга
	|	ГДЕ
	|		АкцииБиржаЛистинга.КодЦБ В(&КодЦБ)
	|		И АкцииБиржаЛистинга.КодЦБ > """"
	|		И НЕ АкцииБиржаЛистинга.Ссылка.ПометкаУдаления
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		Облигации.Ссылка,
	|		4 * ВЫБОР
	|			КОГДА Облигации.ПометкаУдаления
	|				ТОГДА 100
	|			ИНАЧЕ 1
	|		КОНЕЦ
	|	ИЗ
	|		Справочник.Облигации КАК Облигации
	|	ГДЕ
	|		Облигации.ISIN В(&КодЦБ)
	|		И Облигации.ISIN > """"
	|		И НЕ Облигации.ПометкаУдаления
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ОблигацииБиржаЛистинга.Ссылка,
	|		5 * ВЫБОР
	|			КОГДА ОблигацииБиржаЛистинга.Ссылка.ПометкаУдаления
	|				ТОГДА 100
	|			ИНАЧЕ 1
	|		КОНЕЦ
	|	ИЗ
	|		Справочник.Облигации.БиржиЛистинга КАК ОблигацииБиржаЛистинга
	|	ГДЕ
	|		ОблигацииБиржаЛистинга.КодЦБ В(&КодЦБ)
	|		И ОблигацииБиржаЛистинга.КодЦБ > """"
	|		И ОблигацииБиржаЛистинга.БиржаЛистинга = &БиржаЛистинга
	|		И НЕ ОблигацииБиржаЛистинга.Ссылка.ПометкаУдаления
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ОблигацииБиржаЛистинга.Ссылка,
	|		6 * ВЫБОР
	|			КОГДА ОблигацииБиржаЛистинга.Ссылка.ПометкаУдаления
	|				ТОГДА 100
	|			ИНАЧЕ 1
	|		КОНЕЦ
	|	ИЗ
	|		Справочник.Облигации.БиржиЛистинга КАК ОблигацииБиржаЛистинга
	|	ГДЕ
	|		ОблигацииБиржаЛистинга.КодЦБ В(&КодЦБ)
	|		И ОблигацииБиржаЛистинга.КодЦБ > """"
	|		И НЕ ОблигацииБиржаЛистинга.Ссылка.ПометкаУдаления
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ПаиПИФ.Ссылка,
	|		7 * ВЫБОР
	|			КОГДА ПаиПИФ.ПометкаУдаления
	|				ТОГДА 100
	|			ИНАЧЕ 1
	|		КОНЕЦ
	|	ИЗ
	|		Справочник.ПаиПИФ КАК ПаиПИФ
	|	ГДЕ
	|		ПаиПИФ.ISIN В(&КодЦБ)
	|		И ПаиПИФ.ISIN > """"
	|		И НЕ ПаиПИФ.ПометкаУдаления
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ПаиПИФБиржаЛистинга.Ссылка,
	|		8 * ВЫБОР
	|			КОГДА ПаиПИФБиржаЛистинга.Ссылка.ПометкаУдаления
	|				ТОГДА 100
	|			ИНАЧЕ 1
	|		КОНЕЦ
	|	ИЗ
	|		Справочник.ПаиПИФ.БиржиЛистинга КАК ПаиПИФБиржаЛистинга
	|	ГДЕ
	|		ПаиПИФБиржаЛистинга.КодЦБ В(&КодЦБ)
	|		И ПаиПИФБиржаЛистинга.КодЦБ > """"
	|		И ПаиПИФБиржаЛистинга.БиржаЛистинга = &БиржаЛистинга
	|		И НЕ ПаиПИФБиржаЛистинга.Ссылка.ПометкаУдаления
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ПаиПИФБиржаЛистинга.Ссылка,
	|		9 * ВЫБОР
	|			КОГДА ПаиПИФБиржаЛистинга.Ссылка.ПометкаУдаления
	|				ТОГДА 100
	|			ИНАЧЕ 1
	|		КОНЕЦ
	|	ИЗ
	|		Справочник.ПаиПИФ.БиржиЛистинга КАК ПаиПИФБиржаЛистинга
	|	ГДЕ
	|		ПаиПИФБиржаЛистинга.КодЦБ В(&КодЦБ)
	|		И ПаиПИФБиржаЛистинга.КодЦБ > """"
	|		И НЕ ПаиПИФБиржаЛистинга.Ссылка.ПометкаУдаления
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		СрочныеКонтракты.Ссылка,
	|		10 * ВЫБОР
	|			КОГДА СрочныеКонтракты.ПометкаУдаления
	|				ТОГДА 100
	|			ИНАЧЕ 1
	|		КОНЕЦ
	|	ИЗ
	|		Справочник.СрочныеКонтракты КАК СрочныеКонтракты
	|	ГДЕ
	|		(СрочныеКонтракты.Код В(&КодЦБ) ИЛИ СрочныеКонтракты.ПолныйКод В(&КодЦБ))
	|		И СрочныеКонтракты.Код > """"
	|		И НЕ СрочныеКонтракты.ПометкаУдаления) КАК Бумаги
	|
	|УПОРЯДОЧИТЬ ПО
	|	Бумаги.Приоритет,
	|	Бумага";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		СтатусПоискаАктива = "Актив не найден";
		
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	НайденныйАктив = АктивСервер.ПолучитьАктивПоОбъекту(Выборка.Бумага);
	
	Возврат НайденныйАктив;
КонецФункции // АктивПоКоду()

Функция ПолучитьМассивКодовЦБ(Знач КодЦБ)
	Перем МассивКодовЦБ;
	Перем ЭтоISIN, Концовка;
	
	КодЦБ = СокрЛП(КодЦБ);
	
	МассивКодовЦБ = Новый Массив();
	МассивКодовЦБ.Добавить(КодЦБ);
	
	ЭтоISIN = СтрДлина(КодЦБ) = 12 И СтрНайти(КодЦБ, " ") = 0 И СтрНайти(КодЦБ, Символы.НПП) = 0;  // у ISIN'ов нет пробелов и он длиной 12 символов!
	
	Если НЕ ЭтоISIN Тогда
		Концовка = " USD";
		
		Если СтрЗаканчиваетсяНа(ВРег(КодЦБ), Концовка) Тогда
			// если есть Концовка - выкусываем её
			МассивКодовЦБ.Добавить(СокрП(Лев(КодЦБ, СтрДлина(КодЦБ) - СтрДлина(Концовка))));
		Иначе
			// если нет Концовки - добавляем её
			МассивКодовЦБ.Добавить(КодЦБ + Концовка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат МассивКодовЦБ;
КонецФункции // ПолучитьМассивКодовЦБ()

Функция ДоговорКонтрагентаОпределить(ДоговорДУ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.РольДоговора = ЗНАЧЕНИЕ(Перечисление.РолиДОговоровКонтрагента.Брокерский)
		|	И ДоговорыКонтрагентов.Владелец = &Владелец
		|	И ДоговорыКонтрагентов.ДоговорДУ = &ДоговорДУ";
	
	Запрос.УстановитьПараметр("Владелец", Брокер);
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();

КонецФункции // ДоговорКонтрагентаОпределить()


Функция ПолучитьТорговыйКодСсылку(ТорговыйКод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТорговыеКоды.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТорговыеКоды КАК ТорговыеКоды
		|ГДЕ
		|	ТорговыеКоды.ТорговыйКод = &ТорговыйКод
		|	И НЕ ТорговыеКоды.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ТорговыйКод", ТорговыйКод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка
	Иначе
		Возврат Справочники.ТорговыеКоды.ПустаяСсылка()// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЕсли;
	
	
КонецФункции
	
Функция ПолучитьВалютуПоСтроке(Наименование)
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат  ВыборкаДетальныеЗаписи.Ссылка
	Иначе
		Возврат Справочники.Валюты.RUB;
	КонецЕсли;
	
	

	
КонецФункции


Процедура КомандаФормыСчитатьДанныеSQL(НаДату) Экспорт
	
	масСообщения = новый Массив;
	
	// IMDEV-8927 ++
	ИдентификаторКомандыДляЗамера = "Ручной";
	// IMDEV-8927 --
	
	СчитатьДанныеSQL(НаДату);
	
	// IMDEV-8927 ++
	ИдентификаторКомандыДляЗамера = Неопределено;
	// IMDEV-8927 --
		
	Для каждого Сообщение Из масСообщения Цикл
		Сообщить(ТекстСообщения(Сообщение), Сообщение.Статус);
	КонецЦикла;
		
КонецПроцедуры

//Процедура КомандаФормыСоздатьОперацииПоБрокерскомуСчету() Экспорт  //IMAPPS-18376
Процедура КомандаФормыСоздатьОперацииПоБрокерскомуСчету(БрокерУИД="") Экспорт  //IMAPPS-18376
	
	масСообщения = новый Массив;
	
	ТелоПисьма = "";
	Важность = 0;
	
	// IMDEV-8927 ++
	ИдентификаторКомандыДляЗамера = "Ручной";
	// IMDEV-8927 --
	
	// IMAPPS-26041++
	// СоздатьОперацииПоБрокерскомуСчету(Важность);
	ЭтоВызовСКлиента = Истина;
	СоздатьОперацииПоБрокерскомуСчетуВПотоках(Важность);
	// IMAPPS-26041--
	
	// IMDEV-8927 ++
	ИдентификаторКомандыДляЗамера = Неопределено;
	// IMDEV-8927 --
	
	// MPazhukov IMAPPS-11737
	СоздатьПереводыПоБрокерскомуСчету(БрокерУИД);
	// MPazhukov IMAPPS-11737
		
	Для каждого Сообщение Из масСообщения Цикл
		Сообщить(ТекстСообщения(Сообщение), Сообщение.Статус);
	КонецЦикла;
		
КонецПроцедуры
	
Процедура СчитатьДанныеSQL(НаДату,Важность = 0) 
	
	// IMDEV-8927 ++
	ВремяНачалаЗамераПолучениеSQL = 0;
	КлючеваяОперацияПолучениеSQL = "";
	Если ЗначениеЗаполнено(ИдентификаторКомандыДляЗамера) Тогда
		КлючеваяОперацияПолучениеSQL = ПолучитьИмяКлючевойОперацииЗамера("ПолучениеSQL");
		ВремяНачалаЗамераПолучениеSQL = ОценкаПроизводительности.НачатьЗамерВремени();
	КонецЕсли;
	// IMDEV-8927 --
	
	Попытка
	
	ТаблицаДанных2.Очистить();
	
	//Данные для подстановки
	ТаблицаАС = АналитическиеСчетаБрокераДС();
	СоответствиеРегНомеровЦБ = ПолучитьСоответствиеРегНомеровЦБ();
	ТаблицаПараметровДоговоров = ПолучитьТаблицуПараметровДоговоров();
	СоответствиеКодЦБНаБирже = ПолучитьСоответствиеКодЦБНаБирже();
	ПустойАктив = Справочники.Активы.ПустаяСсылка();
	ВестиТолькоБухгалтерскийУчет = Константы.ВестиТолькоБухгалтерскийУчет.Получить();
	
	ConnectionSQL = Новый COMОбъект("ADODB.Connection");
	ServerName = "AMDBRATES\DBMVTBAM01"; //имя или IP-адрес сервера
	DSN = "BrokerReports"; //имя базы данных
	UID = "InfoLoader"; //логин пользователя SQL-сервера
	PWD = "Walk1PXx"; //пароль пользователя SQL-сервера
	ConnectString = "Provider=SQLOLEDB;" + "Data Source=" +ServerName + ";Initial Catalog=" + DSN + ";UID=" + UID + ";PWD=" + PWD;
	ConnectionSQL.ConnectionString = ConnectString;
	ConnectionSQL.ConnectionTimeOut = 15;
	ConnectionSQL.CommandTimeout = 30;
	ConnectionSQL.Open();
	
	CommandSQL = Новый COMОбъект("ADODB.Command");
	CommandSQL.ActiveConnection = ConnectionSQL;
	CommandSQL.CommandText = 
	"SELECT InvAccount, Date, Numb_Descr, Credited, Debited, BrokerID, TimeStamp, FileName  
	|FROM dwhTroyRpt_CashFlows
	|WHERE Date = '"+Формат(НаДату, "ДФ=yyyy-MM-dd")+"' and FileName like '%VTBUA_TOTAL_nonDMA'";
	
	CommandSQL.CommandType = 1;
	RecordSet = Новый COMОбъект("ADODB.RecordSet");
	RecordSet = CommandSQL.Execute();
	
	СчетчикСтрок = 0;
	
	Пока RecordSet.EOF() = 0 Цикл
		
		Актив = Неопределено;

		НазначениеПлатежа = СокрЛП(Recordset.Fields(2).Value);
		
		Если (СтрНайти(НазначениеПлатежа, "Выплата") > 0 И СтрНайти(НазначениеПлатежа, "купона") > 0)
			ИЛИ СтрНайти(Врег(НазначениеПлатежа), "ДИВИДЕН") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Комиссия за расчетные услуги") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Частичное погашение") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Полное погашение") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Списание комиссии с ИБС клиента") > 0
			//	IMAPPS-919
			ИЛИ СтрНайти(НазначениеПлатежа, "Погашение купона") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Депозитарная комиссия") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Использование брокером ДС клиента") > 0	//IMDEV-621, IMDEV-622  
			Тогда
			
			НоваяСтрока	= ТаблицаДанных2.Добавить();
			НоваяСтрока.ТорговыйКод = СокрЛП(Recordset.Fields(0).Value);
			
			Если ТипЗнч(Recordset.Fields(1).Value) = Тип("Дата") Тогда
				ДатаБалланса = Recordset.Fields(1).Value;
			Иначе
				ДатаБалланса = ПреобразоватьСтрокуВДату(СокрЛП(Recordset.Fields(1).Value));
			КонецЕсли;
			
			НоваяСтрока.ДатаЗагрузкиОтчета = Recordset.Fields(6).Value;
			НоваяСтрока.ИмяФайла = Recordset.Fields(7).Value;
			
			НоваяСтрока.Дата = ДатаБалланса;
			ИскатьКупон = Ложь;
			Если СтрНайти(НазначениеПлатежа, "Выплата") > 0 И СтрНайти(НазначениеПлатежа, "купона") > 0 Тогда
				НоваяСтрока.КодЦБ = СокрЛП(Лев(НазначениеПлатежа, СтрНайти(НазначениеПлатежа, "(Выплата")-1));
				ИскатьКупон = Истина;
				//	IMAPPS-919
			ИначеЕсли СтрНайти(НазначениеПлатежа, "Погашение купона") > 0 Тогда
				НоваяСтрока.КодЦБ = НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа);
				ИскатьКупон = Истина;
			ИначеЕсли СтрНайти(НазначениеПлатежа, "Частичное погашение") > 0 Тогда
				НоваяСтрока.КодЦБ = НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа); //НоваяСтрока.КодЦБ = СокрЛП(Лев(НазначениеПлатежа, Найти(НазначениеПлатежа, "(Частичное")-1)); //IMAPPS-17933
				//	IMAPPS-919
				
			ИначеЕсли СтрНайти(НазначениеПлатежа, "Полное погашение") > 0 Тогда
				НоваяСтрока.КодЦБ = НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа); //НоваяСтрока.КодЦБ = СокрЛП(Лев(НазначениеПлатежа, Найти(НазначениеПлатежа, "(Полное погашение")-1)); //IMAPPS-17933
			ИначеЕсли СтрНайти(Врег(НазначениеПлатежа), "ДИВИДЕНД") > 0 Тогда
				НоваяСтрока.КодЦБ = СокрЛП(Лев(НазначениеПлатежа, СтрНайти(НазначениеПлатежа, "(")-1));
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(НоваяСтрока.КодЦБ) Тогда
				НоваяСтрока.КодЦБ = НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа);
			КонецЕсли;
			
			НоваяСтрока.НазначениеПлатежа = НазначениеПлатежа;
			НоваяСтрока.Расход = Recordset.Fields(3).Value;
			НоваяСтрока.Приход = Recordset.Fields(4).Value;
			
			//Поиск бумаги
			АктивОбъект = СоответствиеКодЦБНаБирже.Получить(НоваяСтрока.КодЦБ);
			Если АктивОбъект <> Неопределено Тогда
				НоваяСтрока.Актив = АктивСервер.ПолучитьАктивПоОбъекту(АктивОбъект);
			Иначе
				КонтекстСопоставления = Перечисления.КонтекстСопоставления.ЦенныеБумаги;
				НоваяСтрока.Актив = РегистрыСведений.УниверсальныеСопоставления.ПрочитатьПрямоеСопоставление(КонтекстСопоставления,Справочники.Биржи.ПустаяСсылка(), НоваяСтрока.КодЦБ, Ложь, ДатаБалланса);
			КонецЕсли;
			
			
			//Заполним реквизиты по торговому коду
			КодТорг = Справочники.ТорговыеКоды.НайтиПоРеквизиту("ТорговыйКод", НоваяСтрока.ТорговыйКод);
			Если КодТорг = Справочники.ТорговыеКоды.ПустаяСсылка() Тогда
					ВалютаCashFlows = "RUB";
					КодТорг = Справочники.ТорговыеКоды.НайтиПоРеквизиту("ТорговыйКод", НоваяСтрока.ТорговыйКод + "/" + ВалютаCashFlows);
			КонецЕсли;

			Если ЗначениеЗаполнено(КодТорг) Тогда
				СтруктураКодТорг = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(КодТорг, "АналитическийСчетДС, ДоговорДУ, Биржа, Брокер, ДоговорБрокера");			
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураКодТорг);
				АналитическийСчетДС = НоваяСтрока.АналитическийСчетДС;
				Если НЕ ВестиТолькоБухгалтерскийУчет И ЗначениеЗаполнено(АналитическийСчетДС) Тогда
					НоваяСтрока.ФизическоеМестоХраненияДС = ?(ЗначениеЗаполнено(АналитическийСчетДС.АналитическийПризнакСчетаБрокера),АналитическийСчетДС.АналитическийПризнакСчетаБрокера, АналитическийСчетДС.МестоХранения);
				КонецЕсли;
			КонецЕсли;
			
			//Поиск купона
			Если ИскатьКупон И ЗначениеЗаполнено(НоваяСтрока.Актив)И ЗначениеЗаполнено(НоваяСтрока.ДоговорДУ) Тогда
				НоваяСтрока.Купон = ПолучитьКупон(ДатаБалланса, НоваяСтрока.Актив.Объект, НоваяСтрока.Расход, НоваяСтрока.ДоговорДУ, НоваяСтрока.ТорговыйКод, СчетчикСтрок, НоваяСтрока.ИмяФайла,Важность,НоваяСтрока.Валюта);
			КонецЕсли;
			
			СчетчикСтрок = СчетчикСтрок + 1;
		КонецЕсли; 
		
		RecordSet.MoveNext();
		
	КонецЦикла;
	
	RecordSet.Close();
	
	// После того, как набор записей уже не нужен, его нужно закрыть
	
	Если СчетчикСтрок = 0 Тогда
		//масСообщения.Добавить("Нет данных об операциях на дату: "+Формат(НаДату, "ДФ=dd.MM.yyyy")+"!");
		ДобавитьСообщение("", 0, "", "", "Нет данных об операциях на дату: "+Формат(НаДату, "ДФ=dd.MM.yyyy")+"!");
		
		// IMDEV-8927 ++
		Если ВремяНачалаЗамераПолучениеSQL > 0 Тогда
			ВесЗамераПолучениеSQL = 1;
			КомментарийЗамераПолучениеSQL = "ДатаОтчета=" + Формат(НаДату, "ДФ=dd.MM.yyyy")
				+ "; СтрокSQL=0"
				+ "; Отказ=Нет"
				+ ДополнениеКомментарияУдельныйВес(ВесЗамераПолучениеSQL, ВремяНачалаЗамераПолучениеSQL);
			ОценкаПроизводительности.ЗакончитьЗамерВремени(
				КлючеваяОперацияПолучениеSQL,
				ВремяНачалаЗамераПолучениеSQL,
				ВесЗамераПолучениеSQL,
				КомментарийЗамераПолучениеSQL,
				Ложь);
			ВремяНачалаЗамераПолучениеSQL = 0;
		КонецЕсли;
		// IMDEV-8927 --
		
		Возврат;		
	КонецЕсли;
	
	ТаблицаДанных2.Сортировать("Дата Возр");
	
	Исключение
		// IMDEV-8927 ++
		Если ВремяНачалаЗамераПолучениеSQL > 0 Тогда
			ВесЗамераПолучениеSQL = ?(СчетчикСтрок > 0, СчетчикСтрок, 1);
			КомментарийЗамераПолучениеSQL = "ДатаОтчета=" + Формат(НаДату, "ДФ=dd.MM.yyyy")
				+ "; СтрокSQL=" + СчетчикСтрок
				+ "; Отказ=Да"
				+ ДополнениеКомментарияУдельныйВес(ВесЗамераПолучениеSQL, ВремяНачалаЗамераПолучениеSQL);
			ОценкаПроизводительности.ЗакончитьЗамерВремени(
				КлючеваяОперацияПолучениеSQL,
				ВремяНачалаЗамераПолучениеSQL,
				ВесЗамераПолучениеSQL,
				КомментарийЗамераПолучениеSQL,
				Истина);
			ВремяНачалаЗамераПолучениеSQL = 0;
		КонецЕсли;
		// IMDEV-8927 --
		ВызватьИсключение;
	КонецПопытки;
	
	// IMDEV-8927 ++
	Если ВремяНачалаЗамераПолучениеSQL > 0 Тогда
		ВесЗамераПолучениеSQL = СчетчикСтрок;
		КомментарийЗамераПолучениеSQL = "ДатаОтчета=" + Формат(НаДату, "ДФ=dd.MM.yyyy")
			+ "; СтрокSQL=" + СчетчикСтрок
			+ "; СтрокТаблицы=" + ТаблицаДанных2.Количество()
			+ "; Отказ=Нет"
			+ ДополнениеКомментарияУдельныйВес(ВесЗамераПолучениеSQL, ВремяНачалаЗамераПолучениеSQL);
		ОценкаПроизводительности.ЗакончитьЗамерВремени(
			КлючеваяОперацияПолучениеSQL,
			ВремяНачалаЗамераПолучениеSQL,
			ВесЗамераПолучениеSQL,
			КомментарийЗамераПолучениеSQL,
			Ложь);
	КонецЕсли;
	// IMDEV-8927 --
	
КонецПроцедуры // 

Функция ОстаткиПоАналитическимСчетамБрокераДС(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.АналитическиеСчета) КАК АналитическийСчетДС,
	|	ХозрасчетныйОстаткиИОбороты.ДоговорДУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстатокБД,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК СуммаОборотКтБД,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК СуммаОборотДтБД,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстатокБД
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВУДС), , ) КАК ХозрасчетныйОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница (НачалоДня(Дата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница (КонецДня(Дата), ВидГраницы.Включая));
	
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции // ()

// IMAPPS-26041++
// Процедура СоздатьОперацииПоБрокерскомуСчету(Важность,Выводить = Истина)
Процедура СоздатьОперацииПоБрокерскомуСчетуПоток(ПараметрыВыполнения) Экспорт
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("Важность", 0);
	РезультатВыполнения.Вставить("масСообщения", Новый Массив);
	РезультатВыполнения.Вставить("ТелоПисьма", "");
	РезультатВыполнения.Вставить("ВыполненоУспешно", Ложь);
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, ПараметрыВыполнения.СервисныеПараметры.АдресХранилища);
	
	Выводить = ПараметрыВыполнения.СервисныеПараметры.Выводить;
	Важность = 0;
	
	ВходящиеДанныеТаблицаДанных2 = ПараметрыВыполнения.СервисныеПараметры.ТаблицаДанных2Хран.Получить();
	
	ТаблицаДанных2.Загрузить(ВходящиеДанныеТаблицаДанных2);
// IMAPPS-26041--
	
	СтатьяДДС_ИспДС_Брокером_Списание = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Использование дс брокером (списание)");
	СтатьяДДС_ИспДС_Брокером_Зачисление = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Использование дс брокером (зачисление)");
	СтатьяДДС_ИспДС_Брокером_Проценты = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Проценты на используемый остаток");
	
	Отказ = Ложь;
	НомСтр = 0;
	//Для Каждого Строчка из ТаблицаДанных2 Цикл
	//		
	//КонецЦикла;
	//
	//Если Отказ Тогда
	//	//масСообщения.Добавить("Загрузка не может быть выполнена");
	//	ДобавитьСообщение("Таблица ""Операции по счету брокера""", , , , "Загрузка не может быть выполнена", СтатусСообщения.Важное);
	//	Возврат;
	//КонецЕсли;	
	
	ТаблицаДанных2.Сортировать("Дата Возр");
	
	ПВХ			 = ПланыВидовХарактеристик.ВидыАктивов;
	ПС			 = ПланыСчетов.Хозрасчетный;
	//ВалютаРег	 = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	СписокДоков  = Новый СписокЗначений;
	ВестиТолькоБухгалтерскийУчет = Константы.ВестиТолькоБухгалтерскийУчет.Получить();
	
	НомСтр = 0;
	
	//масСообщения.Добавить("Идет формирование списка документов...");
	
	ВключатьРасходыВСтоимость = Истина;
	ДатаСделки = '00010101';
	//Создание документов Операция по счету брокера 
	НомСтр = 0;
	
	Для каждого Строчка Из ТаблицаДанных2 Цикл
		НомСтр = НомСтр + 1;
		Если НомСтр = 1 Тогда
			ТаблицаСозданныхДокументов = ПолучитьТаблицуОперацийПоСчетуБрокера(Строчка.Дата);
		КонецЕсли; 

		ПредставлениеДоговораДУ = ?(Строчка.ДоговорДУ.Пустая(), "договор ДУ не найден", СокрЛП(Строчка.ДоговорДУ));
		Если НЕ ЗначениеЗаполнено(Строчка.Актив) И ЗначениеЗаполнено(Строчка.КодЦБ) Тогда
			//масСообщения.Добавить("В строке №" + НомСтр + " таблицы ""Операции по счету брокера"" не указана ц/б");
			ДобавитьСообщение("Таблица ""Операции по счету брокера""", НомСтр, Строчка.ТорговыйКод, ПредставлениеДоговораДУ, "не указана ц/б", СтатусСообщения.Важное);
			Важность=1;
			Продолжить; 
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Строчка.Брокер) Тогда
			//масСообщения.Добавить("В строке №" + НомСтр + " таблицы ""Операции по счету брокера"" не указан Брокер");
			ДобавитьСообщение("Таблица ""Операции по счету брокера""", НомСтр, Строчка.ТорговыйКод, ПредставлениеДоговораДУ, "не указан Брокер", СтатусСообщения.Важное);
			Важность=1;
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Строчка.ДоговорБрокера)Тогда
			//масСообщения.Добавить("В строке №" + НомСтр + " таблицы ""Операции по счету брокера"" не указан договор брокера Брокер");
			ДобавитьСообщение("Таблица ""Операции по счету брокера""", НомСтр, Строчка.ТорговыйКод, ПредставлениеДоговораДУ, "не указан договор брокера", СтатусСообщения.Важное);
			Важность=1;
			Продолжить;
		КонецЕсли;

		// IMAPPS-17933 ++
		// Типы клиентов
		ТипВИ		 = Перечисления.ТипыКлиентовДУ.ВоеннаяИпотека;
		ТипПН_НПФ    = Перечисления.ТипыКлиентовДУ.ПенсионныеНакопленияГражданПереданныеЧерезНПФ;
		ТипПР_НПФ    = Перечисления.ТипыКлиентовДУ.ПенсионныеРезервыНПФ;
		Тип_ПФР    	 = Перечисления.ТипыКлиентовДУ.ПенсионныеНакопленияГражданПереданныеПФР;
		ТипСС_НПФ    = Перечисления.ТипыКлиентовДУ.СобственныеСредстваНПФ;
		ТипФФЦК	     = Перечисления.ТипыКлиентовДУ.ФондЦелевогоКапитала;
		// IMAPPS-17933 --
		
		Если НЕ ЗначениеЗаполнено(Строчка.ДоговорДУ) И НЕ ЗначениеЗаполнено(Строчка.Брокер) И НЕ ЗначениеЗаполнено(Строчка.ДоговорБрокера) Тогда
			Продолжить;
		КонецЕсли;
		
				
		Если СтрНайти(Строчка.НазначениеПлатежа, "Комиссия за расчетные услуги") > 0 ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Списание комиссии с ИБС клиента") > 0
			//	IMAPPS-919
			ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Депозитарная комиссия") > 0 ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Использование брокером ДС") > 0
			Тогда
			НайденныеДокументы = ТаблицаСозданныхДокументов.НайтиСтроки(Новый Структура("Контрагент, ДоговорДУ, СуммаДокумента, ДоговорКонтрагента", Строчка.Брокер, Строчка.ДоговорДУ, Число(Строчка.Приход), Строчка.ДоговорБрокера));
		Иначе
			НайденныеДокументы = ТаблицаСозданныхДокументов.НайтиСтроки(Новый Структура("Контрагент, ДоговорДУ, СуммаДокумента, ДоговорКонтрагента", Строчка.Брокер, Строчка.ДоговорДУ, Число(Строчка.Расход), Строчка.ДоговорБрокера));																			
		КонецЕсли;	
		
		ДокументОперацияПоСчетуБрокера = Неопределено;
		
		Если ЗначениеЗаполнено(НайденныеДокументы) И НайденныеДокументы.Количество() > 0 Тогда
			ДокументОперацияПоСчетуБрокера = НайденныеДокументы.Получить(0).Ссылка;				
		КонецЕсли;
		
		Если ДокументОперацияПоСчетуБрокера = Неопределено Тогда
			ДокументОперацияПоСчетуБрокера = Документы.ОперацияПоСчетуБрокера.СоздатьДокумент();
			Создан = Истина;     
		Иначе
			ДокументОперацияПоСчетуБрокера = ДокументОперацияПоСчетуБрокера.ПолучитьОбъект();
			Создан = Ложь;
		КонецЕсли;		
		
		ДокументОперацияПоСчетуБрокера.Дата = НачалоДня(Строчка.Дата)+36000;
		ДокументОперацияПоСчетуБрокера.ДоговорДУ = Строчка.ДоговорДУ;
		ДокументОперацияПоСчетуБрокера.БУ = Истина;
		//Kmusorin 	IMAPPS-3207 убираем НУ для физиков	
		Если Строчка.ДоговорДУ.Клиент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			ДокументОперацияПоСчетуБрокера.НУ = Ложь;
		Иначе
			ДокументОперацияПоСчетуБрокера.НУ = Истина;
		КонецЕсли;
		ДокументОперацияПоСчетуБрокера.Контрагент = Строчка.Брокер;
		ДокументОперацияПоСчетуБрокера.ДоговорКонтрагента = Строчка.ДоговорБрокера;
		Если ВестиТолькоБухгалтерскийУчет Тогда
			ДокументОперацияПоСчетуБрокера.УУ = Ложь;
			ДокументОперацияПоСчетуБрокера.ВУ = Ложь;
		Иначе
			ДокументОперацияПоСчетуБрокера.УУ = Истина;
			ДокументОперацияПоСчетуБрокера.ВУ = Истина;
			ДокументОперацияПоСчетуБрокера.АналитическийСчетБрокера 	= Строчка.АналитическийСчетДС;
			ДокументОперацияПоСчетуБрокера.ФизическоеМестоХраненияДС 	= Строчка.ФизическоеМестоХраненияДС;
		КонецЕсли;
		
		//ДокументОперацияПоСчетуБрокера.Раздел = Справочники.Разделы.Торговый;
		ДокументОперацияПоСчетуБрокера.Биржа = Строчка.Биржа;
		ДокументОперацияПоСчетуБрокера.НаименованиеОперации = Строчка.НазначениеПлатежа;
		ВалютаДоговора = Строчка.ДоговорБрокера.ВалютаВзаиморасчетов;
		Если ВалютаДоговора <> Строчка.ДоговорДУ.Валюта Тогда
			КурсКратность = МодульВалютногоУчета.ПолучитьКурсВалюты(Строчка.ДоговорДУ.Валюта, ВалютаДоговора, Строчка.Дата);
			ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов 		= КурсКратность.Курс;
			ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов 	= КурсКратность.Кратность;
		Иначе	
			ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов = 1;
			ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов = 1;
			ДокументОперацияПоСчетуБрокера.ВалютаДокумента = Строчка.ДоговорДУ.Валюта;
		КонецЕсли;                                                                                   
		ВалютаПоСтроке =  Строчка.Валюта;
		Если ВалютаПоСтроке <> Строчка.ДоговорДУ.Валюта 
			И НЕ ВалютаПоСтроке = Справочники.Валюты.ПустаяСсылка() Тогда 
			КурсКратность = МодульВалютногоУчета.ПолучитьКурсВалюты(Строчка.ДоговорДУ.Валюта, ВалютаПоСтроке, Строчка.Дата);
			ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов 		= КурсКратность.Курс;
			ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов 	= КурсКратность.Кратность; 
			ДокументОперацияПоСчетуБрокера.ВалютаДокумента 			= ВалютаПоСтроке;
			ДокументОперацияПоСчетуБрокера.ВалютаКорреспондента		= ВалютаПоСтроке;  
			ДокументОперацияПоСчетуБрокера.КурсКорреспондента      	= КурсКратность.Курс;
    		ДокументОперацияПоСчетуБрокера.КратностьКорреспондента 	= КурсКратность.Кратность; 
		КонецЕсли;	
		
		Если СтрНайти(Строчка.НазначениеПлатежа, "Комиссия за расчетные услуги") > 0 ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Списание комиссии с ИБС клиента") > 0
			//ИЛИ Найти(Строчка.НазначениеПлатежа, "NBO") 
			//	IMAPPS-919
			ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Депозитарная комиссия") > 0
			Тогда
			
			ДокументОперацияПоСчетуБрокера.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Списание;
			//ДокументОперацияПоСчетуБрокера.КоррСчет = ПланыСчетов.Хозрасчетный.ПрочиеВзаиморасчеты; //VTB 27.11.2012 изменил счет ПрочиеРасходы
			ДокументОперацияПоСчетуБрокера.КоррСчет = ПланыСчетов.Хозрасчетный.ДепозитарныеУслуги;//VTB 27.11.2012 изменил счетс ПрочиеРасходы
			ДокументОперацияПоСчетуБрокера.СтатьяЗатратКорреспондента = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Комиссия Депозитария"); //VTB 27.11.2012
			//Kmusorin			IMAPPS-3207
			// IMAPPS-17933 ++
			//ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ФЛ/ЮЛ");
			Если Строчка.Брокер = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("99904467-45e3-11e2-b4e9-005056b100ec")) Тогда 
				Если Строчка.ДоговорДУ.ТипКлиентаДУ = ТипВИ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ВИ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПН_НПФ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ПН НПФ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПР_НПФ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ПР НПФ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = Тип_ПФР Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ПФР");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипСС_НПФ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- СС НПФ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипФФЦК Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ФФЦК");
				Иначе 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ФЛ/ЮЛ");
				КонецЕсли;
			Иначе 
				ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ФЛ/ЮЛ");
			КонецЕсли;
			// IMAPPS-17933 --
			ДокументОперацияПоСчетуБрокера.СтатьяЗатрат = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Комиссия Депозитария");
			ДокументОперацияПоСчетуБрокера.СубконтоКоррСчета1 = Справочники.СтатьиДоходовИРасходов.КомиссияБрокера;
			ДокументОперацияПоСчетуБрокера.СуммаДокумента = Строчка.Приход;
			
			Если  ВалютаДоговора = Строчка.ДоговорДУ.Валюта Тогда
				ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = Строчка.Приход;
			Иначе
				ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Строчка.Приход, ВалютаДоговора, Строчка.ДоговорДУ.Валюта, 1, ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов, 1, ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов);
			КонецЕсли;
			
			// IMAPPS-28406 ++
		ИначеЕсли СтрНайти(Строчка.НазначениеПлатежа, "Куп. дох. по обл.") > 0 Или СтрНайти(Строчка.НазначениеПлатежа, "Выплата купонного дохода по облигациям") > 0 Тогда
			
			Если ЗначениеЗаполнено(Строчка.Актив) И ТипЗнч(Строчка.Актив.Объект) = Тип("СправочникСсылка.Облигации") Тогда
				Облигация = Строчка.Актив.Объект;
				Эмитент = Облигация.Эмитент;
			Иначе
				ДобавитьСообщение(Строчка.ИмяФайла, НомСтр, Строчка.ТорговыйКод, Строчка.ДоговорДУ, "Неверный тип актива для данной операции", СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;
			ДокументОперацияПоСчетуБрокера.НУ = Ложь;
			ДокументОперацияПоСчетуБрокера.ВалютаКорреспондента =  Справочники.Валюты.RUB;
			ДокументОперацияПоСчетуБрокера.КратностьКорреспондента = 1;
			ДокументОперацияПоСчетуБрокера.КурсКорреспондента = 1;
			ДокументОперацияПоСчетуБрокера.СуммаКорреспондента = Строчка.Приход;
			ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов = 1;
			ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов = 1;
			ДокументОперацияПоСчетуБрокера.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Зачисление;
			ДокументОперацияПоСчетуБрокера.СтатьяЗатрат = Справочники.СтатьиДоходовИРасходов.РасчетыПоНКД;
			
			Если Не Создан Тогда 
				ДобавитьСообщение(Строчка.ИмяФайла, НомСтр, Строчка.ТорговыйКод, Строчка.ДоговорДУ, "Уже создан документ "+ДокументОперацияПоСчетуБрокера, СтатусСообщения.Информация);
				Продолжить;
			ИначеЕсли ПолучитьДебиторкуПоПогашениюОблигации(Строчка.ДоговорДУ, Облигация, Эмитент, Строчка.Приход,  Строчка.Дата, Строчка.Валюта) Тогда
				ДокументОперацияПоСчетуБрокера.КоррСчет = ПланыСчетов.Хозрасчетный.РасчетыПоОблигациям;  // 76.04.2.2
				
					Если Строчка.ДоговорДУ.ТипКлиентаДУ = ТипВИ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ВИ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПН_НПФ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ПН НПФ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПР_НПФ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ПР НПФ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = Тип_ПФР Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ПФР");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипСС_НПФ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - СС НПФ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипФФЦК Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ФФЦК");
					Иначе 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ФЛ/ЮЛ");
					КонецЕсли;
				ДокументОперацияПоСчетуБрокера.Корреспондент = Эмитент;
				ДокументОперацияПоСчетуБрокера.СубконтоКоррСчета2 = Облигация;
				ДокументОперацияПоСчетуБрокера.СуммаДокумента = Строчка.Приход;
				ДокументОперацияПоСчетуБрокера.СуммаКорреспондента = Строчка.Приход;
				ДокументОперацияПоСчетуБрокера.ДокументОснование = НайтиДокументНачислениеНКД(Строчка.ДоговорДУ, Облигация, Строчка.Дата); //НайтиПогашениеОблигаций(Строчка.ДоговорДУ, Облигация, Строчка.Дата, Строчка.Приход);
				ДокументОперацияПоСчетуБрокера.СтатьяЗатратКорреспондента = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Расчеты по НКД");
				ДокументОперацияПоСчетуБрокера.СубконтоКоррСчета3 = Строчка.Купон;
				Если ВалютаДоговора = Строчка.ДоговорДУ.Валюта Тогда
					ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = Строчка.Приход;
				Иначе
					ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Строчка.Приход, ВалютаДоговора, Строчка.ДоговорДУ.Валюта, 1, ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов, 1, ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов);
				КонецЕсли;
			Иначе
				ДобавитьСообщение(Строчка.ИмяФайла, НомСтр, Строчка.ТорговыйКод, Строчка.ДоговорДУ, "Не найден документ ""Погашение облигаций"" по облигации "+Облигация, СтатусСообщения.Важное);
				Важность = 1;
            	Продолжить;
			КонецЕсли;
			// IMAPPS-28406 --
			
		ИначеЕсли СтрНайти(Строчка.НазначениеПлатежа, "Комиссия «Проведение расчетных операций с ценными бумагами по итогам сделок»") > 0
			ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Комиссия «Возмещение расходов НКО АО НРД за обслуживание выпуска ценных бумаг»") > 0
			ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Оплата комиссии по операции Проведение расчетных операций с ЦБ (оплата)") > 0
			ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Комиссия за хранение цб. Счет депо") > 0  //IMAPPS-37065
			Тогда //IMAPPS-13993
			// MPazhukov IMAPPS-12253
			ДокументОперацияПоСчетуБрокера.СчетБрокера = ПланыСчетов.Хозрасчетный.РасчетыБрокераПоСделкам55;
			ДокументОперацияПоСчетуБрокера.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Списание;
			ДокументОперацияПоСчетуБрокера.КоррСчет = ПланыСчетов.Хозрасчетный.ДепозитарныеУслуги;//VTB 27.11.2012 изменил счетс ПрочиеРасходы
			ДокументОперацияПоСчетуБрокера.СтатьяЗатратКорреспондента = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Комиссия Брокера (Депозитарий)"); //VTB 27.11.2012
			// IMAPPS-17933 ++
			//ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ФЛ/ЮЛ");
			Если Строчка.Брокер = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("99904467-45e3-11e2-b4e9-005056b100ec")) Тогда 
				Если Строчка.ДоговорДУ.ТипКлиентаДУ = ТипВИ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ВИ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПН_НПФ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ПН НПФ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПР_НПФ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ПР НПФ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = Тип_ПФР Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ПФР");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипСС_НПФ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- СС НПФ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипФФЦК Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ФФЦК");
				Иначе 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ФЛ/ЮЛ");
				КонецЕсли;
			Иначе 
				ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Комиссия депозитария- ФЛ/ЮЛ");
			КонецЕсли;
			// IMAPPS-17933 --
			
			ДокументОперацияПоСчетуБрокера.СтатьяЗатрат = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Комиссия Брокера (Депозитарий)");
			ДокументОперацияПоСчетуБрокера.СубконтоКоррСчета1 = Справочники.СтатьиДоходовИРасходов.КомиссияБрокера;
			
			ДокументОперацияПоСчетуБрокера.СуммаДокумента = Строчка.Расход;
			Если ВалютаДоговора = Строчка.ДоговорДУ.Валюта Тогда
				ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = Строчка.Расход;
			Иначе
				ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Строчка.Расход, ВалютаДоговора, Строчка.ДоговорДУ.Валюта, 1, ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов, 1, ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов);
			КонецЕсли;
			
			//IMAPPS-13993
			Если СтрНайти(Строчка.НазначениеПлатежа, "Комиссия «Возмещение расходов НКО АО НРД за обслуживание выпуска ценных бумаг»") > 0 Тогда // IMAPPS-13993
				ДокументОперацияПоСчетуБрокера.Дата = НачалоДня(ДокументОперацияПоСчетуБрокера.Дата) + 11 * 60 * 60; // 11-00
			КонецЕсли;	
		ИначеЕсли (СтрНайти(Строчка.НазначениеПлатежа, "Выплата") > 0 И СтрНайти(Строчка.НазначениеПлатежа, "купона") > 0)
			//	IMAPPS-919
			Или СтрНайти(Строчка.НазначениеПлатежа, "Погашение купона") > 0
			Тогда
			Если ЗначениеЗаполнено(Строчка.Актив) И ТипЗнч(Строчка.Актив.Объект) = Тип("СправочникСсылка.Облигации") Тогда
				Облигация = Строчка.Актив.Объект;
				Эмитент = Облигация.Эмитент;
			Иначе
				//масСообщения.Добавить("В строке №" + НомСтр + " таблицы ""Операции по счету брокера"" неверный тип актива для данной операции.");
				ДобавитьСообщение(Строчка.ИмяФайла, НомСтр, Строчка.ТорговыйКод, Строчка.ДоговорДУ, "неверный тип актива для данной операции", СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;
			
			Если Не Создан Тогда 
				//масСообщения.Добавить("Уже создан документ "+ДокументОперацияПоСчетуБрокера+ " для строки №" + НомСтр + " в таблице ""Операции по счету брокера"".");
				ДобавитьСообщение(Строчка.ИмяФайла, НомСтр, Строчка.ТорговыйКод, Строчка.ДоговорДУ, "Уже создан документ "+ДокументОперацияПоСчетуБрокера, СтатусСообщения.Информация);
				Продолжить;
			ИначеЕсли ПолучитьДебиторкуПоПогашениюКупона(Строчка.ДоговорДУ, Облигация, Строчка.Расход, Строчка.Дата, Строчка.Валюта) Тогда
				ДокументОперацияПоСчетуБрокера.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Зачисление;
				ДокументОперацияПоСчетуБрокера.КоррСчет = ПланыСчетов.Хозрасчетный.РасчетыПоОблигациям; // 76.04.2.1
	//Kmusorin			IMAPPS-3207
			    ДокументОперацияПоСчетуБрокера.СтатьяЗатратКорреспондента = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Начисление НКД");
				// IMAPPS-17933 ++
				//ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ФЛ/ЮЛ");
				Если Строчка.Брокер = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("99904467-45e3-11e2-b4e9-005056b100ec")) Тогда 
					Если Строчка.ДоговорДУ.ТипКлиентаДУ = ТипВИ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ВИ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПН_НПФ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ПН НПФ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПР_НПФ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ПР НПФ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = Тип_ПФР Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ПФР");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипСС_НПФ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - СС НПФ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипФФЦК Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ФФЦК");
					Иначе 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ФЛ/ЮЛ");
					КонецЕсли;
				Иначе 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ФЛ/ЮЛ");
				КонецЕсли;
				// IMAPPS-17933 --
				ДокументОперацияПоСчетуБрокера.СтатьяЗатрат = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Начисление НКД");
				ДокументОперацияПоСчетуБрокера.Корреспондент = Облигация.Эмитент;
				ДокументОперацияПоСчетуБрокера.СубконтоКоррСчета2 = Облигация;
				ДокументОперацияПоСчетуБрокера.СубконтоКоррСчета3 = Строчка.Купон;
				ДокументОперацияПоСчетуБрокера.ДокументОснование = НайтиДокументНачислениеНКД(Строчка.ДоговорДУ, Облигация, Строчка.Дата);
				Если Не ЗначениеЗаполнено(Строчка.Купон) Тогда 
					//масСообщения.Добавить("Внимание! Не заполнен Купонный период по облигации "+Облигация+ " в строке №" + НомСтр + " в таблице ""Операции по счету брокера"".");
					ДобавитьСообщение(Строчка.ИмяФайла, НомСтр, Строчка.ТорговыйКод, Строчка.ДоговорДУ, "Внимание! Не заполнен Купонный период по облигации "+Облигация, СтатусСообщения.Информация);
				КонецЕсли;
				ДокументОперацияПоСчетуБрокера.СуммаДокумента = Строчка.Расход;
				ДокументОперацияПоСчетуБрокера.СуммаКорреспондента = Строчка.Расход;
				Если НЕ ДокументОперацияПоСчетуБрокера.ВалютаДокумента = Справочники.Валюты.RUB Тогда
					ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Строчка.Расход,ВалютаДоговора,   ДокументОперацияПоСчетуБрокера.ВалютаДокумента, ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов, 1, ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов,1);
				ИначеЕсли ВалютаДоговора = Строчка.ДоговорДУ.Валюта Тогда
					ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = Строчка.Расход;
				Иначе
					ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Строчка.Расход, ВалютаДоговора, Строчка.ДоговорДУ.Валюта, 1, ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов, 1, ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов);
				КонецЕсли;	
				
			Иначе	
				//масСообщения.Добавить("Не найден документ ""Начисление купонного дохода"" по облигации "+Облигация+ " в строке №" + НомСтр + " в таблице ""Операции по счету брокера"". Документ ""Операция по счету брокера"" не сформирован.");
				ДобавитьСообщение(Строчка.ИмяФайла, НомСтр, Строчка.ТорговыйКод, Строчка.ДоговорДУ, "Не найден документ ""Начисление купонного дохода"" по облигации "+Облигация, СтатусСообщения.Важное); 
				Важность = 1;
				Продолжить;
			КонецЕсли;
		// IMAPPS-28406 ++ IMAPPS-28903++
		ИначеЕсли СтрНайти(Строчка.НазначениеПлатежа, "Ден.ср-ва от погаш. номин.ст-ти обл.") > 0 ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Част.погаш.номин. обл.") > 0 
			ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Погашение номинальной стоимости облигаций") > 0 Тогда
			
			Если ЗначениеЗаполнено(Строчка.Актив) И ТипЗнч(Строчка.Актив.Объект) = Тип("СправочникСсылка.Облигации") Тогда
				Облигация = Строчка.Актив.Объект;
				Эмитент = Облигация.Эмитент;
			Иначе
				ДобавитьСообщение(Строчка.ИмяФайла, НомСтр, Строчка.ТорговыйКод, Строчка.ДоговорДУ, "Неверный тип актива для данной операции", СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;
			
			ДокументОперацияПоСчетуБрокера.ВалютаКорреспондента =  Справочники.Валюты.RUB;
			ДокументОперацияПоСчетуБрокера.КратностьКорреспондента = 1;
			ДокументОперацияПоСчетуБрокера.КурсКорреспондента = 1;
			ДокументОперацияПоСчетуБрокера.СуммаКорреспондента = Строчка.Приход;
			ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов = 1;
			ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов = 1;
			ДокументОперацияПоСчетуБрокера.НУ = Ложь;
			
			Если Не Создан Тогда 
				ДобавитьСообщение(Строчка.ИмяФайла, НомСтр, Строчка.ТорговыйКод, Строчка.ДоговорДУ, "Уже создан документ "+ДокументОперацияПоСчетуБрокера, СтатусСообщения.Информация);
				Продолжить;
			ИначеЕсли ПолучитьДебиторкуПоПогашениюОблигации(Строчка.ДоговорДУ, Облигация, Эмитент, Строчка.Приход,  Строчка.Дата) Тогда
				ДокументОперацияПоСчетуБрокера.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Зачисление;
				ДокументОперацияПоСчетуБрокера.КоррСчет = ПланыСчетов.Хозрасчетный.РасчетыПоОблигациям_ПогашениеТела;  // 76.04.2.2
				
				ДокументОперацияПоСчетуБрокера.СтатьяЗатратКорреспондента = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Амортизация");
				Если Строчка.ДоговорДУ.ТипКлиентаДУ = ТипВИ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - ВИ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПН_НПФ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - ПН НПФ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПР_НПФ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - ПР НПФ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = Тип_ПФР Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - ПФР");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипСС_НПФ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - СС НПФ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипФФЦК Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - ФФЦК");
				Иначе 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - ФЛ/ЮЛ");
				КонецЕсли;
					
				ДокументОперацияПоСчетуБрокера.СтатьяЗатрат = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Амортизация");
				ДокументОперацияПоСчетуБрокера.Корреспондент = Эмитент;
				ДокументОперацияПоСчетуБрокера.СубконтоКоррСчета2 = Облигация;
				ДокументОперацияПоСчетуБрокера.СуммаДокумента = Строчка.Приход;
				ДокументОперацияПоСчетуБрокера.СуммаКорреспондента = Строчка.Приход;
				ДокументОперацияПоСчетуБрокера.ДокументОснование = НайтиПогашениеОблигаций(Строчка.ДоговорДУ, Облигация, Строчка.Дата, Строчка.Приход);
				Если ВалютаДоговора = Строчка.ДоговорДУ.Валюта Тогда
					ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = Строчка.Приход;
				Иначе
					ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Строчка.Приход, ВалютаДоговора, Строчка.ДоговорДУ.Валюта, 1, ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов, 1, ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов);
				КонецЕсли;
			Иначе
				//масСообщения.Добавить("Не найден документ ""Погашение облигаций"" по облигации "+Облигация+ " в строке №" + НомСтр + " в таблице ""Операции по счету брокера"". Документ ""Операция по счету брокера"" не сформирован.");
				ДобавитьСообщение(Строчка.ИмяФайла, НомСтр, Строчка.ТорговыйКод, Строчка.ДоговорДУ, "Не найден документ ""Погашение облигаций"" по облигации "+Облигация, СтатусСообщения.Важное);
				Важность = 1;
            	Продолжить;
			КонецЕсли;
		// IMAPPS-28406 --
		
		ИначеЕсли СтрНайти(Строчка.НазначениеПлатежа, "Частичное погашение") > 0 ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Полное погашение") > 0 Тогда
			
			Если ЗначениеЗаполнено(Строчка.Актив) И ТипЗнч(Строчка.Актив.Объект) = Тип("СправочникСсылка.Облигации") Тогда
				Облигация = Строчка.Актив.Объект;
				Эмитент = Облигация.Эмитент;
			Иначе
				//масСообщения.Добавить("В строке №" + НомСтр + " таблицы ""Операции по счету брокера"" неверный тип актива для данной операции.");
				ДобавитьСообщение(Строчка.ИмяФайла, НомСтр, Строчка.ТорговыйКод, Строчка.ДоговорДУ, "Неверный тип актива для данной операции", СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;
			
			ДокументОперацияПоСчетуБрокера.ВалютаКорреспондента =  Справочники.Валюты.RUB;
			ДокументОперацияПоСчетуБрокера.КратностьКорреспондента = 1;
			ДокументОперацияПоСчетуБрокера.КурсКорреспондента = 1;
			ДокументОперацияПоСчетуБрокера.СуммаКорреспондента = Строчка.Расход;
			ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов = 1;
			ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов = 1;
			ДокументОперацияПоСчетуБрокера.НУ = Ложь;
			
			Если Не Создан Тогда 
				//масСообщения.Добавить("Уже создан документ "+ДокументОперацияПоСчетуБрокера+ " для строки №" + НомСтр + " в таблице ""Операции по счету брокера"".");
				ДобавитьСообщение(Строчка.ИмяФайла, НомСтр, Строчка.ТорговыйКод, Строчка.ДоговорДУ, "Уже создан документ "+ДокументОперацияПоСчетуБрокера, СтатусСообщения.Информация);
				Продолжить;
			ИначеЕсли ПолучитьДебиторкуПоПогашениюОблигации(Строчка.ДоговорДУ, Облигация, Эмитент, Строчка.Расход,  Строчка.Дата) Тогда
				ДокументОперацияПоСчетуБрокера.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Зачисление;
				ДокументОперацияПоСчетуБрокера.КоррСчет = ПланыСчетов.Хозрасчетный.РасчетыПоОблигациям_ПогашениеТела;  // 76.04.2.2
				
				//Kmusorin			IMAPPS-3207		
	            ДокументОперацияПоСчетуБрокера.СтатьяЗатратКорреспондента = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Амортизация");
				// IMAPPS-17933 ++
				//ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - ФЛ/ЮЛ");
				Если Строчка.Брокер = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("99904467-45e3-11e2-b4e9-005056b100ec")) Тогда 
					Если Строчка.ДоговорДУ.ТипКлиентаДУ = ТипВИ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - ВИ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПН_НПФ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - ПН НПФ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПР_НПФ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - ПР НПФ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = Тип_ПФР Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - ПФР");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипСС_НПФ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - СС НПФ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипФФЦК Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - ФФЦК");
					Иначе 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - ФЛ/ЮЛ");
					КонецЕсли;
				Иначе 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Амортизация - ФЛ/ЮЛ");
				КонецЕсли;
				// IMAPPS-17933 --
				ДокументОперацияПоСчетуБрокера.СтатьяЗатрат = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Амортизация");
				ДокументОперацияПоСчетуБрокера.Корреспондент = Эмитент;
				ДокументОперацияПоСчетуБрокера.СубконтоКоррСчета2 = Облигация;
				ДокументОперацияПоСчетуБрокера.СуммаДокумента = Строчка.Расход;
				ДокументОперацияПоСчетуБрокера.СуммаКорреспондента = Строчка.Расход;
				ДокументОперацияПоСчетуБрокера.ДокументОснование = НайтиПогашениеОблигаций(Строчка.ДоговорДУ, Облигация, Строчка.Дата, Строчка.Расход);
				Если ВалютаДоговора = Строчка.ДоговорДУ.Валюта Тогда
					ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = Строчка.Расход;
				Иначе
					ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Строчка.Расход, ВалютаДоговора, Строчка.ДоговорДУ.Валюта, 1, ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов, 1, ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов);
				КонецЕсли;
			Иначе
				//масСообщения.Добавить("Не найден документ ""Погашение облигаций"" по облигации "+Облигация+ " в строке №" + НомСтр + " в таблице ""Операции по счету брокера"". Документ ""Операция по счету брокера"" не сформирован.");
				ДобавитьСообщение(Строчка.ИмяФайла, НомСтр, Строчка.ТорговыйКод, Строчка.ДоговорДУ, "Не найден документ ""Погашение облигаций"" по облигации "+Облигация, СтатусСообщения.Важное);
				Важность = 1;
            	Продолжить;
			КонецЕсли; 
			
		//IMAPPS-28903  ++	
		ИначеЕсли СтрНайти(Врег(Строчка.НазначениеПлатежа), "ДИВИДЕНД") > 0 ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Дивиденд") > 0
			ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Выплата дохода по акциям") > 0 Тогда
			
			Если ЗначениеЗаполнено(Строчка.Актив) И ТипЗнч(Строчка.Актив.Объект) = Тип("СправочникСсылка.Акции") Тогда
				Акция = Строчка.Актив.Объект;
				Эмитент = Акция.Эмитент;
			Иначе
				//масСообщения.Добавить("В строке №" + НомСтр + " таблицы ""Операции по счету брокера"" неверный тип актива для данной операции.");
				ДобавитьСообщение(Строчка.ИмяФайла, НомСтр, Строчка.ТорговыйКод, Строчка.ДоговорДУ, "Неверный тип актива для данной операции.", СтатусСообщения.Важное);     
				Важность = 1;
				Продолжить;
			КонецЕсли;
			
			Если ВестиТолькоБухгалтерскийУчет Тогда
				
				ДокументОперацияПоСчетуБрокера.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Зачисление;
				ДокументОперацияПоСчетуБрокера.КоррСчет = ПланыСчетов.Хозрасчетный.РасчетыПоДивидендам;
				// IMAPPS-17933 ++
				//ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды");
				Если Строчка.Брокер = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("99904467-45e3-11e2-b4e9-005056b100ec")) Тогда 
					Если Строчка.ДоговорДУ.ТипКлиентаДУ = ТипВИ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - ВИ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПН_НПФ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - ПН НПФ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПР_НПФ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - ПР НПФ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = Тип_ПФР Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - ПФР");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипСС_НПФ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - СС НПФ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипФФЦК Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - ФФЦК");
					Иначе 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - ФЛ/ЮЛ");
					КонецЕсли;
				Иначе 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - ФЛ/ЮЛ");
				КонецЕсли;
				// IMAPPS-17933 --
				ДокументОперацияПоСчетуБрокера.СтатьяЗатрат = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Дивиденды");
				ДокументОперацияПоСчетуБрокера.Корреспондент = Эмитент;
				//ДокументОперацияПоСчетуБрокера.СубконтоКоррСчета1 = АктивСервер.ПолучитьАктивПоОбъекту(Акция);
				ДокументОперацияПоСчетуБрокера.СубконтоКоррСчета1 = АктивСервер.ПолучитьАктивПоОбъекту(Акция);
				// IMAPPS-28903
				Если СтрНайти(Строчка.НазначениеПлатежа, "Дивиденд") > 0 Тогда
					ДокументОперацияПоСчетуБрокера.СуммаДокумента = Строчка.Приход;
				    Если ВалютаДоговора = Строчка.ДоговорДУ.Валюта Тогда
					ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = Строчка.Приход;
				    Иначе
					ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Строчка.Приход, ВалютаДоговора, Строчка.ДоговорДУ.Валюта, 1, ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов, 1, ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов);
				    КонецЕсли;
				Иначе	
				ДокументОперацияПоСчетуБрокера.СуммаДокумента = Строчка.Расход;
				Если ВалютаДоговора = Строчка.ДоговорДУ.Валюта Тогда
					ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = Строчка.Расход;
				Иначе
					ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Строчка.Расход, ВалютаДоговора, Строчка.ДоговорДУ.Валюта, 1, ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов, 1, ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов);
				КонецЕсли;
				КонецЕсли;
				
			Иначе
				
				//Начало создания документа Начисление дивидентов  //IMAPPS-28903
				Если СтрНайти(Строчка.НазначениеПлатежа, "Дивиденд") > 0 ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Выплата дохода по акциям") > 0 Тогда
					ДокументНачислениеДивидентовСсылка = НайтиДокументНачислениеДивидентов(Строчка.ДоговорДУ, Акция, Строчка.Дата, Строчка.Приход);
				Иначе
					ДокументНачислениеДивидентовСсылка = НайтиДокументНачислениеДивидентов(Строчка.ДоговорДУ, Акция, Строчка.Дата, Строчка.Расход);
				КонецЕсли;
				
				Если ДокументНачислениеДивидентовСсылка = Неопределено Тогда
					ДокументНачислениеДивидентов = Документы.НачислениеДивидендов.СоздатьДокумент();
					ДокументНачислениеДивидентов.Дата = Строчка.Дата;
					ДокументНачислениеДивидентов.ДоговорДУ = Строчка.ДоговорДУ;
				Иначе
					ДокументНачислениеДивидентов = ДокументНачислениеДивидентовСсылка.ПолучитьОбъект();
				КонецЕсли;
				
				ДокументНачислениеДивидентов.КорпоративноеДействие = НайтиДокументКорпоративноеДействие(Строчка.Актив, Строчка.Дата);
				ДокументНачислениеДивидентов.ДатаПолученияОстатков = ?(ДокументНачислениеДивидентов.КорпоративноеДействие.Пустая(), Строчка.Дата, ДокументНачислениеДивидентов.КорпоративноеДействие.Дата);
				ДокументНачислениеДивидентов.Акция = Акция; 
				Если СтрНайти(Строчка.НазначениеПлатежа, "Дивиденд") > 0 ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Выплата дохода по акциям") > 0 Тогда   //IMAPPS-28903
					ДокументНачислениеДивидентов.СуммаДивидендовНаОднуАкцию = ПолучитьСуммуДивидентовНаОднуАкцию(Строчка.ДоговорДУ, Акция, Строчка.Приход, Строчка.Дата);
					ДокументНачислениеДивидентов.СуммаНачисления =  Строчка.Приход;
				Иначе
					ДокументНачислениеДивидентов.СуммаДивидендовНаОднуАкцию = ПолучитьСуммуДивидентовНаОднуАкцию(Строчка.ДоговорДУ, Акция, Строчка.Расход, Строчка.Дата);
					ДокументНачислениеДивидентов.СуммаНачисления =  Строчка.Расход;
				КонецЕсли; 
				
				ДокументНачислениеДивидентов.СчетУчетаРассчетовСКонтрагентом =  ПланыСчетов.Хозрасчетный.Дивиденды;
				//ДокументНачислениеДивидентов.ВариантУчетнойПолитики = ?(Строчка.ДоговорДУ.МножественныеУчетныеПолитики,Справочники.ВариантыУчетнойПолитики.Основной,Справочники.ВариантыУчетнойПолитики.ПустаяСсылка());
				ДокументНачислениеДивидентов.БУ = Истина;
				ДокументНачислениеДивидентов.НУ = Истина;
				//Валютные суммы
				//ВалютаРеглУчета = ОбщегоНазначенияДУ.ВалютаРеглУчета(ДокументНачислениеДивидентов.ВариантУчетнойПолитики);
				ВалютаРеглУчета = Строчка.ДоговорДУ.Валюта;
				ВалютаНоминала  = Акция.ВалютаНоминальнойСтоимости;
				ДокументНачислениеДивидентов.ВалютаНоминала = ВалютаНоминала;
				КурсКратностьВалютыРеглУчета   = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Строчка.ДоговорДУ.Валюта, ВалютаРеглУчета, Строчка.Дата);
				Если ВалютаНоминала <> ВалютаРеглУчета Тогда
					КурсКратностьВалютыНоминала    = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаНоминала, Строчка.Дата);
					ДокументНачислениеДивидентов.ВалютнаяСуммаНачисления = РаботаСКурсамиВалют.ПересчитатьИзВалютыВВалюту(ДокументНачислениеДивидентов.СуммаНачисления, ВалютаРеглУчета, ВалютаНоминала,
					КурсКратностьВалютыРеглУчета.Курс, КурсКратностьВалютыНоминала.Курс, 
					КурсКратностьВалютыРеглУчета.Кратность, КурсКратностьВалютыНоминала.Кратность);
					ДокументНачислениеДивидентов.КурсВзаиморасчетов = КурсКратностьВалютыНоминала.Курс;
					ДокументНачислениеДивидентов.КратностьВзаиморасчетов = КурсКратностьВалютыНоминала.Кратность;
				Иначе	
					ДокументНачислениеДивидентов.ВалютнаяСуммаНачисления = Строчка.Расход;
					ДокументНачислениеДивидентов.КурсВзаиморасчетов = КурсКратностьВалютыРеглУчета.Курс;
					ДокументНачислениеДивидентов.КратностьВзаиморасчетов = КурсКратностьВалютыРеглУчета.Кратность;
				КонецЕсли;
				
				ЗаписатьДокументПоСтроке(ДокументНачислениеДивидентов, СписокДоков, Строчка, НомСтр,Выводить,Важность);
				//Конец создания документа Начисление дивидентов
				
				ДокументОперацияПоСчетуБрокера.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Зачисление;
				ДокументОперацияПоСчетуБрокера.КоррСчет = ПланыСчетов.Хозрасчетный.РасчетыПоДивидендам;
				// IMAPPS-17933 ++
				//ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000010003");
				Если Строчка.Брокер = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("99904467-45e3-11e2-b4e9-005056b100ec")) Тогда 
					Если Строчка.ДоговорДУ.ТипКлиентаДУ = ТипВИ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - ВИ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПН_НПФ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - ПН НПФ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПР_НПФ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - ПР НПФ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = Тип_ПФР Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - ПФР");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипСС_НПФ Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - СС НПФ");
					ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипФФЦК Тогда 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - ФФЦК");
					Иначе 
						ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - ФЛ/ЮЛ");
					КонецЕсли;
				Иначе 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Дивиденды - ФЛ/ЮЛ");
				КонецЕсли;
				// IMAPPS-17933 --
				ДокументОперацияПоСчетуБрокера.СтатьяЗатрат = Справочники.СтатьиДоходовИРасходов.НачислениеДивидендов;
				ДокументОперацияПоСчетуБрокера.Корреспондент = Эмитент;
				//ДокументОперацияПоСчетуБрокера.СубконтоКоррСчета1 = Эмитент;
				ДокументОперацияПоСчетуБрокера.СубконтоКоррСчета2 = Акция; 
				Если СтрНайти(Строчка.НазначениеПлатежа, "Дивиденд") > 0 ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Выплата дохода по акциям") > 0 Тогда   //IMAPPS-28903
					ДокументОперацияПоСчетуБрокера.СуммаДокумента = Строчка.Приход;
					ДокументОперацияПоСчетуБрокера.СуммаКорреспондента = Строчка.Приход;
				Иначе
					ДокументОперацияПоСчетуБрокера.СуммаДокумента = Строчка.Расход;
					ДокументОперацияПоСчетуБрокера.СуммаКорреспондента = Строчка.Расход;
				КонецЕсли;
				
				ДокументОперацияПоСчетуБрокера.ДокументОснование = ДокументНачислениеДивидентов.Ссылка;
				Если ВалютаДоговора = Строчка.ДоговорДУ.Валюта Тогда
					Если СтрНайти(Строчка.НазначениеПлатежа, "Дивиденд") > 0 ИЛИ СтрНайти(Строчка.НазначениеПлатежа, "Выплата дохода по акциям") > 0 Тогда   //IMAPPS-28903
						ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = Строчка.Приход;
					Иначе
						ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = Строчка.Расход;
					КонецЕсли;
				Иначе
					ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Строчка.Расход, ВалютаДоговора, Строчка.ДоговорДУ.Валюта, 1, ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов, 1, ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов);
				КонецЕсли;
			КонецЕсли;
			
			// IMAPPS-23546 ++
		ИначеЕсли СтрНайти(Строчка.НазначениеПлатежа, "MICEX / Возврат выплат.Исполнение обязательств по передаче дохода Клиринговым центром") > 0 Тогда 
			
			ДокументОперацияПоСчетуБрокера.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Списание;
			ДокументОперацияПоСчетуБрокера.КоррСчет = ПланыСчетов.Хозрасчетный.ПрочиеВзаиморасчеты;
			ДокументОперацияПоСчетуБрокера.Корреспондент = Строчка.Актив.Эмитент;
			ДокументОперацияПоСчетуБрокера.СтатьяЗатратКорреспондента = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Начисление НКД"); 
			Если Строчка.Брокер = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("99904467-45e3-11e2-b4e9-005056b100ec")) Тогда 
				Если Строчка.ДоговорДУ.ТипКлиентаДУ = ТипВИ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ВИ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПН_НПФ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ПН НПФ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипПР_НПФ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ПР НПФ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = Тип_ПФР Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ПФР");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипСС_НПФ Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - СС НПФ");
				ИначеЕсли Строчка.ДоговорДУ.ТипКлиентаДУ = ТипФФЦК Тогда 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ФФЦК");
				Иначе 
					ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ФЛ/ЮЛ");
				КонецЕсли;
			Иначе 
				ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Расчеты по НКД - ФЛ/ЮЛ");
			КонецЕсли;
			
			ДокументОперацияПоСчетуБрокера.СтатьяЗатрат = Справочники.СтатьиДоходовИРасходов.НайтиПоНаименованию("Начисление НКД");
			//ДокументОперацияПоСчетуБрокера.СубконтоКоррСчета1 = Справочники.СтатьиДоходовИРасходов.КомиссияБрокера;
			
			ДокументОперацияПоСчетуБрокера.СуммаДокумента = Строчка.Приход;
			ДокументОперацияПоСчетуБрокера.СуммаКорреспондента = Строчка.Приход;
			Если ВалютаДоговора = Строчка.ДоговорДУ.Валюта Тогда
				ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = Строчка.Приход;
			Иначе
				ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Строчка.Расход, ВалютаДоговора, Строчка.ДоговорДУ.Валюта, 1, ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов, 1, ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов);
			КонецЕсли;
			
			// IMAPPS-23546 --
			
		ИначеЕсли СтрНайти(Врег(Строчка.НазначениеПлатежа), "ИСПОЛЬЗОВАНИЕ БРОКЕРОМ ДС КЛИЕНТА") > 0 Тогда
			
			ДокументОперацияПоСчетуБрокера.КоррСчет = ПланыСчетов.Хозрасчетный.ПрочиеВзаиморасчеты;
			ДокументОперацияПоСчетуБрокера.СтатьяЗатрат = Справочники.СтатьиДоходовИРасходов.ПустаяСсылка();//ПроцентыПоБанковскимСчетам;
			ДокументОперацияПоСчетуБрокера.Корреспондент = Строчка.Брокер;
			ДокументОперацияПоСчетуБрокера.ДоговорКорреспондента = Строчка.ДоговорБрокера;
			
			//	ДокНачислениеЗадолженности.Контрагент = Строчка.Брокер;
			//	ДокНачислениеЗадолженности.ДоговорКонтрагента = Строчка.ДоговорБрокера;
			Если СтрНайти(Врег(Строчка.НазначениеПлатежа), "(СПИСАНИЕ)") > 0 Тогда
				
				ДокументОперацияПоСчетуБрокера.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Списание;
				ДокументОперацияПоСчетуБрокера.СуммаДокумента = Строчка.Приход;
				ДокументОперацияПоСчетуБрокера.СуммаКорреспондента = Строчка.Приход;
				
				ДокументОперацияПоСчетуБрокера.Корреспондент = Строчка.Брокер;
				ДокументОперацияПоСчетуБрокера.ДоговорКорреспондента = Строчка.ДоговорБрокера;
				ДокументОперацияПоСчетуБрокера.ДокументРасчетовКорреспондента = Документы.ОперацияПоСчетуБрокера.ПустаяСсылка();
					
				ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = СтатьяДДС_ИспДС_Брокером_Списание;
				
			ИначеЕсли СтрНайти(Врег(Строчка.НазначениеПлатежа), "(ВОЗВРАТ)") > 0 Тогда
				
				ДокументОперацияПоСчетуБрокера.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Зачисление;
				ДокументОперацияПоСчетуБрокера.СуммаДокумента = Строчка.Расход;
				ДокументОперацияПоСчетуБрокера.СуммаКорреспондента = Строчка.Расход;
				
				ДокументОперацияПоСчетуБрокера.Корреспондент = Строчка.Брокер;
				ДокументОперацияПоСчетуБрокера.ДоговорКорреспондента = Строчка.ДоговорБрокера;
				ДокументОперацияПоСчетуБрокера.ДокументРасчетовКорреспондента = НайтиДокументОтправкиДСБрокеру(Строчка.ДоговорДУ, Строчка.Дата, Строчка.Расход);
					
				ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = СтатьяДДС_ИспДС_Брокером_Зачисление;
				
			ИначеЕсли СтрНайти(Врег(Строчка.НазначениеПлатежа), "(ВЫПЛАТА ПРОЦЕНТОВ)") > 0 Тогда 
				
				ДокументОперацияПоСчетуБрокера.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Зачисление;
				ДокументОперацияПоСчетуБрокера.СуммаДокумента = Строчка.Расход;
				ДокументОперацияПоСчетуБрокера.СуммаКорреспондента = Строчка.Расход;
				
				ДокументОперацияПоСчетуБрокера.КоррСчет = ПланыСчетов.Хозрасчетный.РасчетыПоБанковскимСчетам;
				ДокументОперацияПоСчетуБрокера.Корреспондент = Строчка.Брокер;
					
				ДокументОперацияПоСчетуБрокера.СтатьяДвиженияДенежныхСредств = СтатьяДДС_ИспДС_Брокером_Проценты;
				
				Если НЕ ВестиТолькоБухгалтерскийУчет Тогда
					ДокументОперацияПоСчетуБрокера.СубконтоКоррСчета2 = Строчка.АналитическийСчетДС.МестоХранения;
				КонецЕсли;
				//Начало создания документа Начисление дивидентов
				ДокументНачислениеПроцентовСсылка = НайтиДокументНачислениеПроцентовБС(Строчка.ДоговорДУ, Строчка.Дата, Строчка.Расход);
				
				Если ДокументНачислениеПроцентовСсылка = Неопределено Тогда
					ДокументНачислениеПроцентов = Документы.НачислениеПроцентовПоБанковскимСчетам.СоздатьДокумент();
					ДокументНачислениеПроцентов.Дата = Строчка.Дата;
					ДокументНачислениеПроцентов.ДоговорДУ = Строчка.ДоговорДУ;
				Иначе
					ДокументНачислениеПроцентов = ДокументНачислениеПроцентовСсылка.ПолучитьОбъект();
					ДокументНачислениеПроцентов.СписокНачислений.Очистить();
				КонецЕсли;
				
				ДокументНачислениеПроцентов.БУ = Истина;
				
				СтрокаДокумента = ДокументНачислениеПроцентов.СписокНачислений.Добавить();
				СтрокаДокумента.Контрагент = Строчка.Брокер;
				СтрокаДокумента.ДоговорКонтрагента = Строчка.ДоговорБрокера;
				
				СтрокаДокумента.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыПоБанковскимСчетам;
				СтрокаДокумента.КорСчет = ПланыСчетов.Хозрасчетный.ПроцентыНаОстатокДенежныхСредствНаРасчетныхСчетах;
				
				СтрокаДокумента.ВалютаВклада = Справочники.Валюты.RUB;
				СтрокаДокумента.Курс = 1;
				СтрокаДокумента.Кратность = 1;
				
				СтрокаДокумента.СуммаДоначисления = Строчка.Расход;
				СтрокаДокумента.ВалютаСуммаДоначисления = Строчка.Расход;
				
				Если ВестиТолькоБухгалтерскийУчет Тогда
					ДокументНачислениеПроцентов.УУ = Ложь;
					СтрокаДокумента.СуммаДоначисленияУУ = 0;
					СтрокаДокумента.ВалютаСуммаДоначисленияУУ = 0;
				Иначе
					ДокументНачислениеПроцентов.УУ = Истина;
					СтрокаДокумента.АналитическийСчет 	= Строчка.АналитическийСчетДС;
					СтрокаДокумента.БанковскийСчет 	= Строчка.АналитическийСчетДС.МестоХранения;
					СтрокаДокумента.СуммаДоначисленияУУ = Строчка.Расход;
					СтрокаДокумента.ВалютаСуммаДоначисленияУУ = Строчка.Расход;
				КонецЕсли;
				
				ЗаписатьДокументПоСтроке(ДокументНачислениеПроцентов, СписокДоков, Строчка, НомСтр,Выводить,Важность);
				//Конец создания документа Начисление дивидентов
				
				ДокументОперацияПоСчетуБрокера.ДокументОснование = ДокументНачислениеПроцентов.Ссылка;
			КонецЕсли;
			
			Если ВалютаДоговора = Строчка.ДоговорДУ.Валюта Тогда
				ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = ДокументОперацияПоСчетуБрокера.СуммаДокумента;
			Иначе
				ДокументОперацияПоСчетуБрокера.СуммаДокументаРуб = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ДокументОперацияПоСчетуБрокера.СуммаДокумента, ВалютаДоговора, Строчка.ДоговорДУ.Валюта, 1, ДокументОперацияПоСчетуБрокера.КурсВзаиморасчетов, 1, ДокументОперацияПоСчетуБрокера.КратностьВзаиморасчетов);
			КонецЕсли;
			
			Если ВестиТолькоБухгалтерскийУчет Тогда
				ДокументОперацияПоСчетуБрокера.УУ = Ложь;
				ДокументОперацияПоСчетуБрокера.ВУ = Ложь;
			Иначе
				ДокументОперацияПоСчетуБрокера.УУ = Истина;
				ДокументОперацияПоСчетуБрокера.ВУ = Истина;
				ДокументОперацияПоСчетуБрокера.АналитическийСчетБрокера 	= Строчка.АналитическийСчетДС;
				ДокументОперацияПоСчетуБрокера.ФизическоеМестоХраненияДС 	= Строчка.ФизическоеМестоХраненияДС;
			КонецЕсли;
			
		КонецЕсли;
		
		//ДокументОперацияПоСчетуБрокера.НомерВходящегоДокумента = Строчка.НомерСделки;
		//ДокументОперацияПоСчетуБрокера.БУ = Истина;
		//Если ВестиТолькоБухгалтерскийУчет Тогда
		//	ДокументОперацияПоСчетуБрокера.ВУ = Ложь;
		//	ДокументОперацияПоСчетуБрокера.УУ = Ложь;
		//Иначе
		//	ДокументОперацияПоСчетуБрокера.УУ = Истина;
		//	ДокументОперацияПоСчетуБрокера.ВУ = Истина;
		//КонецЕсли;
		//Варианты = МножественныеУчетныеПолитики.ДействующиеВариантыУчетныхПолитикДУ(ДокументОперацияПоСчетуБрокера.Дата, ДокументОперацияПоСчетуБрокера.ДоговорДУ);
		Если ВалютаПоСтроке <> Строчка.ДоговорДУ.Валюта 
			И НЕ ВалютаПоСтроке = Справочники.Валюты.ПустаяСсылка() Тогда 
			ДокументОперацияПоСчетуБрокера.ВалютаКорреспондента		= ВалютаПоСтроке;  
			ДокументОперацияПоСчетуБрокера.КурсКорреспондента      	= КурсКратность.Курс;
    		ДокументОперацияПоСчетуБрокера.КратностьКорреспондента 	= КурсКратность.Кратность; 
		Иначе
			ДокументОперацияПоСчетуБрокера.КурсКорреспондента = 1;
			ДокументОперацияПоСчетуБрокера.КратностьКорреспондента = 1;
			ДокументОперацияПоСчетуБрокера.ВалютаКорреспондента  = Справочники.Валюты.RUB;
		
		КонецЕсли;	
	
		
		
		//Для Каждого Вариант Из Варианты Цикл			
		//	НоваяСтрока = ДокументОперацияПоСчетуБрокера.ВариантыУчетныхПолитик.Добавить();
		//	НоваяСтрока.Вариант = Вариант;			
		//КонецЦикла;	
		
		ЗаписатьДокументПоСтроке(ДокументОперацияПоСчетуБрокера, СписокДоков, Строчка, НомСтр,Выводить,Важность);
		
	КонецЦикла;
	
	Счетчик = 0;
	
	//Проведение документов
	Для Каждого ЭлементСписка Из СписокДоков Цикл
		
		Док = ЭлементСписка.Значение;
		
		Счетчик = Счетчик + 1;	
		
		ДокОбъект = Док.ПолучитьОбъект();
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			//масСообщения.Добавить("Не удалось провести документ " + Док);
			ДобавитьСообщение("Проведение документов", "", "", "", "Не удалось провести документ " + Док, СтатусСообщения.Важное);
			Важность = 1;
		КонецПопытки;	
		
	КонецЦикла;
	
	//масСообщения.Добавить("Проведение документов завершено.");
	// IMAPPS-26041++
	// ДобавитьСообщение("Проведение документов", "", "", "", "Завершено.", СтатусСообщения.Информация);
	
	// Возвращаем результаты выполнения
	РезультатВыполнения.Важность = Важность;
	РезультатВыполнения.масСообщения = масСообщения;
	РезультатВыполнения.ТелоПисьма = ТелоПисьма;
	РезультатВыполнения.ВыполненоУспешно = Истина;
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, ПараметрыВыполнения.СервисныеПараметры.АдресХранилища);
	// IMAPPS-26041++
	
КонецПроцедуры // СоздатьОперацииСервер()

// IMAPPS-26041++

Функция КоличествоАктивныхЗаданий(МассивФоновыхЗаданий)
	
	КоличествоАктивных = 0;
	
	Для каждого ДанныеФоновогоЗадания Из МассивФоновыхЗаданий Цикл
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ДанныеФоновогоЗадания.УникальныйИдентификатор);
		Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			КоличествоАктивных = КоличествоАктивных + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КоличествоАктивных;
	
КонецФункции

Процедура ОжидатьЗавершенияАктивныхЗаданий(МассивФоновыхЗаданий, ЛимитФоновыхЗаданий)
	
	КоличествоАктивных = КоличествоАктивныхЗаданий(МассивФоновыхЗаданий);
	
	Пока КоличествоАктивных >= ЛимитФоновыхЗаданий И НЕ КоличествоАктивных = 0 Цикл
		
		Если НЕ ЭтоВызовСКлиента Тогда
			ВызватьПаузу(5000); // Платформенная реализация 8.3.25 без использования CPU
		Иначе
			// При вызове с клиента (из формы) ВызватьПаузу падает с ошибкой
			// вызываем колхоз
			ОбщегоНазначенияДУ.Задержка(5);
		КонецЕсли;
		КоличествоАктивных = КоличествоАктивныхЗаданий(МассивФоновыхЗаданий);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьОперацииПоБрокерскомуСчетуВПотоках(Важность,Выводить = Истина)
	
	Если НЕ ТаблицаДанных2.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	// IMDEV-8927 ++
	ВремяНачалаЗамераСозданиеОпераций = 0;
	КлючеваяОперацияСозданиеОпераций = "";
	КоличествоСтрокКОбработкеЗамера = ТаблицаДанных2.Количество();
	Если ЗначениеЗаполнено(ИдентификаторКомандыДляЗамера) Тогда
		КлючеваяОперацияСозданиеОпераций = ПолучитьИмяКлючевойОперацииЗамера("СозданиеОпераций");
		ВремяНачалаЗамераСозданиеОпераций = ОценкаПроизводительности.НачатьЗамерВремени();
	КонецЕсли;
	// IMDEV-8927 --
	
	ТаблицаДанных2.Сортировать("Дата Возр");
	
	КоличествоПотоков = 6;
	
	// Т.к. в алгоритме взятом из СоздатьОперацииПоБрокерскомуСчету есть проверка на дубли созданных документов
	// и при последовательном выполнении дубли выявляются в созданных документах
	// для поддержания этой логики необходимо потоки разделить так, чтобы "дубли" были в одном потоке
	// для этого достаточно, чтобы один ДоговорДУ был в одном потоке
	
	РаспределениеТаблицаДанных2 = Новый ТаблицаЗначений;
	РаспределениеТаблицаДанных2.Колонки.Добавить("ТаблицаДанных2");
	РаспределениеТаблицаДанных2.Колонки.Добавить("КоличествоСтрок", Новый ОписаниеТипов("Число"));
	
	Для Сч = 1 По КоличествоПотоков Цикл 
		СтрокаРаспределения = РаспределениеТаблицаДанных2.Добавить();
		СтрокаРаспределения.ТаблицаДанных2 = ТаблицаДанных2.ВыгрузитьКолонки();
	КонецЦикла;
	
	Отбор = Новый Структура("ДоговорДУ");
	Для каждого Строка Из ТаблицаДанных2 Цикл
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		
		НайденаСтрокаРаспределения = Ложь;
		Для каждого СтрокаРаспределения Из РаспределениеТаблицаДанных2 Цикл
			// Ищем ДоговорДУ в существующих записях
			НайденныеСтроки = СтрокаРаспределения.ТаблицаДанных2.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() Тогда
				НайденаСтрокаРаспределения = Истина;
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения.ТаблицаДанных2.Добавить(), Строка);
				СтрокаРаспределения.КоличествоСтрок = СтрокаРаспределения.ТаблицаДанных2.Количество();
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ НайденаСтрокаРаспределения Тогда
			// Выше не нашли ДоговорДУ, добавим его в самую маленькую таблицу
			РаспределениеТаблицаДанных2.Сортировать("КоличествоСтрок");
			СтрокаРаспределения = РаспределениеТаблицаДанных2.Получить(0);
			ЗаполнитьЗначенияСвойств(СтрокаРаспределения.ТаблицаДанных2.Добавить(), Строка);
			СтрокаРаспределения.КоличествоСтрок = СтрокаРаспределения.ТаблицаДанных2.Количество();
		КонецЕсли;
	КонецЦикла;
	
	
	// Передаем собранные потоки в Фоновое задание этой обработки
	МассивФоновыхЗаданий = Новый Массив;
	Для каждого СтрокаРаспределения Из РаспределениеТаблицаДанных2 Цикл
		
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, );
		ТаблицаДанных2Хран = Новый ХранилищеЗначения(СтрокаРаспределения.ТаблицаДанных2);

		ПараметрыВыполненияОбработки = Новый Структура;
		ПараметрыВыполненияОбработки.Вставить("ДополнительнаяОбработкаСсылка",ДополнительнаяОбработкаСсылка);
		ПараметрыВыполненияОбработки.Вставить("ТаблицаДанных2Хран", ТаблицаДанных2Хран);
		ПараметрыВыполненияОбработки.Вставить("Выводить", Выводить);
		ПараметрыВыполненияОбработки.Вставить("АдресХранилища", АдресХранилища);
		
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(ДополнительнаяОбработкаСсылка);
		МассивПараметров.Добавить("КомандаСоздатьОперацииПоБрокерскомуСчетуПоток");
		МассивПараметров.Добавить(ПараметрыВыполненияОбработки);
		
		ФонЗадание = ФоновыеЗадания.Выполнить("ДополнительныеОтчетыИОбработки.ВыполнитьКомандуОбработкиПоПараметрам", МассивПараметров);
		
		ДанныеФоновогоЗадания = Новый Структура;
		ДанныеФоновогоЗадания.Вставить("УникальныйИдентификатор", ФонЗадание.УникальныйИдентификатор);
		ДанныеФоновогоЗадания.Вставить("АдресХранилища", АдресХранилища);
		
		МассивФоновыхЗаданий.Добавить(ДанныеФоновогоЗадания);
		
		ОжидатьЗавершенияАктивныхЗаданий(МассивФоновыхЗаданий, КоличествоПотоков);
		
	КонецЦикла;
	
	// Ожидаем завершения всех фоновых
	ОжидатьЗавершенияАктивныхЗаданий(МассивФоновыхЗаданий, 0);
	
	// Получим результаты работы фоновых
	Для каждого ДанныеФоновогоЗадания Из МассивФоновыхЗаданий Цикл
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ДанныеФоновогоЗадания.УникальныйИдентификатор);
		Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			ДанныеВыполнения = ПолучитьИзВременногоХранилища(ДанныеФоновогоЗадания.АдресХранилища);
			Важность = Макс(Важность, ДанныеВыполнения.Важность);
			
			Для Каждого Сообщение Из ДанныеВыполнения.масСообщения Цикл
				масСообщения.Добавить(Сообщение);
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ДанныеВыполнения.ТелоПисьма) Тогда
				ТелоПисьма = ТелоПисьма + ДанныеВыполнения.ТелоПисьма;
			КонецЕсли;
			
		Иначе
			Важность = 2;
			Если ТипЗнч(ФоновоеЗадание.ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке") Тогда
				Инфо = ФоновоеЗадание.ИнформацияОбОшибке;
				ДобавитьСообщение("", Инфо.ИмяМодуля, Инфо.НомерСтроки,  Инфо.ИсходнаяСтрока, Инфо.Описание, СтатусСообщения.ОченьВажное);
			Иначе
				ДобавитьСообщение("", "", "",  "", "Фоновое задание потока не было корректно завершено! Данные об ошибке отсутствуют.", СтатусСообщения.ОченьВажное);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДобавитьСообщение("Проведение документов", "", "", "", "Завершено.", СтатусСообщения.Информация);
	
	// IMDEV-8927 ++
	Если ВремяНачалаЗамераСозданиеОпераций > 0 Тогда
		ВесЗамераСозданиеОпераций = ?(КоличествоСтрокКОбработкеЗамера > 0, КоличествоСтрокКОбработкеЗамера, 1);
		ОтказЗамераСозданиеОпераций = (Важность >= 2);
		КомментарийЗамераСозданиеОпераций = "СтрокКОбработке=" + КоличествоСтрокКОбработкеЗамера
			+ "; Потоков=" + КоличествоПотоков
			+ "; ФоновыхЗаданий=" + МассивФоновыхЗаданий.Количество()
			+ "; Важность=" + Важность
			+ "; Отказ=" + ?(ОтказЗамераСозданиеОпераций, "Да", "Нет")
			+ ДополнениеКомментарияУдельныйВес(ВесЗамераСозданиеОпераций, ВремяНачалаЗамераСозданиеОпераций);
		ОценкаПроизводительности.ЗакончитьЗамерВремени(
			КлючеваяОперацияСозданиеОпераций,
			ВремяНачалаЗамераСозданиеОпераций,
			ВесЗамераСозданиеОпераций,
			КомментарийЗамераСозданиеОпераций,
			ОтказЗамераСозданиеОпераций);
	КонецЕсли;
	// IMDEV-8927 --
	
КонецПроцедуры
// IMAPPS-26041--

// MPazhukov IMAPPS-11737
//Процедура СоздатьПереводыПоБрокерскомуСчету()
Процедура СоздатьПереводыПоБрокерскомуСчету(БрокерУИД="")	//IMAPPS-18376
	
	Если ТаблицаДанных5.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Перевод с/на брокерский счет - ФЛ/ЮЛ");
	
	// IMAPPS-17933 ++
	// Типы клиентов
	ТипВИ		 = Перечисления.ТипыКлиентовДУ.ВоеннаяИпотека;
	ТипПН_НПФ    = Перечисления.ТипыКлиентовДУ.ПенсионныеНакопленияГражданПереданныеЧерезНПФ;
	ТипПР_НПФ    = Перечисления.ТипыКлиентовДУ.ПенсионныеРезервыНПФ;
	Тип_ПФР    	 = Перечисления.ТипыКлиентовДУ.ПенсионныеНакопленияГражданПереданныеПФР;
	ТипСС_НПФ    = Перечисления.ТипыКлиентовДУ.СобственныеСредстваНПФ;
	ТипФФЦК	     = Перечисления.ТипыКлиентовДУ.ФондЦелевогоКапитала;
	// IMAPPS-17933 --
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОперацияПоСчетуБрокера.Ссылка,
	               |	ОперацияПоСчетуБрокера.ДоговорДУ,
	               |	НАЧАЛОПЕРИОДА(ОперацияПоСчетуБрокера.Дата, ДЕНЬ) КАК Дата,
	               |	ОперацияПоСчетуБрокера.СуммаДокумента,
	               |	ОперацияПоСчетуБрокера.АналитическийСчетБрокера,
	               |	ОперацияПоСчетуБрокера.АналитическийСчетКорреспондента
	               |ИЗ
	               |	Документ.ОперацияПоСчетуБрокера КАК ОперацияПоСчетуБрокера
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ОперацияПоСчетуБрокера.Дата, ДЕНЬ) В (&Дата)
	               |	И ОперацияПоСчетуБрокера.ДоговорДУ В(&ДоговорДУ)
	               |	И ОперацияПоСчетуБрокера.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоСчетуБрокера.Перевод)
	               |	И ОперацияПоСчетуБрокера.Комментарий ПОДОБНО &Комментарий
	               |	И НЕ ОперацияПоСчетуБрокера.ПометкаУдаления";
	Запрос.УстановитьПараметр("Дата", ТаблицаДанных5.ВыгрузитьКолонку("Дата"));
	Запрос.УстановитьПараметр("ДоговорДУ", ТаблицаДанных5.ВыгрузитьКолонку("ДоговорДУ"));
	Запрос.УстановитьПараметр("Комментарий", "#Создано обработкой%");
	
	ДокументыВБазе = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка ИЗ ТаблицаДанных5 Цикл
		//// IMAPPS-17933 ++
		//IMAPPS-18376 ++
		//Если Строка.Брокер = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("99904467-45e3-11e2-b4e9-005056b100ec")) Тогда 
		Если БрокерУИД = "99904467-45e3-11e2-b4e9-005056b100ec" Тогда
		//IMAPPS-18376 --
		Если Строка.ДоговорДУ.ТипКлиентаДУ = ТипВИ Тогда 
				СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Перевод с/на брокерский счет - ВИ");
			ИначеЕсли Строка.ДоговорДУ.ТипКлиентаДУ = ТипПН_НПФ Тогда 
				СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Перевод с/на брокерский счет - ПН НПФ");
			ИначеЕсли Строка.ДоговорДУ.ТипКлиентаДУ = ТипПР_НПФ Тогда 
				СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Перевод с/на брокерский счет - ПР НПФ");
			ИначеЕсли Строка.ДоговорДУ.ТипКлиентаДУ = Тип_ПФР Тогда 
				СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Перевод с/на брокерский счет - ПФР");
			ИначеЕсли Строка.ДоговорДУ.ТипКлиентаДУ = ТипСС_НПФ Тогда 
				СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Перевод с/на брокерский счет - СС НПФ");
			ИначеЕсли Строка.ДоговорДУ.ТипКлиентаДУ = ТипФФЦК Тогда 
				СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Перевод с/на брокерский счет - ФФЦК");
			Иначе 
				СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Перевод с/на брокерский счет - ФЛ/ЮЛ");
			КонецЕсли;
		Иначе 
			СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Перевод с/на брокерский счет - ФЛ/ЮЛ");
		КонецЕсли;
		//// IMAPPS-17933 --

		Отбор = Новый Структура;
		Отбор.Вставить("Дата", Строка.Дата);
		Отбор.Вставить("ДоговорДУ", Строка.ДоговорДУ);
		Отбор.Вставить("СуммаДокумента", Строка.Сумма);
		// IMAPPS-30183++
		// Перепутано местами Приход/Расход, по коду ниже документ заполняется в другой порядке
		// Отбор.Вставить("АналитическийСчетБрокера", Строка.ТорговыйКодПриход.АналитическийСчетДС);//Отбор.Вставить("АналитическийСчетБрокера", Строка.ТорговыйКодРасход.АналитическийСчетДС);
		// Отбор.Вставить("АналитическийСчетКорреспондента", Строка.ТорговыйКодРасход.АналитическийСчетДС);//Отбор.Вставить("АналитическийСчетКорреспондента", Строка.ТорговыйКодПриход.АналитическийСчетДС);
		
		Отбор.Вставить("АналитическийСчетБрокера", Строка.ТорговыйКодРасход.АналитическийСчетДС);
		Отбор.Вставить("АналитическийСчетКорреспондента", Строка.ТорговыйКодПриход.АналитическийСчетДС);
		// IMAPPS-30183--
		
		МассивДок = ДокументыВБазе.НайтиСтроки(Отбор);
		Если МассивДок.Количество() Тогда
			ОперацияДок = МассивДок[0].Ссылка.ПолучитьОбъект();	
		Иначе
			ОперацияДок = Документы.ОперацияПоСчетуБрокера.СоздатьДокумент();
		КонецЕсли;
		
		ОперацияДок.Дата = Строка.Дата + 9 * 3600;
		ОперацияДок.ВидОперации = Перечисления.ВидыОперацийПоСчетуБрокера.Перевод;
		ОперацияДок.ДоговорДУ = Строка.ДоговорДУ;
		
		ОперацияДок.АналитическийСчетБрокера = Строка.ТорговыйКодРасход.АналитическийСчетДС;
		ОперацияДок.ДоговорКонтрагента = Строка.ТорговыйКодРасход.ДоговорБрокера;
		ОперацияДок.Контрагент = Строка.ТорговыйКодРасход.Брокер;
		ОперацияДок.СтрокаРазмешенияБрокерскогоСчета = "ОРЦБ";
		ОперацияДок.СуммаДокумента = Строка.Сумма;
		ОперацияДок.СтатьяДвиженияДенежныхСредств = СтатьяДДС;
		ОперацияДок.ВалютаДокумента = Строка.ТорговыйКодРасход.АналитическийСчетДС.МестоХранения.ВалютаДенежныхСредств;
		Если ОперацияДок.ВалютаДокумента = Справочники.Валюты.RUB Тогда
			ОперацияДок.СуммаДокументаРуб = Строка.Сумма;
		Иначе
			КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Справочники.Валюты.RUB,ОперацияДок.ВалютаДокумента, Строка.Дата);
			// IMAPPS-24664 ++
			//ОперацияДок.СуммаДокументаРуб = Строка.Сумма / КурсВалюты.Курс;
			ОперацияДок.СуммаДокументаРуб = Строка.Сумма * КурсВалюты.Курс;
			// IMAPPS-24664 --
		КонецЕсли;		
		
		// IMAPPS-24664 ++
		КурсКратность = МодульВалютногоУчета.ПолучитьКурсВалюты(Справочники.Валюты.RUB, ОперацияДок.ВалютаДокумента, Строка.Дата);
		ОперацияДок.КурсВзаиморасчетов 			= КурсКратность.Курс;
		ОперацияДок.КратностьВзаиморасчетов 	= КурсКратность.Кратность;
			
		ОперацияДок.КурсКорреспондента 			= КурсКратность.Курс;
		ОперацияДок.КратностьКорреспондента 	= КурсКратность.Кратность;
		// IMAPPS-24664 --
		
		ОперацияДок.АналитическийСчетКорреспондента = Строка.ТорговыйКодПриход.АналитическийСчетДС;
		ОперацияДок.ДоговорКорреспондента = Строка.ТорговыйКодПриход.ДоговорБрокера;
		ОперацияДок.Корреспондент = Строка.ТорговыйКодПриход.Брокер;
		ОперацияДок.СтрокаРазмешенияКорБрокерскогоСчета = "ОРЦБ";
		ОперацияДок.СуммаКорреспондента = Строка.Сумма;
		ОперацияДок.СтатьяДвиженияДенежныхСредствКорреспондента = СтатьяДДС;
		ОперацияДок.ВалютаКорреспондента = Строка.ТорговыйКодПриход.АналитическийСчетДС.МестоХранения.ВалютаДенежныхСредств;
		
		ОперацияДок.БУ = Истина;
		ОперацияДок.ВУ = Истина;
		ОперацияДок.УУ = Истина;
		
		ОперацияДок.Комментарий = "#Создано обработкой " + Строка(ТекущаяДата());
		
		Попытка
			
			ОперацияДок.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Проведен документ " + Строка(ОперацияДок.Ссылка));
			
		Исключение
			
			Описание = ОписаниеОшибки();
			
			ОперацияДок.Записать(РежимЗаписиДокумента.Запись);
			Сообщить("Ошибка при проведение документа " + Строка(ОперацияДок.Ссылка) + "! Документ будет сохранен!");
			Сообщить(Описание);
			
		КонецПопытки;;	
		
	КонецЦикла;
	
КонецПроцедуры	
// MPazhukov IMAPPS-11737

Функция КлирингОткрытыхПозиций(СтруктураДокумента)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлирингОткрытыхПозиций.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КлирингОткрытыхПозиций КАК КлирингОткрытыхПозиций
		|ГДЕ
		|	КлирингОткрытыхПозиций.ДоговорДУ = &ДоговорДУ
		|	И НАЧАЛОПЕРИОДА(КлирингОткрытыхПозиций.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
		|	И НЕ КлирингОткрытыхПозиций.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата", СтруктураДокумента.ДатаДок);
	Запрос.УстановитьПараметр("ДоговорДУ", СтруктураДокумента.ДоговорДУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Иначе
		НовыйДокумент = Документы.КлирингОткрытыхПозиций.СоздатьДокумент();
		НовыйДокумент.Дата = НачалоДня(СтруктураДокумента.ДатаДок) + 72000; // 18:00;
		
		НовыйДокумент.БУ = Истина;
		НовыйДокумент.ВУ = Истина;
		НовыйДокумент.УУ = Истина;
		
		НовыйДокумент.ДоговорДУ = СтруктураДокумента.ДоговорДУ;
		
		Возврат НовыйДокумент;
		
	КонецЕсли;

КонецФункции
// MPazhukov IMAPPS-11737

Функция ДатаДокументаИзТаблицы(ТорговыйКодФайл)

	СтрокаДатыПоТорговымКодам = ДатыПоТорговымКодам.Найти(ТорговыйКодФайл, "ТорговыйКодФайл");
	
	Если СтрокаДатыПоТорговымКодам<>Неопределено Тогда
		Возврат СтрокаДатыПоТорговымКодам.ДатаДокумента;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции // ДатаДокументаИзТаблицы(СтрокаДоговорДУ.ТорговыйКодФайл)()

Процедура КлирингОткрытыхПозицийСоздатьДокумент() Экспорт

	Если ТаблицаДанных10.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТЗДоговорДУ = ТаблицаДанных10.Выгрузить();
	ТЗДоговорДУ.Свернуть("ДоговорДУ, ДоговорКонтрагента, АналитическийСчетДС, TransDate, ТорговыйКодФайл, GO",);

	Для каждого СтрокаДоговорДУ Из ТЗДоговорДУ Цикл
		
		ДатаДокумента = ДатаДокументаИзТаблицы(СтрокаДоговорДУ.ТорговыйКодФайл);//СтрокаДоговорДУ.TransDate;
		
		СтруктураДокумента = Новый Структура("ДоговорДУ, ДатаДок", СтрокаДоговорДУ.ДоговорДУ, ДатаДокумента);
		
		НовыйДокумент = КлирингОткрытыхПозиций(СтруктураДокумента);//Документы.КлирингОткрытыхПозиций.СоздатьДокумент();
		

		ГарОбеспеч = СтрокаДоговорДУ.GO;
		
		АналитическийСчетДС = СтрокаДоговорДУ.АналитическийСчетДС;
		
		СтрутураОтбор = Новый Структура("ДоговорДУ, TransDate", СтрокаДоговорДУ.ДоговорДУ, СтрокаДоговорДУ.TransDate);
		СтрокиТаблицаДанных10 = ТаблицаДанных10.НайтиСтроки(СтрутураОтбор);
		
		Для Каждого СтрокаТаблицы Из СтрокиТаблицаДанных10 ЦИкл
			
			НовыйКонтракт = НовыйДокумент.Контракты.Добавить();
			НовыйКонтракт.ВариационнаяМаржа = СтрокаТаблицы.VariationMargin;
			НовыйКонтракт.ВидОбращаемости = Перечисления.ВидыОбращаемостиЦБ.ОбращающиесяФинансовыеИнструментыСрочныхСделокСБазиснымАктивомНеЦБ;
			НовыйКонтракт.Контракт = СтрокаТаблицы.Актив;
			
		КонецЦикла;
		
		//НовыйДокумент.Дата = НачалоДня(ДатаДокумента) + 72000; // 18:00;
		//НовыйДокумент.Дата = НачалоДня(ДатаДокумента) + 72000; // 18:00;
		
		НовыйДокумент.АналитическийСчетДС = АналитическийСчетДС;
		НовыйДокумент.Контрагент = Брокер;
		НовыйДокумент.ДоговорКонтрагента = СтрокаДоговорДУ.ДоговорКонтрагента;
		//НовыйДокумент.ДоговорДУ = СтрокаДоговорДУ.ДоговорДУ;
		
		НовыйДокумент.КурсВзаиморасчетов = 1;
		НовыйДокумент.КратностьВзаиморасчетов = 1;
		
		НовыйДокумент.СтатьяДвиженияДенежныхСредствВМ 	= Справочники.СтатьиДвиженияДенежныхСредств.ВариационнаяМаржа;
		НовыйДокумент.СтатьяДоходовИРасходовВМ 			= Справочники.СтатьиДоходовИРасходов.ВариационнаяМаржа;
		НовыйДокумент.СтатьяДвиженияДенежныхСредствГО 	= Справочники.СтатьиДвиженияДенежныхСредств.ГарантийноеОбеспечение;
		НовыйДокумент.ГарантированноеОбеспечение = ГарОбеспеч;
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			ОперацияАванкор = НовыйДокумент.Ссылка;
		Исключение
			НовыйДокумент.Записать();
			ОперацияАванкор = НовыйДокумент.Ссылка;
			ВызватьИсключение "Не удалось провести документ: " + ОписаниеОшибки();
		КонецПопытки;
		
		Для Каждого СтрокаТаблицы Из СтрокиТаблицаДанных10 ЦИкл
			СтрокаТаблицы.КлирингОткрытыхПозиций = НовыйДокумент.Ссылка;
		КонецЦикла;
		
		Сообщить(СтрШаблон("Документ %1 создан", ОперацияАванкор));
	
	КонецЦикла;
		
		
КонецПроцедуры


Процедура ЗаписатьДокументПоСтроке(обДок, СписДок, СтрокаТаблицы, НомСтр, Выводить = Истина,Важность = 0)

	х = новый Массив;
	х.Добавить(НомСтр); // №
	х.Добавить(СтрокаТаблицы.ТорговыйКод); //Торговый код
	х.Добавить(Формат(СтрокаТаблицы.Дата, "ДФ=dd.MM.yyyy")); // Дата
	х.Добавить(СтрокаТаблицы.ДоговорДУ); //Договор ДУ
	х.Добавить(СтрокаТаблицы.Брокер); //Брокер
	х.Добавить(СтрокаТаблицы.ДоговорБрокера); // Договор
	х.Добавить(СтрокаТаблицы.НазначениеПлатежа); //Назначение платежа
	х.Добавить(СтрокаТаблицы.Приход); //приход
	х.Добавить(СтрокаТаблицы.Расход); //расход
	Попытка
		обДок.Записать();
		Если СписДок.НайтиПоЗначению(обДок.Ссылка) = Неопределено Тогда
			СписДок.Добавить(обДок.Ссылка);	
		КонецЕсли;
	Исключение
		//масСообщения.Добавить("Не удалось записать данные строки №" + НомСтр + " в таблице ""Операции по счету брокера""");
		ДобавитьСообщение(СтрокаТаблицы.ИмяФайла, НомСтр, СтрокаТаблицы.ТорговыйКод, СтрокаТаблицы.ДоговорДУ, "Не удалось записать данные строки", СтатусСообщения.Важное); 
		Инфо = ИнформацияОбОшибке();
		х.Добавить("Ошибка записи документа: " + Инфо.Описание);// обДок.Метаданные().Синоним);
		Важность = 1;//Регистратор   
		РассылкаСообщения_СтрокаТаблицы(х);
    КонецПопытки;
	
		
КонецПроцедуры

Функция ПолучитьТаблицуОперацийПоСчетуБрокера(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОперацияПоСчетуБрокера.Ссылка,
	|	ОперацияПоСчетуБрокера.ДоговорДУ,
	|	ОперацияПоСчетуБрокера.Контрагент,
	|	ОперацияПоСчетуБрокера.СуммаДокумента,
	|	ОперацияПоСчетуБрокера.АналитическийСчетБрокера,
	|	ОперацияПоСчетуБрокера.ДоговорКонтрагента
	|ИЗ
	|	Документ.ОперацияПоСчетуБрокера КАК ОперацияПоСчетуБрокера
	|ГДЕ
	|	ОперацияПоСчетуБрокера.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ОперацияПоСчетуБрокера.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьДебиторкуПоПогашениюОблигации(ДоговорДУ, Облигация, Эмитент, СуммаОстатокДт, ДатаОтчета, Валюта = Неопределено)
	// IMAPPS-28903 ++
	Если Валюта = Неопределено Тогда
		Валюта = Справочники.Валюты.RUB
	КонецЕсли;
	// IMAPPS-28903 --
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто2 КАК Облигация,
	|	ХозрасчетныйОстатки.СуммаОстатокДт КАК СуммаОстатокДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ДатаОтчета,
	// IMAPPS-28406 ++
	//|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям_ПогашениеТела),
	|			Счет в иерархии (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациямГруппа)),
	// IMAPPS-28406 --
	|			,
	// IMAPPS-28903 ++
	|			Валюта = &Валюта 
	// IMAPPS-28903 --
	|				И ДоговорДУ = &ДоговорДУ
	|				И Субконто1 = &Эмитент
	|				И Субконто2 = &Облигация) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.СуммаОстатокДт >= &СуммаОстатокДт";
	
	Запрос.УстановитьПараметр("ДатаОтчета", КонецДня(ДатаОтчета)+1);
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	Запрос.УстановитьПараметр("Облигация", Облигация);
	Запрос.УстановитьПараметр("СуммаОстатокДт", СуммаОстатокДт);
	Запрос.УстановитьПараметр("Эмитент", Эмитент);
	// IMAPPS-28903 ++
	Запрос.УстановитьПараметр("Валюта", Валюта);
	// IMAPPS-28903 --
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе	
		Возврат Истина;
	КонецЕсли;
	
КонецФункции // ПолучитьДебиторкуПоЧастичномуПогашениюОблигации()

Функция ПолучитьДебиторкуПоПогашениюКупона(ДоговорДУ, Облигация, СуммаОстатокДт, ДатаОтчета,Валюта = Неопределено)
	Если Валюта = Неопределено Тогда
		Валюта = Справочники.Валюты.RUB
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто2 КАК Облигация,
	|	ХозрасчетныйОстатки.СуммаОстатокДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ДатаОтчета,
	|			Счет В ИЕРАРХИИ(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям)),
	|			,
	|			Валюта = &Валюта
	|				И ДоговорДУ = &ДоговорДУ
	|				И Субконто2 = &Облигация) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.СуммаОстатокДт >= &СуммаОстатокДт";
	
	Запрос.УстановитьПараметр("ДатаОтчета", КонецДня(ДатаОтчета)+1);
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	Запрос.УстановитьПараметр("Облигация", Облигация);
	Запрос.УстановитьПараметр("СуммаОстатокДт", СуммаОстатокДт);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе	
		Возврат Истина;
	КонецЕсли;
	
КонецФункции // ПолучитьДебиторкуПоЧастичномуПогашениюОблигации()

Функция ПолучитьДокНачислениеЗадолженностиПоКомиссиям(ДоговорДУ, Брокер, ДоговорБрокера, Сумма, Дата, НомерВходяшегоДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеЗадолженности.Ссылка
	|ИЗ
	|	Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
	|ГДЕ
	|	НачислениеЗадолженности.ДоговорДУ = &ДоговорДУ
	|	И НачислениеЗадолженности.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И НЕ НачислениеЗадолженности.ПометкаУдаления
	|	И НачислениеЗадолженности.Контрагент = &Контрагент
	|	И НачислениеЗадолженности.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И НачислениеЗадолженности.СуммаДокумента = &СуммаДокумента
	|	И НачислениеЗадолженности.НомерВходящегоДокумента = &НомерВходящегоДокумента";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата)+1);    
	Запрос.УстановитьПараметр("Контрагент", Брокер);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорБрокера);
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	Запрос.УстановитьПараметр("НомерВходящегоДокумента", НомерВходяшегоДокумента);
	Запрос.УстановитьПараметр("СуммаДокумента", Сумма);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	
КонецФункции // ПолучитьДебиторкуПоЧастичномуПогашениюОблигации()

Функция НайтиДокументНачислениеДивидентов(ДоговорДУ, Акция, Дата, СуммаНачисления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеДивидендов.Ссылка
	|ИЗ
	|	Документ.НачислениеДивидендов КАК НачислениеДивидендов
	|ГДЕ
	|	НачислениеДивидендов.ДоговорДУ = &ДоговорДУ
	|	И НачислениеДивидендов.Акция = &Акция
	|	И НачислениеДивидендов.СуммаНачисления >= &СуммаНачисления
	|	И НачислениеДивидендов.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И НЕ НачислениеДивидендов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата", Дата);    
	Запрос.УстановитьПараметр("Акция", Акция);
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	Запрос.УстановитьПараметр("СуммаНачисления", СуммаНачисления);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // НайтиДокументНачислениеДокументов()

Функция НайтиДокументНачислениеНКД(ДоговорДУ, Облигация, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ //ПЕРВЫЕ 1     //IMAPPS-24092
	|	ПереводНКДВЗадолженностьЭмитента.Ссылка КАК Ссылка,
	|	ПереводНКДВЗадолженностьЭмитента.Дата КАК Дата
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	Документ.ПереводНКДВЗадолженностьЭмитента КАК ПереводНКДВЗадолженностьЭмитента
	|ГДЕ
	|	ПереводНКДВЗадолженностьЭмитента.ДоговорДУ = &ДоговорДУ
	|	И НЕ ПереводНКДВЗадолженностьЭмитента.ПометкаУдаления
	|	И ПереводНКДВЗадолженностьЭмитента.Облигации.Облигация = &Облигация
	|	И ПереводНКДВЗадолженностьЭмитента.Дата <= &Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПереводНКДВЗадолженностьЭмитента.Ссылка,
	|	ПереводНКДВЗадолженностьЭмитента.Дата
	|ИЗ
	|	Документ.ПереводНКДВЗадолженностьЭмитента КАК ПереводНКДВЗадолженностьЭмитента
	|ГДЕ
	|	ПереводНКДВЗадолженностьЭмитента.ДоговорДУ = &ДоговорДУ
	|	И НЕ ПереводНКДВЗадолженностьЭмитента.ПометкаУдаления
	|	И ПереводНКДВЗадолженностьЭмитента.ОблигацииПоСделкамРЕПО.Облигация = &Облигация
	|	И ПереводНКДВЗадолженностьЭмитента.Дата <= &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Данные.Ссылка КАК Ссылка
	|ИЗ
	|	Данные КАК Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	Данные.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Облигация", Облигация);
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Сообщить ("Погашения НКД по " + Облигация + " не найдены" );
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции 

Функция НайтиПогашениеОблигаций(ДоговорДУ, Облигация, Дата, Сумма)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.Регистратор.Ссылка КАК РегистраторСсылка,
	|	ХозрасчетныйОборотыДтКт.ВалютнаяСуммаОборотДт КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			,
	|			&Дата,
	|			Регистратор,
	// IMAPPS-28406 ++
	//|			СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям_ПогашениеТела),
	|			СчетДт в иерархии (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациямГруппа)),
	// IMAPPS-28406 --
	|			,
	|			СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Выручка),
	|			,
	|			ДоговорДУ = &ДоговорДУ
	|				И СубконтоДт2 = &Облигация) КАК ХозрасчетныйОборотыДтКт
	|
	|УПОРЯДОЧИТЬ ПО
	|	ХозрасчетныйОборотыДтКт.Регистратор.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Облигация", Облигация);
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));	
	Результат = Запрос.Выполнить();
	
	Табзнач = Результат.Выгрузить();
	
	Для каждого Текстрока из Табзнач Цикл
		
	Если Текстрока.Сумма = Сумма Тогда
		
		Возврат Текстрока.РегистраторСсылка;
	Иначе
		Сообщить ("Погашения по " + Облигация + " не найдены" );
		Возврат Неопределено;
		
	КонецЕсли;
	КонецЦикла;
КонецФункции 	

Функция НайтиДокументНачислениеПроцентовБС(ДоговорДУ, Дата, СуммаНачисления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Ссылка
	|ИЗ
	|	Документ.НачислениеПроцентовПоБанковскимСчетам.СписокНачислений КАК т
	|ГДЕ
	|	т.Ссылка.ДоговорДУ = &ДоговорДУ
	|	И т.СуммаДоначисления = &СуммаНачисления
	|	И т.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И НЕ т.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата", Дата);    
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	Запрос.УстановитьПараметр("СуммаНачисления", СуммаНачисления);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // НайтиДокументНачислениеДокументов()

Функция НайтиДокументОтправкиДСБрокеру(ДоговорДУ, Дата, СуммаДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Ссылка
	|ИЗ
	|	Документ.ОперацияПоСчетуБрокера КАК т
	|ГДЕ
	|	т.ДоговорДУ = &ДоговорДУ
	|	И т.СуммаДокумента = &СуммаДокумента
	|	И т.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И НЕ т.ПометкаУдаления
	|	И т.НаименованиеОперации ПОДОБНО ""Использование брокером ДС клиента%""
	|	И т.НаименованиеОперации ПОДОБНО ""%(списание)%""
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Дата - 10*24*3600));    
	Запрос.УстановитьПараметр("ДатаКон", Дата);
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	Запрос.УстановитьПараметр("СуммаДокумента", СуммаДокумента);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // НайтиДокументНачислениеДокументов()

Функция НайтиДокументКорпоративноеДействие(ссАктив, ДатаНачисления)
	
	сс = Документы.КорпоративноеДействие.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Ссылка
	|ИЗ
	|	Документ.КорпоративноеДействие КАК т
	|ГДЕ
	|	т.Дата >= &Дата
	|	И т.Проведен
	|	И т.Актив = &Актив
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Дата УБЫВ";
	Запрос.УстановитьПараметр("Дата", ДобавитьМесяц(ДатаНачисления, -3));
	Запрос.УстановитьПараметр("Актив", ссАктив);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		сс = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат сс;
КонецФункции 

Функция ПолучитьСуммуДивидентовНаОднуАкцию(ДоговорДУ, Акция, СуммаНачисления, ДатаПолученияОстатков)
	
	КоличествоАкций = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество,
	|	ХозрасчетныйОстатки.СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ДатаПолученияОстатков,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АкцииТело),
	|			,
	|			(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Акции)) = &Акция
	|				И ДоговорДУ = &ДоговорДУ
	|				) КАК ХозрасчетныйОстатки";
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.Хозрасчетный.АкцииТело);
	Запрос.УстановитьПараметр("Акция", Акция);
	Запрос.УстановитьПараметр("ДатаПолученияОстатков", ДатаПолученияОстатков);
	Запрос.УстановитьПараметр("ДоговорДУ",ДоговорДУ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КоличествоАкций = Выборка.Количество;
	КонецЕсли;
	
	Если КоличествоАкций <> 0 Тогда
		Возврат СуммаНачисления/КоличествоАкций;
	Иначе
		Возврат 0;	
	КонецЕсли;	
	
КонецФункции // ПолучитьСуммуДивидентовНаОднуАкцию()

Функция АналитическиеСчетаБрокераДС() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АналитическиеСчета.Ссылка КАК АналитическийСчетДС,
	|	АналитическиеСчета.Наименование,
	|	АналитическиеСчета.ДоговорДУ,
	|	АналитическиеСчета.ДоговорКонтрагента,
	|	АналитическиеСчета.Биржа,
	|	АналитическиеСчета.СубъектМестаХранения КАК Контрагент
	|ИЗ
	|	Справочник.АналитическиеСчета КАК АналитическиеСчета
	|ГДЕ
	|	АналитическиеСчета.ВидАналитическогоСчета = ЗНАЧЕНИЕ(Перечисление.ВидыАналитическогоСчета.ДенежныеСредства)
	|	И НЕ АналитическиеСчета.ПометкаУдаления";    	
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ПолучитьСоответствиеКодЦБНаБирже() Экспорт
	
	СоответствиеКодЦБНаБирже = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОблигацииБиржиЛистинга.Ссылка КАК Ссылка,
	|	ОблигацииБиржиЛистинга.КодЦБ КАК КодЦБ,
	|	ОблигацииБиржиЛистинга.Ссылка.ПометкаУдаления КАК ПометкаУдаления // IMAPPS-26351
	|ИЗ
	|	Справочник.Облигации.БиржиЛистинга КАК ОблигацииБиржиЛистинга
	|ГДЕ
	|	ЕСТЬNULL(ОблигацииБиржиЛистинга.КодЦБ, """") <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АкцииБиржиЛистинга.Ссылка,
	|	АкцииБиржиЛистинга.Ссылка.ISIN,
	|	АкцииБиржиЛистинга.Ссылка.ПометкаУдаления // IMAPPS-26351
	|ИЗ
	|	Справочник.Акции.БиржиЛистинга КАК АкцииБиржиЛистинга
	|ГДЕ
	|	ЕСТЬNULL(АкцииБиржиЛистинга.КодЦБ, """") <> """"
	// IMAPPS-26351++
	// В первую очередь берем удаленные, во вторую не удаленный
	// В итоге в Соответствие останутся не удаленные
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПометкаУдаления УБЫВ
	|";
	// IMAPPS-26351--
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СоответствиеКодЦБНаБирже.Вставить(СокрЛП(Выборка.КодЦБ), Выборка.Ссылка);
	КонецЦикла;
	
	Возврат СоответствиеКодЦБНаБирже;
	
	
КонецФункции // ()

Функция ПолучитьКупон(ДатаОтчета, Облигация, СуммаОстатокДт, ДоговорДУ, ТорговыйКод, НомерСтроки, ИмяФайла,Важность = 0, Валюта = Неопределено) Экспорт
	Если Валюта = Неопределено  или Валюта = Справочники.Валюты.ПустаяСсылка()Тогда
		Валюта = Справочники.Валюты.RUB
	КонецЕсли;
	//Получаем купонный период 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.КупонныеПериоды) КАК Купон
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ДатаОтчета,
	|			Счет  = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоОблигациям),
	|			,
	|			Валюта = &Валюта
	|				И ДоговорДУ = &ДоговорДУ
	|				И Субконто2 = &Облигация) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.СуммаОстатокДт >= &СуммаОстатокДт";
	
	Запрос.УстановитьПараметр("ДатаОтчета", КонецДня(ДатаОтчета)+1);
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	Запрос.УстановитьПараметр("Облигация", Облигация);
	Запрос.УстановитьПараметр("СуммаОстатокДт", СуммаОстатокДт);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Купон;
	Иначе
		//масСообщения.Добавить("Внимание! Не найден Купонный период для " + Облигация);
		ДобавитьСообщение(ИмяФайла, НомерСтроки, ТорговыйКод, ДоговорДУ, "Внимание! Не найден Купонный период для " + Облигация, СтатусСообщения.Важное);
		Важность = 1;
		Возврат Справочники.КупонныеПериоды.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции // ПолучитьКупон()

Функция НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Активы.Объект.ISIN КАК ISIN
		|ИЗ
		|	Справочник.Активы КАК Активы
		|ГДЕ
		|	ЕСТЬNULL(Активы.Объект.ISIN, """") <> """"
		|	И &ISIN ПОДОБНО ""%"" + Активы.Объект.ISIN + ""%""
		|	И Активы.Объект.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ISIN", НазначениеПлатежа);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ISIN;
	КонецЦикла;
	
	Возврат "";
КонецФункции
// IMAPPS-28406 --

// IMAPPS-23546 ++
Функция НайтиАктивПоISIN(НазначениеПлатежа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Активы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Активы КАК Активы
		|ГДЕ
		|	Активы.Объект.ISIN = &ISIN
		|	И Активы.Объект.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ISIN", НазначениеПлатежа);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции
// IMAPPS-23546 --   

// IMAPPS-28903++
Функция НайтиАкциюПоНомерГосРег(НазначениеПлатежа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
"    ВЫБРАТЬ ПЕРВЫЕ 1
|	Акции.Ссылка.ISIN КАК ISIN,
|	Акции.Ссылка КАК Ссылка,
|	Акции.Ссылка.НомерГосРегистрацииВыпуска КАК СсылкаНомерГосРегистрацииВыпуска,
|	&НомерГосРегистрацииВыпуска КАК ISIN1,
|	ДЛИНАСТРОКИ(Акции.НомерГосРегистрацииВыпуска) КАК ДЛИНА
|ИЗ
|	Справочник.Акции КАК Акции
|ГДЕ
|	 ЕСТЬNULL(Акции.Ссылка.НомерГосРегистрацииВыпуска, """") <> """"
|	 И &НомерГосРегистрацииВыпуска ПОДОБНО ""%"" + Акции.НомерГосРегистрацииВыпуска + ""%""
|	 И Акции.Ссылка.ПометкаУдаления = ЛОЖЬ
|
|УПОРЯДОЧИТЬ ПО
|	ДЛИНА УБЫВ
|";

	Запрос.УстановитьПараметр("НомерГосРегистрацииВыпуска", НазначениеПлатежа);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ISIN;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции
// IMAPPS-28903--

Функция ПолучитьСоответствиеРегНомеровЦБ() Экспорт
	
	СоответствиеРегНомеровЦБ = Новый Соответствие;
	
	ЗапросБумаги = Новый Запрос;
	ЗапросБумаги.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Акции.Ссылка,
	|	Акции.ISIN
	|ИЗ
	|	Справочник.Акции КАК Акции
	|ГДЕ
	|	НЕ Акции.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Облигации.Ссылка,
	|	Облигации.ISIN
	|ИЗ
	|	Справочник.Облигации КАК Облигации
	|ГДЕ
	|	НЕ Облигации.ПометкаУдаления";
	
	Выборка = ЗапросБумаги.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СоответствиеРегНомеровЦБ.Вставить(СокрЛП(Выборка.ISIN), Выборка.Ссылка);
	КонецЦикла;
	
	Возврат СоответствиеРегНомеровЦБ;
	
КонецФункции // ПолучитьСоответствиеРегНомеровЦБ()

Функция ПолучитьТаблицуПараметровДоговоров() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка,
	|	ДоговорыКонтрагентов.Владелец,
	|	ДоговорыКонтрагентов.НомерДоговора,
	|	ДоговорыКонтрагентов.ДатаДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	(НЕ ДоговорыКонтрагентов.ПометкаУдаления)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТаблицуПараметровДоговоров()

Функция ПреобразоватьСтрокуВДату(ДатаСтрока)
	
	ПреобразованнаяДата = '00010101';
	
	Если СтрНайти(ДатаСтрока, "/") > 0 Тогда
		
		ВремТекст = новый ТекстовыйДокумент;
		ВремТекст.УстановитьТекст(СтрЗаменить(ДатаСтрока, "/", Символы.ПС));
		
		Если ВремТекст.КоличествоСтрок() < 3 Тогда
			Возврат Дата(ПреобразованнаяДата);
		КонецЕсли;
		
		Попытка
			ПреобразованнаяДата = Дата(Прав("000"+ВремТекст.ПолучитьСтроку(3), 4) + Прав("000"+ВремТекст.ПолучитьСтроку(1), 2) + Прав("000"+ВремТекст.ПолучитьСтроку(2), 2));
		Исключение			
		КонецПопытки;
		
	Иначе
		
		Если ЗначениеЗаполнено(ДатаСтрока) Тогда
			Если СтрДлина(ДатаСтрока) = 10 Тогда // формат даты ДД.ММ.ГГГГ
				Попытка
					ПреобразованнаяДата = Дата(Прав(ДатаСтрока, 4) + Сред(ДатаСтрока, 4, 2) + Лев(ДатаСтрока, 2));
				Исключение			
				КонецПопытки;
			КонецЕсли;	
		КонецЕсли;	
	
	КонецЕсли;
	
	Возврат ПреобразованнаяДата;
	
КонецФункции // ПреобразоватьСтрокуВДату()

Функция ПолучитьБрокераПоID(БрокерID)
	
	Ответ = Справочники.Контрагенты.ПустаяСсылка();
	Если  БрокерID = 0 Тогда
		//БрокерID = 0;
		
	ИначеЕсли  БрокерID = 1 Тогда
		//1 - ВТБ Капитал Брокер
		Ответ = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "7702668793");
		
	ИначеЕсли  БрокерID = 2 Тогда
		//2 - Сбербанк КИБ
		Ответ = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "7710048970");
		
	ИначеЕсли  БрокерID = 3 Тогда
		//3 - ВТБ 24 
		Ответ = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "7710353606");
		
	ИначеЕсли  БрокерID = 4 Тогда
		//4 - ВТБ Капитал Брокер - ПенсРезерв
		Ответ = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "7702668793");
		
	КонецЕсли;
	 
	Возврат Ответ;
КонецФункции

Функция СформироватьИОтправитьПисьмо(НаДату,ВажностьОшибки)
	
	Тема = "Рассылка результатов загрузки операций по брокерскому счету на " + Формат(НаДату, "ДФ=dd.MM.yyyy");
	
	ТекстТаблицаОпераций  = ТелоПисьма;
	
	РассылкаСообщения_Шапка();
	РассылкаСообщения_Заголовок("Сообщения загрузки операций брокера на дату: " + Формат(НаДату, "ДФ=dd.MM.yyyy"));
	
	х = новый Массив;
	х.Добавить("Имя файла");
	х.Добавить("стр. №");
	х.Добавить("Торговый Код");
	х.Добавить("Договор ДУ");
	х.Добавить("Сообщение");
	РассылкаСообщения_ЗаголовокТаблицы(х);
	
	Для каждого Сообщение Из масСообщения Цикл
		х[0] = Сообщение.ИмяФайла;
		х[1] = Сообщение.НомерСтроки;
		х[2] = Сообщение.ТорговыйКод;
		х[3] = Сообщение.ДоговорДУ;
		х[4] = Сообщение.Текст;
		РассылкаСообщения_СтрокаТаблицы(х);
	КонецЦикла;
	РассылкаСообщения_ПодвалТаблицы();
	
	//РассылкаСообщения_Заголовок("Таблица данных");
	ТелоПисьма = ТелоПисьма+ТекстТаблицаОпераций;
	
	РассылкаСообщения_Окончание();	
	
	ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста");
	Кому = Новый Массив;
	Для каждого ТекЯщик из СписокРассылки Цикл
		Кому.Добавить(Новый Структура("Адрес,Представление", ТекЯщик.ПочтовыйЯщик, ТекЯщик.Представление));
	КонецЦикла;
	
	ПараметрыПисьма.Кому = Кому;
	ПараметрыПисьма.Тема = ПрефиксПисьма(ВажностьОшибки) + Тема + ПропискаРассылки("r215");;
	ПараметрыПисьма.Тело = ТелоПисьма;
	ПараметрыПисьма.ТипТекста = "HTML";
	
	Попытка
		РаботаСПочтовымиСообщениями.ОтправитьСообщение(ПочтовыйЛогин, ПараметрыПисьма);
		текстРассылки = "Рассылка завершена";
	Исключение
		текстРассылки = "Рассылка не удалась: "+ПочтовыйЛогин; 
		Сообщения = ПолучитьСообщенияПользователю(Истина);
	КонецПопытки;
	
	Возврат текстРассылки; 
КонецФункции

Процедура ДобавитьСообщение(ИмяФайлаОтчета, НомерСтроки, ТорговыйКод, стрДоговорДУ, ТекстСообщения, Статус = Неопределено)
	
	Сообщение = новый Структура("Текст", ТекстСообщения);
	Сообщение.Вставить("ИмяФайла", ИмяФайлаОтчета);
	Сообщение.Вставить("НомерСтроки", НомерСтроки);
	Сообщение.Вставить("ТорговыйКод", ТорговыйКод);
	Сообщение.Вставить("ДоговорДУ", стрДоговорДУ);
	Сообщение.Вставить("Статус", ?(Статус = Неопределено, СтатусСообщения.БезСтатуса, Статус));
	
	масСообщения.Добавить(Сообщение);
КонецПроцедуры

Функция ТекстСообщения(СтруктураСообщения)
	
	стрТекст = "";
	стрТекст = стрТекст+?(ЗначениеЗаполнено(СтруктураСообщения.ИмяФайла),"["+СтруктураСообщения.ИмяФайла+"]" , "");
	стрТекст = стрТекст+?(ЗначениеЗаполнено(СтруктураСообщения.НомерСтроки), " стр. №: "+ СтруктураСообщения.НомерСтроки, "");
	стрТекст = стрТекст+?(ЗначениеЗаполнено(СтруктураСообщения.ТорговыйКод), " Торговый код: "+ СтруктураСообщения.ТорговыйКод, "");
	//стрТекст = стрТекст+?(ЗначениеЗаполнено(СтруктураСообщения.ДоговорДУ), , "");
	стрТекст = стрТекст+": "+СтруктураСообщения.Текст;
	
	Возврат стрТекст;
КонецФункции

/////////////////////////////////////////////////////////////////

Процедура РассылкаСообщения_Шапка()
	ТелоПисьма = "";
	ТелоПисьма = ТелоПисьма
	           + "<html><head><meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" /></head>"
			   + "<body style=""font-family:Arial, Helvetica, sans-serif;color:black;"">";
КонецПроцедуры

Процедура РассылкаСообщения_Заголовок(Х)
	ТелоПисьма = ТелоПисьма
			   + "<br/><br/>"
	           + "<b>"+Х+"</b>"
			   + "<br/><br/>";
КонецПроцедуры
Процедура РассылкаСообщения_ЗаголовокТаблицы(Х)
	ТелоПисьма = ТелоПисьма
	           + "<table BORDERCOLOR=""Black"" border-style= ""solid"" border-collapse =""collapse"" border=""1"">"
			   + "<tr>";
	Для Каждого А из Х Цикл 
		ТелоПисьма = ТелоПисьма
				   + "<th align=""center"" bgcolor=""#C0C0C0"">"+А+"</th>";
	КонецЦикла;
	ТелоПисьма = ТелоПисьма
			   + "</tr>";
КонецПроцедуры
Процедура РассылкаСообщения_СтрокаТаблицы(Х)
	ТелоПисьма = ТелоПисьма
			   + "<tr>";
	Для Каждого А из Х Цикл 
		ТелоПисьма = ТелоПисьма
		           + "<td>"+А+"</td>";
	КонецЦикла;
	ТелоПисьма = ТелоПисьма
			   + "</tr>";
КонецПроцедуры
Процедура РассылкаСообщения_ПодвалТаблицы()
	ТелоПисьма = ТелоПисьма
			   + "</table>";
КонецПроцедуры
Процедура РассылкаСообщения_Окончание()
	ТелоПисьма = ТелоПисьма
			   + "</body></html>";
		   КонецПроцедуры
//Kmusorin функция для поиска счета по торговому коду и валюте для http://jira/browse/IMAPPS-3207		   
Функция НайтиАналитическийСчетпоТорговомуКодуиВалюте(ТорговыйКод,Валюта,КодТорг = Неопределено)
	
	Запрос	= Новый Запрос;                                                                   
	Если КодТорг = Неопределено Тогда
		Запрос.Текст	= "ВЫБРАТЬ
		            	  |	ТорговыеКоды.АналитическийСчетДС.Ссылка КАК АналитическийСчетДССсылка
		            	  |ИЗ
		            	  |	Справочник.ТорговыеКоды КАК ТорговыеКоды
		            	  |ГДЕ
		            	  |	ТорговыеКоды.АналитическийСчетДС.МестоХранения.ВалютаДенежныхСредств.Ссылка = &Валюта
		            	  |	И ТорговыеКоды.ТорговыйКод ПОДОБНО &ТорговыйКод
		            	  |	И ТорговыеКоды.ПометкаУдаления = Ложь";
	Иначе	 
		Запрос.Текст	= "ВЫБРАТЬ
	            	  |	ТорговыеКоды.АналитическийСчетДС.Ссылка КАК АналитическийСчетДССсылка
	            	  |ИЗ
	            	  |	Справочник.ТорговыеКоды КАК ТорговыеКоды
	            	  |ГДЕ
	            	  |	ТорговыеКоды.ссылка = &КодТорг";
	
	КонецЕсли;	
	Запрос.УстановитьПараметр("ТорговыйКод", ТорговыйКод + "%");
	Запрос.УстановитьПараметр("КодТорг", КодТорг );
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Результат	= Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.ТорговыеКоды.ПустаяСсылка();
	Иначе
		Выборка	= Результат.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.АналитическийСчетДССсылка;
	КонецЕсли;
	
КонецФункции		   

Функция ПропискаРассылки(Знач НомерРассылки)
	Перем ПараметрыПодключения, ИмяИБ;
	
	Попытка
		ПараметрыПодключения = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПодключенияИзСтрокиСоединенияИнформационнойБазы(СтрокаСоединенияИнформационнойБазы());
		ИмяИБ = ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия;
	Исключение
	КонецПопытки;
	
	Прописка = " {" + НомерРассылки + ", ib: " + ?(ЗначениеЗаполнено(ИмяИБ), ИмяИБ, "< .. >") + "}";
	Возврат Прописка;   
КонецФункции // ПропискаРассылки()


Функция ПрефиксПисьма(Знач ВажностьОшибки, Знач ЭтоОтчет = Ложь)
	Перем ПрефиксПисьма;
	
	Если ВажностьОшибки = 1 Тогда
		ПрефиксПисьма = "{WARN} ";
		
	ИначеЕсли ВажностьОшибки = 2 Тогда
		ПрефиксПисьма = "{FAIL} ";
		
	Иначе
		ПрефиксПисьма = ?(ЭтоОтчет, "", "{OK} ");
	КонецЕсли;
	
	Возврат ПрефиксПисьма;
КонецФункции // ПрефиксПисьма()

Процедура ПрочитатьФайлJSON(АдресФайлаНаСервере, ИмяФайлаБезРасширения, БрокерУИД="") Экспорт
	
	масСообщения = новый Массив;
	
	ТаблицаДанных2.Очистить();
	ТаблицаДанных5.Очистить();  
	
	ВестиТолькоБухгалтерскийУчет = Константы.ВестиТолькоБухгалтерскийУчет.Получить();
	
	ЛокТаблицаДанных5 = ТаблицаДанных5.Выгрузить();
	тблКешФлоу = Новый ТаблицаЗначений;
	тблКешФлоу.Колонки.Добавить("Счет", ОбщегоНазначения.ОписаниеТипаСтрока(125));
	тблКешФлоу.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	тблКешФлоу.Колонки.Добавить("Описание", ОбщегоНазначения.ОписаниеТипаСтрока(200));
	тблКешФлоу.Колонки.Добавить("Кредит", ОбщегоНазначения.ОписаниеТипаЧисло(20,2));
	тблКешФлоу.Колонки.Добавить("Дебет", ОбщегоНазначения.ОписаниеТипаЧисло(20,2));
	тблКешФлоу.Колонки.Добавить("Валюта", ОбщегоНазначения.ОписаниеТипаСтрока(3));
	тблКешФлоу.Колонки.Добавить("СубСчет", ОбщегоНазначения.ОписаниеТипаСтрока(125));
	
	УникальноеИмяФайла = Новый УникальныйИдентификатор;
	
	ИмяФайлаНаСервере = КаталогВременныхФайлов() + ИмяФайлаБезРасширения + ".json";	
	
	ФайлДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаНаСервере);
	ФайлДвоичныеДанные.Записать(ИмяФайлаНаСервере);
		
	Чтение = Новый ЧтениеJSON;
	Чтение.ОткрытьФайл(ИмяФайлаНаСервере);
	
	ДанныеФайла = ПрочитатьJSON(Чтение);

	// чтение json
	reportInfoЕсть = ДанныеФайла.Свойство("reportInfo");
	Если НЕ reportInfoЕсть Тогда 
		Сообщить("Не блока reportInfo в файле json"); 
		Возврат;
	КонецЕсли;   
	
	reportInfo = ДанныеФайла.reportInfo;	
	mainЕсть = reportInfo.Свойство("main");
	Если НЕ mainЕсть Тогда 
		Сообщить("Не блока main в файле json"); 
		Возврат;
	КонецЕсли; 
	
	main = reportInfo.main;
	
	СчетчикCash = 0;
	СчетчикСтрок = 0;
	
	СоответствиеКодЦБНаБирже = ПолучитьСоответствиеКодЦБНаБирже();
	
	Для Каждого ОсновнойБлок из main Цикл
		
		Договор = "";
		ДепоСчет = "";
		ДатаДепоСчет = Дата(1, 1, 1);
		
		Если ОсновнойБлок.Свойство("agreement") Тогда
			Договор = ОсновнойБлок.agreement;
		КонецЕсли; 
		Если ОсновнойБлок.Свойство("depoAccount") Тогда
			ДепоСчет = ОсновнойБлок.depoAccount;
		КонецЕсли;
		Если ОсновнойБлок.Свойство("agrDate") Тогда
			ДатаСтрока = СтрЗаменить(ОсновнойБлок.agrDate, "-", "");
			Договор = Дата(ДатаСтрока);
		КонецЕсли;
		
		Если НЕ ОсновнойБлок.Свойство("clients") Тогда
			Сообщить("Не блока clients в файле json");
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлиентФайл из ОсновнойБлок.clients Цикл
			
			КлиентНаименование = "";
			СубСчетКлиента = "";
			Если КлиентФайл.Свойство("clientName") Тогда
				КлиентНаименование = КлиентФайл.clientName;
			КонецЕсли; 
			Если КлиентФайл.Свойство("diasoftCode") Тогда
				СубСчетКлиента = КлиентФайл.diasoftCode;
			КонецЕсли;
			
			Если КлиентФайл.Свойство("cash") Тогда
				ПрочитатьCashБанкВТБ_JSON(КлиентФайл.cash, ВестиТолькоБухгалтерскийУчет, СубСчетКлиента, СчетчикCash);
			КонецЕсли;
			
			Если КлиентФайл.Свойство("cashFlows") Тогда
				ПрочитатьCashFlowБанкВТБ_JSON(КлиентФайл.cashFlows, ВестиТолькоБухгалтерскийУчет, СубСчетКлиента, ИмяФайлаБезРасширения, ЛокТаблицаДанных5, тблКешФлоу, СчетчикСтрок, СоответствиеКодЦБНаБирже, БрокерУИД)
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	МассивЛишнихСтрок = Новый Массив;
	
	Для Каждого СтрокаТЧ из ЛокТаблицаДанных5 Цикл
		
		Если МассивЛишнихСтрок.Найти(СтрокаТЧ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Отбор = Новый Структура;
		Отбор.Вставить("Дата", СтрокаТЧ.Дата);
		Отбор.Вставить("ДоговорДУ", СтрокаТЧ.ДоговорДУ);
		Отбор.Вставить("Сумма", СтрокаТЧ.Сумма);
		Если СтрокаТЧ.ТорговыйКодПриход.Пустая() Тогда
			Отбор.Вставить("ТорговыйКодРасход", Справочники.ТорговыеКоды.ПустаяСсылка());
		ИначеЕсли СтрокаТЧ.ТорговыйКодРасход.Пустая() Тогда
			Отбор.Вставить("ТорговыйКодПриход", Справочники.ТорговыеКоды.ПустаяСсылка());	
		КонецЕсли;	
		
		МассивПоиск = ЛокТаблицаДанных5.НайтиСтроки(Отбор);
		Если МассивПоиск.Количество() Тогда
			
			Если СтрокаТЧ.ТорговыйКодПриход.Пустая() Тогда
				СтрокаТЧ.ТорговыйКодПриход = МассивПоиск[0].ТорговыйКодПриход;	
			ИначеЕсли СтрокаТЧ.ТорговыйКодРасход.Пустая() Тогда
				СтрокаТЧ.ТорговыйКодРасход = МассивПоиск[0].ТорговыйКодРасход;		
			КонецЕсли;		
			
			МассивЛишнихСтрок.Добавить(МассивПоиск[0]);
			
			СтрокаНовая = ТаблицаДанных5.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНовая, СтрокаТЧ);
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если тблКешФлоу.Количество() > 0 Тогда
		Запрос = новый Запрос;
		Запрос.УстановитьПараметр("тбл", тблКешФлоу);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	т.Счет КАК Счет,
			|	т.СубСчет КАК СубСчет,
			|	т.Период КАК Период,
			|	т.Описание КАК Описание,
			|	т.Кредит КАК Кредит,
			|	т.Дебет КАК Дебет,
			|	ВЫБОР
			|		КОГДА т.Валюта = ""RUR""
			|			ТОГДА ""RUB""
			|		ИНАЧЕ т.Валюта
			|	КОНЕЦ КАК Валюта
			|ПОМЕСТИТЬ втСтроки
			|ИЗ
			|	&тбл КАК т
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА т.Дебет > 0
			|				ТОГДА ТорговыеКоды.Ссылка
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК ТорговыйКодРасход,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА т.Кредит > 0
			|				ТОГДА ТорговыеКоды.Ссылка
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК ТорговыйКодПриход,
			|	т.Период КАК Дата,
			|	т.Описание КАК Описание,
			|	т.Валюта КАК Валюта,
			|	ВЫБОР
			|		КОГДА т.Дебет > 0
			|			ТОГДА т.Дебет
			|		ИНАЧЕ т.Кредит
			|	КОНЕЦ КАК Сумма,
			|	ТорговыеКоды.ДоговорДУ КАК ДоговорДУ
			|ИЗ
			|	втСтроки КАК т
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТорговыеКоды КАК ТорговыеКоды
			|		ПО (ВЫРАЗИТЬ(ТорговыеКоды.АналитическийСчетДС.МестоХранения КАК Справочник.БанковскиеСчета).НомерСчета = т.Счет)
			|			И (ТорговыеКоды.Наименование ПОДОБНО ""%/"" + т.СубСчет)
			|			И т.Валюта = ТорговыеКоды.Ссылка.АналитическийСчетДС.МестоХранения.ВалютаДенежныхСредств.Наименование
			|
			|СГРУППИРОВАТЬ ПО
			|	т.Период,
			|	т.Описание,
			|	т.Валюта,
			|	ВЫБОР
			|		КОГДА т.Дебет > 0
			|			ТОГДА т.Дебет
			|		ИНАЧЕ т.Кредит
			|	КОНЕЦ,
			|	ТорговыеКоды.ДоговорДУ";
		
		таб = запрос.Выполнить().Выгрузить();
		Для каждого СтрокаТаб Из таб Цикл
			Если СтрокаТаб.ТорговыйКодРасход = СтрокаТаб.ТорговыйКодПриход Тогда
				Продолжить;
			КонецЕсли;
			СтрокаНовая = ТаблицаДанных5.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНовая, СтрокаТаб);
		КонецЦикла;
	КонецЕсли;
		
	Если СчетчикСтрок = 0 Тогда
		ДобавитьСообщение(ИмяФайлаБезРасширения, "", "", "", "Файл не содержит данных о сделках!", СтатусСообщения.Важное);
		Возврат;		
	КонецЕсли;
			
	Для каждого Сообщение Из масСообщения Цикл
		Сообщить(ТекстСообщения(Сообщение), Сообщение.Статус);
	КонецЦикла;
		
КонецПроцедуры

Процедура ПрочитатьCashБанкВТБ_JSON(БлокCash, ВестиТолькоБухгалтерскийУчет, SubAccount, СчетчикCash)

	МассивПропущенныеТорговыеКоды = Новый Массив;
	СчетчикСтрок 	= 0;
	СчетчикCash 	= 0;
	
	Для Каждого ЗаписьCash из БлокCash Цикл
		
		InvAccount 		= "";
		ДатаБалланса 	= "";
		BalOpen 		= "";
		Debited 		= "";
		Credited 		= "";
		BalCls			= "";  
		Currency		= "";	
		
		Если ЗаписьCash.Свойство("invAccount") Тогда
			InvAccount = ЗаписьCash.invAccount;
		КонецЕсли;  
		Если ЗаписьCash.Свойство("date") Тогда 
			ДатаСтрока = СтрЗаменить(ЗаписьCash.date, "-", ""); 
			ДатаСтрока = СтрЗаменить(ДатаСтрока, "T00:00:00", "");
			ДатаБалланса = Дата(ДатаСтрока);
		КонецЕсли;
		Если ЗаписьCash.Свойство("blOpen") Тогда
			BalOpen = ЗаписьCash.blOpen;
		КонецЕсли;
		Если ЗаписьCash.Свойство("debited") Тогда
			Debited = ЗаписьCash.debited;
		КонецЕсли;
		Если ЗаписьCash.Свойство("credited") Тогда
			Credited = ЗаписьCash.credited;
		КонецЕсли;
		Если ЗаписьCash.Свойство("balCls") Тогда
			BalCls = ЗаписьCash.balCls;
		КонецЕсли; 
		Если ЗаписьCash.Свойство("currency") Тогда
			Currency = ЗаписьCash.currency;
		КонецЕсли;
				
		Если СчетчикCash = 0 Тогда
						
			//ТаблицаОстатковИОборотовПоАналитическимСчетамДС = ОстаткиПоАналитическимСчетамБрокераДС(ДатаБалланса);
			СчетчикCash = СчетчикCash + 1;
		КонецЕсли;
		
		Если СчетчикCash > 0 И ЗначениеЗаполнено(ДатаБалланса) Тогда
			
			НоваяСтрока	= ТаблицаДанных3.Добавить();
			НоваяСтрока.ТорговыйКод = InvAccount;
			КодТорг = Справочники.ТорговыеКоды.НайтиПоРеквизиту("ТорговыйКод", НоваяСтрока.ТорговыйКод);
			Если ЗначениеЗаполнено(КодТорг) Тогда
				НоваяСтрока.АналитическийСчетДС = НайтиАналитическийСчетпоТорговомуКодуиВалюте(НоваяСтрока.ТорговыйКод,Справочники.Валюты.RUB);			
				НоваяСтрока.ДоговорДУ = ОбщегоНазначения.ПолучитьЗначениеРеквизита(КодТорг, "ДоговорДУ");
				АналитическийСчетДС = НоваяСтрока.АналитическийСчетДС;
				Если НЕ ВестиТолькоБухгалтерскийУчет И ЗначениеЗаполнено(АналитическийСчетДС) Тогда
					НоваяСтрока.ФизическоеМестоХраненияДС = ?(ЗначениеЗаполнено(АналитическийСчетДС.АналитическийПризнакСчетаБрокера),АналитическийСчетДС.АналитическийПризнакСчетаБрокера, АналитическийСчетДС.МестоХранения);
				КонецЕсли;
			КонецЕсли;
			
			НоваяСтрока.Дата = ДатаБалланса;
			НоваяСтрока.СуммаНачальныйОстаток = BalOpen;
			НоваяСтрока.СуммаОборотКт = Credited;
			НоваяСтрока.СуммаОборотДт = Debited;
			НоваяСтрока.СуммаКонечныйОстаток = BalCls;
			
			СчетчикCash = СчетчикCash + 1;
		КонецЕсли;
					
	КонецЦикла;  
			
КонецПроцедуры

Процедура ПрочитатьCashFlowБанкВТБ_JSON(БлокCashFlow, ВестиТолькоБухгалтерскийУчет, SubAccount, ИмяФайлаБезРасширения, ЛокТаблицаДанных5, тблКешФлоу, СчетчикСтрок, СоответствиеКодЦБНаБирже, БрокерУИД)
	
	//ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить(); 
	
	Для Каждого ЗаписьCashFlow из БлокCashFlow Цикл
		
		НазначениеПлатежа = "";
		Если ЗаписьCashFlow.Свойство("numberDescr") Тогда
			НазначениеПлатежа = ЗаписьCashFlow.numberDescr;
		КонецЕсли; 
		Если ЗаписьCashFlow.Свойство("Descr") Тогда
			НазначениеПлатежа = ЗаписьCashFlow.Descr;
		КонецЕсли;		
		
		InvAccount 		= "";
		ДатаБалланса 	= "";
		Credited 		= "";
		Debited 		= "";
		Currency 		= "";
		
		Если ЗаписьCashFlow.Свойство("invAccount") Тогда
			InvAccount = ЗаписьCashFlow.invAccount;
		КонецЕсли;
		Если ЗаписьCashFlow.Свойство("date") Тогда
			ДатаСтрока = СтрЗаменить(ЗаписьCashFlow.date, "-", "");
			ДатаСтрока = СтрЗаменить(ДатаСтрока, "T00:00:00", "");
			ДатаБалланса = Дата(ДатаСтрока);
		КонецЕсли;
		Если ЗаписьCashFlow.Свойство("credited") Тогда
			Credited = ЗаписьCashFlow.credited;
		КонецЕсли;
		Если ЗаписьCashFlow.Свойство("debited") Тогда
			Debited = ЗаписьCashFlow.debited;
		КонецЕсли;
		Если ЗаписьCashFlow.Свойство("currency") Тогда
			Currency = ЗаписьCashFlow.currency;
		КонецЕсли;
		
		Если (СтрНайти(НазначениеПлатежа, "Выплата") > 0 И СтрНайти(НазначениеПлатежа, "купона") > 0)
			ИЛИ СтрНайти(Врег(НазначениеПлатежа), "ДИВИДЕН") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Комиссия за расчетные услуги") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Частичное погашение") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Полное погашение") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Списание комиссии с ИБС клиента") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Погашение купона") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Депозитарная комиссия") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Использование брокером ДС клиента") > 0 //IMDEV-621, IMDEV-622
			ИЛИ СтрНайти(Назначениеплатежа, "Комиссия «Проведение расчетных операций с ценными бумагами по итогам сделок»") > 0 //IMAPPS-11276
			ИЛИ СтрНайти(Назначениеплатежа, "Комиссия «Возмещение расходов НКО АО НРД за обслуживание выпуска ценных бумаг»") > 0 //IMAPPS-13993
			ИЛИ СтрНайти(НазначениеПлатежа, "MICEX / Возврат выплат.Исполнение обязательств по передаче дохода Клиринговым центром ") > 0 // IMAPPS-23546
			
			ИЛИ СтрНайти(НазначениеПлатежа, "Оплата комиссии по операции Проведение расчетных операций с ЦБ (оплата)") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Комиссия за хранение цб. Счет депо") > 0 // IMAPPS-37065
			ИЛИ СтрНайти(НазначениеПлатежа, "Выплата купонного дохода по облигациям") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Выплата дохода по акциям") > 0
			ИЛИ СтрНайти(НазначениеПлатежа, "Погашение номинальной стоимости облигаций") > 0
			
		Тогда
			
			НоваяСтрока	= ТаблицаДанных2.Добавить();
			НоваяСтрока.ТорговыйКод = InvAccount;
			
			НоваяСтрока.Дата = ДатаБалланса;
			ИскатьКупон = Ложь;
			Если СтрНайти(НазначениеПлатежа, "Выплата") > 0 И СтрНайти(НазначениеПлатежа, "купона") > 0 Тогда
				НоваяСтрока.КодЦБ = СокрЛП(Лев(НазначениеПлатежа, СтрНайти(НазначениеПлатежа, "(Выплата")-1));
				ИскатьКупон = Истина;
			ИначеЕсли СтрНайти(НазначениеПлатежа, "Выплата купонного дохода по облигациям") > 0 Тогда
				НоваяСтрока.КодЦБ = НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа);
				ИскатьКупон = Истина;
			ИначеЕсли СтрНайти(НазначениеПлатежа, "Погашение купона") > 0 Тогда
				НоваяСтрока.КодЦБ = НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа);
				ИскатьКупон = Истина;
			ИначеЕсли СтрНайти(НазначениеПлатежа, "Частичное погашение") > 0 Тогда
				НоваяСтрока.КодЦБ = СокрЛП(Лев(НазначениеПлатежа, СтрНайти(НазначениеПлатежа, "(Частичное")-1));
				Если Не ЗначениеЗаполнено(НоваяСтрока.КодЦБ) Тогда
					НоваяСтрока.КодЦБ = НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа);
				КонецЕсли;
			ИначеЕсли СтрНайти(НазначениеПлатежа, "Полное погашение") > 0 Тогда
				НоваяСтрока.КодЦБ = СокрЛП(Лев(НазначениеПлатежа, СтрНайти(НазначениеПлатежа, "(Полное погашение")-1));
				Если Не ЗначениеЗаполнено(НоваяСтрока.КодЦБ) Тогда
					НоваяСтрока.КодЦБ = НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа);
				КонецЕсли;
			ИначеЕсли СтрНайти(НазначениеПлатежа, "Погашение номинальной стоимости облигаций") > 0 Тогда
				НоваяСтрока.КодЦБ = НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа);
			ИначеЕсли СтрНайти(Врег(НазначениеПлатежа), "MICEX / ВОЗВРАТ ВЫПЛАТ") > 0 Тогда
				НоваяСтрока.КодЦБ = СокрЛП(Прав(НазначениеПлатежа,12));
				НоваяСтрока.Актив = НайтиАктивПоISIN(НоваяСтрока.КодЦБ);
			ИначеЕсли СтрНайти(Врег(НазначениеПлатежа), "ДИВИДЕН") > 0 Или СтрНайти(Врег(НазначениеПлатежа), "ВЫПЛАТА ДОХОДА ПО АКЦИЯМ") > 0 Тогда
				НоваяСтрока.КодЦБ = НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа);
			КонецЕсли;
			
			НоваяСтрока.НазначениеПлатежа = НазначениеПлатежа;
			
			Если БрокерУИД = "73fc232b-45e3-11e2-b4e9-005056b100ec" Тогда // Банк ВТБ
				НоваяСтрока.Приход = Credited;
				НоваяСтрока.Расход = Debited;
			Иначе
				НоваяСтрока.Приход = Debited;
				НоваяСтрока.Расход = Credited;
			КонецЕсли;
			
			ТорговыйКодБрокера = ПолучитьТорговыйКодПоСчетуБрокера(SubAccount, InvAccount, Currency);
			
			Для Каждого Строка Из ТорговыйКодБрокера Цикл
				НоваяСтрока.АналитическийСчетДС = Строка.АналитическийСчетДС;
				НоваяСтрока.Брокер = Строка.Брокер;
				НоваяСтрока.ДоговорДУ = Строка.ДоговорДУ;
				НоваяСтрока.ДоговорБрокера = Строка.ДоговорБрокера;
			КонецЦикла;
			
			//Поиск бумаги				
			Если НоваяСтрока.Актив = Справочники.Активы.ПустаяСсылка() Тогда 
				
				АктивОбъект = СоответствиеКодЦБНаБирже.Получить(НоваяСтрока.КодЦБ);
				Если АктивОбъект <> Неопределено Тогда
					НоваяСтрока.Актив = АктивСервер.ПолучитьАктивПоОбъекту(АктивОбъект);
				Иначе
					КонтекстСопоставления = Перечисления.КонтекстСопоставления.ЦенныеБумаги;
					НоваяСтрока.Актив = РегистрыСведений.УниверсальныеСопоставления.ПрочитатьПрямоеСопоставление(КонтекстСопоставления,Справочники.Биржи.ПустаяСсылка(), НоваяСтрока.КодЦБ, Ложь, ДатаБалланса);
				КонецЕсли;
				
			КонецЕсли; 
			
			//Заполним реквизиты по торговому коду
			КодТорг = Справочники.ТорговыеКоды.НайтиПоРеквизиту("ТорговыйКод", НоваяСтрока.ТорговыйКод); 
			ВалютаСчета = Справочники.Валюты.RUB;
			Если КодТорг = Справочники.ТорговыеКоды.ПустаяСсылка() Тогда 
				Если Currency = "RUR" Тогда 
					ВалютаCashFlows = "RUB";
				Иначе 
					ВалютаCashFlows = Currency;
				КонецЕсли;
				Если  НЕ ВалютаCashFlows = "RUB" и НЕ ПустаяСтрока(ВалютаCashFlows) Тогда
					ВалютаСчета = ПолучитьВалютуПоСтроке(ВалютаCashFlows);
				КонецЕсли;	
				КодТорг = ПолучитьТорговыйКодСсылку(НоваяСтрока.ТорговыйКод + "/" + ВалютаCashFlows);
			КонецЕсли; 
			НоваяСтрока.Валюта = ВалютаСчета;
			
			Если ЗначениеЗаполнено(КодТорг) Тогда

				Если ЗначениеЗаполнено(КодТорг) Тогда
					НоваяСтрока.АналитическийСчетДС = НайтиАналитическийСчетпоТорговомуКодуиВалюте(НоваяСтрока.ТорговыйКод,ВалютаСчета,КодТорг);
				Иначе
					НоваяСтрока.АналитическийСчетДС = НайтиАналитическийСчетпоТорговомуКодуиВалюте(НоваяСтрока.ТорговыйКод,ВалютаСчета);
				КонецЕсли;
				СтруктураКодТорг = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(КодТорг, "ДоговорДУ, Биржа, Брокер, ДоговорБрокера");
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураКодТорг);
				 АналитическийСчетДС = НоваяСтрока.АналитическийСчетДС;
				Если НЕ ВестиТолькоБухгалтерскийУчет И ЗначениеЗаполнено(АналитическийСчетДС) Тогда
					НоваяСтрока.ФизическоеМестоХраненияДС = ?(ЗначениеЗаполнено(АналитическийСчетДС.АналитическийПризнакСчетаБрокера),АналитическийСчетДС.АналитическийПризнакСчетаБрокера, АналитическийСчетДС.МестоХранения);
				КонецЕсли;
			КонецЕсли;
			
			//Поиск купона
			Если ИскатьКупон И ЗначениеЗаполнено(НоваяСтрока.Актив)И ЗначениеЗаполнено(НоваяСтрока.ДоговорДУ) Тогда
				НоваяСтрока.Купон = ПолучитьКупон(ДатаБалланса, НоваяСтрока.Актив.Объект, НоваяСтрока.Расход, НоваяСтрока.ДоговорДУ, НоваяСтрока.ТорговыйКод, СчетчикСтрок, ИмяФайлаБезРасширения,,НоваяСтрока.Валюта);
			КонецЕсли;
			
			СчетчикСтрок = СчетчикСтрок + 1;
			
		ИначеЕсли СтрНайти(НазначениеПлатежа, "Перечислено в ТС (Зачисление денег) / Выведено из ТС (Перевод на Основной рынок)") > 0 Тогда
			
			НоваяСтрока = ЛокТаблицаДанных5.Добавить();
			
			НоваяСтрока.Дата = ДатаБалланса;
			
			Приход = 0;
			Попытка
				Приход = Число(Debited);
			Исключение
			КонецПопытки;
			
			Расход = 0;
			Попытка
				Расход = Число(Credited);
			Исключение
			КонецПопытки;
			
			НоваяСтрока.Сумма = Макс(Приход, Расход);
			
			ТорговыйКодБрокера = ПолучитьТорговыйКод(SubAccount);
			Для Каждого Строка Из ТорговыйКодБрокера Цикл
				Если Приход > 0 Тогда
					НоваяСтрока.ТорговыйКодПриход = Строка.Ссылка;
				ИначеЕсли Расход > 0 Тогда
					НоваяСтрока.ТорговыйКодРасход = Строка.Ссылка;
				КонецЕсли;
				НоваяСтрока.ДоговорДУ = Строка.ДоговорДУ;
			КонецЦикла;
			
			// IMAPPS-30183++
			НоваяСтрока.Описание = НазначениеПлатежа;
			// IMAPPS-30183--
			
			СчетчикСтрок = СчетчикСтрок + 1
			
		ИначеЕсли СтрНайти(НазначениеПлатежа, "Перевод ДС ") > 0 
			Или СтрНайти(НазначениеПлатежа, "Перевод денежных средств с субсчета ") > 0 Тогда
			
			НоваяСтрока = тблКешФлоу.Добавить();
			НоваяСтрока.Счет 		 = InvAccount;
			НоваяСтрока.Период 		 = ДатаБалланса;
			НоваяСтрока.Описание	 = НазначениеПлатежа;
			НоваяСтрока.Кредит 		 = Credited;
			НоваяСтрока.Дебет 		 = Debited;
			НоваяСтрока.Валюта 		 = Currency;
			НоваяСтрока.СубСчет		 = SubAccount;
			
			СчетчикСтрок = СчетчикСтрок + 1
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// IMAPPS-28406 ++
Функция НайтиПоНомерГосРегВНазначенииПлатежа(НазначениеПлатежа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	// IMAPPS-28573 ++
	//	"ВЫБРАТЬ
	//	|	Облигации.Ссылка.ISIN КАК ISIN
	//	|ИЗ
	//	|	Справочник.Облигации КАК Облигации
	//	|ГДЕ
	//	|	ЕСТЬNULL(Облигации.Ссылка.НомерГосРегистрацииВыпуска, """") <> """"
	//	|	И &ISIN ПОДОБНО ""%"" + Облигации.Ссылка.НомерГосРегистрацииВыпуска + ""%""
	//	|	И Облигации.Ссылка.ПометкаУдаления = ЛОЖЬ";
	//Запрос.УстановитьПараметр("ISIN", НазначениеПлатежа);
	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Облигации.Ссылка.ISIN КАК ISIN,
	|	Облигации.Ссылка КАК Ссылка,
	|	Облигации.Ссылка.НомерГосРегистрацииВыпуска КАК СсылкаНомерГосРегистрацииВыпуска,
	|	&НомерГосРегистрацииВыпуска КАК ISIN1,
	|	ДЛИНАСТРОКИ(Облигации.Ссылка.НомерГосРегистрацииВыпуска) КАК ДЛИНА
	|ИЗ
	|	Справочник.Облигации КАК Облигации
	|ГДЕ
	|	ЕСТЬNULL(Облигации.Ссылка.НомерГосРегистрацииВыпуска, """") <> """"
	|	И &НомерГосРегистрацииВыпуска ПОДОБНО ""%"" + Облигации.Ссылка.НомерГосРегистрацииВыпуска + ""%""
	|	И Облигации.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДЛИНА УБЫВ
	|";
	Запрос.Параметры.Вставить("НомерГосРегистрацииВыпуска", НазначениеПлатежа);
	// IMAPPS-28573 --
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ISIN;
	КонецЦикла;
	
	Возврат "";
КонецФункции


/////////////////////////////////////////////////////////////////

масСообщения = новый Массив;
ЭтоВызовСКлиента = Ложь; // IMAPPS-26041
