
// Возвращает префикс кодов и номеров объектов информационной базы по умолчанию
//
// Параметры:
//  Нет.
// 
// Возвращаемое значение:
//  Строка, 2 - префикс кодов и номеров объектов информационной базы по умолчанию
//
Функция ПрефиксИнформационнойБазыПоУмолчанию() Экспорт
	
	Возврат "ДМ";
	
КонецФункции

Функция ПолучитьФайлыДокумента(Идентификатор) Экспорт
	
	Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСЭД();
	
	UserID = ПолучитьUserID();
	
	Файлы = Прокси.GetFiles(Идентификатор, UserID);
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Данные");
	Таблица.Колонки.Добавить("РасширениеФайла");
	
	ТипыФайлов = Новый Соответствие;
	ТипыФайлов.Вставить(1, "PDF");
	ТипыФайлов.Вставить(2, "TIF");
	ТипыФайлов.Вставить(8, "JPG");
	ТипыФайлов.Вставить(12, "TIFF");
	
	Для Каждого СтрокаФайл Из Файлы.Filedoc Цикл
		
		РасширениеФайла = ТипыФайлов.Получить(СтрокаФайл.FileTypeId);
		Если РасширениеФайла <> Неопределено Тогда
			
			Данные = СтрокаФайл.Body;
			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока.Данные = Данные;
			НоваяСтрока.РасширениеФайла = РасширениеФайла;
			
		Иначе
			
			Сообщить("Неизвестный тип файла " + СтрокаФайл.FileTypeId);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьUserID()
	
	Соединение = Неопределено;
	КомандаКлиенты = Неопределено;
	RSКлиенты = Неопределено;
	ВнешниеДанные.ADOConnect(Соединение, КомандаКлиенты, RSКлиенты, ПланыВидовХарактеристик.ВнешниеИсточники.Клиенты);
	
	Команда = Новый COMОбъект("ADODB.Command");
	Команда.ActiveConnection = Соединение;
	Команда.CommandType = 4;
	Команда.CommandText = "dbo.GetUserInfo";
	Parameter = Команда.CreateParameter("@Login", 202, 1, 256);
	Команда.Parameters.Append(Parameter);
	Parameter.Value = ОбщегоНазначения.ВыделитьЛогинИзДоменногоИмениВхода(Привилегированный.ПользовательОС());
	RS = Команда.Execute();
	Если Не RS.EOF() Тогда
		Возврат RS.Fields("Id").Value;
	Иначе
		ВызватьИсключение "Не удалось получить идентификатор пользователя";
	КонецЕсли;
	
КонецФункции

// Возвращает структуру, созданную на основе ОбъектXDTO или СписокXDTO
//
// Параметры:
//  Объект - ОбъектXDTO, СписокXDTO
//  ПараметрыПреобразования - Структура
// 
// Возвращаемое значение:
//  Структура
//
Функция СтруктураИзОбъекта(ОбъектXDTO, ПараметрыПреобразования = Неопределено) Экспорт
	
	Структура = Новый Структура;
	ТипОбъектаXDTO = ОбъектXDTO.Тип();
	
	Для Каждого Свойство Из ОбъектXDTO.Свойства() Цикл
		
		ИмяСвойства = Свойство.Имя;
		ЗначениеСвойства = ОбъектXDTO[ИмяСвойства];
		
		Если ТипЗнч(ЗначениеСвойства) = Тип("ОбъектXDTO") Тогда
			
			Структура.Вставить(ИмяСвойства, СтруктураИзОбъекта(ЗначениеСвойства, ПараметрыПреобразования));
			
		ИначеЕсли ТипЗнч(ЗначениеСвойства) = Тип("СписокXDTO") Тогда
			
			Структура.Вставить(ИмяСвойства, Новый Массив);
			Для Индекс = 0 По ЗначениеСвойства.Количество() - 1 Цикл
				
				ЭлементСписка = ЗначениеСвойства.Получить(Индекс);
				Если ТипЗнч(ЭлементСписка) = Тип("ОбъектXDTO") Тогда
					Структура[ИмяСвойства].Добавить(СтруктураИзОбъекта(ЭлементСписка, ПараметрыПреобразования));
				Иначе
					Структура[ИмяСвойства].Добавить(ЭлементСписка);
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Структура.Вставить(ИмяСвойства, ЗначениеСвойства);
			
			Если ПараметрыПреобразования <> Неопределено
				И ПараметрыПреобразования.НайтиИдентификаторы
				И Свойство.Тип = ПараметрыПреобразования.ТипUUID Тогда
				
				РезультатПоиска = ПараметрыПреобразования.ТипыИдентификаторов[ТипОбъектаXDTO];
				Если РезультатПоиска <> Неопределено
					И РезультатПоиска.ИмяПоля = ИмяСвойства Тогда
					ПараметрыПреобразования.Идентификаторы[РезультатПоиска.ИмяТаблицы].Вставить(ЗначениеСвойства, РезультатПоиска.ПустоеЗначение);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции
