
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Контрагент") Тогда
		АдресВремХранилищаКонтрагента = ПоместитьВоВременноеХранилище(Параметры.Контрагент);
		Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
			Если ЭлементОтбора.Представление = "Владелец" Тогда 
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.ПравоеЗначение = Параметры.Контрагент;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	КонтрагентОтбор = Неопределено;
	Если ЗначениеЗаполнено(АдресВремХранилищаКонтрагента) Тогда
		КонтрагентОтбор = ПолучитьИзВременногоХранилища(АдресВремХранилищаКонтрагента);
	КонецЕсли;
	Если ЗначениеЗаполнено(КонтрагентОтбор) Тогда
		ПараметрыСтр = Новый Структура("Контрагент", КонтрагентОтбор);
		ОткрытьФорму("РегистрСведений.СчетаДляВыплатыДоходов.ФормаЗаписи", ПараметрыСтр);
	Иначе
		ОткрытьФорму("РегистрСведений.СчетаДляВыплатыДоходов.ФормаЗаписи");
	КонецЕсли;
КонецПроцедуры
