// Возвращает массив с местами хранения для получения остатков ЦБ по услуге
//
// Параметры:
//  Услуга	 - СправочникСсылка.УслугиТарифногоПлана
// 
// Возвращаемое значение:
//  Массив - массив с местами хранения
//
Функция МестаХраненияДляПолученияОстатков(Услуга) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УслугиТарифногоПлана.МестоХранения1 КАК МестоХранения
	|ИЗ
	|	Справочник.УслугиТарифногоПлана КАК УслугиТарифногоПлана
	|ГДЕ
	|	УслугиТарифногоПлана.Ссылка = &Услуга
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УслугиТарифногоПланаОтборПоМХ.МестоХранения
	|ИЗ
	|	Справочник.УслугиТарифногоПлана.ОтборПоМХ КАК УслугиТарифногоПланаОтборПоМХ
	|ГДЕ
	|	УслугиТарифногоПланаОтборПоМХ.Ссылка = &Услуга";
	
	Запрос.УстановитьПараметр("Услуга", Услуга);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("МестоХранения");
	КонецЕсли;
	
КонецФункции

// Возвращает услугу тарифного плана по значению указанного реквизита
//
// Параметры:
//  ИмяРеквизита		 - Строка - Имя реквизита справочника
//  ЗначениеРеквизита	 - Произвольный - Значение реквизита справочника
//  Родитель			 - СправочникСсылка.УслугиТарифногоПлана - Папка поиска
//  ТарифныйПлан		 - СправочникСсылка.ТарифныеПланы - Тарифный план услуги
//  	Если значение Неопределено - выбирать услугу без привязки к тарифному плану
// 
// Возвращаемое значение:
//  СправочникСсылка.УслугиТарифногоПлана - найденная услуга
//
Функция УслугаТарифногоПланаПоРеквизиту(ИмяРеквизита, ЗначениеРеквизита, Родитель = Неопределено, ТарифныйПлан) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УслугиТарифногоПлана.Ссылка КАК Услуга
	|ИЗ
	|	Справочник.УслугиТарифногоПлана КАК УслугиТарифногоПлана
	|ГДЕ
	|	&ТарифныйПлан = НЕОПРЕДЕЛЕНО
	|	И (&Родитель = НЕОПРЕДЕЛЕНО
	|			ИЛИ УслугиТарифногоПлана.Родитель = &Родитель)
	|	И УслугиТарифногоПлана.Операция = &ЗначениеРеквизита
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТарифныеПланыУслугиТарифногоПлана.Услуга.Ссылка
	|ИЗ
	|	Справочник.ТарифныеПланы.УслугиТарифногоПлана КАК ТарифныеПланыУслугиТарифногоПлана
	|ГДЕ
	|	ТарифныеПланыУслугиТарифногоПлана.Ссылка = &ТарифныйПлан
	|	И (&Родитель = НЕОПРЕДЕЛЕНО
	|			ИЛИ ТарифныеПланыУслугиТарифногоПлана.Услуга.Родитель = &Родитель)
	|	И ТарифныеПланыУслугиТарифногоПлана.Услуга.Операция = &ЗначениеРеквизита";
	
	Запрос.УстановитьПараметр("ЗначениеРеквизита", ЗначениеРеквизита);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Запрос.УстановитьПараметр("ТарифныйПлан", ТарифныйПлан);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Операция", ИмяРеквизита);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Услуга;
		
	КонецЕсли;
	
	Возврат Справочники.УслугиТарифногоПлана.ПустаяСсылка();
	
КонецФункции