
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата							= ТекущаяДата();
		Объект.Инициатор					= Константы.ОрганизацияПоУмолчанию.Получить();
		Объект.Автор						= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВидКДПриИзменении(Элемент)
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура КарточкаКДПриИзменении(Элемент)
	ЗаполнитьРеквизитыУчастияВКДПоКарточкеНаСервере();
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаКлиенте
Процедура УправлениеОтображениемРеквизитов()
	
	ЭтоВидКДСобрания = ЭтоВидКДСобранияНаСервере();
	
	Элементы.ГруппаКДВыкуп.Видимость 				= НЕ ЭтоВидКДСобрания;
	Элементы.ОтветыНаВопросыКГолосованию.Видимость 	= ЭтоВидКДСобрания;	
	Элементы.Разделитель.Видимость 					= НЕ ЭтоВидКДСобрания;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ЭтоВидКДСобранияНаСервере()
	Возврат Документы.КорпоративноеДействие_Новый.ЭтоВидКДСобрания(Объект.ВидКД);
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыУчастияВКДПоКарточкеНаСервере()
	Объект.ВидКД 		= Объект.КарточкаКД.ВидКД;
	Объект.ЦеннаяБумага = Объект.КарточкаКД.ЦеннаяБумага1;
КонецПроцедуры

