#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

&Вместо("Проверить")
Процедура FO_LimitProfile_Проверить(Запрос, Параметры, Окружение)

	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПродолжитьВызов(Запрос, Параметры, Окружение);
	FO_LimitProfile_Замеры.Добавить("ПроверкаЛимитов.Проверить", ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&Вместо("ДеревоЗначенийПоСоставу")
Функция FO_LimitProfile_ДеревоЗначенийПоСоставу(Запрос, Запрещенные, Параметры)

	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Результат = ПродолжитьВызов(Запрос, Запрещенные, Параметры);
	FO_LimitProfile_Замеры.Добавить("ПроверкаЛимитов.ДеревоЗначенийПоСоставу", ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт);
	Возврат Результат;

КонецФункции

&Вместо("ДанныеОбработкиКвалификаторов")
Функция FO_LimitProfile_ДанныеОбработкиКвалификаторов(Запрос, Параметры)

	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Результат = ПродолжитьВызов(Запрос, Параметры);
	FO_LimitProfile_Замеры.Добавить("ПроверкаЛимитов.ДанныеОбработкиКвалификаторов", ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт);
	Возврат Результат;

КонецФункции

&Вместо("ОбработатьДерево")
Процедура FO_LimitProfile_ОбработатьДерево(Параметры, Дерево)

	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПродолжитьВызов(Параметры, Дерево);
	FO_LimitProfile_Замеры.Добавить("ПроверкаЛимитов.ОбработатьДерево", ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
