
Процедура ВыполнитьСоздание(Выборка) Экспорт
	
	ИмяСобытия = "СозданиеСчета306";
	Сообщение = РаботаСJSON.РезультатЧтенияJSON(Выборка.Сообщение);
	ТекстОшибки = "";
	Попытка
		MessageInfo = ОбменДаннымиКафка.ДанныеMessageInfo();
		ОбменДаннымиКафка.ПодготовитьMessageInfo(Сообщение.MessageInfo, MessageInfo, ИмяСобытия, ТекстОшибки);
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		MessageInfo.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		Возврат;
	КонецЕсли;
	
	Попытка
		Если Сообщение.Data.AccountType <> "BROK" Тогда
			ТекстОшибки = ТекстОшибки + Символы.ПС + "Тип счета не равен 'BROK'. Пропускаем запись счета.";
		КонецЕсли;
		ПроверитьData(Сообщение, ТекстОшибки);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ВызватьИсключение "Возникла ошибка чтения JSON";
		КонецЕсли;
		Data = Сообщение.Data;
		
		Клиент = Справочники.Контрагенты.КонтрагентПоКоду(Data.ContractNumber);
		Банк = Справочники.Банки.НайтиПоКоду(Data.Bik);
		Валюта = Справочники.Валюты.НайтиПоКоду(Data.CurrencyCode);
		
		ПолученныеДанные = Новый Структура();
		ПолученныеДанные.Вставить("Валюта", Валюта);
		ПолученныеДанные.Вставить("Банк", Банк);
		ПолученныеДанные.Вставить("Клиент", Клиент);
		
		ПроверитьПолученныеДанные(Data, ПолученныеДанные, ТекстОшибки);

		Владелец = Константы.ОрганизацияПоУмолчанию.Получить();
		ДатаОткрытия = ПрочитатьДатуJSON(Data.CreatedAt, ФорматДатыJSON.ISO);
		Если ЗначениеЗаполнено(Data.ClosedAt) Тогда
			ДатаЗакрытия = ПрочитатьДатуJSON(Data.ClosedAt, ФорматДатыJSON.ISO);
		Иначе
			ДатаЗакрытия = Дата(1, 1, 1);
		КонецЕсли;
	Исключение
		ТекстОшибки = ТекстОшибки + Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		MessageInfo.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		Возврат;
	КонецЕсли;
	
	ПроверенныйJSON = Новый Структура("MessageInfo, Data", MessageInfo, Data);
	ПодготовленныеДанные = ДанныеДляСозданиеСчета(Банк, Валюта, Владелец, ДатаЗакрытия, ДатаОткрытия, Клиент, Data.AccountNumber);
	
	НачатьТранзакцию();
	Попытка
		СоздатьСчет306(ПроверенныйJSON, ПодготовленныеДанные, ТекстОшибки);
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗавершитьОбработку(Выборка.ВнешнийИсточник, Выборка.Идентификатор);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ТекстОшибки + Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		MessageInfo.Вставить("ОписаниеОшибки", ОписаниеОшибки);
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
	КонецПопытки;
	
КонецПроцедуры

Функция ДанныеДляСозданиеСчета(Банк, Валюта, Владелец, ДатаЗакрытия, ДатаОткрытия, Клиент, НомерСчета)
	
	ДанныеБанка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Банк, "Наименование, Город");
	ТекстКорреспондента = ТекстКорреспондентаВСчете(Владелец, ДанныеБанка, НомерСчета);
	
	ПодготовленныеДанные = Новый Структура;
	
	ПодготовленныеДанные.Вставить("Банк", Банк);
	ПодготовленныеДанные.Вставить("Клиент", Клиент);
	ПодготовленныеДанные.Вставить("Валюта", Валюта);
	ПодготовленныеДанные.Вставить("Владелец", Владелец);
	ПодготовленныеДанные.Вставить("ДанныеБанка", ДанныеБанка);
	ПодготовленныеДанные.Вставить("ДатаЗакрытия", ДатаЗакрытия);
	ПодготовленныеДанные.Вставить("ДатаОткрытия", ДатаОткрытия);
	ПодготовленныеДанные.Вставить("ТекстКорреспондента", ТекстКорреспондента);
	Возврат ПодготовленныеДанные;

КонецФункции

Процедура СоздатьСчет306(ДанныеИзJSON, ПодготовленныеДанные, ТекстОшибки)
	
	MessageInfo = ДанныеИзJSON.MessageInfo;
	Data = ДанныеИзJSON.Data;
	Банк = ПодготовленныеДанные.Банк;
	ДанныеБанка = ПодготовленныеДанные.ДанныеБанка;
	Валюта = ПодготовленныеДанные.Валюта;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанковскиеСчета.Ссылка КАК СчетСсылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	НЕ БанковскиеСчета.ПометкаУдаления
		|	И БанковскиеСчета.НомерСчета = &НомерСчета
		|	И БанковскиеСчета.Банк = &Банк";
	
	Запрос.УстановитьПараметр("Банк", Банк);
	Запрос.УстановитьПараметр("НомерСчета", Data.AccountNumber);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Если Не РезультатЗапроса.Пустой() Тогда
		Если НРег(MessageInfo.ActionType) = "ins" Тогда
			СчетСсылка = ВыборкаДетальныеЗаписи.СчетСсылка;
			ТекстОшибки = ТекстОшибки + Символы.ПС
				+ СтрШаблон("Регистрируемый счет %1 банка %2 уже зарегистрирован в Депозитарии", Data.AccountNumber, ДанныеБанка.Наименование);
			ВызватьИсключение ТекстОшибки;
		ИначеЕсли НРег(MessageInfo.ActionType) = "upd" Тогда
			СчетОбъект = ВыборкаДетальныеЗаписи.СчетСсылка.ПолучитьОбъект();
		Иначе
			ТекстОшибки = ТекстОшибки + Символы.ПС
				+ СтрШаблон("Не удалось определить тип операции по ActionType: %1", MessageInfo.ActionType);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	Иначе
		СчетОбъект = Справочники.БанковскиеСчета.СоздатьЭлемент();
	КонецЕсли;
	
	НаименованиеВалюты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Валюта, "Наименование");
	ИмяВалютыДляНаименованияСчета = ?(Data.CurrencyCode = "643" Или Data.CurrencyCode = "810", " ", "_(" + НаименованиеВалюты + ")");
	
	СчетОбъект.Банк = Банк;
	СчетОбъект.ВалютаДенежныхСредств = Валюта;
	СчетОбъект.ВидСчета = "Иное";
	СчетОбъект.Владелец = ПодготовленныеДанные.Владелец;
	СчетОбъект.Наименование = СокрЛП(ДанныеБанка.Наименование) + " БС" + ИмяВалютыДляНаименованияСчета
		+ " (" + Прав(Data.AccountNumber, 6) + ")";
	СчетОбъект.НомерСчета = Data.AccountNumber;
	СчетОбъект.ТипНазначения = Перечисления.ТипыНазначенияБанковскихСчетов.Брокерский;
	СчетОбъект.ЦельОткрытияСчета = Перечисления.ЦельОткрытияСчета0420409.БрокерскийСчет;
	СчетОбъект.ДатаОткрытия = ПодготовленныеДанные.ДатаОткрытия;
	СчетОбъект.ДатаЗакрытия = ПодготовленныеДанные.ДатаЗакрытия;
	СчетОбъект.ТекстНазначения = "";
	СчетОбъект.ТекстКорреспондента = ПодготовленныеДанные.ТекстКорреспондента;
	
	Попытка
		СчетОбъект.Записать();
		СтатусСчета = БСАктивен(Data.Status);
		СоздатьЗаписьРСБанковскиеСчета(ПодготовленныеДанные, СчетОбъект, СтатусСчета);
	Исключение
		ТекстОшибки = ТекстОшибки + Символы.ПС
			+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры

Процедура ПроверитьData(ДанныеИзJSON, ТекстОшибки)
	
	ОбязательныеПоля = ТаблицаОбязательныхПолей();
	Для Каждого СвойствоДокумента Из ДанныеИзJSON.Data Цикл
		ОбязательноеПоле = ОбязательныеПоля.Найти(СвойствоДокумента.Ключ);
		Если ОбязательноеПоле <> Неопределено Тогда
			ОбязательноеПоле.Найдена = Истина;
			Если Не ЗначениеЗаполнено(СвойствоДокумента.Значение) Тогда
				ТекстОшибки = ?(ЗначениеЗаполнено(ТекстОшибки), ТекстОшибки + Символы.ПС, "")
					+ СтрШаблон("Поле %1 не заполнено в JSON.", СвойствоДокумента.Ключ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	РезультатПоискаОбязательныхПолей = ОбязательныеПоля.НайтиСтроки(Новый Структура("Найдена", Ложь));
	Для Каждого Поле Из РезультатПоискаОбязательныхПолей Цикл
		ТекстОшибки = ?(ЗначениеЗаполнено(ТекстОшибки), ТекстОшибки + Символы.ПС, "")
			+ СтрШаблон("Поле %1 не найдено в JSON.", Поле.ИмяКолонки);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьПолученныеДанные(ДанныеСчета, ПолученныеДанные, ТекстОшибки)
	
	Если Не ЗначениеЗаполнено(ПолученныеДанные.Банк) Тогда
		ДанныеБанка = СтрШаблон("Bik: %1, SwiftBik: %2", ДанныеСчета.Bik, ДанныеСчета.SwiftBik);
		ЗаполнитьТекстОшибки(ДанныеБанка, "Банк", ТекстОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПолученныеДанные.Валюта) Тогда
		ЗаполнитьТекстОшибки(ДанныеСчета.CurrencyCode, "Валюта", ТекстОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПолученныеДанные.Клиент) Тогда
		ЗаполнитьТекстОшибки(ДанныеСчета.ContractNumber, "Клиент по договору", ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТекстОшибки(ЗначениеПоляJSON, ИмяРеквизита, ТекстОшибки)
	
	ТекстОшибки = ?(ЗначениеЗаполнено(ТекстОшибки), ТекстОшибки + Символы.ПС, "")
		+ СтрШаблон("%1 с кодом %2 не найден.", ИмяРеквизита, ЗначениеПоляJSON);
		
КонецПроцедуры

Функция БСАктивен(СтатусВКафка)

	Если СтатусВКафка = "BLOCK" Или СтатусВКафка = "CLOSED" Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

Процедура СоздатьЗаписьРСБанковскиеСчета(ПодготовленныеДанные, СчетОбъект, СтатусСчета)
	
	Банк = ПодготовленныеДанные.Банк;
	Валюта = ПодготовленныеДанные.Валюта;
	Клиент = ПодготовленныеДанные.Клиент;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	НаборЗаписейБС = РегистрыСведений.БрокерскиеСчета.СоздатьНаборЗаписей();
	НаборЗаписейБС.Отбор.Банк.Установить(Банк);
	НаборЗаписейБС.Отбор.Валюта.Установить(Валюта);
	НаборЗаписейБС.Отбор.Клиент.Установить(Клиент);
	НаборЗаписейБС.Отбор.Период.Установить(ТекущаяДата);
	
	НоваяЗапись = НаборЗаписейБС.Добавить();
	НоваяЗапись.Банк = Банк;
	НоваяЗапись.Биржа = Справочники.Биржи.Внебирж;
	НоваяЗапись.Клиент = Клиент;
	НоваяЗапись.Валюта = Валюта;
	НоваяЗапись.ТипСчета = СчетОбъект.ТипНазначения;
	НоваяЗапись.Счет = СчетОбъект.Ссылка;
	НоваяЗапись.Период = ТекущаяДата;
	НоваяЗапись.ФлагАктивности = СтатусСчета;
	НаборЗаписейБС.Записать();

КонецПроцедуры

Функция ТаблицаОбязательныхПолей()
	
	ОбязательныеПоля = Новый ТаблицаЗначений;
	ОбязательныеПоля.Колонки.Добавить("ИмяКолонки", Новый ОписаниеТипов("Строка"));
	ОбязательныеПоля.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Булево"));
	ДобавитьНовоеОбязательноеПоле(ОбязательныеПоля, "ContractId");
	ДобавитьНовоеОбязательноеПоле(ОбязательныеПоля, "CrmClientId");
	ДобавитьНовоеОбязательноеПоле(ОбязательныеПоля, "CurrencyCode");
	ДобавитьНовоеОбязательноеПоле(ОбязательныеПоля, "AccountType");
	ДобавитьНовоеОбязательноеПоле(ОбязательныеПоля, "AccountNumber");
	ДобавитьНовоеОбязательноеПоле(ОбязательныеПоля, "CreatedAt");
	ДобавитьНовоеОбязательноеПоле(ОбязательныеПоля, "Status");
	Возврат ОбязательныеПоля;

КонецФункции

Процедура ДобавитьНовоеОбязательноеПоле(ТЗ, ИмяКолонки)
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.ИмяКолонки = ИмяКолонки;
КонецПроцедуры

Функция ТекстКорреспондентаВСчете(Владелец, ДанныеБанка, НомерСчета, БанкДляРасчетов = "")
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Владелец) Тогда
		Возврат "";
	КонецЕсли;
	
	СтрКорреспондента = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "НаименованиеПолное"));
	
	Если НЕ ПустаяСтрока(БанкДляРасчетов) Тогда
		СтрКорреспондента = СтрКорреспондента + " р/с " + НомерСчета
			+ " в " + ДанныеБанка.Наименование + " " + ДанныеБанка.Город;
	КонецЕсли;	
	
	Возврат СтрКорреспондента;
КонецФункции
