
// Возвращает учетную запись из настройки обмена или учетную запись внешнего источника, если установлен соответствующий флажок.
//
// Параметры:
//  НастройкаОбмена	 - СправочникСсылка.НастройкиОбменаДанными, Коллекция - Настройка обмена по эл.почте, для которой нужно получить актуальную учетную запись.
// 
// Возвращаемое значение:
//  СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - актуальная учетная запись эл.почты
//
Функция АктуальнаяУчетнаяЗаписьПриемаОтправкиСообщений(НастройкаОбмена) Экспорт
	УчетнаяЗапись = АктуальнаяУчетнаяЗаписьПриемаОтправкиСообщенийЛогика(НастройкаОбмена);
	
	Возврат УчетнаяЗапись;
КонецФункции

Функция АктуальнаяУчетнаяЗаписьПриемаОтправкиСообщенийЛогика(НастройкаОбмена) Экспорт
	Если (
			ТипЗнч(НастройкаОбмена) = Тип("СправочникСсылка.НастройкиОбменаДанными") 
			ИЛИ ТипЗнч(НастройкаОбмена) = Тип("СправочникОбъект.НастройкиОбменаДанными")
			ИЛИ (ТипЗнч(НастройкаОбмена) = Тип("Структура") 
					И НастройкаОбмена.Свойство("ИспользоватьУчетнуюЗаписьСообщенийВнешнегоИсточника")
					И НастройкаОбмена.Свойство("ВнешнийИсточникПриемаОтправкиСообщений")
				)
		 )
		 И НастройкаОбмена.ИспользоватьУчетнуюЗаписьСообщенийВнешнегоИсточника Тогда
		НастройкиВнешнегоИсточника = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(НастройкаОбмена.ВнешнийИсточникПриемаОтправкиСообщений).Настройка;
		Если ЗначениеЗаполнено(НастройкиВнешнегоИсточника) Тогда
			Возврат НастройкиВнешнегоИсточника.УчетнаяЗаписьПриемаОтправкиСообщений;
		Иначе
			ОписаниеОшибки = "Не заполнены параметры внешнего источника '" + НастройкаОбмена.ВнешнийИсточникПриемаОтправкиСообщений + "'";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;
	Иначе
		Возврат НастройкаОбмена.УчетнаяЗаписьПриемаОтправкиСообщений;
	КонецЕсли;
КонецФункции