
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
//#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
	
	Макет = ЭтотОбъект.ПолучитьМакет("Отчет");
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	
    ОбластьМакета.Параметры.Организация = Депозитарий.НаименованиеПолное;
	ДанныеЛицензии = ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Депозитарий);	 
	ОбластьМакета.Параметры.ЛицензияНомер = "Лицензия № "+ДанныеЛицензии.НомерЛицензии + " от ";
	ОбластьМакета.Параметры.ЛицензияДата = "" + ДанныеЛицензии.ДатаЛицензии + " г. ";
	
	ДатаВОтчет = ?(ЗначениеЗаполнено(ЭтотОбъект.ДатаОтчета), ЭтотОбъект.ДатаОтчета, ТекущаяДата());
    ОбластьМакета.Параметры.ДатаОтчета 	 = Формат(ДатаВОтчет,"ДЛФ=DD");
    ОбластьМакета.Параметры.ДатаТекущая   = Формат(ТекущаяДата(),"ДЛФ=DD");

	ДокументРезультат.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ДокументРезультат.Вывести(ОбластьМакета);
	
	ТаблицаОтчета = ТаблицаОтчета();
	
	Для каждого СтрокаТаблицы Из ТаблицаОтчета Цикл		
		ОбластьМакета = Макет.ПолучитьОбласть("Детали");
		ОбластьМакета.Параметры.ЦБ = СтрокаТаблицы.ЦБ;
		ОбластьМакета.Параметры.ISIN = СтрокаТаблицы.ЦБISIN;
	    ОбластьМакета.Параметры.ОстатокПоАктиву = СтрокаТаблицы.КоличествоОстаток;
	    ОбластьМакета.Параметры.ОстатокПоПассиву = СтрокаТаблицы.КоличествоОстаток;
		
		ДокументРезультат.Вывести(ОбластьМакета);		
	КонецЦикла; 
	
	ИтогоОстаток = ТаблицаОтчета.Итог("КоличествоОстаток");
	
	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоПодвал");
    ОбластьМакета.Параметры.ОстатокПоАктиву = ИтогоОстаток;
    ОбластьМакета.Параметры.ОстатокПоПассиву = ИтогоОстаток;	
	ДокументРезультат.Вывести(ОбластьМакета);	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	ЭтотОбъект.Депозитарий = Константы.ОрганизацияПоУмолчанию.Получить();
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Депозитарий) тогда
		Сообщить("Не выбрано значение организации, используемое по умолчанию!!!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

//#КонецОбласти 

//#Область СлужебныеПроцедурыИФункции

Функция ТаблицаОтчета()
	
	Результат = Новый ТаблицаЗначений;
	
	Схема = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Если ЗначениеЗаполнено(ЭтотОбъект.ДатаОтчета) Тогда
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", КонецДня(ЭтотОбъект.ДатаОтчета));
	КонецЕсли; 
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, ,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцВывода.УстановитьОбъект(Результат);
	ПроцВывода.Вывести(ПроцКомпоновки);
	 
	Возврат Результат;
	
КонецФункции
 
//#КонецОбласти 

#КонецЕсли

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
