
&НаКлиенте
Процедура Установить(Команда)
	
	Заголовок = "";
	ЗначенияПараметров = УстановитьПараметры(Заголовок);
	ОповеститьОВыборе(новый Структура("Значения,ЗаголовокНастроек", ЗначенияПараметров, Заголовок));
	
КонецПроцедуры

&НаСервере
Функция УстановитьПараметры(Заголовок)  
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектОбработки.УстановитьПараметры(Заголовок);
		
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.НастройкиАлгоритма)=Тип("Структура") Тогда
		Настройки = Параметры.НастройкиАлгоритма;
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.УстановитьПользовательскиеНастройки(Настройки);
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	КонецЕсли;
	
КонецПроцедуры     

&НаСервере
Процедура НастройкиПоУмолчаниюНаСервере()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.НастройкиПоУмолчанию(Объект);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоУмолчанию(Команда)
	НастройкиПоУмолчаниюНаСервере();
КонецПроцедуры

