
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Файлы(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Ответ	= Вопрос("Просмотр списка файлов и их редактирование доступно только для записанных элементов!
						 |
						 |Записать элемент и открыть список?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Записать();
		КонецЕсли;
	КонецЕсли;

	Форма = ПолучитьФорму("Справочник.Файлы.ФормаСписка");
	ОтборФайлов	= Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборФайлов.ЛевоеЗначение		= Форма.Список.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Объект").Поле;
	ОтборФайлов.ПравоеЗначение		= Объект.Ссылка;
	ОтборФайлов.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Форма.Заголовок					= Объект.Ссылка;
	Форма.Открыть();

КонецПроцедуры

