&наСервере
Процедура УправлениеРеквизитамиФормыСервер()
	Элементы.РедактироватьСписокЦБ.Видимость	= Отчет.ОтчетПоСписку;
	Элементы.ЦеннаяБумага.Видимость				= Не Отчет.ОтчетПоСписку;
	Элементы.ЦенныеБумагиСписком.Пометка		= Отчет.ОтчетПоСписку;
	Элементы.ФормаСформироватьОтчет.Доступность	= (Отчет.ЦенныеБумаги.Количество()>0);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Отчет.ЦенныеБумаги.Количество()>0 Тогда
		ЦеннаяБумага	= Отчет.ЦенныеБумаги.Получить(0).Значение;
	КонецЕсли;	
	УправлениеРеквизитамиФормыСервер();
	Если Отчет.Автоформирование Тогда
		СформироватьОтчетСервер();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиСписком(Команда)
	Отчет.ОтчетПоСписку	= Не Отчет.ОтчетПоСписку;
	Если Не Отчет.ОтчетПоСписку Тогда
		ЦеннаяБумага	= ПредопределенноеЗначение("Справочник.ЦенныеБумаги.ПустаяСсылка");
		Отчет.ЦенныеБумаги.Очистить();
	КонецЕсли;
	УправлениеРеквизитамиФормыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент)
	Отчет.ЦенныеБумаги.Очистить();
	Отчет.ЦенныеБумаги.Добавить(ЦеннаяБумага);	
	УправлениеРеквизитамиФормыСервер();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСписокЦБ(Команда)
	ПараметрыПодбора	= Новый Структура("СписокЦБ", Отчет.ЦенныеБумаги.ВыгрузитьЗначения());
	Форма				= ПолучитьФорму("Отчет.АнкетаВыпускаЦБ.Форма.ФормаПодбораСпискаЦБ", ПараметрыПодбора, ЭтаФорма, ЭтаФорма.КлючУникальности);
	СписокВозврата		= Форма.ОткрытьМодально();
	
	Если СписокВозврата <> Неопределено Тогда
		 Отчет.ЦенныеБумаги.ЗагрузитьЗначения(СписокВозврата);
	КонецЕсли;	
	УправлениеРеквизитамиФормыСервер();
КонецПроцедуры

&наСервере
Процедура СформироватьОтчетСервер()
	ОтчетОбъект	= РеквизитФормыВЗначение("Отчет");
	Результат	= ОтчетОбъект.СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетСервер();
КонецПроцедуры
