
// Получить место обращаемости ЦБ на дату
// Параметры:
//  ЦеннаяБумага - ЦеннаяБумага - Ценная бумага, по которой получаем место обращаемости
//  Дата - Дата - Дата на которую выбирается значение
// Возвращаемое значение:
//   - Ссылка - Место Обращаемости
Функция ПолучитьМестоОбращаемостиНаДату(ЦеннаяБумага, Дата = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ЦеннаяБумага) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбращаемостьЦБСрезПоследних.МестоОбращаемости КАК МестоОбращаемости
	|ИЗ
	|	РегистрСведений.ОбращаемостьЦБ.СрезПоследних(&Дата, ЦеннаяБумага = &ЦеннаяБумага) КАК ОбращаемостьЦБСрезПоследних";
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	Запрос.УстановитьПараметр("Дата", Дата);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		МестоОбращаемости = Выборка.МестоОбращаемости;
	Иначе
		МестоОбращаемости = Неопределено;
	КонецЕсли;
	
	Возврат МестоОбращаемости;
	
КонецФункции