#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		// Должно обязательно отработать в обработчике даже в режиме загрузки, чтобы изменения были выгружены в бэкофис (BQ)
		РегистрацияИзмененийДляВыгрузки.ЗапомнитьОбъектыИзУдаляемыхЗаписей(ЭтотОбъект, Отказ, Замещение, "Объект");
		
		Возврат;
	КонецЕсли;
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если ОбщегоНазначения.ЗначениеНеЗаполнено(Запись.Объект) Тогда
			Отказ = Истина;
			СтрокаОтказа = "Не заполнен объект.";
			Продолжить;
		КонецЕсли; 
		Если Запись.Объект.ЭтоГруппа Тогда
			Отказ = Истина;
			СтрокаОтказа = "Нельзя использовать группу в качестве объекта контактной информации.";
			Прервать;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.Период) Тогда
			Запись.Период	= Дата(2000, 1, 1);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Сообщить(СтрокаОтказа);
	КонецЕсли;
		
	РегистрацияИзмененийДляВыгрузки.ЗапомнитьОбъектыИзУдаляемыхЗаписей(ЭтотОбъект, Отказ, Замещение, "Объект");
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		// Должно обязательно отработать последним в обработчике
		РегистрацияИзмененийДляВыгрузки.ОтметитьИзмененияВРегистреСведений(ЭтотОбъект, Отказ, Замещение, "Объект");
		
		Возврат;
	КонецЕсли;
	
	Если Не (ДополнительныеСвойства.Свойство("НеПерезаполнятьРегионДляОтчетов") И ДополнительныеСвойства.НеПерезаполнятьРегионДляОтчетов) Тогда
		Для каждого Запись Из ЭтотОбъект Цикл
			Если Справочники.КлассификаторРегионов.МожноОпределитьРегионПоКонтактнойИнформации(Запись) Тогда
				Справочники.КлассификаторРегионов.УстановитьРегионДляКонтрагентов(Запись.Объект);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Должно обязательно отработать последним в обработчике
	РегистрацияИзмененийДляВыгрузки.ОтметитьИзмененияВРегистреСведений(ЭтотОбъект, Отказ, Замещение, "Объект");
КонецПроцедуры

#КонецОбласти
