
Функция ПоручениеВыгружено(Поручение) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТабЧастьПоручения.Поручение) КАК КоличествоВыгруженныхПоручений
	|ИЗ
	|	Документ.НеттоПоручение.Поручения КАК ТабЧастьПоручения
	|ГДЕ
	|	ТабЧастьПоручения.Ссылка.Проведен
	|	И ТабЧастьПоручения.Поручение = &Поручение");
	Запрос.УстановитьПараметр("Поручение", Поручение);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.КоличествоВыгруженныхПоручений > 0;
КонецФункции

Функция РеквизитыВыгрузки(Поручение) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Поручения.Ссылка КАК Ссылка,
	|	Поручения.Ссылка.Номер КАК ИсходящийНомер,
	|	Поручения.Ссылка.РегистрационныйНомер КАК РегистрационныйНомер
	|ИЗ
	|	Документ.НеттоПоручение.Поручения КАК Поручения
	|ГДЕ
	|	Поручения.Ссылка.Проведен
	|	И Поручения.Поручение = &Поручение");
	Запрос.УстановитьПараметр("Поручение", Поручение);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция НовыйДокумент(Поручение, ДатаВыгрузки, ИсходящийНомер, РегистрационныйНомер, Исполнитель) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Поручение.ВидОперацииД КАК ВидОперации,
	|	Поручение.ДатаИсполненияПоручения КАК ДатаИсполнения,
	|	Поручение.ДатаСделки КАК ДатаСделки,
	|	Поручение.ПланируемаяДатаРасчетов КАК ПланируемаяДатаРасчетов,
	|	Поручение.КодОтчетаНРД КАК КодОтчетаВышестоящегоДепозитария,
	|	Поручение.Референс КАК Референс,
	|	Поручение.МХДепонента КАК МестоХранения,
	|	Поручение.СчетДепоМХ КАК СчетДепоМХ,
	|	Поручение.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	Поручение.Контрагент КАК Контрагент,
	|	Поручение.СчетДепоКонтрагента КАК СчетДепоКонтрагента,
	|	Поручение.РазделСчетаДепоКонтрагента КАК РазделСчетаДепоКонтрагента,
	|	Поручение.МХКонтрагент КАК МестоХраненияКонтрагента,
	|	Поручение.ЦБ КАК ЦеннаяБумага,
	|	Поручение.КоличествоЦБ КАК Количество,
	|	Поручение.СуммаСделки КАК Сумма,
	|	Поручение.БанковскийСчет КАК БанковскийСчет,
	|	Поручение.НомерПула КАК НомерПула,
	|	Поручение.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.Ссылка = &Поручение");
	Запрос.УстановитьПараметр("Поручение", Поручение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект = Документы.НеттоПоручение.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(ДокументОбъект, Выборка);
		ДокументОбъект.Дата					= ДатаВыгрузки;
		ДокументОбъект.РегистрационныйНомер	= РегистрационныйНомер;
		ДокументОбъект.Исполнитель			= Исполнитель;
		
		НоваяСтрока = ДокументОбъект.Поручения.Добавить();
		НоваяСтрока.Поручение = Поручение;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Возврат ДокументОбъект.Ссылка;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция НовыйНомерВТечениеДня(ДатаДня) Экспорт
	СимволРазделителя = "-";
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Документ.Номер КАК Номер
	|ИЗ
	|	Документ.НеттоПоручение КАК Документ
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Документ.Дата, ДЕНЬ) = &ДатаДня");
	Запрос.УстановитьПараметр("ДатаДня", НачалоДня(ДатаДня));
	Выборка = Запрос.Выполнить().Выбрать();
	МаксимальныйНомер = 0;
	Сообщение = Новый СообщениеПользователю;	
	Пока Выборка.Следующий() Цикл
		// Формат номера документа: <код депонента><символ разделителя><номер в течение дня>
		ПозицияРазделителя = Найти(Выборка.Номер, СимволРазделителя);
		Если ПозицияРазделителя = 0 Тогда
			Сообщение.Текст = "Несоответствие формату: номер документа """ + Выборка.Номер
				+ """ не содержит символа-разделителя """ + СимволРазделителя + """";
			Сообщение.Сообщить();
			Возврат 0;
		КонецЕсли;
		
		Попытка
			ТекущийНомер = Число(Сред(Выборка.Номер, ПозицияРазделителя+1));
		Исключение
			Сообщение.Текст = "Не удалось преобразовать к числу порядковый номер из номера документа """
				+ Выборка.Номер + """ за " + Формат(ДатаДня, "ДЛФ=Д");
			Сообщение.Сообщить();
			Возврат 0;
		КонецПопытки;
		
		Если ТекущийНомер > МаксимальныйНомер Тогда
			МаксимальныйНомер = ТекущийНомер; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат МаксимальныйНомер + 1;
КонецФункции
