
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Номер) Или Дата <> Ссылка.Дата И Не РучнойВвод Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Если Не ЗначениеЗаполнено(Автор) Тогда
			Автор	= ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		Изменил	= Справочники.Пользователи.ПустаяСсылка();
	Иначе
		Изменил	= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Или Ссылка.Количество <> Количество И Не ЭтоНовый())
		И РегистрыСведений.ДокументыВыгруженныеВЛуч.ДокументВыгружен(Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ был выгружен в Луч, его нельзя менять!");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидПоручения) Тогда
		ВидПоручения = ВидПоручения();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Если РучнойВвод Тогда
		Возврат;
	КонецЕсли;
	
	Префикс 				= "Д";
	Номер					= НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДатаВвода = Константы.ДатаВводаЧастичногоИсполненияИнвентарныхПоручений.Получить();
	Если ЗначениеЗаполнено(ДатаВвода) И Дата >= ДатаВвода Тогда
		ДвиженияПоРегиструИсполнениеПоручения(Отказ);
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Поручения Цикл
		Поручение = Строка.Поручение.ПолучитьОбъект();
		Поручение.КодОтчетаНРД								= КодОтчетаВышестоящегоДепозитария;
		Поручение.ДатаИсполненияПоручения					= ДатаИсполнения;
		Поручение.ДатаИсполненияПорученияВДепозитарииМХ		= ДатаИсполнения;
		Поручение.ДатаИсполненияПорученияВМестеРасчетов 	= Макс(ДатаИсполнения - 3600, НачалоДня(ДатаИсполнения));
		Если ДополнительныеСвойства.Свойство("Комментарий") Тогда
			Поручение.Комментарий = Поручение.Комментарий + ?(ЗначениеЗаполнено(Поручение.Комментарий), " | ", "") + ДополнительныеСвойства.Комментарий;
		КонецЕсли;
		РежимЗаписи = ?(Поручение.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
		Попытка
			Поручение.Записать(РежимЗаписи);
		Исключение
			ТекстСообщения = "Не удалось " + ?(Поручение.Проведен, "провести", "записать")
				+ " документ " + Поручение + ". " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция ВидПоручения()
	
	Если ВидОперации = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
		Возврат Справочники.ВидыИнвентарныхПоручений.П20;
	ИначеЕсли ВидОперации = Справочники.ВидыОпераций.Перемещение Тогда
		Возврат Справочники.ВидыИнвентарныхПоручений.П10;	
	ИначеЕсли ВидОперации = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо Тогда
		Возврат Справочники.ВидыИнвентарныхПоручений.П90;		
	Иначе
		Если СчетДепоКонтрагента.ПризнакСчетаДепо = Перечисления.ПризнакиСчетаДепо.СчетКонтрагента ИЛИ СчетДепоКонтрагента = Справочники.СчетаДепо.ПустаяСсылка() Тогда
			Если МестоХраненияКонтрагента = Константы.МестоХраненияПоУмолчанию.Получить() Тогда
				Если ВидОперации = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
					Если Сумма = 0 Тогда
						Возврат Справочники.ВидыИнвентарныхПоручений.П16;		
					Иначе
						Возврат Справочники.ВидыИнвентарныхПоручений.П19_0;		
					КонецЕсли; 
				ИначеЕсли ВидОперации = Справочники.ВидыОпераций.Депонирование Тогда
					Если Сумма = 0 Тогда
						Возврат Справочники.ВидыИнвентарныхПоручений.П16_1;		
					Иначе
						Возврат Справочники.ВидыИнвентарныхПоручений.П19_1;		
					КонецЕсли; 	
				КонецЕсли; 
			Иначе
				Если ВидОперации = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
					Возврат Справочники.ВидыИнвентарныхПоручений.П36;
				ИначеЕсли ВидОперации = Справочники.ВидыОпераций.Депонирование Тогда
					Возврат Справочники.ВидыИнвентарныхПоручений.П37;	
				КонецЕсли;	
			КонецЕсли; 
		Иначе
			
		КонецЕсли;	
	КонецЕсли; 
	
	Возврат Справочники.ВидыИнвентарныхПоручений.ПустаяСсылка();
КонецФункции // ВидПоручения()

Процедура ПриКопировании(ОбъектКопирования)
	Проверено = Ложь;
КонецПроцедуры

Процедура ДвиженияПоРегиструИсполнениеПоручения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НеттоПоручениеПоручения.Поручение.ВидОперацииД = &Зачисление
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА НеттоПоручениеПоручения.Поручение.ВидОперацииД = &Списание
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВидДвижения,
	|	НеттоПоручениеПоручения.Поручение.Ссылка КАК Поручение,
	|	НеттоПоручениеПоручения.Ссылка КАК НеттоПоручение,
	|	НеттоПоручениеПоручения.Ссылка.Дата КАК Период,
	|	НеттоПоручениеПоручения.Поручение.КоличествоЦБ КАК Количество
	|ИЗ
	|	Документ.НеттоПоручение.Поручения КАК НеттоПоручениеПоручения
	|ГДЕ
	|	НеттоПоручениеПоручения.Ссылка = &НеттоПоручение";
	Запрос.УстановитьПараметр("Зачисление", Справочники.ВидыОпераций.Депонирование);
	Запрос.УстановитьПараметр("Списание", Справочники.ВидыОпераций.СнятиеСДепонирования);
	Запрос.УстановитьПараметр("НеттоПоручение", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Движения.ИсполнениеПоручения.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидДвижения = Неопределено Тогда
			ЗаписьЖурналаРегистрации("Проведение нетто-поручения", УровеньЖурналаРегистрации.Ошибка,, Выборка.Поручение,
				"Ожидается поручение с видом операции Депонирование/СнятиеСДепонирования");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Движение = Движения.ИсполнениеПоручения.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	КонецЦикла;
			
КонецПроцедуры