
#Область ПрограммныйИнтерфейс

// Процедура - УстановитьФорматыЯчеекВФайлеXLSX,
// Для небольших файлов (до 1000 строк и 30 колонок)
// Устанавливает форматы ячеек(NumberFormat) в указанном файле XLSX
// Могут быть установлены следующие форматы согласно документации MSDN:
// 	Основной 				- 0
// 	Челое число 			- 1
// 	Десятичное число(0.00) 	- 2
// 	"#,##0"  				- 3;
// 	"#,##0.00"  			- 4;
// 	"0%"  					- 9;
// 	"0.00%"  				- 10;
// 	"0.00E+00"  			- 11;
// 	"# ?/?"  				- 12;
// 	"# ??/??"  				- 13;
// 	"mm-dd-yy"  			- 14;
// 	"d-mmm-yy"  			- 15;
// 	"d-mmm"  				- 16;
// 	"mmm-yy"  				- 17;
// 	"h mm AM/PM"  			- 18;
// 	"h mm ss AM/PM"  		- 19;
// 	"h mm"  				- 20;
// 	"h mm ss"  				- 21;
// 	"m/d/yy h mm"  			- 22;
// 	"#,##0 ;(#,##0"  		- 37;
// 	"#,##0 ;[Red](#,##0"	- 38;
// 	"#,##0.00;#,##0.00"		- 39;
// 	"#,##0.00;[Red](#,#"	- 40;
// 	"mm ss"  				- 45;
// 	"[h] mm ss"  			- 46;
// 	"mmss.0"  				- 47;
// 	"##0.0"  				- 48;
// 	Текстовый 				- 49;
// Некоторые форматы зависят от региональных настроек ОС.
// Параметры:
//  ИмяФайла	 - Строка		 - полный путь к XLSX файлу в котором нужно установить форматы ячеек
//  ФорматыЯчеек - Соответствие	 - соответствие адресов ячеек форматам.
//		При этом, ключ элемента коллекции является адресом ячейки, а значение ее форматом.
//		Адрес может быть указан в виде R1C1 или A1. Указание диапазона ячеек не поддерживается.
//		Формат может быть указан в виде числа, в соответствии с таблицей выше, или являться типом, Тип("Строка"), Тип("Число"), Тип("Дата").
//		Например, для того что бы установить текстовый формат в ячейке:
//			Соответствие.Вставить("R1C1",49) 
//		или
//			Соответствие.Вставить("A1",49).
//		или
//			Соответствие.Вставить("R1C1",Тип("Строка"))
Процедура УстановитьФорматыЯчеекВФайлеXLSX(ИмяФайла, ФорматыЯчеек) Экспорт
	Перем РаспакованныеФайлы;
	
	ТипФайла = "xlsx";
	
	ФорматыЯчеекЛиста = СоответствиеФорматовЯчеекЛиста(ФорматыЯчеек);
	
	РазобратьФайлВКаталогХМЛ(ИмяФайла, ТипФайла, РаспакованныеФайлы);
	Стили = ДокументДОМИзХМЛ(РаспакованныеФайлы.ИмяФайлаСтилей);
	Лист1 = ДокументДОМИзХМЛ(РаспакованныеФайлы.ИмяФайлаТаблицы1);
	
	sheetDataList = Лист1.ПолучитьЭлементыПоИмени("sheetData");
	Если sheetDataList.Количество() = 0 Тогда
		ВызватьИсключение "Узел sheetData не найден";
	КонецЕсли;
	sheetData = sheetDataList[0];
	
	cellXfsList = Стили.ПолучитьЭлементыПоИмени("cellXfs");
	Если cellXfsList.Количество() = 0 Тогда
		ВызватьИсключение "Узел cellXfs не найден";
	КонецЕсли;
	cellXfs = cellXfsList[0];
	
	Для Каждого Row Из sheetData.ДочерниеУзлы Цикл
		АтрибутНомераСтроки = Row.Атрибуты.ПолучитьИменованныйЭлемент("r");
		Если АтрибутНомераСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Col Из Row.ДочерниеУзлы Цикл
			АтрибутИмениЯчейки = Col.Атрибуты.ПолучитьИменованныйЭлемент("r");
			Если АтрибутИмениЯчейки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Формат = ПриведенныйФорматЯчеек(ФорматыЯчеекЛиста.Получить(АтрибутИмениЯчейки.Значение));
			Если Формат <> Неопределено Тогда
				СкопироватьСтильЯчейки(Col, Стили, cellXfs, Формат);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗаписатьДокументДОМвХМЛ(Стили, РаспакованныеФайлы.ИмяФайлаСтилей);
	ЗаписатьДокументДОМвХМЛ(Лист1, РаспакованныеФайлы.ИмяФайлаТаблицы1);
	
	СобратьФайлИзКаталогаХМЛ(ИмяФайла, ТипФайла);
	
КонецПроцедуры

// Процедура заполняет соответствие, где Ключ - это номер ячейки, Значение - Тип ячейки.
//
// Параметры:
//  ИмяФайла - Строка - название редактируемого файла.
//  ТабличныйДокумент - ТабличныйДокумент - табличный документ, в котором анализируются ячейки.
//  ТипЯчейки - Тип - тип, который необходимо установить ячейкам. Поддерживаются типы: Строка, Число, Дата.
//  МассивНомеровКолонок - Массив - массив, который содержит номера колонок, в которых требуется изменить тип.
//
Процедура ЗаполнитьЯчейкиДляФорматирования(ИмяФайла, ТабличныйДокумент, ТипЯчейки, МассивНомеровКолонок) Экспорт
	
	ФорматыЯчеек = Новый Соответствие();
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		Для Каждого НомерКолонки Из МассивНомеровКолонок Цикл
			ИмяЯчейки = СтрШаблон("R%1C%2", НомерСтроки, НомерКолонки);
			ФорматыЯчеек.Вставить(ИмяЯчейки, ТипЯчейки);
		КонецЦикла;
	КонецЦикла;
	
	УстановитьФорматыЯчеекВФайлеXLSX(ИмяФайла, ФорматыЯчеек);
	
КонецПроцедуры

// Процедура - Установить переменные (Variables) Word
//
// Параметры:
//  ИмяФайла			 - Строка - Полный путь к файлу *.docx
//  ТаблицаПеременных	 - ТаблицаЗначений - Таблица с именами и значениями переменных
//     * ИмяПеременной - Строка - Имя переменной
//     * ЗначениеПеременной - Строка - Значение (текстовое) переменной
//
Процедура УстановитьПеременныеВWord(ИмяФайла, ТаблицаПеременных) Экспорт
	Перем РаспакованныеФайлы;
	
	ТипФайла = "docx";
	
	РазобратьФайлВКаталогХМЛ(ИмяФайла, ТипФайла, РаспакованныеФайлы);
	ФайлSettings = ДокументДОМИзХМЛ(РаспакованныеФайлы.ИмяФайлаSettings);
	ФайлDocument = ДокументДОМИзХМЛ(РаспакованныеФайлы.ИмяФайлаDocument);
	
	УдалитьОписаниеПеременныхВОРД(ФайлSettings);
	
	УстановитьЗначенияПеременныхВОРД(ФайлDocument, ТаблицаПеременных);
	УстановитьОписаниеПеременныхВОРД(ФайлSettings, ТаблицаПеременных);
	
	ЗаписатьДокументДОМвХМЛ(ФайлSettings, РаспакованныеФайлы.ИмяФайлаSettings);
	ЗаписатьДокументДОМвХМЛ(ФайлDocument, РаспакованныеФайлы.ИмяФайлаDocument);
	
	СобратьФайлИзКаталогаХМЛ(ИмяФайла, ТипФайла);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РазобратьФайлВКаталогХМЛ(ИмяФайла, ТипФайла, РаспакованныеФайлы = Неопределено)
	
	СообщениеОбОтсутствииФайла = "Указанный файл не найден";
	
	Файл = Новый Файл(ИмяФайла);
	Если Не Файл.Существует() Тогда
		ВызватьИсключение СообщениеОбОтсутствииФайла;
	КонецЕсли;
	
	КаталогРаспаковки = Файл.Путь + ТипФайла + "_data_" + Файл.ИмяБезРасширения + "\";
	УдалитьФайлы(КаталогРаспаковки);
	
	ЧтениеZIP = Новый ЧтениеZipФайла();
	ЧтениеZIP.Открыть(ИмяФайла);
	ЧтениеZIP.ИзвлечьВсе(КаталогРаспаковки, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	
	РаспакованныеФайлы = Новый Структура();
	Если НРег(ТипФайла) = "xlsx" Тогда
		РаспакованныеФайлы.Вставить("ИмяФайлаСтилей", КаталогРаспаковки + "xl\styles.xml");
		РаспакованныеФайлы.Вставить("ИмяФайлаТаблицы1", КаталогРаспаковки + "xl\worksheets\sheet1.xml");
	ИначеЕсли НРег(ТипФайла) = "docx" Тогда
		РаспакованныеФайлы.Вставить("ИмяФайлаSettings", КаталогРаспаковки + "word\settings.xml");
		РаспакованныеФайлы.Вставить("ИмяФайлаDocument", КаталогРаспаковки + "word\document.xml");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Тип файла [*." + ТипФайла + "] не обрабатывается.");
	КонецЕсли;
	
КонецПроцедуры

Процедура СобратьФайлИзКаталогаХМЛ(ИмяФайла, ТипФайла)
	
	СообщениеОбОтсутствииФайла = "Указанный файл не найден";
	
	Файл = Новый Файл(ИмяФайла);
	Если Не Файл.Существует() Тогда
		ВызватьИсключение СообщениеОбОтсутствииФайла;
	КонецЕсли;
	УдалитьФайлы(ИмяФайла);
	
	КаталогРаспаковки = Файл.Путь + ТипФайла + "_data_" + Файл.ИмяБезРасширения + "\";
	Файл = Новый Файл(КаталогРаспаковки);
	Если Не Файл.Существует() Тогда
		ВызватьИсключение СообщениеОбОтсутствииФайла;
	КонецЕсли;
	
	ЗаписьZip = Новый ЗаписьZipФайла(ИмяФайла);
	ЗаписьZip.Добавить(КаталогРаспаковки + "*",
		РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ЗаписьZip.Записать();
	УдалитьФайлы(КаталогРаспаковки);
	
КонецПроцедуры

Процедура ЗаписатьДокументДОМвХМЛ(ДокументDOM, ИмяФайла)
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл(ИмяФайла);
	ЗаписьDOM = Новый ЗаписьDOM();
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
	ЗаписьXML.Закрыть();
	
КонецПроцедуры

Функция ДокументДОМИзХМЛ(ИмяФайла)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	ЧтениеXML.Закрыть();
	Возврат ДокументDOM;
	
КонецФункции

#Область УстановкаФорматаXLSX

Процедура СкопироватьСтильЯчейки(Ячейка, Стили, cellXfs, НовыйФормат)
	
	АтрибутСтиля = Ячейка.Атрибуты.ПолучитьИменованныйЭлемент("s");
	ИндексТекущегоСтиля = Число(АтрибутСтиля.Значение);
	
	ТекущийСтиль = cellXfs.ДочерниеУзлы[ИндексТекущегоСтиля];
	НовыйСтиль = ТекущийСтиль.КлонироватьУзел(Истина);
	
	АтрибутNumFmtId = НовыйСтиль.Атрибуты.ПолучитьИменованныйЭлемент("numFmtId");
	Если АтрибутNumFmtId = Неопределено Тогда
		АтрибутNumFmtId = Стили.СоздатьАтрибут("numFmtId");
		АтрибутNumFmtId.Значение = XMLСтрока(НовыйФормат);
		НовыйСтиль.Атрибуты.УстановитьИменованныйЭлемент(АтрибутNumFmtId);
	Иначе
		АтрибутNumFmtId.Значение = XMLСтрока(НовыйФормат);
	КонецЕсли;
	
	cellXfs.ДобавитьДочерний(НовыйСтиль);
	cellXfs.Атрибуты.ПолучитьИменованныйЭлемент("count").Значение = XMLСтрока(cellXfs.ДочерниеУзлы.Количество());
	АтрибутСтиля.Значение = XMLСтрока(cellXfs.ДочерниеУзлы.Количество() - 1);
	
КонецПроцедуры

Функция АдресВСтилеА1В1(АдресВСтилеР1С1)
	
	ЧастиАдреса = СтрРазделить(АдресВСтилеР1С1, "C");
	НомерСтроки = СтрЗаменить(ЧастиАдреса[0], "R", "");
	ИндексСтолбца = Число(ЧастиАдреса[1]) - 1;
	
	ОграничениеНаИндекс = 255;
	Если ИндексСтолбца > ОграничениеНаИндекс Тогда
		ВызватьИсключение "Поддерживается не более 256 столбцов";
	КонецЕсли;
	
	РазмерГруппы = 26;
	ИндексПервогоСимвола = Цел(ИндексСтолбца / РазмерГруппы);
	Если ИндексПервогоСимвола = 0 Тогда
		ИмяЯчейки = Символ(КодСимвола("A") + ИндексСтолбца) + НомерСтроки;
	Иначе
		
		ИндексВторогоСимвола = ИндексСтолбца - (ИндексПервогоСимвола * РазмерГруппы);
		ПервыйСимвол = Символ(КодСимвола("A") + ИндексПервогоСимвола - 1);
		ВторойСимвол = Символ(КодСимвола("A") + ИндексВторогоСимвола);
		ИмяЯчейки = "" + ПервыйСимвол + ВторойСимвол + НомерСтроки;
		
	КонецЕсли;
	
	Возврат ИмяЯчейки;
	
КонецФункции

Функция ПриведенныйФорматЯчеек(ИсходныйФормат)
	
	ФорматЯчейки = Неопределено;
	Если ТипЗнч(ИсходныйФормат) = Тип("Тип") Тогда
		Если ИсходныйФормат = Тип("Строка") Тогда
			ФорматЯчейки = "49";
		ИначеЕсли ИсходныйФормат = Тип("Число") Тогда
			ФорматЯчейки = "2";
		ИначеЕсли ИсходныйФормат = Тип("Дата") Тогда
			ФорматЯчейки = "14";
		Иначе
			ФорматЯчейки = "0";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ФорматЯчейки;
	
КонецФункции

Функция СоответствиеФорматовЯчеекЛиста(ФорматыЯчеек)
	ФорматыЯчеекЛиста = Новый Соответствие();
	Для Каждого ФорматЯчейки Из ФорматыЯчеек Цикл
		Если Лев(ФорматЯчейки.Ключ, 1) = "R" Тогда
			ФорматыЯчеекЛиста.Вставить(АдресВСтилеА1В1(ФорматЯчейки.Ключ), ФорматЯчейки.Значение);
		Иначе
			ФорматыЯчеекЛиста.Вставить(ФорматЯчейки.Ключ, ФорматЯчейки.Значение);
		КонецЕсли;
	КонецЦикла;
	Возврат ФорматыЯчеекЛиста;
КонецФункции

#КонецОбласти

#Область УстановкаПеременныхDOCX

Функция ИмяПеременнойВОРДИзСтроки(ИмяПеременнойВСтроке)
	
	ПризнакНачала = "DOCVARIABLE";
	СмещениеНачала = СтрДлина(ПризнакНачала);
	ПозицияНачала = СтрНайти(ИмяПеременнойВСтроке, ПризнакНачала) + СмещениеНачала;
	
	ПризнакКонца = "\*";
	ПозицияКонца = СтрНайти(ИмяПеременнойВСтроке, ПризнакКонца) - 1;
	
	ИмяПеременной = Сред(ИмяПеременнойВСтроке, ПозицияНачала, ПозицияКонца - ПозицияНачала + 1);
	Возврат СокрЛП(ИмяПеременной);
КонецФункции

Процедура УдалитьОписаниеПеременныхВОРД(ДокDOM)
	
	СекцияПеременных = ДокDOM.ПолучитьЭлементыПоИмени("docVars");
	Если СекцияПеременных.Количество() > 0 Тогда
		Корень = ДокDOM.ПолучитьЭлементыПоИмени("settings")[0];
		УдаляемыйУзел = СекцияПеременных[0];
		Корень.УдалитьДочерний(УдаляемыйУзел);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОписаниеПеременныхВОРД(ДокDOM, ТаблицаПеременных)
	
	URI = ДокDOM.НайтиURIПространстваИмен("w");
	ВставитьПередУзлом = ДокDOM.ПолучитьЭлементыПоИмени("rsids")[0];
	
	ЗаписьУзлов = Новый ЗаписьУзловDOM;
	ЗаписьУзлов.Открыть(ДокDOM);
	ЗаписьУзлов.ЗаписатьНачалоЭлемента("w:docVars");
	Для Каждого Переменная Из ТаблицаПеременных Цикл
		ЗаписьУзлов.ЗаписатьНачалоЭлемента("w:docVar");
		ЗаписьУзлов.ЗаписатьАтрибут("w:name", URI, Переменная.ИмяПеременной);
		ЗаписьУзлов.ЗаписатьАтрибут("w:val", URI, Переменная.ЗначениеПеременной);
		ЗаписьУзлов.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьУзлов.ЗаписатьКонецЭлемента();
	
	ДокDOM.ЭлементДокумента.ВставитьПеред(ЗаписьУзлов.УзелDOM, ВставитьПередУзлом);
	
	ЗаписьУзлов.Закрыть();
	
КонецПроцедуры

Процедура УстановитьЗначениеПеременнойВОРД(ДокDOM, УзелКлон, УзелЗамены, ЗначениеПеременной)
	
	ЗаписьУзлов = Новый ЗаписьУзловDOM;
	ЗаписьУзлов.Открыть(ДокDOM);
	ЗаписьУзлов.ЗаписатьНачалоЭлемента("w:t");
	ЗаписьУзлов.ЗаписатьТекст(ЗначениеПеременной);
	ЗаписьУзлов.ЗаписатьКонецЭлемента();
	
	УзелКлон.ВставитьПеред(ЗаписьУзлов.УзелDOM, УзелЗамены);
	
	ЗаписьУзлов.Закрыть();
	
КонецПроцедуры

Функция ЗначениеПеременнойПоИмениВОРД(ИмяПеременной, ТаблицаПеременных)
	
	Переменная = ТаблицаПеременных.Найти(ИмяПеременной, "ИмяПеременной");
	
	Если Переменная = Неопределено Тогда
		Переменная = ТаблицаПеременных.Добавить();
		Переменная.ИмяПеременной = ИмяПеременной;
		Переменная.ЗначениеПеременной = "";
	КонецЕсли;
	
	Значение = Переменная.ЗначениеПеременной;
	Если Не ОбщегоНазначения.ЗначениеНеЗаполнено(Значение) И (Значение <> Неопределено) Тогда
		Возврат Значение;
	Иначе
		Возврат " ";
	КонецЕсли;
	
КонецФункции

Процедура УстановитьСекцииПеременныхВОРД(ТекущийУзелDOM, СекцияПеременной)
	Для Каждого Атрибут Из ТекущийУзелDOM.Атрибуты Цикл
		Если Атрибут.ЛокальноеИмя = "fldCharType" Тогда
			Если Атрибут.ТекстовоеСодержимое = "begin" Тогда
				СекцияПеременной.Вставить("begin", Истина);
			КонецЕсли;
			Если Атрибут.ТекстовоеСодержимое = "end" Тогда
				СекцияПеременной.Вставить("end", Истина);
			КонецЕсли;
			Если Атрибут.ТекстовоеСодержимое = "separate" Тогда
				СекцияПеременной.Вставить("separate", Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ВставитьЗначениеПеременнойВОРДСекцияEnd(ДокDOM, УзелДочка, ТекущийУзел, ИндексУзла,
		ТаблицаПеременных, ПроизвольныйПараметр)
	
	Если ТипЗнч(ПроизвольныйПараметр) = Тип("Структура") Тогда
		
		УзелКлон = УзелДочка.КлонироватьУзел(Истина); // Скопирован end
		Для Каждого УзелЗамены Из УзелКлон.ДочерниеУзлы Цикл
			Если УзелЗамены.ЛокальноеИмя = "fldChar" Тогда
				АтрибутРазделитель = УзелЗамены.Атрибуты[0];
				АтрибутРазделитель.Значение = "separate";
				Прервать;
			КонецЕсли;
		КонецЦикла;
		ТекущийУзел.ВставитьПеред(УзелКлон, УзелДочка);
		ИндексУзла = ИндексУзла + 1;
		
		УзелКлон = ПроизвольныйПараметр.УзелКлон;
		ТекущийУзел.ВставитьПеред(УзелКлон, УзелДочка);
		ИндексУзла = ИндексУзла + 1;
		
		Для Каждого УзелЗамены Из УзелКлон.ДочерниеУзлы Цикл // Поиск узла для вставки переменной
			Если УзелЗамены.ЛокальноеИмя = "instrText" Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ЗначениеПеременной = ЗначениеПеременнойПоИмениВОРД(ПроизвольныйПараметр.ИмяПеременной, ТаблицаПеременных);
		УстановитьЗначениеПеременнойВОРД(ДокDOM, УзелКлон, УзелЗамены, ЗначениеПеременной);
		УзелКлон.УдалитьДочерний(УзелЗамены);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВставитьЗначениеПеременнойВОРД(ДокDOM, УзелДочка, ТекущийУзел, ИндексУзла, СекцииПеременной,
		ТаблицаПеременных, ПроизвольныйПараметр)
		
	Для Каждого Секция Из СекцииПеременной Цикл
		
		Если Секция.Ключ = "begin" Тогда
			ПроизвольныйПараметр = Новый Массив;
		КонецЕсли;
		
		Если Секция.Ключ = "end" Тогда
			ВставитьЗначениеПеременнойВОРДСекцияEnd(ДокDOM, УзелДочка, ТекущийУзел, ИндексУзла, ТаблицаПеременных, ПроизвольныйПараметр);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура НайтиУзелДляКлонированияDOM(УзелОригинал, ПроизвольныйПараметр)
	Если СтрНайти(УзелОригинал.ТекстовоеСодержимое, "\*") > 0 Тогда
		ИмяПеременнойВСтроке = СтрСоединить(ПроизвольныйПараметр);
		ИмяПеременной = ИмяПеременнойВОРДИзСтроки(ИмяПеременнойВСтроке);
		
		ПроизвольныйПараметр = Неопределено;
		
		ПроизвольныйПараметр = Новый Структура;
		ПроизвольныйПараметр.Вставить("ИмяПеременной", ИмяПеременной);
		ПроизвольныйПараметр.Вставить("УзелКлон", УзелОригинал.КлонироватьУзел(Истина));
	КонецЕсли;
КонецПроцедуры

Процедура ОбойтиДочерниеУзлыDOM(ДокDOM, ТаблицаПеременных, ТекущийУзел, ИскомоеЛокальноеИмя,
	СекцияПеременной = Неопределено, ПроизвольныйПараметр = Неопределено)
	
	КоличествоУзлов = ТекущийУзел.ДочерниеУзлы.Количество();
	
	ИндексУзла = 0;
	Пока ИндексУзла <= КоличествоУзлов - 1 Цикл
		
		УзелДочка = ТекущийУзел.ДочерниеУзлы[ИндексУзла];
		ЛокальноеИмяУзла = УзелДочка.ЛокальноеИмя;
		
		ЭтоСекцияСпецсимволов 	= ЛокальноеИмяУзла = ИскомоеЛокальноеИмя И ЛокальноеИмяУзла = "fldChar";
		ЭтоСекцияДанных 		= ЛокальноеИмяУзла = ИскомоеЛокальноеИмя И ЛокальноеИмяУзла = "r";
		
		Если ЭтоСекцияСпецсимволов Тогда
			УстановитьСекцииПеременныхВОРД(УзелДочка, СекцияПеременной);
		КонецЕсли;
		
		Если ЭтоСекцияДанных Тогда
			
			// Поиск переменной
			Если ТипЗнч(ПроизвольныйПараметр) = Тип("Массив") Тогда
				ПроизвольныйПараметр.Добавить(УзелДочка.ТекстовоеСодержимое);
			КонецЕсли;
			
			СекцииПеременной = Новый Структура;
			ОбойтиДочерниеУзлыDOM(ДокDOM, ТаблицаПеременных, УзелДочка, "fldChar", СекцииПеременной); // Поиск "begin" "end"
			
			НайтиУзелДляКлонированияDOM(УзелДочка, ПроизвольныйПараметр);
			
			// Удаление старого значения переменной
			Если СекцииПеременной.Свойство("separate") Тогда
				КоличествоУзловКУдалению = 2;
				ТекущийУзел.УдалитьДочерний(УзелДочка.СледующийСоседний);
				ТекущийУзел.УдалитьДочерний(УзелДочка);
				
				КоличествоУзлов = КоличествоУзлов - КоличествоУзловКУдалению;
				
				Продолжить;
			КонецЕсли;
			
			// Вставка значения переменной
			ВставитьЗначениеПеременнойВОРД(ДокDOM, УзелДочка, ТекущийУзел, ИндексУзла, СекцииПеременной, ТаблицаПеременных, ПроизвольныйПараметр);
		КонецЕсли;
		
		ОбойтиДочерниеУзлыDOM(ДокDOM, ТаблицаПеременных, УзелДочка, ИскомоеЛокальноеИмя, , ПроизвольныйПараметр);
		
		ИндексУзла = ИндексУзла + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗначенияПеременныхВОРД(ДокDOM, ТаблицаПеременных)
	
	УзелBody = ДокDOM.ЭлементДокумента.ДочерниеУзлы[0];
	ОбойтиДочерниеУзлыDOM(ДокDOM, ТаблицаПеременных, УзелBody, "r");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
