
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	// Очистить записи РС ЭтапыКД по текущему документу
	НаборЗаписей = РегистрыСведений.ЭтапыКД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КД.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	РегистрыСведений.СтатусыКорпоративныхДействий.ОтразитьСтатусКорпоративногоДействия(Ссылка, Отказ);
	РегистрыСведений.СостоянияКорпоративныхДействий.ОтразитьСостояниеКорпоративногоДействия(Ссылка, Отказ);
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////////////
//  ВЫГРУЗКА УВЕДОМЛЕНИЙ О КД

Процедура ПередатьУведомлениеОКД(ВариантОтправки) Экспорт
	   
	Если ВариантОтправки = "Выкуп" Тогда
		ВыгрузитьКДОВыкупе();
	ИначеЕсли ВариантОтправки = "Собрание" Тогда
		ВыгрузитьКДОСобрании();
	Иначе 
		ВызватьИсключение("Действие 'Отправить уведомление о КД' прервано. Ошибка обработки отправки вида КД: отсутствует алгоритм выгрузки");
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьКДОВыкупе()
	
	Запрос = Новый Запрос(ТекстЗапросаДляВыгрузкиКДВыкуп());
	ЗаполнитьПараметрыЗапроса(Запрос);
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаДокументов 			= Результат[1].Выбрать();
	ТаблицаОпций 				= Результат[2].Выгрузить();
	ВыборкаКлиентов 			= Результат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПередаемДокументКД 		= ВыборкаДокументов.Следующий();
	Если НЕ ПередаемДокументКД Тогда
		ВызватьИсключение("Действие 'Отправить уведомление о КД' прервано. Ошибка получения параметров отправки по запросу");
	КонецЕсли;
	
	Попытка
		
		Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
		ПространствоИмен = Прокси.ТочкаПодключения.Интерфейс.URIПространстваИмен;
		Фабрика = Прокси.ФабрикаXDTO;
			
		СтруктураКоллекции = СтруктураДляСозданияКоллекции("ArrayOfCorporateActionBidsOption1", "CorporateActionBidsOption1", Неопределено);
		КоллекцияОпций = СоздатьИЗаполнитьКоллекциюОбъектаXDTO(Фабрика, ТаблицаОпций, ПространствоИмен, СтруктураКоллекции);
			
		СтруктураКоллекции = СтруктураДляСозданияКоллекции("ArrayOfCorporateActionClientSecurity1", "CorporateActionClientSecurity1", Неопределено);
		СтруктураКоллекции = СтруктураДляСозданияКоллекции("ArrayOfCorporateActionClient1", "CorporateActionClient1", СтруктураКоллекции, "CorporateActionClientSecurityCollection");
		КоллекцияКлиентов = СоздатьИЗаполнитьКоллекциюОбъектаXDTO(Фабрика, ВыборкаКлиентов, ПространствоИмен, СтруктураКоллекции);
		
		ТипОсновнойКоллекции = Фабрика.Тип(ПространствоИмен, "CreateCorporateActionBids");
		
		ЭкземплярCorporateActionBid = Фабрика.Создать(ТипОсновнойКоллекции);
		ЗаполнитьЗначенияСвойств(ЭкземплярCorporateActionBid, ВыборкаДокументов); 
		ЭкземплярCorporateActionBid.Установить("optionsCollection", КоллекцияОпций);                             
		ЭкземплярCorporateActionBid.Установить("clientsCollection", КоллекцияКлиентов);
		
		ТипОсновнойКоллекции.Проверить(ЭкземплярCorporateActionBid);
		Прокси.CreateCorporateActionBids(ЭкземплярCorporateActionBid);
		
	Исключение
		УведомлениеОтправлено = Ложь;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации("Вызов внешнего веб-сервиса для отправки уведомления о КД", 
									УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
	КонецПопытки;

КонецПроцедуры

Функция ТекстЗапросаДляВыгрузкиКДВыкуп()
	Возврат "ВЫБРАТЬ
	        |	КорпоративноеДействие_Новый.ВидКД.Код КАК ВидКДКод,
	        |	КорпоративноеДействие_Новый.КДРеференс КАК КДРеференс,
	        |	КорпоративноеДействие_Новый.АдресВСетиИнтернет КАК АдресВСетиИнтернет,
	        |	ПРЕДСТАВЛЕНИЕ(КорпоративноеДействие_Новый.Эмитент) КАК ЭмитентПредставление,
	        |	КорпоративноеДействие_Новый.ЦеннаяБумага1 КАК ЦеннаяБумага1,
	        |	КорпоративноеДействие_Новый.ЦеннаяБумага1Остаток КАК ЦеннаяБумага1Остаток,
	        |	КорпоративноеДействие_Новый.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	        |	КорпоративноеДействие_Новый.МинимальноеКодичествоДляУчастияВКД КАК МинимальноеКоличествоДляУчастияВКД,
	        |	КорпоративноеДействие_Новый.ВыплатаНа1ЦБ КАК ВыплатаНа1ЦБ,
	        |	КорпоративноеДействие_Новый.ДатаНачалаПриемаЗаявокНаВыкуп КАК ДатаНачалаПриемаЗаявокНаВыкуп,
	        |	КорпоративноеДействие_Новый.ДатаОкончанияПриемаЗаявокНаВыкуп КАК ДатаОкончанияПриемаЗаявокНаВыкуп,
	        |	КорпоративноеДействие_Новый.ДатаВыплатыНеПозднее КАК ДатаВыплатыНеПозднее,
	        |	КорпоративноеДействие_Новый.БанковскийСчет.ВалютаДенежныхСредств.Наименование КАК ВалютаВыплаты,
	        |	КорпоративноеДействие_Новый.ДатаФиксации КАК ДатаФиксации,
	        |	КорпоративноеДействие_Новый.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ втДанныеДокумента
	        |ИЗ
	        |	Документ.КорпоративноеДействие_Новый КАК КорпоративноеДействие_Новый
	        |ГДЕ
	        |	КорпоративноеДействие_Новый.Ссылка = &Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	втДанныеДокумента.ВидКДКод КАК type,
	        |	втДанныеДокумента.КДРеференс КАК reference,
	        |	втДанныеДокумента.АдресВСетиИнтернет КАК ftpFile,
	        |	втДанныеДокумента.ЭмитентПредставление КАК issuerName,
	        |	втДанныеДокумента.ДатаОкончанияПриемаИнструкцийВТБКБ КАК deadLineDate,
	        |	втДанныеДокумента.ДатаФиксации КАК cutOffDate,
	        |	втДанныеДокумента.МинимальноеКоличествоДляУчастияВКД КАК unitMin
	        |ИЗ
	        |	втДанныеДокумента КАК втДанныеДокумента
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	втДанныеДокумента.ВыплатаНа1ЦБ КАК Price,
	        |	ВЫБОР
	        |		КОГДА втДанныеДокумента.ДатаНачалаПриемаЗаявокНаВыкуп = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА НЕОПРЕДЕЛЕНО
	        |		ИНАЧЕ втДанныеДокумента.ДатаНачалаПриемаЗаявокНаВыкуп
	        |	КОНЕЦ КАК DateStart,
	        |	ВЫБОР
	        |		КОГДА втДанныеДокумента.ДатаОкончанияПриемаЗаявокНаВыкуп = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА НЕОПРЕДЕЛЕНО
	        |		ИНАЧЕ втДанныеДокумента.ДатаОкончанияПриемаЗаявокНаВыкуп
	        |	КОНЕЦ КАК DateEnd,
	        |	ВЫБОР
	        |		КОГДА втДанныеДокумента.ДатаВыплатыНеПозднее = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА НЕОПРЕДЕЛЕНО
	        |		ИНАЧЕ втДанныеДокумента.ДатаВыплатыНеПозднее
	        |	КОНЕЦ КАК DatePay,
	        |	втДанныеДокумента.ВалютаВыплаты КАК PriceCurrencyType,
	        |	""CASH"" КАК Type,
	        |	""001"" КАК Number
	        |ИЗ
	        |	втДанныеДокумента КАК втДанныеДокумента
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	РаскрытиеСпискаВладельцевСписокВладельцев.Количество КАК Unit,
	        |	РаскрытиеСпискаВладельцевСписокВладельцев.ЦеннаяБумага.ISIN КАК Isin,
	        |	ВЫБОР
	        |		КОГДА РаскрытиеСпискаВладельцевСписокВладельцев.ЦеннаяБумага.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыАкций.Обыкновенная)
	        |			ТОГДА ""Ordinary""
	        |		ИНАЧЕ ""Preference""
	        |	КОНЕЦ КАК SecType,
	        |	КодыЗагрузки.Код КАК SecCode,
	        |	КодыЗагрузкиКлиента.Код КАК ClientId,
	        |	РаскрытиеСпискаВладельцевСписокВладельцев.ЦеннаяБумага.НомерРегистрации КАК GosRegNumber,
	        |	ЕСТЬNULL(НоминалЦБСрезПоследних.Сумма, 0) КАК NominalValue,
	        |	РаскрытиеСпискаВладельцевСписокВладельцев.ЦеннаяБумага.ВалютаНоминала.Наименование КАК NominalCurrency,
	        |	0 КАК StakeToParticipate
	        |ИЗ
	        |	Документ.РаскрытиеСпискаВладельцев.СписокВладельцев КАК РаскрытиеСпискаВладельцевСписокВладельцев
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	        |		ПО РаскрытиеСпискаВладельцевСписокВладельцев.ЦеннаяБумага = КодыЗагрузки.Владелец
	        |			И (КодыЗагрузки.Биржа = &НДЦ)
	        |			И (НЕ КодыЗагрузки.ПометкаУдаления)
	        |			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	        |				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > РаскрытиеСпискаВладельцевСписокВладельцев.Ссылка.Дата)
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиКлиента
	        |		ПО РаскрытиеСпискаВладельцевСписокВладельцев.Клиент = КодыЗагрузкиКлиента.Владелец
	        |			И (КодыЗагрузкиКлиента.ПометкаУдаления = ЛОЖЬ)
	        |			И (КодыЗагрузкиКлиента.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.Клиенты))
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ.СрезПоследних КАК НоминалЦБСрезПоследних
	        |		ПО РаскрытиеСпискаВладельцевСписокВладельцев.ЦеннаяБумага = НоминалЦБСрезПоследних.ЦеннаяБумага
	        |ГДЕ
	        |	РаскрытиеСпискаВладельцевСписокВладельцев.Ссылка.Проведен
	        |	И РаскрытиеСпискаВладельцевСписокВладельцев.Ссылка.КарточкаКД = &Ссылка
	        |ИТОГИ ПО
	        |	ClientId";
КонецФункции

Процедура ВыгрузитьКДОСобрании()
	
	Запрос = Новый Запрос(ТекстЗапросаДляВыгрузкиКДСобрание());
	ЗаполнитьПараметрыЗапроса(Запрос);
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаДокументов 			= Результат[1].Выбрать();
	РезультатПоСпискуВопросов 	= Результат[2];
	ВыборкаКлиентов 			= Результат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПередаемДокументКД 		= ВыборкаДокументов.Следующий();
	Если НЕ ПередаемДокументКД Тогда
		ВызватьИсключение("Действие 'Отправить уведомление о КД' прервано. Ошибка получения параметров отправки по запросу");
	КонецЕсли;
	
	МассивИменXDTO = Новый Массив;
	МассивИменXDTO.Добавить("ArrayOfCorporateActionMeetResolution1");         
	МассивИменXDTO.Добавить("CorporateActionMeetResolution1");
	МассивИменXDTO.Добавить("ArrayOfCorporateActionMeetResolutionVote1");              
	МассивИменXDTO.Добавить("CorporateActionMeetResolutionVote1");         
	МассивИменXDTO.Добавить("ArrayOfCorporateActionMeetResolutionDetail1");              
	МассивИменXDTO.Добавить("CorporateActionMeetResolutionDetail1");         
	                                 
	Попытка
		
		Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
		ПространствоИмен = Прокси.ТочкаПодключения.Интерфейс.URIПространстваИмен;
		Фабрика = Прокси.ФабрикаXDTO;
		
		ТипыПространстваИмен = Новый Структура;
		Для каждого ИмяОбъектаXDTO из МассивИменXDTO Цикл
			ТипыПространстваИмен.Вставить(ИмяОбъектаXDTO, Фабрика.Тип(ПространствоИмен, ИмяОбъектаXDTO));
		КонецЦикла;
		
		КоллекцияВопросов = Фабрика.Создать(ТипыПространстваИмен.ArrayOfCorporateActionMeetResolution1);
		ВыборкаВопросов = РезультатПоСпискуВопросов.Выбрать();
		ТекущийНомерВопроса = ""; ЭкземплярResolution = Неопределено; КоллекцияДеталей = Неопределено;
		Пока ВыборкаВопросов.Следующий() Цикл
			НомерВопроса = ВыборкаВопросов.Number;
			Если ВыборкаВопросов.CumulativeVoting И 
				ЗначениеЗаполнено(ТекущийНомерВопроса) И Найти(НомерВопроса, ТекущийНомерВопроса + ".") > 0 И 
				НЕ ЭкземплярResolution = Неопределено Тогда
				ЭкземплярDetails = Фабрика.Создать(ТипыПространстваИмен.CorporateActionMeetResolutionDetail1);
				ЗаполнитьЗначенияСвойств(ЭкземплярDetails, ВыборкаВопросов);
				КоллекцияДеталей.CorporateActionMeetResolutionDetail1.Добавить(ЭкземплярDetails);
				ЭкземплярResolution.Установить("CorporateActionMeetResolutionDetailCollection", КоллекцияДеталей);
			Иначе 
				ЭкземплярResolution = Фабрика.Создать(ТипыПространстваИмен.CorporateActionMeetResolution1);
				ЗаполнитьЗначенияСвойств(ЭкземплярResolution, ВыборкаВопросов);
				КоллекцияВопросов.CorporateActionMeetResolution1.Добавить(ЭкземплярResolution);
				Если ВыборкаВопросов.CumulativeVoting Тогда
					ТекущийНомерВопроса = НомерВопроса;
					КоллекцияДеталей = Фабрика.Создать(ТипыПространстваИмен.ArrayOfCorporateActionMeetResolutionDetail1);
				КонецЕсли;
				КоллекцияРаскрытияСписка = Фабрика.Создать(ТипыПространстваИмен.ArrayOfCorporateActionMeetResolutionVote1);
				Пока ВыборкаКлиентов.Следующий() Цикл
					ЭкземплярClientVote = Фабрика.Создать(ТипыПространстваИмен.CorporateActionMeetResolutionVote1);
					ЗаполнитьЗначенияСвойств(ЭкземплярClientVote, ВыборкаКлиентов);
					ЭкземплярClientVote.VoteMultiplier = ВыборкаВопросов.VoteMultiplier;
					Если ВыборкаВопросов.ForInformationOnly Тогда
						ЭкземплярClientVote.VoteNb = 0;
					КонецЕсли;
					КоллекцияРаскрытияСписка.CorporateActionMeetResolutionVote1.Добавить(ЭкземплярClientVote);
				КонецЦикла;
				ВыборкаКлиентов.Сбросить();
				ЭкземплярResolution.Установить("CorporateActionMeetResolutionVoteCollection", КоллекцияРаскрытияСписка);
			КонецЕсли;
		КонецЦикла;
		
		СтруктураКоллекции = СтруктураДляСозданияКоллекции("ArrayOfCorporateActionClientSecurity1", "CorporateActionClientSecurity1", Неопределено);
		СтруктураКоллекции = СтруктураДляСозданияКоллекции("ArrayOfCorporateActionClient1", "CorporateActionClient1", СтруктураКоллекции, "CorporateActionClientSecurityCollection");
		КоллекцияКлиентов = СоздатьИЗаполнитьКоллекциюОбъектаXDTO(Фабрика, ВыборкаКлиентов, ПространствоИмен, СтруктураКоллекции);
		
		ТипОсновнойКоллекции = Фабрика.Тип(ПространствоИмен, "CreateCorporateActionMeet");
		
		ЭкземплярCorporateActionMeet = Фабрика.Создать(ТипОсновнойКоллекции);
		ЗаполнитьЗначенияСвойств(ЭкземплярCorporateActionMeet, ВыборкаДокументов); 
		ЭкземплярCorporateActionMeet.Установить("resolutionsCollection", КоллекцияВопросов);
		ЭкземплярCorporateActionMeet.Установить("clientsCollection", КоллекцияКлиентов);
		
		ТипОсновнойКоллекции.Проверить(ЭкземплярCorporateActionMeet);
		Прокси.CreateCorporateActionMeet(ЭкземплярCorporateActionMeet);
		
	Исключение
		УведомлениеОтправлено = Ложь;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации("Вызов внешнего веб-сервиса для отправки уведомления о КД", 
									УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
	КонецПопытки;

КонецПроцедуры

Функция ТекстЗапросаДляВыгрузкиКДСобрание()
	Возврат "ВЫБРАТЬ
	|	КорпоративноеДействие_Новый.ВидКД.Код КАК ВидКДКод,
	|	КорпоративноеДействие_Новый.КДРеференс КАК КДРеференс,
	|	КорпоративноеДействие_Новый.АдресВСетиИнтернет КАК АдресВСетиИнтернет,
	|	ПРЕДСТАВЛЕНИЕ(КорпоративноеДействие_Новый.Эмитент) КАК ЭмитентПредставление,
	|	КорпоративноеДействие_Новый.ЦеннаяБумага1 КАК ЦеннаяБумага1,
	|	КорпоративноеДействие_Новый.ЦеннаяБумага1Остаток КАК ЦеннаяБумага1Остаток,
	|	КорпоративноеДействие_Новый.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	|	КорпоративноеДействие_Новый.МинимальноеКодичествоДляУчастияВКД КАК МинимальноеКоличествоДляУчастияВКД,
	|	КорпоративноеДействие_Новый.ВыплатаНа1ЦБ КАК ВыплатаНа1ЦБ,
	|	КорпоративноеДействие_Новый.ДатаНачалаПриемаЗаявокНаВыкуп КАК ДатаНачалаПриемаЗаявокНаВыкуп,
	|	КорпоративноеДействие_Новый.ДатаОкончанияПриемаЗаявокНаВыкуп КАК ДатаОкончанияПриемаЗаявокНаВыкуп,
	|	КорпоративноеДействие_Новый.ДатаВыплатыНеПозднее КАК ДатаВыплатыНеПозднее,
	|	КорпоративноеДействие_Новый.БанковскийСчет.ВалютаДенежныхСредств.Наименование КАК ВалютаВыплаты,
	|	КорпоративноеДействие_Новый.ДатаФиксации КАК ДатаФиксации,
	|	КорпоративноеДействие_Новый.Ссылка КАК Ссылка,
	|	КорпоративноеДействие_Новый.ДатаПроведенияСобрания КАК ДатаПроведенияСобрания
	|ПОМЕСТИТЬ втДанныеДокумента
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый КАК КорпоративноеДействие_Новый
	|ГДЕ
	|	КорпоративноеДействие_Новый.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеДокумента.ВидКДКод КАК type,
	|	втДанныеДокумента.КДРеференс КАК reference,
	|	втДанныеДокумента.АдресВСетиИнтернет КАК ftpFile,
	|	втДанныеДокумента.ЭмитентПредставление КАК issuerName,
	|	втДанныеДокумента.ДатаОкончанияПриемаИнструкцийВТБКБ КАК deadLineDate,
	|	втДанныеДокумента.ДатаФиксации КАК cutOffDate,
	|	втДанныеДокумента.МинимальноеКоличествоДляУчастияВКД КАК unitMin,
	|	втДанныеДокумента.ДатаПроведенияСобрания КАК MeetDate
	|ИЗ
	|	втДанныеДокумента КАК втДанныеДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорпоративноеДействие_НовыйВопросыКГолосованию.ДляИнформации КАК ForInformationOnly,
	|	КорпоративноеДействие_НовыйВопросыКГолосованию.КуммулятивныйВопрос КАК CumulativeVoting,
	|	КорпоративноеДействие_НовыйВопросыКГолосованию.ТекстВопроса КАК Description,
	|	ВЫБОР
	|		КОГДА КорпоративноеДействие_НовыйВопросыКГолосованию.Коэффициент = 0
	|			ТОГДА 1
	|		ИНАЧЕ КорпоративноеДействие_НовыйВопросыКГолосованию.Коэффициент
	|	КОНЕЦ КАК VoteMultiplier,
	|	КорпоративноеДействие_НовыйВопросыКГолосованию.ВариантыГолосования КАК VoteInstrTp,
	|	КорпоративноеДействие_НовыйВопросыКГолосованию.НомерВопроса КАК Number
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый.ВопросыКГолосованию КАК КорпоративноеДействие_НовыйВопросыКГолосованию
	|ГДЕ
	|	КорпоративноеДействие_НовыйВопросыКГолосованию.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	КорпоративноеДействие_НовыйВопросыКГолосованию.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаскрытиеСпискаВладельцевСписокВладельцев.Количество КАК Unit,
	|	РаскрытиеСпискаВладельцевСписокВладельцев.ЦеннаяБумага.ISIN КАК Isin,
	|	ВЫБОР
	|		КОГДА РаскрытиеСпискаВладельцевСписокВладельцев.ЦеннаяБумага.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыАкций.Обыкновенная)
	|			ТОГДА ""Ordinary""
	|		ИНАЧЕ ""Preference""
	|	КОНЕЦ КАК SecType,
	|	КодыЗагрузки.Код КАК SecCode,
	|	КодыЗагрузкиКлиента.Код КАК ClientId,
	|	РаскрытиеСпискаВладельцевСписокВладельцев.ЦеннаяБумага.НомерРегистрации КАК GosRegNumber,
	|	ЕСТЬNULL(НоминалЦБСрезПоследних.Сумма, 0) КАК NominalValue,
	|	РаскрытиеСпискаВладельцевСписокВладельцев.ЦеннаяБумага.ВалютаНоминала.Наименование КАК NominalCurrency,
	|	0 КАК StakeToParticipate,
	|	РаскрытиеСпискаВладельцевСписокВладельцев.Количество КАК VoteNb
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев.СписокВладельцев КАК РаскрытиеСпискаВладельцевСписокВладельцев
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО РаскрытиеСпискаВладельцевСписокВладельцев.ЦеннаяБумага = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = &НДЦ)
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > РаскрытиеСпискаВладельцевСписокВладельцев.Ссылка.Дата)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиКлиента
	|		ПО РаскрытиеСпискаВладельцевСписокВладельцев.Клиент = КодыЗагрузкиКлиента.Владелец
	|			И (КодыЗагрузкиКлиента.ПометкаУдаления = ЛОЖЬ)
	|			И (КодыЗагрузкиКлиента.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.Клиенты))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ.СрезПоследних КАК НоминалЦБСрезПоследних
	|		ПО РаскрытиеСпискаВладельцевСписокВладельцев.ЦеннаяБумага = НоминалЦБСрезПоследних.ЦеннаяБумага
	|ГДЕ
	|	РаскрытиеСпискаВладельцевСписокВладельцев.Ссылка.Проведен
	|	И РаскрытиеСпискаВладельцевСписокВладельцев.Ссылка.КарточкаКД = &Ссылка
	|ИТОГИ
	|	СУММА(Unit),
	|	СУММА(VoteNb)
	|ПО
	|	ClientId";
КонецФункции
		
/////////////////////////////////////////////////////////////////////////////////////////
//	ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗаполнитьПараметрыЗапроса(Запрос)
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	Запрос.УстановитьПараметр("ДатаДокумента", 	Дата);
	Запрос.УстановитьПараметр("НДЦ", 			Константы.КлассификаторЗагрузкиНДЦ.Получить());
КонецПроцедуры

Функция СтруктураДляСозданияКоллекции(ИмяКоллекции, ИмяЭкземпляра, ВходящаяКоллекция, ИмяВходящейКоллекции = "")
	СтруктураКВозврату = Новый Структура();
	СтруктураКВозврату.Вставить("ИмяКоллекции", ИмяКоллекции);
	СтруктураКВозврату.Вставить("ИмяЭкземпляра", ИмяЭкземпляра);
	СтруктураКВозврату.Вставить("ВходящаяКоллекция", ВходящаяКоллекция);
	СтруктураКВозврату.Вставить("ИмяВходящейКоллекции", ИмяВходящейКоллекции);
	Возврат СтруктураКВозврату;
КонецФункции

Функция СоздатьИЗаполнитьКоллекциюОбъектаXDTO(Фабрика, Источник, ПространствоИмен, СтруктураКоллекции)	
	ТипКоллекции = Фабрика.Тип(ПространствоИмен, СтруктураКоллекции.ИмяКоллекции);
	Коллекция = Фабрика.Создать(ТипКоллекции);					  
	Если ТипЗнч(Источник) = Тип("ТаблицаЗначений") Тогда
		Для каждого СтрокаТЧ из Источник Цикл                                    
			ТипЭкземпляра = Фабрика.Тип(ПространствоИмен, СтруктураКоллекции.ИмяЭкземпляра);
			Экземпляр = Фабрика.Создать(ТипЭкземпляра); 
			ЗаполнитьЗначенияСвойств(Экземпляр, СтрокаТЧ);                                   
			Коллекция[СтруктураКоллекции.ИмяЭкземпляра].Добавить(Экземпляр);						
		КонецЦикла;
	Иначе 
		Пока Источник.Следующий() Цикл
			ТипЭкземпляра = Фабрика.Тип(ПространствоИмен, СтруктураКоллекции.ИмяЭкземпляра);
			Экземпляр = Фабрика.Создать(ТипЭкземпляра); 
			ЗаполнитьЗначенияСвойств(Экземпляр, Источник);                                   
			Если НЕ СтруктураКоллекции.ВходящаяКоллекция = Неопределено Тогда
				ВыборкаСледующегоУровня = Источник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				ВходящаяКоллекция = СоздатьИЗаполнитьКоллекциюОбъектаXDTO(Фабрика, ВыборкаСледующегоУровня, ПространствоИмен, СтруктураКоллекции.ВходящаяКоллекция);
				Экземпляр.Установить(СтруктураКоллекции.ИмяВходящейКоллекции, ВходящаяКоллекция);
			КонецЕсли;
			Коллекция[СтруктураКоллекции.ИмяЭкземпляра].Добавить(Экземпляр);						
		КонецЦикла;
	КонецЕсли;
	Возврат Коллекция;
КонецФункции


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	УстановитьНовыйНомер();
КонецПроцедуры

