
// Возвращает правила формирования услуг, действующие на дату
//
// Параметры:
//  ДатаПравил - Дата - Дата среза правил
// 
Функция ДействующиеПравила(ДатаПравил = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаФормированияУслугДепозитария.Услуга КАК Услуга,
	|	ПравилаФормированияУслугДепозитария.Правило КАК Правило,
	|	ПравилаФормированияУслугДепозитария.ПорядокУслуги КАК ПорядокУслуги
	|ИЗ
	|	РегистрСведений.ПравилаФормированияУслугДепозитария.СрезПоследних(&ДатаПравил, ) КАК ПравилаФормированияУслугДепозитария
	|ГДЕ
	|	ПравилаФормированияУслугДепозитария.ФлагАктивности";
	
	Запрос.УстановитьПараметр("ДатаПравил", ДатаПравил);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выбрать();
	КонецЕсли;
	
КонецФункции