&НаКлиенте
Перем ДанныеРасшифровки;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("КД") Тогда
		Отчет.КД = Параметры.КД;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ПолеОтчета.ОтображениеСостояния.Видимость = Ложь;
	Элементы.ПолеОтчета.ОтображениеСостояния.ДополнительныйРежимОтображения =
		ДополнительныйРежимОтображения.НеИспользовать;
		
	Если ЗначениеЗаполнено(Отчет.КД) Тогда
		ОбновитьОтчет(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "СтруктураПодчиненностиКДWTRC" И Параметр.Свойство("КД") Тогда
		Отчет.КД = Параметр.КД;
		Если ЗначениеЗаполнено(Отчет.КД) Тогда
			ОбновитьОтчет(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПолеОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ДанныеРасшифровки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") тогда
		ЭлементРасшифровки = ДанныеРасшифровки.Элементы[Расшифровка];
		Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			Для Каждого Поле Из ЭлементРасшифровки.ПолучитьПоля() Цикл
				ОткрытьЗначение(Поле.Значение);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ОбновитьОтчет(Команда)
	Результат = РезультатОбновленияОтчетаНаСервере();
	Если Результат.Свойство("ДанныеРасшифровки") Тогда
		ДанныеРасшифровки = Результат.ДанныеРасшифровки;
	Иначе
		ДанныеРасшифровки = Неопределено;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ФУНКЦИИ

&НаСервере
Функция РезультатОбновленияОтчетаНаСервере()
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	// Тут была ошибка, связанная с тем, что функция возвращала РезультатОтчета в виде структуры, содержащей в элементе ДанныеРасшифровки
	// значение типа ДанныеРасшифровкиКомпоновкиДанных. Значение такого типа нельзя передавать на клиент. Поставлена заглушка.
	ОтчетОбъект.РезультатОбновленияОтчета(ПолеОтчета);
	
	Возврат Новый Структура();
КонецФункции
