
// Формирует отчет по ошибкам и отправляет в поддержку
Процедура СформироватьИОтправить() Экспорт
	ОтчетПоОшибкам = Отчеты.ОтчетПоОшибкаKafka.Создать();
	Результат = Новый ТабличныйДокумент;
	ОтчетПоОшибкам.СкомпоноватьРезультат(Результат);
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаОтчетовОшибкиЖР;
	НастройкаОтправки = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	Если НЕ НастройкаОтправки = Неопределено Тогда
		Расширение = "xlsx";
		ВременныйФайл = ПолучитьИмяВременногоФайла(Расширение);
		ТекущаяДатаСтрокой = Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy");
		ИмяВременногоФайла = "Отчет по ошибкам журнала сообщений Kafka " + ТекущаяДатаСтрокой;
		Результат.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента.XLSX);
		Вложения = Новый Соответствие;
		ПараметрыУведомления = Новый Соответствие;
		ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкаОтправки);
		ПараметрыУведомления.Вставить("ТемаПисьма",			ИмяВременногоФайла);
		ПараметрыУведомления.Вставить("ТекстПисьма",		"");
		ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.HTML);
		ПараметрыУведомления.Вставить("Кодировка",			"windows-1251");
		
		ДанныеФайла = Новый ДвоичныеДанные(ВременныйФайл);
		Вложения.Вставить(ИмяВременногоФайла + "." + Расширение, ДанныеФайла);
		ПараметрыУведомления.Вставить("Вложения", Вложения);
		РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
		УдалитьФайлы(ВременныйФайл);
	КонецЕсли;
КонецПроцедуры