#Область ПрограммныйИнтерфейс

// Эта функция пересчитывает сумму из валюты ВалютаНач по курсу ПоКурсуНач в валюту ВалютаКон по курсу ПоКурсуКон.
// Отличия от функции ОбщегоНазначения.ПересчитатьИзВалютыВВалюту следующие:
// 	1) Округление результата до 6 знаков, а не до 2.
// 	2) Замена кратностей равных нулю на 1 для расчета
// 	3) При делении на ноль не выдается сообщение об ошибке.
//
// Параметры:
// 	Сумма          - Число - сумма, которую следует пересчитать;
// 	ВалютаНач      - СправочникСсылка.Валюты - валюта из которой надо пересчитвать;
// 	ВалютаКон      - СправочникСсылка.Валюты - валюта в которую надо пересчитвать;
// 	ПоКурсуНач     - Число - курс валюты из которй надо пересчитать;
// 	ПоКурсуКон     - Число - курс валлюты в которую надо пересчитать;
// 	ПоКратностьНач - Число - кратность валюты из которой надо пересчитать (если 0, то в расчете будет использоватся 1);
// 	ПоКратностьКон - Число - кратность валюты в которую надо пересчитать (если 0, то в расчете будет использоватся 1);
//
// Возвращаемое значение: 
//  Число - Сумма, пересчитанная в другую валюту
//
Функция ИзВалютыВВалюту6Знаков(Сумма, ВалютаНач, ВалютаКон, ПоКурсуНач, ПоКурсуКон, Знач ПоКратностьНач, Знач ПоКратностьКон) Экспорт
	Если (ВалютаНач = ВалютаКон) Тогда
		Возврат Сумма;
	КонецЕсли;
	
	Если ПоКратностьНач = 0 Тогда
		ПоКратностьНач = 1;
	КонецЕсли;
	Если ПоКратностьКон = 0 Тогда
		ПоКратностьКон = 1;
	КонецЕсли;
	
	Если (ПоКурсуНач = ПоКурсуКон) И (ПоКратностьНач = ПоКратностьКон) Тогда
		Возврат Сумма;
	КонецЕсли;
	
	Если ПоКурсуНач = 0 Или ПоКурсуКон = 0 Тогда
		СуммаВВалютеКон = 0;
	Иначе
		СуммаВВалютеКон = Окр((Сумма * ПоКурсуНач * ПоКратностьКон) / (ПоКурсуКон * ПоКратностьНач), 6);
	КонецЕсли;
		
	Возврат СуммаВВалютеКон;
КонецФункции

// Возвращает пустую таблицу значений для заполнения результатами расчета
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция НовыеРезультатыРасчета() Экспорт
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	РезультатыРасчета = Новый ТаблицаЗначений;
	РезультатыРасчета.Колонки.Добавить("ВидРасчета", ТипСтрока);
	РезультатыРасчета.Колонки.Добавить("ДатаРасчета", ТипСтрока);
	РезультатыРасчета.Колонки.Добавить("СостояниеБыло", Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияРасчетаРыночныхЦен"));
	РезультатыРасчета.Колонки.Добавить("СостояниеСтало", Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияРасчетаРыночныхЦен"));
	РезультатыРасчета.Колонки.Добавить("Отказ", Новый ОписаниеТипов("Булево"));
	РезультатыРасчета.Колонки.Добавить("ТекстОтказа", ТипСтрока);
	РезультатыРасчета.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	РезультатыРасчета.Колонки.Добавить("Комментарий", ТипСтрока);
	
	Возврат РезультатыРасчета;
	
КонецФункции

// Определяет есть ли в таблице значений строка со значением "Окончательный расчет" в колонке "ВидРасчета"
//
// Параметры:
// 	РезультатыРасчета - ТаблицаЗначений - таблица с колонками соответствующими результату функции НовыеРезультатыРасчета() см.выше
//
// Возвращаемое значение:
//  Булево
//
Функция ЕстьОкончательныйРасчет(РезультатыРасчета) Экспорт
	
	СтруктураПоиска = Новый Структура("ВидРасчета", "Окончательный расчет");
	ОкончательныеРасчеты = РезультатыРасчета.НайтиСтроки(СтруктураПоиска);
	
	Возврат ОкончательныеРасчеты.Количество() > 0;
	
КонецФункции

// Отправляет уведомление о результатах расчета рыночных цен ЦБ по электронной почте
//
// Параметры:
// 	ВнешнийИсточник	 - ПланВидовХарактеристикСсылка
// 	ПериодСтрокой	 - Строка
// 	МетодикаРасчета	 - ПеречислениеСсылка.МетодикиРасчетаРыночныхЦен
// 	РезультатыРасчета - ТаблицаЗначений - таблица с колонками соответствующими результату функции НовыеРезультатыРасчета() см.выше
//
Процедура ОтправитьУведомлениеОРасчетеРыночныхЦен(ВнешнийИсточник, ПериодСтрокой, МетодикаРасчета, РезультатыРасчета) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатыРасчета) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	Если НастройкиОбмена = Неопределено Тогда
		ТекстОшибки = "Не заданы параметры внешнего источника """ + Строка(ВнешнийИсточник) + """";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ИмяСобытия = "Уведомление о расчете рыночных цен не отправлено";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Предупреждение, , , ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ИмяФайлаОтчета = "Результаты расчета рыночных цен " + Строка(МетодикаРасчета);
	ТабличныйДокумент = ОбщегоНазначения.ДанныеТаблицыЗначенийВТабличныйДокументСКД(РезультатыРасчета);
	ФайлОтчета = ПолучитьИмяВременногоФайла("XLS");
	ТабличныйДокумент.Записать(ФайлОтчета, ТипФайлаТабличногоДокумента.XLS);
	
	СписокВложений = Новый Соответствие;
	СписокВложений.Вставить(ИмяФайлаОтчета + ".xls", Новый ДвоичныеДанные(ФайлОтчета));
	Попытка
		УдалитьФайлы(ФайлОтчета);
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
	ТемаПисьма = ИмяФайлаОтчета + " за период " + ПериодСтрокой;
	ТекстПисьма = ТекстУведомленияОРезультатахРасчета(РезультатыРасчета);
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("Вложения",			СписокВложений);
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.HTML);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКОтправке(ПараметрыУведомления);
	
КонецПроцедуры

// Проверяет наличие котировок НРД и CBonds на дату расчета
//
// Параметры:
//  СквозныеПараметры		 - Структура - Струкутра с параметрами расчета рыночных цен ЦБ, в том числе, используемые тут:
//  ----.*Регламент					 - Булево - Расчет выполнется не выборочно, а по всем бумагам с остатками
//  ---- *ДатаРасчета				 - Дата   - Дата, за которую выполняется расчет
//  ОбязательнаяПроверка	 - Булево - Нужно проверить наличие котировок
//
Процедура ПроверитьНаличиеКотировокНРДиCBonds(СквозныеПараметры, ОбязательнаяПроверка = Истина) Экспорт
	
	Если СквозныеПараметры.Регламент И ОбязательнаяПроверка Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период", НачалоДня(СквозныеПараметры.ДатаРасчета));
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьКотировки
		|ИЗ
		|	РегистрСведений.Котировки КАК Котировки
		|ГДЕ
		|	Котировки.Период = &Период
		|	И Котировки.Биржа В (ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.НРД), ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.CBonds))";
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ВызватьИсключение "Нет котировок НРД и CBonds за дату " + Формат(СквозныеПараметры.ДатаРасчета, "ДЛФ=D");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает вид расчета строкой в пераметре НовыйРезультатРасчета
//
// Параметры:
//  СквозныеПараметры		 - Структура - Струкутура с параметрами расчета рыночных цен ЦБ, в том числе, используемые тут:
//  ----.*ПервичныйРасчет			 - Булево - выполняется фаза первичного расчета
//  ----.*ОкончательныйРасчет		 - Булево - выполняется фаза окончательного расчета (после получения недостающих котировок из внешних систем)
//  НовыйРезультатРасчета	 - Строка - возвращаемый параметр с Видом расчета
Процедура СформироватьВидРасчетаСтрокой(СквозныеПараметры, НовыйРезультатРасчета) Экспорт
	Если СквозныеПараметры.ПервичныйРасчет Тогда
		НовыйРезультатРасчета.ВидРасчета = "Предварительный расчет";
	ИначеЕсли СквозныеПараметры.ОкончательныйРасчет Тогда
		НовыйРезультатРасчета.ВидРасчета = "Окончательный расчет";
	Иначе
		НовыйРезультатРасчета.ВидРасчета = "Без расчета";
	КонецЕсли;
КонецПроцедуры

// Пересчитывает рыночные цены ЦБ из валюты ЦБ в валюту котировки в таблице значений РасчетРыночныхЦенЦенныхБумаг
// 
// Параметры:
//  РасчетРыночныхЦенЦенныхБумаг - ТаблицаЗначений - ТЗ предназначенная для загрузки в РС РыночныеЦеныЦенныхБумаг
//  и включающая,в частности, следующие использемые в этой процедуре колонки:
//  ----.*ЦенаЦБ				 - СправочникСсылка.ЦенныеБумаги
//  ----.*Цена					 - Число
//  ----.*Валюта				 - СправочникСсылка.Валюты
//  ----.*ВалютаЦБ				 - СправочникСсылка.Валюты
//  ----.*КурсыВалютКурс		 - Число
//  ----.*КурсыВалютЦБКурс		 - Число
//  ----.*КурсыВалютКратность	 - Число
//  ----.*КурсыВалютЦБКратность	 - Число
Процедура РассчитатьЦеныВВалютеЦБ(РасчетРыночныхЦенЦенныхБумаг) Экспорт
	Для Каждого ДанныеЦБ Из РасчетРыночныхЦенЦенныхБумаг Цикл
		ДанныеЦБ.ЦенаЦБ = РасчетРыночныхЦенОбщее.ИзВалютыВВалюту6Знаков(ДанныеЦБ.Цена, ДанныеЦБ.Валюта, ДанныеЦБ.ВалютаЦБ,
								ДанныеЦБ.КурсыВалютКурс, ДанныеЦБ.КурсыВалютЦБКурс, ДанныеЦБ.КурсыВалютКратность, ДанныеЦБ.КурсыВалютЦБКратность);
	КонецЦикла;
КонецПроцедуры

// Помещает данные из ТЗ РасчетРыночныхЦенЦенныхБумаг в регистр сведений РыночныеЦеныЦенныхБумаг
//
// Параметры:
//  СквозныеПараметры	 - Структура - Структура с параметрами расчета рыночных цен ЦБ, в том числе, используемые в этой процедуре:
//  ----.*ДатаРасчета			 - Дата - дата, за которую выполняется расчет
//  ----.*МетодикаРасчета		 - ПеречислениеСсылка.МетодикиРасчетаРыночныхЦен
//  ----.*Регламент				 - Булево - расчет выполняется не выборочно, а по всем бумагам с остатками
//  РасчетРыночныхЦенЦенныхБумаг - ТаблицаЗначений  - таблица значений предназначенная для загрузки в РС РыночныеЦеныЦенныхБумаг
//
Процедура ЗаписатьРыночныеЦены(СквозныеПараметры, РасчетРыночныхЦенЦенныхБумаг) Экспорт
	
	// Записываем регистр
	РегистрыСведенийРыночныеЦеныЦенныхБумаг = РегистрыСведений.РыночныеЦеныЦенныхБумаг.СоздатьНаборЗаписей();
	РегистрыСведенийРыночныеЦеныЦенныхБумаг.Отбор.Период.Установить(СквозныеПараметры.ДатаРасчета);
	РегистрыСведенийРыночныеЦеныЦенныхБумаг.Отбор.МетодикаРасчета.Установить(СквозныеПараметры.МетодикаРасчета);
	
	// Это оптимизация - т.к. запись выполняется в рамках расчеты рыночных цен, то если мы знает, что перерасчитываются рыночные цены
	// всех ЦБ, то можем выполнять запись более оптимально - одной операцией. В проивном случае для каждой ЦБ нужно это будет сделать
	// отдельно.
	Если СквозныеПараметры.Регламент Тогда
		РегистрыСведенийРыночныеЦеныЦенныхБумаг.Очистить();
		РегистрыСведенийРыночныеЦеныЦенныхБумаг.Загрузить(РасчетРыночныхЦенЦенныхБумаг);
		РегистрыСведенийРыночныеЦеныЦенныхБумаг.Записать();
	Иначе
		Для Каждого РыночнаяЦенаЦеннойБумаги Из РасчетРыночныхЦенЦенныхБумаг Цикл
			РегистрыСведенийРыночныеЦеныЦенныхБумаг.Отбор.ЦеннаяБумага.Установить(РыночнаяЦенаЦеннойБумаги.ЦеннаяБумага);
			РегистрыСведенийРыночныеЦеныЦенныхБумаг.Очистить();
			НоваяРыночнаяЦена = РегистрыСведенийРыночныеЦеныЦенныхБумаг.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяРыночнаяЦена, РыночнаяЦенаЦеннойБумаги);
			РегистрыСведенийРыночныеЦеныЦенныхБумаг.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ТекстУведомленияОРезультатахРасчета(РезультатыРасчета)
	
	ПС = "<br>";			// Тег HTML означает перевод строки
	ВключитьBold = "<b>";	// Тег HTML означает включить жирный шрифт
	ОтключитьBold = "</b>";	// Тег HTML означает отключить жирный шрифт
	
	ТекстЗаголовка = "Добрый день!" + ПС + ПС
		+ "Уведомление о результатах расчета рыночных цен ценных бумаг"
		+ ПС + Символы.ПС;
	Текст = "<html><BODY>" + Символы.ПС
			+ ТекстЗаголовка + ПС + Символы.ПС;
	
	ПараметрыТрансформацииВHTML = Новый Структура;
	ПараметрыТрансформацииВHTML.Вставить("ПунктПорядкуИспользуется", Истина);
	ПараметрыТрансформацииВHTML.Вставить("ШиринаТаблицы", "1000");
	ПараметрыТрансформацииВHTML.Вставить("Ширина8", "400");
	ПараметрыТрансформацииВHTML.Вставить("ЦветШапки", "eadbaf");
	ПараметрыТрансформацииВHTML.Вставить("Заголовок1", "Вид расчета");
	ПараметрыТрансформацииВHTML.Вставить("Заголовок2", "Дата расчета");
	
	ТаблицаHTML = ОбщегоНазначения.ТаблицаЗначенийВТаблицуHTML(РезультатыРасчета, ПараметрыТрансформацииВHTML);
	Организация = СокрЛП(ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию().Наименование);
	
	Текст = Текст + ВключитьBold + ТаблицаHTML + ОтключитьBold + ПС + Символы.ПС + ПС + Символы.ПС;
	Текст = Текст + Организация + ПС + Символы.ПС;
	Текст = Текст + "</BODY></html>";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти