
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - Булево - Признак отказа от создания формы
//  СтандартнаяОбработка - Булево - Признак выполнения стандартной (системной) обработки события
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДоступностьДляW8();
	
	Копирование = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	
	Если Копирование Тогда
		
		Запись.Основание = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновленыПредоставленныеДокументы",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленнаяФормаПриИзменении(Элемент)
	ОбновитьДоступностьДляW8();
	ОбновитьРеквизитыПоПредоставленнойФорме();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьДляW8()
	ДоступностьW8 = НЕ ЗначениеЗаполнено(Запись.ПредоставленнаяФорма);
	Элементы.СрокДействия.Доступность = ДоступностьW8;
	Элементы.ДатаПредоставления.Доступность = ДоступностьW8;
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыПоПредоставленнойФорме()
	Запись.СрокДействия = Запись.ПредоставленнаяФорма.СрокДействия;
	Запись.ДатаПредоставления = Запись.ПредоставленнаяФорма.ДатаПредоставления;
КонецПроцедуры
