
// IMAPPS-36274 ++
Функция ПолучитьПортфелиПоОтборуСКД(НастройкаЗакрытияПортфелейПоРасписанию, ИсходныйСписокПортфелей) Экспорт
	
	Если Не ЗначениеЗаполнено(НастройкаЗакрытияПортфелейПоРасписанию) Тогда
		Возврат ИсходныйСписокПортфелей;
	КонецЕсли;
	
	НастройкиОтбораСКД = НастройкаЗакрытияПортфелейПоРасписанию.НастройкиОтбораПортфелейСКД;
	Если Не ЗначениеЗаполнено(НастройкиОтбораСКД) Тогда
		Возврат ИсходныйСписокПортфелей;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИсходныйСписокПортфелей) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	НастройкиКомпоновки = НастройкиОтбораСКД.Получить();
	Если Не ЗначениеЗаполнено(НастройкиКомпоновки)
		Или НастройкиКомпоновки.Отбор.Элементы.Количество() = 0 Тогда
		Возврат ИсходныйСписокПортфелей;
	КонецЕсли;
	
	СхемаКомпоновки = Справочники.Портфели.ПолучитьМакет("МакетОтбораПортфелей");
	УстановитьПараметрыСКД(НастройкиКомпоновки, "СписокПортфелей", ИсходныйСписокПортфелей);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(
		СхемаКомпоновки,
		НастройкиКомпоновки,
		,
		,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	Процессор = Новый ПроцессорКомпоновкиДанных;
	Процессор.Инициализировать(Макет);
	
	Вывод = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Вывод.УстановитьОбъект(ТаблицаЗначений);
	Вывод.Вывести(Процессор);
	
	Возврат ТаблицаЗначений.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура УстановитьПараметрыСКД(Настройки, ИмяПараметра, Значение) Экспорт
	
	ПараметрСКД = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	Если ПараметрСКД <> Неопределено Тогда
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение = Значение;
	КонецЕсли;
	
КонецПроцедуры

// IMAPPS-36274 --
