
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДополнительнаяОбработкаСсылка", ДопОбработка);
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Версия = ТекОбъект.СведенияОВнешнейОбработке().Версия;
	Заголовок = Заголовок + "v."+Версия;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настройки(Команда)
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ДопОбработка", ДопОбработка);
	ОткрытьФорму("ВнешняяОбработка.внРаспространениеПравилСОдногоКлиентаНаСписокКлиентов.Форма.ФормаНастройки", ДопПараметры, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Отладка(Команда)
	ОтладкаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтладкаНаСервере()
	//ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	//
	//СсылкаНаОбработку = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Распространение правил с одного клиента на список клиентов", Истина);
	//
	//ПараметрыКоманды = Новый Структура;
	//ПараметрыКоманды.Вставить("ДополнительнаяОбработкаСсылка", СсылкаНаОбработку);
	//ПараметрыКоманды.Вставить("ИдентификаторПроцесса", "ЗаписьДопСведений");
	//
	//НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Объект.Установить(Портфель);
	//НаборЗаписей.Отбор.Свойство.Установить(Объект.ЛимитыСтратегия_риски);
	//
	//НоваяЗапись = НаборЗаписей.Добавить();
	//НоваяЗапись.Объект = Портфель;
	//НоваяЗапись.Свойство = Объект.ЛимитыСтратегия_риски;
	//НоваяЗапись.Значение = Стратегия;
	//
	////НаборЗаписей.Записать();
	//
	//ПараметрыКоманды.Вставить("Источник", НаборЗаписей);
	//
	//ОбработкаОбъект.ВыполнитьКоманду("ФоновоеВыполнение", ПараметрыКоманды);
	
	//ПараметрыКоманды = Новый Структура;
	//ПараметрыКоманды.Вставить("ДополнительнаяОбработкаСсылка", СсылкаНаОбработку);
	////ПараметрыКоманды.Вставить("ИдентификаторКоманды", "ФоновоеВыполнение");
	//ПараметрыКоманды.Вставить("ИдентификаторПроцесса", "ЗаписьУстановкиЛимитов");
	//ПараметрыКоманды.Вставить("Источник", УстановкаЛимитов);
	//
	//ОбработкаОбъект.ВыполнитьКоманду("ФоновоеВыполнение", ПараметрыКоманды);
	
КонецПроцедуры

#КонецОбласти