
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ДатаНач = НачалоМесяца(ТекущаяДата());
	Отчет.ДатаКон = КонецМесяца(ТекущаяДата());
	
	УстановитьВидимостьДоступностьЭлементовФормы();
		
КонецПроцедуры


&НаСервере
Процедура СформироватьОтчетНаСервере()
	Таблица.Очистить();
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	ЭтотОтчет.СформироватьОтчет(Таблица);
	
	// Установим параметры табличного документа
	Таблица.АвтоМасштаб 		= Истина;
	Таблица.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	Таблица.ОтображатьЗаголовки	= Ложь;
	Таблица.ОтображатьСетку		= Ложь;
	Таблица.ФиксацияСверху		= 6;
	Таблица.ТолькоПросмотр		= Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Отчет.ДатаНач)
		ИЛИ ОбщегоНазначения.ЗначениеНеЗаполнено(Отчет.ДатаКон) Тогда 	
	    Сообщить("Не указан период формирования отчета!", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	Если Отчет.ДатаНач > Отчет.ДатаКон Тогда
		Сообщить("Период формирования отчета задан неверно!", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;	 
	
	ВремяНачала = ТекущаяДата();
	СформироватьОтчетНаСервере();
	ВремяОкончания = ТекущаяДата();
	ПоказатьОповещениеПользователя("Отчет сформирован",, "Время формирования за период "
		+ ПредставлениеПериода(Отчет.ДатаНач, КонецДня(Отчет.ДатаКон), "ФП=Истина")
		+ " составило " + Окр((ВремяОкончания-ВремяНачала)/60) + " мин.");
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение или ТолстыйКлиентУправляемоеПриложение Тогда
		НастройкаПериода = Новый НастройкаПериода;
		НастройкаПериода.УстановитьПериод(Отчет.ДатаНач, ?(Отчет.ДатаКон=Дата("00010101"), Отчет.ДатаКон, КонецДня(Отчет.ДатаКон)));
		НастройкаПериода.РедактироватьКакПериод = Истина;
		НастройкаПериода.ВариантНастройки 		= ВариантНастройкиПериода.Период;
		
		Если НастройкаПериода.Редактировать() Тогда
			Отчет.ДатаНач = НастройкаПериода.ПолучитьДатуНачала();
			Отчет.ДатаКон = НастройкаПериода.ПолучитьДатуОкончания();
		КонецЕсли;
	#Иначе
		Диалог	= Новый ДиалогРедактированияСтандартногоПериода();		
		Диалог.Период.ДатаНачала	= Отчет.ДатаНач;
		Диалог.Период.ДатаОкончания	= ?(Отчет.ДатаКон=Дата('0001-01-01'), Отчет.ДатаКон, КонецДня(Отчет.ДатаКон));
		Диалог.Период.Вариант		= ВариантСтандартногоПериода.ПроизвольныйПериод;
		
		Если Диалог.Редактировать() Тогда
			Отчет.ДатаНач	= Диалог.Период.ДатаНачала;
			Отчет.ДатаКон	= Диалог.Период.ДатаОкончания;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Отбор(Команда)
	Элементы.ФормаОтбор.Пометка = НЕ Элементы.ФормаОтбор.Пометка;
	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	Элементы.ФормаНастройки.Пометка = НЕ Элементы.ФормаНастройки.Пометка;
	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруИспользуемыхОтборов()
	СтруктураИспользуемыхОтборов = Новый Структура;
	ЭлементыОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Для Каждого Эл Из ЭлементыОтбора Цикл
		Если Эл.Использование Тогда
			СтруктураИспользуемыхОтборов.Вставить(СокрЛП(Эл.ЛевоеЗначение), Эл.ПравоеЗначение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураИспользуемыхОтборов;
КонецФункции

/////////////////////////////////////////////////////////////////
// ФОРМА

&НаСервере
Функция ПолучитьКоличествоАктивныхОтборов()
	Возврат ПолучитьСтруктуруИспользуемыхОтборов().Количество();	
КонецФункции

&НаСерверебезКонтекста 
Функция СформироватьТаблицуНастраиваемыхОтборов()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Отбор");
	ТЗ.Колонки.Добавить("Доступность");
	ТЗ.Колонки.Добавить("Использование");
	
	НС = ТЗ.Добавить();
	НС.Отбор = "Депонент";
	НС.Доступность   = Истина;
	НС.Использование = Истина;
	
	НС = ТЗ.Добавить();
	НС.Отбор = "ЦеннаяБумага";
	НС.Доступность   = Истина;
	НС.Использование = Истина;
	
	Возврат ТЗ;
КонецФункции

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	
	Элементы.ГруппаОтбор.Видимость = Элементы.ФормаОтбор.Пометка;
	
	ЭлементыОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	тзНастраиваемыеОтборы = СформироватьТаблицуНастраиваемыхОтборов();
	
	// настроим отбор по элементам, видимостью которых можно управлять
	к = ЭлементыОтбора.Количество(); // количество элементов отбора
	Пока к > 0 Цикл
		
		текОтбор  = ЭлементыОтбора.Получить(к-1);
		стрОтборы = тзНастраиваемыеОтборы.Найти(СокрЛП(текОтбор.ЛевоеЗначение), "Отбор");
		
		Если стрОтборы <> Неопределено Тогда // это настраиваемый элемент отбора
			Если стрОтборы.Доступность = Ложь Тогда
				ЭлементыОтбора.Удалить(текОтбор);      // удалим недоступный отбор
			Иначе
				стрОтборы.Использование = Ложь;        // отбор уже используется
			КонецЕсли; 	
		КонецЕсли; 
		
		к=к-1;
	КонецЦикла;
	
	// добавим в отбор доступные элементы, которые еще не используются
	п = 0;  // порядок вставки
	Для Каждого стрОтборы Из тзНастраиваемыеОтборы Цикл
		      		
		Если стрОтборы.Доступность = Истина И стрОтборы.Использование = Истина Тогда 
			НовыйЭлемент = ЭлементыОтбора.Вставить(п, Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(стрОтборы.Отбор);
			НовыйЭлемент.Использование = Ложь;
		КонецЕсли; 	
		Если стрОтборы.Доступность = Истина Тогда
			п=п+1;	
		КонецЕсли;	 
		
	КонецЦикла;	
	
	// получим количество отборов с признаком "Использование"
	КоличествоАктивныхОтборов      	 = ПолучитьКоличествоАктивныхОтборов();
	Элементы.ФормаОтбор.Заголовок  	 = "Отбор" + ?(КоличествоАктивныхОтборов > 0, " ("+КоличествоАктивныхОтборов+")", "");
    		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

/////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры
              
&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.ТекущийЭлемент.Имя = "КомпоновщикНастроекНастройкиОтборЛевоеЗначение" Тогда
	    Отказ = Истина;
	КонецЕсли; 
КонецПроцедуры
