&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Для Каждого ПараметрКоманды ИЗ ПараметрКоманды Цикл
		Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Необходимо записать документ.");
			Продолжить;
		КонецЕсли;
		
		УведомленияКлиентов = НовыйДокументУведомлениеКлиентаНаСервере(ПараметрКоманды);
		Для Каждого Документ Из УведомленияКлиентов Цикл
			ПараметрыФормы = Новый Структура("Ключ", Документ);
			ОткрытьФорму("Документ.УведомлениеКлиентам.Форма.ФормаДокумента", ПараметрыФормы);
		КонецЦикла;
	КонецЦикла;
	
	Оповестить("КорпоративноеДействие_Новый/СформироватьУведомление");
	
КонецПроцедуры

&НаСервере
Функция НовыйДокументУведомлениеКлиентаНаСервере(ДокументОснование)
	
	УведомленияКлиентов = Новый Массив();
	УведомлениеКлиентам = Документы.КорпоративноеДействие_Новый.НовыйДокументУведомлениеКлиента(ДокументОснование);
	Если ЗначениеЗаполнено(УведомлениеКлиентам) Тогда 
		УведомленияКлиентов.Добавить(УведомлениеКлиентам);	
	КонецЕсли;
	
	Возврат УведомленияКлиентов;
	
КонецФункции
