// Функция - Пользователь может редактировать особые условия
// 
// Возвращаемое значение:
//   - Булево - Истина, если пользователь ответственный за особых клиентов
//
Функция ПользовательМожетРедактироватьОсобыеУсловия() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|			&Дата,
	|			ФизическоеЛицо = &ФизЛицо
	|				И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ОтветственныйЗаОсобыхКлиентов)) КАК ОтветственныеЛицаОрганизацийСрезПоследних";
	Запрос.УстановитьПараметр("ФизЛицо", ПараметрыСеанса.ТекущийПользователь.ФизЛицо);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос.Выполнить();
	Возврат (Не РезультатЗапроса.Пустой());
КонецФункции
