#Область ПрограммныйИнтерфейс

// Возвращает булево о том, является ли переданная форма одной из
// ОПроведенииКД_CвязанногоСВыплатой, ОПроведенииКД_CвязанногоСВыплатой_PRED_REDM_MCAL_others,
// или ОПроведенииКД_CвязанногоСВыплатой_INTR_PRII
// Параметры:
//  ФормаСообщенияКК - Перечисления.ФормыСообщенийКК - Форма сообщения кабинета клиента
// Возвращаемое значение:
//  Булево - результат проверки
Функция ЭтоФормаСвязаннаяСВыплатой(ФормаСообщенияКК) Экспорт

	Возврат ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_CвязанногоСВыплатой
		Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_CвязанногоСВыплатой_PRED_REDM_MCAL_others
		Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_CвязанногоСВыплатой_INTR_PRII;

КонецФункции

// Возвращает булево о том, является ли переданная форма одной из связанных с выкупом или приобретением ЦБ:
// ОПроведенииКД_BPUT, ОПроведенииКД_BIDS_TEND, ОПроведенииКД_PRIO или ОПроведенииКД_ВыкупПриобретениеЦБ
// Параметры:
//  ФормаСообщенияКК - Перечисления.ФормыСообщенийКК - Форма сообщения кабинета клиента
// Возвращаемое значение:
//  Булево - результат проверки
Функция ЭтоФормаСвязаннаяСВыкупомИлиПриобретениемЦБ(ФормаСообщенияКК) Экспорт

	Возврат ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_BPUT
		Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_BIDS_TEND
		Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_PRIO
		Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВыкупПриобретениеЦБ;

КонецФункции

// Возвращает булево о том, является ли переданная форма одной из связанных с возвратом части налога:
// ОПроведенииКД_ВозвратЧастиНалога Или ОПроведенииКД_ВозвратЧастиНалогаНДИНД.
// Параметры:
//  ФормаСообщенияКК - Перечисления.ФормыСообщенийКК - Форма сообщения кабинета клиента
// Возвращаемое значение:
//  Булево - результат проверки
Функция ЭтоФормаСвязаннаяСВозвратомЧастиНалога(ФормаСообщенияКК) Экспорт
	
	Возврат ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалога
		Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалогаНДИНД;
	
КонецФункции

// Возвращает булево о том, является ли переданная форма одной из связанных с подтверждением
// освобождения от налога: CreateCorporateActionTrec или CreateCorporateActionWtrc.
// Параметры:
//  ФормаСообщенияКК - Перечисления.ФормыСообщенийКК - Форма сообщения кабинета клиента
// Возвращаемое значение:
//  Булево - результат проверки
Функция ЭтоФормаСвязаннаяСПодтверждениемОсвобожденияОтНалога(ФормаСообщенияКК) Экспорт
	
	Возврат ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.CreateCorporateActionTrec
		Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.CreateCorporateActionWtrc;
	
КонецФункции


#КонецОбласти