#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает строку уникального идентификатора
// поставляемого и предопределенного профиля Администратор.
//
Функция ИдентификаторПрофиляАдминистратор() Экспорт
	
	Возврат "6c4b0307-43a4-4141-9c35-3dd7e9586d41";
	
КонецФункции

// Определяет запрет изменения поставляемого профиля.
// Не поставляемый профиль не может иметь запрета изменения.
//
// Параметры:
//  Профиль      - СправочникОбъект.ПрофилиГруппДоступа,
//                 ДанныеФормыСтруктура созданные по объекту.
//  
// Возвращаемое значение:
//  Булево.
//
Функция ЗапретИзмененияПрофиля(Знач Профиль) Экспорт
	
	Если Профиль = Администратор ИЛИ Профиль = РедактированиеПользователей Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Замещает имеющийся или создает новый поставляемый профиль групп доступа по его описанию.
//
// Параметры:
//  ПрофильСсылка - ссылка на профиль (предопределенный).
// 
// Возвращаемое значение:
//  Булево. Истина - профиль изменен.
//
Функция ОбновитьПрофильГруппДоступа(ПрофильСсылка, НеОбновлятьРолиПользователей = Ложь) Экспорт
	
	ПрофильИзменен = Ложь;
	
	ПрофильОбъект = ПрофильСсылка.ПолучитьОбъект();
				
	ЗаблокироватьДанныеДляРедактирования(ПрофильОбъект.Ссылка, ПрофильОбъект.ВерсияДанных);
	
	ПрофильОбъект.Роли.Очистить();
	Для каждого Роль Из ОписаниеРолейПрофиля(ПрофильСсылка) Цикл
		МетаданныеРоли = Метаданные.Роли.Найти(Роль);
		Если МетаданныеРоли = Неопределено Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При обновлении поставляемого профиля ""%1""
			|роль ""%2"" не найдена в метаданных.'"),
			ПрофильСсылка.Наименование,
			Роль);
		КонецЕсли;
		ПрофильОбъект.Роли.Добавить().Роль = Роль;
	КонецЦикла;
	
	Если НеОбновлятьРолиПользователей Тогда
		ПрофильОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьРолиПользователей");
	КонецЕсли;
	ПрофильОбъект.Записать();
	РазблокироватьДанныеДляРедактирования(ПрофильОбъект.Ссылка);
		
	Возврат ПрофильИзменен;
	
КонецФункции

Функция ОписаниеРолейПрофиля(Профиль)
	
	ОписаниеРолейПрофиля = Новый Массив;
	
	Если Профиль = Администратор Тогда
		
		ИмяРолиАдминистратораСистемы = Метаданные.Роли.Администратор.Имя;
		
		Если ОписаниеРолейПрофиля.Найти(ИмяРолиАдминистратораСистемы) = Неопределено Тогда
			ОписаниеРолейПрофиля.Добавить(ИмяРолиАдминистратораСистемы);
		КонецЕсли;
		
	ИначеЕсли Профиль = РедактированиеПользователей Тогда
		
		ИмяРолиРедактированияПользователей = Метаданные.Роли.ДобавлениеИзменениеПользователей.Имя;
		
		Если ОписаниеРолейПрофиля.Найти(ИмяРолиРедактированияПользователей) = Неопределено Тогда
			ОписаниеРолейПрофиля.Добавить(ИмяРолиРедактированияПользователей);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОписаниеРолейПрофиля;
	
КонецФункции

#КонецЕсли
