
&Вместо("ТекстЗапросаТаблицыПоПродажамБУ_БезНКД")
Функция optOst_ТекстЗапросаТаблицыПоПродажамБУ_БезНКД(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВТ_ХозрасчетныйОстатки"         , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_ОстаткиТело"                 , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_ОстаткиПереоценка"           , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаАктивы"		   , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СписаниеАктивовТаблицаАктивы"   , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СписаниеАктивовОстатки"         , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СписаниеАктивовПереоценка"      , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("КоличествоВсего"				   , НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	ХозрасчетныйОстатки.ДоговорДУ,
	|	ХозрасчетныйОстатки.Валюта,
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто2,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ХозрасчетныйОстатки.КоличествоОстатокДт,
	|	ХозрасчетныйОстатки.СуммаОстаток,
	|	ХозрасчетныйОстатки.ВалютнаяСуммаОстаток,
	|	ХозрасчетныйОстатки.СуммаНУОстатокДт КАК СуммаНУОстаток
	|ПОМЕСТИТЬ ВТ_ХозрасчетныйОстатки
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&Период,
	|			Счет В (&СчетаОстатков),
	|			,
	|			ДоговорДУ = &ДоговорДУ
	|				И Субконто1 = &АктивОбъект
	|				И Валюта = &ВалютаЦБ
	|				И ТИПЗНАЧЕНИЯ(Субконто2) <> ТИП(Документ.СделкаРЕПОПерваяНога)) КАК ХозрасчетныйОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Актив КАК Актив,
	|	ВТ_ХозрасчетныйОстатки.Счет КАК Счет,
	|	ВТ_ХозрасчетныйОстатки.Валюта КАК Валюта,
	|	ВТ_ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	|	ВТ_ХозрасчетныйОстатки.Субконто2 КАК Партия,
	|	ВТ_ХозрасчетныйОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ВТ_ХозрасчетныйОстатки.КоличествоОстатокДт КАК КоличествоОстатокДт
	|ПОМЕСТИТЬ ВТ_ОстаткиТело
	|ИЗ
	|	ВТ_ХозрасчетныйОстатки КАК ВТ_ХозрасчетныйОстатки
	|ГДЕ
	|	ВТ_ХозрасчетныйОстатки.Счет = &СчетУчетаАктива
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ХозрасчетныйОстатки.Счет КАК Счет,
	|	ВТ_ХозрасчетныйОстатки.Валюта КАК Валюта,
	|	ВТ_ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	|	ВТ_ХозрасчетныйОстатки.Субконто2 КАК Партия,
	|	ВТ_ХозрасчетныйОстатки.СуммаОстаток,
	|	ВТ_ХозрасчетныйОстатки.ВалютнаяСуммаОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиПереоценка
	|ИЗ
	|	ВТ_ХозрасчетныйОстатки КАК ВТ_ХозрасчетныйОстатки
	|ГДЕ
	|	ВТ_ХозрасчетныйОстатки.Счет = &СчетУчетаАктиваПереоценка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сделка.Ссылка,
	|	1 КАК НомерСтроки,
	|	Сделка.Актив,
	|	&АктивОбъект КАК АктивОбъект,
	|	Сделка.Количество,
	|	ВЫРАЗИТЬ(Сделка.Сумма КАК ЧИСЛО(15, 2)) КАК СуммаВзаиморасчетов,
	|	ВЫРАЗИТЬ(Сделка.НКД КАК ЧИСЛО(15, 2)) КАК НКД,
	|	Сделка.СчетУчетаАктива КАК СчетУчета,
	|	Сделка.ВалютаДокумента КАК ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(Сделка.ВалютаЦБ, Сделка.ВалютаДокумента) КАК ВалютаЦБ,
	|	Сделка.КурсЦБ КАК КурсВалютыЦБ,
	|	Сделка.КратностьЦБ КАК КратностьВалютыЦБ,
	|	Сделка.ВидОбращаемости,
	|	Сделка.СчетУчетаРасчетовСКонтрагентом
	|ПОМЕСТИТЬ ТаблицаАктивы
	|ИЗ
	|	Документ.Сделка КАК Сделка
	|ГДЕ
	|	Сделка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""Активы"" КАК ИмяСписка,
	|	ТаблицаАктивы.НомерСтроки КАК НомерСтроки,
	|	ТаблицаАктивы.СчетУчета,
	|	ТаблицаАктивы.Актив,
	|	ТаблицаАктивы.АктивОбъект КАК АктивОбъект,
	|	ТаблицаАктивы.ВалютаЦБ,
	|	ТаблицаАктивы.КурсВалютыЦБ КАК КурсВалютыЦБ,
	|	ТаблицаАктивы.КратностьВалютыЦБ КАК КратностьВалютыЦБ,
	|	ТаблицаАктивы.Количество КАК Количество,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Себестоимость) КАК КорСчетСписания,
	|	ТаблицаАктивы.ВидОбращаемости КАК КорСубконто1,
	|	ТаблицаАктивы.Актив КАК КорСубконто2,
	|	НЕОПРЕДЕЛЕНО КАК КорСубконто3,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыОбращаемостиЦБ) КАК ВидКорСубконто1,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги) КАК ВидКорСубконто2,
	|	НЕОПРЕДЕЛЕНО КАК ВидКорСубконто3,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПродажаАктивов) КАК СтатьяЗатрат,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПродажаАктивов) КАК СтатьяДДС
	|ИЗ
	|	ТаблицаАктивы КАК ТаблицаАктивы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ОстаткиАктивов"" КАК ИмяСписка,
	|	ВТ_ХозрасчетныйОстатки.Счет КАК СчетУчета,
	|	ВТ_ХозрасчетныйОстатки.Субконто1 КАК Актив,
	|	ВТ_ХозрасчетныйОстатки.Субконто2 КАК ДокументОприходования,
	
	// IMAPPS-35879 ++
	//|	ЕСТЬNULL(ВТ_ХозрасчетныйОстатки.Субконто2.Дата, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДокументОприходованияДата,
	|	ВЫБОР
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.Сделка)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.Сделка).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ПогашениеОблигаций)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ПогашениеОблигаций).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ДокументРасчетовСКонтрагентом)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ДокументРасчетовСКонтрагентом).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.СделкаРЕПОПерваяНога)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.СделкаРЕПОПерваяНога).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ВводВыводЦенныхБумагИзДУ)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ВводВыводЦенныхБумагИзДУ).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ВводНачальныхОстатовПоНКД)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ВводНачальныхОстатовПоНКД).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.СделкаРЕПОВтораяНога)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.СделкаРЕПОВтораяНога).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ПринятиеКУчетуАктивов)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ПринятиеКУчетуАктивов).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.СделкаНаСрочномРынке)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.СделкаНаСрочномРынке).Дата
	|	ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ДокументОприходованияДата,
	// IMAPPS-35879 --
	
	|	ВТ_ХозрасчетныйОстатки.Валюта,
	|	СУММА(ЕСТЬNULL(ВТ_ХозрасчетныйОстатки.КоличествоОстаток, 0)) КАК Количество,
	|	СУММА(ЕСТЬNULL(ВТ_ХозрасчетныйОстатки.СуммаОстаток, 0)) КАК Стоимость,
	|	СУММА(ЕСТЬNULL(ВТ_ХозрасчетныйОстатки.ВалютнаяСуммаОстаток, 0)) КАК СтоимостьВал,
	|	СУММА(ЕСТЬNULL(ВТ_ХозрасчетныйОстатки.СуммаНУОстаток, 0)) КАК СтоимостьНУ
	|ИЗ
	|	ВТ_ХозрасчетныйОстатки КАК ВТ_ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ХозрасчетныйОстатки.Счет,
	|	ВТ_ХозрасчетныйОстатки.Субконто1,
	|	ВТ_ХозрасчетныйОстатки.Субконто2,
	|	ВТ_ХозрасчетныйОстатки.Валюта,
	
	// IMAPPS-35879 ++
	//|	ЕСТЬNULL(ВТ_ХозрасчетныйОстатки.Субконто2.Дата, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|	ВЫБОР
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.Сделка)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.Сделка).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ПогашениеОблигаций)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ПогашениеОблигаций).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ДокументРасчетовСКонтрагентом)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ДокументРасчетовСКонтрагентом).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.СделкаРЕПОПерваяНога)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.СделкаРЕПОПерваяНога).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ВводВыводЦенныхБумагИзДУ)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ВводВыводЦенныхБумагИзДУ).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ВводНачальныхОстатовПоНКД)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ВводНачальныхОстатовПоНКД).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.СделкаРЕПОВтораяНога)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.СделкаРЕПОВтораяНога).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ПринятиеКУчетуАктивов)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ПринятиеКУчетуАктивов).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.СделкаНаСрочномРынке)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.СделкаНаСрочномРынке).Дата
	|	ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ
	// IMAPPS-35879 --
	
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументОприходованияДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&СчетУчетаАктиваПереоценка КАК СчетПереоценки,
	|	ЕСТЬNULL(ВТ_ОстаткиТело.Субконто1, ВТ_ОстаткиПереоценка.Субконто1) КАК АктивОбъект,
	|	ЕСТЬNULL(ВТ_ОстаткиТело.Валюта, ВТ_ОстаткиПереоценка.Валюта) КАК Валюта,
	|	ЕСТЬNULL(ВТ_ОстаткиТело.Партия, НЕОПРЕДЕЛЕНО) КАК ДокументРасчетов,
	|	ЕСТЬNULL(ВТ_ОстаткиТело.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ВТ_ОстаткиПереоценка.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(ВТ_ОстаткиПереоценка.ВалютнаяСуммаОстаток, 0) КАК ВалютнаяСуммаОстаток,
	|	ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия) КАК Партия,
	
	// IMAPPS-35879 ++
	//|	ЕСТЬNULL(ВТ_ОстаткиТело.Партия.Дата, ВТ_ОстаткиПереоценка.Партия.Дата) КАК Дата
	|	ВЫБОР
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.Сделка)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.Сделка).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.ПогашениеОблигаций)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.ПогашениеОблигаций).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.ДокументРасчетовСКонтрагентом)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.ДокументРасчетовСКонтрагентом).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.СделкаРЕПОПерваяНога)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.СделкаРЕПОПерваяНога).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.ВводВыводЦенныхБумагИзДУ)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.ВводВыводЦенныхБумагИзДУ).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.ВводНачальныхОстатовПоНКД)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.ВводНачальныхОстатовПоНКД).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.СделкаРЕПОВтораяНога)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.СделкаРЕПОВтораяНога).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.ПринятиеКУчетуАктивов)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.ПринятиеКУчетуАктивов).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.СделкаНаСрочномРынке)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.СделкаНаСрочномРынке).Дата
	|	ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК Дата
	// IMAPPS-35879 --
	
	|ИЗ
	|	ВТ_ОстаткиТело КАК ВТ_ОстаткиТело
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПереоценка КАК ВТ_ОстаткиПереоценка
	|		ПО ВТ_ОстаткиТело.Субконто1 = ВТ_ОстаткиПереоценка.Субконто1
	|			И ВТ_ОстаткиТело.Партия = ВТ_ОстаткиПереоценка.Партия
	|ГДЕ
	|	ЕСТЬNULL(ВТ_ОстаткиТело.КоличествоОстаток, 0) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_ОстаткиТело.КоличествоОстаток) КАК КоличествоОстаток,
	|	ВТ_ОстаткиТело.Субконто1 КАК АктивОбъект
	|ИЗ
	|	ВТ_ОстаткиТело КАК ВТ_ОстаткиТело
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиТело.Субконто1";

	Если ЭтоОблигация и БУ тогда
		
		НомераТаблиц.Вставить("ЧастичноеСписание", 				НомераТаблиц.Количество());
		
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияДУ.ТекстРазделителяЗапросовПакета();
		
		ТекстЧОП = "ВЫБРАТЬ
		|	ВТ_ХозрасчетныйОстатки.Счет КАК Счет,
		|	ВТ_ХозрасчетныйОстатки.Валюта,
		|	ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто1 КАК Справочник.Облигации) КАК Облигации,
		|	ВТ_ХозрасчетныйОстатки.Субконто2 КАК ПогашениеОблигаций,
		|	ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто1 КАК Справочник.Облигации).Эмитент КАК Эмитент,
		|	ВТ_ХозрасчетныйОстатки.СуммаОстаток,
		|	ВТ_ХозрасчетныйОстатки.ВалютнаяСуммаОстаток,
		|	ВТ_ХозрасчетныйОстатки.КоличествоОстаток
		|ИЗ
		|	ВТ_ХозрасчетныйОстатки КАК ВТ_ХозрасчетныйОстатки
		|ГДЕ
		|	ВТ_ХозрасчетныйОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЧПО)";
		
		ТекстЗапроса = ТекстЗапроса + ТекстЧОП;
	Конецесли;
	
	Если НЕ (ВнебиржеваяСделка ИЛИ ЗначениеЗаполнено(ПлановаяПозиция)) И БУ И ФлагПереоценкиСчетовБрокера = Истина Тогда
		
		НомераТаблиц.Вставить("ПереоценкаСчетовБрокера", 				НомераТаблиц.Количество());
		
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияДУ.ТекстРазделителяЗапросовПакета();
		
		ТекстПСБ = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		           |	ХозрасчетныйОстатки.Счет КАК Счет,
		           |	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты) КАК Субконто1,
		           |	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК Субконто2,
		           |	ХозрасчетныйОстатки.Субконто3 КАК Субконто3,
		           |	ХозрасчетныйОстатки.Валюта КАК Валюта,
		           |	ВЫБОР
		           |		КОГДА ХозрасчетныйОстатки.СуммаОстаток < 0
		           |			ТОГДА -1 * ХозрасчетныйОстатки.СуммаОстаток
		           |		ИНАЧЕ ХозрасчетныйОстатки.СуммаОстаток
		           |	КОНЕЦ КАК Сумма,
		           |	ВЫБОР
		           |		КОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт <> 0
		           |			ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт
		           |		ИНАЧЕ ХозрасчетныйОстатки.ВалютнаяСуммаОстатокКт
		           |	КОНЕЦ КАК ВалютнаяСумма,
		           |	ВЫБОР
		           |		КОГДА ХозрасчетныйОстатки.СуммаОстаток < 0
		           |			ТОГДА ЛОЖЬ
		           |		ИНАЧЕ ИСТИНА
		           |	КОНЕЦ КАК РасчетыПоРеализации
		           |ИЗ
		           |	РегистрБухгалтерии.Хозрасчетный.Остатки(
		           |			&Период,
		           |			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыБрокераПоСделкам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыБрокераПоСделкам55)),
		           |			,
		           |			ДоговорДУ = &ДоговорДУ
		           |				И (ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты)) = &Контрагент
		           |				И (ВЫРАЗИТЬ(Субконто2 КАК Справочник.ДоговорыКонтрагентов)) = &ДоговорКонтрагента
		           |				И Субконто3 = &ФизическоеМХДС) КАК ХозрасчетныйОстатки";
		
		ТекстЗапроса = ТекстЗапроса + ТекстПСБ;
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

&Вместо("ТекстЗапросаНКД")
Функция optOst_ТекстЗапросаНКД(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВТ_НКДОстатки"                           , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаНКДКСписанию"						, НомераТаблиц.Количество());
	
	Если ВестиУчетКупонногоДоходаВРазрезеПартий Тогда
		
		ТекстЗапроса = 	
		"ВЫБРАТЬ
		|	ХозрасчетныйОстаткиНКД.СуммаОстаток,
		|	ХозрасчетныйОстаткиНКД.Счет,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиНКД.Субконто1 КАК Справочник.Облигации) КАК Субконто1,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиНКД.Субконто2 КАК Справочник.КупонныеПериоды) КАК Субконто2,
		|	ХозрасчетныйОстаткиНКД.Валюта,
		|	ХозрасчетныйОстаткиНКД.ВалютнаяСуммаОстаток,
		|	ХозрасчетныйОстаткиНКД.Субконто3 КАК ДокументРасчетов,
		|	ХозрасчетныйОстаткиНКД.СуммаНУОстаток
		|ПОМЕСТИТЬ ВТ_НКДОстатки
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленныйНКД)
		|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УплаченныйНКД)
		|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленныйНКД_58)
		|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УплаченныйНКД_58),
		|			,
		|			ДоговорДУ = &ДоговорДУ
		|				И (ВЫРАЗИТЬ(Субконто1 КАК Справочник.Облигации)) = &АктивОбъект
		|				И (ВЫРАЗИТЬ(Субконто2 КАК Справочник.КупонныеПериоды)) = &КупонныйПериод
		|				И Валюта = &ВалютаЦБ
		|				И ВЫБОР
		|					КОГДА Субконто3 ССЫЛКА Документ.СделкаРЕПОПерваяНога
		|						ТОГДА ЛОЖЬ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ХозрасчетныйОстаткиНКД
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ТаблицаНКДКСписанию"" КАК ИмяСписка,
		|	ВТ_ОстаткиТело.Валюта КАК Валюта,
		|	ВТ_НКДОстатки.Счет КАК СчетУчета,
		|	ВТ_ОстаткиТело.Субконто1 КАК Облигация,
		|	ВТ_НКДОстатки.Субконто2 КАК КупонныйПериод,
		|	ВТ_НКДОстатки.ДокументРасчетов,
		|	ВТ_ОстаткиТело.Партия КАК Партия,
		|	ЕСТЬNULL(ВТ_ОстаткиТело.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ВТ_НКДОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(ВТ_НКДОстатки.ВалютнаяСуммаОстаток, 0) КАК ВалютнаяСуммаОстаток,
		
		// IMAPPS-35879 ++
		//|	ВТ_ОстаткиТело.Партия.Дата КАК Дата,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ОстаткиТело.Партия) = ТИП(Документ.Сделка)
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ОстаткиТело.Партия КАК Документ.Сделка).Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ОстаткиТело.Партия) = ТИП(Документ.ПогашениеОблигаций)
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ОстаткиТело.Партия КАК Документ.ПогашениеОблигаций).Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ОстаткиТело.Партия) = ТИП(Документ.ДокументРасчетовСКонтрагентом)
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ОстаткиТело.Партия КАК Документ.ДокументРасчетовСКонтрагентом).Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ОстаткиТело.Партия) = ТИП(Документ.СделкаРЕПОПерваяНога)
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ОстаткиТело.Партия КАК Документ.СделкаРЕПОПерваяНога).Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ОстаткиТело.Партия) = ТИП(Документ.ВводВыводЦенныхБумагИзДУ)
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ОстаткиТело.Партия КАК Документ.ВводВыводЦенныхБумагИзДУ).Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ОстаткиТело.Партия) = ТИП(Документ.ВводНачальныхОстатовПоНКД)
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ОстаткиТело.Партия КАК Документ.ВводНачальныхОстатовПоНКД).Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ОстаткиТело.Партия) = ТИП(Документ.СделкаРЕПОВтораяНога)
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ОстаткиТело.Партия КАК Документ.СделкаРЕПОВтораяНога).Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ОстаткиТело.Партия) = ТИП(Документ.ПринятиеКУчетуАктивов)
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ОстаткиТело.Партия КАК Документ.ПринятиеКУчетуАктивов).Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ОстаткиТело.Партия) = ТИП(Документ.СделкаНаСрочномРынке)
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ОстаткиТело.Партия КАК Документ.СделкаНаСрочномРынке).Дата
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	КОНЕЦ КАК Дата,
		// IMAPPS-35879 --
		
		|	ЕСТЬNULL(ВТ_НКДОстатки.СуммаНУОстаток, 0) КАК СуммаНУОстаток
		|ИЗ
		|	ВТ_ОстаткиТело КАК ВТ_ОстаткиТело
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НКДОстатки КАК ВТ_НКДОстатки
		|		ПО (ВТ_НКДОстатки.Субконто1 = ВТ_ОстаткиТело.Субконто1)
		|			И (ВТ_НКДОстатки.ДокументРасчетов = ВТ_ОстаткиТело.Партия)";
		
	Иначе
		
		ТекстЗапроса = 	
		"ВЫБРАТЬ
		|	ХозрасчетныйОстаткиНКД.СуммаОстаток,
		|	ХозрасчетныйОстаткиНКД.Счет,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиНКД.Субконто1 КАК Справочник.Облигации) КАК Субконто1,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиНКД.Субконто2 КАК Справочник.КупонныеПериоды) КАК Субконто2,
		|	ХозрасчетныйОстаткиНКД.Валюта,
		|	ХозрасчетныйОстаткиНКД.ВалютнаяСуммаОстаток,
		|	ХозрасчетныйОстаткиНКД.Субконто3 КАК ДокументРасчетов,
		|	ХозрасчетныйОстаткиНКД.СуммаНУОстаток
		|ПОМЕСТИТЬ ВТ_НКДОстатки
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленныйНКД)
		|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УплаченныйНКД)
		|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленныйНКД_58)
		|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УплаченныйНКД_58),
		|			,
		|			ДоговорДУ = &ДоговорДУ
		|				И (ВЫРАЗИТЬ(Субконто1 КАК Справочник.Облигации)) = &АктивОбъект
		|				И (ВЫРАЗИТЬ(Субконто2 КАК Справочник.КупонныеПериоды)) = &КупонныйПериод
		|				И Валюта = &ВалютаЦБ) КАК ХозрасчетныйОстаткиНКД
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ТаблицаНКДКСписанию"" КАК ИмяСписка,
		|	ВТ_НКДОстатки.Валюта КАК Валюта,
		|	ВТ_НКДОстатки.Счет КАК СчетУчета,
		|	ВТ_НКДОстатки.Субконто1 КАК Облигация,
		|	ВТ_НКДОстатки.Субконто2 КАК КупонныйПериод,
		|	СУММА(ЕСТЬNULL(ВТ_ОстаткиТело.КоличествоОстаток, 0)) КАК КоличествоОстаток,
		|	МАКСИМУМ(ЕСТЬNULL(ВТ_НКДОстатки.СуммаОстаток, 0)) КАК СуммаОстаток,
		|	МАКСИМУМ(ЕСТЬNULL(ВТ_НКДОстатки.ВалютнаяСуммаОстаток, 0)) КАК ВалютнаяСуммаОстаток,
		|	МАКСИМУМ(ЕСТЬNULL(ВТ_НКДОстатки.СуммаНУОстаток, 0)) КАК СуммаНУОстаток
		|ИЗ
		|	ВТ_ОстаткиТело КАК ВТ_ОстаткиТело
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НКДОстатки КАК ВТ_НКДОстатки
		|		ПО (ВТ_НКДОстатки.Субконто1 = ВТ_ОстаткиТело.Субконто1)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НКДОстатки.Валюта,
		|	ВТ_НКДОстатки.Счет,
		|	ВТ_НКДОстатки.Субконто1,
		|	ВТ_НКДОстатки.Субконто2";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции



