
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрыИОтборыДинамическихСписков();
	ЗаполнитьФормуW8();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПредоставленныеДокументы.Параметры.УстановитьЗначениеПараметра("Депонент", Объект.Ссылка);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ПредоставленныеДокументы, "Депонент", Объект.Ссылка,, "Депонент");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыИОтборыДинамическихСписков()
	
	ПредоставленныеДокументы.Параметры.УстановитьЗначениеПараметра("Депонент", Объект.Ссылка);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ПредоставленныеДокументы, "Депонент", Объект.Ссылка,, "Депонент");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленныеДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = ЭлементНеЗаписан();
	
КонецПроцедуры

&НаКлиенте
Функция ЭлементНеЗаписан()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Ложь;
	Иначе
		Ответ = Вопрос("Элемент справочника еще не записан. Записать?", РежимДиалогаВопрос.ОКОтмена);
		
		Если Ответ = КодВозвратаДиалога.ОК Тогда
			Записать();
		КонецЕсли;
		
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьФормуW8()
	
	ФормаW8 = Справочники.ФормыW8.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Объект.ЮридическиеФизическиеЛица) И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ДанныеПоследнейФормыW8 = Справочники.ФормыW8.ДанныеПоследнейФормыW8(Объект.Ссылка);
		Если ЗначениеЗаполнено(ДанныеПоследнейФормыW8.ФормаW8) Тогда
			
			ФормаW8 = ДанныеПоследнейФормыW8.ФормаW8;
			
			Если ДанныеПоследнейФормыW8.ЕстьПересеченияПоСрокамСдругимиФормами Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеПоследнейФормыW8.ТекстОшибки);
			КонецЕсли;
			
			Если ФормаW8.СрокДействия < ТекущаяДатаСеанса() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Текущая форма W8 просрочена!");
			КонецЕсли;
			
			ЭтоЮридическоеЛицо = ТипЗнч(Объект.ЮридическиеФизическиеЛица) = Тип("СправочникСсылка.ЮридическиеЛица");
			Элементы.ГруппаСтраныW8_ФЛ.Видимость = НЕ ЭтоЮридическоеЛицо;
			Элементы.ГруппаСтраныW8_ЮЛ.Видимость = ЭтоЮридическоеЛицо;
			Элементы.ГруппаW8_GIN_ЮЛ.Видимость = ЭтоЮридическоеЛицо;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическиеФизическиеЛицаПриИзменении(Элемент)
	ЗаполнитьФормуW8();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновленыПредоставленныеДокументы" Тогда
		ЗаполнитьФормуW8();
	КонецЕсли;
КонецПроцедуры
