Процедура СформироватьОтчеты(ДепонентыСписок) Экспорт
	// Таблица для хранения отчетов
	ТЗ	= Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("Клиент");
	ТЗ.Колонки.Добавить("ОтчетАдрес");
	
	Запрос = Новый Запрос;
	Если НД_ИНД = Истина Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УслугиДепозитарияУслуги.Ссылка.Контрагент КАК ИнициаторВладелец,
		|	УслугиДепозитарияУслуги.Ссылка.Договор КАК Инициатор,
		|	УслугиДепозитарияУслуги.Ссылка КАК Документ,
		|	УслугиДепозитарияУслуги.Валюта КАК Валюта,
		|	УслугиДепозитарияУслуги.МестоХранения КАК МестоХранения,
		|	УслугиДепозитарияУслуги.СуммаСделки КАК СуммаСделки,
		|	УслугиДепозитарияУслуги.СуммаКомиссии КАК СуммаКомиссии,
		|	УслугиДепозитарияУслуги.Выгодоприобретатель КАК Выгодоприобретатель,
		|	УслугиДепозитарияУслуги.Ссылка.ПериодРасчетаКомиссии КАК ПериодНачисления,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(УслугиДепозитарияУслуги.СуммаСделки, 0) / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(УслугиДепозитарияУслуги.Ссылка.ПериодРасчетаКомиссии, МЕСЯЦ), КОНЕЦПЕРИОДА(УслугиДепозитарияУслуги.Ссылка.ПериодРасчетаКомиссии, МЕСЯЦ), ДЕНЬ) + 1) КАК ЧИСЛО(20, 2)) КАК СреднедневнаяСтоимостьОстатка,
		|	УслугиДепозитарияУслуги.Услуга КАК Услуга,
		|	УслугиДепозитарияУслуги.Ссылка.Дата КАК ПериодДокумента,
		|	СчетаДепо.Ссылка КАК СчетДЕПО,
		|	УслугиДепозитарияУслуги.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ втИсходнаяТаблица
		|ИЗ
		|	Документ.УслугиДепозитария.Услуги КАК УслугиДепозитарияУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
		|			ПО СчетаДепо.Ссылка = РазделыСчетаДепо.Владелец
		|				И (РазделыСчетаДепо.РазделСчетаДепоМХ.Код = ""00000000000000000"")
		|		ПО УслугиДепозитарияУслуги.Ссылка.Контрагент = СчетаДепо.Владелец
		|ГДЕ
		|	УслугиДепозитарияУслуги.Ссылка.Проведен
		|	И УслугиДепозитарияУслуги.Ссылка.Дата МЕЖДУ &ПериодНачало И &ПериодКонец
		|	И УслугиДепозитарияУслуги.СуммаКомиссии <> 0
		|	И УслугиДепозитарияУслуги.Ссылка.Контрагент В(&СписокКлиентов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИсходнаяТаблица.ИнициаторВладелец КАК ИнициаторВладелец,
		|	втИсходнаяТаблица.Инициатор КАК Инициатор,
		|	втИсходнаяТаблица.Валюта КАК Валюта,
		|	СУММА(втИсходнаяТаблица.СуммаСделки) КАК СуммаСделки,
		|	СУММА(втИсходнаяТаблица.СуммаКомиссии) КАК СуммаВВалютеПриход,
		|	втИсходнаяТаблица.Выгодоприобретатель КАК Выгодоприобретатель,
		|	втИсходнаяТаблица.ПериодНачисления КАК ПериодНачисления,
		|	СУММА(втИсходнаяТаблица.СреднедневнаяСтоимостьОстатка) КАК СреднедневнаяСтоимостьОстатка,
		|	втИсходнаяТаблица.Услуга КАК Услуга,
		|	втИсходнаяТаблица.ПериодДокумента КАК Период,
		|	РазделыСчетаДепо.Код КАК КодРазделаСчетаДЕПО
		|ИЗ
		|	втИсходнаяТаблица КАК втИсходнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
		|		ПО втИсходнаяТаблица.СчетДЕПО = РазделыСчетаДепо.Владелец
		|			И (ВЫБОР
		|				КОГДА втИсходнаяТаблица.ИнициаторВладелец.Субброкер
		|					ТОГДА втИсходнаяТаблица.Выгодоприобретатель = РазделыСчетаДепо.Субклиент
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|			И (РазделыСчетаДепо.РазделСчетаДепоМХ.Код = ""00000000000000000"")
		|
		|СГРУППИРОВАТЬ ПО
		|	втИсходнаяТаблица.СчетДЕПО,
		|	втИсходнаяТаблица.ИнициаторВладелец,
		|	втИсходнаяТаблица.Услуга,
		|	втИсходнаяТаблица.Инициатор,
		|	втИсходнаяТаблица.ПериодДокумента,
		|	РазделыСчетаДепо.Ссылка,
		|	втИсходнаяТаблица.Выгодоприобретатель,
		|	втИсходнаяТаблица.ПериодНачисления,
		|	втИсходнаяТаблица.Валюта,
		|	РазделыСчетаДепо.Код
		|
		|УПОРЯДОЧИТЬ ПО
		|	втИсходнаяТаблица.Выгодоприобретатель.Наименование
		|ИТОГИ
		|	СУММА(СуммаСделки),
		|	СУММА(СуммаВВалютеПриход),
		|	СУММА(СреднедневнаяСтоимостьОстатка)
		|ПО
		|	ИнициаторВладелец,
		|	Инициатор";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УслугиДепозитарияОбороты.Инициатор.Владелец КАК ИнициаторВладелец,
		|	УслугиДепозитарияОбороты.Инициатор КАК Инициатор,
		|	ВЫРАЗИТЬ(УслугиДепозитарияОбороты.Регистратор КАК Документ.УслугиДепозитария).ПериодРасчетаКомиссии КАК ПериодНачисления,
		|	УслугиДепозитарияОбороты.Период КАК Период,
		|	УслугиДепозитарияОбороты.Услуга КАК Услуга,
		|	УслугиДепозитарияОбороты.Валюта КАК Валюта,
		|	СУММА(УслугиДепозитарияОбороты.СуммаВВалютеПриход) КАК СуммаВВалютеПриход
		|ИЗ
		|	РегистрНакопления.УслугиДепозитария.Обороты(&ПериодНачало, &ПериодКонец, Регистратор, Инициатор.Владелец В (&СписокКлиентов)) КАК УслугиДепозитарияОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	УслугиДепозитарияОбороты.Инициатор.Владелец,
		|	УслугиДепозитарияОбороты.Инициатор,
		|	ВЫРАЗИТЬ(УслугиДепозитарияОбороты.Регистратор КАК Документ.УслугиДепозитария).ПериодРасчетаКомиссии,
		|	УслугиДепозитарияОбороты.Услуга,
		|	УслугиДепозитарияОбороты.Валюта,
		|	УслугиДепозитарияОбороты.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	ИнициаторВладелец,
		|	Инициатор,
		|	ПериодНачисления,
		|	Услуга
		|ИТОГИ
		|	СУММА(СуммаВВалютеПриход)
		|ПО
		|	ИнициаторВладелец,
		|	Инициатор";
	КонецЕсли;

	Запрос.УстановитьПараметр("ПериодКонец", ?(НД_ИНД = Истина, КонецДня(ПериодКонец), Новый Граница(КонецДня(ПериодКонец), ВидГраницы.Включая)));
	Запрос.УстановитьПараметр("ПериодНачало", ?(НД_ИНД = Истина, НачалоДня(ПериодНачало), Новый Граница(НачалоДня(ПериодНачало), ВидГраницы.Включая)));
	Запрос.УстановитьПараметр("СписокКлиентов", ДепонентыСписок);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	ИначеЕсли НД_ИНД = Истина Тогда
		Макет = ПолучитьМакет("Макет_НД_ИНД_2022");
	Иначе
		Макет = ПолучитьМакет("Макет_2022");
	КонецЕсли;
	Организация	= Константы.ОрганизацияПоУмолчанию.Получить();
	ДолжностьНачальникаДепозитария	= Справочники.ДолжностиОрганизаций.НайтиПоНаименованию("Начальник депозитария");
	ВалютаРегламентированногоУчета = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|			&ДатаФормирования,
	|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И Должность = &Должность
	|				И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.УполномоченныйПредставитель))";

	Запрос.УстановитьПараметр("ДатаФормирования"	, ДатаФормирования);
	Запрос.УстановитьПараметр("Должность"			, ДолжностьНачальникаДепозитария);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, Организация);
	
	ОтветственныеЛица = Запрос.Выполнить().Выгрузить();
	
	Если ОтветственныеЛица.Количество() > 0 Тогда
		ДанныеФЛ		= ОбщегоНазначения.ДанныеФизЛица(Справочники.Организации.ПустаяСсылка(), ОтветственныеЛица[0].ФизическоеЛицо, ДатаФормирования);
		Ответственный	= ОбщегоНазначения.ПолучитьФамилиюИмяОтчество(ДанныеФЛ.Фамилия, ДанныеФЛ.Имя, ДанныеФЛ.Отчество);
	Иначе
		Ответственный	= "";
	КонецЕсли;	
	// Получим данные "исполнителя"
	Пользователь		= ПараметрыСеанса.ТекущийПользователь;
	ИсполнительФЛ		= Пользователь.ФизЛицо;
	ИсполнительФЛДанные	= ОбщегоНазначения.ДанныеФизЛица(Справочники.Организации.ПустаяСсылка(), ИсполнительФЛ, ДатаФормирования);
	Исполнитель			= ОбщегоНазначения.ПолучитьФамилиюИмяОтчество(ИсполнительФЛДанные.Фамилия, ИсполнительФЛДанные.Имя, ИсполнительФЛДанные.Отчество);
	ИсполнительТелефон	= СокрЛП(РегистрыСведений.КонтактнаяИнформация.ПолучитьПоследнее(, Новый Структура("Объект, Тип, Вид", Пользователь, Перечисления.ТипыКонтактнойИнформации.Телефон				, Справочники.ВидыКонтактнойИнформации.ТелефонПользователя))["Представление"]);
	ИсполнительПочта	= СокрЛП(РегистрыСведений.КонтактнаяИнформация.ПолучитьПоследнее(, Новый Структура("Объект, Тип, Вид", Пользователь, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты	, Справочники.ВидыКонтактнойИнформации.EmailПользователя))["Представление"]);
	
	ТекстСообщенияПользователю = "";

	// Выбираем клиентов
	ВыборкаКлиенты	= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКлиенты.Следующий() Цикл
		// Открываем выборку по договорам
		ВыборкаДоговора	= ВыборкаКлиенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДоговора.Следующий() Цикл
			// Создадим Табличный документ для формирования отчета по клиенту
			ТД		= Новый ТабличныйДокумент;
			Шапка	= Макет.ПолучитьОбласть("Шапка");
			
			НаименованиеКлиентаДляПечати = ?(ЗначениеЗаполнено(СокрЛП(ВыборкаКлиенты.ИнициаторВладелец.НаименованиеПолное)), СокрЛП(ВыборкаКлиенты.ИнициаторВладелец.НаименованиеПолное), СокрЛП(ВыборкаКлиенты.ИнициаторВладелец.Наименование));
			Шапка.Параметры.КлиентНаименованиеПолное		= НаименованиеКлиентаДляПечати;
			Шапка.Параметры.ИнформацияПоДепоДоговоруКлиента	= "Депозитарный договор № " + ВыборкаДоговора.Инициатор.Код + " от " + Формат(ВыборкаДоговора.Инициатор.ДатаНачалоДействия, "ДФ=dd.MM.yyyy") + " г.";
			Шапка.Параметры.НаименованиеКомпании			= СокрЛП(Организация.Наименование);
			Шапка.Параметры.ИННКППКомпании					= "ИНН "+СокрЛП(Организация.ИНН) + " / КПП "+СокрЛП(Организация.КПП);
			Шапка.Параметры.ЮрАдресКомпании					= СокрЛП(РегистрыСведений.КонтактнаяИнформация.ПолучитьПоследнее(, Новый Структура("Объект, Тип, Вид", Организация, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации))["Представление"]);
			Шапка.Параметры.НомерИДатаИсходящего			= Формат(ДатаФормирования, "ДФ='dd MMMM yyyy'") + " года";
			Шапка.Параметры.НаименованиеКомпанииПолное		= ?(ЗначениеЗаполнено(СокрЛП(Организация.НаименованиеПолное)), СокрЛП(Организация.НаименованиеПолное), СокрЛП(Организация.Наименование));
			
			ТД.Вывести(Шапка);
			// Выборка по данным строк
			ВыборкаСтрок = ВыборкаДоговора.Выбрать();
			НомерСтроки = 1;
			Пока ВыборкаСтрок.Следующий() Цикл
				ПериодДляИтогов	= ВыборкаСтрок.Период;
				ВалютаДляИтогов	= ВыборкаСтрок.Валюта;
				
				Строка = Макет.ПолучитьОбласть("Строка");
				
				Строка.Параметры.НаименованиеУслуги	= ВыборкаСтрок.Услуга;
				Строка.Параметры.Период				= ВыборкаСтрок.ПериодНачисления;
				Строка.Параметры.СтоимостьУслуги	= ВыборкаСтрок.СуммаВВалютеПриход;
				Строка.Параметры.ДатаНачисления		= ВыборкаСтрок.Период;
				
				Если НД_ИНД = Истина Тогда 
					Строка.Параметры.НомерСтроки = НомерСтроки;
					Строка.Параметры.Субклиент = ВыборкаСтрок.Выгодоприобретатель;
					Строка.Параметры.КодРазделаСчетаДЕПО = СтрЗаменить(ВыборкаСтрок.КодРазделаСчетаДЕПО, "О", "");
					Строка.Параметры.СреднедневнаяСтоимостьОстатка = ВыборкаСтрок.СреднедневнаяСтоимостьОстатка;
					Строка.Параметры.Валюта	=?(ВыборкаСтрок.Валюта = ВалютаРегламентированногоУчета, "RUB", ВыборкаСтрок.Валюта);
					НомерСтроки = НомерСтроки + 1;
					Если НЕ ЗначениеЗаполнено (Строка.Параметры.Субклиент) И ВыборкаКлиенты.ИнициаторВладелец.Субброкер Тогда
						ТекстСообщенияПользователю = ТекстСообщенияПользователю + "У клиента " + НаименованиеКлиентаДляПечати + " по сумме комиссии " + Строка.Параметры.СтоимостьУслуги + " не указан субклиент." + Символы.ПС;
					КонецЕсли;

				Иначе
					Строка.Параметры.Валюта	= ВыборкаСтрок.Валюта;
				КонецЕсли;
				
				ТД.Вывести(Строка);
			КонецЦикла;
			Подвал	= Макет.ПолучитьОбласть("Подвал");
			
			Подвал.Параметры.ИтогоСтоимостьУслуг = ВыборкаДоговора.СуммаВВалютеПриход;
			
			Если НД_ИНД = Истина Тогда  
				Подвал.Параметры.Валюта	= ?(ВалютаДляИтогов = ВалютаРегламентированногоУчета, "RUB", ВалютаДляИтогов);
				Подвал.Параметры.ИтогоСреднедневнаяСтоимостьОстатка = ВыборкаДоговора.СреднедневнаяСтоимостьОстатка;
			Иначе
				Подвал.Параметры.Валюта	= ВалютаДляИтогов;
			КонецЕсли;
			
			Подвал.Параметры.ДолжностьОтветственного	= ДолжностьНачальникаДепозитария;
			Подвал.Параметры.Ответственный				= Ответственный;
			// Получить факсимилье
			Если ВыводитьФаксимилеВОтчетах Тогда
				ФормированиеПечатныхФорм.ПолучитьФаксимилье(ИсполнительФЛ, Подвал.Рисунки.Faksimilie.Картинка);
			Иначе
				Подвал.Рисунки.Faksimilie.Картинка	= Новый Картинка;
			КонецЕсли;
			// Пользователь кто сформировал
			ФИОИсполнителя		= Исполнитель;
			ТелефонИсполнителя	= ИсполнительТелефон;
			ПочтаИсполнителя	= ИсполнительПочта;
			
			Подвал.Параметры.НижнийКолонтитул = ФИОИсполнителя + "; тел: "+ТелефонИсполнителя + "; e-mail: " + ПочтаИсполнителя;
			
			ТД.Вывести(Подвал);
			
			ТД.ОтображатьЗаголовки	= Ложь;
			ТД.ОтображатьСетку		= Ложь;
			
			НовыйОтчет	= ТЗ.Добавить();
			
			НовыйОтчет.Клиент		= ВыборкаКлиенты.ИнициаторВладелец;
			НовыйОтчет.ОтчетАдрес	= ПоместитьВоВременноеХранилище(ТД);
		КонецЦикла;
	КонецЦикла;
	
	РезультатыФормирования	= ТЗ.Скопировать();
	
	Если ТекстСообщенияПользователю <> "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщенияПользователю;
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);