
// Создает новый документ ИсполнениеПоручения, заполняет его по остаткам РН ИсполнениеПоручения и проводит.
// Возвращает описание ошибки, если есть.
//
// Параметры:
//  НеттоПоручение					 - ДокументСсылка.НеттоПоручение	 - основание для исполнения
//  ВидОперацииНетто				 - СправочникСсылка.ВидыОпераций
//  КодОтчетаВышестоящегоДепозитария - Строка	- номер отчета НРД
//  ИсполненноеНеттоКоличествоЦБ	 - Число	- количество исполнения НРД
//  ДатаИсполнения					 - Дата		- дата отчета НРД (основная дата исполнения поручения)
//  ДатаИсполненияВДепозитарииМХ	 - Дата
//  ДатаИсполненияВМестеРасчетов	 - Дата
// 
// Возвращаемое значение:
//  Строка - описание ошибки, если ошибка возникла. Иначе - пустая строка
//
Функция РезультатФормированияИсполненияПоручения(НеттоПоручение, ВидОперацииНетто, КодОтчетаВышестоящегоДепозитария,
	ИсполненноеНеттоКоличествоЦБ, ДатаИсполнения, ДатаИсполненияВДепозитарииМХ, ДатаИсполненияВМестеРасчетов) Экспорт
	
	ИсполнениеПоручения = НайтиДокумент(
		Новый Структура("ДокументОснование, КодОтчетаВышестоящегоДепозитария, Дата, ПометкаУдаления",
			НеттоПоручение, КодОтчетаВышестоящегоДепозитария, ДатаИсполнения, Ложь));
	Если ЗначениеЗаполнено(ИсполнениеПоручения) Тогда
		Возврат "";
	КонецЕсли;
	
	ИсполнениеОбъект = Документы.ИсполнениеПоручения.СоздатьДокумент();
	ИсполнениеОбъект.Дата				= ДатаИсполнения;
	ИсполнениеОбъект.ДатаИсполненияВДепозитарииМХ = ДатаИсполненияВДепозитарииМХ;
	ИсполнениеОбъект.ДатаИсполненияВМестеРасчетов = ДатаИсполненияВМестеРасчетов;
	ИсполнениеОбъект.ДокументОснование	= НеттоПоручение;
	ИсполнениеОбъект.ВидОперации		= ВидОперацииНетто;
	ИсполнениеОбъект.Количество			= ИсполненноеНеттоКоличествоЦБ;
	ИсполнениеОбъект.КодОтчетаВышестоящегоДепозитария = КодОтчетаВышестоящегоДепозитария;
	
	Остатки = ОстаткиИсполнений(ДатаИсполнения, НеттоПоручение, ВидОперацииНетто);
	Остатки.Колонки.Добавить("КоличествоОтчета");
	Остатки.Колонки.Добавить("КонечныйОстаток");
	Остатки.Колонки.Добавить("Статус");
	РаспределитьИсполненноеКоличество(Остатки, ВидОперацииНетто, ИсполненноеНеттоКоличествоЦБ);	
	ИсполнениеОбъект.ОстаткиЦБ.Загрузить(Остатки);
	
	ОбщееКоличествоЦБ = ИсполненноеКоличествоЦБ(НеттоПоручение, ДатаИсполнения) + ИсполненноеНеттоКоличествоЦБ;
	
	Если ОбщееКоличествоЦБ > НеттоПоручение.Количество Тогда
		ИсполнениеОбъект.Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Общее исполненное количество с учетом текущего исполнения поручения %1 шт. превышает количество %2 шт. "
			+ "в нетто-поручении.", ОбщееКоличествоЦБ, НеттоПоручение.Количество);
	КонецЕсли;
	
	Попытка
		ИсполнениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат "Не удалось создать и провести новый документ 'Исполнение поручения' для нетто-поручения ненулевого неттинга"
			+ Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Если ОбщееКоличествоЦБ > НеттоПоручение.Количество Тогда
		СформироватьУведомлениеОбИзбыточномКоличестве(ОбщееКоличествоЦБ, НеттоПоручение.Количество, НеттоПоручение,
			ИсполнениеОбъект.Ссылка);
	КонецЕсли;
	Возврат "";
	
КонецФункции

// Создает и заполняет новый документ ИсполнениеПоручения для нулевого неттинга, возвращает описание ошибки, если есть.
//
// Параметры:
//  НеттоПоручение					 - ДокументСсылка.НеттоПоручение	 - основание для исполнения
//  ВидОперацииНетто				 - СправочникСсылка.ВидыОпераций
//  КодОтчетаВышестоящегоДепозитария - Строка
//  ДатаИсполнения					 - Дата	 - дата исполнения нетто-поручения нулевого неттинга
// 
// Возвращаемое значение:
//  Строка - описание ошибки, если ошибка возникла. Иначе - пустая строка
//
Функция РезультатФормированияИсполненияПорученияНулевогоНеттинга(НеттоПоручение, ВидОперацииНетто,
	КодОтчетаВышестоящегоДепозитария, ДатаИсполнения) Экспорт
	
	ИсполнениеПоручения = НайтиДокумент(
		Новый Структура("ДокументОснование, КодОтчетаВышестоящегоДепозитария, Дата, ПометкаУдаления",
			НеттоПоручение, КодОтчетаВышестоящегоДепозитария, ДатаИсполнения, Ложь));
	Если ЗначениеЗаполнено(ИсполнениеПоручения) Тогда
		Возврат "";
	КонецЕсли;
	
	ИсполнениеОбъект = Документы.ИсполнениеПоручения.СоздатьДокумент();
	ИсполнениеОбъект.Дата				= ДатаИсполнения;
	ИсполнениеОбъект.ДатаИсполненияВДепозитарииМХ = ДатаИсполнения;
	ИсполнениеОбъект.ДатаИсполненияВМестеРасчетов = ДатаИсполнения;
	ИсполнениеОбъект.ДокументОснование	= НеттоПоручение;
	ИсполнениеОбъект.ВидОперации		= ВидОперацииНетто;
	ИсполнениеОбъект.Количество			= 0;
	ИсполнениеОбъект.КодОтчетаВышестоящегоДепозитария = КодОтчетаВышестоящегоДепозитария;
	
	ОстаткиЦБ = ОстаткиЦБНеттоПоручения(НеттоПоручение);
	ИсполнениеОбъект.ОстаткиЦБ.Загрузить(ОстаткиЦБ);
	
	Попытка
		ИсполнениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат "Не удалось создать и провести новый документ 'Исполнение поручения' для нетто-поручения нулевого неттинга"
			+ Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	Возврат "";
	
КонецФункции

// Возвращает ссылку на первый документ ИсполнениеПоручения, найденный по структуре Параметры.
//
// Параметры:
//  Параметры - Структура:
//		(Ключ и Значение) - имя и значение реквизита документа ИсполнениеПоручения
// 
// Возвращаемое значение:
//   ДокументСсылка.ИсполнениеПоручения
//
Функция НайтиДокумент(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИсполнениеПоручения.Ссылка
	|ИЗ
	|	Документ.ИсполнениеПоручения КАК ИсполнениеПоручения
	|ГДЕ Истина";
	
	НомерПараметра = 0;
	Для каждого Параметр Из Параметры Цикл
		Если ТипЗнч(Параметр.Значение) = Тип("Строка") Тогда
			Запрос.Текст = Запрос.Текст + " И ВЫРАЗИТЬ(" + Параметр.Ключ + " КАК Строка(1000)) = &Параметр" + НомерПараметра;
		Иначе
			Запрос.Текст = Запрос.Текст + " И " + Параметр.Ключ + " = &Параметр" + НомерПараметра;
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("Параметр" + НомерПараметра, Параметр.Значение);
		
		НомерПараметра = НомерПараметра + 1;
	КонецЦикла; 
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.ИсполнениеПоручения.ПустаяСсылка();
	КонецЕсли;

КонецФункции

Функция ОстаткиИсполнений(ДатаОстатков, НеттоПоручение, ВидОперацииНетто)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсполнениеПорученияОстатки.Поручение.Дата КАК Дата,
	|	ИсполнениеПорученияОстатки.Поручение КАК Поручение,
	|	ИсполнениеПорученияОстатки.Поручение.ВидОперацииД КАК ВидОперации,
	|	ВЫБОР ИсполнениеПорученияОстатки.Поручение.ВидОперацииД
	|		КОГДА &Зачисление ТОГДА 1
	|		КОГДА &Списание ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Порядок,
	|	ИсполнениеПорученияОстатки.Поручение.КоличествоЦБ КАК КоличествоПоручения,
	|	ВЫБОР
	|		КОГДА ИсполнениеПорученияОстатки.КоличествоОстаток < 0
	|			ТОГДА -ИсполнениеПорученияОстатки.КоличествоОстаток
	|		ИНАЧЕ ИсполнениеПорученияОстатки.КоличествоОстаток
	|	КОНЕЦ КАК НачальныйОстаток
	|ИЗ
	|	РегистрНакопления.ИсполнениеПоручения.Остатки(&ГраницаОстатков, НеттоПоручение = &НеттоПоручение) КАК ИсполнениеПорученияОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок УБЫВ,
	|	Дата
	|";
	
	// Текст запроса составлен для нетто-операции зачисления, в которой вначале полностью
	// исполняются поручения на списание, а потом полностью или частично поручения на зачисление.
	Если ВидОперацииНетто = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
		// Для нетто-операции списания все наоборот, поэтому меняется направление сортировки.
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Порядок УБЫВ", "Порядок ВОЗР");
	КонецЕсли;
	
	ГраницаОстатков = Новый Граница(ДатаОстатков, ВидГраницы.Включая);
	Запрос.УстановитьПараметр("ГраницаОстатков", ГраницаОстатков);	
	Запрос.УстановитьПараметр("НеттоПоручение", НеттоПоручение);
	Запрос.УстановитьПараметр("Зачисление", Справочники.ВидыОпераций.Депонирование);
	Запрос.УстановитьПараметр("Списание", Справочники.ВидыОпераций.СнятиеСДепонирования);
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

Функция ОстаткиЦБНеттоПоручения(НеттоПоручение)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПорученияНетто.Поручение.Дата КАК Дата,
	|	ПорученияНетто.Поручение КАК Поручение,
	|	ПорученияНетто.Поручение.ВидОперацииД КАК ВидОперации,
	|	ПорученияНетто.Поручение.КоличествоЦБ КАК КоличествоПоручения,
	|	ПорученияНетто.Поручение.КоличествоЦБ КАК НачальныйОстаток,
	|	ПорученияНетто.Поручение.КоличествоЦБ КАК КоличествоОтчета,
	|	0 КАК КонечныйОстаток,
	|	&Исполнено КАК Статус
	|ИЗ
	|	Документ.НеттоПоручение.Поручения КАК ПорученияНетто
	|ГДЕ
	|	ПорученияНетто.Ссылка = &НеттоПоручение
	|";
	Запрос.УстановитьПараметр("НеттоПоручение", НеттоПоручение);
	Запрос.УстановитьПараметр("Исполнено", Перечисления.СтатусыПоручений.Исполнено);
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

Процедура РаспределитьИсполненноеКоличество(ОстаткиЦБ, ВидОперацииНетто, ИсполненноеНеттоКоличествоЦБ)
	
	ОстатокКРаспределению = ИсполненноеНеттоКоличествоЦБ;
	Если ВидОперацииНетто = Справочники.ВидыОпераций.Депонирование Тогда
		ВидБезусловногоПолногоИсполнения = Справочники.ВидыОпераций.СнятиеСДепонирования;
	Иначе
		ВидБезусловногоПолногоИсполнения = Справочники.ВидыОпераций.Депонирование;
	КонецЕсли;
	
	Для Каждого Строка Из ОстаткиЦБ Цикл
		Если ОстатокКРаспределению = 0 Тогда
			Строка.КоличествоОтчета	= 0;
			Строка.КонечныйОстаток	= Строка.НачальныйОстаток;
			Строка.Статус			= Перечисления.СтатусыПоручений.ПустаяСсылка();
			Продолжить;
		КонецЕсли;
		
		Если Строка.ВидОперации = ВидБезусловногоПолногоИсполнения Тогда
			Строка.КоличествоОтчета	= Строка.НачальныйОстаток;
			Строка.КонечныйОстаток	= 0;
			Строка.Статус			= Перечисления.СтатусыПоручений.Исполнено;
			ОстатокКРаспределению = ОстатокКРаспределению + Строка.НачальныйОстаток;
		Иначе
			Если ОстатокКРаспределению >= Строка.НачальныйОстаток Тогда // Полное исполнение
				Строка.КоличествоОтчета	= Строка.НачальныйОстаток;
				Строка.КонечныйОстаток	= 0;
				Строка.Статус			= Перечисления.СтатусыПоручений.Исполнено;
				ОстатокКРаспределению = ОстатокКРаспределению - Строка.НачальныйОстаток;
			Иначе // Частичное исполнение
				Строка.КоличествоОтчета	= ОстатокКРаспределению;
				Строка.КонечныйОстаток	= Строка.НачальныйОстаток - Строка.КоличествоОтчета;
				Строка.Статус			= Перечисления.СтатусыПоручений.ИсполненоЧастично;
				ОстатокКРаспределению = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает реквизиты исполнения для указанного поручения
//
// Параметры:
//  Поручение	 - ДокументСсылка.Поручение
// 
// Возвращаемое значение:
//  Структура: 
//   * Дата - Дата - основная дата исполнения поручения
//   * ДатаИсполненияВДепозитарииМХ - Дата
//   * ДатаИсполненияВМестеРасчетов - Дата
//   * КодОтчетаВышестоящегоДепозитария - Строка
//   * НачальныйОстаток - Число
//   * КоличествоОтчета - Число
//   * КонечныйОстаток - Число
//   * Статус - ПеречислениеСсылка.СтатусыПоручений
Функция ДанныеИсполненияПоручения(Поручение) Экспорт
	
	Данные = Новый Структура("Дата, ДатаИсполненияВДепозитарииМХ, ДатаИсполненияВМестеРасчетов,
							|КодОтчетаВышестоящегоДепозитария, НачальныйОстаток, КоличествоОтчета, КонечныйОстаток, Статус");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОстаткиЦБ.Ссылка.Дата КАК Дата,
	|	ОстаткиЦБ.Ссылка.ДатаИсполненияВДепозитарииМХ КАК ДатаИсполненияВДепозитарииМХ,
	|	ОстаткиЦБ.Ссылка.ДатаИсполненияВМестеРасчетов КАК ДатаИсполненияВМестеРасчетов,
	|	ОстаткиЦБ.Ссылка.КодОтчетаВышестоящегоДепозитария КАК КодОтчетаВышестоящегоДепозитария,
	|	ОстаткиЦБ.НачальныйОстаток КАК НачальныйОстаток,
	|	ОстаткиЦБ.КоличествоОтчета КАК КоличествоОтчета,
	|	ОстаткиЦБ.КонечныйОстаток КАК КонечныйОстаток,
	|	ОстаткиЦБ.Статус КАК Статус
	|ИЗ
	|	Документ.ИсполнениеПоручения.ОстаткиЦБ КАК ОстаткиЦБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение КАК ДокументПоручение
	|		ПО ОстаткиЦБ.Ссылка = ДокументПоручение.Исполнение
	|ГДЕ
	|	ОстаткиЦБ.Поручение = &Поручение
	|	И ДокументПоручение.Ссылка = &Поручение";
	Запрос.УстановитьПараметр("Поручение", Поручение);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда	
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Данные, Выборка);
		КонецЕсли;
	КонецЕсли;
	Возврат Данные;
	
КонецФункции

Функция ИсполненноеКоличествоЦБ(НеттоПоручение, ДатаОстатков)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ИсполнениеПоручения.Количество), 0) КАК ИтогоКоличество
	|ИЗ
	|	Документ.ИсполнениеПоручения КАК ИсполнениеПоручения
	|ГДЕ
	|	ИсполнениеПоручения.Проведен
	|	И ИсполнениеПоручения.ДокументОснование = &НеттоПоручение
	|	И ИсполнениеПоручения.Дата < &ДатаОстатков";
	Запрос.УстановитьПараметр("НеттоПоручение", НеттоПоручение);
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИтогоКоличество;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Процедура СформироватьУведомлениеОбИзбыточномКоличестве(ОбщееКоличествоЦБ, КоличествоНеттоПоручения, НеттоПоручение,
	Исполнение)
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОбИзбыточномКоличествеЦБПриИсполненииПоручения;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	
	Если НастройкиОбмена = Неопределено Тогда
		ТекстОшибки = "Не заданы параметры внешнего источника " + ВнешнийИсточник.Наименование;
		#Если Клиент Тогда
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки);
		#КонецЕсли
		ИмяСобытия = ВнешнийИсточник.Наименование;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, ВнешнийИсточник, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	НайденнаяСтрока = НастройкиОбмена.Параметры.Найти("Тема письма", "Наименование");
	Если НайденнаяСтрока = Неопределено Тогда
		ТемаПисьма = "<Без темы>";
	Иначе
		ТемаПисьма = НайденнаяСтрока.Значение;
	КонецЕсли;
	
	ТекстПисьма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<p>Общее исполненное количество с учетом документа %1 %2 шт. превышает количество %3 шт. "
		+ "в документе %4.</p>", Исполнение, ОбщееКоличествоЦБ, КоличествоНеттоПоручения, НеттоПоручение);
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.HTML);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);				
	
КонецПроцедуры
