
&НаКлиенте
Процедура ОбновитьТарифы(Элемент)
	ТекущиеДанные = Элементы.УслугиТарифногоПлана.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Тарифы, "Услуга", ТекущиеДанные.Услуга);
	Иначе
		ПустаяУслуга = ПредопределенноеЗначение("Справочник.УслугиТарифногоПлана.ПустаяСсылка");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Тарифы, "Услуга", ПустаяУслуга);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиТарифногоПланаПриАктивизацииСтроки(Элемент)
	ОбновитьТарифы(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УслугиТарифногоПланаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьТарифы(Элемент);
КонецПроцедуры
