
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Поля = Новый СписокЗначений;
	Поля.Добавить(Основание, "Основание");
	Поля.Добавить(Депонент, "Депонент");
	Поля.Добавить(СчетДепо, "Счет Депо");
	Поля.Добавить(РазделСчетаДепо, "Раздел счета Депо");
	ПроверитьЗаполнениеПолей(Поля, Отказ);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не Документы.Поручение.ЭтоВыплатаДоходаПоПрогрессивнойШкалеНДФЛ(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	КурсВал = КурсВалюты / ?(КратностьВалюты = 0, 1, КратностьВалюты);
	ЕстьСуммыНалога = (СуммаНачисленныйНалогОбычнаяСтавка + СуммаНачисленныйНалогПовышеннаяСтавка + СуммаЗачетНалогаНаПрибыль) > 0
		Или СтавкиНалогаУстановленыВРучномРежиме;
	ЕстьПризнакНачисленияНалога = Документы.НачисленныйНалог.РасчетНалогаРазрешен(Основание.ВидОперацииД);
	НеобходимРасчетНалога = ЕстьПризнакНачисленияНалога И ЕстьСуммыНалога;
	Если НеобходимРасчетНалога Тогда
		Если (СуммаНалога + СуммаНалогаПоСтавке15СПревышения) > (СуммаВыплаты * КурсВал) И ЗначениеЗаполнено(СуммаВыплаты) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Сумма налога не может быть больше суммы выплаты, документ не проведен!", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОбработкаПроведенияУстановитьСтатус(Основание, Отказ);
	
	Если Документы.Поручение.ЦБСписываемыеНачислитьНалог(Основание, СчетДепо, РазделСчетаДепо) Тогда
		ДанныеПлатежнойОперации = ДанныеПлатежнойОперации(Основание, Счетдепо, РазделСчетаДепо,
			Перечисления.ВидыПлатежныхОпераций.ВыплатаДохода);
		Если ЗначениеЗаполнено(ДанныеПлатежнойОперации.Ссылка) И ДанныеПлатежнойОперации.Проведен Тогда
			Отбор = Новый Структура("Депонент", Депонент);
			Документы.Поручение.СоздатьОбновитьДокументыГО(Основание, Отказ, ДанныеПлатежнойОперации.Дата, Отбор);
			ДанныеКлиента = ДанныеКлиентаДляУведомления();
			Документы.Поручение.ЗаписатьУведомлениеДляКабинетаКлиента(Основание, Дата, ДанныеКлиента,
				Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.КОтправке);
		КонецЕсли;
	КонецЕсли;
	
	// регистр НалоговаяБазаВыплатыДоходов
	Если НеобходимРасчетНалога Тогда
		Движения.НалоговаяБазаВыплатыДоходов.Записывать = Истина;
		Движения.НалоговаяБазаВыплатыДоходов.Очистить();
		Движение = Движения.НалоговаяБазаВыплатыДоходов.Добавить();
		Движение.Период = Дата;
		Движение.Валюта = Валюта;
		Движение.Депонент = Депонент;
		Движение.КодДохода = Документы.НачисленныйНалог.КодДоходаПоВидуОперации(Основание.ВидОперацииД);
		Движение.ЮридическиеФизическиеЛица = Депонент.ЮридическиеФизическиеЛица;
		Движение.СуммаДохода = СуммаВыплаты * КурсВал;
		Движение.СуммаДоходаВВалюте = СуммаВыплаты;
		Движение.СуммаНалога = СуммаНачисленныйНалогОбычнаяСтавка;
		Движение.СуммаНалогаСПревышения = СуммаНачисленныйНалогПовышеннаяСтавка;
		Движение.ЗачетНалогаНаПрибыль = СуммаЗачетНалогаНаПрибыль;
		Движение.ЗачетНалогаВИностраннойЮрисдикции = СуммаЗачетНалогаВИностраннойЮрисдикции;
		Движение.СуммаКВыплатеПоОсновнаяСтавка = СуммаКВыплатеПоОсновнаяСтавка;
		Движение.СуммаКВыплатеПоПовышеннаяСтавка = СуммаКВыплатеПоПовышеннаяСтавка;
		Движение.СуммаОкругленияНалога = СуммаОкругленияНалога;
		
		Если ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ДатаДвиженийПоДС") <= Дата Тогда
			СформироватьДвиженияПоРегиструДенежныхСредств(КурсВал);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ОбработкаЗаполненияДопустима(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Налоги = Документы.НачисленныйНалог.РассчитанныйНалог(ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Налоги);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияПоРегиструДенежныхСредств(КурсВал)
	
	НалогКОплате = СуммаНалога + СуммаНалогаПоСтавке15СПревышения;
	Если НалогКОплате <> 0 Или СуммаОкругленияВыплат <> 0 Тогда
		
		РеквизитыЦБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание.ЦБ,
			Новый Структура("ЮридическоеЛицо, ВидЦББанкаРоссии", "Эмитент.ЮридическиеФизическиеЛица", "ВидЦББанкаРоссии"));
		ЭтоМК = РегистрыСведений.ЮридическиеЛицаМеждународныеКомпании.ЭтоМК(Дата, РеквизитыЦБ.ЮридическоеЛицо);
		ЭтоВидИностраннойЦБ = Справочники.ВидыЦББанкаРоссии.ЭтоВидИностраннойЦБ(РеквизитыЦБ.ВидЦББанкаРоссии);
		
		ЭтоНалогВИностраннойЮрисдикции = ЭтоВидИностраннойЦБ
			И Справочники.ВидыОпераций.ЭтоВыплатаДоходаПоАкциямИлиИнымЦБ(Основание.ВидОперацииД) И Не ЭтоМК;
		Если ЭтоНалогВИностраннойЮрисдикции Тогда
			Движения.ДенежныеСредства.Записывать = Истина;
			Движения.ДенежныеСредства.Очистить();
			Если НалогКОплате <> 0 Тогда
				Движение = Движения.ДенежныеСредства.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Выплата = Основание;
				Движение.БанковскийСчет = Основание.БанковскийСчет;
				Движение.Депонент = СчетДепо.Владелец;
				Движение.Валюта = Валюта;
				Движение.ВалютнаяСумма = Окр(НалогКОплате / КурсВал, 2);
				Движение.Сумма = НалогКОплате;
			КонецЕсли;
			Если СуммаОкругленияВыплат <> 0 Тогда
				Движение = Движения.ДенежныеСредства.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Выплата = Основание;
				Движение.БанковскийСчет = Основание.БанковскийСчет;
				Движение.Депонент = СчетДепо.Владелец;
				Движение.Валюта = Валюта;
				Движение.ВалютнаяСумма = 0;
				Движение.Сумма = СуммаОкругленияВыплат * КурсВал;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПолей(Поля, Отказ)
	Для Каждого Элемент Из Поля Цикл
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не заполнено поле """ + Элемент.Представление + """", Отказ);
		КонецЕсли;		
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаПроведенияУстановитьСтатус(Основание, Отказ)
	
	ДатаИсполненияПоручения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ДатаИсполненияПоручения");
	Если Не ЗначениеЗаполнено(ДатаИсполненияПоручения) Тогда
		НоваяДатаИсполнения = Документы.Поручение.ДатаИсполненияПорученияВыплатыДоходаПоПрогрессивнойШкалеНДФЛ(Основание);
		Если ЗначениеЗаполнено(НоваяДатаИсполнения) Тогда
			ДокументПоручение = Основание.ПолучитьОбъект();
			ДокументПоручение.ДатаИсполненияПоручения = НоваяДатаИсполнения;
			РегистрыСведений.СтатусыПоручений.УстановитьСтатус(ДокументПоручение.Движения, Основание,
				НоваяДатаИсполнения, Перечисления.СтатусыПоручений.Исполнено);
			ДокументПоручение.Записать(РежимЗаписиДокумента.Запись);
		Иначе
			ПодтверждениеНалога = Документы.НачисленныйНалог.НеподтвержденныеДокументыНачисленияНДФЛПоДивидендам(Основание);
			КорректныйСтатус =
				?(ПодтверждениеНалога, Перечисления.СтатусыПоручений.ПодтверждениеНалога, Перечисления.СтатусыПоручений.Обрабатывается);
			СтатусПоручения = РегистрыСведений.СтатусыПоручений.СтатусПоручения(Основание);
			Если Подтвержден Тогда
				КлючСтрокиПоручения = Новый Структура("СчетДепо, РазделСчетаДепо", СчетДепо, РазделСчетаДепо);
				Документы.ПлатежнаяОперация.СоздатьПлатежныеОперацииПоПоручению(Основание, КлючСтрокиПоручения, Отказ);
			КонецЕсли;
			Если КорректныйСтатус <> СтатусПоручения Тогда
				ДокОбъект = Основание.ПолучитьОбъект();
				РегистрыСведений.СтатусыПоручений.УстановитьСтатус(ДокОбъект.Движения, Основание, Основание.Дата, КорректныйСтатус);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеПлатежнойОперации(Основание, Счетдепо, РазделСчетаДепо, ВидОперации)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлатежнаяОперация.Ссылка КАК Ссылка,
	|	ПлатежнаяОперация.Проведен КАК Проведен,
	|	ПлатежнаяОперация.Дата КАК Дата
	|ИЗ
	|	Документ.ПлатежнаяОперация КАК ПлатежнаяОперация
	|ГДЕ
	|	ПлатежнаяОперация.Основание = &Основание
	|	И ПлатежнаяОперация.СчетДепо = &СчетДепо
	|	И ПлатежнаяОперация.РазделСчетаДепо = &РазделСчетаДепо
	|	И ПлатежнаяОперация.ВидОперации = &ВидОперации";
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("СчетДепо", СчетДепо);
	Запрос.УстановитьПараметр("РазделСчетаДепо", РазделСчетаДепо);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	РезультатЗапроса = Запрос.Выполнить();
	Результат = Новый Структура("Ссылка, Проведен, Дата", Документы.ПлатежнаяОперация.ПустаяСсылка(), Ложь, '00010101');
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ОбработкаЗаполненияДопустима(ДанныеЗаполнения)
	
	Если ДанныеЗаполнения = Неопределено И ЭтоНовый() Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("РасчетНалога") И Не ДанныеЗаполнения.РасчетНалога Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Дата = Дата(Лев(Строка(Дата), 11) + Формат(ТекущаяДатаСеанса(), "ДЛФ=В"));
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ДанныеКлиентаДляУведомления()
	
	ДанныеКлиента = Новый Структура("Клиент, СчетДепо, ЦеннаяБумага, Количество");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоручениеЦенныеБумагиСписываемые.СчетДепо КАК СчетДепо,
	|	НачисленныйНалог.Депонент КАК Клиент,
	|	ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ПоручениеЦенныеБумагиСписываемые.Количество КАК Количество
	|ИЗ
	|	Документ.НачисленныйНалог КАК НачисленныйНалог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦенныеБумагиСписываемые
	|		ПО НачисленныйНалог.Основание = ПоручениеЦенныеБумагиСписываемые.Ссылка
	|			И НачисленныйНалог.СчетДепо = ПоручениеЦенныеБумагиСписываемые.СчетДепо
	|			И НачисленныйНалог.РазделСчетаДепо = ПоручениеЦенныеБумагиСписываемые.РазделСчетаДепо
	|			И НачисленныйНалог.Депонент = ПоручениеЦенныеБумагиСписываемые.СчетДепо.Владелец
	|ГДЕ
	|	НачисленныйНалог.Ссылка = &НачисленныйНалог";
	
	Запрос.УстановитьПараметр("НачисленныйНалог", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		ЗаполнитьЗначенияСвойств(ДанныеКлиента, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат ДанныеКлиента;

КонецФункции

#КонецОбласти
