&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.ЗначенияЗаполнения.Свойство("ВнешнийИсточник",ВнешнийИсточник);
	Параметры.ЗначенияЗаполнения.Свойство("ОбработчикЗагрузки",ОбработчикЗагрузки);
	Если ЗначениеЗаполнено(ВнешнийИсточник) Тогда 
		ЗаполнитьТаблицуНаСервере();
	КонецЕсли;
	
КонецПроцедуры                             

&НаСервере
Функция ЗаполнитьТаблицуНаСервере()
	
	СообщенияСОшибками =  РегистрыСведений.ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.ПолучитьСообщенияТаблица(ВнешнийИсточник);
	Сообщения.Загрузить(СообщенияСОшибками);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	
	ЗаполнитьТаблицуНаСервере()
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСообщенияНаСервере(СообщениеОбОшибке)
	Обр = Обработки[ОбработчикЗагрузки].Создать();
	тзн = РеквизитФормыВЗначение("Сообщения",Тип("ТаблицаЗначений"));
	Обр.ОбработкаОшибокОнлайнЗагрузки(тзн,СообщениеОбОшибке);
	ЗначениеВРеквизитФормы(тзн, "Сообщения");
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСообщения(Команда)
	СообщениеОбОшибке = "";
	ЗагрузитьСообщенияНаСервере(СообщениеОбОшибке);
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибки загрузки сообщений: "+Символы.ПС+СообщениеОбОшибке);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьСообщенияНаСервере(ВнешнийИсточник)
	тзн = РеквизитФормыВЗначение("Сообщения",Тип("ТаблицаЗначений"));
	РегистрыСведений.ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.УдалитьСообщенияВТаблице(ВнешнийИсточник,тзн);
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСообщения(Команда)
	Если Вопрос("Отмеченные сообшения будут удалены из очереди без возможности восстановления. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
		УдалитьСообщенияНаСервере(ВнешнийИсточник);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицу(Команда)
	Сообщения.Очистить();
КонецПроцедуры

&НаКлиенте
Функция ОбновитьТекущееСообщение()
	Если ПоказыватьТекстСообщения Тогда 
		Элементы.ТекстСообщения.Видимость = Истина;
		ТС = Элементы.Сообщения.ТекущиеДанные;
		Если ТС<>Неопределено Тогда
			ТекстСообщения = ТС.Сообщение;
		КонецЕсли;
	Иначе 
		ТекстСообщения = "";
		Элементы.ТекстСообщения.Видимость = Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СообщенияПриАктивизацииСтроки(Элемент)
	ОбновитьТекущееСообщение();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТекстСообщенияПриИзменении(Элемент)
	ОбновитьТекущееСообщение();
КонецПроцедуры
