#Область ОписаниеПеременных

// СтандартныеПодсистемы

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;

// Конец СтандартныеПодсистемы


// Переменная для хранения текущего пользователя ("Справочник.Пользователи")
Перем глТекущийПользователь Экспорт;

// Учет ведется по одной организации - или по нескольким.
Перем УчетПоВсемОрганизациям Экспорт;
Перем ОсновнаяОрганизация Экспорт;

// компонента защиты
Перем Рарус_Компонента		Экспорт; // Объект компоненты защиты, оборудования и сервисных функций

// переменные ADO
Перем ТипыКомандADO Экспорт;
Перем ТипыПараметровADO Экспорт;
Перем ТипыНаправленийПараметраADO Экспорт;

// БазоваяФункциональность

// СписокЗначений для накапливания пакета сообщений в журнал регистрации, 
// формируемых в клиентской бизнес-логике.
Перем СообщенияДляЖурналаРегистрации Экспорт; 

// Кэшируется, чтобы в данном сеансе повторно не предлагать установку
Перем ПредлагатьУстановкуРасширенияРаботыСФайлами Экспорт;

// Структура, содержащая в себе время начала и окончания обновления программы.
Перем ПараметрыРаботыКлиентаПриОбновлении Экспорт;

// Конец БазоваяФункциональность

#КонецОбласти


Процедура ПриНачалеРаботыСистемы()
	ТипыКомандADO				= ВнешниеДанные.ИнициализацияТиповADO();
	ТипыПараметровADO			= ВнешниеДанные.ИнициализацияТиповПараметровADO();
	ТипыНаправленийПараметраADO = ВнешниеДанные.ИнициализацияТиповНаправленияПараметровADO();

	// Определим текущего пользователя
	Пользователь = ОбщегоНазначения.обОпределитьТекущегоПользователя();
	ПараметрыСеанса.ТекущийПользователь = Пользователь;
	
	// Инициализация параметров для работы с ADO в клиент серверном варианте
	ПараметрыСеанса.ТипыКомандADO				= Новый ФиксированнаяСтруктура(ТипыКомандADO);
	ПараметрыСеанса.ТипыПараметровADO			= Новый ФиксированнаяСтруктура(ТипыПараметровADO);
	ПараметрыСеанса.ТипыНаправленийПараметраADO	= Новый ФиксированнаяСтруктура(ТипыНаправленийПараметраADO);
	
	// Определим параметры сеанса, необходимые для ограничения прав доступа.
	ПараметрыСеанса.ПустаяОрганизация = Справочники.Организации.ПустаяСсылка();

	ОпределитьТекущегоПользователя();
	
	ПолныеПрава.УстановитьПараметрыСеанса(глТекущийПользователь);
	
	// Подключаем обработчик контроля завершения работы пользователей
	УправлениеСоединениямиИБКлиент.УстановитьКонтрольРежимаЗавершенияРаботыПользователей();
	
	ОбщегоНазначенияКлиент.УстановитьПроизвольныйЗаголовокПриложения();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ПАРАМЕТРОВ СЕАНСА

// Процедура инициализирует глобальную переменную глТекущийПользователь.
// Переменная содержит ссылку на элемент справочника "Пользователи", 
// соответствующий текущему пользователю информационной базы.
//
// Параметры:
//  Нет.
//
Процедура ОпределитьТекущегоПользователя()

	Если ПустаяСтрока(ИмяПользователя()) Тогда
		ИмяПользователя       = "НеАвторизован";
		ПолноеИмяПользователя = "Не авторизован";

	Иначе
		ИмяПользователя       = ИмяПользователя();

		Если ПустаяСтрока(ПолноеИмяПользователя()) Тогда
			ПолноеИмяПользователя = ИмяПользователя;
		Иначе
			ПолноеИмяПользователя = ПолноеИмяПользователя();
		КонецЕсли;

	КонецЕсли;

	глТекущийПользователь = Справочники.Пользователи.НайтиПоКоду(ИмяПользователя);

	Если глТекущийПользователь = Справочники.Пользователи.ПустаяСсылка() Тогда

		ОбъектПользователь = Справочники.Пользователи.СоздатьЭлемент();

		ОбъектПользователь.Код          = ИмяПользователя;
		ОбъектПользователь.Наименование = ПолноеИмяПользователя;

		ОбъектПользователь.Записать();

		// Запишем в качестве основного ответственного самого пользователя.
		ЗаписьРегистра 				= РегистрыСведений.НастройкиПользователей.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Пользователь = ОбъектПользователь.Ссылка;
		ЗаписьРегистра.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойОтветственный;
		ЗаписьРегистра.Значение     = ОбъектПользователь.Ссылка;
		ЗаписьРегистра.Записать();

		Сообщить("Пользователь зарегистрирован в справочнике пользователей.");
		глТекущийПользователь = ОбъектПользователь.Ссылка;
		
		Набор 								   = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
		Набор.Отбор.Пользователь.Использование = Истина;
		Набор.Отбор.Пользователь.Значение      = глТекущийПользователь;
		
		// Инициализируем признак учета по всем организациям
		Режим = Истина;
		
		// установим пользователю основную организацию
		Если РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
			Запрос = Новый Запрос();
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	Организации.Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации";
			Выборка = Запрос.Выполнить().Выбрать();

			Если Выборка.Количество() > 0 Тогда

				Если Выборка.Количество() = 1 Тогда

					// выбирать не из чего - запишем значения без лишних вопросов
					Выборка.Следующий();
					ОсновнаяОрганизация = Выборка.Ссылка;
					
				Иначе

					ОсновнаяОрганизация = Справочники.Организации.ПустаяСсылка()

				КонецЕсли; // Если Выборка.Количество() > 0 Тогда

			КонецЕсли; // Если Выборка.Количество() = 1 Тогда

			Запись = Набор.Добавить();

			Запись.Пользователь = глТекущийПользователь;
			Запись.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация;
			Запись.Значение     = ОсновнаяОрганизация;
			
		КонецЕсли;

		Запись = Набор.Добавить();
		
		Запись.Пользователь = глТекущийПользователь;
		Запись.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.ЗапрашиватьПодтверждениеПриЗакрытии;
		Запись.Значение     = Истина;

		Запись = Набор.Добавить();
		
		Запись.Пользователь = глТекущийПользователь;
		Запись.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.УчетПоВсемОрганизациям;
		Запись.Значение     = Режим;
		
		Набор.Записать();

	КонецЕсли; // Если глТекущийПользователь = Справочники.Пользователи.ПустаяСсылка() Тогда

	ОсновнаяОрганизация    = Пользователи.ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "ОсновнаяОрганизация");
	УчетПоВсемОрганизациям = Пользователи.ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "УчетПоВсемОрганизациям");

КонецПроцедуры // ОпределитьТекущегоПользователя()

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	Если ПараметрыСеанса.ЗавершитьРаботу Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если ПараметрыПриложения = Неопределено Тогда
		ПараметрыПриложения = Новый Соответствие;
	КонецЕсли;
	
	ПользователиСлужебный.ПереопределитьПрофильСлужебнойГруппыПользователейОПР();
	
	Если СтрНайти(СтрокаСоединенияИнформационнойБазы(), "UAT") > 1 Тогда
		ГлавныйСтиль = БиблиотекаСтилей["UAT"];	
	ИначеЕсли СтрНайти(СтрокаСоединенияИнформационнойБазы(), "Support") > 1 Тогда
		ГлавныйСтиль = БиблиотекаСтилей["Support"];	
	Иначе
	КонецЕсли;
	
КонецПроцедуры
