// Процедура выполняет замену ключей текста запроса на корректный текст компиляции
Процедура ВыполнитьОбработкуИЗаменуТекстаЗапроса(Запрос)
	ТекстЗапроса     = Запрос.Текст;
	ПараметрыЗапроса = Запрос.Параметры;
	
	Если УстановленОтборПо("Депонент", ПараметрыЗапроса) Тогда
		СтрокаОтбора = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ДепонентВидСравнения,
			"&Депонент", "Журнал.Депонент",,, ПараметрыЗапроса.Депонент); 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоДепоненту", СтрокаОтбора);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоДепоненту", "Истина");
	КонецЕсли;
	
	Если УстановленОтборПо("ЦеннаяБумага", ПараметрыЗапроса) Тогда
		СтрокаОтбора = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ЦеннаяБумагаВидСравнения,
			"&ЦеннаяБумага", "Журнал.ЦеннаяБумага",,, ПараметрыЗапроса.ЦеннаяБумага); 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоЦеннойБумаге", СтрокаОтбора);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоЦеннойБумаге", "Истина");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
КонецПроцедуры

Процедура ЗаполнитьПараметрыЗапросаПоОтборуСКД(Запрос)
	сзПараметрыЗапроса = Новый СписокЗначений;
	сзПараметрыЗапроса.Добавить("Депонент");
	сзПараметрыЗапроса.Добавить("ЦеннаяБумага");
	
	Для Каждого элПарам Из сзПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(элПарам.Значение,					Неопределено);
		Запрос.УстановитьПараметр(элПарам.Значение+"ВидСравнения",	Неопределено);
		Запрос.УстановитьПараметр(элПарам.Значение+"Использование",	Ложь);
	КонецЦикла;	 

	// Заполним структуру параметров на основании данных отбора
	ЭлементыОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
		
	Для Каждого Эл Из ЭлементыОтбора Цикл
		Если Эл.Использование Тогда
			
			ИмяПараметра1 = СокрЛП(эл.ЛевоеЗначение);
			ИмяПараметра2 = СокрЛП(эл.ЛевоеЗначение)+"ВидСравнения";
			ИмяПараметра3 = СокрЛП(эл.ЛевоеЗначение)+"Использование";
			
			Если Запрос.Параметры.Свойство(ИмяПараметра1) Тогда
				Запрос.Параметры[ИмяПараметра1] = эл.ПравоеЗначение;
			КонецЕсли;
			
			Если Запрос.Параметры.Свойство(ИмяПараметра2) Тогда
				Запрос.Параметры[ИмяПараметра2] = эл.ВидСравнения;
				
			КонецЕсли;
			
			Если Запрос.Параметры.Свойство(ИмяПараметра3) Тогда
				Запрос.Параметры[ИмяПараметра3] = эл.Использование;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Возвращает результат запроса к БД
Функция СформироватьЗапрос() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНачала",    	 НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("ДатаОкончания", 	 КонецДня(ДатаКон));
	ЗаполнитьПараметрыЗапросаПоОтборуСКД(Запрос);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Журнал.НомерДокумента КАК НомерДокумента,
	|	Журнал.Период КАК ДатаДокумента,
	|	Журнал.НаименованиеДокументаИлиКомплекта КАК НаименованиеДокументаИлиКомплекта,
	|	Журнал.Депонент КАК Депонент,
	|	Журнал.Депонент.Код КАК КодДепонента,
	|	Журнал.ДатаНаправленияВрученияДокумента КАК ДатаНаправленияВрученияДокумента,
	|	Журнал.Адресат КАК Адресат,
	|	Журнал.Исполнитель КАК Исполнитель,
	|	Журнал.Комментарий КАК Комментарий,
	|	Журнал.Основание КАК Основание,
	|	Журнал.ЦеннаяБумага КАК ЦеннаяБумага
	|ИЗ
	|	РегистрСведений.ЖурналИсходящихДокументов КАК Журнал
	|ГДЕ
	|	Журнал.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И &ОтборПоДепоненту
	|	И &ОтборПоЦеннойБумаге
	|
	|УПОРЯДОЧИТЬ ПО
	|	Журнал.Период,
	|	Журнал.Основание";
	ВыполнитьОбработкуИЗаменуТекстаЗапроса(Запрос);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
КонецФункции

// Возвращает структуру параметров шапки макета
Функция СформироватьПараметрыШапкиМакета() Экспорт
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ДтНач", Формат(ДатаНач, "ДФ=dd.MM.yyyy"));
	СтруктураВозврата.Вставить("ДтКон", Формат(ДатаКон, "ДФ=dd.MM.yyyy"));
	Возврат СтруктураВозврата;
КонецФункции
    
// Очищает значения параметров области макета
Процедура ОчиститьЗначенияПараметровМакета(ПараметрыМакета) Экспорт
	Для Инд = 0 По (ПараметрыМакета.Количество()-1) Цикл
		ПараметрыМакета.Установить(Инд, Неопределено);
	КонецЦикла;
КонецПроцедуры	

Процедура СформироватьОтчет(Таблица) Экспорт
	РезультатЗапроса = СформироватьЗапрос();
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("Данные для формирования отчета не обнаружены!");
		Возврат;
	КонецЕсли;
	
	Макет = ПолучитьМакет("Отчет");
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаОснование	= Макет.ПолучитьОбласть("Шапка|Основание");
	ОбластьШапкаОтчет		= Макет.ПолучитьОбласть("Шапка|Отчет");
	ОбластьСтрокаОснование	= Макет.ПолучитьОбласть("Строка|Основание");
	ОбластьСтрокаОтчет		= Макет.ПолучитьОбласть("Строка|Отчет");
	ОбластьПодвалОснование	= Макет.ПолучитьОбласть("Подвал|Основание");
	ОбластьПодвалОтчет		= Макет.ПолучитьОбласть("Подвал|Отчет");

	// ЗАГОЛОВОК
	СтруктураЗаголовка = СформироватьПараметрыШапкиМакета();
	ОбластьЗаголовок.Параметры.Заполнить(СтруктураЗаголовка);
	Таблица.Вывести(ОбластьЗаголовок);
	
	// ШАПКА
	Если ПоказыватьДокументОснование Тогда
		Таблица.Вывести(ОбластьШапкаОснование);
		Таблица.Присоединить(ОбластьШапкаОтчет);
	Иначе
		Таблица.Вывести(ОбластьШапкаОтчет);
	КонецЕсли;
	
	// СТРОКА ОТЧЕТА
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОчиститьЗначенияПараметровМакета(ОбластьСтрокаОтчет.Параметры);
		// Заполнение параметров строки
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаОтчет.Параметры, Выборка);
		ОбластьСтрокаОтчет.Параметры.НаименованиеЮрФизЛицаКлиента = ОбщегоНазначенияКлиентСервер.НаименованиеЮрФизЛицаКлиента(
			Выборка.Депонент, Выборка.ДатаДокумента, Ложь);
			
		Если ПоказыватьДокументОснование Тогда
			ОчиститьЗначенияПараметровМакета(ОбластьСтрокаОснование.Параметры);
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаОснование.Параметры, Выборка);
			Таблица.Вывести(ОбластьСтрокаОснование);
			Таблица.Присоединить(ОбластьСтрокаОтчет);
		Иначе
			Таблица.Вывести(ОбластьСтрокаОтчет);
		КонецЕсли;
	КонецЦикла;
	
	// ПОДВАЛ ОТЧЕТА
	Если ПоказыватьДокументОснование Тогда
		Таблица.Вывести(ОбластьПодвалОснование);
		Таблица.Присоединить(ОбластьПодвалОтчет);
	Иначе
		Таблица.Вывести(ОбластьПодвалОтчет);
	КонецЕсли;
	
	// Установим ширину колонок
	УстановитьШиринуКолонки(Таблица, 1, 18);	// Номер документа
	УстановитьШиринуКолонки(Таблица, 2, 16);	// Дата и время регистрации документа
	УстановитьШиринуКолонки(Таблица, 3, 18);	// Наименование документа / комплекта документов
	УстановитьШиринуКолонки(Таблица, 4, 26);	// Депонент
	УстановитьШиринуКолонки(Таблица, 5, 9);		// Код депонента
	УстановитьШиринуКолонки(Таблица, 6, 11);	// Дата направления (вручения) документа
	УстановитьШиринуКолонки(Таблица, 7, 48);	// Адресат, которому направлен (вручен) документ
	УстановитьШиринуКолонки(Таблица, 8, 21);	// Исполнитель
	УстановитьШиринуКолонки(Таблица, 9, 21);	// Комментарий
КонецПроцедуры

Процедура УстановитьШиринуКолонки(Таблица, НомерКолонкиБезДокументаОснования, Ширина)
	мНомерКолонки = ?(ПоказыватьДокументОснование, НомерКолонкиБезДокументаОснования + 1, НомерКолонкиБезДокументаОснования);
	мКолонка = Таблица.Область(, мНомерКолонки,, мНомерКолонки);
	мКолонка.ШиринаКолонки = Ширина;
КонецПроцедуры

Функция УстановленОтборПо(ИмяПараметра, ПараметрыЗапроса)
	Возврат ЗначениеЗаполнено(ПараметрыЗапроса[ИмяПараметра]) И ПараметрыЗапроса[ИмяПараметра+"Использование"] = Истина; 
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
