// IMDEV-9314: оптимизация запросов зафиксированных котировок БУ и УУ.

&ИзменениеИКонтроль("ЗафиксированныеКотировкиБУ")
Функция ЗафиксированныеКотировкиБУ(СписокЦБ, СписокБирж)
	
	МенеджерВТ 	= Новый МенеджерВременныхТаблиц;
	Запрос 		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	#Вставка
	// IMDEV-9314++
	ТаблицаАктивов = Новый ТаблицаЗначений;
	ТаблицаАктивов.Колонки.Добавить("Актив", Новый ОписаниеТипов("СправочникСсылка.Активы"));
	Для Каждого ТекАктив Из СписокЦБ Цикл
		СтрокаТЗ = ТаблицаАктивов.Добавить();
		СтрокаТЗ.Актив = ТекАктив;
	КонецЦикла;
	// IMDEV-9314--
	#КонецВставки
	
	Запрос.УстановитьПараметр("Дата",		НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДоговорДУ",	ДоговорДУ);
	#Удаление
	Запрос.УстановитьПараметр("СписокЦБ", 	СписокЦБ);
	#КонецУдаления
	#Вставка
	// IMDEV-9314++
	Запрос.УстановитьПараметр("ТаблицаАктивов", ТаблицаАктивов);
	// IMDEV-9314--
	#КонецВставки
	Запрос.УстановитьПараметр("СписокБирж", СписокБирж);
	Запрос.УстановитьПараметр("ПустаяДата",	'00010101');
	
	#Удаление
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ  // ИКФ (2026-08-07): IMAPPS-38656
	|	СпрАктивы.Ссылка как Актив
	|ПОМЕСТИТЬ втАктивы
	|ИЗ Справочник.Активы как СпрАктивы
	|ГДЕ СпрАктивы.Ссылка В (&СписокЦБ)
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив
	|;
	|
	|ВЫБРАТЬ
	|	КотировкиЦБНаБиржеСрезПоследних.Актив КАК Актив,
	|	КотировкиЦБНаБиржеСрезПоследних.Валюта КАК Валюта,
	|	МАКСИМУМ(КотировкиЦБНаБиржеСрезПоследних.МинимальнаяЦена) КАК МинимальнаяЦена,
	|	МАКСИМУМ(КотировкиЦБНаБиржеСрезПоследних.МаксимальнаяЦена) КАК МаксимальнаяЦена
	|ПОМЕСТИТЬ ВТ_КотировкиЦБ
	|ИЗ
	|	РегистрСведений.КотировкиЦБНаБирже.СрезПоследних(
	|			&Дата,
	|			Актив В (ВЫБРАТЬ Актив ИЗ втАктивы)  //Актив В (&СписокЦБ)  // ИКФ (2026-08-07): IMAPPS-38656
	|				И Биржа В (&СписокБирж)) КАК КотировкиЦБНаБиржеСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	КотировкиЦБНаБиржеСрезПоследних.Актив,
	|	КотировкиЦБНаБиржеСрезПоследних.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.Актив,
	|	Котировки.Валюта,
	|	Котировки.Котировка,
	|	Котировки.Расчетная,
	|	ЕСТЬNULL(ВТ_КотировкиЦБ.МинимальнаяЦена, Котировки.МинимальнаяЦена) КАК МинимальнаяЦена,
	|	ЕСТЬNULL(ВТ_КотировкиЦБ.МаксимальнаяЦена, Котировки.МаксимальнаяЦена) КАК МаксимальнаяЦена,
	|	Котировки.Биржа,
	|	ВЫБОР
	|		КОГДА Котировки.ДатаОпределения = &ПустаяДата
	|			ТОГДА Котировки.Период
	|		ИНАЧЕ Котировки.ДатаОпределения
	|	КОНЕЦ КАК ДатаОпределения
	|ПОМЕСТИТЬ АктуальныеКотировки
	|ИЗ
	|	РегистрСведений.ЗафиксированныеКотировкиЦБ_БУ.СрезПоследних(
	|			&Дата,
	|			Актив В (ВЫБРАТЬ Актив ИЗ втАктивы)  //Актив В (&СписокЦБ)  // ИКФ (2026-08-07): IMAPPS-38656
	|				И ДоговорДУ = &ДоговорДУ
	|				И Расчетная = ЛОЖЬ) КАК Котировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиЦБ КАК ВТ_КотировкиЦБ
	|		ПО Котировки.Актив = ВТ_КотировкиЦБ.Актив
	|			И Котировки.Валюта = ВТ_КотировкиЦБ.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Котировки.Актив,
	|	ДатаОпределения";
	#КонецУдаления
	#Вставка
	// IMDEV-9314++
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаАктивов.Актив КАК Актив
	|ПОМЕСТИТЬ втАктивы
	|ИЗ
	|	&ТаблицаАктивов КАК ТаблицаАктивов
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив
	|;
	|
	|ВЫБРАТЬ
	|	КотировкиЦБНаБиржеСрезПоследних.Актив КАК Актив,
	|	КотировкиЦБНаБиржеСрезПоследних.Валюта КАК Валюта,
	|	МАКСИМУМ(КотировкиЦБНаБиржеСрезПоследних.МинимальнаяЦена) КАК МинимальнаяЦена,
	|	МАКСИМУМ(КотировкиЦБНаБиржеСрезПоследних.МаксимальнаяЦена) КАК МаксимальнаяЦена
	|ПОМЕСТИТЬ ВТ_КотировкиЦБ
	|ИЗ
	|	РегистрСведений.КотировкиЦБНаБирже.СрезПоследних(
	|			&Дата,
	|			Биржа В (&СписокБирж)) КАК КотировкиЦБНаБиржеСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАктивы КАК втАктивы
	|		ПО КотировкиЦБНаБиржеСрезПоследних.Актив = втАктивы.Актив
	|
	|СГРУППИРОВАТЬ ПО
	|	КотировкиЦБНаБиржеСрезПоследних.Актив,
	|	КотировкиЦБНаБиржеСрезПоследних.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.Актив,
	|	Котировки.Валюта,
	|	Котировки.Котировка,
	|	Котировки.Расчетная,
	|	Котировки.МинимальнаяЦена,
	|	Котировки.МаксимальнаяЦена,
	|	Котировки.Биржа,
	|	ВЫБОР
	|		КОГДА Котировки.ДатаОпределения = &ПустаяДата
	|			ТОГДА Котировки.Период
	|		ИНАЧЕ Котировки.ДатаОпределения
	|	КОНЕЦ КАК ДатаОпределения
	|ПОМЕСТИТЬ втСрезЗафиксированных
	|ИЗ
	|	РегистрСведений.ЗафиксированныеКотировкиЦБ_БУ.СрезПоследних(
	|			&Дата,
	|			ДоговорДУ = &ДоговорДУ
	|				И Расчетная = ЛОЖЬ) КАК Котировки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.Актив,
	|	Котировки.Валюта,
	|	Котировки.Котировка,
	|	Котировки.Расчетная,
	|	ЕСТЬNULL(ВТ_КотировкиЦБ.МинимальнаяЦена, Котировки.МинимальнаяЦена) КАК МинимальнаяЦена,
	|	ЕСТЬNULL(ВТ_КотировкиЦБ.МаксимальнаяЦена, Котировки.МаксимальнаяЦена) КАК МаксимальнаяЦена,
	|	Котировки.Биржа,
	|	Котировки.ДатаОпределения
	|ПОМЕСТИТЬ АктуальныеКотировки
	|ИЗ
	|	втСрезЗафиксированных КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАктивы КАК втАктивы
	|		ПО Котировки.Актив = втАктивы.Актив
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиЦБ КАК ВТ_КотировкиЦБ
	|		ПО Котировки.Актив = ВТ_КотировкиЦБ.Актив
	|			И Котировки.Валюта = ВТ_КотировкиЦБ.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив,
	|	ДатаОпределения";
	// IMDEV-9314--
	#КонецВставки
	
	Запрос.Выполнить();
	
	
	ОбщегоНазначенияДУ.ДобавитьВЛогОтладки(Запрос, "Документ.УстановкаКотировок.ЗафиксированныеКотировкиБУ()");
	
	Возврат МенеджерВТ;
	
КонецФункции

&ИзменениеИКонтроль("ЗафиксированныеКотировкиУУ")
Функция ЗафиксированныеКотировкиУУ(СписокЦБ, СписокБирж)
	
	МенеджерВТ 	= Новый МенеджерВременныхТаблиц;
	Запрос 		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	#Вставка
	// IMDEV-9314++
	ТаблицаАктивов = Новый ТаблицаЗначений;
	ТаблицаАктивов.Колонки.Добавить("Актив", Новый ОписаниеТипов("СправочникСсылка.Активы"));
	Для Каждого ТекАктив Из СписокЦБ Цикл
		СтрокаТЗ = ТаблицаАктивов.Добавить();
		СтрокаТЗ.Актив = ТекАктив;
	КонецЦикла;
	// IMDEV-9314--
	#КонецВставки
	
	Запрос.УстановитьПараметр("Дата",		НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДоговорДУ",	ДоговорДУ);
	#Удаление
	Запрос.УстановитьПараметр("СписокЦБ", 	СписокЦБ);
	#КонецУдаления
	#Вставка
	// IMDEV-9314++
	Запрос.УстановитьПараметр("ТаблицаАктивов", ТаблицаАктивов);
	// IMDEV-9314--
	#КонецВставки
	Запрос.УстановитьПараметр("СписокБирж", СписокБирж);
	Запрос.УстановитьПараметр("ПустаяДата",	'00010101');
	
	#Удаление
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ  // ИКФ (2026-08-07): IMAPPS-38656
	|	СпрАктивы.Ссылка как Актив
	|ПОМЕСТИТЬ втАктивы
	|ИЗ Справочник.Активы как СпрАктивы
	|ГДЕ СпрАктивы.Ссылка В (&СписокЦБ)
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив
	|;
	|
	|ВЫБРАТЬ
	|	КотировкиЦБНаБиржеСрезПоследних.Актив КАК Актив,
	|	КотировкиЦБНаБиржеСрезПоследних.Валюта КАК Валюта,
	|	МАКСИМУМ(КотировкиЦБНаБиржеСрезПоследних.МинимальнаяЦена) КАК МинимальнаяЦена,
	|	МАКСИМУМ(КотировкиЦБНаБиржеСрезПоследних.МаксимальнаяЦена) КАК МаксимальнаяЦена
	|ПОМЕСТИТЬ ВТ_КотировкиЦБ
	|ИЗ
	|	РегистрСведений.КотировкиЦБНаБирже.СрезПоследних(
	|			&Дата,
	|			Актив В (ВЫБРАТЬ Актив ИЗ втАктивы)  //Актив В (&СписокЦБ)  // ИКФ (2026-08-07): IMAPPS-38656
	|				И Биржа В (&СписокБирж)) КАК КотировкиЦБНаБиржеСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	КотировкиЦБНаБиржеСрезПоследних.Актив,
	|	КотировкиЦБНаБиржеСрезПоследних.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.Актив,
	|	Котировки.Валюта,
	|	Котировки.Котировка,
	|	Котировки.Расчетная,
	|	Котировки.СредневзвешеннаяЦена,
	|	ЕСТЬNULL(ВТ_КотировкиЦБ.МинимальнаяЦена, Котировки.МинимальнаяЦена) КАК МинимальнаяЦена,
	|	ЕСТЬNULL(ВТ_КотировкиЦБ.МаксимальнаяЦена, Котировки.МаксимальнаяЦена) КАК МаксимальнаяЦена,
	|	Котировки.ЦенаЗакрытия,
	|	Котировки.ЭкспертнаяЦена,
	|	Котировки.ЦенаСпроса,
	|	Котировки.Биржа,
	|	Котировки.ОбъемТоргов,
	|	Котировки.УровеньКотировальногоЛиста,
	|	ВЫБОР
	|		КОГДА Котировки.ДатаОпределения = &ПустаяДата
	|			ТОГДА Котировки.Период
	|		ИНАЧЕ Котировки.ДатаОпределения
	|	КОНЕЦ КАК ДатаОпределения
	|ПОМЕСТИТЬ АктуальныеКотировки
	|ИЗ
	|	РегистрСведений.ЗафиксированныеКотировкиЦБ.СрезПоследних(
	|			&Дата,
	|			Актив В (ВЫБРАТЬ Актив ИЗ втАктивы)  //Актив В (&СписокЦБ)  // ИКФ (2026-08-07): IMAPPS-38656
	|				И ДоговорДУ = &ДоговорДУ
	|				И Расчетная = ЛОЖЬ) КАК Котировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиЦБ КАК ВТ_КотировкиЦБ
	|		ПО Котировки.Актив = ВТ_КотировкиЦБ.Актив
	|			И Котировки.Валюта = ВТ_КотировкиЦБ.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Котировки.Актив,
	|	ДатаОпределения";
	#КонецУдаления
	#Вставка
	// IMDEV-9314++
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаАктивов.Актив КАК Актив
	|ПОМЕСТИТЬ втАктивы
	|ИЗ
	|	&ТаблицаАктивов КАК ТаблицаАктивов
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив
	|;
	|
	|ВЫБРАТЬ
	|	КотировкиЦБНаБиржеСрезПоследних.Актив КАК Актив,
	|	КотировкиЦБНаБиржеСрезПоследних.Валюта КАК Валюта,
	|	МАКСИМУМ(КотировкиЦБНаБиржеСрезПоследних.МинимальнаяЦена) КАК МинимальнаяЦена,
	|	МАКСИМУМ(КотировкиЦБНаБиржеСрезПоследних.МаксимальнаяЦена) КАК МаксимальнаяЦена
	|ПОМЕСТИТЬ ВТ_КотировкиЦБ
	|ИЗ
	|	РегистрСведений.КотировкиЦБНаБирже.СрезПоследних(
	|			&Дата,
	|			Биржа В (&СписокБирж)) КАК КотировкиЦБНаБиржеСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАктивы КАК втАктивы
	|		ПО КотировкиЦБНаБиржеСрезПоследних.Актив = втАктивы.Актив
	|
	|СГРУППИРОВАТЬ ПО
	|	КотировкиЦБНаБиржеСрезПоследних.Актив,
	|	КотировкиЦБНаБиржеСрезПоследних.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.Актив,
	|	Котировки.Валюта,
	|	Котировки.Котировка,
	|	Котировки.Расчетная,
	|	Котировки.СредневзвешеннаяЦена,
	|	Котировки.МинимальнаяЦена,
	|	Котировки.МаксимальнаяЦена,
	|	Котировки.ЦенаЗакрытия,
	|	Котировки.ЭкспертнаяЦена,
	|	Котировки.ЦенаСпроса,
	|	Котировки.Биржа,
	|	Котировки.ОбъемТоргов,
	|	Котировки.УровеньКотировальногоЛиста,
	|	ВЫБОР
	|		КОГДА Котировки.ДатаОпределения = &ПустаяДата
	|			ТОГДА Котировки.Период
	|		ИНАЧЕ Котировки.ДатаОпределения
	|	КОНЕЦ КАК ДатаОпределения
	|ПОМЕСТИТЬ втСрезЗафиксированных
	|ИЗ
	|	РегистрСведений.ЗафиксированныеКотировкиЦБ.СрезПоследних(
	|			&Дата,
	|			ДоговорДУ = &ДоговорДУ
	|				И Расчетная = ЛОЖЬ) КАК Котировки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.Актив,
	|	Котировки.Валюта,
	|	Котировки.Котировка,
	|	Котировки.Расчетная,
	|	Котировки.СредневзвешеннаяЦена,
	|	ЕСТЬNULL(ВТ_КотировкиЦБ.МинимальнаяЦена, Котировки.МинимальнаяЦена) КАК МинимальнаяЦена,
	|	ЕСТЬNULL(ВТ_КотировкиЦБ.МаксимальнаяЦена, Котировки.МаксимальнаяЦена) КАК МаксимальнаяЦена,
	|	Котировки.ЦенаЗакрытия,
	|	Котировки.ЭкспертнаяЦена,
	|	Котировки.ЦенаСпроса,
	|	Котировки.Биржа,
	|	Котировки.ОбъемТоргов,
	|	Котировки.УровеньКотировальногоЛиста,
	|	Котировки.ДатаОпределения
	|ПОМЕСТИТЬ АктуальныеКотировки
	|ИЗ
	|	втСрезЗафиксированных КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАктивы КАК втАктивы
	|		ПО Котировки.Актив = втАктивы.Актив
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиЦБ КАК ВТ_КотировкиЦБ
	|		ПО Котировки.Актив = ВТ_КотировкиЦБ.Актив
	|			И Котировки.Валюта = ВТ_КотировкиЦБ.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив,
	|	ДатаОпределения";
	// IMDEV-9314--
	#КонецВставки
	
	Запрос.Выполнить();
	
	ОбщегоНазначенияДУ.ДобавитьВЛогОтладки(Запрос, "Документ.УстановкаКотировок.ЗафиксированныеКотировкиУУ()");
	
	Возврат МенеджерВТ;
	
КонецФункции
