
&НаСервере
Функция РассчитатьНаСервере()
	Перем ТекОбработка, ТекстОшибок, Результат;
	
	Результат = Неопределено;
	
	СписокЦБ = Новый Массив();
	СписокЦБ.Добавить(ЭтаФорма.Актив);
	
	ТекОбработка = РеквизитФормыВЗначение("Объект");
	Результат = ТекОбработка.ТекущиеКотировкиПоПравилу(ЭтаФорма.Мандат, ЭтаФорма.НаДату, ЭтаФорма.Правило, Новый Массив(), СписокЦБ, ТекстОшибок);
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Результат = Результат.СправкаРасчет;
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

&НаКлиенте
Процедура Рассчитать(Команда)
	
	СправкаРасчет_Макет = Неопределено;
	СправкаРасчет_Макет = РассчитатьНаСервере();
	
	Если ТипЗнч(СправкаРасчет_Макет) = Тип("ТабличныйДокумент") Тогда
		СправкаРасчет_Макет.ТолькоПросмотр = Истина;
		СправкаРасчет_Макет.Показать();
	КонецЕсли;
	
КонецПроцедуры
