
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоОткрытиеСуществующейЗаписи = Не Запись.ИсходныйКлючЗаписи.Пустой();
	ЭтоКопирование = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	
	СхемаКомпоновки = РегистрыСведений.ПравилаФормированияУслугДепозитария.ПолучитьМакет("СхемаДляОтбораДокументов");
	АдресСхемыКомпоновки = ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновки);
	НастройкиОтбораТарифов.Инициализировать(ИсточникНастроек);
	
	ЗаполнитьПравилаПоУмолчанию = Истина;
	
	Если ЭтоОткрытиеСуществующейЗаписи Или ЭтоКопирование Тогда
		МенеджерЗаписи = РегистрыСведений.ПравилаФормированияУслугДепозитария.СоздатьМенеджерЗаписи();
		Если ЭтоОткрытиеСуществующейЗаписи Тогда
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись.ИсходныйКлючЗаписи);
		ИначеЕсли ЭтоКопирование Тогда
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Параметры.ЗначениеКопирования);
		КонецЕсли;
		МенеджерЗаписи.Прочитать();
		ПравилоФормирования = МенеджерЗаписи.Правило.Получить();
		Если ЗначениеЗаполнено(ПравилоФормирования) Тогда
			НастройкиОтбораТарифов.ЗагрузитьНастройки(ПравилоФормирования);
			ЗаполнитьПравилаПоУмолчанию = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаполнитьПравилаПоУмолчанию Тогда
		НастройкиОтбораТарифов.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПравилоФормирования = Новый ХранилищеЗначения(НастройкиОтбораТарифов.ПолучитьНастройки());
	ТекущийОбъект.Правило = ПравилоФормирования;
	
КонецПроцедуры
