#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.НачалоПериода	= НачалоГода(ТекущаяДата());
	Объект.КонецПериода		= КонецДня(ТекущаяДата());
	Если Параметры.Свойство("ИмяОбработкиQUIK") Тогда
		ИмяОбработкиQUIK = Параметры.ИмяОбработкиQUIK;
	КонецЕсли;
	Объект.ИсточникЗагрузки = Перечисления.ИсточникиЗагрузки.Панда;
	Объект.ФормироватьСводныеПоручения = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсточникЗагрузкиПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТабличнойЧасти

&НаКлиенте
Процедура ДанныеДляПорученийЗагружатьПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДанныеДляПоручений.ТекущиеДанные;
	ТабЧасть = Объект.ДанныеДляПоручений;
	ТекЗагружать = ТекущиеДанные.Загружать;
	ТекИДБрокера = ТекущиеДанные.ИД_Брокера;
	Для Каждого СтрокаТЧ Из ТабЧасть Цикл
		Если ЗначениеЗаполнено(ТекИДБрокера) И СтрокаТЧ.ИД_Брокера = ТекИДБрокера Тогда
			СтрокаТЧ.Загружать = ТекЗагружать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	ПолучитьДанныНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ПометкаВыделить(Команда)
	Для Каждого Строка ИЗ Объект.ДанныеДляПоручений Цикл
		Строка.Загружать	= Истина;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПометкаСнять(Команда)
	Для Каждого Строка ИЗ Объект.ДанныеДляПоручений Цикл
		Строка.Загружать	= Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПометкаИнвертировать(Команда)
	Для Каждого Строка ИЗ Объект.ДанныеДляПоручений Цикл
		Строка.Загружать	= Не Строка.Загружать;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	Если Объект.ФормироватьСводныеПоручения И Не ВыбраныВсеСтрокиСОдинаковымИДБрокера() Тогда
		Ответ = Вопрос("Выделены не все строки с совпадающим ИД брокера. Продолжить создание поручений?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Проверка найден ли поставщик в "поручениях" по операциям "депонирования"
	Для Каждого Данные Из Объект.ДанныеДляПоручений Цикл
		Если Не Данные.Загружать Или Не ЭтоОперацияДепонирования(Данные.ВидОперации) Или Не ЗначениеЗаполнено(Данные.ID) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Данные.DepoCP) И Не ЗначениеЗаполнено(Данные.СчетДепоКонтрагента) Тогда
			Данные.СчетДепоКонтрагента = СчетДепоПоКоду(Данные.ID, Данные.DepoCP, Данные.DepoCPClient);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента) И ЗначениеЗаполнено(Данные.SubDepoCP)
			И Не ЗначениеЗаполнено(Данные.РазделСчетаДепоКонтрагента) Тогда
			Данные.РазделСчетаДепоКонтрагента = РазделСчетаДепоПоКоду(Данные.SubDepoCP, Данные.СчетДепоКонтрагента);
			Если Данные.НаименованиеМестаРасчетов = "Депозитарий БКП" Тогда
				Данные.МХКонтрагент = МХКонтрагентаПоРазделу(Данные.РазделСчетаДепоКонтрагента);
			КонецЕсли;
		КонецЕсли;
		
		ТребуетсяСозданиеДанныхКонтрагента = ЗначениеЗаполнено(Данные.DepoCP) И Не ЗначениеЗаполнено(Данные.СчетДепоКонтрагента)
		Или ЗначениеЗаполнено(Данные.SubDepoCP) И Не ЗначениеЗаполнено(Данные.РазделСчетаДепоКонтрагента);
		
		Если ТребуетсяСозданиеДанныхКонтрагента Тогда
			Ответ	= Вопрос("Найдены не все реквизиты 'Поставщика' ("+Данные.CP+") в 'Поручении' №"
							+Данные.НомерПоручения+" с типом операции 'Депонирование'!
							|
							|Создать недостающие объекты?", РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				СоздатьНедостающегоПоставщикаСервер(Данные.НомерПоручения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СоздатьДокументыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЖурналВходящихСообщенийKafka(Команда)
	ВнешнийИсточник = ПредопределенноеЗначение("ПланВидовХарактеристик.ВнешниеИсточники.KafkaPandaConsNti1634");
	ЗначениеОтбора = Новый Структура("ВнешнийИсточник", ВнешнийИсточник);
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.ЖурналВходящихСообщенийKafka.ФормаСписка", ПараметрыВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЖурналИсходящихСообщенийKafka(Команда)
	ВнешнийИсточник = ПредопределенноеЗначение("ПланВидовХарактеристик.ВнешниеИсточники.KafkaDepoToPandaNotification1642");
	ЗначениеОтбора = Новый Структура("ВнешнийИсточник", ВнешнийИсточник);
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.ЖурналИсходящихСообщенийKafka.ФормаСписка", ПараметрыВыбора);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьДанныНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Если ЗначениеЗаполнено(ИмяОбработкиQUIK) Тогда
		ОбработкаОбъект.ИнициироватьСоединение(Новый Структура("ИмяОбработки", ИмяОбработкиQUIK));
	КонецЕсли;
	ОбработкаОбъект.ПолучитьТаблицуПорученийЗаПериод(Объект.НачалоПериода, Объект.КонецПериода);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура СоздатьНедостающегоПоставщикаСервер(НомерПоручения)
	Если Не ЗначениеЗаполнено(НомерПоручения) Тогда
		Возврат;
	КонецЕсли;
	ПараметрыПоиска = Новый Структура("НомерПоручения", НомерПоручения);
	СтрокиСПоручением = Объект.ДанныеДляПоручений.НайтиСтроки(ПараметрыПоиска);
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого Строка Из СтрокиСПоручением Цикл
		ОбработкаОбъект.СоздатьНедостающегоПоставщика(Строка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ЗагрузитьНеторговыеПоручения();	
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоОперацияДепонирования(ВидОперации)
		
	Возврат (ВидОперации = Справочники.ВидыОпераций.Депонирование ИЛИ ВидОперации = Справочники.ВидыОпераций.СнятиеСДепонирования);
	
КонецФункции

&НаСервере
Функция ВыбраныВсеСтрокиСОдинаковымИДБрокера()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДляПоручений.Загружать КАК Загружать,
	|	ДанныеДляПоручений.ИД_Брокера КАК ИД_Брокера,
	|	ДанныеДляПоручений.Поручение КАК Поручение
	|ПОМЕСТИТЬ ДанныеДляПоручений
	|ИЗ
	|	&ДанныеДляПоручений КАК ДанныеДляПоручений
	|ГДЕ
	|	ДанныеДляПоручений.Поручение = ЗНАЧЕНИЕ(Документ.Поручение.ПустаяСсылка)
	|	И ДанныеДляПоручений.ИД_Брокера <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляПоручений.ИД_Брокера КАК ИД_Брокера
	|ИЗ
	|	ДанныеДляПоручений КАК ДанныеДляПоручений
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляПоручений.ИД_Брокера
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ДанныеДляПоручений.Загружать) <> МАКСИМУМ(ДанныеДляПоручений.Загружать)";
	
	Запрос.УстановитьПараметр("ДанныеДляПоручений", Объект.ДанныеДляПоручений.Выгрузить(, "Загружать, ИД_Брокера, Поручение"));
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Выборка.ИД_Брокера);
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

&НаСервере
Функция СчетДепоПоКоду(КодКонтрагента, КодСчетаДепо, КодСчетаДепоКлиентаКонтрагента)
	Если Не ЗначениеЗаполнено(КодКонтрагента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Контрагент = Справочники.Контрагенты.НайтиПоКоду(КодКонтрагента);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Если ЗначениеЗаполнено(КодСчетаДепоКлиентаКонтрагента) Тогда
		КодСчетаДляПоиска = ОбработкаОбъект.КодСчетаДепоПоКодуСчетаКлиентаКонтрагента(КодСчетаДепоКлиентаКонтрагента, КодСчетаДепо);
		СчетДепоКонтрагента = Справочники.СчетаДепо.НайтиПоКоду(КодСчетаДляПоиска, , , Контрагент);
	Иначе
		СчетДепоКонтрагента = ОбработкаОбъект.ПодобратьСчетДепо(Контрагент, КодСчетаДепо);
	КонецЕсли;
	
	Возврат СчетДепоКонтрагента;
КонецФункции

&НаСервереБезКонтекста
Функция РазделСчетаДепоПоКоду(КодРаздела, ВладелецРаздела)
	
	Возврат Справочники.РазделыСчетаДепо.НайтиПоКоду(КодРаздела,,, ВладелецРаздела);
	
КонецФункции

&НаСервере
Функция МХКонтрагентаПоРазделу(РазделСчетаДепоКонтрагента)
	Если Не ЗначениеЗаполнено(РазделСчетаДепоКонтрагента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.МХКонтрагентаПоРазделу(РазделСчетаДепоКонтрагента);
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	ЭтоЗагрузкаИзПанда = (Объект.ИсточникЗагрузки = ПредопределенноеЗначение("Перечисление.ИсточникиЗагрузки.Панда"));
	Элементы.Контрагент.Видимость = ЭтоЗагрузкаИзПанда;
КонецПроцедуры

#КонецОбласти