
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	УстановитьВидимостьОписанияТипаСчета(ЭтотОбъект);
	УстановитьВидимостьТипаСчетаБенефициара();
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = СокрЛП(Объект.Владелец.Наименование);
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьОписанияТипаСчета(ЭтотОбъект)
	ЭтоOTHR = ЭтотОбъект.Объект.ТипСчетаДепоFCDR_2017_02 = ПредопределенноеЗначение("Справочник.ТипыСчетовДепоFCDR_2017_02.OTHR");
	ЭтотОбъект.Элементы.ОписаниеТипаСчетаДепоFCDR_2017_02.Видимость = ЭтоOTHR;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьТипаСчетаБенефициара()
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТипСчетаДепоFCDR_2017_02, "ЕстьБенефициар") = Истина Тогда
		Элементы.ТипСчетаБенефициараFCDR_2017_02.Видимость = Истина;
	Иначе
		Элементы.ТипСчетаБенефициараFCDR_2017_02.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПоУмолчаниюТипаСчетаБенефициара()
	
	РеквизитыТипаСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ТипСчетаДепоFCDR_2017_02, "ЕстьБенефициар, ТипСчетаБенефициара");
	Если РеквизитыТипаСчета.ЕстьБенефициар = Истина Тогда  
		ТипСчетаБенефициараFCDR_2017_02 = РеквизитыТипаСчета.ТипСчетаБенефициара;
	Иначе
		ТипСчетаБенефициараFCDR_2017_02 = Справочники.ТипыСчетовДепоFCDR_2017_02.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСчетаДепоFCDR_2017_02ПриИзменении(Элемент)
	
	УстановитьВидимостьОписанияТипаСчета(ЭтотОбъект);
	УстановитьВидимостьТипаСчетаБенефициара();
	УстановитьЗначениеПоУмолчаниюТипаСчетаБенефициара();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаименование(Элемент)
	Наименование = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Владелец, "Наименование");
	Объект.Наименование = СокрЛП(Наименование);
КонецПроцедуры
