
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если Вопрос("Вы уверены, что хотите повторно сформировать файлы пакет ORDSW?
		|Пакет уже мог быть обработан НРД.", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Путь = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПредопределенноеЗначение("ПланВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзКаталогКОтправке")).Папка;
		Если ЗначениеЗаполнено(Путь) Тогда
			ЗаписатьПакет(ПараметрКоманды, Путь);
		Иначе	
			ПоказатьПредупреждение( , "Не задан путь выгрузки!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьПакет(ПараметрКоманды, Путь)
	Для Каждого Документ Из ПараметрКоманды Цикл
		Выгрузка = Документ.ПолучитьОбъект();
		Выгрузка.СформироватьФайлыВыгрузки(Путь);
	КонецЦикла;
КонецПроцедуры

