//ПОДСИСТЕМА ДОПОЛНИТЕЛЬНЫХ ОТЧЕТОВ И ОБРАБОТОК//////////////////////////////////////////       
Перем ОшибкиВыполнения;   

#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
	ПараметрыРегистрации.Вставить("Наименование", "Оплата КЗ по клиентам РДУ");
	ПараметрыРегистрации.Вставить("Версия", Версия());
	ПараметрыРегистрации.Вставить("БезопасныйРежим",Ложь);
	ПараметрыРегистрации.Вставить("Информация","Оплата КЗ по клиентам РДУ");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "2.1.1.12");
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд,
			"Оплата КЗ по клиентам РДУ",
			"ЗаполнитьНачислениями",
			"ОткрытиеФормы");
	
	ДобавитьКоманду(ТаблицаКоманд,
			"Фоновая оплата КЗ по клиентам РДУ НДФЛ",
			"ВыполнитьОбработкуВФоне",
			ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода());
			
	ДобавитьКоманду(ТаблицаКоманд,
			"Фоновая оплата КЗ по клиентам РДУ ВУК",
			"ВыполнитьОбработкуВФонеВУК",
			ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода());

	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры

Функция Версия() Экспорт
	Возврат "2.19";
КонецФункции

#КонецОбласти

#Область ФоновоеВыполнение  

Функция ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	Если ИдентификаторКоманды = "ВыполнитьОбработкуВФоне" Тогда  
		ВыполнитьОбработкуВФонеНДФЛ(ПараметрыВыполненияКоманды);
	ИначеЕсли ИдентификаторКоманды = "ВыполнитьОбработкуВФонеВУК" Тогда  
		ВыполнитьОбработкуВФонеВУК(ПараметрыВыполненияКоманды);	
	Иначе
		УстановитьНастройки(ПараметрыВыполненияКоманды);
	КонецЕсли;	
КонецФункции

Функция ПересчитатьСуммуОбязательства()
	СуммаОбязательства = 0;
	Для Каждого Строка Из ДокументыКВыгрузке Цикл
		Если ПроверкаУсловийДобавления(Строка) Тогда
			СуммаОбязательства = СуммаОбязательства + Строка.СуммаОбязательства;
		КонецЕсли;	
	КонецЦикла;	
КонецФункции

Процедура ВыполнитьОбработкуВФонеНДФЛ(ПараметрыВыполненияКоманды)Экспорт
		
	//ВнОбработка = Обработки.ОплатаКзПоКлиентамРДУ.Создать();
	//ВнОбработка.ВыполнитьОбработкуВФонеНДФЛ(ПараметрыВыполненияКоманды);
	//Возврат;
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое выполнение оплаты КЗ по клиентам НДФЛ'"),
		 	УровеньЖурналаРегистрации.Информация,
			Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
			Метаданные().Имя,
			"Начато выполнение фонового задания НДФЛ");
			
	ОтборПосуммам   = Истина;
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();	
	КонецЕсли;	
	
	//Заполняем параметры (реквизиты обработки)
	ВидДокументаОснования = "НачислениеЗадолженности";
	НачислениеНДФЛ  = "НачислениеЗадолженности"; 
	ПрошлыйГод	    = НачалоГода(Период) - 1;
	НалоговыйПериод = НалоговыеПериоды(ПрошлыйГод); 
	
	//Шаг 1 Блокирование ДС
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое выполнение оплаты КЗ по клиентам НДФЛ'"),
		 	УровеньЖурналаРегистрации.Информация,
			Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
			Метаданные().Имя,
			"Начато выполнение фонового задания НДФЛ Шаг1");

	СравниватьСБрокерскимиСуммами = "НеУчитыватьОстаткиНаБрокерскомСчете";
	ЗаполнитьНачислениями(НачислениеНДФЛ, Истина);
	СформироватьБлокировкуДенежныхСредств();
	ОписаниеОшибки = "";   
	ПересчитатьСуммуОбязательства();
	СформироватьИОтправитьПисьмо("Блокировка", ОписаниеОшибки);
		
	//Шаг 2 Формирование Поручений 
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое выполнение оплаты КЗ по клиентам НДФЛ'"),
		 	УровеньЖурналаРегистрации.Информация,
			Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
			Метаданные().Имя,
			"Начато выполнение фонового задания НДФЛ Шаг2");

	СравниватьСБрокерскимиСуммами = "БрокерскимСчетом";
	//ЗаполнитьНачислениями(НачислениеНДФЛ, Истина); 
	ПересчитатьСуммуОбязательства();
	СформироватьПлатежноеПоручение();
	ОписаниеОшибки = "";
	СформироватьИОтправитьПисьмо("Перевод", ОписаниеОшибки);
	
	//Шаг 3 Сравнение с Расчетным счетом
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое выполнение оплаты КЗ по клиентам НДФЛ'"),
	УровеньЖурналаРегистрации.Информация,
	Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
	Метаданные().Имя,
	"Начато выполнение фонового задания НДФЛ Шаг3");
	
	СравниватьСБрокерскимиСуммами = "РасчетнымСчетом";
	//ЗаполнитьНачислениями(НачислениеНДФЛ, Истина); 
	ПересчитатьСуммуОбязательства();
	СформироватьШаблон();

	Если ОшибкиВыполнения Тогда
		ВызватьИсключение НСтр("ru = 'Были ошибки при выполнение регламетного задания, смотрите журнал регистрации!'");
	КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьОбработкуВФонеВУК(ПараметрыВыполненияКоманды)Экспорт
	
	//ВнОбработка = Обработки.ОплатаКзПоКлиентамРДУ.Создать();
	//ВнОбработка.ВыполнитьОбработкуВФонеВУК(ПараметрыВыполненияКоманды);
	//Возврат;

	ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое выполнение оплаты КЗ по клиентам ВУК'"),
		 	УровеньЖурналаРегистрации.Информация,
			Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
			Метаданные().Имя,
			"Начато выполнение фонового задания ВУК");

	ВидДокументаОснования = "НачислениеВознаграждения";		
	ОтборПосуммам   = Истина;
    Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();	
	КонецЕсли;
	
	//Заполняем параметры (реквизиты обработки)
	НачислениеВУК   = "НачислениеВознаграждения"; 
	ПрошлыйГод	    = НачалоГода(ТекущаяДатаСеанса()) - 1;
	НалоговыйПериод = НалоговыеПериоды(ПрошлыйГод); 
		
	//Шаг 1 Сравнение с Расчетным счетом и Формирование Поручений
    СравниватьСБрокерскимиСуммами = "РасчетнымСчетом";
	ЗаполнитьНачислениями(НачислениеВУК, Истина);  
	СформироватьПлатежноеПоручение();
    СформироватьШаблон();
	
	//Шаг 2 ФСравнение с брокерским без создания поручений
	СравниватьСБрокерскимиСуммами = "БрокерскимСчетом";
	ПересчитатьСуммуОбязательства();
	//ЗаполнитьНачислениями(НачислениеВУК, Истина);
	ОписаниеОшибки = "";
	СформироватьИОтправитьПисьмо("Перевод", ОписаниеОшибки);
	
	Если ОшибкиВыполнения Тогда
		ВызватьИсключение НСтр("ru = 'Были ошибки при выполнение регламетного задания, смотрите журнал регистрации!'");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоговорыКЗаполнению(ТекПериод)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорДУ.Ссылка КАК ДоговорДУ
		|ИЗ
		|	Справочник.ДоговорДУ КАК ДоговорДУ
		|ГДЕ
		|	ДоговорДУ.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|	И ДоговорДУ.ДатаНачала <= &Период
		|	И ДоговорДУ.ТипКлиентаДУ = &ТипКлиентаДУ
		|	И ДоговорДУ.Пул = &Пул
		|	И ИСТИНА
		|	И ДоговорДУ.ДатаПолученияУведомленияОРасторженииДоговораДУ = ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("Период", КонецДня(ТекПериод));
	Запрос.УстановитьПараметр("Пул", Справочники.Пул.НайтиПоНаименованию("Розничное ДУ"));
	Запрос.УстановитьПараметр("ТипКлиентаДУ", Перечисления.ТипыКлиентовДУ.ФизическиеЛица);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Возврат ВыборкаДетальныеЗаписи.ВыгрузитьКолонку("ДоговорДУ");
		
КонецФункции

Функция ПроверкаУсловийДобавления(Выборка, СуммаТребования = Неопределено)
	
	Если СуммаТребования = Неопределено Тогда  
		 СуммаТребования = Выборка.СуммаТребования;
	КонецЕсли;	
	
	Если СравниватьСБрокерскимиСуммами = "БрокерскимСчетом" 
		И (Выборка.СуммаБрокерскийСчет >= Выборка.СуммаОбязательства И СуммаТребования > 0) 
		И ЗначениеЗаполнено(Выборка.ДокументБлокировки) Тогда 
		Возврат Истина;
	ИначеЕсли СравниватьСБрокерскимиСуммами = "РасчетнымСчетом" 
		И (Выборка.СуммаРасчетныйСчет >= Выборка.СуммаОбязательства И СуммаТребования = 0)
		И ЗначениеЗаполнено(Выборка.ДокументБлокировки) Тогда
		Возврат Истина;
	ИначеЕсли СравниватьСБрокерскимиСуммами = "УчитыватьОстаткиНаБрокерскомСчете" И (Выборка.СуммаБрокерскийСчет <= Выборка.СуммаОбязательства) Тогда
		Возврат Истина;
	ИначеЕсли СравниватьСБрокерскимиСуммами = "НеУчитыватьОстаткиНаБрокерскомСчете" Тогда
		Возврат Истина;
	КонецЕсли;         
	Возврат Ложь;     
	
КонецФункции

Процедура ЗаполнитьНачислениями(ВидДокумента, ОтборПосуммам = Ложь, Параметры = Неопределено) Экспорт
	
	ДокументыКВыгрузке.Очистить();
	
	Если Период = Дата(1,1,1) Тогда
		ТекПериод = ТекущаяДатаСеанса();
	Иначе
		ТекПериод = Период;
	КонецЕсли;
	
	МассивДоговоров = ДоговорыКЗаполнению(ТекПериод);
	
	Запрос = Новый Запрос();
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачДата", НачалоДня(ТекПериод));
	Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоДня(ТекПериод),-3));
    Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекПериод));
	Запрос.УстановитьПараметр("Период", КонецДня(ТекПериод));
	Запрос.УстановитьПараметр("ДоговорДУ", МассивДоговоров);
	Запрос.УстановитьПараметр("НачислениеНДФЛ", ?(ВидДокумента = "НачислениеЗадолженности", Истина,Ложь));
	Запрос.УстановитьПараметр("НачислениеВознаграждения", ?(ВидДокумента = "НачислениеВознаграждения", Истина,Ложь));
    Запрос.УстановитьПараметр("НалоговыйПериод", НалоговыйПериод);

	Запрос.Текст = ПолучитьТекстЗапроса();
	
	ПакетРезультатов = Запрос.Выполнить();
	
	ВыборкаРезультат = ПакетРезультатов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ДатаОснования");
	
	Пока ВыборкаРезультат.Следующий() Цикл 
				
		//Если ВыборкаРезультат.СуммаТребования > 0 Тогда    
			
		СуммаТребования = ВыборкаРезультат.СуммаТребования;
		
		//Если СуммаТребования <= 0 Тогда
		//	Продолжить;
		//КонецЕсли;
		
		Выборка = ВыборкаРезультат.Выбрать();
		
		Пока Выборка.Следующий() Цикл  
			
			Если Выборка.СуммаОбязательства = 0  Тогда
				Продолжить
			КонецЕсли;
			
			Если ОтборПосуммам Тогда
				
				Если ПроверкаУсловийДобавления(Выборка,СуммаТребования) Тогда  
					НоваяСтрока = ДокументыКВыгрузке.Добавить(); 
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка); 
					НоваяСтрока.СуммаБлокировки = Выборка.СуммаОбязательства;  
					НоваяСтрока.СуммаТребования = СуммаТребования;
				КонецЕсли;						
			Иначе
				НоваяСтрока = ДокументыКВыгрузке.Добавить(); 
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка); 	
			КонецЕсли;  
			
		КонецЦикла;
		//КонецЕсли;
	КонецЦикла;

КонецПроцедуры     

Функция УстановитьНастройки(ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрыВыполненияКоманды) <> Тип("Структура") тогда возврат "<Настройки не установлены>"; КонецЕсли;
	
	НастройкиВыполнения = ПараметрыВыполненияКоманды.ПараметрыДополнительнойОбработки;
	Если ТипЗнч(НастройкиВыполнения) <> Тип("Структура") Тогда возврат "<Настройки не установлены>"; КонецЕсли;
	
	ЗначенияНастроек = НастройкиВыполнения;
	
	ПредставлениеНастроек = "";
	
	УстановитьПользовательскиеНастройки(ЗначенияНастроек, ПредставлениеНастроек);
	
	Возврат ПредставлениеНастроек;
	
КонецФункции

Процедура УстановитьПользовательскиеНастройки(Настройки, ПредставлениеНастроек="") Экспорт
	
	Если ЗначениеЗаполнено(Настройки) Тогда 
		Если Настройки.Свойство("Значения") Тогда
			Если Не Настройки.Значения = Неопределено Тогда
				СтатьяЗатрат 		= Настройки.Значения.СтатьяЗатрат;
				СтатьяДДС 			= Настройки.Значения.СтатьяДДС;
				СчетРасчетов 		= Настройки.Значения.СчетРасчетов;
				НастрройкиНДФЛ 		= Настройки.Значения.НастрройкиНДФЛ; 
				НастройкиВУК 		= Настройки.Значения.НастройкиВУК; 
				Шаблоны 			= Настройки.Значения.Шаблоны; 
				НазначениеПлатежа 	= Настройки.Значения.НазначениеПлатежа;
				ПочтовыйЛогин 		= Настройки.Значения.ПочтовыйЛогин;
				СтатьяЗатратСписание= Настройки.Значения.СтатьяЗатратСписание; 
				СтатьяДДССписание 	= Настройки.Значения.СтатьяДДССписание;
				СчетРасчетовСписание= Настройки.Значения.СчетРасчетовСписание; 
				
				СтатьяЗатратСписаниеЗадолженность= Настройки.Значения.СтатьяЗатратСписаниеНДФЛ; 
				СтатьяДДССписаниеЗадолженность 	 = Настройки.Значения.СтатьяДДССписаниеНДФЛ;

				СписокРассылки.Загрузить(XMLЗначение(Тип("ХранилищеЗначения"),Настройки.Значения.СписокРассылки).Получить()); 
			КонецЕсли;
		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНазначениеПлатежа() 
	
	//ШаблонПлатежногоПоручения = Справочники.ШаблоныПлатежныхПоручений.ПолучитьШаблонПоПараметрам(ДокОснование, Объект.ДоговорДУ, Объект.СчетДоговораДУ, Объект.Контрагент);
	//Если ЗначениеЗаполнено(ШаблонПлатежногоПоручения) Тогда
	//	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	//	ТекущийОбъект.ЗаполнитьНазначениеПлатежа(ШаблонПлатежногоПоручения);
	//	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	//КонецЕсли;

КонецПроцедуры	

Функция ПолучитьТекстЗапроса()
	
	ТекстЗапроса = 
	
	"ВЫБРАТЬ
	|	АналитическиеСчета.ДоговорДУ КАК ДоговорДУ,
	|	АналитическиеСчета.Ссылка КАК АналитическийСчетИсточник,
	|	0 КАК АналитическийСчетПриемник,
	|	БанковскиеСчета.Ссылка КАК БанковскийСчет,
	|	АналитическиеСчета.ДоговорКонтрагента КАК ДоговорИсточник,
	|	0 КАК ДоговорПриемник
	|ПОМЕСТИТЬ Вт_АналитическиеСчета
	|ИЗ
	|	Справочник.АналитическиеСчета КАК АналитическиеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО АналитическиеСчета.МестоХранения = БанковскиеСчета.Ссылка
	|ГДЕ
	|	АналитическиеСчета.ДоговорДУ В(&ДоговорДУ)
	|	И БанковскиеСчета.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Брокерский)
	|	И БанковскиеСчета.ТранзитныйСчет = ЛОЖЬ
	|	И (БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ БанковскиеСчета.ДатаЗакрытия <> ДАТАВРЕМЯ(1, 1, 1)
	|				И БанковскиеСчета.ДатаЗакрытия >= &НачалоПериода)
	|	И АналитическиеСчета.ОткрытНаБирже
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АналитическиеСчета.ДоговорДУ,
	|	0,
	|	АналитическиеСчета.Ссылка,
	|	БанковскиеСчета.Ссылка,
	|	0,
	|	АналитическиеСчета.ДоговорКонтрагента
	|ИЗ
	|	Справочник.АналитическиеСчета КАК АналитическиеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО АналитическиеСчета.МестоХранения = БанковскиеСчета.Ссылка
	|ГДЕ
	|	АналитическиеСчета.ДоговорДУ В(&ДоговорДУ)
	|	И БанковскиеСчета.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Расчетный)
	|	И БанковскиеСчета.ТранзитныйСчет = ЛОЖЬ
	|	И (БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ БанковскиеСчета.ДатаЗакрытия <> ДАТАВРЕМЯ(1, 1, 1)
	|				И БанковскиеСчета.ДатаЗакрытия >= &НачалоПериода)
	|	И НЕ АналитическиеСчета.ОткрытНаБирже
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_АналитическиеСчета.ДоговорДУ КАК ДоговорДУ,
	|	МАКСИМУМ(Вт_АналитическиеСчета.АналитическийСчетИсточник) КАК АналитическийСчетИсточник,
	|	МАКСИМУМ(Вт_АналитическиеСчета.АналитическийСчетПриемник) КАК АналитическийСчетПриемник,
	|	МАКСИМУМ(Вт_АналитическиеСчета.ДоговорПриемник) КАК ДоговорПриемник,
	|	МАКСИМУМ(Вт_АналитическиеСчета.ДоговорИсточник) КАК ДоговорИсточник
	|ПОМЕСТИТЬ ВТ_АналитическиеСчетаГруппировка
	|ИЗ
	|	Вт_АналитическиеСчета КАК Вт_АналитическиеСчета
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт_АналитическиеСчета.ДоговорДУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияСтатусовОбъектовСрезПоследних.Объект КАК Объект
	|ПОМЕСТИТЬ ВТ_НовыйВознаграждения
	|ИЗ
	|	РегистрСведений.ИсторияСтатусовОбъектов.СрезПоследних(
	|			&КонецПериода,
	|			ЕСТЬNULL(Статус, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектов.Новый)
	|				И ТИПЗНАЧЕНИЯ(Объект) = ТИП(Документ.НачислениеВознаграждения)
	|				И ВЫБОР
	|					КОГДА НЕ &НачислениеНДФЛ = ИСТИНА
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|				И ВЫРАЗИТЬ(Объект КАК Документ.НачислениеВознаграждения).ДоговорДУ В (&ДоговорДУ)) КАК ИсторияСтатусовОбъектовСрезПоследних
	|ГДЕ
	|	ИсторияСтатусовОбъектовСрезПоследних.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсторияСтатусовОбъектовСрезПоследних.Объект
	|ИЗ
	|	РегистрСведений.ИсторияСтатусовОбъектов.СрезПоследних(
	|			&КонецПериода,
	|			ЕСТЬNULL(Статус, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектов.Новый)
	|				И ТИПЗНАЧЕНИЯ(Объект) = ТИП(Документ.НачислениеЗадолженности)
	|				И ВЫБОР
	|					КОГДА &НачислениеНДФЛ = ИСТИНА
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|				И Объект.НалоговыйПериод = &НалоговыйПериод
	|				И ВЫРАЗИТЬ(Объект КАК Документ.НачислениеЗадолженности).ДоговорДУ В (&ДоговорДУ)) КАК ИсторияСтатусовОбъектовСрезПоследних
	|ГДЕ
	|	ИсторияСтатусовОбъектовСрезПоследних.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПлановаяПозиция.МестоХранения КАК МестоХранения,
	|	ВтПлановаяПозиция.РублевыйЭквивалент КАК РублевыйЭквивалент,
	|	ЕСТЬNULL(ВтПлановаяПозиция.Остаток, 0) КАК Остаток,
	|	ВтПлановаяПозиция.РублевыйЭквивалентПлан КАК РублевыйЭквивалентПлан,
	|	ВтПлановаяПозиция.ПлановаяПозицияДС КАК ПлановаяПозицияДС,
	|	ВтПлановаяПозиция.Инструмент КАК Инструмент,
	|	ВтПлановаяПозиция.ДоговорДУ КАК ДоговорДУ,
	|	ЕСТЬNULL(ВтПлановаяПозиция.СуммаРасчетныйСчет, 0) КАК СуммаРасчетныйСчет,
	|	ЕСТЬNULL(ВтПлановаяПозиция.СуммаБрокерскийСчет, 0) КАК СуммаБрокерскийСчет,
	|	ЕСТЬNULL(ВтОбязательства.СуммаОбязательства, 0) КАК СуммаОбязательства,
	|	ВтОбязательства.ВидДокументаОснования КАК ВидДокументаОснования,
	|	ВтОбязательства.Основание КАК Основание,
	|	ВтОбязательства.Контрагент КАК Контрагент,
	|	ВтОбязательства.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВтОбязательства.СтавкаНДФЛ КАК СтавкаНДФЛ,
	|	ВтОбязательства.СчетКонтрагента КАК СчетКонтрагента,
	|	ВтОбязательства.НалоговыйПериод КАК НалоговыйПериод,
	|	ВтОбязательства.ДатаОснования КАК ДатаОснования,
	|	ЕСТЬNULL(ВтПлановаяПозиция.СуммаТребования, 0) КАК СуммаТребования
	|ПОМЕСТИТЬ втСекция2
	|ИЗ
	|	(ВЫБРАТЬ
	|		ХозрасчетныйОстаткиИОбороты.ДоговорДУ КАК ДоговорДУ,
	|		ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток * -1 КАК СуммаОбязательства,
	|		""Начисление НДФЛ"" КАК ВидДокументаОснования,
	|		ХозрасчетныйОстаткиИОбороты.Регистратор КАК Основание,
	|		ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Регистратор КАК Документ.НачислениеЗадолженности).ДоговорКонтрагента КАК ДоговорКонтрагента,
	|		ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Регистратор КАК Документ.НачислениеЗадолженности).Контрагент КАК Контрагент,
	|		ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Регистратор КАК Документ.НачислениеЗадолженности).СтавкаНДФЛ КАК СтавкаНДФЛ,
	|		ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Регистратор КАК Документ.НачислениеЗадолженности).СчетКонтрагента КАК СчетКонтрагента,
	|		ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Регистратор КАК Документ.НачислениеЗадолженности).НалоговыйПериод КАК НалоговыйПериод,
	|		ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Регистратор КАК Документ.НачислениеЗадолженности).Дата КАК ДатаОснования
	|	ИЗ
	|		ВТ_НовыйВознаграждения КАК ВТ_НовыйВознаграждения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДФЛ), , ДоговорДУ В (&ДоговорДУ)) КАК ХозрасчетныйОстаткиИОбороты
	|			ПО ВТ_НовыйВознаграждения.Объект = ХозрасчетныйОстаткиИОбороты.Регистратор
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА &НачислениеНДФЛ = ИСТИНА
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|		И ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Регистратор) = ТИП(Документ.НачислениеЗадолженности)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ХозрасчетныйОстаткиИОбороты.ДоговорДУ,
	|		ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток * -1,
	|		""Начисление Вознаграждения"",
	|		ХозрасчетныйОстаткиИОбороты.Регистратор,
	|		ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Регистратор КАК Документ.НачислениеВознаграждения).ДоговорКонтрагента,
	|		ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Регистратор КАК Документ.НачислениеВознаграждения).Контрагент,
	|		0,
	|		ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Регистратор КАК Документ.НачислениеВознаграждения).СчетКонтрагента,
	|		0,
	|		ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Регистратор КАК Документ.НачислениеВознаграждения).Дата
	|	ИЗ
	|		ВТ_НовыйВознаграждения КАК ВТ_НовыйВознаграждения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетВознаграждениеУКЗаУправление), , ДоговорДУ В (&ДоговорДУ)) КАК ХозрасчетныйОстаткиИОбороты
	|			ПО ВТ_НовыйВознаграждения.Объект = ХозрасчетныйОстаткиИОбороты.Регистратор
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА НЕ &НачислениеНДФЛ = ИСТИНА
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|		И ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Регистратор) = ТИП(Документ.НачислениеВознаграждения)) КАК ВтОбязательства
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			т.АналитическийСчет КАК МестоХранения,
	|			0 КАК РублевыйЭквивалент,
	|			0 КАК Остаток,
	|			0 КАК РублевыйЭквивалентПлан,
	|			0 КАК ПлановаяПозицияДС,
	|			т.Валюта КАК Инструмент,
	|			т.ДоговорДУ КАК ДоговорДУ,
	|			ВЫБОР
	|				КОГДА НЕ т.АналитическийСчет.ОткрытНаБирже
	|					ТОГДА т.ВалютнаяСуммаОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК СуммаРасчетныйСчет,
	|			ВЫБОР
	|				КОГДА т.АналитическийСчет.ОткрытНаБирже
	|					ТОГДА т.ВалютнаяСуммаОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК СуммаБрокерскийСчет,
	|			0 КАК СуммаТребования
	|		ИЗ
	|			РегистрНакопления.ДенежныеСредстваУправленческий.Остатки(&КонецПериода, ДоговорДУ В (&ДоговорДУ)) КАК т
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|						&КонецПериода,
	|						БазоваяВалюта = ЗНАЧЕНИЕ(Справочник.Валюты.RUB)
	|							И ИнформационнаяПлощадка = ЗНАЧЕНИЕ(Справочник.ИнформационныеПлощадки.ЦБРФ)) КАК Курсы
	|				ПО т.Валюта = Курсы.Валюта
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			т.АналитическийСчет,
	|			0,
	|			0,
	|			0,
	|			0,
	|			т.Валюта,
	|			т.ДоговорДУ,
	|			0,
	|			0,
	|			т.ВалютнаяСуммаОстаток
	|		ИЗ
	|			РегистрНакопления.ТребованияПоДС.Остатки(&НачДата, ДоговорДУ В (&ДоговорДУ)) КАК т
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|						&КонецПериода,
	|						БазоваяВалюта = ЗНАЧЕНИЕ(Справочник.Валюты.RUB)
	|							И ИнформационнаяПлощадка = ЗНАЧЕНИЕ(Справочник.ИнформационныеПлощадки.ЦБРФ)) КАК Курсы
	|				ПО т.Валюта = Курсы.Валюта) КАК ВтПлановаяПозиция
	|		ПО ВтОбязательства.ДоговорДУ = ВтПлановаяПозиция.ДоговорДУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(втСекция2.РублевыйЭквивалент) КАК РублевыйЭквивалент,
	|	СУММА(втСекция2.Остаток) КАК Остаток,
	|	СУММА(втСекция2.РублевыйЭквивалентПлан) КАК РублевыйЭквивалентПлан,
	|	СУММА(втСекция2.ПлановаяПозицияДС) КАК ПлановаяПозицияДС,
	|	втСекция2.ДоговорДУ КАК ДоговорДУ,
	|	СУММА(втСекция2.СуммаРасчетныйСчет) КАК СуммаРасчетныйСчет,
	|	СУММА(втСекция2.СуммаБрокерскийСчет) КАК СуммаБрокерскийСчет,
	|	МАКСИМУМ(втСекция2.СуммаОбязательства) КАК СуммаОбязательства,
	|	втСекция2.ВидДокументаОснования КАК ВидДокументаОснования,
	|	втСекция2.Основание КАК Основание,
	|	втСекция2.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	втСекция2.Контрагент КАК Контрагент,
	|	втСекция2.СтавкаНДФЛ КАК СтавкаНДФЛ,
	|	втСекция2.СчетКонтрагента КАК СчетКонтрагента,
	|	втСекция2.НалоговыйПериод КАК НалоговыйПериод,
	|	втСекция2.ДатаОснования КАК ДатаОснования,
	|	СУММА(втСекция2.СуммаТребования) КАК СуммаТребования
	|ПОМЕСТИТЬ ВТ_Обязательства
	|ИЗ
	|	втСекция2 КАК втСекция2
	|ГДЕ
	|	НЕ втСекция2.МестоХранения.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	втСекция2.Основание,
	|	втСекция2.ДоговорДУ,
	|	втСекция2.ВидДокументаОснования,
	|	втСекция2.ДоговорКонтрагента,
	|	втСекция2.Контрагент,
	|	втСекция2.СтавкаНДФЛ,
	|	втСекция2.СчетКонтрагента,
	|	втСекция2.НалоговыйПериод,
	|	втСекция2.ДатаОснования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Поручение.Ссылка) КАК Поручение,
	|	Поручение.АналитическийСчетИсточник КАК АналитическийСчетИсточник,
	|	Поручение.ДоговорДУ КАК ДоговорДУ,
	|	Поручение.АналитическийСчетПриемник КАК АналитическийСчетПриемник
	|ПОМЕСТИТЬ ВТ_Поручения
	|ИЗ
	|	ВТ_Обязательства КАК ВТ_Обязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручение
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АналитическиеСчетаГруппировка КАК ВТ_АналитическиеСчетаГруппировка
	|			ПО Поручение.ДоговорДУ = ВТ_АналитическиеСчетаГруппировка.ДоговорДУ
	|				И Поручение.АналитическийСчетИсточник = ВТ_АналитическиеСчетаГруппировка.АналитическийСчетИсточник
	|				И Поручение.АналитическийСчетПриемник = ВТ_АналитическиеСчетаГруппировка.АналитическийСчетПриемник
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСтатусовОбъектов.СрезПоследних(&КонецПериода, ) КАК ИсторияСтатусовОбъектовСрезПоследних
	|			ПО Поручение.Ссылка = ИсторияСтатусовОбъектовСрезПоследних.Объект
	|		ПО ВТ_Обязательства.ДоговорДУ = Поручение.ДоговорДУ
	|			И (Поручение.Дата МЕЖДУ ВТ_Обязательства.ДатаОснования И &КонецПериода)
	|ГДЕ
	|	НЕ Поручение.ПометкаУдаления
	|	И ЕСТЬNULL(ИсторияСтатусовОбъектовСрезПоследних.Статус, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектов.Отменен)
	|	И ВЫБОР
	|			КОГДА &НачислениеНДФЛ = ИСТИНА
	|					И Поручение.Комментарий = ""Оплата НДФЛ""
	|				ТОГДА ИСТИНА
	|			КОГДА НЕ &НачислениеНДФЛ = ИСТИНА
	|					И Поручение.Комментарий = ""Оплата ВУК""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	Поручение.АналитическийСчетИсточник,
	|	Поручение.ДоговорДУ,
	|	Поручение.АналитическийСчетПриемник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(БлокировкаРазблокировкаДС.Ссылка) КАК ДокументБлокировки,
	|	БлокировкаРазблокировкаДС.ДоговорДУ КАК ДоговорДУ,
	|	БлокировкаРазблокировкаДС.АналитическийСчет КАК АналитическийСчет,
	|	БлокировкаРазблокировкаДС.Основание КАК БлокировкаОснование
	|ПОМЕСТИТЬ ВТ_БлокировкаДС
	|ИЗ
	|	ВТ_Обязательства КАК ВТ_Обязательства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.БлокировкаРазблокировкаДС КАК БлокировкаРазблокировкаДС
	|		ПО ВТ_Обязательства.Основание = БлокировкаРазблокировкаДС.Основание
	|ГДЕ
	|	НЕ БлокировкаРазблокировкаДС.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	БлокировкаРазблокировкаДС.ДоговорДУ,
	|	БлокировкаРазблокировкаДС.АналитическийСчет,
	|	БлокировкаРазблокировкаДС.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Поручения.Поручение КАК Поручение,
	|	СписаниеСРасчетногоСчета.Ссылка КАК СписаниеСРасчетногоСчета,
	|	НЕОПРЕДЕЛЕНО КАК ПоступлениеНаРасчетныйСчет
	|ПОМЕСТИТЬ ВТ_ПоступлениеСписание
	|ИЗ
	|	ВТ_Поручения КАК ВТ_Поручения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	|		ПО ВТ_Поручения.Поручение = СписаниеСРасчетногоСчета.ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Поручения.Поручение,
	|	НЕОПРЕДЕЛЕНО,
	|	ПоступлениеНаРасчетныйСчет.Ссылка
	|ИЗ
	|	ВТ_Поручения КАК ВТ_Поручения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|		ПО ВТ_Поручения.Поручение = ПоступлениеНаРасчетныйСчет.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоступлениеСписание.Поручение КАК Поручение,
	|	МАКСИМУМ(ВТ_ПоступлениеСписание.СписаниеСРасчетногоСчета) КАК СписаниеСРасчетногоСчета,
	|	МАКСИМУМ(ВТ_ПоступлениеСписание.ПоступлениеНаРасчетныйСчет) КАК ПоступлениеНаРасчетныйСчет
	|ПОМЕСТИТЬ ВТ_ГруппировкаДоки
	|ИЗ
	|	ВТ_ПоступлениеСписание КАК ВТ_ПоступлениеСписание
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоступлениеСписание.Поручение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обязательства.РублевыйЭквивалент КАК РублевыйЭквивалент,
	|	ВТ_Обязательства.Остаток КАК Остаток,
	|	ВТ_Обязательства.РублевыйЭквивалентПлан КАК РублевыйЭквивалентПлан,
	|	ВТ_Обязательства.ПлановаяПозицияДС КАК ПлановаяПозицияДС,
	|	ВТ_Обязательства.ДоговорДУ КАК ДоговорДУ,
	|	ВТ_Обязательства.СуммаРасчетныйСчет КАК СуммаРасчетныйСчет,
	|	ВТ_Обязательства.СуммаБрокерскийСчет КАК СуммаБрокерскийСчет,
	|	ВТ_Обязательства.СуммаОбязательства КАК СуммаОбязательства,
	|	ВТ_Обязательства.ВидДокументаОснования КАК ВидДокументаОснования,
	|	ВТ_Обязательства.Основание КАК Основание,
	|	ВТ_АналитическиеСчетаГруппировка.АналитическийСчетПриемник КАК АналитическийСчетПриемник,
	|	ВТ_АналитическиеСчетаГруппировка.АналитическийСчетИсточник КАК АналитическийСчетИсточник,
	|	ВТ_Поручения.Поручение КАК ПорученияВМидл,
	|	ВТ_ГруппировкаДоки.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета,
	|	ВТ_ГруппировкаДоки.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет,
	|	ВТ_АналитическиеСчетаГруппировка.ДоговорПриемник КАК ДоговорПриемник,
	|	ВТ_АналитическиеСчетаГруппировка.ДоговорИсточник КАК ДоговорИсточник,
	|	ВТ_Обязательства.ДоговорДУ.УправляющаяКомпания КАК УправляющаяКомпания,
	|	ВТ_Обязательства.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_Обязательства.Контрагент КАК КонтрагентОснование,
	|	ВТ_Обязательства.ДоговорДУ.Префикс КАК ДоговорДУПрефикс,
	|	ВТ_Обязательства.СтавкаНДФЛ КАК СтавкаНДФЛ,
	|	ВТ_Обязательства.СчетКонтрагента КАК СчетКонтрагента,
	|	ВТ_Обязательства.НалоговыйПериод КАК НалоговыйПериод,
	|	ВТ_АналитическиеСчетаГруппировка.АналитическийСчетПриемник.МестоХранения КАК БанковскийСчет,
	|	ВТ_Обязательства.Контрагент КАК Контрагент,
	|	ВТ_АналитическиеСчетаГруппировка.АналитическийСчетИсточник.СубъектМестаХранения КАК КонтрагентПоступление,
	|	ВТ_БлокировкаДС.ДокументБлокировки КАК ДокументБлокировки,
	|	ВТ_Обязательства.СуммаТребования КАК СуммаТребования,
	|	ВТ_Обязательства.ДоговорДУ.ДатаНачала КАК ДатаЗаключения,
	|	ВТ_Обязательства.ДатаОснования КАК ДатаОснования
	|ИЗ
	|	ВТ_Обязательства КАК ВТ_Обязательства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АналитическиеСчетаГруппировка КАК ВТ_АналитическиеСчетаГруппировка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поручения КАК ВТ_Поручения
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГруппировкаДоки КАК ВТ_ГруппировкаДоки
	|				ПО ВТ_Поручения.Поручение = ВТ_ГруппировкаДоки.Поручение
	|			ПО ВТ_АналитическиеСчетаГруппировка.ДоговорДУ = ВТ_Поручения.ДоговорДУ
	|				И ВТ_АналитическиеСчетаГруппировка.АналитическийСчетИсточник = ВТ_Поручения.АналитическийСчетИсточник
	|				И ВТ_АналитическиеСчетаГруппировка.АналитическийСчетПриемник = ВТ_Поручения.АналитическийСчетПриемник
	|		ПО ВТ_Обязательства.ДоговорДУ = ВТ_АналитическиеСчетаГруппировка.ДоговорДУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БлокировкаДС КАК ВТ_БлокировкаДС
	|		ПО ВТ_Обязательства.Основание = ВТ_БлокировкаДС.БлокировкаОснование
	|ГДЕ
	|	ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорДУ
	|ИТОГИ
	|	СУММА(СуммаТребования)
	|ПО
	|	ДатаОснования";
	

	Возврат ТекстЗапроса;
КонецФункции

Функция ПолучитьЗначенияДопСвойств(Объект)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   ДополнительныеСведения.Свойство,
	|   ЕСТЬNULL(ДополнительныеСведения.Значение, """") КАК Значение
	|ИЗ
	|   РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|   ДополнительныеСведения.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Объект);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьРазмерВознаграждения(ДоговорДУ, Дата, Базис, ЗначениеПараметраДоговораДУ = Неопределено)
    
    СоотВознаграждений = Новый Соответствие;
    
    ФиксСумма = Ложь;
	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияДУ.ВалютаРеглУчета(ДоговорДУ);
    КурсКратностьРегл = МодульВалютногоУчета.ПолучитьКурсВалютыПоПортфелю(ДоговорДУ, ВалютаРегламентированногоУчета, Дата);
    
    МассивПараметровДоговораДУ = Новый Массив;
    МассивПараметровДоговораДУ.Добавить(ПланыВидовХарактеристик.ПараметрыДоговораДУ.ВеличинаВознагражденияУК);
    
    Для каждого СтрокаМассива из МассивПараметровДоговораДУ Цикл
        СоотВознаграждений.Вставить(СтрокаМассива, 0);
    КонецЦикла;
    
    Для каждого СтрокаМассива из МассивПараметровДоговораДУ Цикл
        Если ЗначениеПараметраДоговораДУ = Неопределено Тогда
            Значение = УправлениеПараметрамиДоговораДУ.ПолучитьПараметрДоговораДУ(ДоговорДУ, СтрокаМассива, Дата);
        Иначе
            Значение = ЗначениеПараметраДоговораДУ;
        КонецЕсли;
        
        // может у нас от старых доков просто число пришло
        Если ТипЗнч(Значение) = Тип("Число") Тогда
            СоотВознаграждений.Вставить(СтрокаМассива,Число(Значение));
            Продолжить;
        КонецЕсли;
        
        МассивИзСтрокЛесенки = УправлениеПараметрамиДоговораДУ.РазобратьЗначениеВознаграждения(Значение);
        
        Для каждого СтрокаЛесенки из МассивИзСтрокЛесенки Цикл
            
            Добавляем = Ложь;
            Прерываем = Ложь;
            
            Если СтрокаЛесенки.ТипСравнения = "<" Тогда
                Если Базис < СтрокаЛесенки.Значение Тогда
                    Добавляем = Истина;
                    Прерываем = Истина;										
                КонецЕсли;
            ИначеЕсли СтрокаЛесенки.ТипСравнения = ">=" Тогда
                Если Базис >= СтрокаЛесенки.Значение Тогда
                    Добавляем = Истина;
                    Прерываем = Ложь;		
                КонецЕсли;
            Иначе
                Если Базис > СтрокаЛесенки.Значение Тогда
                    Добавляем = Истина;
                    Прерываем = Ложь;		
                КонецЕсли;
            КонецЕсли;
            
            Если Добавляем Тогда
                Если СтрокаЛесенки.Суммой Тогда
                    
                    Если СтрокаЛесенки.Свойство("Валюта") и СтрокаЛесенки.Валюта <> Справочники.Валюты.RUB Тогда
                        КурсКратность = МодульВалютногоУчета.ПолучитьКурсВалютыПоПортфелю(ДоговорДУ, СтрокаЛесенки.Валюта, Дата);
                        
                        СуммаВознаграждения = Окр(МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаЛесенки.РазмерВознаграждения,
                        СтрокаЛесенки.Валюта, Справочники.Валюты.RUB, 
                        КурсКратность.Курс, КурсКратностьРегл.Курс,
                        КурсКратность.Кратность, КурсКратностьРегл.Кратность), 2);
                    Иначе
                        СуммаВознаграждения = СтрокаЛесенки.РазмерВознаграждения;
                    КонецЕсли;
                    
                    СоотВознаграждений.Вставить(СтрокаМассива, Новый Структура("РазмерВознаграждения",СуммаВознаграждения));
                    
                Иначе
                    СоотВознаграждений.Вставить(СтрокаМассива, СтрокаЛесенки.РазмерВознаграждения);
                КонецЕсли;
            КонецЕсли;
            
            Если Прерываем Тогда
                Прервать;
            КонецЕсли;
            
        КонецЦикла;
        
    КонецЦикла;
    
    Возврат СоотВознаграждений;
    
КонецФункции 

Процедура СформироватьИОтправитьПисьмо(ВидРассылки = "Перевод", ОписаниеОшибки, ПутьКФайлу = "") Экспорт
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое выполнение оплаты КЗ по клиентам НДФЛ'"),
		 	УровеньЖурналаРегистрации.Информация,
			Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
			Метаданные().Имя,
			"Начато выполнение фонового задания НДФЛ Шаг 3.3");

	ТаблицаСтрок = ДанныеДляРассылки(ВидРассылки);
	Если ТаблицаСтрок.Количество() = 0 Тогда
		ОписаниеОшибки = ОписаниеОшибки + " Рассылка - " + ВидРассылки + ": не найдены данные для рассылки";
		Возврат;
	КонецЕсли;

	ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста, Важность, Вложения");
	
	Макет = "ШаблонРассылки";
	ПараметрИтог = "СуммаИтого";
    КолонкаИтог  = "СуммаПоручения";
	ПериодФормат = Формат(Период,"ДФ=dd.MM.yyyy");
	
	Если ВидРассылки = "Перевод" Тогда
		ТемаПисьма = "Перевод с брокерского счета.Розничное ДУ";
	ИначеЕсли ВидРассылки = "Блокировка" Тогда
		Если ВидДокументаОснования = "НачислениеЗадолженности" Тогда
			ТемаПисьма = СтрШаблон("Коллеги, %1 произведена блокировка ДС по брокерским счетам договоров РДУ для оплаты вознаграждения НДФЛ",ПериодФормат);
		Иначе 
			ТемаПисьма = СтрШаблон("Коллеги, %1 произведена блокировка ДС по брокерским счетам договоров РДУ для оплаты вознаграждения УК");
		КонецЕсли;   
	Иначе	
		Если ВидДокументаОснования = "НачислениеЗадолженности" Тогда
			ТемаПисьма = СтрШаблон("Начисление НДФЛ Шаблон %1 от .",ПериодФормат);
		Иначе 
			ТемаПисьма = СтрШаблон("Оплата вознаграждения договоров розничного ДУ на собственный счет УК");
		КонецЕсли;   
	КонецЕсли;
	
	НомерРассылки = "0";
	
	ТелоПисьма = "";
	Вложения = Новый Структура;
	ФайлыКУдалению = Новый Массив;

	Если ТаблицаСтрок.Количество() > 0 И ВидРассылки = "Перевод" Тогда
		ТелоПисьма = СтрШаблон("Прошу подать поручение на перевод с брокерского счета 13W6XW на расчетный счет сумму в размере %1 рублей.", СуммаОбязательства);
	ИначеЕсли  ВидРассылки = "Блокировка" Тогда
		Если ВидДокументаОснования = "НачислениеЗадолженности" Тогда
			ТелоПисьма = СтрШаблон("Коллеги, %1 произведена блокировка ДС по брокерским счетам договоров РДУ для оплаты вознаграждения НДФЛ",ПериодФормат);
		Иначе 
			ТелоПисьма = СтрШаблон("Коллеги, %1 произведена блокировка ДС по брокерским счетам договоров РДУ для оплаты вознаграждения УК");
		КонецЕсли;   	
	Иначе
		
		Если ВидДокументаОснования = "НачислениеЗадолженности" Тогда
			ТелоПисьма = СтрШаблон("Прошу сформировать платежное поручение следующего образца для оплаты единого налогового платежа розничного ДУ на сумму %1 руб.", СуммаОбязательства);
		Иначе 
			ТелоПисьма = СтрШаблон("Прошу сформировать платежное поручение следующего образца для оплаты вознаграждения розничного ДУ на собственный счет УК на сумму %1 руб.", СуммаОбязательства);	 
		КонецЕсли;
		Вложения.Вставить("Отчет", ПутьКФайлу);
		ФайлыКУдалению.Добавить(ПутьКФайлу); 
	КонецЕсли;
	
	Задержка(10);

	ПараметрыПисьма.Вложения = Вложения;
	
	Кому = Новый Массив;
	ОтборКонтактов = ОтборКонтактов(ВидРассылки);
	Для каждого ТекЯщик из СписокРассылки Цикл
		Если ТекЯщик.Мидлофис И ТекЯщик.Отправлять И (ВидРассылки = "Перевод" ИЛИ ВидРассылки = "Блокировка") Тогда
			Кому.Добавить(Новый Структура("Адрес, Представление", ТекЯщик.ПочтовыйЯщик, ТекЯщик.Представление)); 
		ИначеЕсли ТекЯщик.Сеттелмент И НЕ ВидРассылки = "Перевод" И ТекЯщик.Отправлять Тогда 	
			Кому.Добавить(Новый Структура("Адрес, Представление", ТекЯщик.ПочтовыйЯщик, ТекЯщик.Представление)); 
		КонецЕсли;
	КонецЦикла;
	
	ФлагРезультатаВТеме = "{OK} ";
	
	ПараметрыПисьма.Кому = Кому;
	ПараметрыПисьма.Тема = ФлагРезультатаВТеме + " Аванкор ДУ: "+ ТемаПисьма + ПропискаРассылки(НомерРассылки);
	ПараметрыПисьма.Важность = ВажностьИнтернетПочтовогоСообщения.Обычная;
	ПараметрыПисьма.Тело = ТелоПисьма;
	ПараметрыПисьма.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
	
	Задержка(10);
	
	Попытка 
		РаботаСПочтовымиСообщениями.ОтправитьСообщение(ПочтовыйЛогин, ПараметрыПисьма);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое выполнение оплаты КЗ по клиентам НДФЛ'"),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
		Метаданные().Имя,
		"Ошибка отправки писем");
	КонецПопытки; 
	
	Если НЕ ВидРассылки = "Перевод" Тогда
		РассылкаОтправлена = Истина;
	КонецЕсли;  
	
	Для каждого ФайлКУдалению Из ФайлыКУдалению Цикл
		УдалитьФайлы(ФайлКУдалению);
	КонецЦикла;

КонецПроцедуры

Функция ДанныеДляРассылки(ВидРассылки)

	ДанныеДляРассылки = Новый ТаблицаЗначений;
	ДанныеДляРассылки.Колонки.Добавить("ДоговорДУ");
	ДанныеДляРассылки.Колонки.Добавить("СуммаПоручения");
	ДанныеДляРассылки.Колонки.Добавить("ПоручениеПоДС");
	
	Если ВидРассылки = "Перевод" И СуммаПоручений = 0 ИЛИ СуммаОбязательства = 0 Тогда 
		Возврат ДанныеДляРассылки;
	ИначеЕсли ВидРассылки = "Блокировка" И СуммаБлокировки = 0 Тогда
		Возврат ДанныеДляРассылки;
	КонецЕсли;
	
	ПоручениеДляРассылки = ДанныеДляРассылки.Добавить();
	ПоручениеДляРассылки.ДоговорДУ = ВидДокументаОснования;
	ПоручениеДляРассылки.ПоручениеПоДС 	= СуммаПоручений;
	ПоручениеДляРассылки.СуммаПоручения = СуммаПоручений;
	
	Возврат ДанныеДляРассылки;
	
КонецФункции

Функция ОтборКонтактов(ВидРассылки)

	ВидыРассылки = Новый Соответствие;
	ВидыРассылки.Вставить("ПереводСКомпенсацией", "Мидлофис");
	ВидыРассылки.Вставить("ПереводБезКомпенсации", "Мидлофис");
	ВидыРассылки.Вставить("Перевод", "Мидлофис");
	ВидыРассылки.Вставить("ВыводСКомпенсацией", "Сеттелмент");
	ВидыРассылки.Вставить("ВыводБезКомпенсации", "Сеттелмент");
	ВидыРассылки.Вставить("Вывод", "Сеттелмент");
	ВидыРассылки.Вставить("Ввод", "Сеттелмент");
	ВидыРассылки.Вставить("МатВыгода", "Финансы");
	ВидыРассылки.Вставить("Доход", "Финансы");
	
	Ключ = ВидыРассылки.Получить(ВидРассылки);
	ОтборКонтактов = Новый Структура(Ключ, Истина);
	
	Возврат ОтборКонтактов;

КонецФункции   

Функция ТелоПисьма(Заголовок, ТаблицаСтрок, ИмяМакета, КолонкаИтог, ПараметрИтог, ПутьКФайлуXLS)

	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет(ИмяМакета);
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	
	ОбластьШапка.Параметры.Заголовок = Заголовок;
	ТабДок.Вывести(ОбластьШапка);
	
	Для каждого СтрокаТаблицы Из ТаблицаСтрок Цикл
	
		ОбластьСтрока.Параметры.Заполнить(СтрокаТаблицы);
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ОбластьИтог.Параметры[ПараметрИтог] = ТаблицаСтрок.Итог(КолонкаИтог);
	ТабДок.Вывести(ОбластьИтог);
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла(".html");
	
	ТабДок.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.HTML);
	
	ТабДок.Записать(ПутьКФайлуXLS, ТипФайлаТабличногоДокумента.XLS);
	
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу);
	СтрHTML = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	УдалитьФайлы(ПутьКФайлу);
	
	Возврат СтрHTML;

КонецФункции

Функция ПропискаРассылки(Знач НомерРассылки) 
	Перем ПараметрыПодключения, ИмяИБ;
	
	Попытка
		ПараметрыПодключения = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПодключенияИзСтрокиСоединенияИнформационнойБазы(СтрокаСоединенияИнформационнойБазы());
		ИмяИБ = ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия;
	Исключение
	КонецПопытки;
	
	Прописка = " {" + НомерРассылки + ", ib: " + ?(ЗначениеЗаполнено(ИмяИБ), ИмяИБ, "< .. >") + "}";
	
	Возврат Прописка;
КонецФункции     

Процедура Пауза(Секунд) Экспорт 
	
	ПолноеИмяФайла = КаталогВременныхФайлов() + "sleep.vbs";
	Текст = Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку("wscript.sleep wscript.arguments(0)");
	Текст.Записать(ПолноеИмяФайла, КодировкаТекста.OEM);
	
	WshShell =  Новый ComОбъект("Wscript.Shell");
	WshShell.Run("Wscript.exe"""+ПолноеИмяФайла+""" "+Секунд*1000,0,1);
	
КонецПроцедуры

Функция СформироватьШаблон() Экспорт
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое выполнение оплаты КЗ по клиентам НДФЛ'"),
		 	УровеньЖурналаРегистрации.Информация,
			Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
			Метаданные().Имя,
			"Начато выполнение фонового задания НДФЛ Шаг 2.2");

	ТабДок = Новый ТабличныйДокумент;
	ПериодФормат = Формат(Период,"ДФ=dd.MM.yyyy");
	Если ВидДокументаОснования = "НачислениеЗадолженности" Тогда
		Шаблон = ПолучитьМакет("ШаблонНДФЛ");
		ТемаПисьма = СтрШаблон("Начисление НДФЛ Шаблон от %1 ",ПериодФормат);
	Иначе 
		Шаблон = ПолучитьМакет("ШаблонВУК");
		ТемаПисьма = СтрШаблон("Начисление ВУК Шаблон от %1 ",ПериодФормат);
	КонецЕсли;    
	
	ИмяФайла = КаталогВременныхФайлов() + ТемаПисьма + ".docx";
	//ИмяФайла = ПолучитьИмяВременногоФайла(".docx");
	Шаблон.Записать(ИмяФайла);	
	
	ОбъектВорд = Новый COMОбъект("Word.Application");  
	ОбъектВорд.Documents.add(ИмяФайла); 

	ДокументВорд = ОбъектВорд.Application.Documents(1);
	ДокументВорд.Activate();
	
	СуммаОбязательстваСтрокой = Строка(СуммаОбязательства);
	СуммаОбязательстваСтрокой = СтрЗаменить(СуммаОбязательстваСтрокой,",","-");

	Если СтрНайти(СуммаОбязательстваСтрокой,"-") = 0 Тогда
		СуммаОбязательстваСтрокой = СуммаОбязательстваСтрокой + "-00"; 
	Иначе 
		ДлинаСтроки 		= СтрДлина(СуммаОбязательстваСтрокой); 
		СимволРазделения 	= СтрНайти(СуммаОбязательстваСтрокой,"-");
		Если ДлинаСтроки - СимволРазделения = 1 Тогда
			СуммаОбязательстваСтрокой = СуммаОбязательстваСтрокой + "0";
		КонецЕсли;
	КонецЕсли;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПараметрСумма", ?(ВидДокументаОснования = "НачислениеЗадолженности",СуммаОбязательстваСтрокой,СуммаОбязательства));
	СтруктураПараметров.Вставить("ПараметрСуммы", УстановитьСуммуПрописью(СуммаОбязательства));
    СтруктураПараметров.Вставить("ПараметрДата", ПериодФормат);

	Для Каждого Параметр Из СтруктураПараметров Цикл  
	    ДокументВорд.Content.Find.Execute(Параметр.Ключ,,,,,,,,,Параметр.Значение,2);
	КонецЦИкла;
	
	//Вынужденные паузы чтобы не было ошибки совместного доступа
	ДокументВорд.SaveAs(ИмяФайла);  
	Задержка(10);

	ОбъектВорд.Application.Quit(); 
	
	ОписаниеОшибки = "";
	
	СформироватьИОтправитьПисьмо("ОтправкаШаблона", ОписаниеОшибки, ИмяФайла); 
	
	ИзменитьСтатусВознагражденияПриИзмененииСтатусаПлатежногоПоручения();
			
	Возврат Неопределено;      
	
КонецФункции

Функция ВыполнитьЗамену(знач Object,Параметр,Значение)
	СтрокаПоиска = "["+Параметр+"]";
	СтрокаЗамены = Строка(Значение);
	Object.Select();
	Selection = Object.Application.Selection;
	FindObject = Selection.Find;
	FindObject.ClearFormatting();
	Пока  FindObject.Execute(строкапоиска) Цикл 
		Если ПустаяСтрока(СтрокаЗамены) Тогда
			selection.Delete();
		Иначе                  
			Selection.TypeText(СтрокаЗамены);
		КонецЕсли;	
	КонецЦИкла;	               
	Selection.Collapse();
КонецФункции

Функция УстановитьСуммуПрописью(Сумма)
	
	ВыводитьСуммуБезКопеек = Ложь;
	
	Валюта = Справочники.Валюты.RUB;
	Результат     = Сумма;
	ЦелаяЧасть    = Цел(Сумма);
	ФорматСтрока  = "Л=ru_RU; ДП=Ложь";
	ПарамПредмета = Валюта.ПараметрыПрописиНаРусском;
	
	Если Результат = ЦелаяЧасть Тогда
		Если ВыводитьСуммуБезКопеек Тогда
			Результат = ЧислоПрописью(Результат, ФорматСтрока, ПарамПредмета);
			Результат = Лев(Результат, Найти(Результат, "0") - 1);
		Иначе
			Результат = ЧислоПрописью(Результат, ФорматСтрока, ПарамПредмета);
		КонецЕсли;
	Иначе
		Результат = ЧислоПрописью(Результат, ФорматСтрока, ПарамПредмета);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Процедура ИзменитьСтатусВознагражденияПриИзмененииСтатусаПлатежногоПоручения(Отказ = Ложь) Экспорт
	
	Если Отказ Тогда Возврат; КонецЕсли;
	
	МассивИзмененныхДокументов = Новый Массив;
	Для Каждого Строка Из ДокументыКВыгрузке Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.ПорученияВМидл) Тогда
			 Продолжить;
		КонецЕсли;
		
		ДокументОснование = Строка.Основание;	
		
		Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
			Возврат;
		КонецЕсли; 
		
		Если ТипЗнч(ДокументОснование)<>Тип("ДокументСсылка.КонвертацияВалюты") 
			И ТипЗнч(ДокументОснование)<>Тип("ДокументСсылка.НачислениеВознаграждения") 
			И ТипЗнч(ДокументОснование)<>Тип("ДокументСсылка.НачислениеПроцентовОтСреднейСЧА") // ASP-80600
			И ТипЗнч(ДокументОснование)<>Тип("ДокументСсылка.НачислениеЗадолженности") 
			И ТипЗнч(ДокументОснование)<>Тип("ДокументСсылка.Поручение") Тогда
			Возврат;
		КонецЕсли; 
		
		ТекущийСтатус = РегистрыСведений.ИсторияСтатусовОбъектов.ПолучитьАктуальныйСтатусОбъекта(ДокументОснование);
		
		НовыйСтатус = Перечисления.СтатусыОбъектов.СформированоПлатежноеПоручение;
		
		Если НовыйСтатус <> ТекущийСтатус Тогда
			
			Попытка
				РегистрыСведений.ИсторияСтатусовОбъектов.СохранитьТекущийСтатусОбъекта(ДокументОснование, НовыйСтатус);	
				Если ТипЗнч(МассивИзмененныхДокументов) = Тип("Массив") Тогда
					МассивИзмененныхДокументов.Добавить(ДокументОснование);
				КонецЕсли;
			Исключение
				ТекстОтказа = НСтр("ru = 'Не удалось изменить статус документа %1 по причине: %2'");
				ТекстОтказа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОтказа, ДокументОснование, ОписаниеОшибки()); 
				Отказ = Истина;
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое выполнение оплаты КЗ по клиентам'"),
					?(Отказ, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация),
					Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
					Метаданные().Имя,
					ТекстОтказа);
				ОшибкиВыполнения = Истина;	
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

Функция НалоговыеПериоды(ТекПериод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Периоды.Ссылка КАК Период
		|ИЗ
		|	Справочник.Периоды КАК Периоды
		|ГДЕ
		|	ГОД(Периоды.ДатаНачала) = ГОД(&Период)";
	
	Запрос.УстановитьПараметр("Период", ТекПериод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Период;	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура Задержка(Секунды)
	
	КонДата = ТекущаяДатаСеанса() + Секунды;
	
	Пока ТекущаяДатаСеанса() < КонДата Цикл 
	КонецЦикла;

КонецПроцедуры

#Область ФормированиеДокументов

Процедура СформироватьБлокировкуДенежныхСредств() Экспорт
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое выполнение оплаты КЗ по клиентам НДФЛ'"),
		 	УровеньЖурналаРегистрации.Информация,
			Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
			Метаданные().Имя,
			"Начато выполнение фонового задания НДФЛ Шаг 1.1");
	
	ДатаСеанса = ОбщегоНазначения.ДатаСеанса(); 
	ДатаДок = НачалоДня(НачалоДня(Период) - 1) + 60*60*9; 
	
	RUB 							= ПредопределенноеЗначение("Справочник.Валюты.RUB");
	ВидОперации 					= Перечисления.ВидыОперацийБлокировкаДС.Блокировка;

	Для каждого Строка Из ДокументыКВыгрузке Цикл
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое выполнение оплаты КЗ по клиентам НДФЛ'"),
		 	УровеньЖурналаРегистрации.Информация,
			Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
			Метаданные().Имя,
			"Начато выполнение фонового задания НДФЛ Шаг 1.2");
	
		ТекстОтказа = "";
		Отказ = Ложь;
		Если ЗначениеЗаполнено(Строка.Основание) И НЕ ЗначениеЗаполнено(Строка.ДокументБлокировки) Тогда
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое выполнение оплаты КЗ по клиентам НДФЛ'"),
			УровеньЖурналаРегистрации.Информация,
			Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
			Метаданные().Имя,
			"Начато выполнение фонового задания НДФЛ Шаг 1.3");

			// Создание платежного поручения
			РеквизитыПП = Новый Структура();
			РеквизитыПП.Вставить("Основание",					 Строка.Основание);
			РеквизитыПП.Вставить("ДоговорДУ",  					 Строка.ДоговорДУ);
			РеквизитыПП.Вставить("АналитическийСчет",  			 Строка.АналитическийСчетИсточник);
			РеквизитыПП.Вставить("Валюта",  			 		 RUB);	
			РеквизитыПП.Вставить("ВидОперации",  			 	 ВидОперации);   
			РеквизитыПП.Вставить("ВалютнаяСумма",  			 	 Строка.СуммаБлокировки);
			РеквизитыПП.Вставить("Дата",  			 	 		 ДатаДок);

			Если  ТипЗнч(РеквизитыПП.Основание) = Тип("ДокументСсылка.НачислениеВознаграждения") Тогда
				РеквизитыПП.Вставить("ОбъектБлокировка",  Справочники.ОбъектыБлокировки.Вознаграждение); 
			ИначеЕсли ТипЗнч(РеквизитыПП.Основание) = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
				РеквизитыПП.Вставить("ОбъектБлокировка",  Справочники.ОбъектыБлокировки.НДФЛ); 
			Иначе
				РеквизитыПП.Вставить("ОбъектБлокировка",  Справочники.ОбъектыБлокировки.ПустаяСсылка()); 
			КонецЕсли;	
			
			ДокументБлокировки = БлокировкаДенежныхСредствСоздатьЗаполнить(РеквизитыПП, Отказ, ТекстОтказа);
			           
			Если Не Отказ Тогда
				Строка.ДокументБлокировки = ДокументБлокировки;
				Строка.СуммаЗаблокированныхСредств = Строка.СуммаБлокировки;
			Иначе
				Строка.Комментарий = ТекстОтказа;
			КонецЕсли;
		Иначе
			Строка.Комментарий = Строка.Комментарий +"; Не создан документ блокировки";	
		КонецЕсли;
	
	КонецЦикла;
	
	СуммаБлокировки = ДокументыКВыгрузке.Итог("СуммаЗаблокированныхСредств");

КонецПроцедуры

Функция БлокировкаДенежныхСредствСоздатьЗаполнить(РеквизитыПП, Отказ, ТекстОтказа)
	
	Основание = РеквизитыПП.Основание;
	ОбъектБлокировкаРазблокировкаДС = Документы.БлокировкаРазблокировкаДС.ПустаяСсылка();
	
	Если Основание.Проведен = Ложь Тогда
		Отказ = Истина;
		ТекстОтказа = НСтр("ru = 'Документ основание: %1 не проведен. Поступленин на расчетный счет можно создать только на основании проведенного документа основания.'");
		ТекстОтказа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОтказа, Основание);
	КонецЕсли;
	
	БлокировкаРазблокировкаДС = Документы.БлокировкаРазблокировкаДС.СоздатьДокумент();
	
	БлокировкаРазблокировкаДС.Основание 			= РеквизитыПП.Основание; 
	БлокировкаРазблокировкаДС.ДоговорДУ		    	= РеквизитыПП.ДоговорДУ;
	БлокировкаРазблокировкаДС.АналитическийСчет 	= РеквизитыПП.АналитическийСчет;
	БлокировкаРазблокировкаДС.Валюта 				= РеквизитыПП.Валюта;
	БлокировкаРазблокировкаДС.ВидОперации 			= РеквизитыПП.ВидОперации;
	БлокировкаРазблокировкаДС.ОбъектБлокировка 		= РеквизитыПП.ОбъектБлокировка; 
	БлокировкаРазблокировкаДС.Ответственный 		= Пользователи.ТекущийПользователь();	
	БлокировкаРазблокировкаДС.Дата 					= РеквизитыПП.Дата;
	БлокировкаРазблокировкаДС.ВалютнаяСумма 		= РеквизитыПП.ВалютнаяСумма;
	
 	Попытка
		БлокировкаРазблокировкаДС.Записать(РежимЗаписиДокумента.Проведение);
		ОбъектБлокировкаРазблокировкаДС = БлокировкаРазблокировкаДС.Ссылка;  
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое выполнение оплаты КЗ по клиентам НДФЛ'"),
		 	УровеньЖурналаРегистрации.Информация,
			Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
			Метаданные().Имя,
			"Начато выполнение фонового задания НДФЛ Шаг 1.4.1");

	Исключение
		Отказ = Истина;
		ТекстОтказа =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не удалось записать Блокировка разблокировка д/с на основание ""%2"" по причине ""%1""'"),ОписаниеОшибки(),Основание); 
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое выполнение оплаты КЗ по клиентам'"),
		                         ?(Отказ, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация),
									Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
									Метаданные().Имя,
									ТекстОтказа);
		ОшибкиВыполнения = Истина;
	КонецПопытки;
	
	Возврат ОбъектБлокировкаРазблокировкаДС;

	
КонецФункции

Процедура СформироватьПлатежноеПоручение()Экспорт
	
	ДатаПП = ОбщегоНазначения.ДатаСеанса();
	RUB = ПредопределенноеЗначение("Справочник.Валюты.RUB");
	USD = ПредопределенноеЗначение("Справочник.Валюты.USD");
	EUR = ПредопределенноеЗначение("Справочник.Валюты.EUR");
	
	Для каждого Строка Из ДокументыКВыгрузке Цикл
		
		Если Не ЗначениеЗаполнено(Строка.ПорученияВМидл) Тогда  
					
			Если Строка.СуммаОбязательства = 0 ИЛИ СравниватьСБрокерскимиСуммами = "БрокерскимСчетом" 
													И (Строка.СуммаБрокерскийСчет < Строка.СуммаОбязательства ИЛИ Строка.СуммаТребования <= 0) Тогда
				Продолжить;	
			ИначеЕсли Строка.СуммаОбязательства = 0 ИЛИ СравниватьСБрокерскимиСуммами = "РасчетнымСчетом" 
													И (Строка.СуммаРасчетныйСчет < Строка.СуммаОбязательства ИЛИ Строка.СуммаТребования <> 0) Тогда 
				Продолжить;
			КонецЕсли;
			
			Отказ = Ложь;
			ТекстОтказа = "";
			
			РеквизитыПП = Новый Структура();
			РеквизитыПП.Вставить("ДокументОснование",	Строка.Основание);
			РеквизитыПП.Вставить("ВидДокумента",		Строка.ВидДокументаОснования);
			РеквизитыПП.Вставить("Статус",				ПредопределенноеЗначение("Перечисление.СтатусыОбъектов.Новый"));
			РеквизитыПП.Вставить("НеЗаполненоНазначениеПлатежа",Ложь);
			РеквизитыПП.Вставить("ДатаПлатежногоПоручения", 	НачалоДня(Период) + 60*60*9);
			РеквизитыПП.Вставить("СуммаОбязательства",  		Строка.СуммаОбязательства);
			РеквизитыПП.Вставить("ДоговорДУ",  					Строка.ДоговорДУ); 
			РеквизитыПП.Вставить("ДоговорКонтрагента",  		Строка.ДоговорПриемник);
			РеквизитыПП.Вставить("АналитическийСчетПриемник",  	Строка.АналитическийСчетПриемник);
			РеквизитыПП.Вставить("АналитическийСчетИсточник",  	Строка.АналитическийСчетИсточник);
			РеквизитыПП.Вставить("Контрагент",  				Строка.Контрагент);
			РеквизитыПП.Вставить("ЕРС",  						Строка.БанковскийСчет);
			
			Поручение = СоздатьПлатежноеПоручение(РеквизитыПП, Отказ, ТекстОтказа);
			
			Если Не Отказ Тогда
				Строка.ПорученияВМидл 			    = Поручение;
				Строка.Статус 						= РеквизитыПП.Статус;
				Строка.СуммаПоручений 				= Строка.СуммаОбязательства;
			Иначе
				Строка.Комментарий = ТекстОтказа;
			КонецЕсли; 
	 
		КонецЕсли;	
	КонецЦикла;
	
	СуммаПоручений = ДокументыКВыгрузке.Итог("СуммаПоручений");
	
КонецПроцедуры

Функция СоздатьПлатежноеПоручение(РеквизитыПП, Отказ, ТекстОтказа)
	
	Основание = РеквизитыПП.ДокументОснование;
	ПлатежноеПоручение = Документы.Поручение.ПустаяСсылка();
	
	Если Основание.Проведен = Ложь Тогда
		Отказ = Истина;
		ТекстОтказа = НСтр("ru = 'Документ основание: %1 не проведен. Платежное поручение можно создать только на основании проведенного документа основания.'");
		ТекстОтказа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОтказа, Основание);
	КонецЕсли;
	
	ДокПоручение = Документы.Поручение.СоздатьДокумент();
	
	//Заполнение_по_документу_НАЧИСЛЕНИЕ_ЗАДОЛЖЕННОСТИ
	ЗаполнитьЗначенияСвойств(ДокПоручение, Основание);
	//
	ДокПоручение.Номер = "";
	Если ЗначениеЗаполнено(РеквизитыПП.ДатаПлатежногоПоручения) Тогда
		ДокПоручение.Дата = РеквизитыПП.ДатаПлатежногоПоручения;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ДокПоручение.Дата) Тогда
		ДокПоручение.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ДокПоручение.ВидОперации   			= Перечисления.ВидыОперацийПоручение.Перевод; 
	ДокПоручение.ДоговорДУ              = РеквизитыПП.ДоговорДУ;
	ДокПоручение.КлиентДУ               = РеквизитыПП.Контрагент;
	ДокПоручение.СчетКонтрагента        = РеквизитыПП.ЕРС;
	ДокПоручение.ДоговорКонтрагента     = РеквизитыПП.ДоговорКонтрагента;
	ДокПоручение.СуммаДС			    = РеквизитыПП.СуммаОбязательства;
	
	ДокПоручение.АналитическийСчетИсточник	= РеквизитыПП.АналитическийСчетИсточник;
	ДокПоручение.АналитическийСчетПриемник	= РеквизитыПП.АналитическийСчетПриемник;
	ДокПоручение.Комментарий				= ?(ВидДокументаОснования = "НачислениеЗадолженности", "Оплата НДФЛ", "Оплата ВУК"); 
	
	ДокПоручение.КурсВзаиморасчетов			= 1;
	ДокПоручение.КратностьВзаиморасчетов	= 1;

	Если НЕ ДокПоручение.ПроверитьЗаполнение() Тогда
		Отказ = Истина;
		ТекстОтказа = НСтр("ru = 'Невозможно создать платежное поручение т.к не заполнены обязательные реквизиты:'");
		// Выводим сообщения о незаполненных реквизитах.
		СообщенияПользователю = ПолучитьСообщенияПользователю();
		Для каждого ТекСообщение Из СообщенияПользователю Цикл
			ТекстОтказа = ТекстОтказа + Символы.ПС + " - " + ТекСообщение.Текст;
		КонецЦикла;
		Возврат ДокПоручение.Ссылка;
	КонецЕсли;
	
	ДокПоручение.Ответственный 	= Пользователи.ТекущийПользователь();	
	
	Попытка  
		
		ДокПоручение.Записать(РежимЗаписиДокумента.Проведение);
		ПлатежноеПоручение = ДокПоручение.Ссылка;   
		
	Исключение
		
		Отказ = Истина;
		ТекстОтказа =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не удалось записать платежное поручение на основании ""%1"" по причине ""%2""'"), Основание,ОписаниеОшибки());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое выполнение оплаты КЗ по клиентам'"),
			?(Отказ, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация),
			Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
			Метаданные().Имя,
			ТекстОтказа);
        ОшибкиВыполнения = Истина;

	КонецПопытки;
	
	Возврат ПлатежноеПоручение;
	
КонецФункции

#КонецОбласти
ОшибкиВыполнения = Ложь;

#КонецОбласти
