
// Функция - Поднадзорная категория
// 
// Параметры:
//  Категория	 - СправочникСсылка.КатегорииРолейКлиентовСогласноУказов81и95 - Категория которую требуется проверить
// 
// Возвращаемое значение:
//   - Булево
//
Функция ПоднадзорнаяКатегория(Категория) Экспорт
	Возврат Категория = Справочники.КатегорииРолейКлиентовСогласноУказов81и95.ИностранныйРезидентПодКонтролемИностранныхЛицИзНедружественныхСтран
		ИЛИ Категория = Справочники.КатегорииРолейКлиентовСогласноУказов81и95.ИностранныйРезидентУдовлетворяющийТребованиямП12Указа95
		ИЛИ Категория = Справочники.КатегорииРолейКлиентовСогласноУказов81и95.РоссийскийРезидентПодКонтролемИностранныхЛицИзНедружественныхСтран;
КонецФункции