
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	 Отказ = ?(Объект.Проверка, Истина, Отказ);
	 
	 Если Объект.Ссылка.Пустая() Тогда 
		 
		УстановитьНомерДокументаСервер(); 
		ЗаполнитьШапкуДокументаСервер();
				
		Если НЕ ЗначениеЗаполнено(Объект.ТипОперации) Тогда
			Объект.ТипОперации = Перечисления.ТипыКонвертаций.Конвертация;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ТарифныйПлан) Тогда
			ТарифныеПланы = Справочники.ТарифныеПланы.Выбрать();
			Если ТарифныеПланы.Следующий() Тогда
				Объект.ТарифныйПлан = ТарифныеПланы.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры


//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыЦенныеБуиаги

&НаКлиенте
Процедура ЦенныеБумагиИсходныеЦБОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь;
	
	ДатаПроверки	= ?(НЕ ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Объект.Дата);
	
	ЦенныеБумагиКлиент.ЦеннаяБумагаПроверкаВыборка(ВыбранноеЗначение, ДатаПроверки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦБОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	
	ДатаПроверки	= ?(Не ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Объект.Дата);
	
	ЦенныеБумагиКлиент.ЦеннаяБумагаПроверкаВыборка(ВыбранноеЗначение, ДатаПроверки, СтандартнаяОбработка);
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РассчитатьБезОкругления(Команда)
	
	РассчитатьБезОкругленияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДляДробныхЗачислений(Команда)
	РассчитатьДляДробныхЗачисленийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДляЦелыхЗачислений(Команда)
	РассчитатьДляЦелыхЗачисленийНаСервере();
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ТекущийОбъект(НовыйОбъект = Неопределено)
	Если НовыйОбъект=Неопределено Тогда
		Возврат РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	ЗначениеВРеквизитФормы(НовыйОбъект, "Объект");
	Возврат Неопределено;
КонецФункции


&НаСервере
Процедура РассчитатьДляЦелыхЗачисленийНаСервере()
	
	НашОбъект = ТекущийОбъект();
	НашОбъект.РассчитатьДляЦелыхЗачислений();
	ТекущийОбъект(НашОбъект);
	

КонецПроцедуры


&НаСервере
Процедура РассчитатьДляДробныхЗачисленийНаСервере()
	
	НашОбъект = ТекущийОбъект();
	НашОбъект.РассчитатьДляДробныхЗачислений();
	ТекущийОбъект(НашОбъект);

КонецПроцедуры


&НаСервере
Процедура РассчитатьБезОкругленияНаСервере()
	
	НашОбъект = ТекущийОбъект();
	НашОбъект.РассчитатьБезОкругления();
	ТекущийОбъект(НашОбъект);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШапкуДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ОбщегоНазначения.ЗаполнитьШапкуДокумента(ТекущийОбъект, ПараметрыСеанса.ТекущийПользователь, , );
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура УстановитьНомерДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Дата) Тогда
		ТекущийОбъект.Дата = НачалоДня(ТекущаяДата());
	КонецЕсли;
	ТекущийОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	НашОбъект = ТекущийОбъект();
	НашОбъект.Заполнить(Объект.ДокументОснование);
	ТекущийОбъект(НашОбъект);
	
КонецПроцедуры





//#КонецОбласти