
Функция РазделСчетаДепо(СчетДепо, ТипРаздела) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РазделыСчетаДепо.Ссылка КАК Раздел
	|ИЗ
	|	Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
	|ГДЕ
	|	РазделыСчетаДепо.Владелец = &СчетДепо
	|	И РазделыСчетаДепо.ТипРазделаСчетаДЕПО = &ТипРаздела
	|	И НЕ РазделыСчетаДепо.ПометкаУдаления");
	Запрос.УстановитьПараметр("СчетДепо",	СчетДепо);
	Запрос.УстановитьПараметр("ТипРаздела",	ТипРаздела);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Раздел;
	Иначе
		Результат = Справочники.РазделыСчетаДепо.ПустаяСсылка();
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция НаименованиеРазделаСчетаДепоПоТипу(ТипРазделаСчетаДЕПО, Залогодержатель, Дата) Экспорт
	Наименование = Строка(ТипРазделаСчетаДЕПО);
	Если ТипРазделаСчетаДЕПО = Перечисления.ТипыРазделовСчетовДЕПО.БлокированоВЗалоге Тогда
		Наименование = Наименование + " (Залогодержатель - "
			+ ОбщегоНазначенияКлиентСервер.НаименованиеЮрФизЛицаКлиента(Залогодержатель, Дата, Ложь) + ")";
	КонецЕсли;
	Возврат Наименование;
КонецФункции