
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Для Каждого ПараметрКоманды Из ПараметрКоманды Цикл
		Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Отправка уведомления возможна только для записанного документа.");
			Продолжить;
		КонецЕсли;
		
		Тестирование = Ложь;
		ПараметрыВыполненияКоманды.Источник.Параметры.Свойство("Тестирование",Тестирование);
		
		ПодготовитьУведомлениеНаСервере(ПараметрКоманды, Тестирование);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьУведомлениеНаСервере(ДокументРСВ, Тестирование)
	
	Если ДокументРСВ.ПометкаУдаления Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Документ " + ДокументРСВ + " помечен на удаление. Отправка уведомления не возможна.");
		Возврат;
	КонецЕсли;
	
	Документы.РаскрытиеСпискаВладельцев.ПодготовитьУведомлениеОРаскрытииСпискаВладельцевЦБ(ДокументРСВ);
	
КонецПроцедуры
