#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДатаЗапроса = НачалоДня(ТекущаяДатаСеанса());
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaMultiToDiasRequestData1655;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналИсходящихСообщенийKafka, "ВнешнийИсточник", ВнешнийИсточник);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналИсходящихСообщенийKafka, "Ключ", "Request");
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaDiasToDepoDocSum1655;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналВходящихСообщенийKafka, "ВнешнийИсточник", ВнешнийИсточник);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналВходящихСообщенийKafka, "Ключ", "DocumentsSumDias");
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодготовитьЗапрос(Команда)
	ПодготовитьЗапросНаСервере();
	Элементы.ЖурналИсходящихСообщенийKafka.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветы(Команда)
	ОбработатьОтветСДаннымиНаСервере();
	Элементы.ЖурналВходящихСообщенийKafka.Обновить();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьЗапросНаСервере()
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	ПолучениеДанныхДиасофтВызовСервера.СоздатьЗапросДанных(ТекущаяДата);
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтветСДаннымиНаСервере()
	ПолучениеДанныхДиасофтВызовСервера.ОбработатьОтветы();
КонецПроцедуры

#КонецОбласти