
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
Если ТипЗнч(Параметры.Отбор) = Тип("Структура") Тогда
	Параметры.Отбор.Свойство("Владелец", Параметры.Владелец);
	Если ЗначениеЗаполнено(Параметры.Владелец) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Дерево, "Владелец", Параметры.Владелец);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", Параметры.Владелец);
	КонецЕсли;
	КонецЕсли;

КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Тарифы, "Услуга", ТекущиеДанные.Ссылка);	
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Тарифы, "Услуга", ПредопределенноеЗначение("Справочник.УслугиТарифногоПлана.ПустаяСсылка"));	
		
	КонецЕсли;
КонецПроцедуры

//#КонецОбласти

