
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервереБезКонтекста
Процедура СохранитьНастройкиФормы(ОбъектСсылка, СохраняемоеЗначение)
	
	ДополнительнаяОбработкаОбъект = ОбъектСсылка.ПолучитьОбъект();
	ДополнительнаяОбработкаОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(СохраняемоеЗначение);
	ДополнительнаяОбработкаОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

//СОБЫТИЯ ФОРМЫ

#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройки	= Неопределено;
	
	Если не Параметры.Свойство("НастройкиАлгоритма", Настройки) Тогда
		
		ОбъектСсылка         = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДополнительнаяОбработкаСсылка");
		ИдентификаторКоманды = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИдентификаторКоманды");
		ИмяФормыВладельца    = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИмяФормы");
		
		ХранилищеНастроек = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСсылка, "ХранилищеНастроек");
		Настройки = ХранилищеНастроек.Получить();
		
	КонецЕсли;
		
	Если ТипЗнч(Настройки) = Тип("Структура") Тогда
		
		//масИнБиржи 			= ВариантыОтчетовКлиентСервер.СвойствоСтруктуры(Настройки, "масИнБиржи", новый Массив);
		//СписИнБиржи.ЗагрузитьЗначения(масИнБиржи);
		БиржевойКалендарь	= ВариантыОтчетовКлиентСервер.СвойствоСтруктуры(Настройки, "БиржевойКалендарь");
					
		ПочтовыйЛогин	 	= ВариантыОтчетовКлиентСервер.СвойствоСтруктуры(Настройки, "ПочтовыйЛогин");
		EmailПолучателей 	= ВариантыОтчетовКлиентСервер.СвойствоСтруктуры(Настройки, "EmailПолучателей");
		
		БиржаММВБ 			= ВариантыОтчетовКлиентСервер.СвойствоСтруктуры(Настройки, "БиржаММВБ");
		РасчетныйЦентрНРД	= ВариантыОтчетовКлиентСервер.СвойствоСтруктуры(Настройки, "РасчетныйЦентрНРД");
		РасчетныйЦентрНРД2	= ВариантыОтчетовКлиентСервер.СвойствоСтруктуры(Настройки, "РасчетныйЦентрНРД2");
		БиржевойКалендарь	= ВариантыОтчетовКлиентСервер.СвойствоСтруктуры(Настройки, "БиржевойКалендарь");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

// КОМАНДЫ ФОРМЫ

#Область КОМАНДЫ_ФОРМЫ

&НаКлиенте
Процедура Установить(Команда)
	
	СохраняемоеЗначение = Новый Структура;
	СохраняемоеЗначение.Вставить("БиржевойКалендарь", БиржевойКалендарь);
	//СохраняемоеЗначение.Вставить("масИнБиржи", СписИнБиржи.ВыгрузитьЗначения());
	
	СохраняемоеЗначение.Вставить("ПочтовыйЛогин", ПочтовыйЛогин);
	СохраняемоеЗначение.Вставить("EmailПолучателей", EmailПолучателей);
	
	СохраняемоеЗначение.Вставить("БиржаММВБ", БиржаММВБ);
	СохраняемоеЗначение.Вставить("РасчетныйЦентрНРД", РасчетныйЦентрНРД);
	СохраняемоеЗначение.Вставить("РасчетныйЦентрНРД2", РасчетныйЦентрНРД2);
	
	Если ОбъектСсылка.Пустая() Тогда
		ОповеститьОВыборе(СохраняемоеЗначение);
	Иначе
		СохранитьНастройкиФормы(ОбъектСсылка, СохраняемоеЗначение);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти



















