#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Заголовок = "Тест скорости PDF ВУК РДУ. Версия - "
		+ ОбработкаОбъект.СведенияОВнешнейОбработке().Версия;

	Объект.ДоговорыДУ.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ДоговорДУ");

	Если Не ЗначениеЗаполнено(Объект.ДатаНачисления) Тогда
		Объект.ДатаНачисления = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	Если Объект.КоличествоВВыборке <= 0 Тогда
		Объект.КоличествоВВыборке = 100;
	КонецЕсли;
	Если Объект.РазмерПачки <= 0 Тогда
		Объект.РазмерПачки = 50;
	КонецЕсли;
	Если Объект.СтавкаВознаграждения = 0 Тогда
		Объект.СтавкаВознаграждения = 2;
	КонецЕсли;

	ОбработкаОбъект.ОбновитьЛимитПотоковИзКонстанты();
	Попытка
		ОбработкаОбъект.ПутьКФайлуОбработки = ОбработкаОбъект.ИспользуемоеИмяФайла;
	Исключение
		ОбработкаОбъект.ПутьКФайлуОбработки = "";
	КонецПопытки;

	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСравнение(Команда)
	ЗапуститьСравнениеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыбратьНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыбратьДоговоры();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

&НаСервере
Процедура ЗапуститьСравнениеНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Попытка
		Если ПустаяСтрока(ОбработкаОбъект.ПутьКФайлуОбработки) Тогда
			ОбработкаОбъект.ПутьКФайлуОбработки = ОбработкаОбъект.ИспользуемоеИмяФайла;
		КонецЕсли;
	Исключение
	КонецПопытки;
	ОбработкаОбъект.ЗапуститьСравнение();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

#КонецОбласти
