Перем Макет; //Макет для формирования лога

#Область Служебные
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид","ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Назначение",); // МассивСтрокИмен
	ПараметрыРегистрации.Вставить("Наименование", "Обработки объектов после загрузки из DU");
	ПараметрыРегистрации.Вставить("Версия", "3.00");
	ПараметрыРегистрации.Вставить("БезопасныйРежим",Ложь);
	ПараметрыРегистрации.Вставить("Информация","Обработки объектов после загрузки из DU");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "2.1.1.12");
	
	//Блок DevOps
	ВерсияПрименения = "1.00";
	Если ВерсияПрименения = ПараметрыРегистрации.Версия Тогда
		ПараметрыРегистрации.Вставить("ПереформатироватьСтруктуруНастроекФин", Истина);
	КонецЕсли;	
	//
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд,
	"Обработки объектов после загрузки из DU",
	"ОбработкиОбъектовПослеЗагрузкиИзDU",
	"ОткрытиеФормы");
	
	ДобавитьКоманду(ТаблицаКоманд,
	"Обработки объектов после загрузки из DU (в фоне)",
	"ФоновоеВыполнение",
	"ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#Область DevOps
Процедура ЗагрузитьНастройки(ПараметрыРегистрации) Экспорт
	ВерсияПрименения = "1.00";
	ТекущаяРегистрация = СведенияОВнешнейОбработке();
	Если ВерсияПрименения = ТекущаяРегистрация.Версия Тогда
		ПараметрыРегистрации.Вставить("ЗагружатьНастройки", Истина);
		НастройкиПоУмолчанию(ЭтотОбъект);
		ЗаголовокНастроек = "";
		ЗначенияПараметров = УстановитьПараметры(ЗаголовокНастроек);
		ПараметрыРегистрации.Вставить("Настройки", Новый Структура("Значения, ЗаголовокНастроек", ЗначенияПараметров, ЗаголовокНастроек));
	КонецЕсли;	
КонецПроцедуры

Процедура НастройкиПоУмолчанию(Объект) Экспорт
	
	Объект.КоличествоПотоков = 5;
	Объект.ОчищатьСпискиПослеОбработки = Истина;
	
КонецПроцедуры	

Функция УстановитьПараметры(ЗаголовокНастроек) Экспорт
	
	Значения = Новый Структура();      
	Значения.Вставить("ПочтовыйЛогин", ЭтотОбъект.ПочтовыйЛогин);
	Значения.Вставить("СписокРассылки", XMLСтрока(Новый ХранилищеЗначения(ЭтотОбъект.СписокРассылки.Выгрузить())));
	ПредставлениеПочты = ?(ЭтотОбъект.СписокРассылки.Количество()>0, "Установлен список рассылки","");
	ЗаголовокНастроек = СокрЛП(ПредставлениеПочты);
	Возврат Значения;
	
КонецФункции

#КонецОбласти

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт
	// Реализация логики команды
	
	Если ИдентификаторКоманды <> "ФоновоеВыполнение" Тогда 
		Возврат; 
	КонецЕсли;
	
	ОбъектСсылка = ПараметрыВыполненияКоманды.ДополнительнаяОбработкаСсылка;
	
	ДатаНачала 		= НачалоДня(КалендарныеГрафики.ПолучитьСледующуюРабочуюДату(,ТекущаяДата(),-1));
	ДатаОкончания 	= КонецДня(ДатаНачала);
	
	//Демонстрация переделок логики работы с настройками. Добавляем параметр в вызов - ПараметрыВыполненияКоманды
	ПредставлениеНастроек = УстановитьНастройки(ПараметрыВыполненияКоманды);
	
	Задача = Задачи.ЗадачаИнтеграции.СоздатьЗадачу();
	Задача.Дата 			= ТекущаяДата();
	Задача.ВидОбмена 		= ОбъектСсылка;
	Задача.ВерсияОбработки 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСсылка, "Версия");
	Задача.Наименование 	= "Обработки объектов после загрузки из DU (в фоне)";
	Задача.ПараметрыВыполнения = ПредставлениеНастроек;
	
	Отказ = Ложь;
	ТекстОшибки = "";
	
	Попытка 
		УстановкаИдентификатораДляОбработки();  
		
		Если ЗначениеЗаполнено(ИдентификаторОбмена) Тогда
			ВыполнитьОбработку();
		Иначе	
			Отказ = Истина;
			ТекстОшибки = "Нет доступных элементов для пост обработки";
		КонецЕсли;	
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Отказ = Истина;
	КонецПопытки;
	
	Задача.Описание = "";
	Задача.ХранилищеЛога = Новый ХранилищеЗначения(Лог, Новый СжатиеДанных(9));
	
	Если Отказ тогда
		Задача.Описание = "Ошибки выполнения:" + Символы.ПС + ТекстОшибки;
		Задача.ЗавершеноСОшибками = Истина;
	Иначе
		Задача.Описание = "Загрузка успешна";
	КонецЕсли;
	
	Задача.Описание = Задача.Описание;
	Задача.ДатаИсполнения = ТекущаяДата();
	Задача.ВыполнитьЗадачу();
	
КонецПроцедуры

Функция ПропискаРассылки(Знач НомерРассылки)
	Перем ПараметрыПодключения, ИмяИБ;
	
	Попытка
		ПараметрыПодключения = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПодключенияИзСтрокиСоединенияИнформационнойБазы(СтрокаСоединенияИнформационнойБазы());
		ИмяИБ = ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия;
	Исключение
	КонецПопытки;
	
	Прописка = " {" + НомерРассылки + ", ib: " + ?(ЗначениеЗаполнено(ИмяИБ), ИмяИБ, "< .. >") + "}";
	
	Возврат Прописка;
КонецФункции // ПропискаРассылки()

//Демонстрация логики работы с настройками в контуре FIN
Функция УстановитьНастройки(ПараметрыВыполненияКоманды)
	НастройкиВыполнения = ПараметрыВыполненияКоманды.ПараметрыДополнительнойОбработки;
	Если ТипЗнч(НастройкиВыполнения) <> Тип("Структура") Тогда 
		Возврат "<Настройки не установлены>";
	КонецЕсли;
	
	ЗначенияНастроек = НастройкиВыполнения;
	ПредставлениеНастроек = "";
	УстановитьПользовательскиеНастройки(ЗначенияНастроек, ПредставлениеНастроек);
	
	Возврат ПредставлениеНастроек;
КонецФункции

Процедура УстановитьПользовательскиеНастройки(Настройки, ПредставлениеНастроек="") Экспорт
	Если Настройки.Свойство("Значения") Тогда
		Почта = Неопределено;
		Если Настройки.Значения.Свойство("ПочтовыйЛогин", Почта) тогда
			ПочтовыйЛогин = Почта;
			Ящики = XMLЗначение(Тип("ХранилищеЗначения"), Настройки.Значения.СписокРассылки);
			СписокРассылки.Загрузить(Ящики.Получить());
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры	

Функция РассылкаСообщения(ТемаСообщения, ТекстСообщения, Знач ЕстьОшибки)
	
	Если СписокРассылки.Количество()>0 и НЕ ПочтовыйЛогин.Пустая() тогда
		
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста, Важность");
		ПараметрыПисьма.Тема	 = ?(ЕстьОшибки, "{FAIL} ", "{OK} ") + ТемаСообщения + ПропискаРассылки("r82");
		ПараметрыПисьма.Тело	 = ТекстСообщения;
		ПараметрыПисьма.Важность = ?(ЕстьОшибки, ВажностьИнтернетПочтовогоСообщения.Высокая, ВажностьИнтернетПочтовогоСообщения.Обычная);
		
		Кому = Новый Массив;
		Для каждого ТекЯщик из СписокРассылки Цикл
			Кому.Добавить(Новый Структура("Адрес,Представление", ТекЯщик.ПочтовыйЯщик, ТекЯщик.Представление));
		КонецЦикла;
		
		ПараметрыПисьма.Кому = Кому;
		ПараметрыПисьма.ТипТекста = "HTML";
		ПараметрыПисьма.Тело = РассылкаСообщенияТаблица(ТекстСообщения);
		
		Попытка
			РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(ПочтовыйЛогин, ПараметрыПисьма);
			//	РаботаСПочтовымиСообщениямиСлужебный.ОтправитьСообщение(ПочтовыйЛогин, ПараметрыПисьма);
			текстРассылки = "Рассылка завершена";
		Исключение
			текстРассылки = "Рассылка не удалась: "; 
			Сообщения = ПолучитьСообщенияПользователю(Истина);
			Для Каждого Элемент из Сообщения Цикл
				текстРассылки = текстРассылки + Символы.ПС + Элемент.Текст;
			КонецЦикла;
		КонецПопытки;
		
		Возврат текстРассылки;
	КонецЕсли;
	
	Возврат "Не установлен список рассылки";
КонецФункции

Функция РассылкаСообщенияТаблица(ТекстСообщения)
	
	Х =	"";
	Х =	Х + "<html><head><meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" /></head>"+
	"<body style=""font-family:Arial, Helvetica, sans-serif;color:black;"">"+
	"<b>"+ТекстСообщения+"</b><br/><br/>";
	Х =	Х + "<table BORDERCOLOR=""Black"" border-style= ""solid"" border-collapse =""collapse"" border=""1"">"+
	"<tr>"+
	"<th align=""center"" bgcolor=""#C0C0C0"">Дата</th>"+
	"<th align=""center"" bgcolor=""#C0C0C0"">Биржа</th>"+
	"<th align=""center"" bgcolor=""#C0C0C0"">Загружено объектов</th>"+
	"</tr>";
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	КотировкиЦБНаБиржеКотировки.Ссылка.Дата КАК Дата,
	//|	КотировкиЦБНаБиржеКотировки.Ссылка.Биржа.Наименование КАК Биржа,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КотировкиЦБНаБиржеКотировки.НомерСтроки) КАК Колво
	//|ИЗ
	//|	Документ.КотировкиЦБНаБирже.Котировки КАК КотировкиЦБНаБиржеКотировки
	//|ГДЕ
	//|	КотировкиЦБНаБиржеКотировки.Ссылка.Проведен = ИСТИНА
	//|	И КотировкиЦБНаБиржеКотировки.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	КотировкиЦБНаБиржеКотировки.Ссылка.Биржа,
	//|	КотировкиЦБНаБиржеКотировки.Ссылка.Дата,
	//|	КотировкиЦБНаБиржеКотировки.Ссылка.Биржа.Наименование
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Дата,
	//|	Биржа";
	//Запрос.УстановитьПараметр("Дата1", НачалоДня(ДатаНачала));
	//Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаОкончания));
	//РезультатЗапроса = Запрос.Выполнить();
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	Х =	Х + "<tr>"+
	//	"<td>"+Формат(ВыборкаДетальныеЗаписи.Дата,"ДФ=dd.MM.yyyy")+"</td>"+
	//	"<td>"+ВыборкаДетальныеЗаписи.Биржа+"</td>"+
	//	"<td>"+Строка(ВыборкаДетальныеЗаписи.Колво)+"</td>"+
	//	"</tr>"+Символы.ПС;
	//КонецЦикла;
	
	Х =	Х + "</table>";
	Х =	Х + "</body></html>";
	
	Возврат Х;
КонецФункции

#КонецОбласти

#Область Исполнение

Процедура ДобавитьОбъектыДляОбработки(СтрокиДерева, ТЗОбъектыОбработка)

	Для каждого СтрокаОбъект Из СтрокиДерева Цикл
		СтрокаТЗОбъектыОбработка = ТЗОбъектыОбработка.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗОбъектыОбработка, СтрокаОбъект);
	КонецЦикла;	

КонецПроцедуры // ДобавитьОбъектыДляОбработки()

Функция ОбработкаДокументовБПВФоне(ТЗДокументыБП)

	СтрокаXML = ExchDU_ОбработкаОбъектовПослеЗагрузки.XML(ТЗДокументыБП);
		    
    СписОбъектов = Новый Массив;
	ПараметрыФоновогоЗадания = Новый Массив;
	ПараметрыФоновогоЗадания.Добавить(СтрокаXML);
	
	//{[+] IMDEV-3254 N.Filimonova 18.02.2022
	ПараметрыФоновогоЗадания.Добавить(ИдентификаторОбмена);  
	//} IMDEV-3254 N.Filimonova	
	
	Задание = ФоновыеЗадания.Выполнить("ExchDU_ОбработкаОбъектовПослеЗагрузки.ВыполнениеОперацийСДокументамиБП"
									, ПараметрыФоновогоЗадания
									, Новый УникальныйИдентификатор
									, "Обработка объектов после загрузки.");
	Возврат Задание.УникальныйИдентификатор;	

КонецФункции // ВыполнитьФоновоеЗадание()

Процедура ВыполнитьОбработку() Экспорт 
	
	ExchDU_ОбработкаОбъектовПослеЗагрузки.УстановкаСостоянияОбмена(ИдентификаторОбмена, Перечисления.ExchDU_СостояниеОбработки.Обработка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ExchDU_ПотокиОбмена.ИдентификаторПотока КАК ИдентификаторПотока
		|ИЗ
		|	РегистрСведений.ExchDU_ПотокиОбмена КАК ExchDU_ПотокиОбмена
		|ГДЕ
		|	ExchDU_ПотокиОбмена.ИдентификаторОбмена = &ИдентификаторОбмена";
	
	Запрос.УстановитьПараметр("ИдентификаторОбмена", ИдентификаторОбмена);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	МассивИдентификаторов = РезультатЗапроса.ВыгрузитьКолонку("ИдентификаторПотока");
	
	ДатаВремяНачала = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	""ExchDU_СписокДокументовДляПроведения"" КАК РегСвед,
		|	""ДокументДляПроведения"" КАК Измерение,
		|	""ПроведениеДокументовПослеЗагрузки"" КАК ИмяОперации,
		|	СписокДокументовДляПроведения.ДокументДляПроведения КАК ОбъектДляОперации,
		|	ЕСТЬNULL(СписокДокументовДляПроведения.ДокументДляПроведения.Портфель, ""Без портфеля"") КАК Портфель,
		|	СписокДокументовДляПроведения.ИдентификаторПотока КАК ИдентификаторПотока
		|ПОМЕСТИТЬ ВТ_ДокДляПроведения
		|ИЗ
		|	РегистрСведений.ExchDU_СписокДокументовДляПроведения КАК СписокДокументовДляПроведения
		|ГДЕ
		|	СписокДокументовДляПроведения.ИдентификаторПотока В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ExchDU_СписокДокументовДляОтменыПроведения"" КАК РегСвед,
		|	""ДокументДляОтменыПроведения"" КАК Измерение,
		|	""ДокументДляОтменыПроведения"" КАК ИмяОперации,
		|	ExchDU_СписокДокументовДляОтменыПроведения.ДокументДляОтменыПроведения КАК ОбъектДляОперации,
		|	ЕСТЬNULL(ExchDU_СписокДокументовДляОтменыПроведения.ДокументДляОтменыПроведения.Портфель, ""Без портфеля"") КАК Портфель,
		|	ExchDU_СписокДокументовДляОтменыПроведения.ИдентификаторПотока КАК ИдентификаторПотока
		|ПОМЕСТИТЬ ВТ_ДокОтменаПроведения
		|ИЗ
		|	РегистрСведений.ExchDU_СписокДокументовДляОтменыПроведения КАК ExchDU_СписокДокументовДляОтменыПроведения
		|ГДЕ
		|	ExchDU_СписокДокументовДляОтменыПроведения.ИдентификаторПотока В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ExchDU_СписокНепроведенныхДокументов"" КАК РегСвед,
		|	""ДокументНепроведенный"" КАК Измерение,
		|	""ЗаписьНепроведенныхДокументовПослеЗагрузки"" КАК ИмяОперации,
		|	ExchDU_СписокНепроведенныхДокументов.ДокументНепроведенный КАК ОбъектДляОперации,
		|	ЕСТЬNULL(ExchDU_СписокНепроведенныхДокументов.ДокументНепроведенный.Портфель, ""Без портфеля"") КАК Портфель,
		|	ExchDU_СписокНепроведенныхДокументов.ИдентификаторПотока КАК ИдентификаторПотока
		|ПОМЕСТИТЬ ВТ_ДокНепроведенные
		|ИЗ
		|	РегистрСведений.ExchDU_СписокНепроведенныхДокументов КАК ExchDU_СписокНепроведенныхДокументов
		|ГДЕ
		|	ExchDU_СписокНепроведенныхДокументов.ИдентификаторПотока В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ExchDU_СписокДокументовДляУдаления"" КАК РегСвед,
		|	""ДокументДляУдаления"" КАК Измерение,
		|	""УдалениеДокументовПослеЗагрузки"" КАК ИмяОперации,
		|	ExchDU_СписокДокументовДляУдаления.ДокументДляУдаления КАК ОбъектДляОперации,
		|	ЕСТЬNULL(ExchDU_СписокДокументовДляУдаления.ДокументДляУдаления.Портфель, ""Без портфеля"") КАК Портфель,
		|	ExchDU_СписокДокументовДляУдаления.ИдентификаторПотока КАК ИдентификаторПотока
		|ПОМЕСТИТЬ ВТ_ДокУдаление
		|ИЗ
		|	РегистрСведений.ExchDU_СписокДокументовДляУдаления КАК ExchDU_СписокДокументовДляУдаления
		|ГДЕ
		|	ExchDU_СписокДокументовДляУдаления.ИдентификаторПотока В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ExchDU_СписокНовыхБП"" КАК РегСвед,
		|	""НовыйБП"" КАК Измерение,
		|	""ЗаписьНовыхБППослеЗагрузки"" КАК ИмяОперации,
		|	ExchDU_СписокНовыхБП.НовыйБП КАК ОбъектДляОперации,
		|	ЕСТЬNULL(ExchDU_СписокНовыхБП.НовыйБП.Портфель, ""Без портфеля"") КАК Портфель,
		|	ExchDU_СписокНовыхБП.ИдентификаторПотока КАК ИдентификаторПотока
		|ПОМЕСТИТЬ ВТ_БПНовый
		|ИЗ
		|	РегистрСведений.ExchDU_СписокНовыхБП КАК ExchDU_СписокНовыхБП
		|ГДЕ
		|	ExchDU_СписокНовыхБП.ИдентификаторПотока В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ExchDU_СписокНовыхБПдляСтарта"" КАК РегСвед,
		|	""НовыйБПДляСтарта"" КАК Измерение,
		|	""СтартНовыхБАПослеЗагрузки"" КАК ИмяОперации,
		|	ExchDU_СписокНовыхБПдляСтарта.НовыйБПДляСтарта КАК ОбъектДляОперации,
		|	ЕСТЬNULL(ExchDU_СписокНовыхБПдляСтарта.НовыйБПДляСтарта.Портфель, ""Без портфеля"") КАК Портфель,
		|	ExchDU_СписокНовыхБПдляСтарта.ИдентификаторПотока КАК ИдентификаторПотока
		|ПОМЕСТИТЬ ВТ_БПДляСтарта
		|ИЗ
		|	РегистрСведений.ExchDU_СписокНовыхБПдляСтарта КАК ExchDU_СписокНовыхБПдляСтарта
		|ГДЕ
		|	ExchDU_СписокНовыхБПдляСтарта.ИдентификаторПотока В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ExchDU_СписокНовыхЗавершенныхБП"" КАК РегСвед,
		|	""НовыйЗавершенныйБП"" КАК Измерение,
		|	""ЗавершениеНовыхБППослеЗагрузки"" КАК ИмяОперации,
		|	ExchDU_СписокНовыхЗавершенныхБП.НовыйЗавершенныйБП КАК ОбъектДляОперации,
		|	ЕСТЬNULL(ExchDU_СписокНовыхЗавершенныхБП.НовыйЗавершенныйБП.Портфель, ""Без портфеля"") КАК Портфель,
		|	ExchDU_СписокНовыхЗавершенныхБП.ИдентификаторПотока КАК ИдентификаторПотока
		|ПОМЕСТИТЬ ВТ_БПНовЗавершен
		|ИЗ
		|	РегистрСведений.ExchDU_СписокНовыхЗавершенныхБП КАК ExchDU_СписокНовыхЗавершенныхБП
		|ГДЕ
		|	ExchDU_СписокНовыхЗавершенныхБП.ИдентификаторПотока В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ExchDU_СписокНовыхБПНаУдаление"" КАК РегСвед,
		|	""НовыйБПНаУдаление"" КАК Измерение,
		|	""УдалениеНовыхБППослеЗагрузки"" КАК ИмяОперации,
		|	ExchDU_СписокНовыхБПНаУдаление.НовыйБПНаУдаление КАК ОбъектДляОперации,
		|	ЕСТЬNULL(ExchDU_СписокНовыхБПНаУдаление.НовыйБПНаУдаление.Портфель, ""Без портфеля"") КАК Портфель,
		|	ExchDU_СписокНовыхБПНаУдаление.ИдентификаторПотока КАК ИдентификаторПотока
		|ПОМЕСТИТЬ ВТ_БПУдаление
		|ИЗ
		|	РегистрСведений.ExchDU_СписокНовыхБПНаУдаление КАК ExchDU_СписокНовыхБПНаУдаление
		|ГДЕ
		|	ExchDU_СписокНовыхБПНаУдаление.ИдентификаторПотока В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ExchDU_СписокИзмененныхБП"" КАК РегСвед,
		|	""ИзменненныйБП"" КАК Измерение,
		|	""ИзменениеБППослеЗагрузки"" КАК ИмяОперации,
		|	ExchDU_СписокИзмененныхБП.ИзменненныйБП КАК ОбъектДляОперации,
		|	ЕСТЬNULL(ExchDU_СписокИзмененныхБП.ИзменненныйБП.Портфель, ""Без портфеля"") КАК Портфель,
		|	ExchDU_СписокИзмененныхБП.ИдентификаторПотока КАК ИдентификаторПотока
		|ПОМЕСТИТЬ ВТ_БПИзменен
		|ИЗ
		|	РегистрСведений.ExchDU_СписокИзмененныхБП КАК ExchDU_СписокИзмененныхБП
		|ГДЕ
		|	ExchDU_СписокИзмененныхБП.ИдентификаторПотока В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ExchDU_СписокИзмененныхБПдляСтарта"" КАК РегСвед,
		|	""ИзмененныйБПДляСтарта"" КАК Измерение,
		|	""СтартИзмененныхБППослеЗагрузки"" КАК ИмяОперации,
		|	ExchDU_СписокИзмененныхБПдляСтарта.ИзмененныйБПДляСтарта КАК ОбъектДляОперации,
		|	ЕСТЬNULL(ExchDU_СписокИзмененныхБПдляСтарта.ИзмененныйБПДляСтарта.Портфель, ""Без портфеля"") КАК Портфель,
		|	ExchDU_СписокИзмененныхБПдляСтарта.ИдентификаторПотока КАК ИдентификаторПотока,
		|	ExchDU_СписокИзмененныхБПдляСтарта.ПройденныеШаги КАК ПройденныеШаги
		|ПОМЕСТИТЬ ВТ_БПИзмененДляСтарта
		|ИЗ
		|	РегистрСведений.ExchDU_СписокИзмененныхБПдляСтарта КАК ExchDU_СписокИзмененныхБПдляСтарта
		|ГДЕ
		|	ExchDU_СписокИзмененныхБПдляСтарта.ИдентификаторПотока В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ExchDU_СписокЗавершенныхБП"" КАК РегСвед,
		|	""ЗавершенныйБП"" КАК Измерение,
		|	""ЗавершениеБППослеЗакрытия"" КАК ИмяОперации,
		|	ExchDU_СписокЗавершенныхБП.ЗавершенныйБП КАК ОбъектДляОперации,
		|	ЕСТЬNULL(ExchDU_СписокЗавершенныхБП.ЗавершенныйБП.Портфель, ""Без портфеля"") КАК Портфель,
		|	ExchDU_СписокЗавершенныхБП.ИдентификаторПотока КАК ИдентификаторПотока
		|ПОМЕСТИТЬ ВТ_БПЗавершен
		|ИЗ
		|	РегистрСведений.ExchDU_СписокЗавершенныхБП КАК ExchDU_СписокЗавершенныхБП
		|ГДЕ
		|	ExchDU_СписокЗавершенныхБП.ИдентификаторПотока В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ExchDU_СписокБПНаУдаление"" КАК РегСвед,
		|	""БПНаУдаление"" КАК Измерение,
		|	""УдалениеБППослеЗагрузки"" КАК ИмяОперации,
		|	ExchDU_СписокБПНаУдаление.БПНаУдаление КАК ОбъектДляОперации,
		|	ЕСТЬNULL(ExchDU_СписокБПНаУдаление.БПНаУдаление.Портфель, ""Без портфеля"") КАК Портфель,
		|	ExchDU_СписокБПНаУдаление.ИдентификаторПотока КАК ИдентификаторПотока
		|ПОМЕСТИТЬ ВТ_БПНаУдаление
		|ИЗ
		|	РегистрСведений.ExchDU_СписокБПНаУдаление КАК ExchDU_СписокБПНаУдаление
		|ГДЕ
		|	ExchDU_СписокБПНаУдаление.ИдентификаторПотока В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	""ExchDU_СписокСправочниковКЗагрузке"" КАК РегСвед,
		|	""СправочникКЗагрузке"" КАК Измерение,
		|	""ЗаписьСправочниковПослеЗагрузки"" КАК ИмяОперации,
		|	ExchDU_СписокСправочниковКЗагрузке.СправочникКЗагрузке КАК ОбъектДляОперации,
		|	ExchDU_СписокСправочниковКЗагрузке.ИдентификаторПотока КАК ИдентификаторПотока
		|ИЗ
		|	РегистрСведений.ExchDU_СписокСправочниковКЗагрузке КАК ExchDU_СписокСправочниковКЗагрузке
		|ГДЕ
		|	ExchDU_СписокСправочниковКЗагрузке.ИдентификаторПотока В(&МассивИдентификаторов)
		|	И НЕ ExchDU_СписокСправочниковКЗагрузке.СправочникКЗагрузке ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таб_ПоПортфелю.РегСвед КАК РегСвед,
		|	Таб_ПоПортфелю.Измерение КАК Измерение,
		|	Таб_ПоПортфелю.ИмяОперации КАК ИмяОперации,
		|	Таб_ПоПортфелю.ОбъектДляОперации КАК ОбъектДляОперации,
		|	Таб_ПоПортфелю.Портфель КАК Портфель,
		|	Таб_ПоПортфелю.ИдентификаторПотока КАК ИдентификаторПотока,
		|	Таб_ПоПортфелю.ПройденныеШаги КАК ПройденныеШаги
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_ДокДляПроведения.РегСвед КАК РегСвед,
		|		ВТ_ДокДляПроведения.Измерение КАК Измерение,
		|		ВТ_ДокДляПроведения.ИмяОперации КАК ИмяОперации,
		|		ВТ_ДокДляПроведения.ОбъектДляОперации КАК ОбъектДляОперации,
		|		ВТ_ДокДляПроведения.Портфель КАК Портфель,
		|		ВТ_ДокДляПроведения.ИдентификаторПотока КАК ИдентификаторПотока,
		|		"""" КАК ПройденныеШаги
		|	ИЗ
		|		ВТ_ДокДляПроведения КАК ВТ_ДокДляПроведения
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_ДокОтменаПроведения.РегСвед,
		|		ВТ_ДокОтменаПроведения.Измерение,
		|		ВТ_ДокОтменаПроведения.ИмяОперации,
		|		ВТ_ДокОтменаПроведения.ОбъектДляОперации,
		|		ВТ_ДокОтменаПроведения.Портфель,
		|		ВТ_ДокОтменаПроведения.ИдентификаторПотока,
		|		""""
		|	ИЗ
		|		ВТ_ДокОтменаПроведения КАК ВТ_ДокОтменаПроведения
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_ДокНепроведенные.РегСвед,
		|		ВТ_ДокНепроведенные.Измерение,
		|		ВТ_ДокНепроведенные.ИмяОперации,
		|		ВТ_ДокНепроведенные.ОбъектДляОперации,
		|		ВТ_ДокНепроведенные.Портфель,
		|		ВТ_ДокНепроведенные.ИдентификаторПотока,
		|		""""
		|	ИЗ
		|		ВТ_ДокНепроведенные КАК ВТ_ДокНепроведенные
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_ДокУдаление.РегСвед,
		|		ВТ_ДокУдаление.Измерение,
		|		ВТ_ДокУдаление.ИмяОперации,
		|		ВТ_ДокУдаление.ОбъектДляОперации,
		|		ВТ_ДокУдаление.Портфель,
		|		ВТ_ДокУдаление.ИдентификаторПотока,
		|		""""
		|	ИЗ
		|		ВТ_ДокУдаление КАК ВТ_ДокУдаление
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_БПНовый.РегСвед,
		|		ВТ_БПНовый.Измерение,
		|		ВТ_БПНовый.ИмяОперации,
		|		ВТ_БПНовый.ОбъектДляОперации,
		|		ВТ_БПНовый.Портфель,
		|		ВТ_БПНовый.ИдентификаторПотока,
		|		""""
		|	ИЗ
		|		ВТ_БПНовый КАК ВТ_БПНовый
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_БПДляСтарта.РегСвед,
		|		ВТ_БПДляСтарта.Измерение,
		|		ВТ_БПДляСтарта.ИмяОперации,
		|		ВТ_БПДляСтарта.ОбъектДляОперации,
		|		ВТ_БПДляСтарта.Портфель,
		|		ВТ_БПДляСтарта.ИдентификаторПотока,
		|		""""
		|	ИЗ
		|		ВТ_БПДляСтарта КАК ВТ_БПДляСтарта
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_БПНовЗавершен.РегСвед,
		|		ВТ_БПНовЗавершен.Измерение,
		|		ВТ_БПНовЗавершен.ИмяОперации,
		|		ВТ_БПНовЗавершен.ОбъектДляОперации,
		|		ВТ_БПНовЗавершен.Портфель,
		|		ВТ_БПНовЗавершен.ИдентификаторПотока,
		|		""""
		|	ИЗ
		|		ВТ_БПНовЗавершен КАК ВТ_БПНовЗавершен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_БПУдаление.РегСвед,
		|		ВТ_БПУдаление.Измерение,
		|		ВТ_БПУдаление.ИмяОперации,
		|		ВТ_БПУдаление.ОбъектДляОперации,
		|		ВТ_БПУдаление.Портфель,
		|		ВТ_БПУдаление.ИдентификаторПотока,
		|		""""
		|	ИЗ
		|		ВТ_БПУдаление КАК ВТ_БПУдаление
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_БПИзменен.РегСвед,
		|		ВТ_БПИзменен.Измерение,
		|		ВТ_БПИзменен.ИмяОперации,
		|		ВТ_БПИзменен.ОбъектДляОперации,
		|		ВТ_БПИзменен.Портфель,
		|		ВТ_БПИзменен.ИдентификаторПотока,
		|		""""
		|	ИЗ
		|		ВТ_БПИзменен КАК ВТ_БПИзменен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_БПИзмененДляСтарта.РегСвед,
		|		ВТ_БПИзмененДляСтарта.Измерение,
		|		ВТ_БПИзмененДляСтарта.ИмяОперации,
		|		ВТ_БПИзмененДляСтарта.ОбъектДляОперации,
		|		ВТ_БПИзмененДляСтарта.Портфель,
		|		ВТ_БПИзмененДляСтарта.ИдентификаторПотока,
		|		ВТ_БПИзмененДляСтарта.ПройденныеШаги
		|	ИЗ
		|		ВТ_БПИзмененДляСтарта КАК ВТ_БПИзмененДляСтарта
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_БПЗавершен.РегСвед,
		|		ВТ_БПЗавершен.Измерение,
		|		ВТ_БПЗавершен.ИмяОперации,
		|		ВТ_БПЗавершен.ОбъектДляОперации,
		|		ВТ_БПЗавершен.Портфель,
		|		ВТ_БПЗавершен.ИдентификаторПотока,
		|		""""
		|	ИЗ
		|		ВТ_БПЗавершен КАК ВТ_БПЗавершен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_БПНаУдаление.РегСвед,
		|		ВТ_БПНаУдаление.Измерение,
		|		ВТ_БПНаУдаление.ИмяОперации,
		|		ВТ_БПНаУдаление.ОбъектДляОперации,
		|		ВТ_БПНаУдаление.Портфель,
		|		ВТ_БПНаУдаление.ИдентификаторПотока,
		|		""""
		|	ИЗ
		|		ВТ_БПНаУдаление КАК ВТ_БПНаУдаление) КАК Таб_ПоПортфелю
		|
		|УПОРЯДОЧИТЬ ПО
		|	РегСвед,
		|	Измерение
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	ТабДокОперации = Новый ТабличныйДокумент;
	
	Спр_Результат = РезультатПакет[12];
	
	ТЗСправочники = Спр_Результат.Выгрузить();      
	
	ОбработатьСправочники(ТЗСправочники);
	
	ДокументыБП_Результат = РезультатПакет[13];
	ТЗДокументыБП = ДокументыБП_Результат.Выгрузить();	
	
	ОбработкаДокументовБПВФоне(ТЗДокументыБП);
	
	ДатаВремяОкончания = ТекущаяДата();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Лог.Вывести(ОбластьЗаголовок);
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ДатаНачала = ДатаВремяНачала;
	ОбластьШапка.Параметры.ДатаОкончания = ДатаВремяОкончания;
	Лог.Вывести(ОбластьШапка);
	
	Лог.Вывести(ТабДокОперации);
	
КонецПроцедуры

Функция ПроверятьВыполнение(МассивЗаданий)

	ТабДокЛог = Новый ТабличныйДокумент;  
	ОбластьСообщения = Макет.ПолучитьОбласть("СтрокаЛог");
	
	ВсеЗаданияВыполнены = Ложь;
		
	Пока ВсеЗаданияВыполнены = Ложь Цикл
		
		МассивУдалить = Новый Массив;
		Для Каждого Элемент из МассивЗаданий Цикл
			
			ТекущееЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Элемент);
		    Если ТекущееЗадание.Состояние=СостояниеФоновогоЗадания.Активно Тогда
		        Продолжить;
			Иначе
				МассивУдалить.Добавить(Элемент);
				
				МассивСообщений = ТекущееЗадание.ПолучитьСообщенияПользователю(Истина);
				Для каждого Сообщение Из МассивСообщений Цикл
					ОбластьСообщения.Параметры.СтрокаЛог = Сообщение.Текст;
					ТабДокЛог.Вывести(ОбластьСообщения);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;				
		
		Для Каждого Элемент из МассивУдалить Цикл
			Индекс = МассивЗаданий.Найти(Элемент);
			МассивЗаданий.Удалить(Индекс);	
		КонецЦикла;	
		
		ВсеЗаданияВыполнены = МассивЗаданий.Количество() = 0;
		
	КонецЦикла;

	Возврат ТабДокЛог;
	
КонецФункции //ПроверятьВыполнение

Процедура ОбработатьСправочники(ТЗСправочники)
	
	ExchDU_ОбработкаОбъектовПослеЗагрузки.ВыполнениеОперацийСоСправочниками(ТЗСправочники); 												
	
КонецПроцедуры 

Процедура УстановкаИдентификатораДляОбработки()
	
	ТаблицаДоступныхОбменов = ExchDU_ОбработкаОбъектовПослеЗагрузки.ДоступныеОбмены();   
	КоличествоДоступныхОбменов = ТаблицаДоступныхОбменов.Количество();
	Если КоличествоДоступныхОбменов > 0 Тогда
		СтрокаОбмен = ТаблицаДоступныхОбменов[КоличествоДоступныхОбменов-1];
		ИдентификаторОбмена = СтрокаОбмен.ИдентификаторОбмена;
	КонецЕсли;
		
КонецПроцедуры	


#КонецОбласти

Макет = ПолучитьМакет("Лог");
