////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДатаВыгрузки = ТекущаяДатаСеанса();
	Объект.ТолькоПроверенные = Истина;
	Объект.БезСтатусаОтменено = Истина;
	Объект.ТолькоПроведенные = Истина;
	Объект.ТолькоПринятыеВОбработку = Истина;
	
	ЗаполнитьПорученияНаСервере();
	
	Элементы.ПорученияСтатусФШ.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьФайловыйШлюзДляОтправкиПоручений");
	
	Элементы.БезСтатусаОтменено.Видимость = РольДоступна("Администратор");
	Элементы.ТолькоПроведенные.Видимость = РольДоступна("Администратор");
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыгрузкиПриИзменении(Элемент)
	ЗаполнитьПорученияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НадписьНомераВерсийНажатие(Элемент)
	
	Элементы.НомераВерсий.Видимость = НЕ Элементы.НомераВерсий.Видимость;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьПоручения(Команда)
	ЗаполнитьПорученияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПоручения(Команда)
	Если ЕстьПорученияДляПовторнойВыгрузки() Тогда
		Текст = "Вы отметили поручения, которые были выгружены ранее. Повторить выгрузку?";
		Ответ = Вопрос(Текст, РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВыгрузитьПерезаполнитьПорученияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеДляВыгрузки(Команда)
	Для Каждого Строка Из Объект.Поручения Цикл
		Строка.КВыгрузке = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УбратьВсеПометкиДляВыгрузки(Команда)
	Для Каждого Строка Из Объект.Поручения Цикл
		Строка.КВыгрузке = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройку(Команда)

	СохранитьНастройкуНаСервере();	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ

&НаКлиенте
Функция ЕстьПорученияДляПовторнойВыгрузки()
	Для Каждого Строка Из Объект.Поручения Цикл
		Если Строка.КВыгрузке И Строка.Выгружен Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ЗаполнитьПорученияНаСервере()
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.ВосстановитьЗначенияРеквизитовПоУмолчанию();
	мОбъект.ЗаполнитьПоручения();
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьПерезаполнитьПорученияНаСервере()
	мОбъект = РеквизитФормыВЗначение("Объект");
	ИмяСобытия = "Экспорт поручений в Луч";
	Результат = мОбъект.РезультатВыгрузкиПоручений();
	Если ЗначениеЗаполнено(Результат) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.СообщениеПользователю);
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,	Результат.Данные,
			Результат.СообщениеВЖурнал);
	Иначе
		Сообщение = "Файл сформирован";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, Сообщение);
	КонецЕсли;
	мОбъект.ЗаполнитьПоручения();
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкуНаСервере()
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.СохранитьЗначенияРеквизитовПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПорученияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДанныеСтроки = Элементы.Поручения.ДанныеСтроки(ВыбраннаяСтрока);
	Если ЗначениеЗаполнено(ДанныеСтроки.Поручение) Тогда
		ОткрытьЗначение(ДанныеСтроки.Поручение);
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ТолькоПроверенныеПриИзменении(Элемент)
	ЗаполнитьПорученияНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьНаСервере()
	
	Обработки.ЭкспортПорученийВЛуч.ОбработатьВходящиеПакетыФайловогоШлюза();
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоПроведенныеПриИзменении(Элемент)
	ЗаполнитьПорученияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура БезСтатусаОтмененоПриИзменении(Элемент)
	ЗаполнитьПорученияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоПринятыеВОбработкуПриИзменении(Элемент)
	ЗаполнитьПорученияНаСервере();
КонецПроцедуры