
Функция СведенияОВнешнейОбработке() Экспорт

    Структура = Новый Структура;
    Структура.Вставить("Вид",             "ЗаполнениеОбъекта"); //Перечисления.ВидыДополнительныхОтчетовИОбработок.НачислениеПроцентов.
    Структура.Вставить("Наименование",    "SF 14.1 Расчет вознаграждения за успех: от СЧА, вводов/выводов за период, финансового результата и среднегодовой ключевой ставки по средней СЧА");
    Структура.Вставить("Версия",          "1.13");
    Структура.Вставить("БезопасныйРежим", Ложь);  //DDneprovsky 08.07.2019 IMAPPS-8404 из этого алгоритма приходится вызывать еще один внешний отчет, этого нельзя сделать в безопасном режиме
    Структура.Вставить("Информация",      "");

    Команды = Новый ТаблицаЗначений;
    Команды.Колонки.Добавить("Идентификатор");
    Команды.Колонки.Добавить("Представление");
    Команды.Колонки.Добавить("Модификатор");
    Команды.Колонки.Добавить("ПоказыватьОповещение");
    Команды.Колонки.Добавить("Использование");

	Структура.Вставить("Команды", Команды);

    Назначение = Новый Массив;
    Назначение.Добавить("Документ.НачислениеВознаграждения");

    Структура.Вставить("Назначение", Назначение);

    Возврат Структура;

КонецФункции
 

// Функция получает размер вознаграждения
//
// Параметры:
//  ПИФ - фонд
//  Дата - дата
//  МассивПараметровФонда  - массив из параметров, для которых необходимо рассчитать вознаграждения
//  Базис - базис
//  СпособНачисления - способ начисления (значение по-умолчанию: Неопределено)
//
// Возвращаемое значение:
//  РазмерыВознаграждения = соответствие, в которое передаются размеры вознаграждений
//
Функция ПолучитьРазмерВознаграждения(ДоговорДУ, Дата, Базис, ЗначениеПараметраДоговораДУ = Неопределено)
	
	СоотВознаграждений = Новый Соответствие;
	
	ФиксСумма = Ложь;
	
	ВалютаРеглУчета = ОбщегоНазначенияДУ.ВалютаРеглУчета(ДоговорДУ);
	
	КурсКратностьРегл = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаРеглУчета, ВалютаРеглУчета, Дата);
	
	МассивПараметровДоговораДУ = Новый Массив;
	МассивПараметровДоговораДУ.Добавить(ПланыВидовХарактеристик.ПараметрыДоговораДУ.ВеличинаВознагражденияЗаУспех);
	
	Для каждого СтрокаМассива из МассивПараметровДоговораДУ Цикл
		СоотВознаграждений.Вставить(СтрокаМассива, 0);
	КонецЦикла;
	
	Для каждого СтрокаМассива из МассивПараметровДоговораДУ Цикл
		Если ЗначениеПараметраДоговораДУ = Неопределено Тогда
			Значение = УправлениеПараметрамиДоговораДУ.ПолучитьПараметрДоговораДУ(ДоговорДУ, СтрокаМассива, Дата);
		Иначе
			Значение = ЗначениеПараметраДоговораДУ;
		КонецЕсли;
		
		// может у нас от старых доков просто число пришло
		Если ТипЗнч(Значение) = Тип("Число") Тогда
			СоотВознаграждений.Вставить(СтрокаМассива,Число(Значение));
			Продолжить;
		КонецЕсли;
		
		МассивИзСтрокЛесенки = УправлениеПараметрамиДоговораДУ.РазобратьЗначениеВознаграждения(Значение);
		
		Для каждого СтрокаЛесенки из МассивИзСтрокЛесенки Цикл
			
			Добавляем = Ложь;
			Прерываем = Ложь;
			
			Если СтрокаЛесенки.ТипСравнения = "<" Тогда
				Если Базис < СтрокаЛесенки.Значение Тогда
					Добавляем = Истина;
					Прерываем = Истина;										
				КонецЕсли;
			ИначеЕсли СтрокаЛесенки.ТипСравнения = ">=" Тогда
				Если Базис >= СтрокаЛесенки.Значение Тогда
					Добавляем = Истина;
					Прерываем = Ложь;		
				КонецЕсли;
			Иначе
				Если Базис > СтрокаЛесенки.Значение Тогда
					Добавляем = Истина;
					Прерываем = Ложь;		
				КонецЕсли;
			КонецЕсли;
			
			Если Добавляем Тогда
				Если СтрокаЛесенки.Суммой Тогда
					
					Если СтрокаЛесенки.Свойство("Валюта") и СтрокаЛесенки.Валюта <> ВалютаРеглУчета Тогда
						КурсКратность = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаРеглУчета, СтрокаЛесенки.Валюта, Дата);
						
						СуммаВознаграждения = Окр(МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаЛесенки.РазмерВознаграждения,
						СтрокаЛесенки.Валюта, ВалютаРеглУчета, 
						КурсКратность.Курс, КурсКратностьРегл.Курс,
						КурсКратность.Кратность, КурсКратностьРегл.Кратность), 2);
					Иначе
						СуммаВознаграждения = СтрокаЛесенки.РазмерВознаграждения;
					КонецЕсли;
					
					СоотВознаграждений.Вставить(СтрокаМассива, Новый Структура("РазмерВознаграждения",СуммаВознаграждения));
					
				Иначе
					СоотВознаграждений.Вставить(СтрокаМассива, СтрокаЛесенки.РазмерВознаграждения);
				КонецЕсли;
			КонецЕсли;
			
			Если Прерываем Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СоотВознаграждений;
	
КонецФункции // ПолучитьРазмерВознаграждения()

Функция ПолучитьСуммуВПроцентомОтношенииКПродолжительностиПериода(НачалоПериода, КонецПериода, ТаблицаСумм)
	
	КолСтрокТаблицыСумм = ТаблицаСумм.Количество();
	
	Если КолСтрокТаблицыСумм = 0 Тогда
		Возврат 0;	
	ИначеЕсли КолСтрокТаблицыСумм = 1 Тогда
		Возврат ТаблицаСумм.Получить(0).Сумма;	
	КонецЕсли;
	
	//КонецМесяца_ 		= КонецМесяца(ДатаКонца);
	ВсегоДнейВПериоде 	= ОбщегоНазначенияДУ.КоличествоПериодов(НачалоПериода, КонецПериода, "День"); 
	
	РезультирующаяСумма = 0;
	
	Для й = 0 по КолСтрокТаблицыСумм-1 Цикл
		СтрокаТС = ТаблицаСумм.Получить(й);
		
		Если й+1 > КолСтрокТаблицыСумм-1 Тогда
			БудущийПериод 	= КонецПериода;
			СледующийДень 	= День(БудущийПериод) + 1;
		Иначе
			СледующаяСтрока = ТаблицаСумм.Получить(й+1);
			БудущийПериод 	= СледующаяСтрока.Период;
			
			СледующийДень 	= День(БудущийПериод);
		КонецЕсли;
		
		ТекущийДень 	= День(СтрокаТС.Период);
		
		ПродолжительностьПериода = СледующийДень - ТекущийДень;
		
		ДоляВПериоде = ПродолжительностьПериода/ВсегоДнейВПериоде;
		
		РезультирующаяСумма = РезультирующаяСумма + СтрокаТС.Сумма*ДоляВПериоде;
	КонецЦикла;
	
	Возврат РезультирующаяСумма;
	
КонецФункции

Функция СреднееСЧА_РСА(ДоговорДУ, ДатаНачала, ДатаОкончания, ТипДня)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СЧА", 0);
	СтруктураВозврата.Вставить("РСА", 0);
	СтруктураВозврата.Вставить("ТаблицаСЧА_РСА", Новый ТаблицаЗначений);
	СтруктураВозврата.Вставить("КоличествоДней", 0);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	ТекстЗапроса =
	 "ВЫБРАТЬ
	 |	РегистрРСА_СЧА.Период КАК Период,
	 |	РегистрРСА_СЧА.СЧА / 1000 КАК СЧА,
	 |	РегистрРСА_СЧА.ДоговорДУ КАК ДоговорДУ
	 |ПОМЕСТИТЬ ВТ_СЧАЗаПериод
	 |ИЗ
	 |	РегистрСведений.РегистрРСА_СЧА КАК РегистрРСА_СЧА
	 |ГДЕ
	 |	РегистрРСА_СЧА.ДоговорДУ = &ДоговорДУ
	 |	И РегистрРСА_СЧА.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_Среднее_СЧА.СЧА КАК СЧА,
	 |	ВТ_Среднее_СЧА.Период КАК Период
	 |ИЗ
	 |	ВТ_СЧАЗаПериод КАК ВТ_Среднее_СЧА
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	ВТ_Среднее_СЧА.Период
	 |ИТОГИ
	 |	СРЕДНЕЕ(СЧА)
	 |ПО
	 |	ВТ_Среднее_СЧА.ДоговорДУ";      
	 
	 
	 
	
	////"ВЫБРАТЬ
	////|	КалендарныеГрафики.ДатаГрафика КАК Дата
	////|ИЗ
	////|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	////|ГДЕ
	////|	КалендарныеГрафики.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.РегламентированныйКалендарь)
	////|	И КалендарныеГрафики.ДатаГрафика МЕЖДУ &ДатаНачала И &ДатаОкончания";
	//////|	И КалендарныеГрафики.ДеньВключенВГрафик";
	//Если ТипДня="КалендарныйТип" Тогда
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КалендарныеГрафики.ДеньВключенВГрафик", "ИСТИНА");
	//КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаСЧА_РСА = Новый ТаблицаЗначений;	
	ТаблицаСЧА_РСА.Колонки.Добавить("Дата");	
	ТаблицаСЧА_РСА.Колонки.Добавить("Сча");	
	Пока Выборка.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДоговорДУ
	    СтруктураВозврата.СЧА = Выборка.СЧА;
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Стр = ТаблицаСЧА_РСА.Добавить();	
			Стр.Дата = ВыборкаДетальныеЗаписи.Период;
			Стр.Сча = ВыборкаДетальныеЗаписи.СЧА;
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
		КонецЦикла;
	КонецЦикла;
	
	//ТаблицаСЧА_РСА = РегистрыСведений.РегистрРСА_СЧА.ТЗ_СЧА_РСА_НаДаты(Запрос.Выполнить().Выгрузить(), ДоговорДУ);
	//	
	//КоличествоДней = ТаблицаСЧА_РСА.Количество();
	//Если НЕ КоличествоДней=0 Тогда
	//	СтруктураВозврата.СЧА = ТаблицаСЧА_РСА.Итог("СЧА")/КоличествоДней;
	//	СтруктураВозврата.РСА = ТаблицаСЧА_РСА.Итог("РСА")/КоличествоДней;
	СтруктураВозврата.ТаблицаСЧА_РСА = ТаблицаСЧА_РСА;
	//	СтруктураВозврата.КоличествоДней = КоличествоДней;
	//КонецЕсли;
	
	Возврат СтруктураВозврата;
КонецФункции
 
Функция СправкаРасчет(СтруктураПоказателей, НачалоПериода, КонецПериода)
	
	ТабДокументШапка = Новый ТабличныйДокумент;
	ТабДокументТело = Новый ТабличныйДокумент;
	ТабДокументПодвал = Новый ТабличныйДокумент;
	
	// MPazhukov IMAPPS-12776
	//Макет = ПолучитьМакет("СправкаРасчет");
	Если НачалоПериода >= Дата("20210101") Тогда
		Макет = ПолучитьМакет("СправкаРасчет2021");		
	Иначе
		Макет = ПолучитьМакет("СправкаРасчет");	
	КонецЕсли;	
	// MPazhukov IMAPPS-12776
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьРасчет = Макет.ПолучитьОбласть("Расчет");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
	ОбластьШапка.Параметры.Заполнить(СтруктураПоказателей);
	ТабДокументШапка.Вывести(ОбластьШапка);
	
	ОбластьРасчет.Параметры.Заполнить(СтруктураПоказателей);
	ОбластьРасчет.Параметры.БВПрописью = ДенежныеСредства.ФорматироватьСуммуПрописьюПлатежногоДокумента(СтруктураПоказателей.РезультирующаяСумма, Справочники.Валюты.RUB);
	ТабДокументТело.Вывести(ОбластьРасчет);
	
	ТабДокументПодвал.Вывести(ОбластьПодвал);

////is	
//Если СтруктураПоказателей.СтруктураСЧА.ТаблицаСЧА_РСА.Количество() > 0 тогда  
//	//	Макет = ПолучитьМакет("РасшифровкаСЧА");
//		ОбластьШапкаРасшифровкаСЧА = Макет.ПолучитьОбласть("ШапкаРасшифровкиСЧА");
//        ОбластьСтрокаРасшифровкаСЧА = Макет.ПолучитьОбласть("СтрокаРасшифровкиСЧА");
//		ОбластьПодвалСЧА = Макет.ПолучитьОбласть("ПодвалСЧА");

//		ТабДокументПодвал.ВывестиГоризонтальныйРазделительСтраниц();
//		ОбластьШапкаРасшифровкаСЧА.Параметры.Клиент 		= СтруктураПоказателей.ДоговорДУ.Клиент.НаименованиеПолное;
//		ОбластьШапкаРасшифровкаСЧА.Параметры.ДатаНач 		= Формат(СтруктураПоказателей.ДатаНачала, "ДФ=dd.MM.yyyy"); 
//		ОбластьШапкаРасшифровкаСЧА.Параметры.ДатаКон 		= Формат(СтруктураПоказателей.ДатаОкончания, "ДФ=dd.MM.yyyy");  
//		ОбластьШапкаРасшифровкаСЧА.Параметры.ВалютаРасчета 	= ОбщегоНазначенияДУ.ВалютаРеглУчета(СтруктураПоказателей.ДоговорДУ);
//        ТабДокументПодвал.Вывести(ОбластьШапкаРасшифровкаСЧА);
//		ИтогоСча = 0;                       
//		Для каждого стр из СтруктураПоказателей.СтруктураСЧА.ТаблицаСЧА_РСА Цикл
//			ОбластьСтрокаРасшифровкаСЧА.Параметры.ДатаСЧА= "Стоимость чистых активов на " + Формат(стр.Дата, "ДФ=dd.MM.yyyy");
//			ОбластьСтрокаРасшифровкаСЧА.Параметры.Сумма= стр.СЧА;
//			ТабДокументПодвал.Вывести(ОбластьСтрокаРасшифровкаСЧА);

//			ИтогоСча = ИтогоСча + стр.СЧА;
//		КонецЦикла;
//		ОбластьПодвалСЧА.Параметры.СуммаСЧА = ИтогоСча;
//		ОбластьПодвалСЧА.Параметры.КоличествоДней = СтруктураПоказателей.СтруктураСЧА.КоличествоДней;
//		ОбластьПодвалСЧА.Параметры.Сча = Формат(СтруктураПоказателей.СтруктураСЧА.СЧА,"ЧДЦ=2");
//		ТабДокументПодвал.Вывести(ОбластьПодвалСЧА);

//		
//	КонецЕсли;

	
	
	Возврат Новый ХранилищеЗначения(Новый Структура("ШапкаРасчет, ТелоРасчет, ПодвалРасчет, НачалоПериода, ОкончаниеПериода", ТабДокументШапка, ТабДокументТело, ТабДокументПодвал, НачалоПериода, КонецПериода)); 
КонецФункции

Процедура  УстановитьПользовательскиеНастройки(Настройки)Экспорт
	ТаблицаКоэффициентов = XMLЗначение(Тип("ХранилищеЗначения"),Настройки.ТаблицаКоэффициентов);
КонецПроцедуры

Функция КоличествоМесяцевВПериоде(Период)
	Если Период=Перечисления.Периодичность.Месяц Тогда
		Возврат 1;
	ИначеЕсли Период=Перечисления.Периодичность.Квартал Тогда
		Возврат 3;
	ИначеЕсли Период=Перечисления.Периодичность.Декада Тогда
		Возврат 4;
	ИначеЕсли Период=Перечисления.Периодичность.Полугодие Тогда
		Возврат 6;
	ИначеЕсли Период=Перечисления.Периодичность.Год Тогда
		Возврат 12;
	Иначе
		Возврат 3; //По умолчанию используем период Квартал
	КонецЕсли;
КонецФункции

Функция ГраницыПериодаРасчета(СтруктураПараметров)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("РасчетнаяДатаНачала", Дата(1, 1, 1));
	СтруктураВозврата.Вставить("РасчетнаяДатаОкончания", Дата(1, 1, 1));
	СтруктураВозврата.Вставить("КоличествоДнейВГоду", 0);
	КоличествоМесяцевВПериоде = КоличествоМесяцевВПериоде(СтруктураПараметров.НастройкиАлгоритма.Периодичность);
	//СтруктураДоговораДУ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтруктураПараметров.ДоговорДУ, "ДатаВводаСредствВДУ, ДатаНачала, ДатаОкончания");
	//Определение начала периода расчета
	
	//Корректировка по типу периода
	Если СтруктураПараметров.НастройкиАлгоритма.ТипПериода="Календарный" Тогда
		НачальнаяДата    =  НачалоГода(СтруктураПараметров.ДатаДокумента);
	Иначе //Инвестиционный
		Если СтруктураПараметров.НастройкиАлгоритма.ДатаНачалаРасчета="ДатаПодписанияДоговора" Тогда
			НачальнаяДата = СтруктураПараметров.СтруктураДоговораДУ.ДатаНачала;   
		Иначе
			НачальнаяДата = СтруктураПараметров.СтруктураДоговораДУ.ДатаВводаСредствВДУ; 
		КонецЕсли;
	КонецЕсли;
	//НачальнаяДата = ?(ЗначениеЗаполнено(СтруктураПараметров.НастройкиАлгоритма.ДатаНачалаРасчета), СтруктураПараметров.НастройкиАлгоритма.ДатаНачалаРасчета, СтруктураПараметров.ДатаВводаСредствВДУ);
	
	КоличествоМесяцев = ОбщегоНазначенияДУ.КоличествоПериодов(НачальнаяДата, СтруктураПараметров.ДатаДокумента, "Месяц")-1;
	//Если День(НачальнаяДата)>День(СтруктураПараметров.ДатаДокумента) Тогда
	//	КоличествоМесяцев=КоличествоМесяцев-1;
	//КонецЕсли;
	ПрошедшиеПериоды  = Цел(КоличествоМесяцев/КоличествоМесяцевВПериоде)*КоличествоМесяцевВПериоде;
	РасчетнаяДатаНачала = НачалоДня(ОбщегоНазначенияДУ.ДобавитьКДате(НачальнаяДата, "Месяц", ПрошедшиеПериоды));
	//Корректировка дат от периода договора
	Если СтруктураПараметров.НастройкиАлгоритма.ДатаНачалаРасчета="ДатаПодписанияДоговора" Тогда
		РасчетнаяДатаНачала = НачалоДня(Макс(РасчетнаяДатаНачала, СтруктураПараметров.СтруктураДоговораДУ.ДатаНачала));   
	Иначе
		РасчетнаяДатаНачала = НачалоДня(Макс(РасчетнаяДатаНачала,СтруктураПараметров.СтруктураДоговораДУ.ДатаВводаСредствВДУ)); 
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураПараметров.СтруктураДоговораДУ.ДатаОкончания) Тогда
		РасчетнаяДатаОкончания = КонецДня(Мин(СтруктураПараметров.ДатаДокумента, СтруктураПараметров.СтруктураДоговораДУ.ДатаОкончания));
	Иначе
		РасчетнаяДатаОкончания = КонецДня(СтруктураПараметров.ДатаДокумента);
	КонецЕсли;
	
	
	//Определение количества дней в расчитываемом году для дальнейших расчетов
	ДельтаЛет = Цел(КоличествоМесяцев/12);
	НачалоРасчетногоГода = ОбщегоНазначенияДУ.ДобавитьКДате(НачальнаяДата, "Год", ДельтаЛет);
	КонецРасчетногоГода  = ОбщегоНазначенияДУ.ДобавитьКДате(НачальнаяДата, "Год", ДельтаЛет+1)-1;
	КоличествоДнейВГоду = ОбщегоНазначенияДУ.КоличествоПериодов(НачалоРасчетногоГода, КонецРасчетногоГода, "День");
	
	//Заполнение структуры возврата
	СтруктураВозврата.РасчетнаяДатаНачала    = РасчетнаяДатаНачала;
	СтруктураВозврата.РасчетнаяДатаОкончания = РасчетнаяДатаОкончания;
	СтруктураВозврата.КоличествоДнейВГоду  = КоличествоДнейВГоду;
	
	Сообщить("СтруктураПараметров.ДатаДокумента: " + СтруктураПараметров.ДатаДокумента);
	Сообщить("НачальнаяДата: " + НачальнаяДата);
	Сообщить("КоличествоМесяцев: " + КоличествоМесяцев);
	Сообщить("ДельтаЛет: " + ДельтаЛет);
	Сообщить("НачалоРасчетногоГода: " + НачалоРасчетногоГода);
	Сообщить("КонецРасчетногоГода: " + КонецРасчетногоГода);
	
	Сообщить("СтруктураВозврата.РасчетнаяДатаНачала: " + СтруктураВозврата.РасчетнаяДатаНачала);
	Сообщить("СтруктураВозврата.РасчетнаяДатаОкончания: " + СтруктураВозврата.РасчетнаяДатаОкончания);
	
	
	Возврат СтруктураВозврата;
КонецФункции

Функция РезультатРасчета(ПользовательскиеНастройки, СтруктураПараметров) Экспорт
	Перем СтруктураВозврата;
	
	//Начальная проверка существования нужных настроек расчета
	Если ПользовательскиеНастройки=Неопределено Тогда
		ОбщегоНазначенияДУКлиентСервер.СообщитьОбОшибке("Отсутствуют настройки алгоритма");
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура(
		"СуммаВознаграждения, СтавкаВознаграждения, БРСА, СправкаРасчет",
		0,
		0,
		0,
		Новый ХранилищеЗначения(Новый Структура("ШапкаРасчет, ТелоРасчет, ПодвалРасчет, НачалоПериода, ОкончаниеПериода", Новый ТабличныйДокумент(), Новый ТабличныйДокумент(), Новый ТабличныйДокумент()))
	);
	
	СтруктураПараметровДУ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтруктураПараметров.ДоговорДУ, "ДатаВводаСредствВДУ, ДатаНачала, ДатаОкончания, Код");
	ПВХ = ПланыВидовХарактеристик.ПараметрыДоговораДУ;
	
	//Определение границ периода
	СтруктураПараметровПериода = Новый Структура;
	СтруктураПараметровПериода.Вставить("ДатаДокумента"     , СтруктураПараметров.Дата); 
	СтруктураПараметровПериода.Вставить("СтруктураДоговораДУ", СтруктураПараметровДУ);
	СтруктураПараметровПериода.Вставить("НастройкиАлгоритма", ПользовательскиеНастройки.Значения);
	
	СтруктураПериодаРасчета = ГраницыПериодаРасчета(СтруктураПараметровПериода);
	НачалоПериода = СтруктураПериодаРасчета.РасчетнаяДатаНачала;
	КонецПериода  = СтруктураПериодаРасчета.РасчетнаяДатаОкончания;
	ДнейВГоду     = СтруктураПериодаРасчета.КоличествоДнейВГоду;
	// DDneprovsky
	КоличествоДнейВРасчетномПериоде = ОбщегоНазначенияДУ.КоличествоПериодов(НачалоПериода, КонецПериода, "День");
	// DDneprovsky
	
		
	Если СтруктураПериодаРасчета.РасчетнаяДатаНачала > СтруктураПериодаРасчета.РасчетнаяДатаОкончания Тогда
		Возврат СтруктураВозврата;  // IMAPPS-7531
	КонецЕсли;
	
	СЧА0 = РегистрыСведений.РегистрРСА_СЧА.ЗначенияСЧА_РСА(НачалоГода(НачалоПериода) - 1, СтруктураПараметров.ДоговорДУ).СЧА;
	СтруктураВыводВыводы = ПолучитьВводыВыводы(СтруктураПараметров.ДоговорДУ, НачалоПериода, КонецПериода);
	СЧА = РегистрыСведений.РегистрРСА_СЧА.ЗначенияСЧА_РСА(КонецПериода, СтруктураПараметров.ДоговорДУ).СЧА;
		
	Базис = СЧА0;
	ВеличинаВознаграждения = УправлениеПараметрамиДоговораДУ.ПолучитьПараметрДоговораДУ(СтруктураПараметров.ДоговорДУ, ПВХ.ВеличинаВознагражденияЗаУспех, СтруктураПараметров.Дата);
	РазмерыВознаграждения = ПолучитьРазмерВознаграждения(СтруктураПараметров.ДоговорДУ, СтруктураПараметров.Дата, Базис, ВеличинаВознаграждения);
	СтруктураПроцент = РазмерыВознаграждения.Получить(ПВХ.ВеличинаВознагражденияЗаУспех);
	
	Если ТипЗнч(СтруктураПроцент) = Тип("Структура") Тогда
		//ЗначениеЛесенки = СтруктураПроцент.РазмерВознаграждения;
		//РезультирующаяСумма = ЗначениеЛесенки;
		Возврат	Неопределено
	КонецЕсли;
	
	ЗначениеЛесенки = СтруктураПроцент;
	СреднееСЧА_РСА = СреднееСЧА_РСА(СтруктураПараметров.ДоговорДУ,НачалоПериода,КонецПериода,"КалендарныйТип");
	//Сообщить("СЧА: " + СреднееСЧА_РСА.СЧА);	
	Если СтруктураПараметровПериода.НастройкиАлгоритма.Свойство("ТаблицаКоэффициентов") Тогда 
	//	Сообщить(СтруктураПараметровПериода.НастройкиАлгоритма.ТаблицаКоэффициентов);
		ТаблицаКоэфициентовХранилище = XMLЗначение(Тип("ХранилищеЗначения"),СтруктураПараметровПериода.НастройкиАлгоритма.ТаблицаКоэффициентов).Получить(); 
		//Для каждого стр из ТаблицаКоэфициентовХранилище Цикл
		//	Сообщить ("Мин " + стр.МинГраница + " макс " + стр.МаксГраница + " Коэф " + стр.Коэффициент)
		//КонецЦикла;
		//ТаблицаКоэффициентов = XMLЗначение(Тип("ХранилищеЗначения"),СтруктураПараметровПериода.НастройкиАлгоритма.ТаблицаКоэффициентов); 
		Сообщить(ТипЗнч(ТаблицаКоэффициентов));
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЗ.МинГраница,
			|	ТЗ.МаксГраница,
			|	ТЗ.Коэффициент
			|ПОМЕСТИТЬ Данные
			|ИЗ
			|	&ТЗ КАК ТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Данные.Коэффициент
			|ИЗ
			|	Данные КАК Данные
			|ГДЕ
			|	Данные.МинГраница <= &СуммаСЧА
			|	И Данные.МаксГраница >= &СуммаСЧА";

			//"ВЫБРАТЬ
			//|	ТЗ.МинГраница,
			//|	ТЗ.МаксГраница,
			//|	ТЗ.Коэффициент
			//|ПОМЕСТИТЬ Данные
			//|ИЗ
			//|	&ТЗ КАК ТЗ
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	МАКСИМУМ(Данные.МинГраница) КАК МинГраница
			//|ПОМЕСТИТЬ МаксМинГраница
			//|ИЗ
			//|	Данные КАК Данные
			//|ГДЕ
			//|	Данные.МинГраница <= &СуммаСЧА
			//|	И Данные.МаксГраница >= &СуммаСЧА
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	Данные.Коэффициент,
			//|	Данные.МинГраница,
			//|	Данные.МаксГраница
			//|ИЗ
			//|	МаксМинГраница КАК МаксМинГраница
			//|		ПОЛНОЕ СОЕДИНЕНИЕ Данные КАК Данные
			//|		ПО МаксМинГраница.МинГраница = Данные.МинГраница";
		
		Запрос.УстановитьПараметр("СуммаСЧА", СреднееСЧА_РСА.СЧА*1000);
		Запрос.УстановитьПараметр("ТЗ", ТаблицаКоэфициентовХранилище);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
			Сообщить("СЧА: " + СреднееСЧА_РСА.СЧА);    
			//Сообщить ("Мин " + ВыборкаДетальныеЗаписи.МинГраница + " макс " + ВыборкаДетальныеЗаписи.МаксГраница + " Коэф " + ВыборкаДетальныеЗаписи.Коэффициент);
			Процент =  ВыборкаДетальныеЗаписи.Коэффициент;   
			Сообщить("Процент " + Процент); 
		Иначе
			Сообщить("Не заполнена таблица коэфицентов по договору",СтатусСообщения.Важное);
		КонецЕсли;
	Иначе
		Процент = ЗначениеЛесенки;
	КонецЕсли;	
	КлючеваяСтавка = ПолучитьСреднегодовуюКлючевуюСтавку(НачалоПериода, КонецПериода);
		
	МассивДоговоровДУ = Новый Массив;
	МассивДоговоровДУ.Добавить(СтруктураПараметров.ДоговорДУ);
	
	// IMAPPS-7621: коррекция на рабочий день
	НачалоПериодаРД = НачалоПериода;
	Если КалендарныеГрафики.ПолучитьСледующуюРабочуюДату(, НачалоПериода - 24 * 60 * 60, 0) = Неопределено Тогда
		НачалоПериодаРД = КалендарныеГрафики.ПолучитьСледующуюРабочуюДату(, НачалоПериода, -1);
	КонецЕсли;
	
	//ТаблицаTWR = Отчеты.ДоходностьПортфеляMWR_TWR.РасчетДоходностиTWR(НачалоПериодаРД, КонецПериода, МассивДоговоровДУ, Справочники.Валюты.RUB, Ложь); //IMAPPS-8404
	//TWR = Окр(ТаблицаTWR.Итог("ДоходностьTWR"), 2);  // IMAPPS-7621
	
	//TWR = ?(ДнейВГоду = 0, 0, Окр(ТаблицаTWR.Итог("ДоходностьTWR") * 365 / ДнейВГоду, 2));  // IMAPPS-7621
	// DDneprovsky 08.07.2019 IMAPPS-8404
	АлгоритмРасчетаДоходностиTWR_Ссылка = РегистрыСведений.УниверсальныеСопоставления.ПрочитатьПрямоеСопоставление(Перечисления.КонтекстСопоставления.ДоговорДУ, Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка(), "SF14_РасчетДоходностиTWR", Ложь); 
	АлгоритмРасчетаДоходностиTWR_Объект = ДополнительныеОтчетыИОбработки.ПолучитьОбъектВнешнейОбработки(АлгоритмРасчетаДоходностиTWR_Ссылка);
	ТаблицаTWR = АлгоритмРасчетаДоходностиTWR_Объект.РасчетДоходностиTWR(СтруктураПараметров.ДоговорДУ, НачалоПериода, КонецПериода);
	ДоходностьTWR = 0;
	Если ТаблицаTWR.Количество() > 0 Тогда
		ДоходностьTWR = ТаблицаTWR[ТаблицаTWR.Количество() - 1].ДоходностьTWR;
	КонецЕсли;
	TWR = ДоходностьTWR;
	// DDneprovsky 08.07.2019 IMAPPS-8404
	
	ПФР = СЧА - СЧА0 - СтруктураВыводВыводы.СуммаВводов + СтруктураВыводВыводы.СуммаВыводов;
	Если ПФР < 0 Тогда
		РезультирующаяСумма = 0;
		ВУ1 = 0;
		ВУ2 = 0;
		БФР = 0;
		РанееНачислено = ПолучитьНачисленноеВознаграждение(СтруктураПараметров.ДоговорДУ, НачалоПериода, КонецПериода);
		
		Если -ПФР < РанееНачислено /2 Тогда
			КВозвр = -ПФР;
		Иначе
		    КВозвр = РанееНачислено /2;
		КонецЕсли;
	Иначе
		Если TWR <= КлючеваяСтавка Тогда
			РезультирующаяСумма = Окр(Процент / 100 * ПФР, 2);
			ВУ1 = РезультирующаяСумма; 
			ВУ2 = 0;
			БФР = 0;
		Иначе
			// MPazhukov IMAPPS-12776
			Если НачалоПериода >= Дата("20210101") Тогда
				Сообщить("TWR > Ключевой ставки");
				Сообщить("СЧА = " + СЧА);
				Сообщить("СЧА0 = " + СЧА0);
				Сообщить("Сумма вводов = " + СтруктураВыводВыводы.ТаблицаВводов.Итог("Сумма"));
				Сообщить("Сумма выводов = " + СтруктураВыводВыводы.ТаблицаВыводов.Итог("Сумма"));
				Сообщить("БФР = (КлючеваяСтавка / 100) * КоличествоДнейВРасчетномПериоде / ДнейВГоду * (СЧА0 + (СуммаВводов - СуммаВыводов) / ДнейВГоду)");
				Сообщить("БФР = (" + КлючеваяСтавка + "/ 100) * " + КоличествоДнейВРасчетномПериоде +" / " + ДнейВГоду + " * (" + СЧА0 + " + (" + СтруктураВыводВыводы.ТаблицаВводов.Итог("Сумма") + " - " + СтруктураВыводВыводы.ТаблицаВыводов.Итог("Сумма") + ") / " + ДнейВГоду + " )");
				
				БФР = Окр((КлючеваяСтавка / 100) * КоличествоДнейВРасчетномПериоде / ДнейВГоду * (СЧА0 + (СтруктураВыводВыводы.ТаблицаВводов.Итог("Сумма") - СтруктураВыводВыводы.ТаблицаВыводов.Итог("Сумма")) / ДнейВГоду), 2);//Базовый Финансовый Результат
				РезультирующаяСумма = Окр(Процент / 100 * БФР + (Процент*10/100 * (ПФР - БФР)), 2);
				Сообщить("ВУ2 = Процент / 100 * БФР + (Процент/100 * (ПФР - БФР)");
				Сообщить("ВУ2 = " + Процент + "/ 100 * " + БФР + "+ ("+Процент*10+"/100 * (" + ПФР +  " - " + БФР + "))");
				ВУ1 = 0;
				ВУ2 = РезультирующаяСумма;
				
				// MPazhukov IMAPPS-10416
				ДопДанные = новый Структура;
				ДопДанные.Вставить("ЕстьРасшифровка", Истина);
				ДопДанные.Вставить("БФР", "БФР = (" + КлючеваяСтавка + "/ 100) * " + КоличествоДнейВРасчетномПериоде +" / " + ДнейВГоду + " * (" + СЧА0 + " + (" + СтруктураВыводВыводы.ТаблицаВводов.Итог("Сумма") + " - " + СтруктураВыводВыводы.ТаблицаВыводов.Итог("Сумма") + ") / " + ДнейВГоду + " )");
				ДопДанные.Вставить("ВУ2", "ВУ2 = " + Процент + "/ 100 * " + БФР + "+ ("+Процент*10+"/100 * (" + ПФР +  " - " + БФР + "))");    
				// MPazhukov IMAPPS-10416
			Иначе
				Сообщить("TWR > Ключевой ставки");
				Сообщить("СЧА = " + СЧА);
				Сообщить("СЧА0 = " + СЧА0);
				Сообщить("Сумма вводов = " + СтруктураВыводВыводы.ТаблицаВводов.Итог("Сумма"));
				Сообщить("Сумма выводов = " + СтруктураВыводВыводы.ТаблицаВыводов.Итог("Сумма"));
				Сообщить("БФР = (КлючеваяСтавка / 100) * КоличествоДнейВРасчетномПериоде / ДнейВГоду * (СЧА0 + (СуммаВводов - СуммаВыводов) / ДнейВГоду)");
				Сообщить("БФР = (" + КлючеваяСтавка + "/ 100) * " + КоличествоДнейВРасчетномПериоде +" / " + ДнейВГоду + " * (" + СЧА0 + " + (" + СтруктураВыводВыводы.ТаблицаВводов.Итог("Сумма") + " - " + СтруктураВыводВыводы.ТаблицаВыводов.Итог("Сумма") + ") / " + ДнейВГоду + " )");
				
				БФР = Окр((КлючеваяСтавка / 100) * КоличествоДнейВРасчетномПериоде / ДнейВГоду * (СЧА0 + (СтруктураВыводВыводы.ТаблицаВводов.Итог("Сумма") - СтруктураВыводВыводы.ТаблицаВыводов.Итог("Сумма")) / ДнейВГоду), 2);//Базовый Финансовый Результат
				РезультирующаяСумма = Окр(Процент / 100 * БФР + (Процент*10/100 * (ПФР - БФР)), 2);
				Сообщить("ВУ2 = Процент / 100 * БФР + (8/100 * (ПФР - БФР)");
				Сообщить("ВУ2 = " + Процент + "/ 100 * " + БФР + "+ ("+Процент*10+"/100 * (" + ПФР +  " - " + БФР + "))");
				ВУ1 = 0;
				ВУ2 = РезультирующаяСумма;
				
				// MPazhukov IMAPPS-10416
				ДопДанные = новый Структура;
				ДопДанные.Вставить("ЕстьРасшифровка", Истина);
				ДопДанные.Вставить("БФР", "БФР = (" + КлючеваяСтавка + "/ 100) * " + КоличествоДнейВРасчетномПериоде +" / " + ДнейВГоду + " * (" + СЧА0 + " + (" + СтруктураВыводВыводы.ТаблицаВводов.Итог("Сумма") + " - " + СтруктураВыводВыводы.ТаблицаВыводов.Итог("Сумма") + ") / " + ДнейВГоду + " )");
				ДопДанные.Вставить("ВУ2", "ВУ2 = " + Процент + "/ 100 * " + БФР + "+ ("+Процент*10+"/100 * (" + ПФР +  " - " + БФР + "))");    
				// MPazhukov IMAPPS-10416				
			КонецЕсли;
			// MPazhukov IMAPPS-12776
		КонецЕсли;
		КВозвр = 0;
		Сообщить(ДнейВГоду);
	КонецЕсли;
	
	ПоказателиСправки = Новый Структура;
	ПоказателиСправки.Вставить("ДатаНачала", Формат(НачалоПериода, "ДФ='dd MMMM yyyy ""г.""'"));
	ПоказателиСправки.Вставить("ДатаОкончания", Формат(КонецПериода, "ДФ='dd MMMM yyyy ""г.""'"));
	ПоказателиСправки.Вставить("Ставка", КлючеваяСтавка);
	ПоказателиСправки.Вставить("TWR", TWR);
	ПоказателиСправки.Вставить("СЧА0", СЧА0);
	ПоказателиСправки.Вставить("СуммаВводов", СтруктураВыводВыводы.СуммаВводов);
	ПоказателиСправки.Вставить("СуммаВыводов", СтруктураВыводВыводы.СуммаВыводов);
	ПоказателиСправки.Вставить("СЧА", СЧА);
	ПоказателиСправки.Вставить("ПФР", ПФР);
	ПоказателиСправки.Вставить("ВУ1", ВУ1);
	ПоказателиСправки.Вставить("ВУ1", ВУ1);
	ПоказателиСправки.Вставить("БФР", БФР);
	ПоказателиСправки.Вставить("ВУ2", ВУ2);
	ПоказателиСправки.Вставить("КВозвр", КВозвр);
	ПоказателиСправки.Вставить("РезультирующаяСумма", РезультирующаяСумма);
	
	ПоказателиСправки.Вставить("Б",Процент);
	ПоказателиСправки.Вставить("Б10",Процент*10);
	ПоказателиСправки.Вставить("СтруктураСЧА",СреднееСЧА_РСА);
	ПоказателиСправки.Вставить("ССЧА",СреднееСЧА_РСА.СЧА*1000);
    ПоказателиСправки.Вставить("ДоговорДУ",СтруктураПараметров.ДоговорДУ);
	
	СтруктураВозврата.СуммаВознаграждения	 = РезультирующаяСумма;
	СтруктураВозврата.СправкаРасчет			 = СправкаРасчет(ПоказателиСправки, НачалоПериода, КонецПериода);
	СтруктураВозврата.СтавкаВознаграждения	 = ЗначениеЛесенки; //по последнему значению
	СтруктураВозврата.БРСА					 = 0;
	ОтчетРасшифровка = СформироватьРасшифровкуРасчету(ПоказателиСправки, НачалоПериода, КонецПериода, СтруктураПараметров.ДоговорДУ, ДопДанные);
	СтруктураВозврата.Вставить("ОтчетРасшифровка", Новый ХранилищеЗначения(ОтчетРасшифровка));
	
	Возврат СтруктураВозврата;
КонецФункции

Функция ПолучитьПодписанта(Контрагент, Роль = Неопределено)
	
	СписокРолей = Новый Массив;
	
	Если Роль = Неопределено Тогда
		СписокРолей.Добавить(Справочники.РолиКонтактныхЛиц.Руководитель);
	Иначе
		СписокРолей.Добавить(Роль);
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КонтактныеЛица.Ссылка,
	               |	КонтактныеЛица.Имя,
	               |	КонтактныеЛица.Фамилия,
	               |	КонтактныеЛица.Отчество,
	               |	КонтактныеЛица.Должность,
	               |	КонтактныеЛица.Основание
	               |ИЗ
	               |	Справочник.КонтактныеЛица КАК КонтактныеЛица
	               |ГДЕ
	               |	КонтактныеЛица.Владелец = &УК
	               |	И КонтактныеЛица.ПометкаУдаления = ЛОЖЬ
	               |	И КонтактныеЛица.Роль В(&СписокРолей)";
	Запрос.УстановитьПараметр("УК", Контрагент);
	Запрос.УстановитьПараметр("СписокРолей", СписокРолей);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураВозвр = Новый Структура;
		СтруктураВозвр.Вставить("ФИО", Лев(Выборка.Имя, 1) + "." + Лев(Выборка.Отчество, 1) + "." + " " + Выборка.Фамилия);
		СтруктураВозвр.Вставить("Должность", Выборка.Должность + ?(ЗначениеЗаполнено(Выборка.Основание), Символы.ПС + "по " + НРег(СокрЛП(Выборка.Основание)), ""));
		Возврат СтруктураВозвр
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВводыВыводы(ДоговорДУ, НачалоПериода, КонецПериода)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВводыВыводыДУ.Период, ДЕНЬ) КАК Период,
	|	СУММА(ВводыВыводыДУ.Сумма) КАК ОборотСумма
	|ИЗ
	|	РегистрНакопления.ВводыВыводыДУ КАК ВводыВыводыДУ
	|ГДЕ
	|	ВводыВыводыДУ.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВводыВыводыДУ.ДоговорДУ = &ДоговорДУ
	|	И ВводыВыводыДУ.Сумма > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВводыВыводыДУ.Период, ДЕНЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|ИТОГИ
	|	СУММА(ОборотСумма)
	|ПО
	|	Период ПЕРИОДАМИ(ДЕНЬ, &ДатаНачала, &ДатаОкончания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВводыВыводыДУ.Период, ДЕНЬ) КАК Период,
	|	СУММА(-1 * ВводыВыводыДУ.Сумма) КАК ОборотСумма
	|ИЗ
	|	РегистрНакопления.ВводыВыводыДУ КАК ВводыВыводыДУ
	|ГДЕ
	|	ВводыВыводыДУ.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВводыВыводыДУ.ДоговорДУ = &ДоговорДУ
	|	И ВводыВыводыДУ.Сумма < 0
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВводыВыводыДУ.Период, ДЕНЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|ИТОГИ
	|	СУММА(ОборотСумма)
	|ПО
	|	Период ПЕРИОДАМИ(ДЕНЬ, &ДатаНачала, &ДатаОкончания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВводыВыводыДУОбороты.СуммаОборот > 0
	|					ТОГДА ВводыВыводыДУОбороты.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК СуммаПриход,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ВводыВыводыДУОбороты.СуммаОборот < 0
	|					ТОГДА -ВводыВыводыДУОбороты.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК СуммаРасход
	|ИЗ
	|	РегистрНакопления.ВводыВыводыДУ.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ДоговорДУ = &ДоговорДУ) КАК ВводыВыводыДУОбороты";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецПериода);
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[2].Выбрать();
	Выборка.Следующий();
	
	ТаблицаВводов = Новый ТаблицаЗначений();
	ТаблицаВводов.Колонки.Добавить("Период", ОбщегоНазначенияДУКлиентСервер.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	ТаблицаВводов.Колонки.Добавить("Сумма", ОбщегоНазначенияДУКлиентСервер.ПолучитьОписаниеТиповЧисла(19, 2));
			
	НакопительнаяСумма = 0;
	ВыборкаВводов = Результат[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ");
	Пока ВыборкаВводов.Следующий() Цикл
		НакопительнаяСумма = НакопительнаяСумма + ?(ВыборкаВводов.ОборотСумма = Null, 0, ВыборкаВводов.ОборотСумма);
		
		СтрокаВвод = ТаблицаВводов.Добавить();
		СтрокаВвод.Период	 = ВыборкаВводов.Период;
		СтрокаВвод.Сумма	 = НакопительнаяСумма;
		
	КонецЦикла;
		
	ТаблицаВыводов = Новый ТаблицаЗначений();
	ТаблицаВыводов.Колонки.Добавить("Период", ОбщегоНазначенияДУКлиентСервер.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	ТаблицаВыводов.Колонки.Добавить("Сумма", ОбщегоНазначенияДУКлиентСервер.ПолучитьОписаниеТиповЧисла(19, 2));
	
	НакопительнаяСумма = 0;
	ВыборкаВыводов = Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ");
	Пока ВыборкаВыводов.Следующий() Цикл
		НакопительнаяСумма = НакопительнаяСумма + ?(ВыборкаВыводов.ОборотСумма = Null, 0, ВыборкаВыводов.ОборотСумма);
		
		СтрокаВыводов = ТаблицаВыводов.Добавить();
		СтрокаВыводов.Период = ВыборкаВыводов.Период;
		СтрокаВыводов.Сумма	 = НакопительнаяСумма;
		
	КонецЦикла;
	
	Возврат Новый Структура("СуммаВводов, СуммаВыводов, ТаблицаВводов, ТаблицаВыводов", Выборка.СуммаПриход, Выборка.СуммаРасход, ТаблицаВводов, ТаблицаВыводов);
КонецФункции

Функция ПолучитьСреднегодовуюКлючевуюСтавку(НачалоПериода, КонецПериода)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&ДатаНачалаГода КАК Период,
		|	СтавкиРефинансированияСрезПоследних.Ставка
		|ИЗ
		|	РегистрСведений.СтавкиРефинансирования.СрезПоследних(&ДатаНачалаГода, ) КАК СтавкиРефинансированияСрезПоследних
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СтавкиРефинансирования.Период,
		|	СтавкиРефинансирования.Ставка
		|ИЗ
		|	РегистрСведений.СтавкиРефинансирования КАК СтавкиРефинансирования
		|ГДЕ
		|	СтавкиРефинансирования.Период МЕЖДУ &ДатаНачалаГода И &ДатаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("ДатаНачалаГода", НачалоГода(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецПериода);
	
	ТаблСтавокРефинансирования = Запрос.Выполнить().Выгрузить();
	
	Если ТаблСтавокРефинансирования.Количество() = 0 Тогда
		Возврат 0
	Иначе
		СуммаПроизведение = 0;
		
		ТекДата = ТаблСтавокРефинансирования[0].Период;
		ТекСтавка = ТаблСтавокРефинансирования[0].Ставка;
		
		Для Н = 1 По ТаблСтавокРефинансирования.Количество() - 1 Цикл
			СуммаПроизведение = СуммаПроизведение + (ТаблСтавокРефинансирования[Н].Период - ТекДата) * ТекСтавка;
			ТекДата = ТаблСтавокРефинансирования[Н].Период;
			ТекСтавка = ТаблСтавокРефинансирования[Н].Ставка;
		КонецЦикла;
		
		СуммаПроизведение = СуммаПроизведение + ((КонецПериода + 1) - ТекДата) * ТекСтавка;
		КоличествоДней = ((КонецПериода + 1) - НачалоГода(НачалоПериода));
				
		Возврат Окр(СуммаПроизведение/КоличествоДней, 2);
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНачисленноеВознаграждение(ДоговорДУ, НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОбороты.СуммаОборотКт КАК Сумма
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНачала, &ДатаОкончания, , Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетВознаграждениеУКЗаУправление), , ДоговорДУ = &ДоговорДУ, , ) КАК ХозрасчетныйОбороты";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецГода(КонецПериода));
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Сумма
	
КонецФункции

// MPazhukov IMAPPS-10416
Функция СформироватьРасшифровкуРасчету(СтруктураПоказателей, НачалоПериода, КонецПериода, ДоговорДУ, ДопДанные)
    Макет = ПолучитьМакет("СправкаРасчет2021");		
	ТабДокументПодвал = Новый ТабличныйДокумент;

	//is	
	Если СтруктураПоказателей.СтруктураСЧА.ТаблицаСЧА_РСА.Количество() > 0 тогда  
	//	Макет = ПолучитьМакет("РасшифровкаСЧА");
		ОбластьШапкаРасшифровкаСЧА = Макет.ПолучитьОбласть("ШапкаРасшифровкиСЧА");
        ОбластьСтрокаРасшифровкаСЧА = Макет.ПолучитьОбласть("СтрокаРасшифровкиСЧА");
		ОбластьПодвалСЧА = Макет.ПолучитьОбласть("ПодвалСЧА");

		ТабДокументПодвал.ВывестиГоризонтальныйРазделительСтраниц();
		ОбластьШапкаРасшифровкаСЧА.Параметры.Клиент 		= СтруктураПоказателей.ДоговорДУ.Клиент.НаименованиеПолное;
		ОбластьШапкаРасшифровкаСЧА.Параметры.ДатаНач 		= Формат(СтруктураПоказателей.ДатаНачала, "ДФ=dd.MM.yyyy"); 
		ОбластьШапкаРасшифровкаСЧА.Параметры.ДатаКон 		= Формат(СтруктураПоказателей.ДатаОкончания, "ДФ=dd.MM.yyyy");  
		ОбластьШапкаРасшифровкаСЧА.Параметры.ВалютаРасчета 	= ОбщегоНазначенияДУ.ВалютаРеглУчета(СтруктураПоказателей.ДоговорДУ);
        ТабДокументПодвал.Вывести(ОбластьШапкаРасшифровкаСЧА);
		ИтогоСча = 0;                       
		Для каждого стр из СтруктураПоказателей.СтруктураСЧА.ТаблицаСЧА_РСА Цикл
			ОбластьСтрокаРасшифровкаСЧА.Параметры.ДатаСЧА= "Стоимость чистых активов на " + Формат(стр.Дата, "ДФ=dd.MM.yyyy");
			ОбластьСтрокаРасшифровкаСЧА.Параметры.Сумма= стр.СЧА;
			ТабДокументПодвал.Вывести(ОбластьСтрокаРасшифровкаСЧА);

			ИтогоСча = ИтогоСча + стр.СЧА;
		КонецЦикла;
		ОбластьПодвалСЧА.Параметры.СуммаСЧА = ИтогоСча;
		ОбластьПодвалСЧА.Параметры.КоличествоДней = СтруктураПоказателей.СтруктураСЧА.КоличествоДней;
		ОбластьПодвалСЧА.Параметры.Сча = Формат(СтруктураПоказателей.СтруктураСЧА.СЧА,"ЧДЦ=5");
		ТабДокументПодвал.Вывести(ОбластьПодвалСЧА);

		
	КонецЕсли;

	Возврат ТабДокументПодвал;
	
	//Если ДопДанные = Неопределено Тогда
	//	ДопДанные = новый Структура;
	//	ДопДанные.Вставить("ЕстьРасшифровка", Ложь);
	//КонецЕсли;		
	//
	//ТабДок = Новый ТабличныйДокумент;
	//
	//Макет = ПолучитьМакет("РасшифровкаРасчета");
	//
	//Область = Макет.ПолучитьОбласть("Шапка");
	//Область.Параметры.ДатаНачала = Формат(НачалоПериода, "ДФ=dd.MM.yyyy");
	//Область.Параметры.ДатаОкончания = Формат(КонецПериода, "ДФ=dd.MM.yyyy");
	//ТабДок.Вывести(Область);
	//
	//Если НЕ ДопДанные.ЕстьРасшифровка Тогда
	//	
	//	Область = Макет.ПолучитьОбласть("Пусто");
	//	ТабДок.Вывести(Область);

	//	Возврат ТабДок;
	//	
	//КонецЕсли;	
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЕСТЬNULL(СУММА(ВЫБОР
	//               |				КОГДА ВводыВыводыДУОбороты.СуммаОборот > 0
	//               |					ТОГДА ВводыВыводыДУОбороты.СуммаОборот
	//               |				ИНАЧЕ 0
	//               |			КОНЕЦ), 0) КАК СуммаПриход,
	//               |	ЕСТЬNULL(СУММА(ВЫБОР
	//               |				КОГДА ВводыВыводыДУОбороты.СуммаОборот < 0
	//               |					ТОГДА -ВводыВыводыДУОбороты.СуммаОборот
	//               |				ИНАЧЕ 0
	//               |			КОНЕЦ), 0) КАК СуммаРасход,
	//               |	ВводыВыводыДУОбороты.Период,
	//               |	ВводыВыводыДУОбороты.Регистратор
	//               |ИЗ
	//               |	РегистрНакопления.ВводыВыводыДУ.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ДоговорДУ = &ДоговорДУ) КАК ВводыВыводыДУОбороты
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ВводыВыводыДУОбороты.Период,
	//               |	ВводыВыводыДУОбороты.Регистратор";
	//Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	//Запрос.УстановитьПараметр("ДатаОкончания", КонецПериода);
	//Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	//
	//ТаблицаВводыВыводы = Запрос.Выполнить().Выгрузить();
	//
	//Область = Макет.ПолучитьОбласть("Часть1");
	//Область.Параметры.СЧА = ПоказателиСправки.СЧА;
	//Область.Параметры.СЧА0 = ПоказателиСправки.СЧА0;
	//Область.Параметры.СуммаВводов = ТаблицаВводыВыводы.Итог("СуммаПриход");
	//ТабДок.Вывести(Область);
	//
	//Область = Макет.ПолучитьОбласть("Шапка1");
	//ТабДок.Вывести(Область);

	//Для Каждого СтрокаТЧ из ТаблицаВводыВыводы Цикл
	//	Если СтрокаТЧ.СуммаПриход = 0 Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Область = Макет.ПолучитьОбласть("Строка1");
	//	Область.Параметры.Период = Формат(СтрокаТЧ.Период, "ДФ=dd.MM.yyyy");
	//	Область.Параметры.Сумма = СтрокаТЧ.СуммаПриход;
	//	ТабДок.Вывести(Область);		
	//КонецЦикла;	
	//
	//Область = Макет.ПолучитьОбласть("Часть2");
	//Область.Параметры.СуммаВыводов = ТаблицаВводыВыводы.Итог("СуммаРасход");
	//ТабДок.Вывести(Область);
	//
	//Область = Макет.ПолучитьОбласть("Шапка2");
	//ТабДок.Вывести(Область);	
	//
	//Для Каждого СтрокаТЧ из ТаблицаВводыВыводы Цикл
	//	Если СтрокаТЧ.СуммаРасход = 0 Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Область = Макет.ПолучитьОбласть("Строка2");
	//	Область.Параметры.Период = Формат(СтрокаТЧ.Период, "ДФ=dd.MM.yyyy");
	//	Область.Параметры.Сумма = СтрокаТЧ.СуммаРасход;
	//	ТабДок.Вывести(Область);	
	//КонецЦикла;	
	//
	//Область = Макет.ПолучитьОбласть("Часть3");
	//Область.Параметры.БФР = ДопДанные.БФР;
	//Область.Параметры.ВУ2 = ДопДанные.ВУ2;
	//ТабДок.Вывести(Область);

	//Возврат ТабДок;
	//
КонецФункции	
// MPazhukov IMAPPS-10416 

//// IMAPPS-19077{
//Функция СреднееСЧА_РСА(ДоговорДУ, ДатаНачала, ДатаОкончания, ТипДня ="КалендарныйТип" )
//	СтруктураВозврата = Новый Структура;
//	СтруктураВозврата.Вставить("СЧА", 0);
//	СтруктураВозврата.Вставить("РСА", 0);
//	СтруктураВозврата.Вставить("ТаблицаСЧА_РСА", Новый ТаблицаЗначений);
//	СтруктураВозврата.Вставить("КоличествоДней", 0);
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
//	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
//	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
//	ТекстЗапроса = 
//	"ВЫБРАТЬ
//	|	КалендарныеГрафики.ДатаГрафика КАК Дата
//	|ИЗ
//	|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
//	|ГДЕ
//	|	КалендарныеГрафики.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.РегламентированныйКалендарь)
//	|	И КалендарныеГрафики.ДатаГрафика МЕЖДУ &ДатаНачала И &ДатаОкончания
//	|	И КалендарныеГрафики.ДеньВключенВГрафик";
//	Если ТипДня="КалендарныйТип" Тогда
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КалендарныеГрафики.ДеньВключенВГрафик", "ИСТИНА");
//	КонецЕсли;
//	Запрос.Текст = ТекстЗапроса;
//	ТаблицаСЧА_РСА = РегистрыСведений.РегистрРСА_СЧА.ТЗ_СЧА_РСА_НаДаты(Запрос.Выполнить().Выгрузить(), ДоговорДУ);
//		
//	КоличествоДней = ТаблицаСЧА_РСА.Количество();
//	Если НЕ КоличествоДней=0 Тогда
//		СтруктураВозврата.СЧА = ТаблицаСЧА_РСА.Итог("СЧА")/КоличествоДней;
//		СтруктураВозврата.РСА = ТаблицаСЧА_РСА.Итог("РСА")/КоличествоДней;
//		СтруктураВозврата.ТаблицаСЧА_РСА = ТаблицаСЧА_РСА;
//		СтруктураВозврата.КоличествоДней = КоличествоДней;
//	КонецЕсли;
//	
//	Возврат СтруктураВозврата;
//КонецФункции
////} IMAPPS-19077 NIsaychev