

&НаКлиенте
Процедура Установить(Команда)
	
	Заголовок = "";
	ЗначенияПараметров = УстановитьПараметры(Заголовок);
	ОповеститьОВыборе(новый Структура("Значения,ЗаголовокНастроек", ЗначенияПараметров,Заголовок));
	
КонецПроцедуры

&НаСервере
Функция УстановитьПараметры(Заголовок)
	
	Значения = Новый Структура;
	Значения.Вставить("ПериодЧас", Объект.ПериодЧас);
	Значения.Вставить("ПочтовыйЛогин", Объект.ПочтовыйЛогин);
	Значения.Вставить("СписокРассылки", XMLСтрока(Новый ХранилищеЗначения(Объект.СписокРассылки.Выгрузить())));
	
	ПредставлениеПочты = ?(Объект.СписокРассылки.Количество()>0, "Установлен список рассылки","");
	Заголовок = ПредставлениеПочты;
	Заголовок = СокрЛП(Заголовок);

	Возврат Значения;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.НастройкиАлгоритма)=Тип("Структура") Тогда
		Настройки = Параметры.НастройкиАлгоритма;
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.УстановитьПользовательскиеНастройки(Настройки);
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	КонецЕсли;
	
КонецПроцедуры
