
//ПОДСИСТЕМА ДОПОЛНИТЕЛЬНЫХ ОТЧЕТОВ И ОБРАБОТОК//////////////////////////////////////////

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.1.1.12");
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.15";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'РОСТ Создать торговые поручения (ОФЗ, Акции, Ликвидность)'");
	НоваяКоманда.Идентификатор = "СоздатьПорученияОФЗРОСТ";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'РОСТ Создать торговые поручения на покупку (ОФЗ, Акции, Ликвидность)'");
	НоваяКоманда.Идентификатор = "ФоновоеВыполнениеПокупка";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'РОСТ Создать торговые поручения на продажу (ОФЗ, Акции, Ликвидность)'");
	НоваяКоманда.Идентификатор = "ФоновоеВыполнениеПродажа";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	
	//+Блок DevOps
	ВерсияПрименения = "1.00";              
	Если ВерсияПрименения = ПараметрыРегистрации.Версия Тогда
		//ПараметрыРегистрации.Вставить("ПереименоватьПриЗагрузке", Истина);
		//ПараметрыРегистрации.Вставить("СтароеИмяФайла", "");
		//ПараметрыРегистрации.Вставить("НовоеИмяФайла", "ЗагрузкаНеторговыхПорученийРОСТ");
	КонецЕсли;	
	//-Блок DevOps		
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры

Функция ДополнительнаяОбработкаСсылка() Экспорт
	
	//ДопОбработкаСсылка = Константы.ОперацииПослеОбмена.Получить();
	//
	//Если Не ЗначениеЗаполнено(ДопОбработкаСсылка) Тогда
	ДопОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", 
	ЭтотОбъект.Метаданные().Имя);
	//КонецЕсли;
	
	Возврат ДопОбработкаСсылка;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	Лог.Очистить();
	
	ВажностьОшибки = 0;
	ТекстОшибки = "";  
	
	КоличествоПоручений = 0;
	
	Попытка 
		ПредставлениеНастроек = УстановитьНастройки(ПараметрыВыполненияКоманды);
	Исключение
		ВажностьОшибки = 2;
		ТекстОшибки = ТекстОшибки + Символы.ПС + "Ошибка получения настроек отчета: " + ОписаниеОшибки();
		Лог.ДобавитьСтроку("[err] Ошибка получения настроек отчета: " + ОписаниеОшибки());
	КонецПопытки;
	
	// Реализация логики команды
	Если ИдентификаторКоманды = "ФоновоеВыполнениеПокупка" Тогда 
		
		Если не ВыключитьПокупки Тогда
			ОбновитьСписокПортфелейПокупка(ТекстОшибки, ВажностьОшибки);
			СоздатьОтправитьПорученияПокупка(КоличествоПоручений, ТекстОшибки, ВажностьОшибки);
		КонецЕсли;
		
	ИначеЕсли ИдентификаторКоманды = "ФоновоеВыполнениеПродажа" Тогда
		
		Если не ВыключитьПродажи Тогда
			ЗаполнитьСписокПродажаАктивов(Истина, ТекстОшибки, ВажностьОшибки);
			СоздатьПорученияПродажа(КоличествоПоручений, ТекстОшибки, ВажностьОшибки);
		КонецЕсли;
		
	Иначе
		Возврат; 
	КонецЕсли;
	
		
	Попытка	
		РассылкаОтчета(КоличествоПоручений, ТекстОшибки, ВажностьОшибки);
	Исключение
		ВажностьОшибки = 2;
		Лог.ДобавитьСтроку("[err] Ошибка рассылки отчета по почте: " + ОписаниеОшибки());
	КонецПопытки;

	Префикс = ПрефиксПисьма(ВажностьОшибки);
	ТекстЛога = Лог.ПолучитьТекст();
	Если ВажностьОшибки = 2 Тогда
		
		ЗаписьЖурналаРегистрации(
			"Дополнительные отчеты и обработки." + Метаданные().Представление(),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки
		);    
		
	КонецЕсли;
	

	
КонецПроцедуры

Функция УстановитьНастройки(ПараметрыВыполненияКоманды) Экспорт
	
	ДопОбработка = ПараметрыВыполненияКоманды.ДополнительнаяОбработкаСсылка;
	
	НастройкиВыполнения = Неопределено;
	ХранилищеНастроек = ДопОбработка.ХранилищеНастроек;
	
	Если ТипЗнч(ХранилищеНастроек) = Тип("ХранилищеЗначения") Тогда
		НастройкиВыполнения = ХранилищеНастроек.Получить();
	КонецЕсли;
	
	Если ТипЗнч(НастройкиВыполнения) <> Тип("Структура") Тогда  
		Возврат "<Настройки не установлены>"; 
	КонецЕсли;
	
	ЗначенияНастроек = НастройкиВыполнения;
	ПредставлениеНастроек = "";
	УстановитьПользовательскиеНастройки(ЗначенияНастроек, ПредставлениеНастроек);
	
	Возврат ПредставлениеНастроек;
	
КонецФункции

Процедура УстановитьПользовательскиеНастройки(Настройки, ПредставлениеНастроек="") Экспорт
	
	Если ТипЗнч(Настройки) <> Тип("Структура") Тогда  
		Возврат; 
	КонецЕсли;
	
	Настройки.Свойство("ДопРеквизитСтатусПортфеля", ДопРеквизитСтатусПортфеля);
	Настройки.Свойство("СтатусДляПоиска", СтатусДляПоиска);
	Настройки.Свойство("СтатусДляПеревода", СтатусДляПеревода);
	Настройки.Свойство("СтатусОкончаниеОбработки", СтатусОкончаниеОбработки);
	Настройки.Свойство("ДопРеквизитДатаОперации", ДопРеквизитДатаОперации);
	Настройки.Свойство("АктивРубли", АктивРубли);
	
	Настройки.Свойство("СтатусРасторжениеИнициировано", СтатусРасторжениеИнициировано);
	Настройки.Свойство("СтатусОрдераНаПродажуСформированы", СтатусОрдераНаПродажуСформированы);
	Настройки.Свойство("СтатусОрдераНаПродажуОтправлены", СтатусОрдераНаПродажуОтправлены);
	Настройки.Свойство("СтатусОрдераНаПродажуИсполнены", СтатусОрдераНаПродажуИсполнены);
	Настройки.Свойство("СтатусПорученияНаВыводПоданы", СтатусПорученияНаВыводПоданы);
	Настройки.Свойство("СтатусПорученияНаВыводИсполнены", СтатусПорученияНаВыводИсполнены);
	Настройки.Свойство("СтатусОрдераНаРеИнвСформированы", СтатусОрдераНаРеИнвСформированы);
	
	Настройки.Свойство("АвторЗаявок", АвторЗаявок);
	
	Настройки.Свойство("АктивВимЛиквидность", АктивВимЛиквидность);
	Настройки.Свойство("ПроцентКомиссияБрокер", ПроцентКомиссияБрокер);
	
	Настройки.Свойство("КонтрольПоЦенеЗакрытия", КонтрольПоЦенеЗакрытия);	
	Настройки.Свойство("ВыключитьПокупки", ВыключитьПокупки);	
	Настройки.Свойство("ВыключитьПродажи", ВыключитьПродажи);	
	
	Настройки.Свойство("АдресWS", АдресWS);
	Настройки.Свойство("ЛогинWS", ЛогинWS);
	Настройки.Свойство("ПарольWS", ПарольWS);
	
	Почта = Неопределено;
	Если Настройки.Свойство("ПочтовыйЛогин", ПочтовыйЛогин) Тогда 
		Ящики = XMLЗначение(Тип("ХранилищеЗначения"),Настройки.СписокРассылки);
		СписокРассылки.Загрузить(Ящики.Получить());
	КонецЕсли;
	
	Если Настройки.Свойство("НастройкаСтратегий") Тогда
		спНастройкиСтратегии = XMLЗначение(Тип("ХранилищеЗначения"),Настройки.НастройкаСтратегий);
		НастройкаСтратегий.Загрузить(спНастройкиСтратегии.Получить());
	КонецЕсли;
	
	//ПредставлениеНастроек = "Период с:"+Формат(ДатаНачала,"ДФ=dd.MM.yyyy") + " по:"+Формат(ДатаОкончания,"ДФ=dd.MM.yyyy") + " ";
	ПредставлениеНастроек = "Представление настроек";
	
КонецПроцедуры

#Область DevOps

Процедура ЗагрузитьНастройки(ПараметрыРегистрации) Экспорт
	
	ВерсияПрименения = "1.00";
	ТекущаяРегистрация = СведенияОВнешнейОбработке();
	
	Если ВерсияПрименения = ТекущаяРегистрация.Версия Тогда
		
		ПараметрыРегистрации.Вставить("ЗагружатьНастройки", Истина);
		
		НастройкиПоУмолчанию(ЭтотОбъект);
		
		ЗаголовокНастроек = "";
		ЗначенияПараметров = УстановитьПараметры(ЗаголовокНастроек);
		
		ПараметрыРегистрации.Вставить("Настройки", Новый Структура("Значения, ЗаголовокНастроек", ЗначенияПараметров, ЗаголовокНастроек));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НастройкиПоУмолчанию(Объект) Экспорт
	
	Объект.ПочтовыйЛогин = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	//Объект.ОсновнойАктивДляПокупки = Справочники.Активы.ПолучитьСсылку(Новый УникальныйИдентификатор("625bcdbb-d8b1-11eb-80e3-005056b100b2"));//ОФЗ 26212
	//Объект.ДополнительныйАктивДляПокупки = Справочники.Активы.ПолучитьСсылку(Новый УникальныйИдентификатор("92fb40eb-38cf-11ec-80ea-005056b100b2")); //рос облигации
	Объект.АктивВимЛиквидность = Справочники.Активы.ПолучитьСсылку(Новый УникальныйИдентификатор("068a0fb1-10aa-11ec-80e9-005056b100b2"));//ВИМ ликвидность
	//Объект.ГоризонтИнвестирования = 5;
	//Объект.ПроцентКомиссияУправляющий = 2;
	Объект.ПроцентКомиссияБрокер=0.2;	
	
	Объект.СписокРассылки.Очистить();
	
	//НоваяПочта = Объект.СписокРассылки.Добавить();
	//НоваяПочта.ПочтовыйЯщик = "VTBAMMiddleoffice@vtbcapital.com";
	//
	//НоваяПочта = Объект.СписокРассылки.Добавить();
	//НоваяПочта.ПочтовыйЯщик = "IMAppSupport@vtbcapital.com";
	
	Объект.АдресWS 	= "http://SMSK02MG138U/DOC_MAN_UAT/ws/dm.1cws?wsdl";
	Объект.ЛогинWS 	= "svc_retail_test";	
	Объект.ПарольWS 	= "Ftr4436f~!"; 
	
	Объект.НастройкаСтратегий.Очистить();
	
КонецПроцедуры

Функция УстановитьПараметры(ЗаголовокНастроек) Экспорт
	
	Значения = Новый Структура();      
	Значения.Вставить("ПочтовыйЛогин", ЭтотОбъект.ПочтовыйЛогин);
	
	Значения.Вставить("ДопРеквизитСтатусПортфеля", ЭтотОбъект.ДопРеквизитСтатусПортфеля);
	Значения.Вставить("СтатусДляПоиска", ЭтотОбъект.СтатусДляПоиска);
	Значения.Вставить("СтатусДляПеревода", ЭтотОбъект.СтатусДляПеревода);
	Значения.Вставить("СтатусОкончаниеОбработки", ЭтотОбъект.СтатусОкончаниеОбработки);
	Значения.Вставить("ДопРеквизитДатаОперации",ЭтотОбъект.ДопРеквизитДатаОперации);
	Значения.Вставить("АктивРубли",ЭтотОбъект.АктивРубли);
	
	Значения.Вставить("СтатусРасторжениеИнициировано", ЭтотОбъект.СтатусРасторжениеИнициировано);
	Значения.Вставить("СтатусОрдераНаПродажуСформированы", ЭтотОбъект.СтатусОрдераНаПродажуСформированы);
	Значения.Вставить("СтатусОрдераНаПродажуОтправлены", ЭтотОбъект.СтатусОрдераНаПродажуОтправлены);
	Значения.Вставить("СтатусОрдераНаПродажуИсполнены", ЭтотОбъект.СтатусОрдераНаПродажуИсполнены);
	Значения.Вставить("СтатусПорученияНаВыводПоданы", ЭтотОбъект.СтатусПорученияНаВыводПоданы);
	Значения.Вставить("СтатусПорученияНаВыводИсполнены", ЭтотОбъект.СтатусПорученияНаВыводИсполнены);
	Значения.Вставить("СтатусОрдераНаРеИнвСформированы", ЭтотОбъект.СтатусОрдераНаРеИнвСформированы);
	
	Значения.Вставить("АвторЗаявок", ЭтотОбъект.АвторЗаявок);
	
	Значения.Вставить("АктивВимЛиквидность", ЭтотОбъект.АктивВимЛиквидность);
	Значения.Вставить("ПроцентКомиссияБрокер",ЭтотОбъект.ПроцентКомиссияБрокер);
	
	Значения.Вставить("КонтрольПоЦенеЗакрытия",ЭтотОбъект.КонтрольПоЦенеЗакрытия);
	Значения.Вставить("ВыключитьПокупки",ЭтотОбъект.ВыключитьПокупки);
	Значения.Вставить("ВыключитьПродажи",ЭтотОбъект.ВыключитьПродажи);
	
	Значения.Вставить("АдресWS", ЭтотОбъект.АдресWS);
	Значения.Вставить("ЛогинWS", ЭтотОбъект.ЛогинWS);
	Значения.Вставить("ПарольWS", ЭтотОбъект.ПарольWS);
	
	Значения.Вставить("СписокРассылки", XMLСтрока(Новый ХранилищеЗначения(ЭтотОбъект.СписокРассылки.Выгрузить())));
	Значения.Вставить("НастройкаСтратегий", XMLСтрока(Новый ХранилищеЗначения(ЭтотОбъект.НастройкаСтратегий.Выгрузить())));
	
	ПредставлениеПочты = ?(ЭтотОбъект.СписокРассылки.Количество()>0, ", Установлен список рассылки","");
	
	ЗаголовокНастроек = СокрЛП(ПредставлениеПочты);
	
	Возврат Значения;
	
КонецФункции

#КонецОбласти

Функция ПолучитьТекстЗапросаСписокПортфелейПокупка()
	
	Возврат
	"ВЫБРАТЬ
	|	т.Стратегия КАК Стратегия,
	|	т.ГоризонтИнвестирования КАК ГоризонтИнвестирования,
	|	т.ОсновнойАктивДляПокупки КАК ОсновнойАктивДляПокупки,
	|	т.ДополнительныйАктивДляПокупки КАК ДополнительныйАктивДляПокупки,
	|	т.ПроцентКомиссияУправляющий КАК ПроцентКомиссияУправляющий,
	|	т.СтавкаРеинвест КАК СтавкаРеинвест,
	|	т.СтавкаДисконтаЦены КАК СтавкаДисконтаЦены,
	|	т.ПроцентПотерьАкции КАК ПроцентПотерьАкции
	|ПОМЕСТИТЬ ВТ_Настройки
	|ИЗ
	|	&тзНастройки КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Объект КАК Портфель,
	|	т.Значение КАК ДатаПослСтатуса
	|ПОМЕСТИТЬ ВТ_ДатыСтатусПортфелей
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК т
	|ГДЕ
	|	т.Свойство = &СвойствоДатаСтатус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Объект КАК Портфель,
	|	т.Значение КАК СтатусПоПортфелю,
	|	ВЫРАЗИТЬ(т.Объект КАК Справочник.Портфели).КодПортфеля КАК КодПортфеля
	|ПОМЕСТИТЬ ВТ_Портфели
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК т
	|ГДЕ
	|	т.Свойство = &СвойствоСтатус
	|	И т.Значение В(&списСтатусы)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Портфель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Портфель КАК Портфель,
	|	т.Субпортфель КАК СубПортфель,
	|	СУММА(ВЫБОР
	|			КОГДА т.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыПоручений.НеторговоеПоручение)
	|				ТОГДА т.СуммаПоручения
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВвода,
	|	СУММА(ВЫБОР
	|			КОГДА т.Актив = н.ОсновнойАктивДляПокупки
	|				ТОГДА т.Количество * т.ЦенаВВалютеРасчетов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПодОФЗ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА т.Актив = н.ОсновнойАктивДляПокупки
	|				ТОГДА т.Ссылка
	|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.Поручение.ПустаяСсылка)
	|		КОНЕЦ) КАК ПоручениеОФЗ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА т.Актив = н.ОсновнойАктивДляПокупки
	|				ТОГДА с.СтатусРасш
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК СтатусПоручениеОФЗ,
	|	СУММА(ВЫБОР
	|			КОГДА т.Актив = н.ДополнительныйАктивДляПокупки
	|				ТОГДА т.Количество * т.ЦенаВВалютеРасчетов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПодАкции,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА т.Актив = н.ДополнительныйАктивДляПокупки
	|				ТОГДА т.Ссылка
	|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.Поручение.ПустаяСсылка)
	|		КОНЕЦ) КАК ПоручениеАкции,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА т.Актив = н.ДополнительныйАктивДляПокупки
	|				ТОГДА с.СтатусРасш
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК СтатусПоручениеАкции,
	|	СУММА(ВЫБОР
	|			КОГДА т.Актив = &АктивПодКомиссииУК
	|				ТОГДА т.Количество * т.ЦенаВВалютеРасчетов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПодКомиссииУК,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА т.Актив = &АктивПодКомиссииУК
	|				ТОГДА т.Ссылка
	|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.Поручение.ПустаяСсылка)
	|		КОНЕЦ) КАК ПоручениеКомиссии,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА т.Актив = &АктивПодКомиссииУК
	|				ТОГДА с.СтатусРасш
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК СтатусПоручениеКомиссии,
	|	МАКСИМУМ(н.Стратегия) КАК Стратегия,
	|	МАКСИМУМ(н.ГоризонтИнвестирования) КАК ГоризонтИнвестирования,
	|	МАКСИМУМ(н.ОсновнойАктивДляПокупки) КАК ОсновнойАктивДляПокупки,
	|	МАКСИМУМ(н.ДополнительныйАктивДляПокупки) КАК ДополнительныйАктивДляПокупки,
	|	МАКСИМУМ(н.ПроцентКомиссияУправляющий) КАК ПроцентКомиссияУправляющий,
	|	МАКСИМУМ(н.СтавкаРеинвест) КАК СтавкаРеинвест,
	|	МАКСИМУМ(н.СтавкаДисконтаЦены) КАК СтавкаДисконтаЦены,
	|	МАКСИМУМ(н.ПроцентПотерьАкции) КАК ПроцентПотерьАкции,
	|	МАКСИМУМ(ВТ_ДатыСтатусПортфелей.ДатаПослСтатуса) КАК ДатаПослСтатуса,
	|	МАКСИМУМ(ВТ_Портфели.СтатусПоПортфелю) КАК Статус
	|ИЗ
	|	Документ.Поручение КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПоручений КАК с
	|		ПО (с.Поручение = т.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Настройки КАК н
	|		ПО т.Субпортфель.Стратегия = н.Стратегия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыСтатусПортфелей КАК ВТ_ДатыСтатусПортфелей
	|		ПО т.Портфель = ВТ_ДатыСтатусПортфелей.Портфель
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Портфели КАК ВТ_Портфели
	|		ПО т.Портфель = ВТ_Портфели.Портфель
	|ГДЕ
	|	т.Дата >= &НачПериод
	|	И т.Дата <= &КонПериод
	|	И т.Проведен
	|	И т.Портфель В
	|			(ВЫБРАТЬ
	|				т.Портфель
	|			ИЗ
	|				ВТ_Портфели КАК т)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Портфель,
	|	т.Субпортфель";  
	
КонецФункции

Процедура ОбновитьСписокПортфелейПокупка(ТекстОшибки, ВажностьОшибки) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаСписокПортфелейПокупка();
	
	списСтатусы = новый Массив;
	списСтатусы.Добавить(СтатусДляПоиска);
	списСтатусы.Добавить(СтатусДляПеревода);
	
	Запрос.УстановитьПараметр("НачПериод", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("КонПериод", КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("СвойствоСтатус", ДопРеквизитСтатусПортфеля);
	Запрос.УстановитьПараметр("СвойствоДатаСтатус", ДопРеквизитДатаОперации);
	Запрос.УстановитьПараметр("списСтатусы", списСтатусы);
	Запрос.УстановитьПараметр("тзНастройки", НастройкаСтратегий.Выгрузить());
	Запрос.УстановитьПараметр("АктивПодКомиссииУК",	АктивВимЛиквидность);
	Запрос.УстановитьПараметр("Период",	Новый Граница(ТекущаяДатаСеанса(),ВидГраницы.Включая));  
	
	СписокПортфелейПокупка.Загрузить(Запрос.Выполнить().Выгрузить()); 
	
	Для каждого СтрокаПокупка Из СписокПортфелейПокупка Цикл
		СтрокаПокупка.Пометка = Истина;
		СтрокаПокупка.СуммаПодКомиссииБрокер = Окр(СтрокаПокупка.СуммаВвода * ПроцентКомиссияБрокер / 100, 2);
		СтрокаПокупка.СуммаПодКомиссииУК = Окр(СтрокаПокупка.СуммаВвода * СтрокаПокупка.ПроцентКомиссияУправляющий/ 100, 2);
		СтрокаПокупка.СуммаИнвестирования = СтрокаПокупка.СуммаВвода - СтрокаПокупка.СуммаПодКомиссииБрокер;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьОтправитьПорученияПокупка(КоличествоПоручений, ТекстОшибки, ВажностьОшибки) Экспорт
	
	ПорученияНаОтправку = новый Массив;
	
	Попытка
		СписокПотоковПоАктивам = РассчитатьПотокПоОФЗ(НачалоДня(ТекущаяДатаСеанса())); 
	Исключение
		ВажностьОшибки = 2;
		ТекстОшибки = ТекстОшибки + Символы.ПС + "Возникла ошибка при формировании денежного потока ОФЗ: "+ОписаниеОшибки(); 
		ЭтотОбъект.Лог.ДобавитьСтроку("[err] Возникла ошибка при формировании денежного потока ОФЗ: "+ОписаниеОшибки());
		Возврат	
	КонецПопытки;	 
	
	Для каждого ТекСтр Из СписокПортфелейПокупка Цикл
		
		Если не ТекСтр.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтр.Статус = СтатусДляПоиска Тогда
			//ДС пришли нужно создать и отправить поручение на ОФЗ
			Прм = СписокПотоковПоАктивам[ТекСтр.ОсновнойАктивДляПокупки];
			Если Прм = Неопределено Тогда
				Сообщить(ОписаниеОшибки());
				ВажностьОшибки = 2;
				ТекстОшибки = ТекстОшибки + Символы.ПС + " не найдены параметры для расчета количества "+ ТекСтр.ОсновнойАктивДляПокупки; 
				ЭтотОбъект.Лог.ДобавитьСтроку("[err] Портфель: " +ТекСтр.Портфель + " не найдены параметры для расчета количества "+ ТекСтр.ОсновнойАктивДляПокупки);
				Продолжить;
			КонецЕсли;
			
			НачатьТранзакцию(); 
			
			Попытка
				ТекстОшибки = "";
				
				ПараметрыПоручения = новый Структура;
				ПараметрыПоручения.Вставить("НомерЦены", 2);
				ПараметрыПоручения.Вставить("Направление", Перечисления.ВидыОперацийСделки.Покупка);
				ПараметрыПоручения.Вставить("Портфель", ТекСтр.Портфель);
				ПараметрыПоручения.Вставить("СубПортфель", ТекСтр.СубПортфель);
				ПараметрыПоручения.Вставить("Актив", ТекСтр.ОсновнойАктивДляПокупки);
				ПараметрыПоручения.Вставить("Цена", 100);
				ПараметрыПоручения.Вставить("Количество", 100);
				Если не ТекСтр.ПоручениеОФЗ.Пустая() Тогда
					ПараметрыПоручения.Вставить("ПоручениеСсылка", ТекСтр.ПоручениеОФЗ);
				КонецЕсли;
				
				ПоручениеОФЗ = ЗаписатьПоручение(ПараметрыПоручения, 0, ТекстОшибки);
				КолВоОФЗ = 0;
				
				Если ЗначениеЗаполнено(ПоручениеОФЗ) Тогда
					КолВоОФЗ = РассчитатьКоличествоПоОФЗ(ТекСтр.Портфель, 
													ТекСтр.ОсновнойАктивДляПокупки, 
													Прм, 
													ТекСтр.СуммаВвода, 
													ТекСтр.СуммаВвода - ТекСтр.СуммаПодКомиссииБрокер - ТекСтр.СуммаПодКомиссииУК, 
													ПоручениеОФЗ.ЦенаВВалютеРасчетов, 
													ТекстОшибки, 
													ВажностьОшибки);
				
				КонецЕсли;
				
				Если КолВоОФЗ > 0 Тогда

					Окружение = Неопределено;
					Поручение = ПоручениеОФЗ.ПолучитьОбъект();
					Поручение.Количество = КолВоОФЗ;
					ОбработатьКоличествоЛотовПоручения(Поручение);
					Поручение.ВалютаРасчетовПриИзмененииОбработать();
					
					Попытка
						Поручение.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						ЭтотОбъект.Лог.ДобавитьСтроку("[err] Портфель: " +ТекСтр.Портфель+" Ошибка: " + ОписаниеОшибки());
						ОтменитьТранзакцию();
						Продолжить;
					КонецПопытки;
					
					ОбновитьСтатусПоПортфелю(ТекСтр.Портфель, СтатусДляПеревода); 
				Иначе
					ЭтотОбъект.Лог.ДобавитьСтроку("[err] Портфель: " +ТекСтр.Портфель+" Ошибка: " + ТекстОшибки);
					ОтменитьТранзакцию();
					Продолжить;
				КонецЕсли;
				
				ЗафиксироватьТранзакцию();
			
				ПорученияНаОтправку.Добавить(ПоручениеОФЗ);
			Исключение
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				Сообщить(ОписаниеОшибки());
				ВажностьОшибки = 2;
				ЭтотОбъект.Лог.ДобавитьСтроку("[err] Портфель: " +ТекСтр.Портфель+" Ошибка: "+ ОписаниеОшибки());
				Продолжить
			КонецПопытки; 
			
		ИначеЕсли ТекСтр.Статус = СтатусДляПеревода И ТекСтр.СтатусПоручениеОФЗ = Перечисления.СтатусыПорученийБлоттер.Ready Тогда
			
			Попытка
				СуммаПокупкиЛиквидность = ТекСтр.СуммаВвода * ТекСтр.ПроцентКомиссияУправляющий / 100;
				СуммаПокупкиАкции = ТекСтр.СуммаИнвестирования - ТекСтр.СуммаПодОФЗ - СуммаПокупкиЛиквидность;//ПоручениеОФЗ.СуммаПоручения;
				
				НачатьТранзакцию(); 
				
				ПараметрыПоручения = новый Структура;
				ПараметрыПоручения.Вставить("НомерЦены", 2);
				ПараметрыПоручения.Вставить("Направление", Перечисления.ВидыОперацийСделки.Покупка);
				ПараметрыПоручения.Вставить("Портфель", ТекСтр.Портфель);
				ПараметрыПоручения.Вставить("СубПортфель", ТекСтр.СубПортфель);
				ПараметрыПоручения.Вставить("Актив", ТекСтр.ДополнительныйАктивДляПокупки);
				ПараметрыПоручения.Вставить("Цена", 1);
				ПараметрыПоручения.Вставить("Количество", 100);
				Если не ТекСтр.ПоручениеАкции.Пустая() Тогда
					ПараметрыПоручения.Вставить("ПоручениеСсылка", ТекСтр.ПоручениеАкции);
				КонецЕсли;
				ПоручениеАкции = ЗаписатьПоручение(ПараметрыПоручения, СуммаПокупкиАкции, ТекстОшибки);
				
				ПараметрыПоручения = новый Структура;
				ПараметрыПоручения.Вставить("НомерЦены", 2);
				ПараметрыПоручения.Вставить("Направление", Перечисления.ВидыОперацийСделки.Покупка);
				ПараметрыПоручения.Вставить("Портфель", ТекСтр.Портфель);
				ПараметрыПоручения.Вставить("СубПортфель", ТекСтр.СубПортфель);
				ПараметрыПоручения.Вставить("Актив", АктивВимЛиквидность);
				ПараметрыПоручения.Вставить("Цена", 1);
				ПараметрыПоручения.Вставить("Количество", 100);
				Если не ТекСтр.ПоручениеКомиссии.Пустая() Тогда
					ПараметрыПоручения.Вставить("ПоручениеСсылка", ТекСтр.ПоручениеКомиссии);
				КонецЕсли;
				ПоручениеЛиквидность = ЗаписатьПоручение(ПараметрыПоручения, СуммаПокупкиЛиквидность, ТекстОшибки);
				
				Если ЗначениеЗаполнено(ПоручениеАкции) И ЗначениеЗаполнено(ПоручениеЛиквидность) Тогда
					ОбновитьСтатусПоПортфелю(ТекСтр.Портфель, СтатусОкончаниеОбработки);
					
					ПорученияНаОтправку.Добавить(ПоручениеАкции);
					ПорученияНаОтправку.Добавить(ПоручениеЛиквидность);
				Иначе
					ЭтотОбъект.Лог.ДобавитьСтроку("[err] Портфель: " +ТекСтр.Портфель+" Ошибка: " + ТекстОшибки);
					ОтменитьТранзакцию();
					Продолжить;
				КонецЕсли;
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				Сообщить(ОписаниеОшибки());
				ВажностьОшибки = 2;
				ЭтотОбъект.Лог.ДобавитьСтроку("[err] Портфель: " +ТекСтр.Портфель+" Ошибка: "+ ОписаниеОшибки());
				Продолжить
			КонецПопытки; 
			
		КонецЕсли;
		
		//Поручение создано, отправляем
		
	КонецЦикла;    
	
	КоличествоПоручений = ПорученияНаОтправку.Количество();
	
	ОтправитьПоручения(ПорученияНаОтправку);

КонецПроцедуры

Функция ИзменитьЦенуПоручения(СсылкаПоручение, НомерЛучшейЦены, ТекстОшибки = "")
	
	Если ЭтоТест Тогда
		Возврат ИзменитьЦенуПорученияТест(СсылкаПоручение, НомерЛучшейЦены, ТекстОшибки = "");
	КонецЕсли;
	
	ТекстОшибки = ТекстОшибки + Символы.ПС + "[inf] Запрос цены из стакана для: " +СсылкаПоручение.Актив;
	
	спис = новый Массив;
	спис.Добавить(СсылкаПоручение);
	
	Успех = Ложь;
	
	ПараметрыИзменения = РаспорядителиВызовСервера.ПараметрыИзмененияЦен();
	ПараметрыИзменения.НомерЛучшейЦены = НомерЛучшейЦены;
	ПараметрыИзменения.Поручения = спис;
	ПараметрыИзменения.ОбработкаИзменения = Ложь;
	ПараметрыИзменения.ТребоватьПодтверждениеИзмененияЦен = Ложь;
	 
	УпакованыйРезультат = Распорядители.ИзменениеЦен(ПараметрыИзменения);
	Ответ = ПолучитьИзВременногоХранилища(УпакованыйРезультат.АдресРезультатаРасш);
	Цена1 = 0;
	Цена2 = 0;
	Попытка
		Направление = ?(СсылкаПоручение.Направление = Перечисления.ВидыОперацийСделки.Покупка, Перечисления.ВидыОперацийСделки.Продажа, Перечисления.ВидыОперацийСделки.Покупка);
		списЦеныСтакан = Ответ.ТорговыеДанные.НайтиСтроки(новый Структура("НомерЦены, Направление", 1, Направление));
		Если списЦеныСтакан.Количество() > 0 Тогда
			Цена1 = списЦеныСтакан[0].Цена;
		КонецЕсли;
		списЦеныСтакан = Ответ.ТорговыеДанные.НайтиСтроки(новый Структура("НомерЦены, Направление", НомерЛучшейЦены, Направление));
		Если списЦеныСтакан.Количество() > 0 Тогда
			Цена2 = списЦеныСтакан[0].Цена;
		КонецЕсли;
	Исключение
		ТекстОшибки = ТекстОшибки + Символы.ПС + "[err] Ошибка получения цены из стакана: " + ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
	
	Если Цена1 = 0 Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС + "[err] В стакане нет цены(1)";
	Иначе
		ТекстОшибки = ТекстОшибки + Символы.ПС + "[inf] Получили цену(1): " + Цена1;
	КонецЕсли;
	
	Если Цена2 = 0 Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС + "[err] В стакане нет цены(" + НомерЛучшейЦены + ")";
	Иначе
		ТекстОшибки = ТекстОшибки + Символы.ПС + "[inf] Получили цену(" + НомерЛучшейЦены + "): " + Цена2;
	КонецЕсли;
	
	Если Цена1 = 0 или Цена2 = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОтклоненниеЦены = Окр((Цена1 - Цена2) / Цена1 * 100, 2);
	ОтклоненниеЦены = ?(ОтклоненниеЦены < 0, -ОтклоненниеЦены, ОтклоненниеЦены);
	
	Если ОтклоненниеЦены > 2 Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС + "[err] Не нашли цену для поручения: отклонение от лучшей цены " + ОтклоненниеЦены + " > 2%";
		Возврат Ложь;
	Иначе
		ТекстОшибки = ТекстОшибки + Символы.ПС + "[inf] Отклонение от лучшей цены  " + ОтклоненниеЦены + " < 2%";
	КонецЕсли;
	
	Если КонтрольПоЦенеЗакрытия Тогда
		
		ЦенаЗакрытия = ПолучитьЦенуЗакрытия(ТекущаяДата(), СсылкаПоручение.Актив);
		ТекстОшибки = ТекстОшибки + Символы.ПС + "[inf] Получили цену закрытия: " + ЦенаЗакрытия;
		
		Если ЦенаЗакрытия = 0 Тогда
			ОтклоненниеЦены = 0;
		Иначе
			ОтклоненниеЦены = Окр((ЦенаЗакрытия - Цена2) / ЦенаЗакрытия * 100, 2);
		КонецЕсли;
		ОтклоненниеЦены = ?(ОтклоненниеЦены < 0, -ОтклоненниеЦены, ОтклоненниеЦены);
		
		Если ОтклоненниеЦены > 2 Тогда
			ТекстОшибки = ТекстОшибки + Символы.ПС + "[err] Не нашли цену для поручения: отклонение от цены закрытия " + ОтклоненниеЦены + " > 2%";
			Возврат Ложь;
		Иначе
			ТекстОшибки = ТекстОшибки + Символы.ПС + "[inf] Отклонение от цены закрытия " + ОтклоненниеЦены + " < 2%";
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстОшибки = ТекстОшибки + Символы.ПС + "[inf] Нашли цену для поручения:  " + Цена2;
	
	Поручение = СсылкаПоручение.ПолучитьОбъект();
	Окружение = Неопределено;
	Поручение.ЗаполнитьКупон();
	Поручение.Котировка = Цена2;
	Поручение.ЦенаВВалютеРасчетов = Цена2;
	Поручение.ВалютаРасчетовПриИзмененииОбработать();
	Попытка
		Поручение.Записать(РежимЗаписиДокумента.Проведение);
		Успех = Истина;
		ТекстОшибки = ТекстОшибки + Символы.ПС + "[inf] Установлена цена: " + Цена2;
	Исключение
		ТекстОшибки = ТекстОшибки + Символы.ПС + "[err] Ошибка установки цены: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Успех;
КонецФункции

Функция ИзменитьЦенуПорученияТест(СсылкаПоручение, НомерЛучшейЦены, Описание = "")
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Актив", СсылкаПоручение.Актив);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.ПризнаваемаяКотировка КАК Котировка,
	|	т.Актив КАК Актив,
	|	т.Биржа КАК Биржа
	|ИЗ
	|	РегистрСведений.КотировкиЦБНаБирже.СрезПоследних(, Актив = &Актив) КАК т";
	
	Котировка = 100;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Котировка = Выборка.Котировка;
	КонецЕсли;
	ЭтотОбъект.Лог.ДобавитьСтроку("[inf] Котировка установлена в тестово режиме: " + Котировка);
	
	Окружение = Неопределено;
	обПоручение = СсылкаПоручение.ПолучитьОбъект();
	обПоручение.Котировка = Котировка;
	обПоручение.ЦенаВВалютеРасчетов = Котировка;
	
	обПоручение.ВалютаРасчетовПриИзмененииОбработать();

	обПоручение.СуммаПоручения = обПоручение.Количество * обПоручение.ЦенаВВалютеРасчетов;
	
	обПоручение.Записать(РежимЗаписиДокумента.Проведение);
	
	Успех = Истина;
	
	Возврат Успех;
КонецФункции

Функция ПолучитьЦенуЗакрытия(ДатаЦены, АктивЦены)
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("НаДату", КонецДня(ДатаЦены));
	Запрос.УстановитьПараметр("Актив", АктивЦены);
	Запрос.УстановитьПараметр("Биржа", Справочники.Биржи.ММВБ);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.ЦенаЗакрытия КАК Котировка
	|ИЗ
	|	РегистрСведений.КотировкиЦБНаБирже.СрезПоследних(
	|			&НаДату,
	|			Актив = &Актив
	|				И Биржа = &Биржа) КАК т";
	
	Котировка = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Котировка = Выборка.Котировка;
	КонецЕсли;
	
	Возврат Котировка;
КонецФункции
	
Процедура ЗагрузитьСписокНаРасторжение(ТекстОшибки, ВажностьОшибки) Экспорт 
	
	масНеТрогатьСтатусы = новый Массив;
	масНеТрогатьСтатусы.Добавить(СтатусРасторжениеИнициировано);
	масНеТрогатьСтатусы.Добавить(СтатусОрдераНаПродажуСформированы);
	масНеТрогатьСтатусы.Добавить(СтатусОрдераНаПродажуОтправлены);
	масНеТрогатьСтатусы.Добавить(СтатусОрдераНаПродажуИсполнены);
	масНеТрогатьСтатусы.Добавить(СтатусПорученияНаВыводПоданы);
	масНеТрогатьСтатусы.Добавить(СтатусПорученияНаВыводИсполнены);
	
	тз = новый ТаблицаЗначений;
	тз.Колонки.Добавить("НомерДУ", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	тз.Колонки.Добавить("ДатаРасторжения", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	тз.Колонки.Добавить("ФИО", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	
	Определения = Новый WSОпределения(АдресWS, ЛогинWS, ПарольWS, , 20);
	Сервис = Новый WSПрокси(Определения, "http://www.1c.ru/dm", "DMService", "DMServiceSoap12", , 20);
	Сервис.Пользователь = ЛогинWS;
	Сервис.Пароль = ПарольWS;
	СтрокаJSON = Сервис.GetClosingRetailAgreements ();
	
	Если СтрокаJSON = "" Тогда
		Возврат;
	КонецЕсли;

	Ридер = новый ЧтениеJSON;
	Ридер.УстановитьСтроку(СтрШаблон("{""root"": %1}", СтрокаJSON));
	
	ОтветСервиса = ПрочитатьJSON(Ридер, Истина);    
	
	Для каждого СтрокаОтвет Из ОтветСервиса["root"] Цикл
		НовСтрока = тз.Добавить();
		НовСтрока.НомерДУ = СтрокаОтвет["НомерДУ"];
		ДатаРасторжения = СтрЗаменить(СтрокаОтвет["ДатаРасторжения"], "T", "");
		ДатаРасторжения = СтрЗаменить(ДатаРасторжения, "-", "");
		ДатаРасторжения = СтрЗаменить(ДатаРасторжения, ":", "");
		НовСтрока.ДатаРасторжения = ДатаРасторжения;
		НовСтрока.ФИО = СтрокаОтвет["ФИО"];
		ЭтотОбъект.Лог.ДобавитьСтроку("[inf] Получили уведомление на расторжение:");
		ЭтотОбъект.Лог.ДобавитьСтроку("[inf] 		Номер ДУ: " + НовСтрока.НомерДУ);
		ЭтотОбъект.Лог.ДобавитьСтроку("[inf] 		Дата:     " + НовСтрока.ДатаРасторжения);
		ЭтотОбъект.Лог.ДобавитьСтроку("[inf] 		ФИО:      " + НовСтрока.ФИО);
	КонецЦикла;   
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тз", тз);
	Запрос.УстановитьПараметр("СвойствоСтатус", ДопРеквизитСтатусПортфеля);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.НомерДУ КАК НомерДУ,
	|	т.ДатаРасторжения КАК ДатаРасторжения
	|ПОМЕСТИТЬ втРасторжения
	|ИЗ
	|	&тз КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Объект КАК Портфель,
	|	т.Значение КАК СтатусПортфеля
	|ПОМЕСТИТЬ втСтатусПортфелей
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК т
	|ГДЕ
	|	т.Свойство = &СвойствоСтатус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.НомерДУ КАК КодПортфель,
	|	т.ДатаРасторжения КАК ДатаРасторжения,
	|	п.Ссылка КАК Портфель
	|ПОМЕСТИТЬ втПортфели
	|ИЗ
	|	втРасторжения КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Портфели КАК п
	|		ПО т.НомерДУ = п.НомерДоговора
	|			И (НЕ п.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.КодПортфель КАК КодПортфель,
	|	т.ДатаРасторжения КАК ДатаРасторжения,
	|	вт_ст.СтатусПортфеля КАК СтатусПортфеля,
	|	т.Портфель КАК Портфель
	|ИЗ
	|	втПортфели КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСтатусПортфелей КАК вт_ст
	|		ПО т.Портфель = вт_ст.Портфель";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	НПП = 0;
	СписокПортфелейПродажа.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Портфель) Тогда
			Если масНеТрогатьСтатусы.Найти(Выборка.СтатусПортфеля) = Неопределено Тогда
				
				ОбновитьСтатусПоПортфелю(Выборка.Портфель, СтатусРасторжениеИнициировано); 
				
				//НоваяСтрока = СписокПортфелейПродажа.Добавить();
				//НоваяСтрока.Портфель = Выборка.Портфель;
				//НоваяСтрока.Статус = СтатусРасторжениеИнициировано;
				//НоваяСтрока.ДатаПослСтатуса = ТекущаяДата();
			КонецЕсли;
		Иначе
			//ТекстОшибки = ТекстОшибки + "
			//|	Для кода не " + Выборка.КодПортфель + " не найден портфель.";
			ЭтотОбъект.Лог.ДобавитьСтроку("[err] Для кода не " + Выборка.КодПортфель + " не найден портфель.");
		КонецЕсли;

	КонецЦикла;
	
	//Если ТекстОшибки <> "" Тогда
	//	ЭтотОбъект.Лог.ДобавитьСтроку("[err] " + ТекстОшибки);
	//КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСписокПродажаАктивов(НеПоказыватьПортфелиСПоручениями, ТекстОшибки, ВажностьОшибки) Экспорт   
	
	ДатаФактПозиции = НачалоДня(ТекущаяДата());
	Если ЭтоТест Тогда
		ДатаФактПозиции = НачалоДня(КалендарныеГрафики.ПолучитьСледующуюРабочуюДату(, ДатаФактПозиции, -1)); 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Свойство", ДопРеквизитСтатусПортфеля);
	Запрос.УстановитьПараметр("СвойствоДатаСтатус", ДопРеквизитДатаОперации);
	Запрос.УстановитьПараметр("Значение", СтатусРасторжениеИнициировано);
	Запрос.УстановитьПараметр("НаДату", ДатаФактПозиции);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ПоказыватьПортфелиСПоручениями", Не НеПоказыватьПортфелиСПоручениями);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Объект КАК Портфель,
	|	т.Значение КАК Статус
	|ПОМЕСТИТЬ втПортфели
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК т
	|ГДЕ
	|	т.Свойство = &Свойство
	|	И т.Значение = &Значение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Объект КАК Портфель,
	|	т.Значение КАК ДатаПослСтатуса
	|ПОМЕСТИТЬ ВТ_ДатыСтатусПортфелей
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК т
	|ГДЕ
	|	т.Свойство = &СвойствоДатаСтатус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК ПоручениеНаПродажу,
	|	т.Портфель КАК Портфель,
	|	т.Актив КАК Актив,
	|	с.СтатусРасш КАК СтатусПоручение
	|ПОМЕСТИТЬ ВТ_Поручения
	|ИЗ
	|	Документ.Поручение КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПоручений КАК с
	|		ПО т.Ссылка = с.Поручение
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(т.Дата, ДЕНЬ) = &НаДату
	|	И т.Проведен
	|	И т.Портфель В
	|			(ВЫБРАТЬ
	|				т.Портфель
	|			ИЗ
	|				втПортфели КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Актив КАК Актив,
	|	т.Портфель КАК Портфель,
	|	т.Субпортфель КАК Субпортфель,
	|	т.Субпортфель.Стратегия КАК Стратегия,
	|	СУММА(т.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_Позиция
	|ИЗ
	|	(ВЫБРАТЬ
	|		т.Актив КАК Актив,
	|		т.Портфель КАК Портфель,
	|		т.Субпортфель КАК Субпортфель,
	|		т.Количество КАК Количество
	|	ИЗ
	|		РегистрСведений.ФактическаяПозиция КАК т
	|	ГДЕ
	|		т.Дата = &НаДату
	|		И т.Актив.ВидАктива <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.Валюты)
	|		И т.Портфель В
	|				(ВЫБРАТЬ
	|					т.Портфель
	|				ИЗ
	|					втПортфели КАК т)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		т.Актив,
	|		т.Портфель,
	|		т.Субпортфель,
	|		т.КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ПлановаяПозиция.Остатки(&КонецПериода, Актив.ВидАктива <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.Валюты)) КАК т) КАК т
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Портфель,
	|	т.Актив,
	|	т.Субпортфель,
	|	т.Субпортфель.Стратегия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПортфели.Портфель КАК Портфель,
	|	втПортфели.Статус КАК Статус,
	|	ВТ_ДатыСтатусПортфелей.ДатаПослСтатуса КАК ДатаПослСтатуса,
	|	т.Актив КАК Актив,
	|	т.Субпортфель КАК Субпортфель,
	|	т.Субпортфель.Стратегия КАК Стратегия,
	|	т.Количество КАК Количество,
	|	п.ПоручениеНаПродажу КАК ПоручениеНаПродажу,
	|	п.СтатусПоручение КАК СтатусПоручение
	|ИЗ
	|	втПортфели КАК втПортфели
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Позиция КАК т
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поручения КАК п
	|			ПО т.Портфель = п.Портфель
	|				И т.Актив = п.Актив
	|		ПО втПортфели.Портфель = т.Портфель
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыСтатусПортфелей КАК ВТ_ДатыСтатусПортфелей
	|		ПО (т.Портфель = ВТ_ДатыСтатусПортфелей.Портфель)
	|ГДЕ
	|	т.Портфель В
	|			(ВЫБРАТЬ
	|				т.Портфель
	|			ИЗ
	|				втПортфели КАК т)
	|	И т.Количество > 0
	|	И (&ПоказыватьПортфелиСПоручениями
	|			ИЛИ НЕ &ПоказыватьПортфелиСПоручениями
	|				И п.ПоручениеНаПродажу ЕСТЬ NULL)";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	СписокПортфелейПродажа.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = СписокПортфелейПродажа.Добавить();
		НоваяСтрока.Пометка = Истина;
		НоваяСтрока.Актив = Выборка.Актив;
		НоваяСтрока.Портфель = Выборка.Портфель;
		НоваяСтрока.СубПортфель = Выборка.СубПортфель;
		НоваяСтрока.Статус = Выборка.Статус;
		НоваяСтрока.ДатаПослСтатуса = Выборка.ДатаПослСтатуса;
		НоваяСтрока.Количество = Выборка.Количество;
		НоваяСтрока.СтатусПоручение = Выборка.СтатусПоручение;
		НоваяСтрока.Поручение = Выборка.ПоручениеНаПродажу;
		НоваяСтрока.КоличествоНаименованийАктивов = 1;
			
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьПорученияПродажа(КоличествоПоручений, ТекстОшибки, ВажностьОшибки) Экспорт
	
	СозданныеДокументы = Новый Массив;
	
	ТекстОшибки = "";
	счКолАктивов = 0;
	счКолПоручений = 0;
	
	Для каждого СтрокаТаб Из СписокПортфелейПродажа Цикл  
		
		Если не СтрокаТаб.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаб.КоличествоПоручений = 0;
		
		Если не СтрокаТаб.Поручение.Пустая() Тогда
			СтрокаТаб.КоличествоПоручений = 1;
			Продолжить;
		КонецЕсли;
		
		счКолАктивов = счКолАктивов + 1;
		
		ПараметрыПоручения = новый Структура;
		ПараметрыПоручения.Вставить("НомерЦены", 2);
		ПараметрыПоручения.Вставить("Направление", Перечисления.ВидыОперацийСделки.Продажа);
		ПараметрыПоручения.Вставить("Портфель", СтрокаТаб.Портфель);
		ПараметрыПоручения.Вставить("СубПортфель", СтрокаТаб.СубПортфель);
		ПараметрыПоручения.Вставить("Актив", СтрокаТаб.Актив);
		ПараметрыПоручения.Вставить("Цена", 1);
		ПараметрыПоручения.Вставить("Количество", СтрокаТаб.Количество);
		
		НачатьТранзакцию();
		
		Поручение = ЗаписатьПоручение(ПараметрыПоручения, 0, ТекстОшибки);
		
		Если ЗначениеЗаполнено(Поручение) Тогда  
			СтрокаТаб.КоличествоПоручений = 1;
			СтрокаТаб.Поручение = Поручение;
			
			СозданныеДокументы.Добавить(Поручение);
			ЭтотОбъект.Лог.ДобавитьСтроку("[inf] Для портфеля " + СтрокаТаб.Портфель + " сформировано поручение на продажу актива " + СтрокаТаб.Актив + ", " + СтрокаТаб.Количество + " шт.");
			
			ЗафиксироватьТранзакцию();
		Иначе
			ЭтотОбъект.Лог.ДобавитьСтроку("[err] Для портфеля " + СтрокаТаб.Портфель + " не сформировано поручение на продажу актива " + СтрокаТаб.Актив + ", " + СтрокаТаб.Количество + " шт.");
			ЭтотОбъект.Лог.ДобавитьСтроку(ТекстОшибки); 
			ОтменитьТранзакцию();
		КонецЕсли;
		
	КонецЦикла;
	
	тзПортфели = СписокПортфелейПродажа.Выгрузить();
	тзПортфели.Свернуть("Портфель", "КоличествоПоручений,КоличествоНаименованийАктивов");
	Для каждого СтрокаПортфель Из тзПортфели Цикл
		Если СтрокаПортфель.КоличествоПоручений = СтрокаПортфель.КоличествоНаименованийАктивов Тогда
			ОбновитьСтатусПоПортфелю(СтрокаПортфель.Портфель, СтатусОрдераНаПродажуСформированы); 
			ЭтотОбъект.Лог.ДобавитьСтроку("[inf] сформированы все поручения на продажу. Портфель: " + СтрокаПортфель.Портфель);
		КонецЕсли;
	КонецЦикла;
	
	ОтправитьПоручения(СозданныеДокументы);
	
	КоличествоПоручений = СозданныеДокументы.Количество();

	//Если ТекстОшибки = "" И счКолПоручений > 0 И счКолПоручений = счКолАктивов Тогда
	//	ОбновитьСтатусПоПортфелю(Выборка.Портфель, СтатусОрдераНаПродажуСформированы); 
	//Иначе
	//	ЭтотОбъект.Лог.ДобавитьСтроку("[err] Ошибка создания поручения на продажу. Портфель: " + ВыборкаПоПортфелю.Портфель);
	//	Если счКолАктивов = 0 Тогда
	//		ЭтотОбъект.Лог.ДобавитьСтроку("[warn] Нет активов на остатке");
	//	КонецЕсли;
	//	Если счКолПоручений <> счКолАктивов Тогда
	//		ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf] Позиций на остатке: %1, поручений создано: %2", счКолАктивов, счКолПоручений));
	//	КонецЕсли;
	//	Если ТекстОшибки <> "" Тогда
	//		ЭтотОбъект.Лог.ДобавитьСтроку("[err] " + ТекстОшибки);
	//	КонецЕсли;
	//КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

Процедура РеинвестОбновитьСписокПотфелей(ДатаКупона, НеПоказыватьПортфелиСПоручениями, МинПроцентВалютаОтКупона, МинПроцентВалютаОтСЧА, ТекстОшибки, ВажностьОшибки) Экспорт
	
	ПозицияНаДату = НачалоДня(ТекущаяДата());
	Если ЭтоТест Тогда
		ПозицияНаДату = НачалоДня(ПозицияНаДату-1);
	КонецЕсли;
	ПорученияНаДату = НачалоДня(ТекущаяДата());
	ПрогнозПозицияНаДату = КонецДня(ТекущаяДата());
	
	списСтатусИсключить = новый Массив;
	//списСтатусИсключить.Добавить(СтатусОрдераНаРеИнвСформированы);
	списСтатусИсключить.Добавить(СтатусРасторжениеИнициировано);
	списСтатусИсключить.Добавить(СтатусОрдераНаПродажуСформированы);
	списСтатусИсключить.Добавить(СтатусОрдераНаПродажуОтправлены);
	списСтатусИсключить.Добавить(СтатусОрдераНаПродажуИсполнены);
	списСтатусИсключить.Добавить(СтатусПорученияНаВыводПоданы);
	списСтатусИсключить.Добавить(СтатусПорученияНаВыводИсполнены);
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("НаДату", НачалоДня(ДатаКупона)); 
	Запрос.УстановитьПараметр("ПозицияНаДату", ПозицияНаДату); 
	Запрос.УстановитьПараметр("ПорученияНаДату", ПорученияНаДату); 
	Запрос.УстановитьПараметр("ПрогнозПозицияНаДату", ПрогнозПозицияНаДату); 
	Запрос.УстановитьПараметр("СвойствоСтатус", ДопРеквизитСтатусПортфеля);
	Запрос.УстановитьПараметр("СвойствоДатаСтатус", ДопРеквизитДатаОперации);
	Запрос.УстановитьПараметр("списСтатусИсключить", списСтатусИсключить);
	Запрос.УстановитьПараметр("ПоказыватьПортфелиСПоручениями", Не НеПоказыватьПортфелиСПоручениями);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Объект КАК Портфель,
	|	т.Значение КАК Статус
	|ПОМЕСТИТЬ ВТ_СтатусПортфелей
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК т
	|ГДЕ
	|	т.Свойство = &СвойствоСтатус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Объект КАК Портфель,
	|	т.Значение КАК ДатаПослСтатуса
	|ПОМЕСТИТЬ ВТ_ДатыСтатусПортфелей
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК т
	|ГДЕ
	|	т.Свойство = &СвойствоДатаСтатус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Портфель КАК Портфель,
	|	СУММА(т.Количество) КАК Количество
	|ПОМЕСТИТЬ втДС
	|ИЗ
	|	РегистрСведений.ФактическаяПозиция КАК т
	|ГДЕ
	|	т.Дата = &ПозицияНаДату
	|	И т.Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.Валюты)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Портфель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Портфель КАК Портфель,
	|	т.Субпортфель КАК Субпортфель,
	|	т.Актив КАК Актив,
	|	т.Актив.Объект КАК Облигация,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ втАктивы
	|ИЗ
	|	РегистрСведений.ФактическаяПозиция КАК т
	|ГДЕ
	|	т.Дата = &ПозицияНаДату
	|	И т.Актив.Объект ССЫЛКА Справочник.Облигации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втАктивы.Портфель КАК Портфель,
	|	втАктивы.Субпортфель КАК Субпортфель,
	|	втАктивы.Актив КАК Актив,
	|	втАктивы.Облигация КАК Облигация,
	|	втАктивы.Количество КАК ОстатокЦБ,
	|	ЕСТЬNULL(к.РазмерДоходаВРублях, 0) КАК СуммаНКДзаЕд,
	|	ЕСТЬNULL(втАктивы.Количество, 0) * ЕСТЬNULL(к.РазмерДоходаВРублях, 0) КАК СуммаРеинвестирования,
	|	к.ДатаВыплатыКупонногоДохода КАК ДатаВыплатыКупонногоДохода,
	|	к.ДатаОкончанияКупонногоПериода КАК ДатаОкончанияКупонногоПериода
	|ПОМЕСТИТЬ втКупоны
	|ИЗ
	|	втАктивы КАК втАктивы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонноеРасписаниеПоОблигациям.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&НаДату, ДЕНЬ),
	|				Облигация В
	|					(ВЫБРАТЬ
	|						т.Облигация
	|					ИЗ
	|						втАктивы КАК т)) КАК т
	|		ПО втАктивы.Облигация = т.Облигация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КупонноеРасписание.Купоны КАК к
	|		ПО (т.Документ = к.Ссылка)
	|			И (к.ДатаВыплатыКупонногоДохода = &НаДату)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Портфель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(т.Ссылка) КАК Поручение,
	|	т.Портфель КАК Портфель,
	|	т.Актив КАК Актив,
	|	МАКСИМУМ(с.СтатусРасш) КАК СтатусПоручение
	|ПОМЕСТИТЬ ВТ_Поручения
	|ИЗ
	|	Документ.Поручение КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПоручений КАК с
	|		ПО т.Ссылка = с.Поручение
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(т.Дата, ДЕНЬ) = &ПорученияНаДату
	|	И т.Проведен
	|	И т.Актив В
	|			(ВЫБРАТЬ
	|				т.Актив
	|			ИЗ
	|				втКупоны КАК т)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Портфель,
	|	т.Актив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Портфель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК Пометка,
	|	т.Портфель КАК Портфель,
	|	т.Субпортфель КАК Субпортфель,
	|	т.Актив КАК Актив,
	|	т.ОстатокЦБ КАК ОстатокЦБ,
	|	т.СуммаНКДзаЕд КАК СуммаНКДзаЕд,
	|	т.СуммаРеинвестирования КАК СуммаРеинвестирования,
	|	ЕСТЬNULL(втДС.Количество, 0) КАК ФактДС,
	|	ВТ_СтатусПортфелей.Статус КАК Статус,
	|	ВТ_Поручения.Поручение КАК Поручение,
	|	ВТ_Поручения.СтатусПоручение КАК СтатусПоручение,
	|	ВТ_ДатыСтатусПортфелей.ДатаПослСтатуса КАК ДатаПослСтатуса,
	|	ЕСТЬNULL(втДС.Количество, 0) + ЕСТЬNULL(ПрогнозВлюта.КоличествоОстаток, 0) + ЕСТЬNULL(ПланВалюта.КоличествоОстаток, 0) КАК ОстатокДС,
	|	тСЧА.СЧА КАК СЧА
	|ИЗ
	|	втКупоны КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДС КАК втДС
	|		ПО т.Портфель = втДС.Портфель
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусПортфелей КАК ВТ_СтатусПортфелей
	|		ПО т.Портфель = ВТ_СтатусПортфелей.Портфель
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыСтатусПортфелей КАК ВТ_ДатыСтатусПортфелей
	|		ПО т.Портфель = ВТ_ДатыСтатусПортфелей.Портфель
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поручения КАК ВТ_Поручения
	|		ПО т.Портфель = ВТ_Поручения.Портфель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрогнозПоПоручению.Остатки(&ПрогнозПозицияНаДату, Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.Валюты)) КАК ПрогнозВлюта
	|		ПО т.Портфель = ПрогнозВлюта.Портфель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановаяПозиция.Остатки(&ПрогнозПозицияНаДату, Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.Валюты)) КАК ПланВалюта
	|		ПО т.Портфель = ПланВалюта.Портфель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрРСА_СЧА.СрезПоследних(&ПрогнозПозицияНаДату, ) КАК тСЧА
	|		ПО т.Портфель = тСЧА.Портфель
	|ГДЕ
	|	т.СуммаРеинвестирования > 0
	|	И НЕ ВТ_СтатусПортфелей.Статус В (&списСтатусИсключить)
	|	И (&ПоказыватьПортфелиСПоручениями
	|			ИЛИ НЕ &ПоказыватьПортфелиСПоручениями
	|				И ВТ_Поручения.Поручение ЕСТЬ NULL)";
	
	СписокПортфелейРеинвестирование.Загрузить(Запрос.Выполнить().Выгрузить()); 
	масСтрокиУдалить = новый Массив;
	
	Для каждого СтрокаРеинвест Из СписокПортфелейРеинвестирование Цикл
		
		СуммаРеинвестирования1 = 0;
		СуммаРеинвестирования2 = 0;
		
		Если МинПроцентВалютаОтКупона <> 0 Тогда
			СуммаРеинвестирования1 = Окр(СтрокаРеинвест.СуммаРеинвестирования * (1 - МинПроцентВалютаОтКупона / 100), 2);
		КонецЕсли;
		
		Если МинПроцентВалютаОтСЧА <> 0 Тогда
			МинОстатокДС = Окр(СтрокаРеинвест.СЧА * МинПроцентВалютаОтСЧА / 100, 2);
			СуммаПоСЧА = Макс(0, СтрокаРеинвест.СуммаРеинвестирования + СтрокаРеинвест.ОстатокДС - МинОстатокДС);
			СуммаРеинвестирования2 = Мин(СтрокаРеинвест.СуммаРеинвестирования, СуммаПоСЧА);
		КонецЕсли;
		
		Если СуммаРеинвестирования1 > 0 И СуммаРеинвестирования2 > 0 Тогда
			СтрокаРеинвест.СуммаРеинвестирования = Мин(СуммаРеинвестирования1, СуммаРеинвестирования2);
		ИначеЕсли СуммаРеинвестирования1 > 0 Или СуммаРеинвестирования2 > 0 Тогда
			СтрокаРеинвест.СуммаРеинвестирования = Макс(СуммаРеинвестирования1, СуммаРеинвестирования2);
		КонецЕсли;
		
		Если СтрокаРеинвест.СуммаРеинвестирования > (СтрокаРеинвест.ОстатокДС) Тогда
			СтрокаРеинвест.СуммаРеинвестирования = СтрокаРеинвест.ОстатокДС;
		КонецЕсли;
		
		СуммаПодКомисси = СтрокаРеинвест.СуммаРеинвестирования * ПроцентКомиссияБрокер / 100;
		
		СтрокаРеинвест.СуммаРеинвестирования = СтрокаРеинвест.СуммаРеинвестирования - СуммаПодКомисси;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РеинвестСоздатьИОтправитьОрдера(КоличествоПоручений, ТекстОшибки, ВажностьОшибки) Экспорт
	
	ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf] Начало создать поручения на покупку: %1", ТекущаяДата()));
	
	ПорученияНаОтправку = новый Массив;
	ПараметрыОперации = новый Структура;
	ПараметрыОперации.Вставить("НомерПотока", 0);
	ПараметрыОперации.Вставить("ПортфелиСписок", СписокПортфелейРеинвестирование.Выгрузить(новый Структура("Пометка", Истина))); 
	
	АдресРез = Неопределено;
	
	РеинвестСоздатьОрдера(ПараметрыОперации, АдресРез);
	
	СтруктураОтвета = ПолучитьИзВременногоХранилища(АдресРез);
	
	Если ТипЗнч(СтруктураОтвета) = Тип("Структура") Тогда
		
		ПорученияНаОтправку = СтруктураОтвета.ПорученияНаОтправку;
		
		ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf] Начало отправить поручения в торовую систему: %1", ТекущаяДата()));
		
		КоличествоПоручений = ПорученияНаОтправку.Количество();
		ОтправитьПоручения(ПорученияНаОтправку);
		
		ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf] Финиш отправить поручения (%2) в торовую систему: %1", ТекущаяДата()), КоличествоПоручений);

	Иначе
		ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf] Финиш создать поручения на покупку: %1", ТекущаяДата()));
		ЭтотОбъект.Лог.ДобавитьСтроку("[err] Что-то пошло не так, получили пустой отвеит из хранилища...");
	КонецЕсли;
	
КонецПроцедуры

Процедура РеинвестСоздатьПрогнознуюПозицию(КоличествоПоручений, ТекстОшибки, ВажностьОшибки) Экспорт
	
	ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf] Начало создать прогнозную позицию: %1", ТекущаяДата()));
	
	Для каждого СтрокаПортфель Из СписокПортфелейРеинвестирование Цикл
		
		Если не СтрокаПортфель.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаПортфель.ОстатокДС >= СтрокаПортфель.СуммаРеинвестирования Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписатьНеторговоеПоручение(СтрокаПортфель.Портфель, СтрокаПортфель.СубПортфель, СтрокаПортфель.СуммаРеинвестирования);
		КоличествоПоручений = КоличествоПоручений + 1;
		
	КонецЦикла;
	
	ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf] Финиш создать прогнозную позицию: %1", ТекущаяДата()));
КонецПроцедуры

Процедура РеинвестСоздатьОрдера(Параметры, АдресВоВременномХранилище) Экспорт
	
	ПортфелиСписок = Параметры.ПортфелиСписок;
	НомерПотока = Параметры.НомерПотока;
	
	Если НомерПотока <> 0 Тогда
		ПараметрыВыполнения = Новый Структура;
		ПараметрыВыполнения.Вставить("ДополнительнаяОбработкаСсылка", Параметры.ОбработкаСсылка);
		УстановитьНастройки(ПараметрыВыполнения);
	КонецЕсли;
	
	КоличествоПоручений = 0;
	ТекстОшибки = "";
	ВажностьОшибки = 0;
	
	КешЦена = новый Соответствие;
	ПорученияНаОтправку = новый Массив; 
	
	НовоеПоручение = Документы.Поручение.ПустаяСсылка();
	ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf] Обработка пакета %1. Поручений %2; Начало: %3", НомерПотока, ПортфелиСписок.Количество(), ТекущаяДата()));
	
	Для каждого СтрокаПортфель Из ПортфелиСписок Цикл
		
		//Если не СтрокаПортфель.Пометка Тогда
		//	Продолжить;
		//КонецЕсли;
		
		Если не СтрокаПортфель.Поручение.Пустая() Тогда
			ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf] Для портфеля %1 уже создано поручение %2", СтрокаПортфель.Портфель, СтрокаПортфель.Поручение));
		КонецЕсли;
		
		ЦенаАктива = КешЦена[СтрокаПортфель.Актив]; 
		
		Если ЦенаАктива = Неопределено Тогда
			Цена = 100;
			Количество = 100;
		Иначе
			Цена = ЦенаАктива.Цена;
			Количество = Цел(СтрокаПортфель.СуммаРеинвестирования / (ЦенаАктива.ЦенаВВалютеРасчетов + ЦенаАктива.Купон));
		КонецЕсли;
		
		Если Количество = 0 Тогда
			ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf] Для портфеля %1 не создано поручение, не хватате ДС. Сумма реинвестирования %2", СтрокаПортфель.Портфель, СтрокаПортфель.СуммаРеинвестирования));
		КонецЕсли;
		
		ПараметрыПоручения = новый Структура;
		ПараметрыПоручения.Вставить("НомерЦены", 2);
		ПараметрыПоручения.Вставить("Направление", Перечисления.ВидыОперацийСделки.Покупка);
		ПараметрыПоручения.Вставить("Портфель", СтрокаПортфель.Портфель);
		ПараметрыПоручения.Вставить("СубПортфель", СтрокаПортфель.СубПортфель);
		ПараметрыПоручения.Вставить("Актив", СтрокаПортфель.Актив);
		ПараметрыПоручения.Вставить("Цена", Цена);
		ПараметрыПоручения.Вставить("Количество", Количество);
		
		Если ЦенаАктива = Неопределено Тогда
			НовоеПоручение = ЗаписатьПоручение(ПараметрыПоручения, СтрокаПортфель.СуммаРеинвестирования, ТекстОшибки);
			Если не НовоеПоручение.Пустая() Тогда 
				ЦенаАктива = новый Структура("Цена,ЦенаВВалютеРасчетов,Купон");
				ЗаполнитьЗначенияСвойств(ЦенаАктива, НовоеПоручение);
				КешЦена.Вставить(СтрокаПортфель.Актив, ЦенаАктива);
			КонецЕсли;
		Иначе
			НовоеПоручение = ЗаписатьПоручение(ПараметрыПоручения, 0, ТекстОшибки);
		КонецЕсли;
		
		Если не НовоеПоручение.Пустая() Тогда 
			ПорученияНаОтправку.Добавить(НовоеПоручение);
			ОбновитьСтатусПоПортфелю(СтрокаПортфель.Портфель, СтатусОрдераНаРеИнвСформированы); 
		КонецЕсли;
	КонецЦикла;
	
	СтруктураОтвета = новый Структура("КоличествоПоручений,ТекстОшибки,ВажностьОшибки", КоличествоПоручений, ТекстОшибки, ВажностьОшибки);
	СтруктураОтвета.Вставить("Лог", ЭтотОбъект.Лог.ПолучитьТекст());
	СтруктураОтвета.Вставить("НомерПотока", НомерПотока);
	СтруктураОтвета.Вставить("ПорученияНаОтправку", новый ФиксированныйМассив(ПорученияНаОтправку));

	ПоместитьВоВременноеХранилище(СтруктураОтвета, АдресВоВременномХранилище);
	
КонецПроцедуры

Процедура БлокировкиПродажиОбновитьСписокПотфелей(ВариантПродажи, НеПоказыватьПортфелиСПоручениями, ТекстОшибки, ВажностьОшибки) Экспорт
	
	ПозицияНаДату = НачалоДня(ТекущаяДата());
	Если ЭтоТест Тогда
		ПозицияНаДату = НачалоДня(КалендарныеГрафики.ПолучитьСледующуюРабочуюДату(Справочники.ПроизводственныеКалендари.ТорговыйКалендарьММВБ, ПозицияНаДату, -1));
	КонецЕсли;
	
	ПорученияНаДату = НачалоДня(ТекущаяДата());
	ПрогнозПозицияНаДату = КонецДня(ТекущаяДата());
	
	списСтатусИсключить = новый Массив;
	//списСтатусИсключить.Добавить(СтатусОрдераНаРеИнвСформированы);
	списСтатусИсключить.Добавить(СтатусРасторжениеИнициировано);
	списСтатусИсключить.Добавить(СтатусОрдераНаПродажуСформированы);
	списСтатусИсключить.Добавить(СтатусОрдераНаПродажуОтправлены);
	списСтатусИсключить.Добавить(СтатусОрдераНаПродажуИсполнены);
	списСтатусИсключить.Добавить(СтатусПорученияНаВыводПоданы);
	списСтатусИсключить.Добавить(СтатусПорученияНаВыводИсполнены);
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ПозицияНаДату", ПозицияНаДату); 
	Запрос.УстановитьПараметр("ПорученияНаДату", ПорученияНаДату); 
	Запрос.УстановитьПараметр("ПрогнозПозицияНаДату", ПрогнозПозицияНаДату); 
	Запрос.УстановитьПараметр("СвойствоСтатус", ДопРеквизитСтатусПортфеля);
	Запрос.УстановитьПараметр("СвойствоДатаСтатус", ДопРеквизитДатаОперации);
	Запрос.УстановитьПараметр("списСтатусИсключить", списСтатусИсключить);
	Запрос.УстановитьПараметр("LQDT", АктивВимЛиквидность); 
	Запрос.УстановитьПараметр("ПоказыватьПортфелиСПоручениями", не НеПоказыватьПортфелиСПоручениями); 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Объект КАК Портфель,
	|	т.Значение КАК Статус
	|ПОМЕСТИТЬ ВТ_СтатусПортфелей
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК т
	|ГДЕ
	|	т.Свойство = &СвойствоСтатус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Объект КАК Портфель,
	|	т.Значение КАК ДатаПослСтатуса
	|ПОМЕСТИТЬ ВТ_ДатыСтатусПортфелей
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК т
	|ГДЕ
	|	т.Свойство = &СвойствоДатаСтатус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Портфель КАК Портфель,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ втДС
	|ИЗ
	|	РегистрСведений.ФактическаяПозиция КАК т
	|ГДЕ
	|	т.Дата = &ПозицияНаДату
	|	И т.Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.Валюты)
	|	И т.МестоХранения.ВидМестаХранения = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыМестХранения.БрокерскиеСчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Портфель КАК Портфель,
	|	т.Субпортфель КАК Субпортфель,
	|	т.Актив КАК Актив,
	|	т.Актив.Объект КАК Облигация,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ втАктивы
	|ИЗ
	|	РегистрСведений.ФактическаяПозиция КАК т
	|ГДЕ
	|	т.Дата = &ПозицияНаДату
	|	И т.Актив = &LQDT
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(т.Ссылка) КАК Поручение,
	|	т.Портфель КАК Портфель,
	|	т.Актив КАК Актив,
	|	МАКСИМУМ(с.СтатусРасш) КАК СтатусПоручение
	|ПОМЕСТИТЬ ВТ_Поручения
	|ИЗ
	|	Документ.Поручение КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПоручений КАК с
	|		ПО т.Ссылка = с.Поручение
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(т.Дата, ДЕНЬ) = &ПорученияНаДату
	|	И т.Проведен
	|	И т.Актив В
	|			(ВЫБРАТЬ
	|				т.Актив
	|			ИЗ
	|				втАктивы КАК т)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Портфель,
	|	т.Актив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Портфель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК Пометка,
	|	т.Портфель КАК Портфель,
	|	т.Субпортфель КАК Субпортфель,
	|	т.Актив КАК Актив,
	|	т.Количество КАК ОстатокЦБ,
	|	ЕСТЬNULL(-Блок.КоличествоОстаток, 0) КАК СуммаБлокировки,
	|	ЕСТЬNULL(втДС.Количество, 0) КАК ФактОстатокДС,
	|	ЕСТЬNULL(План.КоличествоОстаток, 0) КАК ПланОстатокДС,
	|	ЕСТЬNULL(Прогноз.КоличествоОстаток, 0) КАК ПрогнозОстатокДС,
	|	ВТ_СтатусПортфелей.Статус КАК Статус,
	|	ВТ_Поручения.Поручение КАК Поручение,
	|	ВТ_Поручения.СтатусПоручение КАК СтатусПоручение,
	|	ВТ_ДатыСтатусПортфелей.ДатаПослСтатуса КАК ДатаПослСтатуса,
	|	ЕСТЬNULL(втДС.Количество, 0) + ЕСТЬNULL(План.КоличествоОстаток, 0) + ЕСТЬNULL(Прогноз.КоличествоОстаток, 0) КАК ОстатокДС
	|ИЗ
	|	втАктивы КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДС КАК втДС
	|		ПО т.Портфель = втДС.Портфель
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусПортфелей КАК ВТ_СтатусПортфелей
	|		ПО т.Портфель = ВТ_СтатусПортфелей.Портфель
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыСтатусПортфелей КАК ВТ_ДатыСтатусПортфелей
	|		ПО т.Портфель = ВТ_ДатыСтатусПортфелей.Портфель
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поручения КАК ВТ_Поручения
	|		ПО т.Портфель = ВТ_Поручения.Портфель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрогнозПоПоручению.Остатки(
	|				&ПрогнозПозицияНаДату,
	|				Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.Валюты)
	|					И Поручение.ВидОперацииНеторговогоПоручения = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНеторговыхПоручений.Вывод)) КАК Блок
	|		ПО т.Портфель = Блок.Портфель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрогнозПоПоручению.Остатки(&ПрогнозПозицияНаДату, Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.Валюты)) КАК Прогноз
	|		ПО т.Портфель = Прогноз.Портфель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановаяПозиция.Остатки(&ПрогнозПозицияНаДату, Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.Валюты)) КАК План
	|		ПО т.Портфель = План.Портфель
	|ГДЕ
	|	НЕ ВТ_СтатусПортфелей.Статус В (&списСтатусИсключить)
	|	И ЕСТЬNULL(Блок.КоличествоОстаток, 0) < 0
	|	И (&ПоказыватьПортфелиСПоручениями
	|			ИЛИ НЕ &ПоказыватьПортфелиСПоручениями
	|				И ВТ_Поручения.Поручение ЕСТЬ NULL)"; 
	
	Если ВариантПродажи = "OFZ" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "т.Актив = &LQDT", "т.Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.ОблигацииГосРФ)");
	КонецЕсли;
	
	СписокПортфелейПродажиПодБлокировки.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура БлокировкиПродажиСоздатьОрдера(Параметры, АдресВоВременномХранилище) Экспорт
	
	ПортфелиСписок = Параметры.ПортфелиСписок;
	НомерПотока = Параметры.НомерПотока;
	
	Если НомерПотока <> 0 Тогда
		ПараметрыВыполнения = Новый Структура;
		ПараметрыВыполнения.Вставить("ДополнительнаяОбработкаСсылка", Параметры.ОбработкаСсылка);
		УстановитьНастройки(ПараметрыВыполнения);
	КонецЕсли;
	
	КоличествоПоручений = 0;
	ТекстОшибки = "";
	ВажностьОшибки = 0;
	
	КешЦена = новый Соответствие;
	ПорученияНаОтправку = новый Массив; 
	
	НовоеПоручение = Документы.Поручение.ПустаяСсылка();
	ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf] Обработка пакета %1. Поручений %2; Начало: %3", НомерПотока, ПортфелиСписок.Количество(), ТекущаяДата()));
	
	Для каждого СтрокаПортфель Из ПортфелиСписок Цикл
		
		//Если не СтрокаПортфель.Пометка Тогда
		//	Продолжить;
		//КонецЕсли;
		
		Если не СтрокаПортфель.Поручение.Пустая() Тогда
			ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf] Для портфеля %1 уже создано поручение %2", СтрокаПортфель.Портфель, СтрокаПортфель.Поручение));
		КонецЕсли;
		
		ЦенаАктива = КешЦена[СтрокаПортфель.Актив];
		СуммаПорученияВклКомиссию = СтрокаПортфель.СуммаПоручения * 1.003; // сумма поручения увеличиваем на 0.3% 
		
		Если ЦенаАктива = Неопределено Тогда
			Цена = 100;
			Количество = 100;
		Иначе
			Цена = ЦенаАктива.Цена;
			Количество = Цел(СуммаПорученияВклКомиссию / (ЦенаАктива.ЦенаВВалютеРасчетов + ЦенаАктива.Купон));
			Если (ЦенаАктива.ЦенаВВалютеРасчетов + ЦенаАктива.Купон) * Количество < СуммаПорученияВклКомиссию Тогда
				Количество = Количество + 1;
			КонецЕсли;
		КонецЕсли;
		
		Если Количество > СтрокаПортфель.ОстатокЦБ Тогда
			Количество = СтрокаПортфель.ОстатокЦБ;
			ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf] Для портфеля %1 не хватает активов. Требуется %2, доступно: %3", СтрокаПортфель.Портфель, Количество, СтрокаПортфель.ОстатокЦБ));
		КонецЕсли;
		
		ПараметрыПоручения = новый Структура;
		ПараметрыПоручения.Вставить("НомерЦены", 2);
		ПараметрыПоручения.Вставить("Направление", Перечисления.ВидыОперацийСделки.Продажа);
		ПараметрыПоручения.Вставить("Портфель", СтрокаПортфель.Портфель);
		ПараметрыПоручения.Вставить("СубПортфель", СтрокаПортфель.СубПортфель);
		ПараметрыПоручения.Вставить("Актив", СтрокаПортфель.Актив);
		ПараметрыПоручения.Вставить("Цена", Цена);
		ПараметрыПоручения.Вставить("Количество", Количество);
		ПараметрыПоручения.Вставить("КоличествоОстаток", СтрокаПортфель.ОстатокЦБ);
		
		Если ЦенаАктива = Неопределено Тогда
			НовоеПоручение = ЗаписатьПоручение(ПараметрыПоручения, СуммаПорученияВклКомиссию, ТекстОшибки);
			Если не НовоеПоручение.Пустая() Тогда 
				ЦенаАктива = новый Структура("Цена,ЦенаВВалютеРасчетов,Купон");
				ЗаполнитьЗначенияСвойств(ЦенаАктива, НовоеПоручение);
				КешЦена.Вставить(СтрокаПортфель.Актив, ЦенаАктива);
			КонецЕсли;
		Иначе
			НовоеПоручение = ЗаписатьПоручение(ПараметрыПоручения, 0, ТекстОшибки);
		КонецЕсли;
		
		Если не НовоеПоручение.Пустая() Тогда 
			ПорученияНаОтправку.Добавить(НовоеПоручение);
			ОбновитьСтатусПоПортфелю(СтрокаПортфель.Портфель, СтатусОрдераНаРеИнвСформированы); 
		КонецЕсли;
	КонецЦикла;
	
	СтруктураОтвета = новый Структура("КоличествоПоручений,ТекстОшибки,ВажностьОшибки", КоличествоПоручений, ТекстОшибки, ВажностьОшибки);
	СтруктураОтвета.Вставить("Лог", ЭтотОбъект.Лог.ПолучитьТекст());
	СтруктураОтвета.Вставить("НомерПотока", НомерПотока);
	СтруктураОтвета.Вставить("ПорученияНаОтправку", новый ФиксированныйМассив(ПорученияНаОтправку));

	ПоместитьВоВременноеХранилище(СтруктураОтвета, АдресВоВременномХранилище);
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиПоручения(МассивПоручений,ТабДок,Макет,Тип)
	
	ОбластьПорученияОФЗСтрока = Макет.ПолучитьОбласть("ПорученияОФЗСтрока");
	
	Для каждого ТекСтр Из МассивПоручений Цикл
			   
			ОбластьПорученияОФЗСтрока.Параметры.Портфель  = ТекСтр.Портфель; 
			ОбластьПорученияОФЗСтрока.Параметры.Сумма     = ТекСтр.ЦенаВВалютеРасчетов * ТекСтр.Количество;
			ОбластьПорученияОФЗСтрока.Параметры.Поручение = ТекСтр;
			ОбластьПорученияОФЗСтрока.Параметры.Актив     = ТекСтр.Актив;
			ОбластьПорученияОФЗСтрока.Параметры.ТипПоручения = Тип; 
			
			ТабДок.Вывести(ОбластьПорученияОФЗСтрока);
			
	КонецЦикла;
	
КонецПроцедуры

//Отправка списка поручений
Процедура ОтправитьПоручения(СписокПоручений) Экспорт
	
	ДатаПроверки = КонецДня(ТекущаяДатаСеанса());
	Указания = РаспорядителиВызовСервера.ПараметрыПроверки(ДатаПроверки);
	Указания.ИспользоватьФоновыеЗадания = Истина;
	Указания.ДатаПроверки = ДатаПроверки;
	Указания.Портфели = ПортфелиПоручений(СписокПоручений);
	Указания.Поручения = СписокПоручений;
	Указания.ОтправитьПослеПроверки = Истина;
	
	РезультатПроверки = Распорядители.ПроверкаИОтправка(Указания);
	
	Для Каждого Сообщение Из РезультатПроверки.СообщенияПользователю Цикл
		ЗаписьЖурналаРегистрации("RetailDU. Отправка поручения: ", УровеньЖурналаРегистрации.Информация, , , Сообщение.Текст);
		ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf] Отправка поручения: %1", Сообщение.Текст));
	КонецЦикла;
	
КонецПроцедуры

Функция ПортфелиПоручений(СписокПоручений)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоручениеРаспределениеПоПортфелям.Портфель КАК Портфель
	|ИЗ
	|	Документ.Поручение.РаспределениеПоПортфелям КАК ПоручениеРаспределениеПоПортфелям
	|ГДЕ
	|	ПоручениеРаспределениеПоПортфелям.Ссылка В (&СписокПоручений)");
	Запрос.УстановитьПараметр("СписокПоручений", СписокПоручений);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Портфель");
	
КонецФункции

Функция ПолучитьСуммуПотокаБумаги(Актив, ТаблицаПотоков)
	
	Стр = ТаблицаПотоков.Найти(Актив,"Актив");
	
	Если Стр = Неопределено Тогда
		ВызватьИсключение "Не найден поток по активу "+Актив;
	КонецЕсли;
	
	Возврат Стр.Сумма;
	
КонецФункции

//Процедура Берет ОФЗ, берет купонное расписание данной ОФЗ
//после этого анализирует расписание и погашение 
Функция РассчитатьПотокПоОФЗ(ДатаРасчета)
	
	//Возвращает поток БЕЗ учета КУПОНА, который нужно отдать при покупке
	ТабПотокОФЗ = Новый Соответствие;
	
	СтавкаНДФЛ = 15;
	
	Для каждого СтрокаНастройка Из НастройкаСтратегий Цикл
		
		Если ТабПотокОФЗ[СтрокаНастройка.ОсновнойАктивДляПокупки] <> Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Облигация = СтрокаНастройка.ОсновнойАктивДляПокупки.Объект;
		ЭтотОбъект.Лог.ДобавитьСтроку("[inf] Расчет параметров по : " + Облигация);
		
		ДетРасчет = новый Структура;
		ДетРасчет.Вставить("ТекНКД", Окр(Перечисления.МетодыРасчетаНКД.НКД_НаДату(Облигация, , ДатаРасчета), 2));
		ДетРасчет.Вставить("НоминальнаяСтоимость", Справочники.Облигации.ПолучитьНоминальнуюСтоимость(Облигация, ДатаРасчета));
		ДетРасчет.Вставить("СуммаКупонРеИнвест", 0);
		ДетРасчет.Вставить("СуммаКупонБезНалога", 0);
		ДетРасчет.Вставить("РазницаДляНДФЛ", 0);
		ДетРасчет.Вставить("КупонныйДоходКПоолучению", 0);
		ДетРасчет.Вставить("ЦенаПродажиРуб", 0); 
		ДетРасчет.Вставить("ПроцентПотерьАкции", СтрокаНастройка.ПроцентПотерьАкции);
		ДетРасчет.Вставить("СтавкаРеинвест", СтрокаНастройка.СтавкаРеинвест);
		ДетРасчет.Вставить("СтавкаДисконтаЦены", СтрокаНастройка.СтавкаДисконтаЦены);
		ДетРасчет.Вставить("ПроцентКомиссияУправляющий", СтрокаНастройка.ПроцентКомиссияУправляющий);
			
		ДенежныйПоток = Документы.КупонноеРасписание.ДенежныйПотокПоАктиву(Облигация, ДатаРасчета);
		
		Если СтрокаНастройка.ГоризонтИнвестирования = 3 Тогда
			ДатаПродажи = ДатаРасчета + 1106*24*3600;
		ИначеЕсли СтрокаНастройка.ГоризонтИнвестирования = 5 Тогда
			ДатаПродажи = ДатаРасчета + 1826*24*3600;
		Иначе
			ДатаПродажи = ДобавитьМесяц(ДатаРасчета, 12 * СтрокаНастройка.ГоризонтИнвестирования);
		КонецЕсли;
		
		ПризнакРеинвест = 0;
		СуммаКупон = 0;
		СуммаКупонБезНалога = 0;
		СуммаКупонРеИнвест = 0;
		СрокДоПогашения = 0; 
		МаксДата = ?(ДенежныйПоток.Купоны.Количество() > 0, ДенежныйПоток.Купоны[ДенежныйПоток.Купоны.Количество()-1].ДатаОкончанияКупонногоПериода, Дата("00010101"));
		
		ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf]	%1	%2	%3	%4	%5", 
			СтрКолонкаПрав("date", 12), 
			СтрКолонкаПрав("cpn, net of tax", 20), 
			СтрКолонкаПрав("reinv cpn", 20), 
			СтрКолонкаПрав("days", 10), 
			СтрКолонкаПрав("reinv rate", 10)));  
			
		флПрошлиДатуПродажи = Ложь;
		ПривСуммаВыплатыГрос = 0;
		ПривСуммаВыплатыКупон = 0;
		
		Для Каждого ТекСтр ИЗ ДенежныйПоток.Купоны Цикл
			
			Если ТекСтр.ДатаОкончанияКупонногоПериода >= ДатаРасчета И ТекСтр.ДатаНачалаКупонногоПериода <= ДатаПродажи Тогда 	
				
				Если ТекСтр.ДатаОкончанияКупонногоПериода <= ДатаПродажи Тогда
					СрокДоПогашения = ТекСтр.КолДнейВКупонномПериоде;
					СуммаКупон = ТекСтр.РазмерДоходаВРублях;
				Иначе
					СрокДоПогашения = Цел((ДатаПродажи - ТекСтр.ДатаНачалаКупонногоПериода)/(24*3600))+1;
					СуммаКупон = Окр(ТекСтр.РазмерДоходаВРублях / ТекСтр.КолДнейВКупонномПериоде * СрокДоПогашения, 2);
				КонецЕсли;
				
				СуммаКупонРеИнвест = ПризнакРеинвест * Окр((СуммаКупонБезНалога + СуммаКупонРеИнвест) * (1 + СтрокаНастройка.СтавкаРеинвест / 100 * СрокДоПогашения / 365), 2);
				
				СуммаКупонБезНалога = Окр(СуммаКупон * (1 - СтавкаНДФЛ / 100), 2);
				
				Если ТекСтр.ДатаОкончанияКупонногоПериода <= ДатаПродажи Тогда
					ДетРасчет.СуммаКупонБезНалога = ДетРасчет.СуммаКупонБезНалога + СуммаКупонБезНалога;
				КонецЕсли;
				
				ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf]	%1	%2	%3	%4	%5", 
					СтрКолонкаПрав(Формат(ТекСтр.ДатаОкончанияКупонногоПериода, "ДФ=dd.MM.yyyy"), 12), 
					СтрКолонкаПрав(СуммаКупонБезНалога, 20), 
					СтрКолонкаПрав(СуммаКупонРеИнвест, 20), 
					СтрКолонкаПрав(СрокДоПогашения, 10), 
					СтрКолонкаПрав(СтрокаНастройка.СтавкаРеинвест, 10)));
					
				ПризнакРеинвест = 1;
				
			КонецЕсли;
			
			Если ТекСтр.ДатаОкончанияКупонногоПериода >= ДатаПродажи Тогда
				//дисконтируем потоки после завершения договра, для определеия цены продажи актива
				СрокДоПродажи = Цел((ТекСтр.ДатаОкончанияКупонногоПериода - ДатаПродажи)/(24*3600))+1;
				СуммаВыплатыКупон = ТекСтр.РазмерДоходаВРублях;
				Если ТекСтр.ДатаНачалаКупонногоПериода < ДатаПродажи Тогда
					СуммаВыплатыКупон = Окр(СуммаВыплатыКупон / ТекСтр.КолДнейВКупонномПериоде * (Цел((ДатаПродажи - ТекСтр.ДатаНачалаКупонногоПериода)/(24*3600))+1), 2);
				КонецЕсли;
				
				СуммаВыплаты = ?(ТекСтр.ДатаОкончанияКупонногоПериода = МаксДата, ДетРасчет.НоминальнаяСтоимость, 0) + ТекСтр.РазмерДоходаВРублях;
				ПривСуммаВыплаты = Окр(СуммаВыплаты / Pow(1 + СтрокаНастройка.СтавкаДисконтаЦены / 100, СрокДоПродажи / 365), 2);
				ПривСуммаВыплатыГрос = ПривСуммаВыплатыГрос + ПривСуммаВыплаты;
				
				ПривСуммаВыплаты = Окр(СуммаВыплатыКупон / Pow(1 + СтрокаНастройка.СтавкаДисконтаЦены / 100, СрокДоПродажи / 365), 2);
				ПривСуммаВыплатыКупон = ПривСуммаВыплатыКупон + ПривСуммаВыплаты; 
				
				Если не флПрошлиДатуПродажи Тогда
					флПрошлиДатуПродажи = Истина;
					ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf]	%1	%2	%3	%4	%5", 
						СтрКолонкаПрав("date", 12), 
						СтрКолонкаПрав("days", 10), 
						СтрКолонкаПрав("amount", 20), 
						СтрКолонкаПрав("disc amount", 20),
						СтрКолонкаПрав("disc cpn", 20)));  
				КонецЕсли;
				ЭтотОбъект.Лог.ДобавитьСтроку(СтрШаблон("[inf]	%1	%2	%3	%4	%5", 
					СтрКолонкаПрав(Формат(ТекСтр.ДатаОкончанияКупонногоПериода, "ДФ=dd.MM.yyyy"), 12), 
					СтрКолонкаПрав(СрокДоПродажи, 10), 
					СтрКолонкаПрав(СуммаВыплаты, 20), 
					СтрКолонкаПрав(ПривСуммаВыплатыГрос, 20),
					СтрКолонкаПрав(ПривСуммаВыплатыКупон, 20)));
			КонецЕсли;
				
		КонецЦикла;
		
		Если ПривСуммаВыплатыГрос > 0 Тогда
			ДетРасчет.ЦенаПродажиРуб = ПривСуммаВыплатыГрос - СуммаКупон;
		Иначе
			ДетРасчет.ЦенаПродажиРуб = ДетРасчет.НоминальнаяСтоимость;
		КонецЕсли;
		
		ДетРасчет.СуммаКупонБезНалога = ДетРасчет.СуммаКупонБезНалога ;//- ДетРасчет.ТекНКД;
		ДетРасчет.СуммаКупонРеИнвест = СуммаКупонРеИнвест + СуммаКупонБезНалога;// - ДетРасчет.ТекНКД;
		
		ДетРасчет.РазницаДляНДФЛ = ДетРасчет.СуммаКупонРеИнвест - ДетРасчет.СуммаКупонБезНалога;
		ДетРасчет.КупонныйДоходКПоолучению = Окр(ДетРасчет.СуммаКупонБезНалога + ДетРасчет.РазницаДляНДФЛ * (1 - СтавкаНДФЛ / 100), 2);
		
		ТабПотокОФЗ.Вставить(СтрокаНастройка.ОсновнойАктивДляПокупки, ДетРасчет);
			
		стрРасчет = "
		|[inf] 		Дата расчета: " + Формат(ДатаРасчета, "ДФ=dd.MM.yyyy") + "
		|[inf] 		Срок: " + СтрокаНастройка.ГоризонтИнвестирования + "
		|[inf] 		Дата продажи: " + Формат(ДатаПродажи, "ДФ=dd.MM.yyyy") + "
		|[inf] 		Дата погашения: " + Формат(Облигация.ДатаПогашения, "ДФ=dd.MM.yyyy") + "
		|[inf] 		ТекНКД: " + ДетРасчет.ТекНКД + "
		|[inf] 		НоминальнаяСтоимость: " + ДетРасчет.НоминальнаяСтоимость + "
		|[inf] 		СуммаКупонРеИнвест: " + ДетРасчет.СуммаКупонРеИнвест + "
		|[inf] 		СуммаКупонБезНалога: " + ДетРасчет.СуммаКупонБезНалога + "
		|[inf] 		РазницаДляНДФЛ: " + ДетРасчет.РазницаДляНДФЛ + "
		|[inf] 		КупонныйДоходКПоолучению: " + ДетРасчет.КупонныйДоходКПоолучению + "
		|[inf] 		ЦенаПродажиРуб: " + ДетРасчет.ЦенаПродажиРуб + "
		|";
		
		ЭтотОбъект.Лог.ДобавитьСтроку("[inf] " + стрРасчет);
	КонецЦикла;
	
	
	Возврат ТабПотокОФЗ
	
КонецФункции

Функция РассчитатьКоличествоПоОФЗ(ТекПортфель, Актив, Прм, СуммаИнвестирования, СуммаАллокации, ЦенаПокупкиОФЗ, ТекстОшибки, ВажностьОшибки)
	
	ЭтотОбъект.Лог.ДобавитьСтроку("[inf] Расчет количества ОФЗ. Старт: " + ТекущаяДата());
	
	КолвоОбл = 1;
	
	сч = 1;
	флВыполнить = Истина;
	ВГран = 100000;
	Пока флВыполнить и сч < ВГран Цикл
		сч = сч + 1;
		АллокацияОФЗ = КолвоОбл * ЦенаПокупкиОФЗ;
		АллокацияАкц = СуммаАллокации  - АллокацияОФЗ;
		ОстСтоимостьАкц = АллокацияАкц * (1 - Прм.ПроцентПотерьАкции / 100);
		
		ЭкспирацияОФЗ = КолвоОбл * (Прм.КупонныйДоходКПоолучению + Прм.ЦенаПродажиРуб);
		ЭкспирацияАкц = ОстСтоимостьАкц;
		
		Если (ЭкспирацияОФЗ+ЭкспирацияАкц) < СуммаИнвестирования Тогда
			КолвоОбл = КолвоОбл + 1;
		Иначе
			флВыполнить = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если сч >= ВГран Тогда
		ЭтотОбъект.Лог.ДобавитьСтроку("[warn] выход из расчета по счетчику!");
	КонецЕсли;
	
	Если СуммаАллокации <> 0 Тогда
		АллокацияОФЗ_Прц = Окр(АллокацияОФЗ / СуммаАллокации * 100, 2);
		АллокацияАкц_Прц = Окр(АллокацияАкц / СуммаАллокации * 100, 2);
	Иначе
		АллокацияОФЗ_Прц = "0";
		АллокацияАкц_Прц = "0";
	КонецЕсли;
		
	стрРасчет = "
	|[inf] 		Портфель:         " + ТекПортфель + "
	|[inf] 		Сумма аллокации:  " + СуммаАллокации + "
	|[inf] 		Потери в акциях:  " + Прм.ПроцентПотерьАкции + "%
	|[inf] 		Актив:            " + Актив + "
	|[inf] 		Кол-во ОФЗ:       " + КолвоОбл + "
	|[inf] 		Цена покупки:     " + ЦенаПокупкиОФЗ + "
	|[inf] 		Цена продажи:     " + Прм.ЦенаПродажиРуб + "
	|[inf] 		Аллокация ОФЗ:    " + АллокацияОФЗ + " (" + АллокацияОФЗ_Прц + "%)
	|[inf] 		Аллокация акции:  " + АллокацияАкц + " (" + АллокацияАкц_Прц + "%)
	|[inf] 		Экспирация ОФЗ:   " + ЭкспирацияОФЗ + "
	|[inf] 		Экспирация акции: " + ЭкспирацияАкц + "
	|[inf] 		Экспирация итого: " + Строка(ЭкспирацияОФЗ+ЭкспирацияАкц) + "
	|";
	
	ЭтотОбъект.Лог.ДобавитьСтроку("[inf] " + стрРасчет);
	
	ЭтотОбъект.Лог.ДобавитьСтроку("[inf] Расчет количества ОФЗ. Финиш: " + ТекущаяДата());
	
	Возврат КолвоОбл
КонецФункции

Процедура ОбработатьКоличествоЛотовПоручения(Объект)

	Номинал = Справочники.Активы.НоминальнаяСтоимостьАктива(Объект.Актив);
	
	Если Номинал = 0 Тогда
		Номинал = 1;
	КонецЕсли;
	
	Если Объект.Лот = 0 Тогда
		Объект.КоличествоЛотов = 0;
		Объект.Количество = 0;
		Возврат;
	КонецЕсли;

	Объект.КоличествоВНоминалах = Объект.Количество * Номинал;
	Объект.КоличествоЛотов = Цел(Объект.Количество / Объект.Лот);
	Объект.Количество = Объект.КоличествоЛотов * Объект.Лот;

КонецПроцедуры

Функция ЗаписатьПоручение(ДанныеПоручения, СуммаПоручения, ТекстОшибки)
	
	Если ДанныеПоручения.Свойство("ПоручениеСсылка") Тогда
		Поручение = ДанныеПоручения.ПоручениеСсылка.ПолучитьОбъект();
	Иначе
		Поручение = Документы.Поручение.СоздатьДокумент();
	КонецЕсли;
	Поручение.ВидОперации = Перечисления.ВидыПоручений.Сделка;
	Поручение.Внебиржевая = Ложь;
	Поручение.ВалютаРасчетов = Справочники.Валюты.RUB;
	Поручение.Направление = ДанныеПоручения.Направление;
	Поручение.Портфель = ДанныеПоручения.Портфель;
	Поручение.Стратегия = ДанныеПоручения.Субпортфель.Стратегия;
	Поручение.Актив = ДанныеПоручения.Актив;
	Поручение.Субпортфель = ДанныеПоручения.Субпортфель;
	Поручение.МестоХранения = ДанныеПоручения.Субпортфель.МестоХранения;
	Поручение.Биржа = Справочники.Биржи.ММВБ;
	Поручение.Дата = ТекущаяДата();
	Поручение.ЗаполнениеПоПортфелю = Истина;
	Поручение.Количество = ДанныеПоручения.Количество;
	
	Если Не ЗначениеЗаполнено(Поручение.ВалютаРасчетов) Тогда
		ЭтотОбъект.Лог.ДобавитьСтроку("[err] Ошибка создания поручения: Не заполнена валюта расчетов в поручении!");
		Возврат Документы.Поручение.ПустаяСсылка();
	КонецЕсли;

	ДанныеЛотности = РегистрыСведений.ЛотыЦенныхБумагПоРежимамТоргов.СведенияЛотностиПоОсновномуРежимуТоргов(Поручение.Актив, Ложь, Ложь);
	Поручение.Лот = ДанныеЛотности.Лот;
	Если ДанныеЛотности.Лот > 0 Тогда
		ЗаполнитьЗначенияСвойств(Поручение, ДанныеЛотности);
	КонецЕсли;

	Если Поручение.Лот = 0 Тогда
		Поручение.Лот = 1;
	КонецЕсли;

	ОбработатьКоличествоЛотовПоручения(Поручение);

	Окружение = Неопределено;
	Поручение.ЗаполнитьДатыПоставкиОплаты();
	Поручение.ЗаполнитьКупон();
	Поручение.Котировка = ДанныеПоручения.Цена;
	Поручение.ЦенаВВалютеРасчетов = ДанныеПоручения.Цена;
	Поручение.ВалютаРасчетовПриИзмененииОбработать();

	Поручение.СуммаПоручения = Поручение.Количество * Поручение.ЦенаВВалютеРасчетов;
	
	Если ЗначениеЗаполнено(Поручение.Субпортфель) Тогда
		Поручение.МестоХранения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Поручение.Субпортфель, "МестоХранения");
    	Поручение.ЗаполнитьТорговыйСчет();
	КонецЕсли;

	Поручение.Ответственный = АвторЗаявок;

	Попытка
		Поручение.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЭтотОбъект.Лог.ДобавитьСтроку("[err] Ошибка создания поручения: " + ОписаниеОшибки());
		Возврат Документы.Поручение.ПустаяСсылка();
	КонецПопытки;
	
	ПоручениеСсылка = Поручение.Ссылка;
	ЛогПолучитьЦену = "";
	
	Если ИзменитьЦенуПоручения(ПоручениеСсылка, ДанныеПоручения.НомерЦены, ЛогПолучитьЦену) Тогда
		ЭтотОбъект.Лог.ДобавитьСтроку(ЛогПолучитьЦену);
		Если СуммаПоручения <> 0 Тогда
			обПоручение = ПоручениеСсылка.ПолучитьОбъект();
			обПоручение.СуммаПоручения = СуммаПоручения;
			обПоручение.СуммаПорученияПриИзмененииОбработать();
			
			Если обПоручение.Направление = Перечисления.ВидыОперацийСделки.Продажа
				И обПоручение.СуммаПоручения < СуммаПоручения Тогда
				
				обПоручение.Количество = обПоручение.Количество + 1;
				ОбработатьКоличествоЛотовПоручения(обПоручение);
				обПоручение.СуммаПоручения = обПоручение.Количество * обПоручение.ЦенаВВалютеРасчетов;
				
			КонецЕсли;
			
			Если ДанныеПоручения.Свойство("КоличествоОстаток") И ДанныеПоручения.КоличествоОстаток < обПоручение.Количество Тогда 
				обПоручение.Количество = ДанныеПоручения.КоличествоОстаток;
				ОбработатьКоличествоЛотовПоручения(обПоручение);
				обПоручение.СуммаПоручения = обПоручение.Количество * обПоручение.ЦенаВВалютеРасчетов;
			КонецЕсли;
			
			Если обПоручение.Количество = 0 Тогда
				ЭтотОбъект.Лог.ДобавитьСтроку("[err] Ошибка создания поручения: не хватает ДС!");
				обПоручение = ПоручениеСсылка.ПолучитьОбъект();
				обПоручение.УстановитьПометкуУдаления(Истина);
				Возврат Документы.Поручение.ПустаяСсылка();
			Иначе  
				обПоручение.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЕсли;
	Иначе
		обПоручение = ПоручениеСсылка.ПолучитьОбъект();
		обПоручение.УстановитьПометкуУдаления(Истина);
		Если ЛогПолучитьЦену <> "" Тогда
			ЭтотОбъект.Лог.ДобавитьСтроку("[err] " + ЛогПолучитьЦену);
		Иначе
			ЭтотОбъект.Лог.ДобавитьСтроку("[err] Ошибка при попытки получить цену актива");
		КонецЕсли;
		ПоручениеСсылка = Документы.Поручение.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ПоручениеСсылка;
	
КонецФункции

Функция ЗаписатьНеторговоеПоручение(Портфель, Субпортфель, Сумма)
	
	ДокументПоручение = Документы.Поручение.СоздатьДокумент();
	ДокументПоручение.Дата = ТекущаяДатаСеанса();
	ДокументПоручение.ВидОперации = Перечисления.ВидыПоручений.НеторговоеПоручение;
	ДокументПоручение.ВидОперацииНеторговогоПоручения = Перечисления.ВидыОперацийНеторговыхПоручений.Ввод;
	ДокументПоручение.Актив = АктивРубли;
	ДокументПоручение.ВалютаРасчетов = Справочники.Валюты.RUB;
	ДокументПоручение.Внебиржевая = Истина;
	ДокументПоручение.ЗаполнениеПоПортфелю = Истина;
	ДокументПоручение.Портфель = Портфель;
	ДокументПоручение.Субпортфель = Субпортфель;
	ДокументПоручение.Количество = Сумма;
	ДокументПоручение.ВысокийПриоритет = Ложь;
	ДокументПоручение.ДатаОплаты = ТекущаяДатаСеанса();
	ДокументПоручение.ДатаПоставки = ТекущаяДатаСеанса();
	ДокументПоручение.Направление = Перечисления.ВидыОперацийСделки.Покупка;
	ДокументПоручение.РежимFOP = Перечисления.РежимыFOP.PREPAYMENT;
	ДокументПоручение.Срочность = 1;
	ДокументПоручение.Субпортфель = Субпортфель;
	ДокументПоручение.СубпортфельЦБ = Субпортфель;
	ДокументПоручение.СуммаПоручения = Сумма;
	ДокументПоручение.ТипРасчетовПоВнебиржевойСделке=Перечисления.ТипыРасчетовПоВнебиржевымСделкам.FOP;
	ДокументПоручение.УсловиеИсполнения=Перечисления.УсловияИсполненияОрдеровНаБирже.PUT_IN_QUEUE;
	ДокументПоручение.Комментарий = "Реинвестирование.Создан автоматически под покупку купона";
	
	НСтрРаспределение = ДокументПоручение.РаспределениеПоПортфелям.Добавить();
	НСтрРаспределение.Портфель = Портфель;
	НСтрРаспределение.Количество = Сумма;
	НСтрРаспределение.Субпортфель = Субпортфель;
	НСтрРаспределение.СубпортфельЦБ = Субпортфель;
	НСтрРаспределение.МестоХранения = СубПортфель.МестоХранения;
	НСтрРаспределение.МестоХраненияЦБ = Субпортфель.МестоХранения;

	НСтрДоступы1 = ДокументПоручение.НаборыЗначенийДоступа.Добавить();
	НСтрДоступы1.НомерНабора=2;
	НСтрДоступы1.Чтение = Истина;
	НСтрДоступы1.Изменение = Истина;
	
	НСтрДоступы2 = ДокументПоручение.НаборыЗначенийДоступа.Добавить();
	НСтрДоступы2.НомерНабора=1;
	НСтрДоступы2.Чтение = Истина;
	НСтрДоступы2.Изменение = Истина;
	
	ДокументПоручение.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ДокументПоручение.Ссылка;
	
КонецФункции

//Статус двинуть статус на создано поручение
Процедура ОбновитьСтатусПоПортфелю(Портфель, Статус)
		
	//1. Поменять статус
	ЗаписьВРегистр = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	ЗаписьВРегистр.Объект = ПортФель;
	ЗаписьВРегистр.Значение = Статус; //СтатусДляПеревода;
	ЗаписьВРегистр.Свойство = ДопРеквизитСтатусПортфеля;
	ЗаписьВРегистр.Записать(Истина);
	
	//2. Поменять дату
	ЗаписьВРегистр = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	ЗаписьВРегистр.Объект = ПортФель;
	ЗаписьВРегистр.Значение = ТекущаяДатаСеанса();
	ЗаписьВРегистр.Свойство = ДопРеквизитДатаОперации;
	ЗаписьВРегистр.Записать(Истина);	
	
	//3. История статусов
	ЗаписьВРегистр = РегистрыСведений.ВТБ_СтатусыПортфелей.СоздатьМенеджерЗаписи();
	ЗаписьВРегистр.Период = ТекущаяДатаСеанса();
	ЗаписьВРегистр.Портфель = ПортФель;
	ЗаписьВРегистр.СтатусПортфеля = Статус;
	ЗаписьВРегистр.Автор = ПараметрыСеанса.ТекущийПользователь;
	ЗаписьВРегистр.Записать(Истина);
	
КонецПРоцедуры

Процедура ПротестироватьРасчетАллокации(ДатаРасчета, ТекстОшибки, ВажностьОшибки) Экспорт
	
	ЭтотОбъект.Лог.ДобавитьСтроку("[inf] Тест расчета аллокации. Старт: " + ТекущаяДата());
	ЭтотОбъект.Лог.ДобавитьСтроку("[inf] Расчет параметров ОФЗ: " + ТекущаяДата());
	
	Попытка
		ТаблицаПотоковПоАктивам = РассчитатьПотокПоОФЗ(ДатаРасчета); 
	Исключение
		ВажностьОшибки = 2;
		ТекстОшибки = ТекстОшибки + Символы.ПС + ОписаниеОшибки();
		ЭтотОбъект.Лог.ДобавитьСтроку("[err] Возникла ошибка при формировании денежного потока ОФЗ: "+ОписаниеОшибки());
		Возврат	
	КонецПопытки;	 
	
	Для каждого СтрокаАктива Из НастройкаТестРасчетаАллокации Цикл
		
		
		Актив = СтрокаАктива.Актив;
		//Сообщить("Актив: "+Актив);
		Прм   = ТаблицаПотоковПоАктивам[Актив];
		
		ЦенаПокупки = СтрокаАктива.ЦенаПокупки;
		СуммаИнвестирования = СтрокаАктива.СуммаИнвестирования;
		
		ЭтотОбъект.Лог.ДобавитьСтроку("[inf] Расчет аллокации: " + Актив);
	
		СуммаАллокации = СуммаИнвестирования - (СуммаИнвестирования / 100 * Прм.ПроцентКомиссияУправляющий);
		ПотериВАкциях = Прм.ПроцентПотерьАкции;
		КолвоОбл = 1;
		
		сч = 1;
		ВГран = 100000;
		флВыполнить = Истина;
		Пока флВыполнить и сч < ВГран Цикл
			сч = сч + 1;
			АллокацияОФЗ = КолвоОбл * (ЦенаПокупки + Прм.ТекНКД);//КолвоОбл * Окр(ЦенаПокупки + Прм.ТекНКД, 0);
			АллокацияАкц = СуммаАллокации  - АллокацияОФЗ;
			ОстСтоимостьАкц = АллокацияАкц * (1 - ПотериВАкциях / 100);
			
			ЭкспирацияОФЗ = КолвоОбл * (Прм.КупонныйДоходКПоолучению + Прм.ЦенаПродажиРуб);
			ЭкспирацияАкц = ОстСтоимостьАкц;
			
			стрРасчет = "КолвоОФЗ  - " + КолвоОбл + "; АллокацияОФЗ - " + АллокацияОФЗ + "; АллокацияАкц - " + АллокацияАкц + "; ЭкспирацияОФЗ - " + ЭкспирацияОФЗ + "; ЭкспирацияАкц - " + ЭкспирацияАкц + "; Сумма - " + Строка(ЭкспирацияОФЗ + ЭкспирацияАкц);  
			//ЭтотОбъект.Лог.ДобавитьСтроку("[inf] " + стрРасчет);

			Если (ЭкспирацияОФЗ + ЭкспирацияАкц) < СуммаИнвестирования Тогда
				КолвоОбл = КолвоОбл + 1;
			Иначе
				флВыполнить = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		Если сч >= ВГран Тогда
			ЭтотОбъект.Лог.ДобавитьСтроку("[warn] выход из расчета по счетчику!");
		КонецЕсли; 
		
		Если СуммаАллокации <> 0 Тогда
			АллокацияОФЗ_Прц = Окр(АллокацияОФЗ / СуммаАллокации * 100, 2);
			АллокацияАкц_Прц = Окр(АллокацияАкц / СуммаАллокации * 100, 2);
		Иначе
			АллокацияОФЗ_Прц = "0";
			АллокацияАкц_Прц = "0";
		КонецЕсли;
		
		стрРасчет = "
		|[inf] 		Сумма аллокации:  " + СуммаАллокации + "
		|[inf] 		Потери в а кциях: " + ПотериВАкциях + "%
		|[inf] 		Кол-во ОФЗ:       " + КолвоОбл + "
		|[inf] 		Цена покупки без НКД:     " + ЦенаПокупки + "
		|[inf] 		Цена покупки:     " + Строка(ЦенаПокупки + Прм.ТекНКД) + "
		|[inf] 		Цена продажи:     " +  Прм.ЦенаПродажиРуб + "
		|[inf] 		Аллокация ОФЗ:    " + АллокацияОФЗ + " (" + АллокацияОФЗ_Прц + "%)
		|[inf] 		Аллокация акции:  " + АллокацияАкц + " (" + АллокацияАкц_Прц + "%)
		|[inf] 		Экспирация ОФЗ:   " + ЭкспирацияОФЗ + "
		|[inf] 		Экспирация акции: " + ЭкспирацияАкц + "
		|[inf] 		Экспирация итого: " + Строка(ЭкспирацияОФЗ + ЭкспирацияАкц) + "
		|";
		
		ЭтотОбъект.Лог.ДобавитьСтроку("[inf] " + стрРасчет);
	КонецЦикла;
	
	ЭтотОбъект.Лог.ДобавитьСтроку("[inf] Тест расчета аллокации. Финиш: " + ТекущаяДата());
	
КонецПроцедуры

Процедура ПолучитьРасхожденияАллокации(ДатаРасчета, ТекстОшибки, ВажностьОшибки) Экспорт
	
	ЭтотОбъект.Лог.ДобавитьСтроку("[inf] Тест расчета аллокации. Старт: " + ТекущаяДата());
	ЭтотОбъект.Лог.ДобавитьСтроку("[inf] Расчет параметров ОФЗ: " + ТекущаяДата());
	
	Попытка
		ТаблицаПотоковПоАктивам = РассчитатьПотокПоОФЗ(ДатаРасчета); 
	Исключение
		ВажностьОшибки = 2;
		ТекстОшибки = ТекстОшибки + Символы.ПС + ОписаниеОшибки();
		ЭтотОбъект.Лог.ДобавитьСтроку("[err] Возникла ошибка при формировании денежного потока ОФЗ: "+ОписаниеОшибки());
		Возврат	
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаРасчета);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.Актив КАК Актив,
	|	СУММА(т.Количество) КАК Количество,
	|	СУММА(т.СуммаПоручения) КАК СуммаПоручения,
	|	т.Портфель КАК Портфель
	|ПОМЕСТИТЬ ВТ_ДС
	|ИЗ
	|	Документ.Поручение КАК т
	|ГДЕ
	|	т.Проведен
	|	И НАЧАЛОПЕРИОДА(т.Дата, ДЕНЬ) = &Дата
	|	И т.Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.Валюты)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Актив,
	|	т.Портфель,
	|	т.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.Актив КАК Актив,
	|	СУММА(т.Количество) КАК Количество,
	|	СУММА(т.СуммаПоручения) КАК СуммаПоручения,
	|	т.Портфель КАК Портфель,
	|	т.ЦенаВВалютеРасчетов КАК ЦенаВВалютеРасчетов
	|ПОМЕСТИТЬ ВТ_ОФЗ
	|ИЗ
	|	Документ.Поручение КАК т
	|ГДЕ
	|	т.Проведен
	|	И НАЧАЛОПЕРИОДА(т.Дата, ДЕНЬ) = &Дата
	|	И т.Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.ОблигацииГосРФ)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Актив,
	|	т.Портфель,
	|	т.Ссылка,
	|	т.ЦенаВВалютеРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДС.Портфель КАК Портфель,
	|	ВТ_ДС.Количество КАК СуммаИнвестирования,
	|	ВТ_ОФЗ.Актив КАК Актив,
	|	ВТ_ОФЗ.Количество КАК КоличествоОФЗ,
	|	ВТ_ОФЗ.ЦенаВВалютеРасчетов КАК ЦенаОФЗ,
	|	ВТ_ОФЗ.СуммаПоручения КАК СуммаОФЗ
	|ИЗ
	|	ВТ_ДС КАК ВТ_ДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОФЗ КАК ВТ_ОФЗ
	|		ПО ВТ_ДС.Портфель = ВТ_ОФЗ.Портфель";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		
		Актив = Выборка.Актив;
		//Сообщить("Актив: "+Актив);
		Прм   = ТаблицаПотоковПоАктивам[Актив];
		
		ЦенаПокупки = Выборка.ЦенаОФЗ;
		СуммаИнвестирования = Выборка.СуммаИнвестирования;
		
	//	ЭтотОбъект.Лог.ДобавитьСтроку("[inf] Расчет аллокации: " + Актив);
	//
		СуммаАллокации = СуммаИнвестирования - (СуммаИнвестирования / 100 * Прм.ПроцентКомиссияУправляющий);
		ПотериВАкциях = Прм.ПроцентПотерьАкции;
		КолвоОбл = 1;
		
		сч = 1;
		ВГран = 100000;
		флВыполнить = Истина;
		Пока флВыполнить и сч < ВГран Цикл
			сч = сч + 1;
			АллокацияОФЗ = КолвоОбл * (ЦенаПокупки + Прм.ТекНКД);//КолвоОбл * Окр(ЦенаПокупки + Прм.ТекНКД, 0);
			АллокацияАкц = СуммаАллокации  - АллокацияОФЗ;
			ОстСтоимостьАкц = АллокацияАкц * (1 - ПотериВАкциях / 100);
			
			ЭкспирацияОФЗ = КолвоОбл * (Прм.КупонныйДоходКПоолучению + Прм.ЦенаПродажиРуб);
			ЭкспирацияАкц = ОстСтоимостьАкц;
			
			стрРасчет = "КолвоОФЗ  - " + КолвоОбл + "; АллокацияОФЗ - " + АллокацияОФЗ + "; АллокацияАкц - " + АллокацияАкц + "; ЭкспирацияОФЗ - " + ЭкспирацияОФЗ + "; ЭкспирацияАкц - " + ЭкспирацияАкц + "; Сумма - " + Строка(ЭкспирацияОФЗ + ЭкспирацияАкц);  
			//ЭтотОбъект.Лог.ДобавитьСтроку("[inf] " + стрРасчет);

			Если (ЭкспирацияОФЗ + ЭкспирацияАкц) < СуммаИнвестирования Тогда
				КолвоОбл = КолвоОбл + 1;
			Иначе
				флВыполнить = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		Если сч >= ВГран Тогда
			ЭтотОбъект.Лог.ДобавитьСтроку("[warn] выход из расчета по счетчику!");
		КонецЕсли; 
		
		Если СуммаАллокации <> 0 Тогда
			АллокацияОФЗ_Прц = Окр(АллокацияОФЗ / СуммаАллокации * 100, 2);
			АллокацияАкц_Прц = Окр(АллокацияАкц / СуммаАллокации * 100, 2);
		Иначе
			АллокацияОФЗ_Прц = "0";
			АллокацияАкц_Прц = "0";
		КонецЕсли;
		
		//портфель офз купили аллокация разность
		стрРасчет = СтрШаблон("%1;	%2;	%3;	%4;	%5;",
							Выборка.Портфель,
							Актив,
							Выборка.КоличествоОФЗ,
							КолвоОбл,
							КолвоОбл - Выборка.КоличествоОФЗ);
							
		//|[inf] 		Сумма аллокации:  " + СуммаАллокации + "
		//|[inf] 		Потери в а кциях: " + ПотериВАкциях + "%
		//|[inf] 		Кол-во ОФЗ:       " + КолвоОбл + "
		//|[inf] 		Цена покупки без НКД:     " + ЦенаПокупки + "
		//|[inf] 		Цена покупки:     " + Строка(ЦенаПокупки + Прм.ТекНКД) + "
		//|[inf] 		Цена продажи:     " +  Прм.ЦенаПродажиРуб + "
		//|[inf] 		Аллокация ОФЗ:    " + АллокацияОФЗ + " (" + АллокацияОФЗ_Прц + "%)
		//|[inf] 		Аллокация акции:  " + АллокацияАкц + " (" + АллокацияАкц_Прц + "%)
		//|[inf] 		Экспирация ОФЗ:   " + ЭкспирацияОФЗ + "
		//|[inf] 		Экспирация акции: " + ЭкспирацияАкц + "
		//|[inf] 		Экспирация итого: " + Строка(ЭкспирацияОФЗ + ЭкспирацияАкц) + "
		//|";
		
		ЭтотОбъект.Лог.ДобавитьСтроку("[inf] " + стрРасчет);
	КонецЦикла;
	
	ЭтотОбъект.Лог.ДобавитьСтроку("[inf] Тест расчета аллокации. Финиш: " + ТекущаяДата());
	
КонецПроцедуры

Процедура ИзменитьЦенуСтаканТест(ТекстОшибки, ВажностьОшибки) Экспорт
	
	ЭтотОбъект.Лог.ДобавитьСтроку("[inf] ИзменитьЦенуСтаканТест. Старт: " + ТекущаяДата());
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("ДатаН", НачалоДня(ТекущаяДата())); 
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыПоручений.Сделка); 
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Поручение.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.Дата >= &ДатаН
	|	И Поручение.Проведен
	|	И Поручение.ВидОперации = &ВидОперации";
	
	ВыборкаПоПортфелю = Запрос.Выполнить().Выбрать();
	Если не ВыборкаПоПортфелю.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Если ИзменитьЦенуПоручения(ВыборкаПоПортфелю.Ссылка, 2, ТекстОшибки) Тогда
		ЭтотОбъект.Лог.ДобавитьСтроку(ТекстОшибки);
	Иначе
		Если ТекстОшибки <> "" Тогда
			ЭтотОбъект.Лог.ДобавитьСтроку("[err] " + ТекстОшибки);
		Иначе
			ЭтотОбъект.Лог.ДобавитьСтроку("[err] " + "Ошибка при попытки получить цену актива");
		КонецЕсли;
	КонецЕсли;
	
	ЭтотОбъект.Лог.ДобавитьСтроку("[inf] ИзменитьЦенуСтаканТест. Финиш: " + ТекущаяДата());
	
КонецПроцедуры

Процедура ТестАллокацииЗаполнитьПоУмолчанию() Экспорт
	
	НастройкаТестРасчетаАллокации.Очистить();
	
	Для каждого СтрокаАктив Из НастройкаСтратегий Цикл
		
		НовСтрока = НастройкаТестРасчетаАллокации.Найти(СтрокаАктив.ОсновнойАктивДляПокупки, "Актив");
		Если НовСтрока <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтрока = НастройкаТестРасчетаАллокации.Добавить();
		НовСтрока.Актив = СтрокаАктив.ОсновнойАктивДляПокупки;
		НовСтрока.ЦенаПокупки = 100;
		НовСтрока.СуммаИнвестирования = 1000000;
		
	КонецЦикла;   
	
КонецПроцедуры

#КонецОбласти

#Область РассылкаПоПочте

Функция РассылкаОтчета(КоличествоПоручений, ТекстОшибки, ВажностьОшибки) Экспорт
	
	ДатаОтчета = ТекущаяДатаСеанса();
	ТекстПисьма = "";
	
	Если КоличествоПоручений = 0 и ВажностьОшибки = 0 Тогда
		// поручений нет, ошибок нет не будем спамить
		Возврат "";
	КонецЕсли;
	
	Если ЭтотОбъект.СписокРассылки.Количество() > 0 И НЕ ЭтотОбъект.ПочтовыйЛогин.Пустая() тогда
				
		Тема = "Создание торговых поручений (Retail_DU) " + Строка(ТекущаяДатаСеанса()); 
		
		Если ВажностьОшибки = 2 Тогда
			ТекстПисьма = ТекстПисьма + Символы.ПС + "[err]	при формирвоании поручений возникла ошибка."
					+ ?(ТекстОшибки = "", "", Символы.ПС + ТекстОшибки)
					+ Символы.ПС;
		КонецЕсли;
				
		ТекстПисьма = ТекстПисьма + Символы.ПС + "[inf] создано поручений: " + КоличествоПоручений + Символы.ПС;
		
		ТекстПисьма = ТекстПисьма + Символы.ПС + Лог.ПолучитьТекст();
		ТекстПисьма = СтрЗаменить(ТекстПисьма, Символы.ПС, "<br>");
		//ТекстПисьма = СтрЗаменить(ТекстПисьма, Символы.ВТаб, "&nbsp");
		
		ТемаПисьма = СформироватьТемуПисьма(Тема, ВажностьОшибки, "r291");
				
		СписокПолучателей = ЭтотОбъект.СписокРассылки.Выгрузить();
		
		// Заполнение параметров рассылки	
		ПараметрыРассылки = Новый Структура;
		ПараметрыРассылки.Вставить("ТемаПисьма", 		ТемаПисьма);
		ПараметрыРассылки.Вставить("ТекстПисьма", 		ТекстПисьма);
		ПараметрыРассылки.Вставить("СписокПолучателей", СписокПолучателей);
		//ПараметрыРассылки.Вставить("Вложения", 			Вложения);
		
		ТекстОшибки = ОтправитьПисьмо(ПараметрыРассылки, ЭтотОбъект.ПочтовыйЛогин, ВажностьОшибки);
		
		Если ТекстОшибки <> Неопределено Тогда 
			ЗаписьЖурналаРегистрации(
				"Дополнительные отчеты и обработки." + Метаданные().Представление(),
				УровеньЖурналаРегистрации.Ошибка,,,
				ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ДобавитьВложение(Вложения, ТабДок, ИмяФайла, Расширение, Кодировка = "")
	//Представление
	//АдресВоВременномХранилище
	ТекстОшибки = "";
	АдресВложения = ПоместитьТабДокВоВременноеХранилище(ТабДок, Расширение, ТекстОшибки);
	Если АдресВложения <> Неопределено Тогда
		Стр = Новый Структура;
		Стр.Вставить("Представление",ИмяФайла);
		Стр.Вставить("АдресВоВременномХранилище",АдресВложения);
		Вложения = Новый Массив;
		Вложения.Добавить(Стр);
	Иначе
		ТекстОшибки = СтрШаблон("Файл вложения %1 не сформирован: %2", ИмяФайла, ТекстОшибки);
	КонецЕсли;		
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция СформироватьТемуПисьма(ТемаЗаголовок, ВажностьОшибки, НомерРассылки)
									
	ТемаПисьма = ПрефиксПисьма(ВажностьОшибки) + ТемаЗаголовок + ПропискаРассылки(НомерРассылки);
	
	Возврат ТемаПисьма;
	
КонецФункции

//ПараметрыРассылки - Структура с полями:
Функция ОтправитьПисьмо(Знач ПараметрыРассылки, Знач УчетнаяЗапись, Знач ВажностьОшибки = 0)
	
	ТекстПисьма 	= ПараметрыРассылки.ТекстПисьма;
	ТемаПисьма 		= ПараметрыРассылки.ТемаПисьма;

	Вложения = Неопределено;
	ПараметрыРассылки.Свойство("Вложения", Вложения);
	
	Кому 		= Новый Массив();
	Копия 		= Новый Массив();
	СписокПолучателей = Неопределено;
	Если ПараметрыРассылки.Свойство("СписокПолучателей", СписокПолучателей) Тогда
		Если ТипЗнч(СписокПолучателей) = Тип("ТаблицаЗначений") Тогда
			Для Каждого ТекЯщик Из СписокПолучателей Цикл
				//Если ТекЯщик.КакКопия Тогда
				//	Копия.Добавить(Новый Структура("Адрес, Представление", ТекЯщик.ПочтовыйЛогин, ТекЯщик.Представление));
				//Иначе
					Кому.Добавить(Новый Структура("Адрес, Представление", ТекЯщик.ПочтовыйЯщик, ТекЯщик.Представление));
				//КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(СписокПолучателей) = Тип("Строка") Тогда
			Кому = СписокПолучателей;
		КонецЕсли;	
	КонецЕсли;
	
	ТипТекста = "HTML";
	Если НЕ ПараметрыРассылки.Свойство("ТипТекста", ТипТекста) Тогда
		ТипТекста = "HTML";
	КонецЕсли;
	
	// Заполнение параметров письма
	ПараметрыПисьма = Новый Структура("Кому, Копии, Тема, Тело, ТипТекста, Вложения, Важность");
	ПараметрыПисьма.Вложения	 = Вложения;
	ПараметрыПисьма.Кому		 = Кому;
	ПараметрыПисьма.Копии		 = Копия;
	ПараметрыПисьма.Тема		 = ТемаПисьма;
	ПараметрыПисьма.Тело		 = ТекстПисьма;
	ПараметрыПисьма.ТипТекста	 = ТипТекста;
	//ПараметрыПисьма.ИмяОтправителя = "Имя"; //
	ПараметрыПисьма.Важность	 = ?(ВажностьОшибки > 0, ВажностьИнтернетПочтовогоСообщения.Высокая, ВажностьИнтернетПочтовогоСообщения.Обычная);

	ТекстОшибки = Неопределено;
	Попытка
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
	Исключение
		ТекстОшибки = "Произошла ошибка при отправке почтового сообщения! " + ОписаниеОшибки();	
		ЗаписьЖурналаРегистрации(
			"Дополнительные отчеты и обработки." + Метаданные().Представление(),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
	КонецПопытки;	
		
	Возврат ТекстОшибки;
	
КонецФункции // ОтправитьПисьмо()

Функция СформироватьСтрокуПисьма(Знач СтрокаСообщение)
		
	СтрокаФормат = "<p>" + СтрЗаменить(СокрЛП(СтрокаСообщение), Символы.ПС, "</p><p>") + "</p>";
	Возврат СтрЗаменить(СтрокаФормат, "<p></p>", "<p>&nbsp;</p>");
	
КонецФункции

Функция СформироватьТелоПисьма(Знач ТекстПисьма)
	
	//ТелоПисьма = "
	//|<html>
	//|	<head>
	//|		<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
	//|	</head>
	//|	<body style=""font-family:Arial, Helvetica, sans-serif;color:black;"">
	//|		" + ОбщегоНазначения.ЗначениеВСтрокуXML(Заголовок) + "
	//|		<table BORDERCOLOR=""Black"" border-style= ""solid"" border-collapse =""collapse"" border=""1"">
	//|			<tr>
	//|				<th align=""center"" bgcolor=""#C0C0C0"">Тип</th>
	//|			</tr>";
	//
	//Для Каждого ТекЭлемент Из <Какаято коллекция> Цикл
	//	ТелоПисьма = ТелоПисьма + "
	//	|			<tr>
	//	|				<td>" + ОбщегоНазначения.ЗначениеВСтрокуXML(ТекЭлемент.ЧтоТо) + "</td>
	//	|			</tr>";
	//КонецЦикла;
	//
	//ТелоПисьма = ТелоПисьма + "
	//|		</table>
	//|	</body>
	//|</html>";
	
	ТелоПисьма = "
	|<html>
	|	<head>
	|		<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
	|		<style>p{margin:0cm;margin-bottom:.0001pt;font-size:11.0pt;font-family:Calibri, Arial, Helvetica, sans-serif;}</style>
	|	</head>
	|	<body style=""font-family:Arial, Helvetica, sans-serif;color:black;"">
	|		" + СформироватьСтрокуПисьма(ТекстПисьма) + "
	|	</body>
	|</html>";
		
	Возврат ТелоПисьма;
	
КонецФункции // СформироватьТелоПисьма()

// Сохраняет ТабличныйДокумент или ПакетОтображаемыхДокументов в файл на диске
//
// Параметры:
//  ТабличныйДокумент  	- ТабличныйДокумент или ПакетОтображаемыхДокументов - документ для сохранения
//  ТипФайла  			- Строка - тип файла (xlsx, pdf и т.д.)
//  ПутьКФайлу			- Строка - Полный путь к файлу на диске или пустая строка для временного файла
//	ТекстОшибки			- Строка - Для сохранения текста ошибки
//
// Возвращаемое значение:
//	Строка - Путь к Файлу на диске, в случае успешной записи или
//  Неопределено - в случае ошибки
//
Функция СохранитьТабличныйДокументВФайл(Знач ТабличныйДокумент, Знач ПутьКФайлу, Знач ТипФайла="xlsx", ТекстОшибки="")
	
	Попытка
		Если ТипЗнч(ТабличныйДокумент)=Тип("ТабличныйДокумент") Тогда 
			ТипТабДокумента = ТипФайлаТабличногоДокумента[ТипФайла];
		ИначеЕсли ТипЗнч(ТабличныйДокумент)=Тип("ПакетОтображаемыхДокументов") Тогда
			ТипТабДокумента =  ТипФайлаПакетаОтображаемыхДокументов[ТипФайла];
		Иначе
			ТекстОшибки = СтрШаблон("Тип документа ""%2"" не поддерживается для сохранения в %1 (%3)", ТипЗнч(ТабличныйДокумент), ВРег(ТипФайла), ПутьКФайлу);
			Возврат Ложь;
		КонецЕсли;
	Исключение
		ТекстОшибки = СтрШаблон("Тип файла %1 не применим для сохранения типа документа ""%2"" (%3)", ВРег(ТипФайла), ТипЗнч(ТабличныйДокумент), ПутьКФайлу);
		Возврат Ложь;		
	КонецПопытки;

	Попытка
		ТабличныйДокумент.Записать(ПутьКФайлу, ТипТабДокумента);
	Исключение
		ТекстОшибки = "Произошла ошибка при сохранении файла: " + ОписаниеОшибки();		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Помещает файл во временное хранилище
//
// Возрвщаемое значение:
//	 Строка - Адрес во временном хранилище
//
Функция ПоместитьФайлВоВременноеХранилище(Знач ПутьКФайлу, ТекстОшибки="")
	
	Попытка	
		ДвоичныеДанные 	= Новый ДвоичныеДанные(ПутьКФайлу);
		АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	Исключение
		ТекстОшибки = "Произошла ошибка при помещении файла во временное хранилище: " + ОписаниеОшибки();		
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат АдресВХранилище;
	
КонецФункции

// Записывает табличный документ или пакет в файл с указанным типом на диск и во временное хранилище
// Возрвщаемое значение - Структура: АдресВХранилище, ПутьКФайлу
Функция ПоместитьТабДокВоВременноеХранилище(Знач ТабличныйДокумент, ТипФайла="xlsx", ТекстОшибки="")
	
	АдресВХранилище = Неопределено;
	
	Попытка
		ПутьКФайлу = ПолучитьИмяВременногоФайла(ТипФайла);
	Исключение
		ТекстОшибки = "Ошибка при получении имени временного файла: " + ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
	
	Если СохранитьТабличныйДокументВФайл(ТабличныйДокумент, ПутьКФайлу, ТипФайла, ТекстОшибки) Тогда
		АдресВХранилище = ПоместитьФайлВоВременноеХранилище(ПутьКФайлу, ТекстОшибки);
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ПутьКФайлу);
	Исключение
	КонецПопытки;	
	
	Возврат АдресВХранилище;

КонецФункции // ПоместитьТабДокВоВременноеХранилище()

Процедура УдалитьВременныеФайлы(Знач МассивФайлов)
	Перем Файл;
	
	Для Каждого ТекФайл Из МассивФайлов Цикл
		Попытка
			Если ЗначениеЗаполнено(ТекФайл) Тогда
				Файл = Новый Файл(ТекФайл);
				Если Файл.Существует() Тогда
					УдалитьФайлы(ТекФайл);
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры // УдалитьВременныеФайлы()

Функция ПрефиксПисьма(Знач ВажностьОшибки)
	Перем ПрефиксПисьма;
	
	Если ВажностьОшибки = 1 Тогда
		ПрефиксПисьма = "{WARN}";
		
	ИначеЕсли ВажностьОшибки = 2 Тогда
		ПрефиксПисьма = "{FAIL}";
		
	Иначе
		ПрефиксПисьма = "{OK}";
	КонецЕсли;
	
	Возврат ПрефиксПисьма;
КонецФункции // ПрефиксПисьма()

Функция ПропискаРассылки(Знач НомерРассылки)
	Перем ПараметрыПодключения, ИмяИБ;
	
	Попытка
		ПараметрыПодключения = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПодключенияИзСтрокиСоединенияИнформационнойБазы(СтрокаСоединенияИнформационнойБазы());
		ИмяИБ = ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия;
	Исключение
	КонецПопытки;
	
	Прописка = " {" + НомерРассылки + ", ib: " + ?(ЗначениеЗаполнено(ИмяИБ), ИмяИБ, "< .. >") + "}";
	
	Возврат Прописка;
КонецФункции // ПропискаРассылки()

Функция СтрКолонкаЛев(СтрокаЗнч, ДлинаЗнч)
	
	СтрокаПробел = "";
	сч = СтрДлина(СтрокаЗнч);
	Пока сч < ДлинаЗнч Цикл
		СтрокаПробел = СтрокаПробел + " ";
		сч = сч + 1;
	КонецЦикла;
	
	Возврат СтрокаЗнч + СтрокаПробел;
КонецФункции

Функция СтрКолонкаПрав(СтрокаЗнч, ДлинаЗнч)
	
	СтрокаПробел = "";
	сч = СтрДлина(СтрокаЗнч);
	Пока сч < ДлинаЗнч Цикл
		СтрокаПробел = СтрокаПробел + " ";
		сч = сч + 1;
	КонецЦикла;
	
	Возврат СтрокаПробел + СтрокаЗнч;
КонецФункции

#КонецОбласти

ЭтоТест = Ложь;
