#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

&Вместо("ДобавитьВТ_ТаблицаНабораДанных")
Функция FO_LimitProfile_ДобавитьВТ_ТаблицаНабораДанных(Секрет, Менеджер, ВыборкаИндексов = "Т.Портфель")

	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Результат = ПродолжитьВызов(Секрет, Менеджер, ВыборкаИндексов);
	FO_LimitProfile_Замеры.Добавить("РаботаСЛимитами.ДобавитьВТ_ТаблицаНабораДанных", ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт);
	Возврат Результат;

КонецФункции

&Вместо("ЗаписатьПорциюРезультатов")
Процедура FO_LimitProfile_ЗаписатьПорциюРезультатов(Параметры)

	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПродолжитьВызов(Параметры);
	FO_LimitProfile_Замеры.Добавить("РаботаСЛимитами.ЗаписатьПорциюРезультатов", ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
