
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КонтактнаяИнформацияСервер.ПриСозданииНаСервереФормыВводаКИ(ЭтаФорма, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонтактнаяИнформацияКлиент.ВводКИ_ПередЗакрытием(ЭтаФорма, Отказ);
	// Отключение сообщения о неиспользуемых процедурах и функциях
	Если Ложь Тогда
		Подключаемый_СохранитьИЗакрыть(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	КонтактнаяИнформацияКлиент.ОбновитьПараметрыВыбораДляВидаКИ(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_СохранитьИЗакрыть(Команда)
	КонтактнаяИнформацияКлиент.ВводКИ_СохранитьИЗакрытьНаКлиенте(ЭтаФорма);
КонецПроцедуры

#КонецОбласти
