
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.Организация = Константы.ОрганизацияПоУмолчанию.Получить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодНачалоПриИзменении(Элемент)
	ОчиститьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ПериодКонецПриИзменении(Элемент)
	ОчиститьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОчиститьОтчет();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборПериода(Команда)
	Если РаботаСДиалогамиКлиент.ИзмененПериод(Отчет.ПериодНачало, Отчет.ПериодКонец) Тогда
		ОчиститьОтчет();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетСервер();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьXML(Команда)
	СформироватьНаСервереXML();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчетСервер()
	Перем ДанныеДляРасшифровкиПодраздела_1_2_1;
	
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Отчет.ОтчетнаяДата = КонецДня(Отчет.ПериодКонец) + 1; // следующий день после даты конца выбранного отчетного периода
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ПолучитьДанные(ДанныеДляРасшифровкиПодраздела_1_2_1);
	
	Макет = ОтчетОбъект.ПолучитьМакет("МакетПодраздела_1_1");
	ТабДок_1_1 = РегуляторнаяОтчетность.ЗаполненныйДаннымиМакетПодраздела(Макет, ОтчетОбъект.ДанныеПодраздела_1_1);
	Макет = ОтчетОбъект.ПолучитьМакет("МакетПодраздела_1_2");
	ТабДок_1_2 = РегуляторнаяОтчетность.ЗаполненныйДаннымиМакетПодраздела(Макет, ОтчетОбъект.ДанныеПодраздела_1_2);
	Макет = ОтчетОбъект.ПолучитьМакет("МакетПодраздела_1_2_1");
	ТабДок_1_2_1 = РегуляторнаяОтчетность.ЗаполненныйДаннымиМакетПодраздела(Макет, ОтчетОбъект.ДанныеПодраздела_1_2_1);
	Макет = ОтчетОбъект.ПолучитьМакет("МакетРасшифровкиКПодразделу_1_2_1");
	ТабДок_Расшифровка_1_2_1 = РегуляторнаяОтчетность.ЗаполненныйДаннымиМакетПодраздела(Макет, ДанныеДляРасшифровкиПодраздела_1_2_1);
	
	ЗначениеВРеквизитФормы(ОтчетОбъект, "Отчет");
	Элементы.СохранитьXML.Доступность = Истина;
	Элементы.НайденныеОшибки.Видимость = Не ПустаяСтрока(Отчет.ОписаниеОшибок);
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("РегуляторнаяОтчетностьПоФорме0409711_Формирование", ВремяНачалаЗамера);
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервереXML()
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ВыгрузитьВXML();
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("РегуляторнаяОтчетностьПоФорме0409711_ВыгрузкаВXML", ВремяНачалаЗамера);
КонецПроцедуры

&НаСервере
Процедура ОчиститьОтчет()
	ТабДок_1_2.Очистить();
	ТабДок_1_2_1.Очистить();
	ТабДок_Расшифровка_1_2_1.Очистить();
	
	Элементы.СохранитьXML.Доступность = Ложь;
КонецПроцедуры

#КонецОбласти