
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНовыйНомер();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для Каждого ЭлементСтроки Из НачисленныеКомиссии Цикл
		Движение = Движения.УслугиДепозитария.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Движение,ЭлементСтроки);
		Движение.Период = Дата;
	КонецЦикла;
	Движения.УслугиДепозитария.Записать();
КонецПроцедуры
