
#Область РаботаСJSON
// Возвращает текст json для записи в РС "ЖурналИсходящихСообщенийKafka"
// Параметры:
//  MessageInfo - Структура - содержащая общие данные уведомления.
//  Data - Структура - содержащая данные КД.
// Возвращаемое значение:
//  ТелоСообщения - Строка - софрмированный json
Функция ТекстСообщенияJSON(MessageInfo, Data) Экспорт
	
	ДанныеJSON = ДанныеJSON(MessageInfo, Data);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);
	
	ТекстJSON = ЗаписьJSON.Закрыть();
	
	Возврат ТекстJSON;

КонецФункции

Функция ДанныеJSON(MessageInfo, Data) Экспорт
	
	ДанныеJSON = Новый Структура;
	
	ПараметрыСообщения = СтруктураMessageInfo();
	
	Для Каждого ПараметрСообщения Из ПараметрыСообщения Цикл
		Если Не MessageInfo.Свойство(ПараметрСообщения.Ключ) Тогда
			MessageInfo.Вставить(ПараметрСообщения.Ключ, ПараметрСообщения.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ЗаменитьCrmClientIdНаЧисло(Data);		
	
	ДанныеJSON.Вставить("MessageInfo", MessageInfo);
	ДанныеJSON.Вставить("Data", Data);
	
	Возврат ДанныеJSON;

КонецФункции

// Читает JSON сообщение
// Параметры:
//  Сообщение - Строка - сообщение в формате JSON
// Возвращаемое значение:
//  Результат - Структура - результат чтения JSON в виде сериализованной структуры
Функция РезультатЧтенияJSON(Сообщение) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Сообщение);
	Попытка
		Результат = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ЗаписьЖурналаРегистрации("Регистрация клиента. Чтение JSON",
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	Возврат Результат;
	
КонецФункции

// Возвращает структуру MessageInfo
// Возвращаемое значение:
//  MessageInfo - Структура - пустая структура блока MessageInfo
Функция СтруктураMessageInfo() Экспорт
	MessageInfo = Новый Структура;
	MessageInfo.Вставить("MessageType", "");
	MessageInfo.Вставить("MessageId", Неопределено);
	MessageInfo.Вставить("MasterMessageId", Неопределено);
	MessageInfo.Вставить("ParentMessageId", Неопределено);
	MessageInfo.Вставить("SystemSource", "");
	MessageInfo.Вставить("DateTimeCreate", "");
	MessageInfo.Вставить("ActionType", "");
	MessageInfo.Вставить("JsonVersion", "");
	
	Возврат MessageInfo;
	
КонецФункции

// Замена текстового CrmClientId на числовое значение в отправляемой структуре
// Параметры:
//  Data - Структура - данные для JSON
Процедура ЗаменитьCrmClientIdНаЧисло(Data)
	Для Каждого ЭлементСтруктуры Из Data Цикл
		Если СтрНайти(ЭлементСтруктуры.Ключ, "CrmClientId") > 0 Тогда
			Попытка
				Data.Вставить(ЭлементСтруктуры.Ключ, Число(СокрЛП(ЭлементСтруктуры.Значение)));
			Исключение
				Data.Вставить(ЭлементСтруктуры.Ключ, Неопределено);
			КонецПопытки;
		КонецЕсли;
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Структура") Тогда
			ЗаменитьCrmClientIdНаЧисло(ЭлементСтруктуры.Значение);
		ИначеЕсли ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Массив") Тогда
			Для Каждого ЭлементМассива Из ЭлементСтруктуры.Значение Цикл
				ЗаменитьCrmClientIdНаЧисло(ЭлементМассива);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Замена пустой даты на Неопределено
// Параметры:
//  Дата - дата - обрабатываемое значение даты
// Возвращаемое значение:
//  Дата - неопределено - в зависимости от результата проверки
Функция ПредставлениеПустойДатыJSON(Дата) Экспорт
	Если ЗначениеЗаполнено(Дата) Тогда
		Возврат Дата;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Проверяет структуру (полученную из JSON) на наличие обязательных полей и при необходимости на их заполненность.
// Информация об отсутствии обязательных полей добавлется в строку ТекстОшибки
// Параметры:
//	ДанныеИзJSON - Структура
//	СписокПолейСтрокой - Строка - список имен обязательны полей через запятую
//	ТекстОшибки -Строка
//	ПроверятьЗаполненность - Булево
Процедура ПроверитьОбязательныеПоля(ДанныеИзJSON, СписокПолейСтрокой, ТекстОшибки, ПроверятьЗаполненность = Ложь) Экспорт
	ОбязательныеПоля = Новый ТаблицаЗначений;
	ОбязательныеПоля.Колонки.Добавить("ИмяПоля", Новый ОписаниеТипов("Строка"));
	ОбязательныеПоля.Колонки.Добавить("Найдено", Новый ОписаниеТипов("Булево"));
	
	МассивИменОбязательныхПолей = СтрРазделить(СписокПолейСтрокой, ",");
	Для Каждого ИмяОбязательногоПоля Из МассивИменОбязательныхПолей Цикл
		НоваяСтрока = ОбязательныеПоля.Добавить();
		НоваяСтрока.ИмяПоля = ИмяОбязательногоПоля;
	КонецЦикла;
	
	Для Каждого СвойствоДокумента Из ДанныеИзJSON Цикл
		ОбязательноеПоле = ОбязательныеПоля.Найти(СвойствоДокумента.Ключ, "ИмяПоля");
		Если ОбязательноеПоле <> Неопределено Тогда
			ОбязательноеПоле.Найдено = Истина;
			Если ПроверятьЗаполненность И Не ЗначениеЗаполнено(СвойствоДокумента.Значение) Тогда
				ТекстОшибки = ?(ЗначениеЗаполнено(ТекстОшибки), ТекстОшибки + Символы.ПС, "")
					+ СтрШаблон("Поле %1 не заполнено в JSON.", СвойствоДокумента.Ключ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	РезультатПоискаОбязательныхПолей = ОбязательныеПоля.НайтиСтроки(Новый Структура("Найдено", Ложь));
	Для Каждого Поле Из РезультатПоискаОбязательныхПолей Цикл
		ТекстОшибки = ?(ЗначениеЗаполнено(ТекстОшибки), ТекстОшибки + Символы.ПС, "")
			+ СтрШаблон("Поле %1 не найдено в JSON.", Поле.ИмяПоля);
	КонецЦикла;
КонецПроцедуры

// Добавляет в структуру (полученную из JSON) необязательное поле
// Параметры:
//	Данные - Структура - Структура в которую добавляется поле
//	ИмяПоля - Строка - имя добавляемого поля
//	ЗначениеПоля -Строка - Значение поля
Процедура ДобавитьВСтруктуруНеобязательноеПоле(Данные, ИмяПоля, ЗначениеПоля) Экспорт
	Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
		Данные.Вставить(ИмяПоля, ЗначениеПоля);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ЗначениеПоля) И ТипЗнч(ЗначениеПоля) <> Тип("Число") Тогда
		Данные.Вставить(ИмяПоля, Неопределено);
	КонецЕсли;
КонецПроцедуры

// Функция преобразовывает СтроковыйКодRuData в число
// Параметры:
//  СтроковыйКодRuData - Строка - обрабатываемое значение
// Возвращаемое значение:
//  ЧисловойКодRuData - Число - преобразованное значение
Функция ЧисловойКодRuData(СтроковыйКодRuData) Экспорт
	Если Не ЗначениеЗаполнено(СтроковыйКодRuData) Тогда
		ЧисловойКодRuData = Неопределено;
	Иначе
		ЧисловойКодRuData = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СтроковыйКодRuData);
		Если ЧисловойКодRuData = 0 Тогда
			ЧисловойКодRuData = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЧисловойКодRuData;
КонецФункции

#КонецОбласти
