
Процедура ОбновитьЭтап(Документ, Этап, ДатаНачала, ДатаОкончания, Статус) Экспорт
	Периоды = ПериодыПоЭтапуПоручения(Документ, Этап);	
	Запись = РегистрыСведений.ЭтапыОбработкиПоручений.СоздатьМенеджерЗаписи();
	ДатаПервогоВыполнения = ДатаНачала;
	Для Каждого Период Из Периоды Цикл
		Запись.Период		= Период;
		Запись.Поручение	= Документ;
		Запись.Удалить();
		ДатаПервогоВыполнения = Мин(ДатаПервогоВыполнения, Период);
	КонецЦикла;	
	Запись.Период			= ДатаПервогоВыполнения;
	Запись.Поручение		= Документ;
	Запись.Этап				= Этап;
	Запись.ДатаОкончания	= ДатаОкончания;
	Запись.Статус			= Статус;
	Запись.ДатаПоследнегоВыполнения	= ДатаНачала;
	Запись.Записать(Ложь);	// Предотвращаем затирание записи с другим этапом
КонецПроцедуры

Функция ПериодыПоЭтапуПоручения(Поручение, Этап)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Этапы.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЭтапыОбработкиПоручений КАК Этапы
	|ГДЕ
	|	Этапы.Этап = &Этап
	|	И Этапы.Поручение = &Поручение
	|	И Этапы.ДатаОкончания = &ДатаОкончания");
	Запрос.УстановитьПараметр("Поручение", Поручение);
	Запрос.УстановитьПараметр("Этап", Этап);
	Запрос.УстановитьПараметр("ДатаОкончания", '00010101');
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Период");
КонецФункции

Функция ВидыОперацийИнвентарныхПоручений() Экспорт
	
	ВидыОперацииД = Новый Массив;
	ВидыОперацииД.Добавить(Справочники.ВидыОпераций.СнятиеСДепонирования);
	ВидыОперацииД.Добавить(Справочники.ВидыОпераций.Депонирование);
	ВидыОперацииД.Добавить(Справочники.ВидыОпераций.Перевод);
	
	Возврат ВидыОперацииД;
	
Конецфункции

