
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ИнициироватьПараметры();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");	
	
	Элементы.ФормаТест4490.Видимость = ПравоДоступа("Администрирование",Метаданные);
	
КонецПроцедуры

/////////////////////////////////////////////
// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура Прочитать(Команда)
	ПрочитатьНаСервере();
	АктивизироватьСтроки();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьТаблицы();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	СформироватьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СформироватьДокументы();
	ОбработкаОбъект.ЗагрузитьКонвертации();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение тогда
		НастройкаПериода = Новый НастройкаПериода;  //ДиалогРедактированияСтандартногоПериода для тонкого клиента
		НастройкаПериода.УстановитьПериод(Объект.НачалоПериода, ?(Объект.КонецПериода=Дата("00010101"), Объект.КонецПериода, КонецДня(Объект.КонецПериода)));
		НастройкаПериода.РедактироватьКакПериод = Истина;
		НастройкаПериода.ВариантНастройки 		= ВариантНастройкиПериода.Период;
		
		Если НастройкаПериода.Редактировать() Тогда
			Объект.НачалоПериода = НастройкаПериода.ПолучитьДатуНачала();
			Объект.КонецПериода  = НастройкаПериода.ПолучитьДатуОкончания();
		КонецЕсли;	
	#иначе
		Диалог	= Новый ДиалогРедактированияСтандартногоПериода();
		
		Диалог.Период.ДатаНачала	= Объект.НачалоПериода;
		Диалог.Период.ДатаОкончания	= ?(Объект.КонецПериода=Дата('0001-01-01'), Объект.КонецПериода, КонецДня(Объект.КонецПериода));
		Диалог.Период.Вариант		= ВариантСтандартногоПериода.ПроизвольныйПериод;
		
		Если Диалог.Редактировать() Тогда
			Объект.НачалоПериода	= Диалог.Период.ДатаНачала;
			Объект.КонецПериода	= Диалог.Период.ДатаОкончания;
		КонецЕсли;	
	#КонецЕсли
	

КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсеДивиденды(Команда)
	Для Каждого Строка ИЗ Объект.Дивиденды Цикл
		Строка.Отметка	= Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсеКупоны(Команда)
	Для Каждого Строка ИЗ Объект.Купоны Цикл
		Строка.Отметка	= Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделениеВсеДивиденды(Команда)
	Для Каждого Строка ИЗ Объект.Дивиденды Цикл
		Строка.Отметка	= Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделениеВсеКупоны(Команда)
	Для Каждого Строка ИЗ Объект.Купоны Цикл
		Строка.Отметка	= Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсеКонвертации(Команда)
	Для Каждого Строка ИЗ Объект.Конвертации Цикл
		Строка.Отметка	= Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделениеВсеКонвертации(Команда)
	Для Каждого Строка ИЗ Объект.Конвертации Цикл
		Строка.Отметка	= Ложь;
	КонецЦикла;
КонецПроцедуры

//////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ФОРМЫ

&НаКлиенте
Процедура АктивизироватьСтроки()
	ТекущиеДанныеДивиденды = Элементы.Дивиденды.ТекущиеДанные;
	Если Не ТекущиеДанныеДивиденды = Неопределено Тогда
		ИдентификаторСтрокиВладельца = ТекущиеДанныеДивиденды.Идентификатор;
	Иначе 
		ИдентификаторСтрокиВладельца = "идентификатор";
	КонецЕсли;
	ОтборСтрокПриложения = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиВладельца", ИдентификаторСтрокиВладельца);
	Элементы.ДивидендыПриложение.ОтборСтрок = ОтборСтрокПриложения;
	
	ТекущиеДанныеКупоны = Элементы.Купоны.ТекущиеДанные;
	Если Не ТекущиеДанныеКупоны = Неопределено Тогда
		ИдентификаторСтрокиВладельца = ТекущиеДанныеКупоны.Идентификатор;
	Иначе 
		ИдентификаторСтрокиВладельца = "идентификатор";
	КонецЕсли;
	ОтборСтрокПриложения = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиВладельца", ИдентификаторСтрокиВладельца);
	Элементы.КупоныПриложение.ОтборСтрок = ОтборСтрокПриложения;
КонецПроцедуры

&НаКлиенте
Процедура ДивидендыПриАктивизацииСтроки(Элемент)
	АктивизироватьСтроки();
КонецПроцедуры

&НаКлиенте
Процедура КупоныПриАктивизацииСтроки(Элемент)
	АктивизироватьСтроки();
КонецПроцедуры

&НаКлиенте
Процедура КупоныЦеннаяБумагаПриИзменении(Элемент)
	ТекДанные	= Элементы.Купоны.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ТекДанные.КодЦБ	= НайтиКодПоЦеннойБумаге(ТекДанные.ЦеннаяБумага);
	КонецЕсли;
КонецПроцедуры


/////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция НайтиКодПоЦеннойБумаге(ЦеннаяБумага)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КодыЗагрузки.Код
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	КодыЗагрузки.ПометкаУдаления = ЛОЖЬ
	|	И КодыЗагрузки.Владелец = &ЦеннаяБумага
	|	И КодыЗагрузки.Биржа = &КлассификаторНДЦ";
	Запрос.УстановитьПараметр("КлассификаторНДЦ", Константы.КлассификаторЗагрузкиНДЦ.Получить());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Код;
	Иначе	
		Возврат "";
	КонецЕсли;	 
КонецФункции

&НаКлиенте
Процедура Тест4490(Команда)
	
	ДиалогВыбораФайлов = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайлов.МножественныйВыбор = Истина;
	ДиалогВыбораФайлов.Заголовок = "Тестируемые файлы";
	ДиалогВыбораФайлов.Фильтр = "Файлы XML|*.xml|HTML|*.html|HTM|*.htm";
	Если НЕ ДиалогВыбораФайлов.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	ПереданныеФайлы = Новый Массив;
	Тест4490_ПередатьФайлыНаСервер(ДиалогВыбораФайлов.ВыбранныеФайлы, ПереданныеФайлы);
	Тест4490_ОбработатьФайлы(ПереданныеФайлы);
КонецПроцедуры

&НаКлиенте
Процедура Тест4490_ПередатьФайлыНаСервер(ИменаФайлов, ПереданныеФайлы)
	
	Если ТипЗнч(ПереданныеФайлы) <> Тип("Массив") Тогда
		ПереданныеФайлы = Новый Массив;
	КонецЕсли;
	Для Каждого ИмяФайла Из ИменаФайлов Цикл
		Файл = Новый Файл(ИмяФайла);
		ПереданныйФайл = Новый Структура("Имя, АдресХранилище");
		ПереданныйФайл.Имя = Файл.Имя;
		ПереданныйФайл.АдресХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Файл.ПолноеИмя), Новый УникальныйИдентификатор);
		ПереданныеФайлы.Добавить(ПереданныйФайл);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Тест4490_ОбработатьФайлы(ПереданныеФайлы)
	
	Тест4490_ОбработатьФайлыСервер(ПереданныеФайлы);
	
КонецПроцедуры

&НаСервере
Процедура Тест4490_ОбработатьФайлыСервер(ТестовыеФайлыХранилище)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Тест4490(ТестовыеФайлыХранилище);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры
