
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.СписокДепонентов.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отчет.НачалоПериода = НачалоМесяца(ТекущаяДата());
	Отчет.КонецПериода = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	ВремяНачала = ТекущаяДата();
	СформироватьОтчетНаСервере();
	ВремяОкончания = ТекущаяДата();
	ПоказатьОповещениеПользователя("Отчет сформирован",, "Отчет сформирован за " + (ВремяОкончания-ВремяНачала) + " сек.");
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	Результат.Очистить();
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	ЭтотОтчет.СформироватьОтчет(Результат, ЭтотОтчет.СписокДепонентов);
	
	// Установим параметры табличного документа
	Результат.АвтоМасштаб 			= Истина;
	Результат.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	Результат.ОтображатьЗаголовки	= Ложь;
	Результат.ОтображатьСетку		= Ложь;
	Результат.ФиксацияСверху		= 4;
	Результат.ТолькоПросмотр		= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда 
		НастройкаПериода = Новый НастройкаПериода;
		НастройкаПериода.УстановитьПериод(Отчет.НачалоПериода, КонецДня(Отчет.КонецПериода));
		НастройкаПериода.РедактироватьКакИнтервал	= Истина;
		НастройкаПериода.РедактироватьКакПериод		= Истина;
		НастройкаПериода.Редактировать();
		Отчет.НачалоПериода = НастройкаПериода.ПолучитьДатуНачала();
		Отчет.КонецПериода = НастройкаПериода.ПолучитьДатуОкончания();
	#Иначе
		Диалог = Новый ДиалогРедактированияСтандартногоПериода();
		Диалог.Период = Новый СтандартныйПериод(Отчет.НачалоПериода, Отчет.КонецПериода);
		Если Диалог.Редактировать() Тогда 
			Отчет.НачалоПериода = Диалог.Период.ДатаНачала;
			Отчет.КонецПериода = Диалог.Период.ДатаОкончания;
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры
