
&НаКлиенте
Процедура СформироватьФайлыВыгрузкиОтчета(Команда)
	
	ПереопределитьПутьВыгрузки(Объект.ПутьВыгрузки);
	
	РазделыДляВыгрузки = СтруктураРазделовДляВыгрузки();
	
	Для каждого Раздел из РазделыДляВыгрузки Цикл
		
		СформироватьСохранитьТДПоРазделу(Раздел.Значение); 
		
		ДанныеCSV = ПолучитьИзВременногоХранилища(Объект.АдресХранилищаФайлаCSV);
		ДанныеXLSX = ПолучитьИзВременногоХранилища(Объект.АдресХранилищаФайлаXLSX);
		
		ПутьФайлаРаздела = Объект.ПутьВыгрузки + Раздел.Ключ;
		ДанныеCSV.Записать(ПутьФайлаРаздела + ".csv");
		ДанныеXLSX.Записать(ПутьФайлаРаздела + ".xlsx");
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Сформированы файлы выгрузки " + Раздел.Значение + ": " + ПутьФайлаРаздела;
		СообщениеПользователю.Сообщить();
		
	КонецЦикла;
	
	ДанныеСопроводительнойИнформации = СопроводительнаяИнформация();
	
	ПутьФайлаСопроводительнойИнформации = Объект.ПутьВыгрузки + "sr_sved_purcb.csv";
	ДанныеCSV = Новый ЗаписьТекста(ПутьФайлаСопроводительнойИнформации, КодировкаТекста.UTF8);
	
	МассивЗаголовков = Новый Массив;
	МассивДанных = Новый Массив;
	
	Для Каждого Колонка Из ДанныеСопроводительнойИнформации Цикл
		МассивЗаголовков.Добавить(Колонка.Ключ);
		МассивДанных.Добавить(Колонка.Значение);
	КонецЦикла;
	СтрокаЗаголовков = СтрСоединить(МассивЗаголовков, "|");
	СтрокаЗначений = СтрСоединить(МассивДанных, "|");
	ДанныеCSV.ЗаписатьСтроку(СтрокаЗаголовков);
	ДанныеCSV.ЗаписатьСтроку(СтрокаЗначений);
	ДанныеCSV.Закрыть();
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = "Сформирован файл: " + ПутьФайлаСопроводительнойИнформации;
	СообщениеПользователю.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначенияМассив) Экспорт
	
	Для каждого ОбъектНазначения из ОбъектыНазначенияМассив Цикл
		Объект.ДокументОтчета = ОбъектНазначения;
		СформироватьФайлыВыгрузкиОтчета(ИдентификаторКоманды);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураРазделовДляВыгрузки()
	Разделы = Новый Структура;
	Разделы.Вставить("R1", "Раздел1");
	Разделы.Вставить("R2", "Раздел2");
	Разделы.Вставить("R3", "Раздел3");
	Разделы.Вставить("R4", "Раздел4");
	Разделы.Вставить("R5", "Раздел5");
	Разделы.Вставить("R6", "Раздел6");
	Разделы.Вставить("R7", "Раздел7");
	Разделы.Вставить("R8", "Раздел8");
	Разделы.Вставить("R9", "Раздел9");
	Разделы.Вставить("R10", "Раздел10");
	Разделы.Вставить("R11", "Раздел11");
	Возврат Разделы;
КонецФункции

&НаКлиенте
Процедура ПереопределитьПутьВыгрузки(ПутьВыгрузки)
	
	ПутьВыгрузки = "C:\InfoBases\";
	
	Файл = Новый Файл(ПутьВыгрузки);
	Если НЕ Файл.Существует() Тогда
		ПутьВыгрузки = "";
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ПутьВыгрузки) Тогда
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		
		Диалог.Заголовок = НСтр("ru = 'Укажите каталог'");
		Если Диалог.Выбрать() Тогда
			ПутьВыгрузки = Диалог.Каталог + "\";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСохранитьТДПоРазделу(ИмяРаздела)
	
	ИсточникДанных = Объект.ДокументОтчета[ИмяРаздела];
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ИсточникДанных);
	Построитель.ВыводитьПодвалТаблицы = Ложь;
	СкорректироватьПредставлениеИПорядокПолей(ИмяРаздела, Построитель.ВыбранныеПоля);
	УстановитьОформление(Построитель);
	Построитель.Вывести(ТабличныйДокумент);
	
	//Построитель оставляет первую колонку пустой, удаляем ее чтобы данные начинались с первой колонки
	ОбластьУдаления = ТабличныйДокумент.Область(1, , 3, );
	ТабличныйДокумент.УдалитьОбласть(ОбластьУдаления, ТипСмещенияТабличногоДокумента.ПоВертикали);
	ОбластьУдаления = ТабличныйДокумент.Область(1, 1, ТабличныйДокумент.ВысотаТаблицы, 1);
	ТабличныйДокумент.УдалитьОбласть(ОбластьУдаления, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	
	ИмяВременногоФайлаXLSX = ПолучитьИмяВременногоФайла("xlsx");
	ТабличныйДокумент.Записать(ИмяВременногоФайлаXLSX,"XLSX");
	Объект.АдресХранилищаФайлаXLSX = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайлаXLSX), УникальныйИдентификатор);
		
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("csv");
	
	//В Табличном документе заменяем все символы Табуляции на текст "<$СимволТабуляции$/>" чтобы исключить конфликты при создании csv-файла
	// этот цикл можно исключить если исходные данные точно не содержат символы табуляции
	ОбластьПоиска = ТабличныйДокумент.Область(1,1,1,1);
	Пока Истина Цикл
		ОбластьПоиска = ТабличныйДокумент.НайтиТекст(Символы.Таб,ОбластьПоиска);
		Если ОбластьПоиска = Неопределено Тогда
			Прервать;
		КонецЕсли;
		ОбластьПоиска.Текст = СтрЗаменить(ОбластьПоиска.Текст,Символы.Таб,"<$СимволТабуляции$/>");
	КонецЦикла;
	
	// Сохраняем Табличный документ как текст, в полученном текстовом документе значения каждой ячейки разделяются через символ табуляции 
	ТабличныйДокумент.Записать(ИмяВременногоФайла,ТипФайлаТабличногоДокумента.TXT);
	
	//Извлекаем полученный Текстовый документ
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	ТекстовыйФайл.Прочитать(ИмяВременногоФайла,КодировкаТекста.UTF8,Символы.ПС);
	Текст = ТекстовыйФайл.ПолучитьТекст();
	
	//Заменяем сформированные символы табуляции на символ рахделитель csv файла - ";"
	Текст = СтрЗаменить(Текст,Символы.Таб,"|"); 
	
	// Востанавливаем ранее экранированные символы табуляции в самих данных
	Текст = СтрЗаменить(Текст,"<$СимволТабуляции$/>",Символы.Таб);
	
	// Сохраняем сформированные текст csv-файла 
	ТекстовыйФайл.УстановитьТекст(Текст);
	ТекстовыйФайл.Записать(ИмяВременногоФайла,,Символы.ПС);  
	Объект.АдресХранилищаФайлаCSV = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
	
	УдалитьФайлы(ИмяВременногоФайла);
	УдалитьФайлы(ИмяВременногоФайлаXLSX);
	
КонецПроцедуры 

&НаСервере
Функция СопроводительнаяИнформация()

	ДанныеСопроводительные = Новый Структура;
	ДанныеСопроводительные.Вставить("purcb_dic_PSMP_Nm_dimGrp_1_periodGrp_1", Объект.ДокументОтчета.НаименованиеПрофУчастника);
	ДанныеСопроводительные.Вставить("purcb_dic_PSMP_INN_dimGrp_1_periodGrp_1", Объект.ДокументОтчета.ИННПрофУчастника);
	ДанныеСопроводительные.Вставить("purcb_dic_OtvZaPrInf_FIO_dimGrp_1_periodGrp_1", Объект.ДокументОтчета.ФИООтветственного);
	ДанныеСопроводительные.Вставить("purcb_dic_OtvZaPrInf_Tlf_dimGrp_1_periodGrp_1", Объект.ДокументОтчета.ТелефонОтветственного);
	ДанныеСопроводительные.Вставить("purcb_dic_OtvZaPrInf_ElPoch_dimGrp_1_periodGrp_1", Объект.ДокументОтчета.АдресЭлПочтыОтветственного);
	ДанныеСопроводительные.Вставить("purcb_dic_Inf_PO_dimGrp_1_periodGrp_1", Объект.ДокументОтчета.ПрограммноеОбеспечение);
	ДанныеСопроводительные.Вставить("purcb_dic_Rqst_Dt_dimGrp_1_periodGrp_1", Формат(Объект.ДокументОтчета.ДатаНаправленияЗапроса,"ДФ=yyyy-MM-dd"));
	ДанныеСопроводительные.Вставить("purcb_dic_Rspns_Dt_dimGrp_1_periodGrp_1", Формат(Объект.ДокументОтчета.ДатаПредоставленияОтветаНаЗапрос,"ДФ=yyyy-MM-dd"));
	ДанныеСопроводительные.Вставить("purcb_dic_PeriodStart_Dt_dimGrp_1_periodGrp_1", Формат(Объект.ДокументОтчета.НачалоПериода,"ДФ=yyyy-MM-dd"));
	ДанныеСопроводительные.Вставить("purcb_dic_PeriodEnd_Dt_dimGrp_1_periodGrp_1", Формат(Объект.ДокументОтчета.КонецПериода,"ДФ=yyyy-MM-dd"));
	ДанныеСопроводительные.Вставить("purcb_dic_R1Enumerator_dimGrp_1_periodGrp_1", ЕстьДанные(Объект.ДокументОтчета.Раздел1.Количество()));
	ДанныеСопроводительные.Вставить("purcb_dic_R2Enumerator_dimGrp_1_periodGrp_1", ЕстьДанные(Объект.ДокументОтчета.Раздел2.Количество()));
	ДанныеСопроводительные.Вставить("purcb_dic_R3Enumerator_dimGrp_1_periodGrp_1", ЕстьДанные(Объект.ДокументОтчета.Раздел3.Количество()));
	ДанныеСопроводительные.Вставить("purcb_dic_R4Enumerator_dimGrp_1_periodGrp_1", ЕстьДанные(Объект.ДокументОтчета.Раздел4.Количество()));
	ДанныеСопроводительные.Вставить("purcb_dic_R5Enumerator_dimGrp_1_periodGrp_1", ЕстьДанные(Объект.ДокументОтчета.Раздел5.Количество()));
	ДанныеСопроводительные.Вставить("purcb_dic_R6Enumerator_dimGrp_1_periodGrp_1", ЕстьДанные(Объект.ДокументОтчета.Раздел6.Количество()));
	ДанныеСопроводительные.Вставить("purcb_dic_PR7Enumerator_dimGrp_1_periodGrp_1", ЕстьДанные(Объект.ДокументОтчета.Раздел7.Количество()));
	ДанныеСопроводительные.Вставить("purcb_dic_R8Enumerator_dimGrp_1_periodGrp_1", ЕстьДанные(Объект.ДокументОтчета.Раздел8.Количество()));
	ДанныеСопроводительные.Вставить("purcb_dic_R9Enumerator_dimGrp_1_periodGrp_1", ЕстьДанные(Объект.ДокументОтчета.Раздел9.Количество()));
	ДанныеСопроводительные.Вставить("purcb_dic_R10Enumerator_dimGrp_1_periodGrp_1", ЕстьДанные(Объект.ДокументОтчета.Раздел10.Количество()));
	ДанныеСопроводительные.Вставить("purcb_dic_R11Enumerator_dimGrp_1_periodGrp_1", ЕстьДанные(Объект.ДокументОтчета.Раздел11.Количество()));
	ДанныеСопроводительные.Вставить("purcb_dic_Rqst_YrsEnumerator2_dimGrp_1_periodGrp_1", ГодОтчета());
	
	Возврат ДанныеСопроводительные;
	
КонецФункции

&НаСервере
Процедура СкорректироватьПредставлениеИПорядокПолей(ИсточникДанных, ВыбранныеПоля)
	ВыбранныеПоля.Очистить();
	Если ИсточникДанных = "Раздел1" Тогда
		Представления = СписокПредставленийРаздел1();
	ИначеЕсли ИсточникДанных = "Раздел2" Тогда
		Представления = СписокПредставленийРаздел2();
	ИначеЕсли ИсточникДанных = "Раздел3" Тогда
		Представления = СписокПредставленийРаздел3();
	ИначеЕсли ИсточникДанных = "Раздел4" Тогда
		Представления = СписокПредставленийРаздел4();
	ИначеЕсли ИсточникДанных = "Раздел5" Тогда
		Представления = СписокПредставленийРаздел5();
	ИначеЕсли ИсточникДанных = "Раздел6" Тогда
		Представления = СписокПредставленийРаздел6();
	ИначеЕсли ИсточникДанных = "Раздел7" Тогда
		Представления = СписокПредставленийРаздел7();
	ИначеЕсли ИсточникДанных = "Раздел8" Тогда
		Представления = СписокПредставленийРаздел8();
	ИначеЕсли ИсточникДанных = "Раздел9" Тогда
		Представления = СписокПредставленийРаздел9();
	ИначеЕсли ИсточникДанных = "Раздел10" Тогда
		Представления = СписокПредставленийРаздел10();
	ИначеЕсли ИсточникДанных = "Раздел11" Тогда
		Представления = СписокПредставленийРаздел11();
	КонецЕсли;
	Представления.СортироватьПоПредставлению();
	Для каждого Поле из Представления Цикл
		ВыбранныеПоля.Добавить(Поле.Значение, Поле.Значение);
	КонецЦикла;
	Для каждого Поле из ВыбранныеПоля Цикл
		НайденноеПоле = Представления.НайтиПоЗначению(Поле.Имя);
		Если НЕ НайденноеПоле = Неопределено Тогда
			Поле.Представление = НайденноеПоле.Представление;
		КонецЕсли;
	КонецЦикла;
	ВыбранныеПоля[0].Представление = "string_num";
	ВыбранныеПоля.Добавить("НомерСтроки", "uuid").Представление = "uuid";
КонецПроцедуры

&НаСервере
Процедура УстановитьОформление(Построитель)  
	
	ЭлементОформления = Построитель.УсловноеОформление.Добавить("ОформлениеЧислаДаты");
	ЭлементОформления.Оформление.Формат.Значение = "ЧРД=.; ЧН=0; ЧГ=0; ДФ=yyyy-MM-dd";
	ЭлементОформления.Оформление.Формат.Использование = Истина;
	ЭлементОформления.Использование = Истина;
		
	ПоляВремени = Новый Массив;
	Для каждого Поле из Построитель.ВыбранныеПоля Цикл
		Если СтрНайти(ВРЕГ(Поле.Имя), "ВРЕМЯ") > 0 Тогда
			ПоляВремени.Добавить(Поле.Имя);
		КонецЕсли;
	КонецЦикла;
	Если ПоляВремени.Количество() > 0 Тогда 
		ЭлементОформления = Построитель.УсловноеОформление.Добавить("ОформлениеВремени");
		ЭлементОформления.Оформление.Формат.Значение = "ДФ=ЧЧ:мм:сс";
		ЭлементОформления.Оформление.Формат.Использование = Истина;
		Для каждого ИмяПоля из ПоляВремени Цикл
			ЭлементОбласти = ЭлементОформления.Область.Добавить(ИмяПоля);
		КонецЦикла;
		ЭлементОформления.Использование = Истина;
	КонецЕсли;
	
	
	ПолеUUID = Построитель.ВыбранныеПоля.Найти("uuid");
	Если НЕ ПолеUUID = Неопределено Тогда
		ЭлементОформления = Построитель.УсловноеОформление.Добавить("ОформлениеUUID");
		ЭлементОформления.Оформление.Текст.Значение = "";
		ЭлементОформления.Оформление.Текст.Использование = Истина;
		ЭлементОформления.Область.Добавить(ПолеUUID.ПутьКДанным, ПолеUUID.Имя);
		ЭлементОформления.Использование = Истина;
	КонецЕсли;
	
	//У следующих колонок пустое значение не допускается в виде 0
	МассивИменПустыхПолей = Новый Массив();
	МассивИменПустыхПолей.Добавить("ВидимоеКоличествоАктиваТипаАйсберг");
	МассивИменПустыхПолей.Добавить("СтавкаРЕПО");
	МассивИменПустыхПолей.Добавить("СтоимостьАктиваОперацииВВалютеЦены");
	МассивИменПустыхПолей.Добавить("ПремияДисконтНакопленныйПроцентПоЦБ");
	МассивИменПустыхПолей.Добавить("ВидАктива");
	
	Для каждого ИмяПустогоПоля из МассивИменПустыхПолей цикл
		
		ПустоеПоле = Построитель.ВыбранныеПоля.Найти(ИмяПустогоПоля);
		Если НЕ ПустоеПоле = Неопределено тогда
			ЭлементОформления = Построитель.УсловноеОформление.Добавить("Оформление"+ИмяПустогоПоля);
			ЭлементОформления.Оформление.Формат.Значение = "ЧРД=.; ЧГ=0";
			ЭлементОформления.Оформление.Формат.Использование = Истина;
			ЭлементОформления.Область.Добавить(ПустоеПоле.ПутьКДанным, ПустоеПоле.Имя);
			ЭлементОформления.Использование = Истина;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

#Область ВспомогательныеФункцииОформления

&НаСервере
Функция ЕстьДанные(КоличествоСтрок)
	Если КоличествоСтрок = 0 Тогда
		Возврат "Запрошенные данные отсутствуют";
	Иначе 
		Возврат "Данные переданы";
	КонецЕсли;
КонецФункции

&НаСервере
Функция ГодОтчета()
	Годы = "";
	ДатаОтчета = Объект.ДокументОтчета.НачалоПериода;
	Пока ДатаОтчета < Объект.ДокументОтчета.КонецПериода Цикл
		Годы = Годы + Формат(ДатаОтчета, "ДФ=yyyy");
		ДатаОтчета = ДобавитьМесяц(ДатаОтчета, 12);
	КонецЦикла;
	Возврат Годы;
КонецФункции

&НаСервере
Функция СписокПредставленийРаздел1()
	Список = Новый СписокЗначений;
	Список.Добавить("НомерСтроки", "_string_num"); 
	Список.Добавить("КодКлиента", "dim_int_C_CdTaxis"); 
	Список.Добавить("КодДоговора", "dim_int_Cntrct_CdTaxis");
	Список.Добавить("КодПортфеля", "dim_int_A_PrtflCdTaxis");
	Список.Добавить("ДатаВступленияВСилу", "dim_int_Cntrct_DtTaxis"); 
	Список.Добавить("ДатаВнесенияЗаписиВУ", "purcb_dic_R_Dt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВремяВнесенияЗаписиВУ", "purcb_dic_R_Tm_dimGrp_1_periodGrp_1");
	Список.Добавить("ЧасовойПояс", "purcb_dic_R_TmZn_dimGrp_1_periodGrp_1");
	Список.Добавить("СпособВнесенияЗаписиВУ", "purcb_dic_R_Mthd_dimGrp_1_periodGrp_1");
	Список.Добавить("ФИОРаботникаИлиСистемы", "purcb_dic_R_WrkrId_dimGrp_1_periodGrp_1");
	Список.Добавить("НомерДоговора", "purcb_dic_Cntrct_N_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаЗаключенияДоговора", "purcb_dic_Cntrct_BDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаРасторженияДоговора", "purcb_dic_Cntrct_EDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВариантДоговора", "purcb_dic_Cntrct_Optn_dimGrp_1_periodGrp_1");
	Список.Добавить("ДеятельностьУчастникаСогласноДоговору", "purcb_dic_Actvts_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеПредметаИногоДоговора", "purcb_dic_Cntrct_Othr_dimGrp_1_periodGrp_1");
	Список.Добавить("КатегорияКлиентаПоУровнюРиска", "purcb_dic_CRskLvl_dimGrp_1_periodGrp_1");
	Список.Добавить("ОткрытиеИИС", "purcb_dic_Cntrct_IIA_dimGrp_1_periodGrp_1");
	Список.Добавить("ЗаключениеДоговоровФорекс", "purcb_dic_Cntrct_FrxDlr_dimGrp_1_periodGrp_1");
	Список.Добавить("СовершениеСделокЗаСчетКлиентаСИнВалютой", "purcb_dic_Cntrct_Frgn_dimGrp_1_periodGrp_1");
	Список.Добавить("СовершениеСделокЗаСчетКлиентаСТоварами", "purcb_dic_Cntrct_Gds_dimGrp_1_periodGrp_1");
	Список.Добавить("ПередачаАктивовКлиентаВРаспоряжениеБрокеру", "purcb_dic_Cntrct_Trsfr_dimGrp_1_periodGrp_1");
	Список.Добавить("ВедениеБрокеромВУВОтношенииКлиентов", "purcb_dic_Cntrct_SprtAccntngPB_dimGrp_1_periodGrp_1");
	Список.Добавить("ВедениеБрокеромОбособленногоУчетаВОтношенииУчредителей", "purcb_dic_Cntrct_SprtAccntngTMS_dimGrp_1_periodGrp_1");
	Список.Добавить("ИдентификаторКлиентаПоследующегоКонтрагента", "purcb_dic_C_Cd2_dimGrp_1_periodGrp_1");
	Список.Добавить("ВедениеБрокеромВУВСоставеПортфелейКлиента", "purcb_dic_Cntrct_Prtfl_dimGrp_1_periodGrp_1");
	Список.Добавить("ПредоставлениеБрокеромМаржинальныхЗаймов", "purcb_dic_Cntrct_Mrgn_dimGrp_1_periodGrp_1");
	Список.Добавить("ПредоставлениеБрокеромЗаймовНаУсловияхОтдельныхДоговоров", "purcb_dic_Cntrct_Unscrd_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбозначенияВидовДополнительныхДанных", "purcb_dic_PrInfPokazatel_dimGrp_1_periodGrp_1");
	Список.Добавить("ЗначенияДополнительныхДанных", "purcb_dic_PrInfDannye_dimGrp_1_periodGrp_1");
	Возврат Список;
КонецФункции

&НаСервере
Функция СписокПредставленийРаздел2()
	
	Список = Новый СписокЗначений;
	Список.Добавить("НомерСтроки", "_string_num"); 
	Список.Добавить("КодКлиента", "dim_int_C_CdTaxis"); 
	Список.Добавить("КодДоговора", "dim_int_Cntrct_CdTaxis");
	Список.Добавить("КодПортфеля", "dim_int_A_PrtflCdTaxis");
	Список.Добавить("НомерПорученияКлиента", "dim_int_Rqst_IdTaxis");
	Список.Добавить("НомерЗаявкиВСистемеТоргов", "dim_int_Rqst_IdTrdTaxis");
	Список.Добавить("КодАктива", "dim_int_Asst_IdTaxis");
	Список.Добавить("ДатаВнесенияЗаписиВУ", "purcb_dic_R_Dt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВремяВнесенияЗаписиВУ", "purcb_dic_R_Tm_dimGrp_1_periodGrp_1");
	Список.Добавить("ЧасовойПояс", "purcb_dic_R_TmZn_dimGrp_1_periodGrp_1");
	Список.Добавить("СпособВнесенияЗаписиВУ", "purcb_dic_R_Mthd_dimGrp_1_periodGrp_1");
	Список.Добавить("ФИОРаботникаИлиСистемы", "purcb_dic_R_WrkrId_dimGrp_1_periodGrp_1");
	Список.Добавить("СостояниеПоручения", "purcb_dic_R_Grnd_dimGrp_1_periodGrp_1");
	Список.Добавить("ИдентификаторКлиентаПоследующегоКонтрагента", "purcb_dic_C_Cd2_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаПоступленияПоручения", "purcb_dic_Rqst_BgnDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВремяПоступленияПоручения", "purcb_dic_Rqst_BgnTm_dimGrp_1_periodGrp_1");
	Список.Добавить("СпособПодачиПоручения", "purcb_dic_Rqst_Mthd_dimGrp_1_periodGrp_1");
	Список.Добавить("ФИОТрейдераТерминала", "purcb_dic_Rqst_TrdUsr_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаРегистрацииПоручения", "purcb_dic_Rqst_TrdBgnDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВремяРегистрацииПоручения", "purcb_dic_Rqst_TrdBgnTm_dimGrp_1_periodGrp_1");
	Список.Добавить("АдресностьЗаявки", "purcb_dic_Rqst_TrdAddrss_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаЗакрытияПоручения", "purcb_dic_Rqst_EndDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВремяЗакрытияПоручения", "purcb_dic_Rqst_EndTm_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидПоручения", "purcb_dic_Rqst_Trd_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеОрганизатораТорговли", "purcb_dic_Rqst_OrgNm_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидАктиваНеторговойОперации", "purcb_dic_Rqst_NTrdAsstTp_dimGrp_1_periodGrp_1");
	Список.Добавить("НаправлениеНеторговойОперации", "purcb_dic_Rqst_NTrdRcptOrDspsl_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеИногоРезультатаНеторговойОперации", "purcb_dic_Rqst_NTrdRsltOthr_dimGrp_1_periodGrp_1");
	Список.Добавить("ТипПорученияНаПроведениеТорговойОперации", "purcb_dic_Rqst_OrgTp_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеИногоТипаПорученияНаСовершениеТорговойОперации", "purcb_dic_Rqst_OrgTpOthr_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидимоеКоличествоАктиваТипаАйсберг", "purcb_dic_Rqst_Icbrg_dimGrp_1_periodGrp_1");
	Список.Добавить("УсловияДействияПоручения", "purcb_dic_Rqst_OrgVldt_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеИныхУсловийДействияПоручения", "purcb_dic_Rqst_OrgVldtOthr_dimGrp_1_periodGrp_1");
	Список.Добавить("УсловиеАннулированияДействияПоручения", "purcb_dic_Rqst_OrgEndCndtn_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидТорговойОперации", "purcb_dic_Rqst_Tp_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеИногоВидаОперации", "purcb_dic_Rqst_TpOthr_dimGrp_1_periodGrp_1");
	Список.Добавить("НаправлениеТорговойОперации", "purcb_dic_Rqst_Rslt_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеИногоРезультатаТорговойОперации", "purcb_dic_Rqst_RsltOthr_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидАктиваТорговойОперации", "purcb_dic_Rqst_AsstTp_dimGrp_1_periodGrp_1");
	Список.Добавить("ВалютаАктива", "purcb_dic_Asst_CrncEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("ВалютаЦеныАктиваВторая", "purcb_dic_Asst_Crnc2Enumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("ЦенаЕдиницыАктиваВВалютеЦены", "purcb_dic_Asst_Prc_dimGrp_1_periodGrp_1");
	Список.Добавить("ЕдиницаИзмеренияАктива", "purcb_dic_Asst_TpNtEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("КоличествоАктиваОперации", "purcb_dic_Asst_Sz_dimGrp_1_periodGrp_1");
	Список.Добавить("СтоимостьАктиваОперацииВВалютеЦены", "purcb_dic_Asst_Amnt_dimGrp_1_periodGrp_1");
	Список.Добавить("СтавкаРЕПО", "purcb_dic_Asst_ScrtREPORt_dimGrp_1_periodGrp_1");
	Список.Добавить("СуммаТорговогоПорученияВВалютеЦеныАктива", "purcb_dic_Rqst_Amnt_dimGrp_1_periodGrp_1");
	Список.Добавить("ИныеСущественныеУсловия", "purcb_dic_Rqst_Othr_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбозначенияВидовДополнительныхДанных", "purcb_dic_PrInfPokazatel_dimGrp_1_periodGrp_1");
	Список.Добавить("ЗначенияДополнительныхДанных", "purcb_dic_PrInfDannye_dimGrp_1_periodGrp_1");
	Возврат Список;
	
КонецФункции

&НаСервере
Функция СписокПредставленийРаздел3()
	
	Список = Новый СписокЗначений;
	Список.Добавить("НомерСтроки", "_string_num");
	Список.Добавить("КодКлиента", "dim_int_C_CdTaxis");
	Список.Добавить("КодДоговора", "dim_int_Cntrct_CdTaxis");
	Список.Добавить("КодПортфеля", "dim_int_A_PrtflCdTaxis");
	Список.Добавить("НомерПорученияКлиента", "dim_int_Rqst_IdTaxis");
	Список.Добавить("НомерЗаявкиВСистемеТоргов", "dim_int_Rqst_IdTrdTaxis");
	Список.Добавить("НомерСделки", "dim_int_T_IdTaxis");
	Список.Добавить("НомерЭтапаСделки", "dim_int_T_IdTrdTaxis");
	Список.Добавить("КодАктива", "dim_int_Asst_IdTaxis");
	Список.Добавить("ИдентификаторСтроки", "dim_int_ID_strokiTaxis");
	Список.Добавить("ДатаВнесенияЗаписиВУ", "purcb_dic_R_Dt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВремяВнесенияЗаписиВУ", "purcb_dic_R_Tm_dimGrp_1_periodGrp_1");
	Список.Добавить("ЧасовойПояс", "purcb_dic_R_TmZn_dimGrp_1_periodGrp_1");
	Список.Добавить("СпособВнесенияЗаписиВУ", "purcb_dic_R_Mthd_dimGrp_1_periodGrp_1");
	Список.Добавить("ФИОРаботникаИлиСистемы", "purcb_dic_R_WrkrId_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеДокументаОснования", "purcb_dic_R_DcmNm_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаДокументаОснования", "purcb_dic_R_DcmDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВремяДокументаОснования", "purcb_dic_R_DcmTm_dimGrp_1_periodGrp_1");
	Список.Добавить("НомерДокументаОснования", "purcb_dic_R_DcmN_dimGrp_1_periodGrp_1");
	Список.Добавить("СостояниеИсполненияСделки", "purcb_dic_R_Grnd_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаАктаОРасхождениях", "purcb_dic_R_VrfDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаЗаключенияСделки", "purcb_dic_T_Dt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВремяЗаключенияСделки", "purcb_dic_T_Tm_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидСделки", "purcb_dic_T_Trd_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеОрганизатораТорговли", "purcb_dic_T_OrgNm_dimGrp_1_periodGrp_1");
	Список.Добавить("НомерСделкиПрисвоенныйОрганизаторомТоргов", "purcb_dic_T_NOrg_dimGrp_1_periodGrp_1");
	Список.Добавить("КодСекцииОрганизатораТорговли", "purcb_dic_T_TrdOrgSctn_dimGrp_1_periodGrp_1");
	Список.Добавить("КодРежимаТоргов", "purcb_dic_T_TrdBrd_dimGrp_1_periodGrp_1");
	Список.Добавить("РольБрокера", "purcb_dic_T_Br_dimGrp_1_periodGrp_1");
	Список.Добавить("ОснованиеЗаключенияСделки", "purcb_dic_T_Bss_dimGrp_1_periodGrp_1");
	Список.Добавить("ФИОТрейдераТерминала", "purcb_dic_Rqst_TrdUsr_dimGrp_1_periodGrp_1");
	Список.Добавить("АдресностьЗаявки", "purcb_dic_Rqst_TrdAddrss_dimGrp_1_periodGrp_1");
	Список.Добавить("НомерВнебиржевойСделки", "purcb_dic_T_IdNoTrdOrg_dimGrp_1_periodGrp_1");
	Список.Добавить("ТипРасчетовПоСделке", "purcb_dic_T_SttlmTp_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеКлиринговойОрганизации", "purcb_dic_T_SttlmNm_dimGrp_1_periodGrp_1");
	Список.Добавить("УчастиеЦентральногоКонтрагентаВЗаключенииСделки", "purcb_dic_T_CntrlCntrprt_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеЦентральногоКонтрагента", "purcb_dic_T_CntrlCntrprtNm_dimGrp_1_periodGrp_1");
	Список.Добавить("ПорядокЗаключенияСделки", "purcb_dic_T_Prcdr_dimGrp_1_periodGrp_1");
	Список.Добавить("ИННПервичногоБрокера", "purcb_dic_INN_PrimBrk_dimGrp_1_periodGrp_1");
	Список.Добавить("КодКлиентаПервойСтороныПоСделке", "purcb_dic_FP_CdTrd_dimGrp_1_periodGrp_1");
	Список.Добавить("ПрофУчастникПредставляетОднуИлиОбеСтороныСделки", "purcb_dic_FP_CntrctrIntrnl_dimGrp_1_periodGrp_1");
	Список.Добавить("КодДоговораСКонтрагентом", "purcb_dic_SP_CntrctrCntrctCdClnt_dimGrp_1_periodGrp_1");
	Список.Добавить("КодКонтрагента", "purcb_dic_SP_CntrctrCd_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеКонтрагента", "purcb_dic_SP_CntrctrNm_dimGrp_1_periodGrp_1");
	Список.Добавить("КодУчастникаТоргов", "purcb_dic_SP_CntrctrCdTrd_dimGrp_1_periodGrp_1");
	Список.Добавить("ТипЛицаКонтрагента", "purcb_dic_SP_CntrctrTp_dimGrp_1_periodGrp_1");
	Список.Добавить("ПризнакГражданстваКонтрагента", "purcb_dic_SP_CntrctrRsd_dimGrp_1_periodGrp_1");
	Список.Добавить("СтранаГражданстваКонтрагента", "purcb_dic_SP_CntrctrCntrEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("ИННКонтрагента", "purcb_dic_SP_CntrctrINN_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидДокументаУдостоверяющегоЛичность", "purcb_dic_SP_DcmTp_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеВидаДокументаУдостоверяющегоЛичность", "purcb_dic_SP_DcmTpOthr_dimGrp_1_periodGrp_1");
	Список.Добавить("СерияДокументаУдостоверяющегоЛичность", "purcb_dic_SP_DcmSrs_dimGrp_1_periodGrp_1");
	Список.Добавить("НомерДокументаУдостоверяющегоЛичность", "purcb_dic_SP_DcmN_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаВыдачиДокументаУдостоверяющегоЛичность", "purcb_dic_SP_DcmDt_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеОрганаВыдавшегоДокументУдостоверяющийЛичность", "purcb_dic_SP_DcmEntNm_dimGrp_1_periodGrp_1");
	Список.Добавить("КодПодразделенияВыдавшегоДокументУдостоверяющийЛичность", "purcb_dic_SP_DcmUntCd_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидДоговораСделки", "purcb_dic_T_Tp_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеИногоВидаДоговораСделки", "purcb_dic_T_TpOthr_dimGrp_1_periodGrp_1");
	Список.Добавить("НаправлениеСделки", "purcb_dic_T_Rslt_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеИногоРезультатаСделки", "purcb_dic_T_RsltOthr_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидАктива", "purcb_dic_Asst_Tp_dimGrp_1_periodGrp_1");
	Список.Добавить("ЦенаИсполненияОпциона", "purcb_dic_T_DFIOStrkPrc_dimGrp_1_periodGrp_1");
	Список.Добавить("ТекущаяЦенаБазовогоАктива", "purcb_dic_T_DFIAsstPrc_dimGrp_1_periodGrp_1");
	Список.Добавить("ВалютаАктива", "purcb_dic_Asst_CrncEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("ВалютаЦеныАктиваВторая", "purcb_dic_Asst_Crnc2Enumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("ЦенаЕдАктиваВВалютеЦены", "purcb_dic_Asst_Prc_dimGrp_1_periodGrp_1");
	Список.Добавить("ЦенаЕдАктиваВРубЭквиваленте", "purcb_dic_Asst_PrcRU_dimGrp_1_periodGrp_1");
	Список.Добавить("КурсИнВалюты", "purcb_dic_Asst_ExchgRt_dimGrp_1_periodGrp_1");
	Список.Добавить("ЕдИзмеренияАктива", "purcb_dic_Asst_TpNtEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("КоличествоАктива", "purcb_dic_Asst_Sz_dimGrp_1_periodGrp_1");
	Список.Добавить("СтоимостьСделки", "purcb_dic_Asst_Amnt_dimGrp_1_periodGrp_1");
	Список.Добавить("ПремияДисконтНакопленныйПроцентПоЦБ", "purcb_dic_Asst_ScrtNmnlCpnYld_dimGrp_1_periodGrp_1");
	Список.Добавить("СтавкаРЕПО", "purcb_dic_Asst_ScrtREPORt_dimGrp_1_periodGrp_1");
	Список.Добавить("ТипПроцентнойСтавкиПоЗайму", "purcb_dic_Asst_LnRtTp_dimGrp_1_periodGrp_1");
	Список.Добавить("ФиксированнаяСтавка", "purcb_dic_Asst_LnRtFxd_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеПоказателяРасчетаПлавающейСтавки", "purcb_dic_Asst_LnRtFltNm_dimGrp_1_periodGrp_1");
	Список.Добавить("КодПоказателяПлавающейСтавки", "purcb_dic_Asst_LnRtFltCd_dimGrp_1_periodGrp_1");
	Список.Добавить("ПлановаяСуммаПроцентныхВыплатВВалютеРасчетов", "purcb_dic_Asst_LnFltPlUpPrLmt_dimGrp_1_periodGrp_1");
	Список.Добавить("СпособПроведенияРасчета", "purcb_dic_T_Prsn_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеИногоСпособаПроведенияРасчета", "purcb_dic_T_PrsnOthr_dimGrp_1_periodGrp_1");
	Список.Добавить("ВалютаРасчетов", "purcb_dic_T_CrncEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеСпособаОпределенияКурсаВалютыЦеныПоОтношениюКВалютеРасчетов", "purcb_dic_T_CrncMthd_dimGrp_1_periodGrp_1");
	Список.Добавить("ВерхняяГраницаКурса", "purcb_dic_T_CrncUpprLmt_dimGrp_1_periodGrp_1");
	Список.Добавить("НижняяГраницаКурса", "purcb_dic_T_CrncLwrLmt_dimGrp_1_periodGrp_1");
	Список.Добавить("ПорядокИсполненияОбязательств", "purcb_dic_T_Mthd_dimGrp_1_periodGrp_1");
	Список.Добавить("СрокИсполненияСделки", "purcb_dic_T_Prd_dimGrp_1_periodGrp_1");
	Список.Добавить("КоличествоДатПоставки", "purcb_dic_T_RghtDtN_dimGrp_1_periodGrp_1");
	Список.Добавить("КоличествоДатРасчетов", "purcb_dic_T_PmntDtN_dimGrp_1_periodGrp_1");
	Список.Добавить("ПлановаяДатаПоставки", "purcb_dic_T_RghtPlnDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ФактическаяДатаПоставки", "purcb_dic_T_RghtFctDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ПлановаяДатаОплаты", "purcb_dic_T_PmntPlnDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ФактическаяДатаОплаты", "purcb_dic_T_PmntFctDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаТекущегоСостоянияСделки", "purcb_dic_T_Dt_CS_dimGrp_1_periodGrp_1");
	Список.Добавить("КоличествоОставшеесяКПоставке", "purcb_dic_Asst_Sz_CS_dimGrp_1_periodGrp_1");
	Список.Добавить("СтоимостьОставшаясяКПоставке", "purcb_dic_Asst_AmntRU_Sz_CS_dimGrp_1_periodGrp_1");
	Список.Добавить("СтоимостьОставшаясяКОплатеВВалютеРасчетов", "purcb_dic_Asst_Amnt_CS_dimGrp_1_periodGrp_1");
	Список.Добавить("СтоимостьОставшаясяКОплатеВРублевомЭквиваленте", "purcb_dic_Asst_AmntRU_CS_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбозначенияВидовДополнительныхДанных", "purcb_dic_PrInfPokazatel_dimGrp_1_periodGrp_1");
	Список.Добавить("ЗначенияДополнительныхДанных", "purcb_dic_PrInfDannye_dimGrp_1_periodGrp_1");
	Возврат Список;
	
КонецФункции

&НаСервере
Функция СписокПредставленийРаздел4()
	
	Список = Новый СписокЗначений;
	Список.Добавить("НомерСтроки", "_string_num"); 
	Список.Добавить("КодКлиента", "dim_int_C_CdTaxis");
	Список.Добавить("КодДоговора", "dim_int_Cntrct_CdTaxis");
	Список.Добавить("КодПортфеля", "dim_int_A_PrtflCdTaxis");
	Список.Добавить("НомерСчетаВУ", "dim_int_A_NTaxis");
	Список.Добавить("НомерРазделаСчетаВУ", "dim_int_A_SctnTaxis");
	Список.Добавить("ДатаВнесенияЗаписиВУ", "purcb_dic_R_Dt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВремяВнесенияЗаписиВУ", "purcb_dic_R_Tm_dimGrp_1_periodGrp_1");
	Список.Добавить("ЧасовойПояс", "purcb_dic_R_TmZn_dimGrp_1_periodGrp_1");
	Список.Добавить("СпособВнесенияЗаписиВУ", "purcb_dic_R_Mthd_dimGrp_1_periodGrp_1");
	Список.Добавить("ФИОРаботникаИлиСистемы", "purcb_dic_R_WrkrId_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаОткрытияСчетаВУ", "purcb_dic_A_Opn_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаЗакрытияСчетаВУ", "purcb_dic_A_Cls_dimGrp_1_periodGrp_1");
	Список.Добавить("КодНазначенияСчетаВУ", "purcb_dic_A_IndctCd_dimGrp_1_periodGrp_1");
	Список.Добавить("КодКлиентаПоследующегоКонтрагента", "purcb_dic_C_Cd2_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеКлиентаПоследующегоКонтрагента", "purcb_dic_C_Nm2_dimGrp_1_periodGrp_1");
	Список.Добавить("ВариантВеденияВУОтносительноСоставаПортфелей", "purcb_dic_A_Prtfl_dimGrp_1_periodGrp_1");
	Список.Добавить("КоличествоУчитываемыхПортфелей", "purcb_dic_A_PrtflN_dimGrp_1_periodGrp_1");
	Список.Добавить("КодУчитываемогоНаСчетеПортфеля", "purcb_dic_A_PrtflCdNm_dimGrp_1_periodGrp_1");
	Список.Добавить("ВариантВеденияОперацийИОбязательств", "purcb_dic_A_Optn_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеСчетаВУ", "purcb_dic_A_IndctDscr_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбозначениеСчетаВУ", "purcb_dic_A_N2_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбозначениеРазделаСчетаВУ", "purcb_dic_A_Sctn2_dimGrp_1_periodGrp_1");
	Список.Добавить("ПризнакИндивидуальногоИнвестиционногоСчета", "purcb_dic_A_IndvdlInvstmnt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВариантВеденияАктивовКлиентовПрофУчастника", "purcb_dic_ALF_Grpng_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеОрганизации", "purcb_dic_ALF_OrgNm_dimGrp_1_periodGrp_1");
	Список.Добавить("ИННОрганизации", "purcb_dic_ALF_OrgINN_dimGrp_1_periodGrp_1");
	Список.Добавить("НомерСчетаВОрганизации", "purcb_dic_ALF_OrgAccnt_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеСчетаВОрганизации", "purcb_dic_ALF_LctnNm_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидСчетаВОрганизации", "purcb_dic_ALF_LctnTp_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеИногоВидаСчетаВОрганизации", "purcb_dic_ALF_LctnTpOthr_dimGrp_1_periodGrp_1");
	Список.Добавить("ИнфОПравеБрокераИспользоватьАктивКлиента", "purcb_dic_ALF_UsFnds_dimGrp_1_periodGrp_1");
	Список.Добавить("НаличиеТребованияКУчетуАктивовКлиента", "purcb_dic_A_StrgAcntgReq_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбозначенияВидовДополнительныхДанных", "purcb_dic_PrInfPokazatel_dimGrp_1_periodGrp_1");
	Список.Добавить("ЗначенияДополнительныхДанных", "purcb_dic_PrInfDannye_dimGrp_1_periodGrp_1");
	Возврат Список;
	
КонецФункции

&НаСервере
Функция СписокПредставленийРаздел5() 
	
	Список = Новый СписокЗначений;
	Список.Добавить("НомерСтроки", "_string_num");
	Список.Добавить("КодКлиента", "dim_int_C_CdTaxis");
	Список.Добавить("КодДоговора", "dim_int_Cntrct_CdTaxis");
	Список.Добавить("КодПортфеля", "dim_int_A_PrtflCdTaxis");
	Список.Добавить("НомерПорученияКлиента", "dim_int_Rqst_IdTaxis");
	Список.Добавить("НомерСделки", "dim_int_T_IdTaxis");
	Список.Добавить("НомерЭтапаСделки", "dim_int_T_IdTrdTaxis");
	Список.Добавить("НомерСчетаВУ", "dim_int_A_NTaxis");
	Список.Добавить("НомерРазделаСчетаВУ", "dim_int_A_SctnTaxis");
	Список.Добавить("КодАктива", "dim_int_Asst_IdTaxis");
	Список.Добавить("ИдентификаторСтроки", "dim_int_ID_strokiTaxis");
	Список.Добавить("ДатаВнесенияЗаписиВУ", "purcb_dic_R_Dt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВремяВнесенияЗаписиВУ", "purcb_dic_R_Tm_dimGrp_1_periodGrp_1");
	Список.Добавить("ЧасовойПояс", "purcb_dic_R_TmZn_dimGrp_1_periodGrp_1");
	Список.Добавить("СпособВнесенияЗаписиВУ", "purcb_dic_R_Mthd_dimGrp_1_periodGrp_1");
	Список.Добавить("ФИОРаботникаИлиСистемы", "purcb_dic_R_WrkrId_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеДокументаОснования", "purcb_dic_R_DcmNm_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаДокументаОснования", "purcb_dic_R_DcmDt_dimGrp_1_periodGrp_1");
	Список.Добавить("НомерДокументаОснования", "purcb_dic_R_DcmN_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаАктаОРасхождениях", "purcb_dic_R_VrfDt_dimGrp_1_periodGrp_1");
	Список.Добавить("КодНазначенияСчетаВУ", "purcb_dic_A_IndctCd_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбозначениеСчетаВУ", "purcb_dic_A_N2_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбозначениеРазделаСчетаВУ", "purcb_dic_A_Sctn2_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидОснованияПоступленияИлиВыбытия", "purcb_dic_AA_Bss_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеВидаОснованияПоступленияВыбытия", "purcb_dic_AA_BssOthr_dimGrp_1_periodGrp_1");
	Список.Добавить("КоличествоСделок", "purcb_dic_AA_AsstNttng_dimGrp_1_periodGrp_1");
	Список.Добавить("НомераСделокВНеттинге", "purcb_dic_T_IdTrdOrgNttng_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидАктива", "purcb_dic_Asst_Tp_dimGrp_1_periodGrp_1");
	Список.Добавить("ВалютаАктива", "purcb_dic_Asst_CrncEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаПоступленияВыбытияАктива", "purcb_dic_AA_Dt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВремяПоступленияВыбытияАктива", "purcb_dic_AA_Tm_dimGrp_1_periodGrp_1");
	Список.Добавить("ПриходнаяРасходнаяЗаписьПоСчетуВУ", "purcb_dic_AA_RcptOrDspsl_dimGrp_1_periodGrp_1");
	Список.Добавить("КатегорияОперацииПоступленияВыбытияАктива", "purcb_dic_AA_Ctgrs_dimGrp_1_periodGrp_1");
	Список.Добавить("ТипОперацииПоступленияВыбытияАктива", "purcb_dic_AA_OprtnTp_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеОперацииПоступленияВыбытияАктива", "purcb_dic_AA_OprtnPrps_dimGrp_1_periodGrp_1");
	Список.Добавить("ЕдИзмеренияАктива", "purcb_dic_MsrUntEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("ВходящийОстатокАктива", "purcb_dic_AA_BlncIn_dimGrp_1_periodGrp_1");
	Список.Добавить("КоличествоПоступленияВыбытияАктива", "purcb_dic_AA_Qntt_dimGrp_1_periodGrp_1");
	Список.Добавить("ИсходящийОстатокАктива", "purcb_dic_AA_BlncOut_dimGrp_1_periodGrp_1");
	Список.Добавить("ПлановыйИсходящийОстатокАктива", "purcb_dic_AA_BlncPln_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбозначенияВидовДополнительныхДанных", "purcb_dic_PrInfPokazatel_dimGrp_1_periodGrp_1");
	Список.Добавить("ЗначенияДополнительныхДанных", "purcb_dic_PrInfDannye_dimGrp_1_periodGrp_1");
	Возврат Список;
	
КонецФункции

&НаСервере
Функция СписокПредставленийРаздел6() 
	
	Список = Новый СписокЗначений;
	Список.Добавить("НомерСтроки", "_string_num");
	Список.Добавить("КодКлиента", "dim_int_C_CdTaxis");
	Список.Добавить("КодДоговора", "dim_int_Cntrct_CdTaxis");
	Список.Добавить("КодПортфеля", "dim_int_A_PrtflCdTaxis");
	Список.Добавить("НомерСделки", "dim_int_T_IdTaxis");
	Список.Добавить("НомерЭтапаСделки", "dim_int_T_IdTrdTaxis");
	Список.Добавить("НомерСчетаВУ", "dim_int_A_NTaxis");
	Список.Добавить("НомерРазделаСчетаВУ", "dim_int_A_SctnTaxis");
	Список.Добавить("КодАктива", "dim_int_Asst_IdTaxis");
	Список.Добавить("ИдентификаторСтроки", "dim_int_ID_strokiTaxis");
	Список.Добавить("ДатаВнесенияЗаписиВУ", "purcb_dic_R_Dt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВремяВнесенияЗаписиВУ", "purcb_dic_R_Tm_dimGrp_1_periodGrp_1");
	Список.Добавить("ЧасовойПояс", "purcb_dic_R_TmZn_dimGrp_1_periodGrp_1");
	Список.Добавить("СпособВнесенияЗаписиВУ", "purcb_dic_R_Mthd_dimGrp_1_periodGrp_1");
	Список.Добавить("ФИОРаботникаИлиСистемы", "purcb_dic_R_WrkrId_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеДокументаОснования", "purcb_dic_R_DcmNm_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаДокументаОснования", "purcb_dic_R_DcmDt_dimGrp_1_periodGrp_1");
	Список.Добавить("НомерДокументаОснования", "purcb_dic_R_DcmN_dimGrp_1_periodGrp_1");
	Список.Добавить("СтатусОбязательства", "purcb_dic_R_Grnd_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаАктаОРасхождениях", "purcb_dic_R_VrfDt_dimGrp_1_periodGrp_1");
	Список.Добавить("КодНазначенияСчетаВУ", "purcb_dic_A_IndctCd_dimGrp_1_periodGrp_1");
	Список.Добавить("ОснованиеВозникновенияОбязательстваПоступленияВыбытия", "purcb_dic_AO_Bss_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеИногоВидаОснованияВозникновенияОбязательстваПоступленияВыбытияАктива", "purcb_dic_AO_BssOthr_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидАктива", "purcb_dic_Asst_Tp_dimGrp_1_periodGrp_1");
	Список.Добавить("ВалютаАктива", "purcb_dic_Asst_CrncEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаВозникновенияОбязательства", "purcb_dic_AO_Dt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВремяВозникновенияОбязательства", "purcb_dic_AO_Tm_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаОжидаемогоСовершенияОперацииПоступленияВыбытияАктива", "purcb_dic_AO_PlnDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВремяОжидаемогоСовершенияОперацииПоступленияВыбытияАктива", "purcb_dic_AO_PlnTm_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаФактПрекращенияПродажи", "purcb_dic_AO_FctDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВремяФактПрекращенияПродажи", "purcb_dic_AO_FctTm_dimGrp_1_periodGrp_1");
	Список.Добавить("ПриходнаяРасходнаяЗаписьПоСчетуВУ", "purcb_dic_AO_RcptOrDspsl_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеОперацииОжидаемогоПоступленияВыбытияАктива", "purcb_dic_AO_OprtnPrps_dimGrp_1_periodGrp_1");
	Список.Добавить("ЕдИзмеренияАктива", "purcb_dic_MsrUntEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("ВходящиеОбязательстваПоАктиву", "purcb_dic_AO_BlncIn_dimGrp_1_periodGrp_1");
	Список.Добавить("ОжидаемоеРеальноеКоличествоПоступленияВыбытияАктива", "purcb_dic_AO_Qntt_dimGrp_1_periodGrp_1");
	Список.Добавить("ИсходящиеОбязательстваПоАктиву", "purcb_dic_AO_BlncOut_dimGrp_1_periodGrp_1");
	Список.Добавить("МестоУчетаОбязательства", "purcb_dic_AO_Clrng_dimGrp_1_periodGrp_1");
	Список.Добавить("КлиринговыйРегистрУчетаОбязательства", "purcb_dic_AO_ClrngRgstr_dimGrp_1_periodGrp_1");
	Список.Добавить("КодРазделаКлиринговогоРегистраУчетаОбязательства", "purcb_dic_AO_ClrngRgstrSctn_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбозначенияВидовДополнительныхДанных", "purcb_dic_PrInfPokazatel_dimGrp_1_periodGrp_1");
	Список.Добавить("ЗначенияДополнительныхДанных", "purcb_dic_PrInfDannye_dimGrp_1_periodGrp_1");
	Возврат Список;
	
КонецФункции

&НаСервере
Функция СписокПредставленийРаздел7()
	
	Список = Новый СписокЗначений;
	Список.Добавить("НомерСтроки", "_string_num");
	Список.Добавить("КодКлиента", "dim_int_C_CdTaxis");
	Список.Добавить("КодДоговора", "dim_int_Cntrct_CdTaxis");
	Список.Добавить("КодПортфеля", "dim_int_A_PrtflCdTaxis");
	Список.Добавить("НомерСчетаВУ", "dim_int_A_NTaxis");
	Список.Добавить("НомерРазделаСчетаВУ", "dim_int_A_SctnTaxis");
	Список.Добавить("КодАктива", "dim_int_Asst_IdTaxis");
	Список.Добавить("ДатаОпределенияОстаткаАктива", "dim_int_ALF_ClntAmnt_DtTaxis");
	Список.Добавить("ДатаАктаОРасхождениях", "purcb_dic_R_VrfDt_dimGrp_1_periodGrp_1");
	Список.Добавить("КодНазначенияСчетаВУ", "purcb_dic_A_IndctCd_dimGrp_1_periodGrp_1");
	Список.Добавить("НомерСчетаВУОперацийСАктивом", "purcb_dic_A_N2_dimGrp_1_periodGrp_1");
	Список.Добавить("НомерРазделаСчетаВУОперацийСАктивом", "purcb_dic_A_Sctn2_dimGrp_1_periodGrp_1");
	Список.Добавить("ВалютаАктива", "purcb_dic_Asst_CrncEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("ЕдИзмеренияАктива", "purcb_dic_MsrUntEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("ОстатокАктиваПоДокументуОснования", "purcb_dic_ALF_OrgAmnt_dimGrp_1_periodGrp_1");
	Список.Добавить("ИсходящийОстаток", "purcb_dic_ALF_ClntAmnt_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбозначенияВидовДополнительныхДанных", "purcb_dic_PrInfPokazatel_dimGrp_1_periodGrp_1");
	Список.Добавить("ЗначенияДополнительныхДанных", "purcb_dic_PrInfDannye_dimGrp_1_periodGrp_1");
	Возврат Список;
	
КонецФункции

&НаСервере
Функция СписокПредставленийРаздел8()
	
	Список = Новый СписокЗначений;
	Список.Добавить("НомерСтроки", "_string_num");
	Список.Добавить("НомерСчетаВУ", "dim_int_A_NTaxis");
	Список.Добавить("НомерРазделаСчетаВУ", "dim_int_A_SctnTaxis");
	Список.Добавить("КодАктива", "dim_int_Asst_IdTaxis");
	Список.Добавить("ДатаОпределенияСуммыИспользованныхДС", "dim_int_AmntF_DtTaxis");
	Список.Добавить("ДатаАктаОРасхождениях", "purcb_dic_R_VrfDt_dimGrp_1_periodGrp_1");
	Список.Добавить("КодНазначенияСчетаВУ", "purcb_dic_A_IndctCd_dimGrp_1_periodGrp_1");
	Список.Добавить("ВалютаАктива", "purcb_dic_Asst_CrncEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("СуммаИспользованныхДенежныхСредств", "purcb_dic_ALFU_Amnt_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбозначенияВидовДополнительныхДанных", "purcb_dic_PrInfPokazatel_dimGrp_1_periodGrp_1");
	Список.Добавить("ЗначенияДополнительныхДанных", "purcb_dic_PrInfDannye_dimGrp_1_periodGrp_1");
	Возврат Список;
	
КонецФункции

&НаСервере
Функция СписокПредставленийРаздел9()
	
	Список = Новый СписокЗначений;
	Список.Добавить("НомерСтроки", "_string_num");
	Список.Добавить("КодКлиента", "dim_int_C_CdTaxis");
	Список.Добавить("КодДоговора", "dim_int_Cntrct_CdTaxis");
	Список.Добавить("КодПортфеля", "dim_int_A_PrtflCdTaxis");
	Список.Добавить("КодАктива", "dim_int_Asst_IdTaxis");
	Список.Добавить("ДатаНачалаОпределенияПозицииКлиента", "dim_int_AA_PrdBgnTaxis");
	Список.Добавить("ДатаОкончанияОпределенияПозицииКлиента", "dim_int_AA_PrdEndTaxis");
	Список.Добавить("ЕдИзмеренияАктива", "purcb_dic_MsrUntEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("ВходящийОстатокАктива", "purcb_dic_AA_BlncIn_dimGrp_1_periodGrp_1");
	Список.Добавить("ВходящиеОбязательстваПоАктиву", "purcb_dic_AO_BlncIn_dimGrp_1_periodGrp_1");
	Список.Добавить("ВходящаяПлановаяПозицияПоАктиву", "purcb_dic_A_BlncInPstn_dimGrp_1_periodGrp_1");
	Список.Добавить("ВходящаяПлановаяПозицияПоАктивуВРублевомЭквиваленте", "purcb_dic_A_BlncInPstnR_dimGrp_1_periodGrp_1");
	Список.Добавить("КурсНаДатуНачалаОпределенияПозиции", "purcb_dic_A_ExchgRtInPstn_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеОрганизатораТорговлиНаДатуНачала", "purcb_dic_A_OrgNmIn_dimGrp_1_periodGrp_1");
	Список.Добавить("ИтоговоеКоличествоПоступленияАктива", "purcb_dic_AA_QnttRcpt_dimGrp_1_periodGrp_1");
	Список.Добавить("ИтоговоеОжидаемоеРеальноеКоличествоПоступленияАктива", "purcb_dic_AO_QnttRcpt_dimGrp_1_periodGrp_1");
	Список.Добавить("ИтоговоеКоличествоВыбытияАктива", "purcb_dic_AA_QnttDspsl_dimGrp_1_periodGrp_1");
	Список.Добавить("ИтоговоеОжидаемоеРеальноеКоличествоВыбытияАктива", "purcb_dic_AO_QnttDspsl_dimGrp_1_periodGrp_1");
	Список.Добавить("ИсходящийОстатокАктива", "purcb_dic_AA_BlncOut_dimGrp_1_periodGrp_1");
	Список.Добавить("ИсходящиеОбязательстваПоАктиву", "purcb_dic_AO_BlncOut_dimGrp_1_periodGrp_1");
	Список.Добавить("ИсходящаяПлановаяПозицияПоАктиву", "purcb_dic_A_BlncOutPstn_dimGrp_1_periodGrp_1");
	Список.Добавить("ИсходящаяПлановаяПозицияПоАктивуВРублевомЭквиваленте", "purcb_dic_A_BlncOutPstnR_dimGrp_1_periodGrp_1");
	Список.Добавить("КурсНаДатуОкончанияОпределенияПозиции", "purcb_dic_A_ExchgRtOutPstn_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеОрганизатораТорговлиНаДатуОкончания", "purcb_dic_A_OrgNmOut_dimGrp_1_periodGrp_1");
	Список.Добавить("КоличествоЗаблокированногоАктива", "purcb_dic_AA_BlncOutBlk_dimGrp_1_periodGrp_1");
	Список.Добавить("КоличествоАктиваВГарантийномОбеспечении", "purcb_dic_AA_BlncOutGrnt_dimGrp_1_periodGrp_1");
	Список.Добавить("ИтоговаяЗадолженностьКлиентаПоАктиву", "purcb_dic_AA_BlncOutDbt_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбъемОбязательствКлиентаПоВозвратуАктиваПредоставленногоВЗаем", "purcb_dic_AA_BlncOutDbtMrgn_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбозначенияВидовДополнительныхДанных", "purcb_dic_PrInfPokazatel_dimGrp_1_periodGrp_1");
	Список.Добавить("ЗначенияДополнительныхДанных", "purcb_dic_PrInfDannye_dimGrp_1_periodGrp_1");
	Возврат Список;
	
КонецФункции

&НаСервере
Функция СписокПредставленийРаздел10()
	
	Список = Новый СписокЗначений;
	Список.Добавить("НомерСтроки", "_string_num");
	Список.Добавить("КодАктива", "dim_int_Asst_IdTaxis");
	Список.Добавить("ВидАктива", "purcb_dic_Asst_Tp_dimGrp_1_periodGrp_1");
	Список.Добавить("ЕдИзмеренияАктива", "purcb_dic_MsrUntEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеАктива", "purcb_dic_Asst_Nm_dimGrp_1_periodGrp_1");
	Список.Добавить("МеждународныйКодИдентификацииЦБ", "purcb_dic_Asst_ISIN_dimGrp_1_periodGrp_1");
	Список.Добавить("МеждународныйКодКлассификацииФИ", "purcb_dic_Asst_CFI_dimGrp_1_periodGrp_1");
	Список.Добавить("ИнформацияПредназначенЛиАктивТолькоДляКвалИнвесторов", "purcb_dic_Asst_QlfdInvstr_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаПроведенияОценкиПредназначенЛиАктивТолькоДляКвалИнвесторов", "purcb_dic_Asst_QlfdDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ТипЦеннойБумаги", "purcb_dic_Asst_ScrtTpEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("РегистрационныйНомерВыпуска", "purcb_dic_Scrt_RgNmb_dimGrp_1_periodGrp_1");
	Список.Добавить("СерияСертификатаВекселя", "purcb_dic_Asst_ScrtBS_dimGrp_1_periodGrp_1");
	Список.Добавить("НомерСертификатаВекселя", "purcb_dic_Asst_ScrtBN_dimGrp_1_periodGrp_1");
	Список.Добавить("НомерБланкаВекселя", "purcb_dic_Scrt_BNBl_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаСоставленияВекселя", "purcb_dic_Scrt_BBgnDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ЦБВнутренняИлиВнешняя", "purcb_dic_Scrt_InOut_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеЭмитента", "purcb_dic_Scrt_IssrNm_dimGrp_1_periodGrp_1");
	Список.Добавить("СтранаЭмитента", "purcb_dic_Scrt_IssrCntrEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("ИННЭмитента", "purcb_dic_Scrt_IssrINN_dimGrp_1_periodGrp_1");
	Список.Добавить("УсловиеПогашенияЦБ", "purcb_dic_Scrt_Rpmnt_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаНачалаПогашенияЦБ", "purcb_dic_Scrt_RpmntBgnDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаОкончанияПогашенияЦБ", "purcb_dic_Scrt_RpmntEndDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ВалютаЦБ", "purcb_dic_Scrt_NmnlCrncEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("НоминальнаяСтоимостьЦБ", "purcb_dic_Scrt_NmnlPrc_dimGrp_1_periodGrp_1");
	Список.Добавить("ВалютаБазовая", "purcb_dic_Crnc_IdEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("КотируемаяВалюта", "purcb_dic_Crnc_Id2Enumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеОрганизацииРассчитывающейЗначениеПоказателя", "purcb_dic_PI_OrgNm_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидПФИ", "purcb_dic_DFI_Tp_dimGrp_1_periodGrp_1");
	Список.Добавить("КатегорияОпционаПоСрокуИсполнения", "purcb_dic_DFI_OCtgr_dimGrp_1_periodGrp_1");
	Список.Добавить("РазновидностьСВОП", "purcb_dic_DFI_STp_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеИногоПФИ", "purcb_dic_DFI_TpOthr_dimGrp_1_periodGrp_1");
	Список.Добавить("НаправлениеПФИ", "purcb_dic_DFI_Rslt_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеИногоРезультатаПФИ", "purcb_dic_DFI_RsltOthr_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидПлатежногоУсловияПФИ", "purcb_dic_DFI_PmntTrms_dimGrp_1_periodGrp_1");
	Список.Добавить("ИнформацияОРасчетеВариационнойМаржиПФИ", "purcb_dic_DFI_VrtnMrgn_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаЗаключенияВнебиржевогоПФИ", "purcb_dic_DFI_BgnDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаЗакрытияВнебиржевогоПФИ", "purcb_dic_DFI_ExcDt_dimGrp_1_periodGrp_1");
	Список.Добавить("ОписаниеСущественныхХарактеристикИногоАктива", "purcb_dic_AsstOthr_Dscr_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидСтруктурногоПродуктаИлиПризнакБазовогоАктиваПФИ", "purcb_dic_SA_Tp_dimGrp_1_periodGrp_1");
	Список.Добавить("КодСтруктурногоПродукта", "purcb_dic_SA_Id_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеОрганизацииУправляющейКорзинойАктивов", "purcb_dic_SA_OrgNm_dimGrp_1_periodGrp_1");
	Список.Добавить("СтранаОрганизацииУправляющейКорзинойАктивов", "purcb_dic_SA_OrgCntrEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("ИННОрганизацииУправляющейКорзинойАктивов", "purcb_dic_SA_OrgINN_dimGrp_1_periodGrp_1");
	Список.Добавить("КоличествоАктивовВСоставеСтруктурногоПродукта", "purcb_dic_SA_AsstN_dimGrp_1_periodGrp_1");
	Список.Добавить("ИдентификаторыАктивовСтруктурногоПродукта", "purcb_dic_SA_AsstId_dimGrp_1_periodGrp_1");
	Список.Добавить("КодБазовогоАктива", "purcb_dic_AsstNxt_Id_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидБазовогоАктива", "purcb_dic_AsstNxt_Tp_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидПФИВыступающегоВКачествеБазовогоАктива", "purcb_dic_AsstNxt_DFITp_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеБазовогоАктива", "purcb_dic_AsstNxt_Nm_dimGrp_1_periodGrp_1");
	Список.Добавить("КоличествоБазовогоАктива", "purcb_dic_AsstNxt_LtSz_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбозначенияВидовДополнительныхДанных", "purcb_dic_PrInfPokazatel_dimGrp_1_periodGrp_1");
	Список.Добавить("ЗначенияДополнительныхДанных", "purcb_dic_PrInfDannye_dimGrp_1_periodGrp_1");
	Возврат Список;
	
КонецФункции

&НаСервере
Функция СписокПредставленийРаздел11()
	
	Список = Новый СписокЗначений;
	Список.Добавить("НомерСтроки", "_string_num"); 
	Список.Добавить("КодКлиента", "dim_int_C_CdTaxis"); 
	Список.Добавить("НаименованиеКлиента", "purcb_dic_C_Nm_dimGrp_1_periodGrp_1");
	Список.Добавить("ТипКлиента", "purcb_dic_SP_FTp_dimGrp_1_periodGrp_1");
	Список.Добавить("КатегорияКлиентаКакКвалифицированногоИнвестора", "purcb_dic_CQlfdInvstr_dimGrp_1_periodGrp_1");
	Список.Добавить("ПризнакГражданства", "purcb_dic_SP_Rsd_dimGrp_1_periodGrp_1");
	Список.Добавить("СтранаГражданства", "purcb_dic_SP_CntrEnumerator_dimGrp_1_periodGrp_1");
	Список.Добавить("НалоговоеРезидентствоРФ", "purcb_dic_SP_NalogRez_dimGrp_1_periodGrp_1");
	Список.Добавить("ИНН", "purcb_dic_SP_INN_dimGrp_1_periodGrp_1");
	Список.Добавить("ВидДокументаУдостоверяющегоЛичность", "purcb_dic_SP_DcmTp_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеВидаДокументаУдостоверяющегоЛичность", "purcb_dic_SP_DcmTpOthr_dimGrp_1_periodGrp_1");
	Список.Добавить("СерияДокументаУдостоверяющегоЛичность", "purcb_dic_SP_DcmSrs_dimGrp_1_periodGrp_1");
	Список.Добавить("НомерДокументаУдостоверяющегоЛичность", "purcb_dic_SP_DcmN_dimGrp_1_periodGrp_1");
	Список.Добавить("ДатаВыдачиДокументаУдостоверяющегоЛичность", "purcb_dic_SP_DcmDt_dimGrp_1_periodGrp_1");
	Список.Добавить("НаименованиеОрганаВыдавшегоДокументУдостоверяющийЛичность", "purcb_dic_SP_DcmEntNm_dimGrp_1_periodGrp_1");
	Список.Добавить("КодПодразделенияВыдавшегоДокументУдостоверяющийЛичность", "purcb_dic_SP_DcmUntCd_dimGrp_1_periodGrp_1");
	Список.Добавить("ОбозначенияВидовДополнительныхДанных", "purcb_dic_PrInfPokazatel_dimGrp_1_periodGrp_1");
	Список.Добавить("ЗначенияДополнительныхДанных", "purcb_dic_PrInfDannye_dimGrp_1_periodGrp_1");
	Возврат Список;
КонецФункции

#КонецОбласти

