
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если СтрНайти(ВРег(СтрокаСоединенияИнформационнойБазы()),"PROD")=0 Тогда
		Элементы.ТестовыйРежим.Видимость = Истина
	Иначе
		Элементы.ТестовыйРежим.Видимость = Ложь
	КонецЕсли;
	
	ОбрабоктаОбъект = РеквизитФормыВЗначение("Объект");
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + ОбрабоктаОбъект.СведенияОВнешнейОбработке().Версия;
	
	ДопОбработкаСсылка = "";
	Если Параметры.Свойство("ДополнительнаяОбработкаСсылка", ДопОбработкаСсылка) Тогда
		ОбрабоктаОбъект.УстановитьНастройкиИзДопОбработки(ДопОбработкаСсылка);
	КонецЕсли;
	ЗначениеВРеквизитФормы(ОбрабоктаОбъект,"Объект");
	
	//Объект.ТестовыйРежим = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрочитатьОбъекты(Команда)
	
	Если Объект.ОтборПоПулу > 0 Тогда
		Если Не ЗначениеЗаполнено(Объект.Пул) Тогда
			ПоказатьПредупреждение(, "Не выбран пул. Загрузка прервана.");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПрочитатьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСделки(Команда)
	
	СоздатьСделкиНаСервере();
	
	//Объект.Лог.ТолькоПросмотр = Истина;
	//Объект.Лог.Показать();
	ПолучитьТабДокумент().Показать();  // ИКФ
КонецПроцедуры // СоздатьСделки()

&НаКлиенте
Процедура ПересчитатьКомиссиюБрокера(Команда)
	
	ПересчитатьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКомиссиюБрокераВалютныеСделки(Команда)
	ПересчитатьКомиссиюБрокераВалютныеСделкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьСделкиРЕПО(Команда)
	ПрочитатьСделкиРЕПОНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПартнера(Команда)
	
	ОбновитьПартнераНаСервере();
	
	ПолучитьТабДокумент().Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьСделки(Команда)
	
	СгенерироватьСделкиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СсылкаНаСписокОТСНажатие(Элемент)
	
	ФормаОТС = ПолучитьФорму("ВнешняяОбработка.ЗагрузкаСделок.Форма.ФормаОТС");
	ФормаОТС.Открыть();
	ФормаОТС.Объект.ДатаНачала = Объект.ДатаНачала;
	ФормаОТС.Объект.ДатаОкончания = Объект.ДатаОкончания;
	// MPazhukov для тестирования
	//ФормаОТС.Объект.ТестовыйРежим = Объект.ТестовыйРежим;	
	ФормаОТС.ОбновитьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьНаСервере(Отказ = Ложь)
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	//IMAPPS-15318++
	Если РежимОтбораОТС = 1 Тогда
		Объект.ОтборOTC = "OnlyOTC";
	ИначеЕсли РежимОтбораОТС = 2 Тогда
		Объект.ОтборOTC = "ExceptOTC";
	Иначе
		Объект.ОтборOTC = "";
	КонецЕсли;
	//IMAPPS-15318--
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ЗагрузитьОбъекты(Отказ);
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	
	ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ПрошлоВремени = ВремяОкончания - ВремяНачала;
	
	ПрошлоВремениСек = ПрошлоВремени/1000;
	
	Часов = Цел(ПрошлоВремениСек/3600);
	Минут = Цел((ПрошлоВремениСек-Часов*3600)/60);
	Секунд = ПрошлоВремениСек - Часов*3600 - Минут*60;
	Сообщить("Чтение выполнялось - " + Часов + ":" + Минут + ":" + Секунд);
	
	Если Отказ Тогда
		Сообщить("Во время загрузки произошли ошибки", СтатусСообщения.Важное);
	Иначе
		Сообщить("Чтение успешно завершено", СтатусСообщения.Информация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТабДокумент()
	Перем ТабДок;
	
	ТабДок = Новый ТабличныйДокумент();
	ТабДок.Вывести(Объект.Лог);
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции // ПолучитьТабДокумент()

&НаСервере
Процедура СоздатьСделкиНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.СоздатьОбъекты(Ложь);
	
	// IMDEV-7091 +++
	Если ЗначениеЗаполнено(ТекОбъект.ТекстОшибкиНеНайденКонтрагент) Тогда
		
		Сообщить(ТекОбъект.ТекстОшибкиНеНайденКонтрагент);
		
		Если ТекОбъект.СписокРассылкиНеНайденКонтрагент.Количество() = 0 И ТекОбъект.ПочтовыйЛогин.Пустая() Тогда
			НаименованиеОбработки = ТекОбъект.СведенияОВнешнейОбработке().Наименование;
			ДопОбработка = НайтиДопОбработкуПоНаименованию(НаименованиеОбработки);
			
			Если ЗначениеЗаполнено(ДопОбработка) Тогда
				Настройки = ДопОбработка.ХранилищеНастроек.Получить();
				Если Настройки.Свойство("Значения") Тогда
					Если Настройки.Значения.Свойство("СписокРассылкиНеНайденКонтрагент") Тогда
						Ящики = XMLЗначение(Тип("ХранилищеЗначения"), Настройки.Значения.СписокРассылкиНеНайденКонтрагент);
						ТекОбъект.СписокРассылкиНеНайденКонтрагент.Загрузить(Ящики.Получить());
					КонецЕсли;
					Почта = Неопределено;
					Если Настройки.Значения.Свойство("ПочтовыйЛогин", Почта) тогда
						ТекОбъект.ПочтовыйЛогин = Почта;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекОбъект.СписокРассылкиНеНайденКонтрагент.Количество() > 0 И Не ТекОбъект.ПочтовыйЛогин.Пустая() Тогда
			
			ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, Вложения, Важность");
			ПараметрыПисьма.Тема = "{FAIL} " + "Аванкор ДУ: Загрузка сделок в ручном режиме за период с " + Формат(ТекОбъект.ДатаНачала, "ДФ=dd.MM.yyyy")
				+ " по " + Формат(ТекОбъект.ДатаОкончания, "ДФ=dd.MM.yyyy") + " - не найден партнер" + ТекОбъект.ПропискаРассылки("r4.1");
			ПараметрыПисьма.Важность = ВажностьИнтернетПочтовогоСообщения.Высокая;
			
			Кому = Новый Массив;
			Для каждого ТекЯщик из ТекОбъект.СписокРассылкиНеНайденКонтрагент Цикл
				Кому.Добавить(Новый Структура("Адрес,Представление", ТекЯщик.ПочтовыйЯщик, ТекЯщик.Представление));
			КонецЦикла;
			
			ПараметрыПисьма.Кому = Кому;
			
			Вложения = Новый Соответствие;
			ПараметрыПисьма.Вложения = Вложения;
			
			ПараметрыПисьма.Тело = ТекОбъект.ТекстОшибкиНеНайденКонтрагент;
			
			Попытка
				РаботаСПочтовымиСообщениями.ОтправитьСообщение(ТекОбъект.ПочтовыйЛогин, ПараметрыПисьма);
				текстРассылки = "Рассылка завершена";
			Исключение
				текстРассылки = "Рассылка не удалась: "; 
				Сообщения = ПолучитьСообщенияПользователю(Истина);
				Для Каждого Элемент из Сообщения Цикл
					текстРассылки = текстРассылки + Символы.ПС + Элемент.Текст;
				Конеццикла;
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;
	// IMDEV-7091 ---
	
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ОбновитьКомиссиюБрокера();
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьКомиссиюБрокераВалютныеСделкиНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ОбновитьКомиссиюБрокераВалютныеСделки();
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСделкиРЕПОНаСервере(Отказ = Ложь)
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ПрочитатьСделкиРЕПО(Отказ);
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	
	ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ПрошлоВремени = ВремяОкончания - ВремяНачала;
	
	ПрошлоВремениСек = ПрошлоВремени / 1000;
	
	Часов = Цел(ПрошлоВремениСек / 3600);
	Минут = Цел((ПрошлоВремениСек - Часов * 3600) / 60);
	Секунд = ПрошлоВремениСек - Часов * 3600 - Минут * 60;
	Сообщить("Чтение выполнялось - " + Часов + ":" + Минут + ":" + Секунд);
	
	Если Отказ Тогда
		Сообщить("Во время загрузки произошли ошибки", СтатусСообщения.Важное);
	Иначе
		Сообщить("Чтение успешно завершено", СтатусСообщения.Информация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПартнераНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ОбновитьПартнера(Ложь);
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
КонецПроцедуры

&НаСервере
Процедура СгенерироватьСделкиНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		ВызватьИсключение "Не заполнена дата начала";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		ВызватьИсключение "Не заполнена дата окончания";
	КонецЕсли;
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	/////////////////////////////////////////////////////////////////////////////////////////////
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаСделок = ТекОбъект.ТаблицаСделокГенерация(Объект.ДатаНачала, Объект.ДатаОкончания);
	ТекОбъект.ПрочитатьНаСервере(ТаблицаСделок, Ложь);
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	/////////////////////////////////////////////////////////////////////////////////////////////
	ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ПрошлоВремени = ВремяОкончания - ВремяНачала;
	ПрошлоВремениСек = ПрошлоВремени / 1000;
	Часов = Цел(ПрошлоВремениСек / 3600);
	Минут = Цел((ПрошлоВремениСек - Часов * 3600) / 60);
	Секунд = ПрошлоВремениСек - Часов * 3600 - Минут * 60;
	Сообщить("Генерация входных данных выполнялось - " + Часов + ":" + Минут + ":" + Секунд);
	
КонецПроцедуры

&НаСервере
Функция НайтиДопОбработкуПоНаименованию(Наименование)
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Возврат Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|ГДЕ
		|	ДополнительныеОтчетыИОбработки.Наименование = &Наименование
		|	И НЕ ДополнительныеОтчетыИОбработки.ЭтоГруппа
		|	И НЕ ДополнительныеОтчетыИОбработки.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти