
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Данный документ вводится только на основании поручения!!!", Отказ);
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(Объект.СчетДепо) И Объект.СчетДепо.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.Закрыт Тогда 
		ТолькоПросмотр	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры