////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС

Процедура ИнициироватьСоединение(Параметры = Неопределено) Экспорт
	Если ТипЗнч(Параметры) = Тип("Строка") Тогда
		Файлы = ЗначениеИзСтрокиВнутр(Параметры);
		Для Каждого Элемент Из Файлы Цикл
			НоваяСтрока = ФайлыНРД.Добавить();
			НоваяСтрока.ИмяФайла = Элемент;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

////#Область Тестовые методы

Функция ВременныеФайлыНРД(ПараметрНеИспользуется) Экспорт
	Файлы = Новый Массив;
	Для Каждого Строка Из ФайлыНРД Цикл
		Макет = ПолучитьМакет(Строка.ИмяФайла);
		ПутьКВременномуФайлу = КаталогВременныхФайлов();
		ПолноеИмяФайла = ПутьКВременномуФайлу + Строка.ИмяФайла;
		Макет.Записать(ПолноеИмяФайла, "windows-1251");
		Файлы.Добавить(ПолноеИмяФайла);
	КонецЦикла;
	Возврат Файлы;
КонецФункции

////#КонецОбласти Тестовые методы

////#Область Вспомогательные методы

Функция ДоступныеМакетыФайловНРД() Экспорт
	Макеты = Новый Массив;
	Для Каждого Макет Из Метаданные().Макеты Цикл
		Если Макет.Имя <> "ФорматИменМакетовСПримерамиФайловНРД" Тогда
			Макеты.Добавить(Макет.Имя);
		КонецЕсли;
	КонецЦикла;
	Возврат Макеты;
КонецФункции

////#КонецОбласти Вспомогательные методы

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
