// IMDEV-8899 этап2 п.5+1: коллизия номера документа РасчетСЧА_РСА при параллельной записи

&ИзменениеИКонтроль("Операция_1000_РасчетРСА_СЧА")
Процедура rev2_Операция_1000_РасчетРСА_СЧА(ЗакрытиеПериода, Дата, ДоговорДУ, СписокОпераций, Отказ, ТекстОтказа) Экспорт
	
	//TM-733+
	ДокументРасчетСЧА_РСА = ПолучитьПодчиненныйДокумент("РасчетСЧА_РСА", ЗакрытиеПериода);
	
	ДокументРасчетСЧА_РСА.Дата 					= ПолучитьДатуСВременемОкончанияРабочегоДня(Дата,12);
	ДокументРасчетСЧА_РСА.ДоговорДУ 			= ДоговорДУ;
	ДокументРасчетСЧА_РСА.ДокументОснование 	= ЗакрытиеПериода;
	//ДокументРасчетСЧА_РСА.Комментарий 		= "Регламентная операция";
	
	//Определеяем виды учета
	ДокументРасчетСЧА_РСА.РСА = СписокОпераций.Найти(Справочники.ВидыОперацийЗакрытияПериода.РасчетРСА_БУ) <> Неопределено;
	ДокументРасчетСЧА_РСА.СЧА = СписокОпераций.Найти(Справочники.ВидыОперацийЗакрытияПериода.РасчетСЧА_БУ) <> Неопределено;
	
	ДокументРасчетСЧА_РСА.ПолучитьСуммыРСАСЧА(Отказ, ТекстОтказа);
	
	// TM-3363 {
	ИспользоватьТолькоАктуальныеКурсыВалют = ОбщегоНазначенияДУПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьТолькоАктуальныеКурсыВалют");
	Если ИспользоватьТолькоАктуальныеКурсыВалют И Отказ Тогда
		#Удаление
		ДокументРасчетСЧА_РСА.Записать(РежимЗаписиДокумента.Запись);
		#КонецУдаления
		#Вставка
		// IMDEV-8899 этап2 п.5+1
		Документы.РасчетСЧА_РСА.ЗаписатьСОбработкойКоллизииНомера(ДокументРасчетСЧА_РСА, РежимЗаписиДокумента.Запись);
		#КонецВставки
		Возврат;
	КонецЕсли;
	// TM-3363 }
	
	#Удаление
	Попытка
		ДокументРасчетСЧА_РСА.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ДокументРасчетСЧА_РСА.Записать(РежимЗаписиДокумента.Запись);
		Отказ = Истина;
		ТекстОтказа = "Не удалось провести документ " + Строка(ДокументРасчетСЧА_РСА);
	КонецПопытки;
	#КонецУдаления
	#Вставка
	// IMDEV-8899 этап2 п.5+1
	Попытка
		Документы.РасчетСЧА_РСА.ЗаписатьСОбработкойКоллизииНомера(ДокументРасчетСЧА_РСА, РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстОшибкиПроведения = ОписаниеОшибки();
		Документы.РасчетСЧА_РСА.ЗаписатьСОбработкойКоллизииНомера(ДокументРасчетСЧА_РСА, РежимЗаписиДокумента.Запись);
		Отказ = Истина;
		ТекстОтказа = "Не удалось провести документ " + Строка(ДокументРасчетСЧА_РСА) + ". " + ТекстОшибкиПроведения;
	КонецПопытки;
	#КонецВставки
	//TM-733+
	
КонецПроцедуры
