Функция КодАльфа2ПоНазваниюСтраны(Страна) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КлассификаторСтранМира.КодАльфа2 КАК КодАльфа2
	|ИЗ
	|	Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|ГДЕ
	|	КлассификаторСтранМира.Наименование = &Страна");
	
	Запрос.УстановитьПараметр("Страна",Страна);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат "";
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.КодАльфа2;
	
КонецФункции

// Возвращает элемент справочника "Украина"
// 
// Возвращаемое значение:
//  СправочникСсылка.КлассификаторСтранМира
//
Функция Украина() Экспорт
	
	Возврат НайтиПоКоду("804");
	
КонецФункции

// Возвращает элемент справочника "Казахстан"
// 
// Возвращаемое значение:
//  СправочникСсылка.КлассификаторСтранМира
//
Функция Казахстан() Экспорт
	
	Возврат НайтиПоКоду("398");
	
КонецФункции

// Возвращает элемент справочника "Казахстан"
// 
// Возвращаемое значение:
//  СправочникСсылка.КлассификаторСтранМира
//
Функция США() Экспорт
	
	Возврат НайтиПоКоду("840");
	
КонецФункции

// Возвращает элемент справочника СправочникСсылка.КлассификаторСтранМира по двухсимвольному коду страны
// 
// Параметры:
//  КодАльфа - Строка - КодАльфа2 справочника КлассификаторСтранМира
//
// Возвращаемое значение:
//  СправочникСсылка.КлассификаторСтранМира
//
Функция СтранаПоКодуАльфа2(КодАльфа) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторСтранМира.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|ГДЕ
	|	КлассификаторСтранМира.КодАльфа2 = &КодАльфа2";
	Запрос.УстановитьПараметр("КодАльфа2", КодАльфа);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Возвращает страну эмитента
//
// Параметры:
//  Эмитент	 - СправочникСсылка.Контрагенты	 - Эмитент
// 
// Возвращаемое значение:
//   - СправочникСсылка.КлассификаторСтранМира - Страна
//
Функция СтранаЭмитента(Эмитент) Экспорт
	
	Если Не ЗначениеЗаполнено(Эмитент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	ЮридическоеЛицо = Эмитент.ЮридическиеФизическиеЛица;
	Если ЗначениеЗаполнено(ЮридическоеЛицо) И ТипЗнч(ЮридическоеЛицо) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
		Возврат ЮридическоеЛицо.Страна;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции