
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = Ложь;
	Тестирование = Ложь;
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		ПараметрыВыполненияКоманды.Источник.Параметры.Свойство("Тестирование",Тестирование)
	КонецЕсли;
	
	ДокументыРСВ = Новый Массив();
	ОбработкаКомандыНаСервере(ПараметрКоманды, Отказ, Тестирование, ДокументыРСВ);
	
	Если Отказ Тогда 
		Предупреждение("Не удалось выполнить отправку уведомлений");
	КонецЕсли;
	
	Для Каждого ДокументРСВ Из ДокументыРСВ Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("РСВ", ДокументРСВ);
		ПараметрыФормыЗапросовРСВ = Новый Структура("Отбор", Отбор);
		ОткрытьФорму("Документ.ЗапросСубброкеруНаРаскрытие.ФормаСписка", ПараметрыФормыЗапросовРСВ,, ДокументРСВ);
		Оповестить("Документ.ЗапросСубброкеруНаРаскрытие.Изменен",ДокументРСВ);
	КонецЦикла;      
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаКомандыНаСервере(ПараметрКоманды, Отказ, Тестирование, ДокументыРСВ)
	
	ДокументыРСВ = Новый Массив();
	ДокументыРСВ_БезДокументовЗапросов = Новый Массив();
	Для Каждого Документ Из ПараметрКоманды Цикл 
		Если WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкераДляДокумента(Документ) Тогда 
			ДокументыРСВ.Добавить(Документ);
		Иначе
			ДокументыРСВ_БезДокументовЗапросов.Добавить(Документ);
		КонецЕсли;
	КонецЦикла;
	
	Если ДокументыРСВ.Количество() Тогда 
		СозданныеДокументы = Новый Массив();
		Документы.РаскрытиеСпискаВладельцев.СформироватьЗапросыСубброкеруНаРаскрытие(ПараметрКоманды,СозданныеДокументы);
		Документы.ЗапросСубброкеруНаРаскрытие.ОтправитьЗапросСубброкеруНаРаскрытие(СозданныеДокументы, Отказ, Тестирование);	
	КонецЕсли;
	
	Если ДокументыРСВ_БезДокументовЗапросов.Количество() Тогда 
		Документы.РаскрытиеСпискаВладельцев.ОтправитьЗапросНаРаскрытиеПоСубклиентам(ДокументыРСВ_БезДокументовЗапросов);	
	КонецЕсли;
	
КонецПроцедуры
