#Область ПрограммныйИнтерфейс

// Процедура заполняет данными ТЧ ДанныеПодраздела_1_2, ДанныеПодраздела_1_2_1 и параметр ДанныеДляРасшифровки
// Параметры:
//	ДанныеДляРасшифровки - ТаблицаЗначений - возвращаемый параметр, в котором возвращается таблица значений
//
// BSLLS:MethodSize-off
Процедура ПолучитьДанные(ДанныеДляРасшифровки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	// Важно, что реквизит Резидент в справочнике контрагентов, как это ни парадоксально, означает "Нерезидент по документам"
	// - живите теперь с этим, если не знали раньше
	// Условия типа 1 = 1 в нескольких местах запроса в виртуальных таблицах среза последних - это чтобы Sonar не ругался
	// на виртуальную таблицу без параметров
	"ВЫБРАТЬ
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.МеждународнаяКомпания КАК МеждународнаяКомпания,
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.ЮридическоеЛицо КАК ЮридическоеЛицо,
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.ПризнакРегистрацииМеждународнойКомпании КАК ПризнакРегистрацииМК
	|ПОМЕСТИТЬ ЮридическиеЛицаМеждународныеКомпании
	|ИЗ
	|	РегистрСведений.ЮридическиеЛицаМеждународныеКомпании.СрезПоследних(&ПериодКонец, ИСТИНА) КАК ЮридическиеЛицаМеждународныеКомпанииСрезПоследних
	|ГДЕ
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.МеждународнаяКомпания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБОстатки.ЦБ КАК ЦБ,
	|	ОстаткиЦБОстатки.СчетДепоМХ КАК СчетДепоМХ,
	|	ОстаткиЦБОстатки.СтатусЦБ КАК СтатусЦБ,
	|	ОстаткиЦБОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ОстаткиЦБОстатки.СчетДепо.ТипСчетаДепо В (&ТипыСчетовДепоНоминальногоДержателя) КАК ЭтоСчетДепоНоминальногоДержателя
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(&ПериодКонец, СчетДепо.ПризнакСчетаДепо = ЗНАЧЕНИЕ(Перечисление.ПризнакиСчетаДепо.СчетДепонента)) КАК ОстаткиЦБОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОбороты.ЦБ КАК ЦБ,
	|	СУММА(ОстаткиЦБОбороты.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(ОстаткиЦБОбороты.КоличествоРасход) КАК КоличествоРасход,
	|	ОстаткиЦБОбороты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_ОборотыВсеОперации
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Обороты(&ПериодНачало, &ПериодКонец, Регистратор, 1 = 1) КАК ОстаткиЦБОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ОстаткиЦБОбороты.Регистратор ССЫЛКА Документ.КонвертацияЦБ
	|				ТОГДА ИСТИНА
	|			КОГДА ОстаткиЦБОбороты.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|				ТОГДА ИСТИНА
	|			КОГДА ОстаткиЦБОбороты.Регистратор ССЫЛКА Документ.ПогашениеЦБ
	|				ТОГДА ИСТИНА
	|			КОГДА ОстаткиЦБОбороты.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиЦБОбороты.ЦБ,
	|	ОстаткиЦБОбороты.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОборотыВсеОперации.ЦБ КАК ЦБ,
	|	ВТ_ОборотыВсеОперации.КоличествоПриход КАК КоличествоПриход,
	|	ВТ_ОборотыВсеОперации.КоличествоРасход КАК КоличествоРасход,
	|	ВТ_ОборотыВсеОперации.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Обороты
	|ИЗ
	|	ВТ_ОборотыВсеОперации КАК ВТ_ОборотыВсеОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОперацииЦБ КАК ОперацииЦБ
	|		ПО ВТ_ОборотыВсеОперации.Регистратор = ОперацииЦБ.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_ОборотыВсеОперации.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|					И НЕ ОперацииЦБ.ВидОперацииД В (&ДопустимыеВидыОпераций)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Обороты.ЦБ КАК ЦБ,
	|	ВТ_Обороты.Регистратор КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ВТ_Обороты.КоличествоПриход <> 0
	|				И (ВТ_Обороты.Регистратор ССЫЛКА Документ.КонвертацияЦБ
	|					ИЛИ ВТ_Обороты.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|					ИЛИ ВТ_Обороты.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|						И ОперацииЦБ.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Депонирование))
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КолПриемЦБ,
	|	ВЫБОР
	|		КОГДА ВТ_Обороты.Регистратор ССЫЛКА Документ.КонвертацияЦБ
	|				ИЛИ ВТ_Обороты.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|				ИЛИ ВТ_Обороты.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|					И ОперацииЦБ.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Депонирование)
	|			ТОГДА ВТ_Обороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбПриемЦБ,
	|	ВЫБОР
	|		КОГДА ВТ_Обороты.КоличествоРасход <> 0
	|				И (ВТ_Обороты.Регистратор ССЫЛКА Документ.КонвертацияЦБ
	|					ИЛИ ВТ_Обороты.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|					ИЛИ ВТ_Обороты.Регистратор ССЫЛКА Документ.ПогашениеЦБ
	|					ИЛИ ВТ_Обороты.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|						И ОперацииЦБ.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СнятиеСДепонирования))
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КолСнятиеЦБ,
	|	ВЫБОР
	|		КОГДА ВТ_Обороты.Регистратор ССЫЛКА Документ.КонвертацияЦБ
	|				ИЛИ ВТ_Обороты.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|				ИЛИ ВТ_Обороты.Регистратор ССЫЛКА Документ.ПогашениеЦБ
	|				ИЛИ ВТ_Обороты.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|					И ОперацииЦБ.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СнятиеСДепонирования)
	|			ТОГДА ВТ_Обороты.КоличествоРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбСнятиеЦБ,
	|	ВЫБОР
	|		КОГДА ВТ_Обороты.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|				И ОперацииЦБ.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|				И ОперацииЦБ.Инициатор <> ОперацииЦБ.Получатель
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КолПереводЦБ,
	|	ВЫБОР
	|		КОГДА ВТ_Обороты.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|				И ОперацииЦБ.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|				И ОперацииЦБ.Инициатор <> ОперацииЦБ.Получатель
	|			ТОГДА ВТ_Обороты.КоличествоПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбПереводЦБ,
	|	ВЫБОР
	|		КОГДА ВТ_Обороты.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|			ТОГДА ""ГлобальнаяОперация"" + ВЫРАЗИТЬ(ВТ_Обороты.Регистратор КАК Документ.ГлобальнаяОперация).Номер
	|		КОГДА ВТ_Обороты.Регистратор ССЫЛКА Документ.КонвертацияЦБ
	|			ТОГДА ""КонвертацияЦБ"" + ВЫРАЗИТЬ(ВТ_Обороты.Регистратор КАК Документ.КонвертацияЦБ).Номер
	|		КОГДА ВТ_Обороты.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|			ТОГДА ""ОперацииЦБ"" + ВЫРАЗИТЬ(ВТ_Обороты.Регистратор КАК Документ.ОперацииЦБ).Номер
	|		КОГДА ВТ_Обороты.Регистратор ССЫЛКА Документ.ПогашениеЦБ
	|			ТОГДА ""ПогашениеЦБ"" + ВЫРАЗИТЬ(ВТ_Обороты.Регистратор КАК Документ.ПогашениеЦБ).Номер
	|	КОНЕЦ КАК СтрокаДляСортировки
	|ПОМЕСТИТЬ ВТ_ОборотыПоВидамОпераций
	|ИЗ
	|	ВТ_Обороты КАК ВТ_Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОперацииЦБ КАК ОперацииЦБ
	|		ПО ВТ_Обороты.Регистратор = ОперацииЦБ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеЦБ.ЦБ КАК ЦБ
	|ПОМЕСТИТЬ ВТ_ЦБ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Обороты.ЦБ КАК ЦБ
	|	ИЗ
	|		ВТ_Обороты КАК ВТ_Обороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_Остатки.ЦБ
	|	ИЗ
	|		ВТ_Остатки КАК ВТ_Остатки) КАК ВсеЦБ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеЦБ.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.СчетДепо КАК СчетДепо
	|ПОМЕСТИТЬ ВТ_СчетаДепо
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Остатки.СчетДепо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.СчетДепоМХ КАК СчетДепоМХ
	|ПОМЕСТИТЬ ВТ_СчетаДепоМХ
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Остатки.СчетДепоМХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЦБ.ЦБ КАК ЦБ,
	|	ВЫБОР
	|		КОГДА ВТ_ЦБ.ЦБ.ТипЦБ В (&ТипыДепозитарныхРасписок)
	|			ТОГДА ВТ_ЦБ.ЦБ.БазовыйАктив.Эмитент
	|		ИНАЧЕ ЦенныеБумаги.Эмитент
	|	КОНЕЦ КАК Эмитент
	|ПОМЕСТИТЬ ВТ_ЭмитентыЦБ
	|ИЗ
	|	ВТ_ЦБ КАК ВТ_ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ВТ_ЦБ.ЦБ = ЦенныеБумаги.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЦБ.ЦБ,
	|	ВЫБОР
	|		КОГДА ВТ_ЦБ.ЦБ.ТипЦБ В (&ТипыДепозитарныхРасписок)
	|			ТОГДА ВТ_ЦБ.ЦБ.БазовыйАктив.Эмитент
	|		ИНАЧЕ ЦенныеБумаги.Эмитент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭмитентыЦБ.Эмитент КАК Эмитент
	|ПОМЕСТИТЬ ВТ_Эмитенты
	|ИЗ
	|	ВТ_ЭмитентыЦБ КАК ВТ_ЭмитентыЦБ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЭмитентыЦБ.Эмитент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Остатки.СчетДепо.Владелец КАК НоминальныйДержатель
	|ПОМЕСТИТЬ ВТ_НоминальныеДержатели
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|ГДЕ
	|	ВТ_Остатки.ЭтоСчетДепоНоминальногоДержателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлиентыСУчетомНаСчетахТипаС.Клиент КАК Эмитент
	|ПОМЕСТИТЬ ВТ_ЭмитентыСУчетомНаСчетахТипаС
	|ИЗ
	|	РегистрСведений.КлиентыСУчетомНаСчетахТипаC.СрезПоследних(&ОтчетнаяДата, 1 = 1) КАК КлиентыСУчетомНаСчетахТипаС
	|ГДЕ
	|	КлиентыСУчетомНаСчетахТипаС.ФлагАктивности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Эмитенты.Эмитент КАК Эмитент,
	|	Контрагенты.Резидент КАК Нерезидент
	|ПОМЕСТИТЬ ВТ_РезидентствоЭмитентов
	|ИЗ
	|	ВТ_Эмитенты КАК ВТ_Эмитенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_Эмитенты.Эмитент = Контрагенты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Эмитенты.Эмитент КАК Эмитент,
	|	МАКСИМУМ(КодыЗагрузки.Код) КАК LEI,
	|	КОЛИЧЕСТВО(*) КАК КоличествоLEI
	|ПОМЕСТИТЬ ВТ_КодыLEI
	|ИЗ
	|	ВТ_Эмитенты КАК ВТ_Эмитенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_Эмитенты.Эмитент = Контрагенты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РезидентствоЭмитентов КАК ВТ_РезидентствоЭмитентов
	|		ПО ВТ_Эмитенты.Эмитент = ВТ_РезидентствоЭмитентов.Эмитент
	|			И (ВТ_РезидентствоЭмитентов.Нерезидент)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО (ЮридическиеЛица.Ссылка = КодыЗагрузки.Владелец)
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.LEI_Code))
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ПериодКонец)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Эмитенты.Эмитент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЮридическиеЛица.ИНН КАК ИНН
	|ПОМЕСТИТЬ ВТ_ИНН
	|ИЗ
	|	ВТ_Эмитенты КАК ВТ_Эмитенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_Эмитенты.Эмитент = Контрагенты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)
	|			И ЮридическиеЛица.ИНН <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МестаХранения.ИНН КАК ИНН
	|ИЗ
	|	ВТ_СчетаДепоМХ КАК ВТ_СчетаДепоМХ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДепоМХ КАК СчетаДепоМХ
	|			ПО ВТ_СчетаДепоМХ.СчетДепоМХ = СчетаДепоМХ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МестаХранения КАК МестаХранения
	|			ПО (СчетаДепоМХ.Владелец = МестаХранения.Ссылка)
	|				И МестаХранения.ИНН <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЮридическиеЛица.ИНН КАК ИНН
	|ИЗ
	|	ВТ_НоминальныеДержатели КАК ВТ_НоминальныеДержатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО ВТ_НоминальныеДержатели.НоминальныйДержатель = Контрагенты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)
	|				И ЮридическиеЛица.ИНН <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЮридическиеЛицаЦБРФСрезПоследних.Период КАК Период,
	|	ЮридическиеЛицаЦБРФСрезПоследних.ИНН КАК ИНН,
	|	ЮридическиеЛицаЦБРФСрезПоследних.ОГРН КАК ОГРН,
	|	ЮридическиеЛицаЦБРФСрезПоследних.Наименование КАК Наименование
	|ПОМЕСТИТЬ ВТ_ЮридическиеЛицаЦБРФ
	|ИЗ
	|	РегистрСведений.ЮридическиеЛицаЦБРФ.СрезПоследних(
	|			&ПериодКонец,
	|			ИНН В
	|				(ВЫБРАТЬ
	|					ВТ_ИНН.ИНН КАК ИНН
	|				ИЗ
	|					ВТ_ИНН КАК ВТ_ИНН
	|				)) КАК ЮридическиеЛицаЦБРФСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Эмитенты.Эмитент КАК Эмитент,
	|	ВТ_РезидентствоЭмитентов.Нерезидент КАК НеРезидент,
	|	Контрагенты.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|				И (НЕ ВТ_РезидентствоЭмитентов.Нерезидент
	|					ИЛИ ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|						И ЮридическиеЛицаМеждународныеКомпании.ПризнакРегистрацииМК = ЗНАЧЕНИЕ(Перечисление.ПризнакРегистрацииМеждународнойКомпании.Инкорпорация))
	|			ТОГДА ""1""
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|				И ВТ_РезидентствоЭмитентов.Нерезидент
	|			ТОГДА ""2""
	|	КОНЕЦ КАК ПризнакЭм,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_РезидентствоЭмитентов.Нерезидент
	|				ИЛИ ВТ_РезидентствоЭмитентов.Нерезидент
	|					И ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ЮридическиеЛица.ИНН = """"
	|						ТОГДА ""0000000000""
	|					ИНАЧЕ ЕСТЬNULL(ЮридическиеЛица.ИНН, ""0000000000"")
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИНН_Эм,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЮрлицо,
	|	ВЫБОР
	|		КОГДА ВТ_РезидентствоЭмитентов.Нерезидент
	|				И НЕ ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|						ТОГДА ВЫБОР
	|								КОГДА ЮридическиеЛица.ИНН <> """"
	|									ТОГДА ""TIN""
	|								КОГДА ЮридическиеЛица.TIN <> """"
	|									ТОГДА ""TIN""
	|								КОГДА ЮридическиеЛица.РегНомер <> """"
	|									ТОГДА ""RN""
	|								КОГДА НЕ ВТ_КодыLEI.LEI ЕСТЬ NULL
	|									ТОГДА ""LEI""
	|								ИНАЧЕ ""NN""
	|							КОНЕЦ
	|					КОГДА Контрагенты.TIN <> """"
	|						ТОГДА ""TIN""
	|					ИНАЧЕ ""NN""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПризнакКодаЭмНерез,
	|	ВЫБОР
	|		КОГДА ВТ_РезидентствоЭмитентов.Нерезидент
	|				И НЕ ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|						ТОГДА ВЫБОР
	|								КОГДА ЮридическиеЛица.ИНН <> """"
	|									ТОГДА ЮридическиеЛица.ИНН
	|								КОГДА ЮридическиеЛица.TIN <> """"
	|									ТОГДА ЮридическиеЛица.TIN
	|								КОГДА ЮридическиеЛица.РегНомер <> """"
	|									ТОГДА ЮридическиеЛица.РегНомер
	|								КОГДА НЕ ВТ_КодыLEI.LEI ЕСТЬ NULL
	|									ТОГДА ВТ_КодыLEI.LEI
	|								ИНАЧЕ ""000""
	|							КОНЕЦ
	|					КОГДА Контрагенты.TIN <> """"
	|						ТОГДА Контрагенты.TIN
	|					ИНАЧЕ ""000""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК TIN_Эм,
	|	ВТ_КодыLEI.КоличествоLEI КАК КоличествоLEI,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_РезидентствоЭмитентов.Нерезидент
	|				ИЛИ ВТ_РезидентствоЭмитентов.Нерезидент
	|					И ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(ЮридическиеЛицаЦБРФ.ОГРН, ЮридическиеЛица.ОГРН)
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОГРН_Эм,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|							И (ЮридическиеЛицаМеждународныеКомпании.ПризнакРегистрацииМК = ЗНАЧЕНИЕ(Перечисление.ПризнакРегистрацииМеждународнойКомпании.Редомициляция)
	|								ИЛИ ЮридическиеЛицаМеждународныеКомпании.ПризнакРегистрацииМК = ЗНАЧЕНИЕ(Перечисление.ПризнакРегистрацииМеждународнойКомпании.ПустаяСсылка))
	|						ТОГДА ""996""
	|					КОГДА ЮридическиеЛица.МеждународнаяОрганизация
	|						ТОГДА ""998""
	|					КОГДА НЕ ВТ_РезидентствоЭмитентов.Нерезидент
	|							ИЛИ ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|								И ЮридическиеЛицаМеждународныеКомпании.ПризнакРегистрацииМК = ЗНАЧЕНИЕ(Перечисление.ПризнакРегистрацииМеждународнойКомпании.Инкорпорация)
	|						ТОГДА ""643""
	|					ИНАЧЕ ЕСТЬNULL(КлассификаторСтранМира.Код, ""999"")
	|				КОНЕЦ
	|		ИНАЧЕ ""999""
	|	КОНЕЦ КАК КодСтрЭм,
	|	ВЫБОР
	|		КОГДА ВТ_ЭмитентыСУчетомНаСчетахТипаС.Эмитент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТипС,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_РезидентствоЭмитентов.Нерезидент
	|				ИЛИ ВТ_РезидентствоЭмитентов.Нерезидент
	|					И ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|			ТОГДА ЮридическиеЛицаЦБРФ.ИНН ЕСТЬ NULL
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НетСоотвествияИННДляЦБРФ,
	|	ВЫБОР
	|		КОГДА ЮридическиеЛицаЦБРФ.ИНН ЕСТЬ NULL
	|			ТОГДА ""Отсутствуют данные эмитента в Справочнике ИНН и ОГРН.""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПримечаниеИНН,
	|	ЕСТЬNULL(ЮридическиеЛицаЦБРФ.Наименование, Контрагенты.Наименование) КАК НаименованиеЭмитента,
	|	НЕ ВТ_РезидентствоЭмитентов.Нерезидент
	|		ИЛИ ВТ_РезидентствоЭмитентов.Нерезидент
	|			И ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ) КАК ЭтоРезидентИлиНерезидентМК,
	|	ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|		И ЮридическиеЛицаМеждународныеКомпании.ПризнакРегистрацииМК = ЗНАЧЕНИЕ(Перечисление.ПризнакРегистрацииМеждународнойКомпании.ПустаяСсылка) КАК ПризнакРегистрацииМКНеЗаполнен
	|ПОМЕСТИТЬ ВТ_ДанныеПоЭмитентам
	|ИЗ
	|	ВТ_Эмитенты КАК ВТ_Эмитенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_Эмитенты.Эмитент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РезидентствоЭмитентов КАК ВТ_РезидентствоЭмитентов
	|		ПО ВТ_Эмитенты.Эмитент = ВТ_РезидентствоЭмитентов.Эмитент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|			ЛЕВОЕ СОЕДИНЕНИЕ ЮридическиеЛицаМеждународныеКомпании КАК ЮридическиеЛицаМеждународныеКомпании
	|			ПО ЮридическиеЛица.Ссылка = ЮридическиеЛицаМеждународныеКомпании.ЮридическоеЛицо
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (Контрагенты.РегионДляОтчетов = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЭмитентыСУчетомНаСчетахТипаС КАК ВТ_ЭмитентыСУчетомНаСчетахТипаС
	|		ПО (ВТ_ЭмитентыСУчетомНаСчетахТипаС.Эмитент = ВТ_Эмитенты.Эмитент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыLEI КАК ВТ_КодыLEI
	|		ПО ВТ_Эмитенты.Эмитент = ВТ_КодыLEI.Эмитент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЮридическиеЛицаЦБРФ КАК ЮридическиеЛицаЦБРФ
	|		ПО (ЮридическиеЛицаЦБРФ.ИНН = ЮридическиеЛица.ИНН)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭмитентыЦБ.ЦБ КАК ЦБ,
	|	ВТ_ЭмитентыЦБ.Эмитент КАК Эмитент,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Пай)
	|				ТОГДА ВТ_ДанныеПоЭмитентам.НаименованиеЭмитента + "" ("" + ЦенныеБумаги.Наименование + "")""
	|			КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.КлиринговыйСертификатУчастия)
	|				ТОГДА ВТ_ДанныеПоЭмитентам.НаименованиеЭмитента + "" ("" + ЦенныеБумаги.Наименование + "")""
	|			ИНАЧЕ ВТ_ДанныеПоЭмитентам.НаименованиеЭмитента
	|		КОНЕЦ КАК СТРОКА(150)) КАК НаименованиеЭм
	|ПОМЕСТИТЬ ВТ_НаименованияЭмитентовЦБ
	|ИЗ
	|	ВТ_ЭмитентыЦБ КАК ВТ_ЭмитентыЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоЭмитентам КАК ВТ_ДанныеПоЭмитентам
	|		ПО ВТ_ЭмитентыЦБ.Эмитент = ВТ_ДанныеПоЭмитентам.Эмитент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ВТ_ЭмитентыЦБ.ЦБ = ЦенныеБумаги.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоминалЦБСрезПоследних.ЦеннаяБумага КАК ЦБ,
	|	НоминалЦБСрезПоследних.Сумма КАК Номинал
	|ПОМЕСТИТЬ ВТ_НоминалЦБ
	|ИЗ
	|	РегистрСведений.НоминалЦБ.СрезПоследних(
	|			&ПериодКонец,
	|			ЦеннаяБумага В
	|				(ВЫБРАТЬ
	|					ВТ_ЦБ.ЦБ КАК ЦБ
	|				ИЗ
	|					ВТ_ЦБ)) КАК НоминалЦБСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЦБ.ЦБ КАК ЦБ,
	|	СправочникЦенныеБумаги.ТипЦБ КАК ТипЦБ,
	|	ВидыЦББанкаРоссии.Код КАК КодТипаЦБ,
	|	ВЫБОР
	|		КОГДА СправочникЦенныеБумаги.ТипЦБ <> ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.КлиринговыйСертификатУчастия)
	|				И (ВТ_ДанныеПоЭмитентам.ЭтоРезидентИлиНерезидентМК
	|					ИЛИ СправочникЦенныеБумаги.ISIN = """")
	|			ТОГДА СправочникЦенныеБумаги.НомерРегистрации
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомРегЦБ,
	|	СправочникЦенныеБумаги.НомерРегистрации КАК НомерРегистрации,
	|	СправочникЦенныеБумаги.ISIN КАК ISIN,
	|	СправочникЦенныеБумаги.CFI КАК CFI,
	|	СправочникЦенныеБумаги.ВалютаНоминала КАК ВалютаНоминала,
	|	ВЫБОР
	|		КОГДА СправочникЦенныеБумаги.ТипЦБ В (&ТипыЦББезНоминала)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЦББезНоминала,
	|	ЕСТЬNULL(ВТ_НоминалЦБ.Номинал, 0) КАК НомСтоимЦБ,
	|	ВидыЦББанкаРоссии.Код В (""BON5"", ""BON6"", ""BON61"", ""BON7"", ""BON71"", ""SN3"", ""SN4"")
	|		И СправочникЦенныеБумаги.ДатаПогашения <> ДАТАВРЕМЯ(1, 1, 1)
	|		И СправочникЦенныеБумаги.ДатаПогашения <= &ОтчетнаяДата
	|		И ГО.Ссылка ЕСТЬ NULL КАК ВыводитьНоминал,
	|	ВТ_ЭмитентыЦБ.Эмитент КАК Эмитент,
	|	СправочникЦенныеБумаги.БазовыйАктив КАК БазовыйАктив,
	|	ВЫБОР 
	|		КОГДА СправочникЦенныеБумаги.ТипЦБ В (&ТипыДепозитарныхРасписок)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ ЭтоДепозитарнаяРасписка
	|ПОМЕСТИТЬ ВТ_ПредварительныеДанныеПоЦБ
	|ИЗ
	|	ВТ_ЦБ КАК ВТ_ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК СправочникЦенныеБумаги
	|		ПО ВТ_ЦБ.ЦБ = СправочникЦенныеБумаги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦББанкаРоссии КАК ВидыЦББанкаРоссии
	|		ПО (СправочникЦенныеБумаги.ВидЦББанкаРоссии = ВидыЦББанкаРоссии.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЭмитентыЦБ КАК ВТ_ЭмитентыЦБ
	|		ПО ВТ_ЦБ.ЦБ = ВТ_ЭмитентыЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоЭмитентам КАК ВТ_ДанныеПоЭмитентам
	|		ПО (ВТ_ДанныеПоЭмитентам.Эмитент = ВТ_ЭмитентыЦБ.Эмитент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НоминалЦБ КАК ВТ_НоминалЦБ
	|		ПО ВТ_ЦБ.ЦБ = ВТ_НоминалЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГлобальнаяОперация КАК ГО
	|		ПО ВТ_ЦБ.ЦБ = ГО.ЦеннаяБумага
	|			И (ГО.ВидГлобальнойОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Погашение))
	|			И (ГО.Дата МЕЖДУ &ПериодНачало И &ПериодКонец)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПредварительныеДанныеПоЦБ.ЦБ КАК ЦБ,
	|	ВТ_ПредварительныеДанныеПоЦБ.ТипЦБ КАК ТипЦБ,
	|	ВТ_ПредварительныеДанныеПоЦБ.КодТипаЦБ КАК КодТипаЦБ,
	|	ВТ_ПредварительныеДанныеПоЦБ.НомРегЦБ КАК НомРегЦБ,
	|	ВТ_ПредварительныеДанныеПоЦБ.НомерРегистрации КАК НомерРегистрации,
	|	ВТ_ПредварительныеДанныеПоЦБ.ISIN КАК ISIN,
	|	ВТ_ПредварительныеДанныеПоЦБ.CFI КАК CFI,
	|	ВТ_ПредварительныеДанныеПоЦБ.ВалютаНоминала КАК ВалютаНоминала,
	|	ВТ_ПредварительныеДанныеПоЦБ.ЦББезНоминала КАК ЦББезНоминала,
	|	ВЫБОР
	|		КОГДА ВТ_ПредварительныеДанныеПоЦБ.ЦББезНоминала
	|				ИЛИ ВТ_ПредварительныеДанныеПоЦБ.НомСтоимЦБ = 0
	|					И НЕ ВТ_ПредварительныеДанныеПоЦБ.ВыводитьНоминал
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(Валюты.Код, """")
	|	КОНЕЦ КАК КодВалК,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ВТ_ПредварительныеДанныеПоЦБ.ЦББезНоминала
	|						ИЛИ ВТ_ПредварительныеДанныеПоЦБ.НомСтоимЦБ = 0
	|							И НЕ ВТ_ПредварительныеДанныеПоЦБ.ВыводитьНоминал
	|					ТОГДА """"
	|				ИНАЧЕ ЕСТЬNULL(Валюты.Код, """")
	|			КОНЕЦ = """"
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ПредварительныеДанныеПоЦБ.НомСтоимЦБ
	|	КОНЕЦ КАК НомСтоимЦБ,
	|	ВТ_ПредварительныеДанныеПоЦБ.Эмитент КАК Эмитент,
	|	ВТ_ПредварительныеДанныеПоЦБ.БазовыйАктив КАК БазовыйАктив,
	|	ВТ_ПредварительныеДанныеПоЦБ.ЭтоДепозитарнаяРасписка КАК ЭтоДепозитарнаяРасписка
	|ПОМЕСТИТЬ ВТ_ДанныеПоЦБ
	|ИЗ
	|	ВТ_ПредварительныеДанныеПоЦБ КАК ВТ_ПредварительныеДанныеПоЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ВТ_ПредварительныеДанныеПоЦБ.ВалютаНоминала = Валюты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлассификаторСрезПоследних.ТипСчета1С КАК ТипСчетаДепо,
	|	КлассификаторСрезПоследних.ВидСчетаДляОтчета КАК ВидСчета
	|ПОМЕСТИТЬ ВТ_ВидыСчетовДепо
	|ИЗ
	|	РегистрСведений.КлассификаторДляОтчетовВидыСчетовДЕПО.СрезПоследних(&ОтчетнаяДата, 1 = 1) КАК КлассификаторСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СчетаДепо.СчетДепо КАК СчетДепо,
	|	ВТ_ВидыСчетовДепо.ВидСчета КАК ВидСчета,
	|	СчетаДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ВЫБОР
	|		КОГДА ТипыДепонентов.Код ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА ВТ_ВидыСчетовДепо.ВидСчета В (&ВидыСчетовСектораЭк)
	|			ТОГДА ТипыДепонентов.Код
	|		ИНАЧЕ ""000""
	|	КОНЕЦ КАК КодСекторЭк,
	|	ВЫБОР
	|		КОГДА НЕ Контрагенты.Резидент			// Не является нерезидентом по документам
	|				ИЛИ ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|					И ЮридическиеЛицаМеждународныеКомпании.ПризнакРегистрацииМК = ЗНАЧЕНИЕ(Перечисление.ПризнакРегистрацииМеждународнойКомпании.Инкорпорация)
	|			ТОГДА ""643""
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|				И ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|				И (ЮридическиеЛицаМеждународныеКомпании.ПризнакРегистрацииМК = ЗНАЧЕНИЕ(Перечисление.ПризнакРегистрацииМеждународнойКомпании.Редомициляция)
	|					ИЛИ ЮридическиеЛицаМеждународныеКомпании.ПризнакРегистрацииМК = ЗНАЧЕНИЕ(Перечисление.ПризнакРегистрацииМеждународнойКомпании.ПустаяСсылка))
	|			ТОГДА ""996""
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|				И ЮридическиеЛица.МеждународнаяОрганизация
	|			ТОГДА ""998""
	|		ИНАЧЕ ЕСТЬNULL(КлассификаторСтранМира.Код, ""999"")
	|	КОНЕЦ КАК КодСтрВладельца,
	|	ЕСТЬNULL(ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания, ЛОЖЬ)
	|		И ЮридическиеЛицаМеждународныеКомпании.ПризнакРегистрацииМК = ЗНАЧЕНИЕ(Перечисление.ПризнакРегистрацииМеждународнойКомпании.ПустаяСсылка) КАК ПризнакРегистрацииМКНеЗаполнен,
	|	ВЫРАЗИТЬ(СОКРЛП(СчетаДепо.Код) КАК СТРОКА(40)) КАК СчетДепоКод
	|ПОМЕСТИТЬ ВТ_ДанныеПоСчетамДепо
	|ИЗ
	|	ВТ_СчетаДепо КАК ВТ_СчетаДепо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
	|		ПО ВТ_СчетаДепо.СчетДепо = СчетаДепо.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидыСчетовДепо КАК ВТ_ВидыСчетовДепо
	|		ПО (СчетаДепо.ТипСчетаДепо = ВТ_ВидыСчетовДепо.ТипСчетаДепо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (СчетаДепо.Владелец = Контрагенты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|			ЛЕВОЕ СОЕДИНЕНИЕ ЮридическиеЛицаМеждународныеКомпании КАК ЮридическиеЛицаМеждународныеКомпании
	|			ПО ЮридическиеЛица.Ссылка = ЮридическиеЛицаМеждународныеКомпании.ЮридическоеЛицо
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ФизическиеЛица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыДепонентов КАК ТипыДепонентов
	|		ПО (ВЫБОР
	|				КОГДА ЮридическиеЛица.ТипДепонента = ТипыДепонентов.Ссылка
	|					ТОГДА ИСТИНА
	|				КОГДА ФизическиеЛица.ТипДепонента = ТипыДепонентов.Ссылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (Контрагенты.РегионДляОтчетов = КлассификаторСтранМира.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СчетаДепоМХ.СчетДепоМХ КАК СчетДепоМХ,
	|	МАКСИМУМ(КодыЗагрузки.Код) КАК TIN
	|ПОМЕСТИТЬ ВТ_СчетаДепоМХ_TIN
	|ИЗ
	|	ВТ_СчетаДепоМХ КАК ВТ_СчетаДепоМХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО (КодыЗагрузки.Владелец = ВТ_СчетаДепоМХ.СчетДепоМХ.Владелец)
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.TIN_Code))
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ПериодКонец)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СчетаДепоМХ.СчетДепоМХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СчетаДепоМХ.СчетДепоМХ КАК СчетДепоМХ,
	|	МАКСИМУМ(КодыЗагрузки.Код) КАК LEI
	|ПОМЕСТИТЬ ВТ_СчетаДепоМХ_LEI
	|ИЗ
	|	ВТ_СчетаДепоМХ КАК ВТ_СчетаДепоМХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО (КодыЗагрузки.Владелец = ВТ_СчетаДепоМХ.СчетДепоМХ.Владелец)
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.LEI_Code))
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ПериодКонец)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СчетаДепоМХ.СчетДепоМХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СчетаДепоМХ.СчетДепоМХ КАК СчетДепоМХ,
	|	СчетаДепоМХ.Владелец КАК МестоХранения,
	|	ЕСТЬNULL(ЮридическиеЛицаЦБРФ.Наименование, МестаХранения.Наименование) КАК НаимОрг,
	|	ВЫБОР
	|		КОГДА МестаХранения.ПризнакОрганизации = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.Нерезидент)
	|			ТОГДА ""2""
	|		ИНАЧЕ ""1""
	|	КОНЕЦ КАК ПризнакОргЮЛ,
	|	ВЫБОР
	|		КОГДА МестаХранения.ПризнакОрганизации = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.Нерезидент)
	|			ТОГДА ""И""
	|		КОГДА МестаХранения.ПризнакОрганизации = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.Эмитент)
	|			ТОГДА ""Э""
	|		КОГДА МестаХранения.ПризнакОрганизации = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.Регистратор)
	|			ТОГДА ""Р""
	|		КОГДА МестаХранения.ПризнакОрганизации = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.СпециализированныйДепозитарийКредитнаяОрганизация)
	|			ТОГДА ""К""
	|		КОГДА МестаХранения.ПризнакОрганизации = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.СпециализированныйДепозитарийНекредитнаяОрганизация)
	|			ТОГДА ""Н""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПризнакОрг,
	|	ВЫБОР
	|		КОГДА МестаХранения.ПризнакОрганизации <> ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.Нерезидент)
	|			ТОГДА ВЫБОР
	|					КОГДА МестаХранения.ИНН = """"
	|						ТОГДА ""0000000000""
	|					ИНАЧЕ ЕСТЬNULL(МестаХранения.ИНН, ""0000000000"")
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИНН_Орг,
	|	ВЫБОР
	|		КОГДА МестаХранения.ПризнакОрганизации = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.Нерезидент)
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ВТ_СчетаДепоМХ_TIN.TIN ЕСТЬ NULL
	|						ТОГДА ""TIN""
	|					КОГДА МестаХранения.НомерГосударственнойРегистрации <> """"
	|						ТОГДА ""RN""
	|					КОГДА НЕ ВТ_СчетаДепоМХ_LEI.LEI ЕСТЬ NULL
	|						ТОГДА ""LEI""
	|					ИНАЧЕ ""NN""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПризнакКодаОргНерез,
	|	ВЫБОР
	|		КОГДА МестаХранения.ПризнакОрганизации = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.Нерезидент)
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ВТ_СчетаДепоМХ_TIN.TIN ЕСТЬ NULL
	|						ТОГДА ВТ_СчетаДепоМХ_TIN.TIN
	|					КОГДА МестаХранения.НомерГосударственнойРегистрации <> """"
	|						ТОГДА МестаХранения.НомерГосударственнойРегистрации
	|					КОГДА НЕ ВТ_СчетаДепоМХ_LEI.LEI ЕСТЬ NULL
	|						ТОГДА ВТ_СчетаДепоМХ_LEI.LEI
	|					ИНАЧЕ ""000""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК TIN_Орг,
	|	ВЫБОР
	|		КОГДА НЕ МестаХранения.ПризнакОрганизации = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.Нерезидент)
	|			ТОГДА МестаХранения.НомерГосударственнойРегистрации
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОГРН_Орг,
	|	ЕСТЬNULL(КлассификаторСтранМира.Код, ""999"") КАК КодСтр_Орг,
	|	СчетаДепоМХ.ТипСчета КАК ТипСчета,
	|	ВЫРАЗИТЬ(СОКРЛП(СчетаДепоМХ.Код) КАК СТРОКА(40)) КАК СчетДепоМХКод
	|ПОМЕСТИТЬ ВТ_ДанныеПоСчетамДепоМХ
	|ИЗ
	|	ВТ_СчетаДепоМХ КАК ВТ_СчетаДепоМХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепоМХ КАК СчетаДепоМХ
	|		ПО ВТ_СчетаДепоМХ.СчетДепоМХ = СчетаДепоМХ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МестаХранения КАК МестаХранения
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЮридическиеЛицаЦБРФ КАК ЮридическиеЛицаЦБРФ
	|			ПО МестаХранения.ИНН = ЮридическиеЛицаЦБРФ.ИНН
	|		ПО (СчетаДепоМХ.Владелец = МестаХранения.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаДепоМХ_TIN КАК ВТ_СчетаДепоМХ_TIN
	|		ПО (ВТ_СчетаДепоМХ_TIN.СчетДепоМХ = ВТ_СчетаДепоМХ.СчетДепоМХ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаДепоМХ_LEI КАК ВТ_СчетаДепоМХ_LEI
	|		ПО (ВТ_СчетаДепоМХ_LEI.СчетДепоМХ = ВТ_СчетаДепоМХ.СчетДепоМХ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (МестаХранения.Страна = КлассификаторСтранМира.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НоминальныеДержатели.НоминальныйДержатель КАК НоминальныйДержатель,
	|	Контрагенты.Резидент КАК Нерезидент
	|ПОМЕСТИТЬ ВТ_РезидентствоНоминальныхДержателей
	|ИЗ
	|	ВТ_НоминальныеДержатели КАК ВТ_НоминальныеДержатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_НоминальныеДержатели.НоминальныйДержатель = Контрагенты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НоминальныеДержатели.НоминальныйДержатель КАК НоминальныйДержатель,
	|	МАКСИМУМ(КодыЗагрузки.Код) КАК LEI,
	|	КОЛИЧЕСТВО(*) КАК КоличествоLEI
	|ПОМЕСТИТЬ ВТ_КодыLEI_НоминальныхДержателей
	|ИЗ
	|	ВТ_НоминальныеДержатели КАК ВТ_НоминальныеДержатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_НоминальныеДержатели.НоминальныйДержатель = Контрагенты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РезидентствоНоминальныхДержателей КАК ВТ_РезидентствоНоминальныхДержателей
	|		ПО ВТ_НоминальныеДержатели.НоминальныйДержатель = ВТ_РезидентствоНоминальныхДержателей.НоминальныйДержатель
	|			И (ВТ_РезидентствоНоминальныхДержателей.Нерезидент)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО (ЮридическиеЛица.Ссылка = КодыЗагрузки.Владелец)
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.LEI_Code))
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ПериодКонец)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_НоминальныеДержатели.НоминальныйДержатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НоминальныеДержатели.НоминальныйДержатель КАК НоминальныйДержатель,
	|	ВТ_РезидентствоНоминальныхДержателей.Нерезидент КАК НеРезидент,
	|	Контрагенты.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|				И НЕ ВТ_РезидентствоНоминальныхДержателей.Нерезидент
	|			ТОГДА ""1""
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|				И ВТ_РезидентствоНоминальныхДержателей.Нерезидент
	|			ТОГДА ""2""
	|	КОНЕЦ КАК ПризнакДК_ЮЛ,
	|	ВЫБОР
	|		КОГДА Контрагенты.ПризнакКонтрагента = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.Нерезидент)
	|			ТОГДА ""И""
	|		КОГДА Контрагенты.ПризнакКонтрагента = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.Эмитент)
	|			ТОГДА ""Э""
	|		КОГДА Контрагенты.ПризнакКонтрагента = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.Регистратор)
	|			ТОГДА ""Р""
	|		КОГДА Контрагенты.ПризнакКонтрагента = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.СпециализированныйДепозитарийКредитнаяОрганизация)
	|			ТОГДА ""К""
	|		КОГДА Контрагенты.ПризнакКонтрагента = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.СпециализированныйДепозитарийНекредитнаяОрганизация)
	|			ТОГДА ""Н""
	|	КОНЕЦ КАК ПризнакДК,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_РезидентствоНоминальныхДержателей.Нерезидент
	|			ТОГДА ВЫБОР
	|					КОГДА ЮридическиеЛица.ИНН = """"
	|						ТОГДА ""0000000000""
	|					ИНАЧЕ ЕСТЬNULL(ЮридическиеЛица.ИНН, ""0000000000"")
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИНН_ДК,
	|	ВЫБОР
	|		КОГДА ВТ_РезидентствоНоминальныхДержателей.Нерезидент
	|			ТОГДА ВЫБОР
	|					КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|						ТОГДА ВЫБОР
	|								КОГДА ЮридическиеЛица.ИНН <> """"
	|									ТОГДА ""TIN""
	|								КОГДА ЮридическиеЛица.TIN <> """"
	|									ТОГДА ""TIN""
	|								КОГДА ЮридическиеЛица.РегНомер <> """"
	|									ТОГДА ""RN""
	|								КОГДА НЕ ВТ_КодыLEI_НоминальныхДержателей.LEI ЕСТЬ NULL
	|									ТОГДА ""LEI""
	|								ИНАЧЕ ""NN""
	|							КОНЕЦ
	|					КОГДА Контрагенты.TIN <> """"
	|						ТОГДА ""TIN""
	|					ИНАЧЕ ""NN""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПризнакКодаНерез,
	|	ВЫБОР
	|		КОГДА ВТ_РезидентствоНоминальныхДержателей.Нерезидент
	|			ТОГДА ВЫБОР
	|					КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|						ТОГДА ВЫБОР
	|								КОГДА ЮридическиеЛица.ИНН <> """"
	|									ТОГДА ЮридическиеЛица.ИНН
	|								КОГДА ЮридическиеЛица.TIN <> """"
	|									ТОГДА ЮридическиеЛица.TIN
	|								КОГДА ЮридическиеЛица.РегНомер <> """"
	|									ТОГДА ЮридическиеЛица.РегНомер
	|								КОГДА НЕ ВТ_КодыLEI_НоминальныхДержателей.LEI ЕСТЬ NULL
	|									ТОГДА ВТ_КодыLEI_НоминальныхДержателей.LEI
	|								ИНАЧЕ ""000""
	|							КОНЕЦ
	|					КОГДА Контрагенты.TIN <> """"
	|						ТОГДА Контрагенты.TIN
	|					ИНАЧЕ ""000""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК TIN_ДК,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_РезидентствоНоминальныхДержателей.Нерезидент
	|			ТОГДА ЕСТЬNULL(ЮридическиеЛицаЦБРФ.ОГРН, ЮридическиеЛица.ОГРН)
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОГРН_ДК,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ВТ_РезидентствоНоминальныхДержателей.Нерезидент
	|						ТОГДА ""643""
	|					ИНАЧЕ ЕСТЬNULL(КлассификаторСтранМира.Код, ""999"")
	|				КОНЕЦ
	|		ИНАЧЕ ""999""
	|	КОНЕЦ КАК КодСтр_ДК,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_РезидентствоНоминальныхДержателей.Нерезидент
	|			ТОГДА ЮридическиеЛицаЦБРФ.ИНН ЕСТЬ NULL
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НетСоотвествияИННДляЦБРФ,
	|	ВЫБОР
	|		КОГДА ЮридическиеЛицаЦБРФ.ИНН ЕСТЬ NULL
	|			ТОГДА ""Отсутствуют данные о номинальном держателе в Справочнике ИНН и ОГРН""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПримечаниеИНН,
	|	ЕСТЬNULL(ЮридическиеЛицаЦБРФ.Наименование, Контрагенты.Наименование) КАК НаименованиеНоминальногоДержателя
	|ПОМЕСТИТЬ ВТ_ДанныеПоНоминальнымДержателям
	|ИЗ
	|	ВТ_НоминальныеДержатели КАК ВТ_НоминальныеДержатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_НоминальныеДержатели.НоминальныйДержатель = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РезидентствоНоминальныхДержателей КАК ВТ_РезидентствоНоминальныхДержателей
	|		ПО ВТ_НоминальныеДержатели.НоминальныйДержатель = ВТ_РезидентствоНоминальныхДержателей.НоминальныйДержатель
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (Контрагенты.РегионДляОтчетов = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыLEI_НоминальныхДержателей КАК ВТ_КодыLEI_НоминальныхДержателей
	|		ПО ВТ_НоминальныеДержатели.НоминальныйДержатель = ВТ_КодыLEI_НоминальныхДержателей.НоминальныйДержатель
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЮридическиеЛицаЦБРФ КАК ЮридическиеЛицаЦБРФ
	|		ПО (ЮридическиеЛицаЦБРФ.ИНН = ЮридическиеЛица.ИНН)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоНоминальнымДержателям.НоминальныйДержатель КАК НоминальныйДержатель,
	|	НЕ ВТ_ДанныеПоНоминальнымДержателям.Нерезидент КАК Резидент,
	|	ВТ_ДанныеПоНоминальнымДержателям.ИНН_ДК КАК ИНН_ДК,
	|	ВТ_ДанныеПоНоминальнымДержателям.ОГРН_ДК КАК ОГРН_ДК,
	|	ВТ_ДанныеПоНоминальнымДержателям.НетСоотвествияИННДляЦБРФ КАК НетСоотвествияИННДляЦБРФ
	|ИЗ
	|	ВТ_ДанныеПоНоминальнымДержателям КАК ВТ_ДанныеПоНоминальнымДержателям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоЦБ.ЦБ КАК ЦБ,
	|	ВТ_ДанныеПоЦБ.ISIN КАК ISIN,
	|	ВТ_ДанныеПоЦБ.ЦББезНоминала КАК ЦББезНоминала,
	|	ВТ_ДанныеПоЦБ.ВалютаНоминала КАК ВалютаНоминала,
	|	ВТ_ДанныеПоЦБ.НомСтоимЦБ КАК НомСтоимЦБ,
	|	ВТ_ДанныеПоЦБ.Эмитент КАК Эмитент,
	|	ВТ_ДанныеПоЦБ.БазовыйАктив КАК БазовыйАктив,
	|	ВТ_ДанныеПоЦБ.ЭтоДепозитарнаяРасписка КАК ЭтоДепозитарнаяРасписка
	|ИЗ
	|	ВТ_ДанныеПоЦБ КАК ВТ_ДанныеПоЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоСчетамДепо.СчетДепо КАК СчетДепо,
	|	ВТ_ДанныеПоСчетамДепо.ВидСчета КАК ВидСчета,
	|	ВТ_ДанныеПоСчетамДепо.ТипСчетаДепо КАК ТипСчетаДепо,
	|	ВТ_ДанныеПоСчетамДепо.КодСекторЭк КАК КодСекторЭк,
	|	ВТ_ДанныеПоСчетамДепо.КодСтрВладельца КАК КодСтрВладельца,
	|	ВТ_ДанныеПоСчетамДепо.ПризнакРегистрацииМКНеЗаполнен КАК ПризнакРегистрацииМКНеЗаполнен
	|ИЗ
	|	ВТ_ДанныеПоСчетамДепо КАК ВТ_ДанныеПоСчетамДепо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоЭмитентам.Эмитент КАК Эмитент,
	|	ВТ_ДанныеПоЭмитентам.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица,
	|	ВТ_ДанныеПоЭмитентам.ИНН_Эм КАК ИНН_Эм,
	|	ВТ_ДанныеПоЭмитентам.ОГРН_Эм КАК ОГРН_Эм,
	|	ВТ_ДанныеПоЭмитентам.КодСтрЭм КАК КодСтрЭм,
	|	ВТ_ДанныеПоЭмитентам.ПризнакКодаЭмНерез КАК ПризнакКодаЭмНерез,
	|	ВТ_ДанныеПоЭмитентам.КоличествоLEI КАК КоличествоLEI,
	|	ВТ_ДанныеПоЭмитентам.НетСоотвествияИННДляЦБРФ КАК НетСоотвествияИННДляЦБРФ,
	|	ВТ_ДанныеПоЭмитентам.ЭтоРезидентИлиНерезидентМК КАК ЭтоРезидентИлиНерезидентМК,
	|	ВТ_ДанныеПоЭмитентам.ПризнакРегистрацииМКНеЗаполнен КАК ПризнакРегистрацииМКНеЗаполнен
	|ИЗ
	|	ВТ_ДанныеПоЭмитентам КАК ВТ_ДанныеПоЭмитентам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоСчетамДепоМХ.МестоХранения КАК МестоХранения,
	|	МИНИМУМ(ВТ_ДанныеПоСчетамДепоМХ.ИНН_Орг) КАК ИНН_Орг,
	|	МИНИМУМ(ВТ_ДанныеПоСчетамДепоМХ.ОГРН_Орг) КАК ОГРН_Орг,
	|	МИНИМУМ(ВТ_ДанныеПоСчетамДепоМХ.КодСтр_Орг) КАК КодСтр_Орг
	|ИЗ
	|	ВТ_ДанныеПоСчетамДепоМХ КАК ВТ_ДанныеПоСчетамДепоМХ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеПоСчетамДепоМХ.МестоХранения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Данные для раздела 1.1
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоНоминальнымДержателям.ПризнакДК_ЮЛ КАК ПризнакДК_ЮЛ,							// 2
	|	ВТ_ДанныеПоНоминальнымДержателям.НаименованиеНоминальногоДержателя КАК НаименованиеДК,	// 3
	|	ВТ_ДанныеПоНоминальнымДержателям.ИНН_ДК КАК ИНН_ДК,										// 4
	|	ВТ_ДанныеПоНоминальнымДержателям.ПризнакКодаНерез КАК ПризнакКодаНерез,					// 5
	|	ВТ_ДанныеПоНоминальнымДержателям.TIN_ДК КАК TIN_ДК,										// 6
	|	ВТ_ДанныеПоНоминальнымДержателям.ОГРН_ДК КАК ОГРН_ДК,									// 7
	|	ВТ_ДанныеПоНоминальнымДержателям.КодСтр_ДК КАК КодСтр_ДК,								// 8
	|	ВТ_ДанныеПоНоминальнымДержателям.ПризнакДК КАК ПризнакДК,								// 9
	|	ВТ_ДанныеПоСчетамДепо.СчетДепоКод КАК НомСчета,											// 10
	|	ВТ_ДанныеПоЭмитентам.ПризнакЭм КАК ПризнакЭм,											// 11
	|	ВТ_НаименованияЭмитентовЦБ.НаименованиеЭм КАК НаименованиеЭм,							// 12
	|	ВТ_ДанныеПоЭмитентам.ИНН_Эм КАК ИНН_Эм,													// 13
	|	ВТ_ДанныеПоЭмитентам.ПризнакКодаЭмНерез КАК ПризнакКодаЭмНерез,							// 14
	|	ВТ_ДанныеПоЭмитентам.TIN_Эм КАК TIN_Эм,													// 15
	|	ВТ_ДанныеПоЭмитентам.ОГРН_Эм КАК ОГРН_Эм,												// 16
	|	ВТ_ДанныеПоЭмитентам.КодСтрЭм КАК КодСтрЭм,												// 17
	|	ВТ_ДанныеПоЦБ.КодТипаЦБ КАК КодТипаЦБ,													// 18
	|	ВТ_ДанныеПоЦБ.НомРегЦБ КАК НомРегЦБ,													// 19
	|	ВТ_ДанныеПоЦБ.ISIN КАК ISIN,															// 20
	|	ВТ_ДанныеПоЦБ.CFI КАК CFI,																// 21
	|	ВТ_ДанныеПоЦБ.КодВалК КАК КодВал,														// 22
	|	ВТ_ДанныеПоЦБ.НомСтоимЦБ КАК НомСтоимЦБ,												// 23
	|	СУММА(ВТ_Остатки.КоличествоОстаток) КАК КолЦБ,											// 24
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО В (&ТипыРазделовСОбременением)
	|					ИЛИ ВТ_Остатки.СтатусЦБ = ЗНАЧЕНИЕ(Перечисление.СтатусыЦБ.Блокирована)
	|					ИЛИ РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДепо.БлокированоРасчеты)
	|						И ВТ_ДанныеПоСчетамДепо.ТипСчетаДепо В (&ТипыСчетовДляБлокированоРасчеты)
	|					ИЛИ ВТ_ДанныеПоСчетамДепоМХ.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетовДепо.НоминальногоДержателяТорговый)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБОгрРаспрВсего,														// 25
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоВЗалоге)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБОгрРаспрЗалог,														// 26
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ДанныеПоСчетамДепо.ТипСчетаДепо В (&ТипыТорговыхСчетовДепо)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБОгрРаспрСчДепо,														// 27
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоКД)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБОгрРаспрКорпДейств,													// 28
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоЗапретОпераций)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБОгрРаспрЗапрОп,														// 29
	|	0 КАК КЦБСчетЭскроуАг,																	// 30
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоОбособленный)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБОсновФЗ_НПА,															// 31
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоОбособленныйПоПредписаниямБР)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБПредписЦБ,															// 32
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоПоАресту)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБОгрРаспрАрест,														// 33
	|	ВТ_ДанныеПоСчетамДепоМХ.ПризнакОргЮЛ КАК ПризнакОргЮЛ,									// 34
	|	ВТ_ДанныеПоСчетамДепоМХ.НаимОрг КАК НаимОрг,											// 35
	|	ВТ_ДанныеПоСчетамДепоМХ.ПризнакОрг КАК ПризнакОрг,										// 36
	|	ВТ_ДанныеПоСчетамДепоМХ.ИНН_Орг КАК ИНН_Орг,											// 37
	|	ВТ_ДанныеПоСчетамДепоМХ.ПризнакКодаОргНерез КАК ПризнакКодаОргНерез,					// 38
	|	ВТ_ДанныеПоСчетамДепоМХ.TIN_Орг КАК TIN_Орг,											// 39
	|	ВТ_ДанныеПоСчетамДепоМХ.ОГРН_Орг КАК ОГРН_Орг,											// 40
	|	ВТ_ДанныеПоСчетамДепоМХ.КодСтр_Орг КАК КодСтр_Орг,										// 41
	|	ВТ_ДанныеПоСчетамДепоМХ.СчетДепоМХКод КАК НомСчДепо,									// 42
	|	ВТ_ДанныеПоЭмитентам.ПримечаниеИНН
	|	+ ВЫБОР
	|		КОГДА ВТ_ДанныеПоЭмитентам.ПримечаниеИНН <> """" И ВТ_ДанныеПоНоминальнымДержателям.ПримечаниеИНН <> """"
	|			ТОГДА "". ""
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|	+ ВТ_ДанныеПоНоминальнымДержателям.ПримечаниеИНН КАК Примечание,						// 43
	|	ВТ_ДанныеПоЦБ.ЦБ КАК ЦБ,
	|	ВТ_ДанныеПоСчетамДепоМХ.МестоХранения КАК МестоХранения
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеПоНоминальнымДержателям КАК ВТ_ДанныеПоНоминальнымДержателям
	|		ПО (ВТ_ДанныеПоНоминальнымДержателям.НоминальныйДержатель = ВТ_Остатки.СчетДепо.Владелец)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаименованияЭмитентовЦБ КАК ВТ_НаименованияЭмитентовЦБ
	|		ПО ВТ_Остатки.ЦБ = ВТ_НаименованияЭмитентовЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоЭмитентам КАК ВТ_ДанныеПоЭмитентам
	|		ПО (ВТ_ДанныеПоЭмитентам.Эмитент = ВТ_НаименованияЭмитентовЦБ.Эмитент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоЦБ КАК ВТ_ДанныеПоЦБ
	|		ПО ВТ_Остатки.ЦБ = ВТ_ДанныеПоЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоСчетамДепо КАК ВТ_ДанныеПоСчетамДепо
	|		ПО ВТ_Остатки.СчетДепо = ВТ_ДанныеПоСчетамДепо.СчетДепо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
	|		ПО ВТ_Остатки.РазделСчетаДепо = РазделыСчетаДепо.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоСчетамДепоМХ КАК ВТ_ДанныеПоСчетамДепоМХ
	|		ПО ВТ_Остатки.СчетДепоМХ = ВТ_ДанныеПоСчетамДепоМХ.СчетДепоМХ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеПоНоминальнымДержателям.ПризнакДК_ЮЛ,
	|	ВТ_ДанныеПоНоминальнымДержателям.НаименованиеНоминальногоДержателя,
	|	ВТ_ДанныеПоНоминальнымДержателям.ИНН_ДК,
	|	ВТ_ДанныеПоНоминальнымДержателям.ПризнакКодаНерез,
	|	ВТ_ДанныеПоНоминальнымДержателям.TIN_ДК,
	|	ВТ_ДанныеПоНоминальнымДержателям.ОГРН_ДК,
	|	ВТ_ДанныеПоНоминальнымДержателям.КодСтр_ДК,
	|	ВТ_ДанныеПоНоминальнымДержателям.ПризнакДК,
	|	ВТ_ДанныеПоСчетамДепо.СчетДепоКод,
	|	ВТ_ДанныеПоЭмитентам.ПризнакЭм,
	|	ВТ_НаименованияЭмитентовЦБ.НаименованиеЭм,
	|	ВТ_ДанныеПоЭмитентам.ИНН_Эм,
	|	ВТ_ДанныеПоЭмитентам.ПризнакКодаЭмНерез,
	|	ВТ_ДанныеПоЭмитентам.TIN_Эм,
	|	ВТ_ДанныеПоЭмитентам.ОГРН_Эм,
	|	ВТ_ДанныеПоЭмитентам.КодСтрЭм,
	|	ВТ_ДанныеПоЦБ.КодТипаЦБ,
	|	ВТ_ДанныеПоЦБ.НомРегЦБ,
	|	ВТ_ДанныеПоЦБ.ISIN,
	|	ВТ_ДанныеПоЦБ.CFI,
	|	ВТ_ДанныеПоЦБ.КодВалК,
	|	ВТ_ДанныеПоЦБ.НомСтоимЦБ,
	|	ВТ_ДанныеПоСчетамДепо.ВидСчета,
	|	ВТ_ДанныеПоСчетамДепо.КодСекторЭк,
	|	ВТ_ДанныеПоСчетамДепо.КодСтрВладельца,
	|	ВТ_ДанныеПоСчетамДепоМХ.ПризнакОргЮЛ,
	|	ВТ_ДанныеПоСчетамДепоМХ.НаимОрг,
	|	ВТ_ДанныеПоСчетамДепоМХ.ПризнакОрг,
	|	ВТ_ДанныеПоСчетамДепоМХ.ИНН_Орг,
	|	ВТ_ДанныеПоСчетамДепоМХ.ПризнакКодаОргНерез,
	|	ВТ_ДанныеПоСчетамДепоМХ.TIN_Орг,
	|	ВТ_ДанныеПоСчетамДепоМХ.ОГРН_Орг,
	|	ВТ_ДанныеПоСчетамДепоМХ.КодСтр_Орг,
	|	ВТ_ДанныеПоСчетамДепоМХ.СчетДепоМХКод,
	|	ВТ_ДанныеПоЦБ.ЦБ,
	|	ВТ_ДанныеПоСчетамДепоМХ.МестоХранения,
	|	ВТ_ДанныеПоЭмитентам.ПримечаниеИНН
	|	+ ВЫБОР
	|		КОГДА ВТ_ДанныеПоЭмитентам.ПримечаниеИНН <> """" И ВТ_ДанныеПоНоминальнымДержателям.ПримечаниеИНН <> """"
	|			ТОГДА "". ""
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|	+ ВТ_ДанныеПоНоминальнымДержателям.ПримечаниеИНН
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеДК,
	|	НаимОрг,
	|	НаименованиеЭм,
	|	КодТипаЦБ,
	|	ISIN
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Данные для раздела 1.2
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоЭмитентам.ПризнакЭм КАК ПризнакЭм,						// 2
	|	ВТ_НаименованияЭмитентовЦБ.НаименованиеЭм КАК НаименованиеЭм,		// 3
	|	ВТ_ДанныеПоЭмитентам.ИНН_Эм КАК ИНН_Эм,								// 4
	|	ВТ_ДанныеПоЭмитентам.ПризнакКодаЭмНерез КАК ПризнакКодаЭмНерез,		// 5
	|	ВТ_ДанныеПоЭмитентам.TIN_Эм КАК TIN_Эм,								// 6
	|	ВТ_ДанныеПоЭмитентам.ОГРН_Эм КАК ОГРН_Эм,							// 7
	|	ВТ_ДанныеПоЭмитентам.КодСтрЭм КАК КодСтрЭм,							// 8
	|	ВТ_ДанныеПоЦБ.КодТипаЦБ КАК КодТипаЦБ,								// 9
	|	ВТ_ДанныеПоЦБ.НомРегЦБ КАК НомРегЦБ,								// 10
	|	ВТ_ДанныеПоЦБ.ISIN	КАК ISIN,										// 11
	|	ВТ_ДанныеПоЦБ.CFI КАК CFI,											// 12
	|	ВТ_ДанныеПоЦБ.КодВалК КАК КодВалК,									// 13
	|	ВТ_ДанныеПоЦБ.НомСтоимЦБ КАК НомСтоимЦБ,							// 14
	|	ВТ_ДанныеПоСчетамДепо.ВидСчета КАК ВидСчета,						// 15
	|	СУММА(ВТ_Остатки.КоличествоОстаток) КАК КолЦБ,						// 16
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО В (&ТипыРазделовСОбременением)
	|					ИЛИ ВТ_Остатки.СтатусЦБ = ЗНАЧЕНИЕ(Перечисление.СтатусыЦБ.Блокирована)
	|					ИЛИ РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДепо.БлокированоРасчеты)
	|						И ВТ_ДанныеПоСчетамДепо.ТипСчетаДепо В (&ТипыСчетовДляБлокированоРасчеты)
	|					ИЛИ ВТ_ДанныеПоСчетамДепоМХ.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетовДепо.НоминальногоДержателяТорговый)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБОбремВсего,										// 17
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоВЗалоге)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБОбремВЗалоге,										// 18
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ДанныеПоСчетамДепо.ТипСчетаДепо В (&ТипыТорговыхСчетовДепо)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБОбремСчДепо,										// 19
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоКД)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБОбремКорпДейст,									// 20
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоЗапретОпераций)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБОбремЗапретОп,									// 21
	|	0 КАК КЦБСчетЭскроуАг,												// 22
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоОбособленный)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБОсновФЗ_НПА,										// 23
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоОбособленныйПоПредписаниямБР)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБПредписЦБ,										// 24
	|	СУММА(ВЫБОР
	|			КОГДА РазделыСчетаДепо.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоПоАресту)
	|				ТОГДА ВТ_Остатки.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КЦБОбремАрест,										// 25
	|	ВТ_ДанныеПоСчетамДепо.КодСекторЭк КАК КодСекторЭк,					// 26
	|	ВТ_ДанныеПоСчетамДепо.КодСтрВладельца КАК КодСтрВладельца,			// 27
	|	ВТ_ДанныеПоСчетамДепоМХ.ПризнакОргЮЛ КАК ПризнакОргЮЛ,				// 28
	|	ВТ_ДанныеПоСчетамДепоМХ.НаимОрг КАК НаимОрг,						// 29
	|	ВТ_ДанныеПоСчетамДепоМХ.ПризнакОрг КАК ПризнакОрг,					// 30
	|	ВТ_ДанныеПоСчетамДепоМХ.ИНН_Орг КАК ИНН_Орг,						// 31
	|	ВТ_ДанныеПоСчетамДепоМХ.ПризнакКодаОргНерез КАК ПризнакКодаОргНерез,// 32
	|	ВТ_ДанныеПоСчетамДепоМХ.TIN_Орг КАК TIN_Орг,						// 33
	|	ВТ_ДанныеПоСчетамДепоМХ.ОГРН_Орг КАК ОГРН_Орг,						// 34
	|	ВТ_ДанныеПоСчетамДепоМХ.КодСтр_Орг КАК КодСтр_Орг,					// 35
	|	ВТ_ДанныеПоЭмитентам.ПримечаниеИНН КАК Примечание,					// 36
	|	ВТ_ДанныеПоЦБ.ЦБ КАК ЦБ,
	|	ВТ_ДанныеПоСчетамДепоМХ.МестоХранения КАК МестоХранения
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаименованияЭмитентовЦБ
	|		ПО ВТ_Остатки.ЦБ = ВТ_НаименованияЭмитентовЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоЭмитентам КАК ВТ_ДанныеПоЭмитентам
	|		ПО (ВТ_ДанныеПоЭмитентам.Эмитент = ВТ_НаименованияЭмитентовЦБ.Эмитент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоЦБ КАК ВТ_ДанныеПоЦБ
	|		ПО ВТ_Остатки.ЦБ = ВТ_ДанныеПоЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоСчетамДепо КАК ВТ_ДанныеПоСчетамДепо
	|		ПО ВТ_Остатки.СчетДепо = ВТ_ДанныеПоСчетамДепо.СчетДепо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
	|		ПО ВТ_Остатки.РазделСчетаДепо = РазделыСчетаДепо.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоСчетамДепоМХ КАК ВТ_ДанныеПоСчетамДепоМХ
	|		ПО ВТ_Остатки.СчетДепоМХ = ВТ_ДанныеПоСчетамДепоМХ.СчетДепоМХ
	|ГДЕ
	|	НЕ ВТ_Остатки.ЭтоСчетДепоНоминальногоДержателя
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеПоЭмитентам.ПризнакЭм,
	|	ВТ_НаименованияЭмитентовЦБ.НаименованиеЭм,
	|	ВТ_ДанныеПоЭмитентам.ИНН_Эм,
	|	ВТ_ДанныеПоЭмитентам.ПризнакКодаЭмНерез,
	|	ВТ_ДанныеПоЭмитентам.TIN_Эм,
	|	ВТ_ДанныеПоЭмитентам.ОГРН_Эм,
	|	ВТ_ДанныеПоЭмитентам.КодСтрЭм,
	|	ВТ_ДанныеПоЦБ.КодТипаЦБ,
	|	ВТ_ДанныеПоЦБ.НомРегЦБ,
	|	ВТ_ДанныеПоЦБ.ISIN,
	|	ВТ_ДанныеПоЦБ.CFI,
	|	ВТ_ДанныеПоЦБ.КодВалК,
	|	ВТ_ДанныеПоЦБ.НомСтоимЦБ,
	|	ВТ_ДанныеПоСчетамДепо.ВидСчета,
	|	ВТ_ДанныеПоСчетамДепо.КодСекторЭк,
	|	ВТ_ДанныеПоСчетамДепо.КодСтрВладельца,
	|	ВТ_ДанныеПоСчетамДепоМХ.ПризнакОргЮЛ,
	|	ВТ_ДанныеПоСчетамДепоМХ.НаимОрг,
	|	ВТ_ДанныеПоСчетамДепоМХ.ПризнакОрг,
	|	ВТ_ДанныеПоСчетамДепоМХ.ИНН_Орг,
	|	ВТ_ДанныеПоСчетамДепоМХ.ПризнакКодаОргНерез,
	|	ВТ_ДанныеПоСчетамДепоМХ.TIN_Орг,
	|	ВТ_ДанныеПоСчетамДепоМХ.ОГРН_Орг,
	|	ВТ_ДанныеПоСчетамДепоМХ.КодСтр_Орг,
	|	ВТ_ДанныеПоЦБ.ЦБ,
	|	ВТ_ДанныеПоСчетамДепоМХ.МестоХранения,
	|	ВТ_ДанныеПоЭмитентам.ПримечаниеИНН
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеЭм,
	|	ISIN,
	|	ВидСчета,
	|	КодСекторЭк,
	|	НаимОрг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Данные для раздела 1.2.1
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоЭмитентам.ПризнакЭм КАК ПризнакЭм,						// 2
	|	ВТ_НаименованияЭмитентовЦБ.НаименованиеЭм КАК НаименованиеЭм,		// 3
	|	ВТ_ДанныеПоЭмитентам.ИНН_Эм КАК ИНН_Эм,								// 4
	|	ВТ_ДанныеПоЭмитентам.ПризнакКодаЭмНерез КАК ПризнакКодаЭмНерез,		// 5
	|	ВТ_ДанныеПоЭмитентам.TIN_Эм КАК TIN_Эм,								// 6
	|	ВТ_ДанныеПоЭмитентам.ОГРН_Эм КАК ОГРН_Эм,							// 7
	|	ВТ_ДанныеПоЭмитентам.КодСтрЭм КАК КодСтрЭм,							// 8
	|	ВТ_ДанныеПоЦБ.КодТипаЦБ КАК КодТипаЦБ,								// 9
	|	ВТ_ДанныеПоЦБ.НомРегЦБ КАК НомРегЦБ,								// 10
	|	ВТ_ДанныеПоЦБ.ISIN	КАК ISIN,										// 11
	|	ВТ_ДанныеПоЦБ.CFI КАК CFI,											// 12
	|	ВТ_ДанныеПоЦБ.КодВалК КАК КодВал,									// 13
	|	ВТ_ДанныеПоЦБ.НомСтоимЦБ КАК НомСтоимЦБ,							// 14
	|	СУММА(ВТ_ОборотыПоВидамОпераций.КолПриемЦБ) КАК КолПриемЦБ,			// 15
	|	СУММА(ВТ_ОборотыПоВидамОпераций.ОбПриемЦБ) КАК ОбПриемЦБ,			// 16
	|	СУММА(ВТ_ОборотыПоВидамОпераций.КолСнятиеЦБ) КАК КолСнятиеЦБ,		// 17
	|	СУММА(ВТ_ОборотыПоВидамОпераций.ОбСнятиеЦБ) КАК ОбСнятиеЦБ,			// 18
	|	СУММА(ВТ_ОборотыПоВидамОпераций.КолПереводЦБ) КАК КолПереводЦБ,		// 19
	|	СУММА(ВТ_ОборотыПоВидамОпераций.ОбПереводЦБ) КАК ОбПереводЦБ,		// 20
	|	ВТ_ДанныеПоЭмитентам.ПримечаниеИНН КАК Примечание					// 21
	|ИЗ
	|	ВТ_ОборотыПоВидамОпераций КАК ВТ_ОборотыПоВидамОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаименованияЭмитентовЦБ КАК ВТ_НаименованияЭмитентовЦБ
	|		ПО ВТ_ОборотыПоВидамОпераций.ЦБ = ВТ_НаименованияЭмитентовЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоЭмитентам КАК ВТ_ДанныеПоЭмитентам
	|		ПО (ВТ_ДанныеПоЭмитентам.Эмитент = ВТ_НаименованияЭмитентовЦБ.Эмитент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоЦБ КАК ВТ_ДанныеПоЦБ
	|		ПО ВТ_ОборотыПоВидамОпераций.ЦБ = ВТ_ДанныеПоЦБ.ЦБ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеПоЭмитентам.ПризнакЭм,
	|	ВТ_НаименованияЭмитентовЦБ.НаименованиеЭм,
	|	ВТ_ДанныеПоЭмитентам.ИНН_Эм,
	|	ВТ_ДанныеПоЭмитентам.ПризнакКодаЭмНерез,
	|	ВТ_ДанныеПоЭмитентам.TIN_Эм,
	|	ВТ_ДанныеПоЭмитентам.ОГРН_Эм,
	|	ВТ_ДанныеПоЭмитентам.КодСтрЭм,
	|	ВТ_ДанныеПоЦБ.КодТипаЦБ,
	|	ВТ_ДанныеПоЦБ.НомРегЦБ,
	|	ВТ_ДанныеПоЦБ.ISIN,
	|	ВТ_ДанныеПоЦБ.CFI,
	|	ВТ_ДанныеПоЦБ.КодВалК,
	|	ВТ_ДанныеПоЦБ.НомСтоимЦБ,
	|	ВТ_ДанныеПоЭмитентам.ПримечаниеИНН
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеЭм,
	|	ISIN
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Данные для расшифровки к разделу 1.2.1
	|ВЫБРАТЬ
	|	""1234567"" КАК НомСтр,												// 1
	|	ВТ_ДанныеПоЭмитентам.ПризнакЭм КАК ПризнакЭм,						// 2
	|	ВТ_НаименованияЭмитентовЦБ.НаименованиеЭм КАК НаименованиеЭм,		// 3
	|	ВТ_ДанныеПоЭмитентам.ИНН_Эм КАК ИНН_Эм,								// 4
	|	ВТ_ДанныеПоЭмитентам.ПризнакКодаЭмНерез КАК ПризнакКодаЭмНерез,		// 5
	|	ВТ_ДанныеПоЭмитентам.TIN_Эм КАК TIN_Эм,								// 6
	|	ВТ_ДанныеПоЭмитентам.ОГРН_Эм КАК ОГРН_Эм,							// 7
	|	ВТ_ДанныеПоЭмитентам.КодСтрЭм КАК КодСтрЭм,							// 8
	|	ВТ_ДанныеПоЦБ.КодТипаЦБ КАК КодТипаЦБ,								// 9
	|	ВТ_ДанныеПоЦБ.НомРегЦБ КАК НомРегЦБ,								// 10
	|	ВТ_ДанныеПоЦБ.ISIN	КАК ISIN,										// 11
	|	ВТ_ДанныеПоЦБ.CFI КАК CFI,											// 12
	|	ВТ_ДанныеПоЦБ.КодВалК КАК КодВалК,									// 13
	|	ВТ_ДанныеПоЦБ.НомСтоимЦБ КАК НомСтоимЦБ,							// 14
	|	ВТ_ОборотыПоВидамОпераций.ОбПриемЦБ КАК ОбПриемЦБ,					// 15
	|	ВЫБОР
	|		КОГДА ВТ_ОборотыПоВидамОпераций.ОбПриемЦБ<>0
	|			ТОГДА ВТ_ОборотыПоВидамОпераций.Регистратор
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ОперацияЗачисления,										// 16
	|	ВТ_ОборотыПоВидамОпераций.ОбСнятиеЦБ КАК ОбСнятиеЦБ,				// 17
	|	ВЫБОР
	|		КОГДА ВТ_ОборотыПоВидамОпераций.ОбСнятиеЦБ<>0
	|			ТОГДА ВТ_ОборотыПоВидамОпераций.Регистратор
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ОперацияСписания,											// 18
	|	ВТ_ОборотыПоВидамОпераций.ОбПереводЦБ КАК ОбПереводЦБ,				// 19
	|	ВЫБОР
	|		КОГДА ВТ_ОборотыПоВидамОпераций.ОбПереводЦБ<>0
	|			ТОГДА ВТ_ОборотыПоВидамОпераций.Регистратор
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ОперацияПеревода										// 20
	|ИЗ
	|	ВТ_ОборотыПоВидамОпераций КАК ВТ_ОборотыПоВидамОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаименованияЭмитентовЦБ КАК ВТ_НаименованияЭмитентовЦБ
	|		ПО ВТ_ОборотыПоВидамОпераций.ЦБ = ВТ_НаименованияЭмитентовЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоЭмитентам КАК ВТ_ДанныеПоЭмитентам
	|		ПО (ВТ_ДанныеПоЭмитентам.Эмитент = ВТ_НаименованияЭмитентовЦБ.Эмитент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоЦБ КАК ВТ_ДанныеПоЦБ
	|		ПО ВТ_ОборотыПоВидамОпераций.ЦБ = ВТ_ДанныеПоЦБ.ЦБ
	|ГДЕ
	|	НЕ (ВТ_ОборотыПоВидамОпераций.ОбПриемЦБ=0
	|		И ВТ_ОборотыПоВидамОпераций.ОбСнятиеЦБ=0
	|		И ВТ_ОборотыПоВидамОпераций.ОбПереводЦБ=0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеЭм,
	|	ISIN,
	|	СтрокаДляСортировки
	|";
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("ОтчетнаяДата", ОтчетнаяДата);
	
	ТипыСчетовДепоНоминальногоДержателя = Новый Массив;
	ТипыСчетовДепоНоминальногоДержателя.Добавить(Перечисления.ТипыСчетовДЕПО.НоминальногоДержателя);
	ТипыСчетовДепоНоминальногоДержателя.Добавить(Перечисления.ТипыСчетовДЕПО.НоминальногоДержателяТорговый);
	ТипыСчетовДепоНоминальногоДержателя.Добавить(Перечисления.ТипыСчетовДЕПО.ИностранногоНоминальногоДержателя);
	ТипыСчетовДепоНоминальногоДержателя.Добавить(Перечисления.ТипыСчетовДЕПО.ИностранногоНоминальногоДержателяТорговый);
	Запрос.УстановитьПараметр("ТипыСчетовДепоНоминальногоДержателя", ТипыСчетовДепоНоминальногоДержателя);
	
	ДопустимыеВидыОпераций = Новый Массив;
	ДопустимыеВидыОпераций.Добавить(Справочники.ВидыОпераций.Перевод);
	ДопустимыеВидыОпераций.Добавить(Справочники.ВидыОпераций.Депонирование);
	ДопустимыеВидыОпераций.Добавить(Справочники.ВидыОпераций.СнятиеСДепонирования);
	Запрос.УстановитьПараметр("ДопустимыеВидыОпераций", ДопустимыеВидыОпераций);
	
	ТипыРазделовСОбременением = Новый Массив;
	ТипыРазделовСОбременением.Добавить(Перечисления.ТипыРазделовСчетовДЕПО.Торговый);
	ТипыРазделовСОбременением.Добавить(Перечисления.ТипыРазделовСчетовДЕПО.Обеспечения);
	ТипыРазделовСОбременением.Добавить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоКД);
	ТипыРазделовСОбременением.Добавить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоПоАресту);
	ТипыРазделовСОбременением.Добавить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоЗапретОпераций);
	ТипыРазделовСОбременением.Добавить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоОбособленный);
	ТипыРазделовСОбременением.Добавить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоОбособленныйПоПредписаниямБР);
	ТипыРазделовСОбременением.Добавить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоВЗалоге);
	ТипыРазделовСОбременением.Добавить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоИное);
	Запрос.УстановитьПараметр("ТипыРазделовСОбременением", ТипыРазделовСОбременением);
	
	ТипыСчетовДляБлокированоРасчеты = Новый Массив;
	ТипыСчетовДляБлокированоРасчеты.Добавить(Перечисления.ТипыСчетовДепо.ВладельцаТорговый);
	ТипыСчетовДляБлокированоРасчеты.Добавить(Перечисления.ТипыСчетовДепо.ДоверительногоУправляющегоТорговый);
	ТипыСчетовДляБлокированоРасчеты.Добавить(Перечисления.ТипыСчетовДепо.ИностранногоУполномоченногоДержателяТорговый);
	Запрос.УстановитьПараметр("ТипыСчетовДляБлокированоРасчеты", ТипыСчетовДляБлокированоРасчеты);
	
	ТипыТорговыхСчетовДепо = Новый Массив;
	ТипыТорговыхСчетовДепо.Добавить(Перечисления.ТипыСчетовДЕПО.ВладельцаТорговый);
	ТипыТорговыхСчетовДепо.Добавить(Перечисления.ТипыСчетовДЕПО.ДоверительногоУправляющегоТорговый);
	ТипыТорговыхСчетовДепо.Добавить(Перечисления.ТипыСчетовДЕПО.ИностранногоУполномоченногоДержателяТорговый);
	Запрос.УстановитьПараметр("ТипыТорговыхСчетовДепо", ТипыТорговыхСчетовДепо);
	
	Запрос.УстановитьПараметр("ТипыДепозитарныхРасписок", Перечисления.ТипыЦБ.ВсеТипыДепозитарныхРасписок());
	Запрос.УстановитьПараметр("ТипыЦББезНоминала", Перечисления.ТипыЦБ.ТипыЦББезНоминала());
	
	ВидыСчетовСектораЭк = Новый Массив;
	ВидыСчетовСектораЭк.Добавить("OWNER");
	ВидыСчетовСектораЭк.Добавить("DEPOPROG");
	ВидыСчетовСектораЭк.Добавить("TRUSTEE");
	ВидыСчетовСектораЭк.Добавить("HOLDER");
	ВидыСчетовСектораЭк.Добавить("FAUTHOLDER");
	ВидыСчетовСектораЭк.Добавить("SUBOWNER");
	ВидыСчетовСектораЭк.Добавить("SUBTRUSTEE");
	ВидыСчетовСектораЭк.Добавить("SUBFAUTHOLDER");
	ВидыСчетовСектораЭк.Добавить("ESCROW");
	Запрос.УстановитьПараметр("ВидыСчетовСектораЭк", ВидыСчетовСектораЭк);
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	ИндексПоследнегоЗапроса = РезультатПакета.Количество() - 1;
	ИндексВторогоЗапросаСКонца = ИндексПоследнегоЗапроса - 1;
	ИндексТретьегоЗапросаСКонца = ИндексВторогоЗапросаСКонца - 1;
	ИндексЧетвертогоЗапросаСКонца = ИндексТретьегоЗапросаСКонца - 1;
	ИндексПятогоЗапросаСКонца = ИндексЧетвертогоЗапросаСКонца - 1;
	ИндексШестогоЗапросаСКонца = ИндексПятогоЗапросаСКонца - 1;
	ИндексСедьмогоЗапросаСКонца = ИндексШестогоЗапросаСКонца - 1;
	ИндексВосьмогоЗапросаСКонца = ИндексСедьмогоЗапросаСКонца - 1;
	ИндексДевятогоЗапросаСКонца = ИндексВосьмогоЗапросаСКонца - 1;
	
	ОписаниеОшибок = "";
	ПроверитьДанныеМестХранения(РезультатПакета[ИндексПятогоЗапросаСКонца].Выгрузить());
	ПроверитьДанныеЭмитентов(РезультатПакета[ИндексШестогоЗапросаСКонца].Выгрузить());
	ПроверитьДанныеСчетовДЕПО(РезультатПакета[ИндексСедьмогоЗапросаСКонца].Выгрузить());
	ПроверитьДанныеЦБ(РезультатПакета[ИндексВосьмогоЗапросаСКонца].Выгрузить());
	ПроверитьДанныеНоминальныхДержателей(РезультатПакета[ИндексДевятогоЗапросаСКонца].Выгрузить());
	
	ДанныеПодраздела_1_1.Загрузить(РезультатПакета[ИндексЧетвертогоЗапросаСКонца].Выгрузить());
	РегуляторнаяОтчетность.ПронумероватьСтроки(ДанныеПодраздела_1_1);
	ДанныеПодраздела_1_2.Загрузить(РезультатПакета[ИндексТретьегоЗапросаСКонца].Выгрузить());
	РегуляторнаяОтчетность.ПронумероватьСтроки(ДанныеПодраздела_1_2);
	ДанныеПодраздела_1_2_1.Загрузить(РезультатПакета[ИндексВторогоЗапросаСКонца].Выгрузить());
	РегуляторнаяОтчетность.ПронумероватьСтроки(ДанныеПодраздела_1_2_1);
	ДанныеДляРасшифровки = РезультатПакета[ИндексПоследнегоЗапроса].Выгрузить();
	РегуляторнаяОтчетность.ПронумероватьСтроки(ДанныеДляРасшифровки);
КонецПроцедуры
// BSLLS:MethodSize-on

// Процедура выгружает сформированный отчет (данные в табличных частях отчета) в XML-файл
Процедура ВыгрузитьВXML() Экспорт
	ИмяФормы = "0409711";
	ПространствоИмен = "urn:cbr-ru:rep0409711:v7.0.4.5";
	
	// Осторожно! Схема хранимая в конфигурации модифицирована по сравнению с оригинальной
	СхемаXSD = ПолучитьМакет("Ф711_Schema_XSD");
	Фабрика = РегуляторнаяОтчетность.ФабрикаИзСхемыXSD(СхемаXSD);
	Отчетность = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409711"));
	
	УникИдОЭС = Новый УникальныйИдентификатор;
	Отчетность.УникИдОЭС = Строка(УникИдОЭС);	// Пример: "8b91f09d-da8b-11ed-811d-00155d1a3509";
	Отчетность.ВидОтчета = "КО";
	Отчетность.КодФормы = ИмяФормы;
	Отчетность.ОКУД = ИмяФормы;
	Отчетность.ВидОЭС = "Отчетность КО";
	Отчетность.Периодичность = "месячная";
	Отчетность.ДатаВремяФормирования = ТекущаяДатаСеанса();
	// BSLLS:Typo-off
	Отчетность.ОтчДата = ОтчетнаяДата;
	// BSLLS:Typo-on
	
	Отчетность.Составитель = СоставительОтчета(Фабрика, ПространствоИмен);
	
	Отчетность.Данные711 = Данные711(Фабрика, ПространствоИмен);
	
	РегуляторнаяОтчетность.ЗаписатьОтчетностьДляДельтыВXML(Фабрика, Отчетность, ИмяФормы, ПериодНачало, ПериодКонец);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Процедура осуществляет проверку данных эмитентов, упомянутых в отчете на соответествие схеме XSD.
// Например, проверяется ожидаемая длинна и состав символов ИНН и ОГРН ...
// Параметры:
//	ДанныеЭмитентов - ТаблицаЗначений
Процедура ПроверитьДанныеЭмитентов(ДанныеЭмитентов)
	ДлиныИНН = РегуляторнаяОтчетность.ДопустимыеДлиныИНН();
	ДлиныОГРН = РегуляторнаяОтчетность.ДопустимыеДлиныОГРН();
	
	Для каждого Данные Из ДанныеЭмитентов Цикл
		Если Не ЗначениеЗаполнено(Данные.Эмитент) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(Данные.ЮридическиеФизическиеЛица) Тогда
			ОписаниеОшибки = "Для эмитента " + Строка(Данные.Эмитент) + " не указано юридическое/физическое лицо";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		Принадлежность = "эмитента";
		РегуляторнаяОтчетность.ПроверитьЦифровуюСтроку(ОписаниеОшибок, "ИНН", Принадлежность, Данные.ИНН_Эм, Данные.Эмитент, ДлиныИНН);
		РегуляторнаяОтчетность.ПроверитьЦифровуюСтроку(ОписаниеОшибок, "ОГРН", Принадлежность, Данные.ОГРН_Эм, Данные.Эмитент, ДлиныОГРН);
		РегуляторнаяОтчетность.ПроверитьЦифровуюСтроку(ОписаниеОшибок, "Код страны", Принадлежность, Данные.КодСтрЭм, Данные.Эмитент, 3);
		Если Данные.ПризнакКодаЭмНерез = "LEI" И Данные.КоличествоLEI > 1 Тогда
			ОписаниеОшибки = "Для эмитента " + Строка(Данные.Эмитент) + " в справочнике кодов загрузки имеется более одного действующего кода LEI";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		Если Данные.НетСоотвествияИННДляЦБРФ Тогда
			ОписаниеОшибки = "Для ЮЛ [" + Строка(Данные.Эмитент) + "] не найдено соответствие в справочнике ИНН и ОРГН ЦБ РФ";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		Если Данные.ИНН_Эм = "0000000000" Тогда
			ОписаниеОшибки = "У эмитента " + Строка(Данные.Эмитент) + " отсутствует ИНН";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		Если Данные.ЭтоРезидентИлиНерезидентМК И Данные.ОГРН_Эм = "" Тогда
			ОписаниеОшибки = "У эмитента " + Строка(Данные.Эмитент) + " отсутствует ОГРН";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		Если Данные.ПризнакРегистрацииМКНеЗаполнен Тогда
			ОписаниеОшибки = "Для ЮЛ [" + Строка(Данные.Эмитент)
				+ "] не заполнен ""Признак регистрации международной компании""";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьДанныеНоминальныхДержателей(ДанныеНоминальныхДержателей)
	ДлиныИНН = РегуляторнаяОтчетность.ДопустимыеДлиныИНН();
	ДлиныОГРН = РегуляторнаяОтчетность.ДопустимыеДлиныОГРН();
	
	Для каждого Данные Из ДанныеНоминальныхДержателей Цикл
		Принадлежность = "номинального держателя";
		РегуляторнаяОтчетность.ПроверитьЦифровуюСтроку(ОписаниеОшибок, "ИНН", Принадлежность, Данные.ИНН_ДК,
			Данные.НоминальныйДержатель, ДлиныИНН);
		РегуляторнаяОтчетность.ПроверитьЦифровуюСтроку(ОписаниеОшибок, "ОГРН", Принадлежность, Данные.ОГРН_ДК,
			Данные.НоминальныйДержатель, ДлиныОГРН);
		Если Данные.НетСоотвествияИННДляЦБРФ Тогда
			ОписаниеОшибки = "Для номинального держателя [" + Строка(Данные.НоминальныйДержатель)
				+ "] не найдено соответствие в справочнике ИНН и ОРГН ЦБ РФ";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		Если Данные.ИНН_ДК = "0000000000" Тогда
			ОписаниеОшибки = "У номинального держателя " + Строка(Данные.НоминальныйДержатель) + " отсутствует ИНН";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		Если Данные.Резидент И Данные.ОГРН_ДК = "" Тогда
			ОписаниеОшибки = "У номинального держателя " + Строка(Данные.НоминальныйДержатель) + " отсутствует ОГРН";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьДанныеЦБ(ДанныеЦБ)
	Для каждого Данные Из ДанныеЦБ Цикл
		Если Не Данные.ЦББезНоминала Тогда
			Если Не ЗначениеЗаполнено(Данные.НомСтоимЦБ) Тогда
				ОписаниеОшибки = РегуляторнаяОтчетность.ОписаниеОшибкиЦБ(Данные.ЦБ, "не указан номинал", Данные.ISIN);
				РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Данные.ВалютаНоминала) Тогда
				ОписаниеОшибки = РегуляторнаяОтчетность.ОписаниеОшибкиЦБ(Данные.ЦБ, "не указана валюта номинала", Данные.ISIN);
				РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
			КонецЕсли;
		КонецЕсли;
		Если Данные.ЭтоДепозитарнаяРасписка И Не ЗначениеЗаполнено(Данные.БазовыйАктив) Тогда
			ОписаниеОшибки = РегуляторнаяОтчетность.ОписаниеОшибкиЦБ(Данные.ЦБ, "не указан базовый актив", Данные.ISIN);
				РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Данные.Эмитент) Тогда
			ОписаниеОшибки = РегуляторнаяОтчетность.ОписаниеОшибкиЦБ(Данные.ЦБ, "не указан эмитент", Данные.ISIN);
				РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьДанныеМестХранения(ДанныеМестХранения)
	Для каждого Данные Из ДанныеМестХранения Цикл
		Принадлежность = "места хранения";
		РегуляторнаяОтчетность.ПроверитьЦифровуюСтроку(ОписаниеОшибок, "ИНН", Принадлежность, Данные.ИНН_Орг, Данные.МестоХранения, 10);
		РегуляторнаяОтчетность.ПроверитьЦифровуюСтроку(ОписаниеОшибок, "ОГРН", Принадлежность, Данные.ОГРН_Орг, Данные.МестоХранения, 13);
		РегуляторнаяОтчетность.ПроверитьЦифровуюСтроку(ОписаниеОшибок, "Код страны", Принадлежность, Данные.КодСтр_Орг, Данные.МестоХранения, 3);
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьДанныеСчетовДЕПО(ДанныеСчетовДЕПО)
	Для каждого Данные Из ДанныеСчетовДЕПО Цикл
		Если Данные.КодСтрВладельца <> "643" И Данные.КодСекторЭк <> "S2" Тогда
			ОписаниеОшибки = "У владельца счета ДЕПО " + СокрЛП(Строка(Данные.СчетДепо)) + " (" + Строка(Данные.СчетДепо.Владелец) + ") "
								+ " код страны " + Строка(Данные.КодСтрВладельца) + ", а код сектора экономики при этом " + Строка(Данные.КодСекторЭк);
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Данные.КодСекторЭк) Тогда
			ОписаниеОшибки = "У депонента [" + СокрЛП(Данные.СчетДепо.Владелец.Код) + "] [" + Строка(Данные.СчетДепо.Владелец) + "] "
								+ " не заполнен Тип депонента (Сектор экономики)";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		Если Данные.ПризнакРегистрацииМКНеЗаполнен Тогда
			ОписаниеОшибки = "Для ЮЛ [" + Строка(Данные.СчетДепо.Владелец)
				+ "] не заполнен ""Признак регистрации международной компании""";
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция СоставительОтчета(Фабрика, ПространствоИмен)
	Составитель = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409711Составитель"));
	
	Составитель.Руководитель = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409711СоставительРуководитель"));
	РегуляторнаяОтчетность.ЗаполнитьИнформациюОбОтветственномЛице(Составитель.Руководитель, Организация,
								Перечисления.ОтветственныеЛицаОрганизаций.ПодписантВРегуляторнойОтчетности, ОтчетнаяДата);
	
	Составитель.Исполнитель = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409711СоставительИсполнитель"));
	РегуляторнаяОтчетность.ЗаполнитьИнформациюОбОтветственномЛице(Составитель.Исполнитель, Организация,
								Перечисления.ОтветственныеЛицаОрганизаций.ИсполнительВРегуляторнойОтчетности, ОтчетнаяДата);
	
	РегуляторнаяОтчетность.ЗаполнитьИнформациюОбОрганизации(Составитель, Организация, ОтчетнаяДата);
	
	Возврат Составитель;
КонецФункции

Функция Данные711(Фабрика, ПространствоИмен)
	Данные711 = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409711Данные711"));
	Данные711.Ид = "1";
	Данные711.ДатаОперДня = НачалоДня(ТекущаяДатаСеанса());
	
	Данные711.Подраздел1_1 = Подраздел1_1(Фабрика, ПространствоИмен);
	Данные711.Подраздел1_2 = Подраздел1_2(Фабрика, ПространствоИмен);
	Данные711.Подраздел1_2_1 = Подраздел1_2_1(Фабрика, ПространствоИмен);
	
	Возврат Данные711;
КонецФункции

Функция Подраздел1_1(Фабрика, ПространствоИмен)
	Подраздел1_1 = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409711Данные711Подраздел1.1"));
	
	// BSLLS:Typo-off
	СписокРеквизитовСЧислами20Знаков = "НомСтоимЦБ,КолЦБ,КЦБОгрРаспрВсего,КЦБОгрРаспрЗалог,КЦБОгрРаспрСчДепо,КЦБОгрРаспрКорпДейств"
										+ ",КЦБОгрРаспрЗапрОп,КЦБСчетЭскроуАг,КЦБОсновФЗ_НПА,КЦБПредписЦБ,КЦБОгрРаспрАрест";
	// BSLLS:Typo-on
	РеквизитыСЧислами20Знаков = СтрРазделить(СписокРеквизитовСЧислами20Знаков, ",");
	
	Для каждого СтрокаТЧ Из ДанныеПодраздела_1_1 Цикл
		
		// BSLLS:Typo-off
		СтрокаПодраздела = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409711Данные711Подраздел1.1ЦБнаСчДепоНД"));
		// BSLLS:Typo-on
		
		ЗаполнитьОбщиеДляПодразделовРеквизиты(СтрокаПодраздела, СтрокаТЧ);
		
		// Осторожно! Схема хранимая в конфигурации модифицирована по сравнению с оригинальной:
		// в разделах "Ф0409711Данные711Подраздел1.1ЦБнаСчДепоНД", "Ф0409711Данные711Подраздел1.2ЦБнаСчДепо"
		// и "Ф0409711Данные711Подраздел1.2.1ДепОперЦБ" тип атрибутов Десят30.20Неотриц-лок заменен "Строка30-лок"
		// Это потребовалось, чтобы все числа можно было выгрузить в файл дополненными до 20 нулей после запятой
		ЗаполнитьРеквизитыВФормате20ЗнаковПослеЗапятой(СтрокаПодраздела, СтрокаТЧ, РеквизитыСЧислами20Знаков);
		
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ПризнакДК_ЮЛ, СтрокаТЧ.ПризнакДК_ЮЛ);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.НаименованиеДК, СтрокаТЧ.НаименованиеДК);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ИНН_ДК, СтрокаТЧ.ИНН_ДК);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ПризнакКодаНерез, СтрокаТЧ.ПризнакКодаНерез);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.TIN_ДК, СтрокаТЧ.TIN_ДК);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ОГРН_ДК, СтрокаТЧ.ОГРН_ДК);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.КодСтр_ДК, СтрокаТЧ.КодСтр_ДК);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ПризнакДК, СтрокаТЧ.ПризнакДК);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.НомСчета, СтрокаТЧ.НомСчета);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.КодТипаЦБ, СтрокаТЧ.КодТипаЦБ);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.НомРегЦБ, СтрокаТЧ.НомРегЦБ);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ISIN, СтрокаТЧ.ISIN);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.CFI, СтрокаТЧ.CFI);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.КодВал, СтрокаТЧ.КодВал);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ПризнакОргЮЛ, СтрокаТЧ.ПризнакОргЮЛ);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.НаимОрг, СтрокаТЧ.НаимОрг);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ПризнакОрг, СтрокаТЧ.ПризнакОрг);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ИНН_Орг, СтрокаТЧ.ИНН_Орг);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ПризнакКодаОргНерез, СтрокаТЧ.ПризнакКодаОргНерез);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.TIN_Орг, СтрокаТЧ.TIN_Орг);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ОГРН_Орг, СтрокаТЧ.ОГРН_Орг);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.КодСтр_Орг, СтрокаТЧ.КодСтр_Орг);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.НомСчДепо, СтрокаТЧ.НомСчДепо);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.Примечание, СтрокаТЧ.Примечание);
		
		Подраздел1_1.ЦБнаСчДепоНД.Добавить(СтрокаПодраздела);
	КонецЦикла;
	
	Возврат Подраздел1_1;
КонецФункции

Функция Подраздел1_2(Фабрика, ПространствоИмен)
	Подраздел1_2 = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409711Данные711Подраздел1.2"));
	
	// BSLLS:Typo-off
	СписокРеквизитовСЧислами20Знаков = "НомСтоимЦБ,КолЦБ,КЦБОбремВсего,КЦБОбремВЗалоге,КЦБОбремСчДепо,КЦБОбремКорпДейст"
										+ ",КЦБОбремЗапретОп,КЦБСчетЭскроуАг,КЦБОсновФЗ_НПА,КЦБПредписЦБ,КЦБОбремАрест";
	// BSLLS:Typo-on
	РеквизитыСЧислами20Знаков = СтрРазделить(СписокРеквизитовСЧислами20Знаков, ",");
	
	Для каждого СтрокаТЧ Из ДанныеПодраздела_1_2 Цикл
		
		// BSLLS:Typo-off
		СтрокаПодраздела = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409711Данные711Подраздел1.2ЦБнаСчДепо"));
		// BSLLS:Typo-on
		
		ЗаполнитьОбщиеДляПодразделовРеквизиты(СтрокаПодраздела, СтрокаТЧ);
		
		// Осторожно! Схема хранимая в конфигурации модифицирована по сравнению с оригинальной:
		// в разделах "Ф0409711Данные711Подраздел1.1ЦБнаСчДепоНД", "Ф0409711Данные711Подраздел1.2ЦБнаСчДепо"
		// и "Ф0409711Данные711Подраздел1.2.1ДепОперЦБ" тип атрибутов Десят30.20Неотриц-лок заменен "Строка30-лок"
		// Это потребовалось, чтобы все числа можно было выгрузить в файл дополненными до 20 нулей после запятой
		ЗаполнитьРеквизитыВФормате20ЗнаковПослеЗапятой(СтрокаПодраздела, СтрокаТЧ, РеквизитыСЧислами20Знаков);
		
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.КодВалК, СтрокаТЧ.КодВалК);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ВидСчета, СтрокаТЧ.ВидСчета);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.КодСекторЭк, СтрокаТЧ.КодСекторЭк);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.КодСтрВладельца, СтрокаТЧ.КодСтрВладельца);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ПризнакОргЮЛ, СтрокаТЧ.ПризнакОргЮЛ);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.НаимОрг, СтрокаТЧ.НаимОрг);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ПризнакОрг, СтрокаТЧ.ПризнакОрг);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ИНН_Орг, СтрокаТЧ.ИНН_Орг);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ПризнакКодаОргНерез, СтрокаТЧ.ПризнакКодаОргНерез);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.TIN_Орг, СтрокаТЧ.TIN_Орг);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.ОГРН_Орг, СтрокаТЧ.ОГРН_Орг);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.КодСтр_Орг, СтрокаТЧ.КодСтр_Орг);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаПодраздела.Примечание, СтрокаТЧ.Примечание);
		
		Подраздел1_2.ЦБнаСчДепо.Добавить(СтрокаПодраздела);
	КонецЦикла;
	
	Возврат Подраздел1_2;
КонецФункции

Функция Подраздел1_2_1(Фабрика, ПространствоИмен)
	Подраздел1_2_1 = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409711Данные711Подраздел1.2.1"));
	РеквизитыСЧислами = "КолПриемЦБ, КолСнятиеЦБ, КолПереводЦБ";
	СписокРеквизитовСЧислами20Знаков = "НомСтоимЦБ,ОбПриемЦБ,ОбСнятиеЦБ,ОбПереводЦБ";
	РеквизитыСЧислами20Знаков = СтрРазделить(СписокРеквизитовСЧислами20Знаков, ",");
	
	Для каждого СтрокаТЧ Из ДанныеПодраздела_1_2_1 Цикл
		СтрокаДепОперЦБ = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409711Данные711Подраздел1.2.1ДепОперЦБ"));
		ЗаполнитьОбщиеДляПодразделовРеквизиты(СтрокаДепОперЦБ, СтрокаТЧ);
		ЗаполнитьЗначенияСвойств(СтрокаДепОперЦБ, СтрокаТЧ, РеквизитыСЧислами);
		
		// Осторожно! Схема хранимая в конфигурации модифицирована по сравнению с оригинальной:
		// в разделах "Ф0409711Данные711Подраздел1.1ЦБнаСчДепоНД", "Ф0409711Данные711Подраздел1.2ЦБнаСчДепо"
		// и "Ф0409711Данные711Подраздел1.2.1ДепОперЦБ" тип атрибутов Десят30.20Неотриц-лок заменен "Строка30-лок"
		// Это потребовалось, чтобы все числа можно было выгрузить в файл дополненными до 20 нулей после запятой
		ЗаполнитьРеквизитыВФормате20ЗнаковПослеЗапятой(СтрокаДепОперЦБ, СтрокаТЧ, РеквизитыСЧислами20Знаков);
		
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаДепОперЦБ.КодВал, СтрокаТЧ.КодВал);
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаДепОперЦБ.Примечание, СтрокаТЧ.Примечание);
		
		Подраздел1_2_1.ДепОперЦБ.Добавить(СтрокаДепОперЦБ);
	КонецЦикла;
	
	Возврат Подраздел1_2_1;
КонецФункции

Процедура ЗаполнитьОбщиеДляПодразделовРеквизиты(СтруктураXDTO, СтрокаТЧ)
	СтруктураXDTO.НомСтр = Формат(СтрокаТЧ.НомСтр, "ЧГ=0");
	
	РегуляторнаяОтчетность.ПрисвоитьНепустое(СтруктураXDTO.ПризнакЭм, СтрокаТЧ.ПризнакЭм);
	РегуляторнаяОтчетность.ПрисвоитьНепустое(СтруктураXDTO.НаименованиеЭм, СтрокаТЧ.НаименованиеЭм);
	РегуляторнаяОтчетность.ПрисвоитьНепустое(СтруктураXDTO.ИНН_Эм, СтрокаТЧ.ИНН_Эм);
	РегуляторнаяОтчетность.ПрисвоитьНепустое(СтруктураXDTO.ПризнакКодаЭмНерез, СтрокаТЧ.ПризнакКодаЭмНерез);
	РегуляторнаяОтчетность.ПрисвоитьНепустое(СтруктураXDTO.TIN_Эм, СтрокаТЧ.TIN_Эм);
	РегуляторнаяОтчетность.ПрисвоитьНепустое(СтруктураXDTO.ОГРН_Эм, СтрокаТЧ.ОГРН_Эм);
	РегуляторнаяОтчетность.ПрисвоитьНепустое(СтруктураXDTO.КодСтрЭм, СтрокаТЧ.КодСтрЭм);
	РегуляторнаяОтчетность.ПрисвоитьНепустое(СтруктураXDTO.КодТипаЦБ, СтрокаТЧ.КодТипаЦБ);
	РегуляторнаяОтчетность.ПрисвоитьНепустое(СтруктураXDTO.НомРегЦБ, СтрокаТЧ.НомРегЦБ);
	РегуляторнаяОтчетность.ПрисвоитьНепустое(СтруктураXDTO.ISIN, СтрокаТЧ.ISIN);
	РегуляторнаяОтчетность.ПрисвоитьНепустое(СтруктураXDTO.CFI, СтрокаТЧ.CFI);
КонецПроцедуры

Процедура ЗаполнитьРеквизитыВФормате20ЗнаковПослеЗапятой(СтруктураXDTO, СтрокаТЧ, РеквизитыСЧислами20Знаков)
	ФорматЧисла = "ЧЦ=38; ЧДЦ=20; ЧРД=.; ЧН=; ЧГ=";
	Для Каждого ИмяРеквизита Из РеквизитыСЧислами20Знаков Цикл
		Если ИмяРеквизита <> "НомСтоимЦБ" Или ЗначениеЗаполнено(СтрокаТЧ.НомСтоимЦБ) Тогда
			СтруктураXDTO[ИмяРеквизита] = Формат(СтрокаТЧ[ИмяРеквизита], ФорматЧисла);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область Инициализация

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);

#КонецОбласти