
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
        Возврат;
	КонецЕсли;
	
	ПроверкаУникальностиПериода(Отказ);
	
КонецПроцедуры

Процедура ПроверкаУникальностиПериода(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПериодыДляВычисленияМетрик.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПериодыДляВычисленияМетрик КАК ПериодыДляВычисленияМетрик
		|ГДЕ
		|	ПериодыДляВычисленияМетрик.Ссылка <> &Ссылка
		|	И ПериодыДляВычисленияМетрик.Длительность = &Длительность";
	
	Запрос.УстановитьПараметр("Длительность", Длительность);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Текст = "В системе уже есть период с такой длительностью: <" + ВыборкаДетальныеЗаписи.Ссылка + ">";
		ОбщегоНазначения.СообщитьОбОшибке(Текст, Отказ);
	КонецЦикла;

КонецПроцедуры
