
// Заполняет реквизиты обработки, необходимые для её работы.
//
Процедура Инициализировать() Экспорт
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.КаталогАгрегированныхРаскрытийНРД;
	ПутьКФайлам = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Папка;
КонецПроцедуры
	
// Заполняет табличную часть именами найденных файлов НРД.
//
Процедура НайтиФайлыНРД() Экспорт
	Файлы.Очистить();
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	ФайлыНРД = НайтиФайлы(ПутьКФайлам, МаскаПоискаФайлов());
	Для Каждого Файл Из ФайлыНРД Цикл
		Строка = Файлы.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Файл);
		Строка.ДатаИзменения = Файл.ПолучитьВремяИзменения();
		ДатаВыгрузки = Сред(Файл.Имя, Найти(Файл.Имя, "_")+1);
		Строка.ДатаВыгрузки = Сред(ДатаВыгрузки, 5, 4)+Сред(ДатаВыгрузки, 3, 2)+Лев(ДатаВыгрузки, 2);
	КонецЦикла;
	Файлы.Сортировать("ДатаВыгрузки,ДатаИзменения");
КонецПроцедуры

// Определяет маску имени файлов Excel, присылаемых НРД.
//
// Параметры:
//  Дата - Дата (необязательный)	 - Дата без времени, определяющая конкретный файл. Если не заполнена, то вернётся маска для поиска файлов.
// 
// Возвращаемое значение:
//  Строка - Маска для поиска одного или нескольких файлов (в зависимости от заполненности параметра Дата)
//
Функция МаскаПоискаФайлов(Дата = Неопределено) Экспорт
	Возврат "TAX02929_"+?(Дата = Неопределено, "*", Формат(Дата, "ДФ=ddMMyyyy")+".xlsx");
КонецФункции

// Загружает в регистр данные файлов НРД, перечисленных в табличной части, и переносит файлы в архив.
//
Процедура ОбработатьНайденныеФайлы() Экспорт
	ПутьКФайлам = СокрП(ПутьКФайлам);
	Если Прав(ПутьКФайлам, 1) <> "\" Тогда
		ПутьКФайлам = ПутьКФайлам + "\";
	КонецЕсли;
	СоздатьКаталог(ПутьКФайлам + "ARCHIVE");
	Для Каждого Файл Из Файлы Цикл
		ОбработатьФайл(Файл.Путь, Файл.Имя);
	КонецЦикла;
КонецПроцедуры

// Загружает в регистр данные указанного файла НРД и переносит его в аржив.
//
// Параметры:
//  ПутьКФайлу	 - Строка	 - Каталог, где лежит файл.
//  ИмяФайла	 - Строка	 - Имя файла с расирением.
//
Процедура ОбработатьФайл(ПутьКФайлу, ИмяФайла) Экспорт
	ДанныеНРД = НоваяТаблицаДанныхНРД();
	ПрочитатьДанныеExcelФайлаВТаблицу(ПутьКФайлу+ИмяФайла, ДанныеНРД);
	ДанныеНРД.Сортировать("ДатаПриема");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеНРД", ДанныеНРД);
	Запрос.Текст = ТекстЗапросаСравненияСРегистром();
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		Попытка
			Если Не ЗначениеЗаполнено(Выборка.Пакет) И ЗначениеЗаполнено(Выборка.ТехническаяОперация) Тогда
				ВходящийПакет = СсылкаНаВходящийПакет(Выборка, ПутьКФайлу, ИмяФайла);
			Иначе
				ВходящийПакет = Неопределено;
			КонецЕсли;
			ЗаписатьДанныеВРегистр(Выборка, ИмяФайла, ВходящийПакет);
			ЗафиксироватьТранзакцию();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЦикла;
	ПереместитьФайл(ПутьКФайлу + ИмяФайла, ПутьКФайлу + "ARCHIVE\" + ИмяФайла);
КонецПроцедуры

// Создаёт пустую таблицу с колонками, требуемыми для сверки раскрытий с НРД
// 
// Возвращаемое значение:
//  Таблица значений - пустая таблица с настроенными колонками
//
Функция НоваяТаблицаДанныхНРД() Экспорт
	ДанныеНРД = Новый ТаблицаЗначений;
	Строка = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000, ДопустимаяДлина.Переменная));
	ДанныеНРД.Колонки.Добавить("ТипКД", Строка, "Тип КД");
	ДанныеНРД.Колонки.Добавить("РеференсКД", Строка, "Референс КД");
	ДанныеНРД.Колонки.Добавить("Раздел", Строка);
	ДанныеНРД.Колонки.Добавить("ISIN", Строка);
	ДанныеНРД.Колонки.Добавить("НаименованиеЦБ", Строка, "Наименование цб");
	ДанныеНРД.Колонки.Добавить("Состояние", Строка, "Состояние раскрытия");
	Дата = Новый ОписаниеТипов("Дата");
	ДанныеНРД.Колонки.Добавить("ДатаФиксации", Дата, "Дата фиксации");
	ДанныеНРД.Колонки.Добавить("ДатаПриема", Дата, "Дата приема");
	Число = Новый ОписаниеТипов("Число");
	ДанныеНРД.Колонки.Добавить("ОстатокЦБ", Число, "Остаток цб на дату фиксации");
	ДанныеНРД.Колонки.Добавить("РаскрытоЦБ", Число, "Раскрытое к-во цб");
	Возврат ДанныеНРД;
КонецФункции

// Считывает необходимые данные из таблицы Excel, присланной НРД
//
// Параметры:
//  ПолноеИмяФайла	 - Строка			 - путь и имя файла, данные которого необходимо прочитать.
//  Данные			 - ТаблицаЗначений	 - приемник прочитанных данных. 
//
//Колонки таблицы определяют состав считываемых данных. Если в файле не найдено соответствующей колонки, она не будет заполняться.
//
Процедура ПрочитатьДанныеExcelФайлаВТаблицу(ПолноеИмяФайла, Данные) Экспорт
	Таблица = Новый ТабличныйДокумент;
	Таблица.Прочитать(ПолноеИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст);
	НомераКолонокВТаблице = КолонкиТаблицыНРД(Данные, Таблица);
	НомерПервойСтрокиДанных = 2;
	Для НомерСтроки = НомерПервойСтрокиДанных По Таблица.ВысотаТаблицы Цикл
		Если ПустаяСтрока(Таблица.Область(НомерСтроки, , НомерСтроки).Текст) Тогда
			Прервать;
		КонецЕсли;
		Строка = Данные.Добавить();
		Для Каждого НомерКолонки Из НомераКолонокВТаблице Цикл
			Область = Таблица.Область(НомерСтроки, НомерКолонки.Значение);
			Если ТипЗнч(Строка[НомерКолонки.Ключ]) = Тип("Дата") Тогда
				Строка[НомерКолонки.Ключ] = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("-  :", Лев(Область.Текст, 19), "");
			Иначе
				Строка[НомерКолонки.Ключ] = СокрЛП(Область.Текст);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция КолонкиТаблицыНРД(Данные, Таблица, НомерСтроки = 1)
	Колонки = Новый Структура;
	ШиринаТаблицы = Таблица.ШиринаТаблицы;
	Для НомерКолонки = 1 По Таблица.ШиринаТаблицы Цикл
		ТекстОбласти = ВРег(СокрЛП(Таблица.Область(НомерСтроки, НомерКолонки).Текст));
		Для Каждого Колонка Из Данные.Колонки Цикл
			ЗаголовокКолонки = ВРег(?(ПустаяСтрока(Колонка.Заголовок), Колонка.Имя, Колонка.Заголовок));
			Если ТекстОбласти = ЗаголовокКолонки Тогда
				Колонки.Вставить(Колонка.Имя, НомерКолонки);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Колонки;
КонецФункции

Функция ТекстЗапросаСравненияСРегистром()
	Возврат 
	"ВЫБРАТЬ
	|	ДанныеНРД.ISIN КАК ISIN,
	|	ДанныеНРД.ТипКД КАК ТипКД,
	|	ДанныеНРД.РеференсКД КАК РеференсКД,
	|	ДанныеНРД.ДатаФиксации КАК ДатаФиксации,
	|	ДанныеНРД.ДатаПриема КАК ДатаПриема,
	|	ДанныеНРД.Раздел КАК Раздел,
	|	ДанныеНРД.Состояние КАК Состояние,
	|	ДанныеНРД.ОстатокЦБ КАК ОстатокЦБ,
	|	ДанныеНРД.РаскрытоЦБ КАК РаскрытоЦБ
	|ПОМЕСТИТЬ втДанныеНРД
	|ИЗ
	|	&ДанныеНРД КАК ДанныеНРД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеНРД.ISIN КАК ISIN,
	|	ДанныеНРД.ТипКД КАК ТипКД,
	|	ДанныеНРД.РеференсКД КАК РеференсКД,
	|	ДанныеНРД.ДатаФиксации КАК ДатаФиксации,
	|	ДанныеНРД.ДатаПриема КАК ДатаПриема,
	|	ДанныеНРД.Раздел КАК Раздел,
	|	ДанныеНРД.Состояние КАК Состояние,
	|	ДанныеНРД.ОстатокЦБ КАК ОстатокЦБ,
	|	ДанныеНРД.РаскрытоЦБ КАК РаскрытоЦБ,
	|	ВыгрузкаРазделаРСВвВышестоящийДепозитарий.РаскрытиеСпискаВладельцев КАК Раскрытие,
	|	ВыгрузкаРазделаРСВвВышестоящийДепозитарий.Ссылка КАК Выгрузка,
	|	ТехническаяОперация.Ссылка КАК ТехническаяОперация,
	|	ПодтвержденияРСВ.Пакет КАК Пакет,
	|	ВЫБОР
	|		КОГДА ПодтвержденияРСВ.Состояние ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НоваяЗапись
	|ИЗ
	|	втДанныеНРД КАК ДанныеНРД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыгрузкаРазделаРСВвВышестоящийДепозитарий КАК ВыгрузкаРазделаРСВвВышестоящийДепозитарий
	|		ПО ДанныеНРД.Раздел = ВыгрузкаРазделаРСВвВышестоящийДепозитарий.РазделСчетаДепоМХ.Код
	|			И ДанныеНРД.ISIN = ВыгрузкаРазделаРСВвВышестоящийДепозитарий.РаскрытиеСпискаВладельцев.ЦеннаяБумага1.ISIN
	|			И ДанныеНРД.ТипКД = ВыгрузкаРазделаРСВвВышестоящийДепозитарий.РаскрытиеСпискаВладельцев.СвязанныйВидКД2.Код
	|			И ДанныеНРД.РеференсКД = ВыгрузкаРазделаРСВвВышестоящийДепозитарий.РаскрытиеСпискаВладельцев.СвязанныйРеференсКД2
	|			И ДанныеНРД.ДатаФиксации = ВыгрузкаРазделаРСВвВышестоящийДепозитарий.РаскрытиеСпискаВладельцев.ДатаФиксации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодтвержденияРСВ КАК ПодтвержденияРСВ
	|		ПО ДанныеНРД.ДатаПриема = ПодтвержденияРСВ.Период
	|			И ДанныеНРД.ISIN = ПодтвержденияРСВ.ISIN
	|			И ДанныеНРД.ТипКД = ПодтвержденияРСВ.ТипКД
	|			И ДанныеНРД.РеференсКД = ПодтвержденияРСВ.РеференсКД
	|			И ДанныеНРД.ДатаФиксации = ПодтвержденияРСВ.ДатаФиксации
	|			И ДанныеНРД.Раздел = ПодтвержденияРСВ.Раздел
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТехническаяОперация КАК ТехническаяОперация
	|		ПО (ТехническаяОперация.Ссылка В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					Документ.ТехническаяОперация.Ссылка
	|				ИЗ
	|					Документ.ТехническаяОперация
	|				ГДЕ
	|					Документ.ТехническаяОперация.ДокументОснование = ВыгрузкаРазделаРСВвВышестоящийДепозитарий.Ссылка
	|					И Документ.ТехническаяОперация.Дата <= ДанныеНРД.ДатаПриема
	|				УПОРЯДОЧИТЬ ПО
	|					Документ.ТехническаяОперация.Дата УБЫВ))
	|ГДЕ
	|	(ЕСТЬNULL(ПодтвержденияРСВ.Состояние <> ДанныеНРД.Состояние
	|					ИЛИ ПодтвержденияРСВ.ОстатокЦБ <> ДанныеНРД.ОстатокЦБ
	|					ИЛИ ПодтвержденияРСВ.РаскрытоЦБ <> ДанныеНРД.РаскрытоЦБ, ИСТИНА)
	|			ИЛИ ПодтвержденияРСВ.Выгрузка.Ссылка ЕСТЬ NULL
	|				И ВыгрузкаРазделаРСВвВышестоящийДепозитарий.Ссылка ЕСТЬ НЕ NULL 
	|			ИЛИ ПодтвержденияРСВ.Пакет.Ссылка ЕСТЬ NULL
	|				И ТехническаяОперация.Ссылка ЕСТЬ НЕ NULL )";
КонецФункции

Функция СсылкаНаВходящийПакет(Данные, ПутьКФайлу, ИмяФайла)
	
	ВходящийПакет = Документы.ВходящийПакетИзФайловогоШлюза.СоздатьДокумент();
	ВходящийПакет.Дата = ТекущаяДатаСеанса();
	ВходящийПакет.Комментарий = "Создан автоматически в " + Формат(ВходящийПакет.Дата, "ДЛФ=DT");  
	ВходящийПакет.ДокументОснование = Данные.ТехническаяОперация;
	ВходящийПакет.ОтносительныйПуть = ИмяФайла;
	ВходящийПакет.ПолныйПуть = ПутьКФайлу + ИмяФайла;
	ВходящийПакет.Статус = Перечисления.СтатусыДокументовФайловыйШлюз.ПринятоКИсполнению;
	ВходящийПакет.Обработан = Истина;
	ВходящийПакет.ПутьАрхив = ПутьКФайлу + "ARCHIVE\"+ИмяФайла;
	
	ВходящийПакет.Записать();
	
	Возврат ВходящийПакет.Ссылка;
	
КонецФункции

Процедура ЗаписатьДанныеВРегистр(Данные, ИмяФайла, ВходящийПакет)
	Запись = РегистрыСведений.ПодтвержденияРСВ.СоздатьМенеджерЗаписи();
	Запись.Период = Данные.ДатаПриема;
	Запись.ISIN = Данные.ISIN;
	Запись.ТипКД = Данные.ТипКД;
	Запись.РеференсКД = Данные.РеференсКД;
	Запись.ДатаФиксации = Данные.ДатаФиксации;
	Запись.Раздел = Данные.Раздел;
	Если Данные.НоваяЗапись Тогда
		Запись.ДополнительнаяИнформация = ИмяФайла + " Запись добавлена";
	Иначе
		Запись.Прочитать();
		ОписаниеИзменений = ИмяФайла+":";
		Если Запись.Состояние <> Данные.Состояние Тогда
			ОписаниеИзменений = ОписаниеИзменений + Символы.ПС + "Состояние "+Запись.Состояние+"->"+Данные.Состояние;
		КонецЕсли;
		Если Запись.ОстатокЦБ <> Данные.ОстатокЦБ Тогда
			ОписаниеИзменений = ОписаниеИзменений + Символы.ПС + "Остаток ЦБ "+Запись.ОстатокЦБ+"->"+Данные.ОстатокЦБ;
		КонецЕсли;
		Если Запись.РаскрытоЦБ <> Данные.РаскрытоЦБ Тогда
			ОписаниеИзменений = ОписаниеИзменений + Символы.ПС + "Раскрыто ЦБ "+Запись.РаскрытоЦБ+"->"+Данные.РаскрытоЦБ;
		КонецЕсли;
		Запись.ДополнительнаяИнформация = Запись.ДополнительнаяИнформация + Символы.ПС + ОписаниеИзменений;
	КонецЕсли;
	Запись.Состояние = Данные.Состояние;
	Запись.ОстатокЦБ = Данные.ОстатокЦБ;
	Запись.РаскрытоЦБ = Данные.РаскрытоЦБ;
	Если Запись.Выгрузка.Пустая() Тогда
		Запись.Выгрузка = Данные.Выгрузка;
	КонецЕсли;
	Если Запись.Пакет.Пустая() Тогда
		Запись.Пакет = ВходящийПакет;
	КонецЕсли;
	Запись.Записать();
КонецПроцедуры

