
&НаКлиенте
Процедура СчетДепоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура("Владелец", Объект.Депонент);
	мПараметры = Новый Структура("Отбор", ПараметрыОтбора);
	ОткрытьФорму("Справочник.СчетаДепо.ФормаВыбора", мПараметры, Элементы.СчетДепо);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Депонент) И Объект.Депонент.Субброкер Тогда
		ДобавитьКомандуОтправкиОтчетаПоСчетуДепо();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандуОтправкиОтчетаПоСчетуДепо()
	
	ИмяКнопки = "ОтправитьОтчетПоСчетуДепоВФорматеXLS";
	КомандаФормы = Команды.Добавить(ИмяКнопки);
	КомандаФормы.Действие = ИмяКнопки;
	
	КнопкаОтправки = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), КоманднаяПанель);
	КнопкаОтправки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КнопкаОтправки.Заголовок = "Отправить отчет по счету депо";
	КнопкаОтправки.ИмяКоманды = ИмяКнопки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтчетПоСчетуДепоВФорматеXLS()
	
	ОтправитьОтчетПоСчетуСубброкераВФорматеXLSНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьОтчетПоСчетуСубброкераВФорматеXLSНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Поручения = Новый ТаблицаЗначений;
		Поручения.Колонки.Добавить("Поручение", Новый ОписаниеТипов("ДокументСсылка.Поручение"));
		Поручения.Колонки.Добавить("ВнешнийИсточникДляРСВПоСубклиентам", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВнешниеИсточники"));
		
		Строка = Поручения.Добавить();
		Строка.Поручение = Объект.ДокументОснование;
		Строка.ВнешнийИсточникДляРСВПоСубклиентам = Объект.Депонент.ВнешнийИсточникДляРСВПоСубклиентам;
				
		РегламентныеЗаданияСервер.СформироватьИОтправитьОтчеты(Поручения, НачалоДня(Объект.ДокументОснование.ДатаКонПериода));
		
	КонецЕсли;
	
КонецПроцедуры

