
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.КорпоративноеДействие_Новый") И ПолучитьКодВидаКД(ПараметрКоманды) = "WTRC" Тогда
		ПараметрыФормы = Новый Структура("КД", ПараметрКоманды);
		Форма = ОткрытьФорму("Отчет.СтруктураПодчиненностиКДWTRC.ФормаОбъекта", ПараметрыФормы);
		Если Форма.Открыта() Тогда
			Оповестить("СтруктураПодчиненностиКДWTRC", ПараметрыФормы);
		КонецЕсли;
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьКодВидаКД(Ссылка)
	Возврат Ссылка.ВидКД.Код;
КонецФункции