// Возвращает количество версий элемента
// Параметры:
//  Ссылка - ЛюбаяСсылка - Ссылка на объект БД
// Возвращаемое значение:
//  Количество - Число - Количество версий объекта
Функция КоличествоВерсийОбъекта(Ссылка) Экспорт
	
	ОбновитьИсториюДанных(Ссылка);
	Возврат ВерсииОбъекта(Ссылка, "НомерВерсии,Дата").Количество();
	
КонецФункции

// Возвращает таблицу значений версий объекта
// Параметры:
//  Ссылка - ЛюбаяСсылка - Ссылка на объект БД
//  Колонки - Строка,Массив,Неопределено - колонки таблицы значений
// Возвращаемое значение:
//  ВерсииОбъекта - ТаблицаЗначений - таблица значений версий объекта
Функция ВерсииОбъекта(Ссылка, Колонки = Неопределено) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Данные", Ссылка);
	Возврат ИсторияДанных.ВыбратьВерсии(Отбор, Колонки);
	
КонецФункции

// Обновляет историю данных
// Параметры:
//  Ссылка - ЛюбаяСсылка - Ссылка на объект БД
Процедура ОбновитьИсториюДанных(Ссылка = Неопределено) Экспорт
	Если Ссылка = Неопределено Тогда
		ИсторияДанных.ОбновитьИсторию();
	Иначе
		ИсторияДанных.ОбновитьИсторию(Ссылка);
	КонецЕсли;
КонецПроцедуры
