
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	СформироватьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	СформироватьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Типы = Новый Массив;
	Типы.Добавить(Тип("СправочникСсылка.ВидыОпераций"));
	Типы.Добавить(Тип("ПеречислениеСсылка.ВидыОтчетов"));
	Отчет.ВидОперации.ТипЗначения =  Новый ОписаниеТипов(Типы);

КонецПроцедуры

&НаКлиенте
Процедура СчетДепоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Типы = Новый Массив;
	Типы.Добавить(Тип("СправочникСсылка.СчетаДепо"));
	Отчет.СчетДепо.ТипЗначения =  Новый ОписаниеТипов(Типы);

КонецПроцедуры

&НаКлиенте
Процедура ИнициаторНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Типы = Новый Массив;
	Типы.Добавить(Тип("СправочникСсылка.Контрагенты"));
	Отчет.Инициатор.ТипЗначения =  Новый ОписаниеТипов(Типы);
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Типы = Новый Массив;
	Типы.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	Отчет.Исполнитель.ТипЗначения =  Новый ОписаниеТипов(Типы);
КонецПроцедуры

&НаКлиенте
Процедура КлассОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Типы = Новый Массив;
	Типы.Добавить(Тип("ПеречислениеСсылка.КлассыОпераций"));
	Отчет.КлассОперации.ТипЗначения =  Новый ОписаниеТипов(Типы);
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Типы = Новый Массив;
	Типы.Добавить(Тип("СправочникСсылка.ЦенныеБумаги"));
	Отчет.ЦеннаяБумага.ТипЗначения =  Новый ОписаниеТипов(Типы);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Типы = Новый Массив;
	Типы.Добавить(Тип("СправочникСсылка.Контрагенты"));
	Отчет.Контрагент.ТипЗначения =  Новый ОписаниеТипов(Типы);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ЗначениеЗаполнено(Отчет.ДатаНач) И Не ЗначениеЗаполнено(Отчет.ДатаКон) Тогда
		Отчет.ДатаНач = НачалоКвартала(ОбщегоНазначенияКлиент.ДатаСеанса());
	    Отчет.ДатаКон = КонецКвартала(ОбщегоНазначенияКлиент.ДатаСеанса());
	КонецЕсли; 

	Если Отчет.ДатаНач > Отчет.ДатаКон И Отчет.ДатаКон <> '00010101000000' Тогда
		Предупреждение("Дата начала периода не может быть больше даты конца периода");
		Возврат;
	КонецЕсли;

	СформироватьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериода(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтотОбъект);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период.ДатаНачала = Отчет.ДатаНач ;
	Диалог.Период.ДатаОкончания = Отчет.ДатаКон;
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		Отчет.ДатаНач = Период.ДатаНачала;
		Отчет.ДатаКон = Период.ДатаОкончания;
	КонецЕсли;
	
	СформироватьЗаголовокФормы();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	РеквизитФормыВЗначение("Отчет").Сформировать(ТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовокФормы()
	Если Отчет.ДатаНач = '00010101000000' И Отчет.ДатаКон = '00010101000000' Тогда
		ОписаниеПериода = "Период не установлен";
	Иначе
		Если Отчет.ДатаНач = '00010101000000' ИЛИ Отчет.ДатаКон = '00010101000000' Тогда
			ОписаниеПериода = "С " + Формат(Отчет.ДатаНач, "ДФ = ""дд.ММ.гггг""; ДП = ""...""") 
							+ " по " + Формат(Отчет.ДатаКон, "ДФ = ""дд.ММ.гггг""; ДП = ""...""");
		Иначе
			Если Отчет.ДатаНач <= Отчет.ДатаКон Тогда
				ОписаниеПериода = "" + ПредставлениеПериода(НачалоДня(Отчет.ДатаНач), КонецДня(Отчет.ДатаКон), "ФП = Истина");
			Иначе
				ОписаниеПериода = "Неправильно задан период!";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Заголовок = "Операционный журнал (" + ОписаниеПериода + ") " ;
КонецПроцедуры

&НаКлиенте
Процедура СписокОчистка(Элемент, СтандартнаяОбработка)
	Отчет[Элемент.Имя].Очистить();
КонецПроцедуры