
//#Область ПрограммныйИнтерфейс

//#Область НастройкиКомпоновки

// Проверка наличия включенного флага "Использование" в переданной субколлекции настроек схемы
// 
// Параметры:
// 	Источник - ОтборКомпоновкиДанных
// Возвращаемое значение:
// 	Булево
//
Функция ЕстьИспользуемыйЭлемент(Источник) Экспорт
	
	Результат = Ложь;
	Для Каждого ЭлементИсточника Из Источник.Элементы Цикл		
		Если ТипЗнч(ЭлементИсточника) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Результат = ЕстьИспользуемыйЭлемент(ЭлементИсточника);
		Иначе
			Результат = ЭлементИсточника.Использование;
		КонецЕсли;			
		
		Если Результат Тогда			
			Прервать;			
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// Копирует элементы из одной коллекции в другую
//
// Параметры:
//	ПриемникЗначения	- коллекция элементов КД, куда копируются параметры
//	ИсточникЗначения	- коллекция элементов КД, откуда копируются параметры
//	ОчищатьПриемник - признак необходимости очистки приемника (Булево, по умолчанию: истина)
//
Процедура СкопироватьЭлементы(ПриемникЗначения, ИсточникЗначения, ОчищатьПриемник = Истина) Экспорт
	
	Если ТипЗнч(ИсточникЗначения) = Тип("УсловноеОформлениеКомпоновкиДанных")
		Или ТипЗнч(ИсточникЗначения) = Тип("ВариантыПользовательскогоПоляВыборКомпоновкиДанных")
		Или ТипЗнч(ИсточникЗначения) = Тип("ОформляемыеПоляКомпоновкиДанных")
		Или ТипЗнч(ИсточникЗначения) = Тип("ЗначенияПараметровДанныхКомпоновкиДанных") Тогда
		СоздаватьПоТипу = Ложь;
	Иначе
		СоздаватьПоТипу = Истина;
	КонецЕсли;
	ПриемникЭлементов = ПриемникЗначения.Элементы;
	ИсточникЭлементов = ИсточникЗначения.Элементы;
	Если ОчищатьПриемник Тогда
		ПриемникЭлементов.Очистить();
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из ИсточникЭлементов Цикл
		
		Если ТипЗнч(ЭлементИсточник) = Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
			// Элементы порядка добавляем в начало
			//@skip-warning
			Индекс = ИсточникЭлементов.Индекс(ЭлементИсточник);
			ЭлементПриемник = ПриемникЭлементов.Вставить(Индекс, ТипЗнч(ЭлементИсточник));
		Иначе
			Если СоздаватьПоТипу Тогда
				ЭлементПриемник = ПриемникЭлементов.Добавить(ТипЗнч(ЭлементИсточник));
			Иначе
				ЭлементПриемник = ПриемникЭлементов.Добавить();
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		// В некоторых коллекциях необходимо заполнить другие коллекции
		Если ТипЗнч(ИсточникЭлементов) = Тип("КоллекцияЭлементовУсловногоОформленияКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Поля, ЭлементИсточник.Поля);
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
			ЗаполнитьЭлементы(ЭлементПриемник.Оформление, ЭлементИсточник.Оформление); 
		ИначеЕсли ТипЗнч(ИсточникЭлементов)	= Тип("КоллекцияВариантовПользовательскогоПоляВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
		КонецЕсли;
		
		// В некоторых элементах коллекции необходимо заполнить другие коллекции
		Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Варианты, ЭлементИсточник.Варианты);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных") Тогда
			ЭлементПриемник.УстановитьВыражениеДетальныхЗаписей (ЭлементИсточник.ПолучитьВыражениеДетальныхЗаписей());
			ЭлементПриемник.УстановитьВыражениеИтоговыхЗаписей(ЭлементИсточник.ПолучитьВыражениеИтоговыхЗаписей());
			ЭлементПриемник.УстановитьПредставлениеВыраженияДетальныхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияДетальныхЗаписей ());
			ЭлементПриемник.УстановитьПредставлениеВыраженияИтоговыхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияИтоговыхЗаписей ());
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет одну коллекцию элементов на основании другой
//
// Параметры:
//	ПриемникЗначения	- коллекция элементов КД, куда копируются параметры
//	ИсточникЗначения	- коллекция элементов КД, откуда копируются параметры
//	ПервыйУровень		- уровень структуры коллекции элементов КД для копирования параметров
//
Процедура ЗаполнитьЭлементы(ПриемникЗначения, ИсточникЗначения, ПервыйУровень = Неопределено) Экспорт
	
	Если ТипЗнч(ПриемникЗначения) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
		КоллекцияЗначений = ИсточникЗначения;
	Иначе
		КоллекцияЗначений = ИсточникЗначения.Элементы;
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из КоллекцияЗначений Цикл
		Если ПервыйУровень = Неопределено Тогда
			ЭлементПриемник = ПриемникЗначения.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		Иначе
			ЭлементПриемник = ПервыйУровень.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		КонецЕсли;
		Если ЭлементПриемник = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		Если ТипЗнч(ЭлементИсточник) = Тип("ЗначениеПараметраКомпоновкиДанных") Тогда
			Если ЭлементИсточник.ЗначенияВложенныхПараметров.Количество() <> 0 Тогда
				ЗаполнитьЭлементы(ЭлементПриемник.ЗначенияВложенныхПараметров, ЭлементИсточник.ЗначенияВложенныхПараметров, ПриемникЗначения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Добавляет в коллекцию оформляемых полей компоновки данных новое поле
//
// Параметры:
//	КоллекцияОформляемыхПолей 	- коллекция оформляемых полей КД
//	ИмяПоля						- Строка - имя поля
//
// Возвращаемое значение:
//	ОформляемоеПолеКомпоновкиДанных - созданное поле
//
// Пример:
// 	Форма.УсловноеОформление.Элементы[0].Поля
//
Функция ДобавитьОформляемоеПоле(КоллекцияОформляемыхПолей, ИмяПоля) Экспорт
	
	ПолеЭлемента 		= КоллекцияОформляемыхПолей.Элементы.Добавить();
	ПолеЭлемента.Поле 	= Новый ПолеКомпоновкиДанных(ИмяПоля);

	Возврат ПолеЭлемента;
	
КонецФункции

// Добавляет в коллекцию отбора новую группу указанного типа.
//
// Параметры:
//	КоллекцияЭлементовОтбора - КоллекцияЭлементовОтбораКомпоновкиДанных 
//	ТипГруппы - ТипГруппыЭлементовОтбораКомпоновкиДанных - ГруппаИ или ГруппаИли
//
// Возвращаемое значение:
//	ГруппаЭлементовОтбораКомпоновкиДанных - добавленная группа
//
Функция ДобавитьГруппуОтбора(КоллекцияЭлементовОтбора, ТипГруппы) Экспорт

	ГруппаЭлементовОтбора = КоллекцияЭлементовОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы  = ТипГруппы;
	
	Возврат ГруппаЭлементовОтбора;

КонецФункции

Процедура СкопироватьГруппировку(ЭлемПриемник, ЭлемИсточник) Экспорт
				
	ЗаполнитьЗначенияСвойств(ЭлемПриемник, ЭлемИсточник);			
	
	СкопироватьЭлементы(ЭлемПриемник.Выбор, ЭлемИсточник.Выбор);				
	СкопироватьЭлементы(ЭлемПриемник.Отбор, ЭлемИсточник.Отбор);				
	СкопироватьСтруктуру(ЭлемПриемник.ПараметрыВывода, ЭлемИсточник.ПараметрыВывода.Элементы);	
	СкопироватьЭлементы(ЭлемПриемник.ПоляГруппировки, ЭлемИсточник.ПоляГруппировки);				
	СкопироватьЭлементы(ЭлемПриемник.Порядок, ЭлемИсточник.Порядок);
	СкопироватьЭлементы(ЭлемПриемник.УсловноеОформление, ЭлемИсточник.УсловноеОформление);			
	СкопироватьСтруктуру(ЭлемПриемник.Структура, ЭлемИсточник.Структура);
		
КонецПроцедуры 

// Копирование настроек структуры настроек схемы
//
// Параметры:
//  Приемник - КоллекцияЭлементовСтруктурыНастроекКомпоновкиДанных
//  Источник - КоллекцияЭлементовСтруктурыНастроекКомпоновкиДанных
//  ОчищатьПриемник - Булево
//
Процедура СкопироватьСтруктуру(Приемник, Источник, ОчищатьПриемник = Истина) Экспорт
	
	Если ОчищатьПриемник Тогда
		Если ТипЗнч(Приемник) = Тип("КоллекцияЭлементовСтруктурыНастроекКомпоновкиДанных") Тогда
			Приемник.Очистить();			
		КонецЕсли; 		
	КонецЕсли; 
	
	Для каждого ЭлемИсточник Из Источник Цикл		
		ТипЭлементаСтруктуры = ТипЗнч(ЭлемИсточник);		
		ЭтоГруппировка = ТипЭлементаСтруктуры = Тип("ГруппировкаТаблицыКомпоновкиДанных")
			ИЛИ ТипЭлементаСтруктуры = Тип("ГруппировкаКомпоновкиДанных");
		
		Если ЭтоГруппировка Тогда 				
			ЭлемПриемник = Приемник.Добавить(ТипЭлементаСтруктуры);		
			СкопироватьГруппировку(ЭлемПриемник, ЭлемИсточник);
			
		ИначеЕсли ТипЭлементаСтруктуры = Тип("ТаблицаКомпоновкиДанных") Тогда			
			ЭлемПриемник = Приемник.Добавить(ТипЭлементаСтруктуры);
			ЗаполнитьЗначенияСвойств(ЭлемПриемник, ЭлемИсточник);			
			
			СкопироватьЭлементы(ЭлемПриемник.Выбор, ЭлемИсточник.Выбор);
			СкопироватьЭлементы(ЭлемПриемник.Условноеоформление, ЭлемИсточник.Условноеоформление);	
			
			СкопироватьСтруктуру(ЭлемПриемник.ПараметрыВывода, ЭлемИсточник.ПараметрыВывода.Элементы);	
			СкопироватьСтруктуру(ЭлемПриемник.Колонки, ЭлемИсточник.Колонки);
			СкопироватьСтруктуру(ЭлемПриемник.Строки, ЭлемИсточник.Строки);
			
		ИначеЕсли ТипЭлементаСтруктуры = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда 	
			ЭлемПриемник = Приемник.Элементы.Найти(ЭлемИсточник.Параметр);
			ЗаполнитьЗначенияСвойств(ЭлемПриемник, ЭлемИсточник);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры 

//#КонецОбласти 

//#КонецОбласти 
