
// Единообразный обработчик установки соединений для реализации цепочки взаимосвязанных обработок.
//
// Параметры:
//  Параметры	 - Структура	 - Опциональные параметры соединения для следующих обработок в цепочке.
//	* ИмяОбработки	 - Строка
//	* Параметры		 - Структура
//
Процедура ИнициироватьСоединение(Параметры = Неопределено) Экспорт
КонецПроцедуры

// Основной метод обработки. Выполняет выгрузку в СЭД.
Процедура ЗагрузкаДанных() Экспорт
	Перем Соединение, Команда, RS;
	
	// Подготовим статус загрузки для возврата через ПараметрыДокумента, если этого требует вызывающая программа
	Если ПараметрыДокумента.Свойство("ВозвращатьСтатусЗагрузки") И ПараметрыДокумента.ВозвращатьСтатусЗагрузки Тогда
		ПараметрыДокумента.Вставить("ДокументУспешноЗарегистрирован", Ложь);
	КонецЕсли;
	
	ТипыКомандADO = ВнешниеДанные.ИнициализацияТиповADO();
	ТипыПараметровADO = ВнешниеДанные.ИнициализацияТиповПараметровADO();
	ТипыНаправленийПараметраADO = ВнешниеДанные.ИнициализацияТиповНаправленияПараметровADO();
	
	Body = Новый ComОбъект("ADODB.Stream");
	Body.Type = 1;
	Body.Open();
	
	ОжидатьЗавершенияЗаписиФайла(ПараметрыДокумента.ПолноеИмяФайла);
	
	Попытка
		Body.LoadFromFile(ПараметрыДокумента.ПолноеИмяФайла);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации("Ошибка при печати PDF", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки);
		ОбщегоНазначения.СообщитьОбОшибке(ПодробноеПредставлениеОшибки);
		Возврат;
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыБазы) Тогда
		ПараметрыБазы = ПланыВидовХарактеристик.ВнешниеИсточники.Документооборот;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыБазы) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не найдена база документооборота");
		Возврат;
	КонецЕсли;
	
	ВнешниеДанные.ADOConnect(Соединение, Команда, RS, ПараметрыБазы);
	ВнешниеДанные.СформироватьПараметрыADO(Команда, ПараметрыДокумента.ТаблицаПараметров);
			
	Парам1 = Команда.CreateParameter("Body",205,1,Body.Size,Body.Read());
	Команда.Parameters.Append(Парам1);
	
	Если ПараметрыДокумента.Свойство("ПроцедураЗапроса") Тогда
		ТекстЗапроса = ПараметрыДокумента.ПроцедураЗапроса;
	иначе
		ТекстЗапроса = "CreateDocument ";
	КонецЕсли;
	
	Если НЕ ВнешниеДанные.SQLЗапрос(Команда, RS, ТекстЗапроса, ТипыКомандADO.ХранимаяПроцедура) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(ТекстЗапроса);
	Иначе
		Если Команда.Parameters("ErrorCode").Value <> 0 Тогда
			Если Найти(ТекстЗапроса, "CreateDocumentFrom1C")>0 Тогда
				СтрокаДокумент	= ПолучитьСтрокуИнформацииДокументаПоПараметрам(ПараметрыДокумента.ТаблицаПараметров);
				ОбщегоНазначения.СообщитьОбОшибке("Документ - "+СтрокаДокумент+" не помещен в СЭД по причине: Ошибка ("+Команда.Parameters("ErrorCode").Value+"): "+Команда.Parameters("ResultMessage").Value);
			Иначе
				ОбщегоНазначения.СообщитьОбОшибке("Ошибка ("+Команда.Parameters("ErrorCode").Value+"): "+Команда.Parameters("ResultMessage").Value);
			КонецЕсли;
		Иначе			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ зарегистрирован под номером - "+Команда.Parameters("DocumentNumber").Value);			
			// Вернем статус загрузки через ПараметрыДокумента, если нужно
			Если ПараметрыДокумента.Свойство("ВозвращатьСтатусЗагрузки") И ПараметрыДокумента.ВозвращатьСтатусЗагрузки Тогда
				ПараметрыДокумента.Вставить("ДокументУспешноЗарегистрирован", Истина);
			КонецЕсли;
			Для Каждого Параметр Из ПараметрыДокумента.ТаблицаПараметров Цикл
				Если Параметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Исходящий Или Параметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.ВходящийИсходящий Тогда
					Параметр.ЗначениеПараметра = Команда.Parameters.Item(Параметр.ИмяПараметра).Value;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ВнешниеДанные.ADODisconnect(Соединение, Команда, RS);
КонецПроцедуры

Процедура ОжидатьЗавершенияЗаписиФайла(ПолноеИмяФайла, Таймаут = 60)
	ВремяОжидания = ТекущаяДата() + Таймаут;
	Пока Истина Цикл
		Файл = Новый Файл(ПолноеИмяФайла);
		Если Файл.Существует() И Файл.Размер() > 0 Тогда
			Возврат;
		КонецЕсли;
		Файл = Неопределено;
		Спать(100);
		Если ТекущаяДата() > ВремяОжидания Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура Спать(Время) Экспорт
	Если Время = 0 Тогда
		Возврат
	КонецЕсли;
	ПутьСкрипта = ПолучитьИмяВременногоФайла("vbs");
	СкриптФайл = Новый ТекстовыйДокумент;
	СкриптФайл.ДобавитьСтроку("WScript.Sleep("+Формат(Время, "ЧГ=0")+")");
	СкриптФайл.Записать(ПутьСкрипта, КодировкаТекста.OEM);
	WSHShell = Новый COMОбъект("WScript.Shell");
	WSHShell.Run("wscript.exe """+ПутьСкрипта+"""", 0, Истина);
	УдалитьФайлы(ПутьСкрипта);
КонецПроцедуры

Функция ПолучитьСтрокуИнформацииДокументаПоПараметрам(ТаблицаПараметров)
	СтрокаИнформацииПоДокументу	= "";
	// Определим имя документа
	НайденнаяСтрока		= ТаблицаПараметров.Найти("FileName", "ИмяПараметра");
	Если НайденнаяСтрока <> Неопределено Тогда
		СтрокаИнформацииПоДокументу	= СтрокаИнформацииПоДокументу + СокрЛП(НайденнаяСтрока.ЗначениеПараметра);
	КонецЕсли;
	// Определиим номер документа
	НайденнаяСтрока		= ТаблицаПараметров.Найти("DocumentNumber", "ИмяПараметра");
	Если НайденнаяСтрока <> Неопределено Тогда
		СтрокаИнформацииПоДокументу	= СтрокаИнформацииПоДокументу + ?(ЗначениеЗаполнено(СтрокаИнформацииПоДокументу), " №", "") + СокрЛП(НайденнаяСтрока.ЗначениеПараметра);
	КонецЕсли;
	// Определиим дату документа
	НайденнаяСтрока		= ТаблицаПараметров.Найти("DocumentDate", "ИмяПараметра");
	Если НайденнаяСтрока <> Неопределено Тогда
		СтрокаИнформацииПоДокументу	= СтрокаИнформацииПоДокументу + ?(ЗначениеЗаполнено(СтрокаИнформацииПоДокументу), " от ", "") + СокрЛП(НайденнаяСтрока.ЗначениеПараметра);
	КонецЕсли;
	// Определиим клиента документа
	НайденнаяСтрока		= ТаблицаПараметров.Найти("Client", "ИмяПараметра");
	Если НайденнаяСтрока <> Неопределено Тогда
		СтрокаИнформацииПоДокументу	= СтрокаИнформацииПоДокументу + "(" + СокрЛП(НайденнаяСтрока.ЗначениеПараметра)+ ")";
	КонецЕсли;
	
	Возврат СтрокаИнформацииПоДокументу;
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
