
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрыДляДополнительныхСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Изменен реестр внешних отчетов" Тогда
		ТекДанные = Элементы.Список.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			Если ТекДанные.Ссылка = Параметр Тогда
				ОбновитьПараметрыДляДополнительныхСписков();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//#КонецОбласти 

//#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = ФлагОтказа;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	Если НЕ Элементы.Список.ТолькоПросмотр Тогда
		Меню = Новый СписокЗначений;
		Меню.Добавить(Ложь,"Редактировать элемент справочника?");
		Меню.Добавить(Истина,"Запустить отчет?");
		
		ЧтоВыбрали = ВыбратьИзМеню(Меню,Элемент);
		Если НЕ ЧтоВыбрали = Неопределено Тогда
			Если ЧтоВыбрали.Значение Тогда
				ЗапускОтчетов(ТекДанные.Ссылка);
				ФлагОтказа = Истина;
			Иначе
				ФлагОтказа = Ложь;
			КонецЕсли;
		КонецЕсли; 
	Иначе
		ЗапускОтчетов(ТекДанные.Ссылка);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОбновитьПараметрыДляДополнительныхСписков();
			
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПараметрыДляДополнительныхСписков()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		УстановитьПараметрыДляДополнительныхСписков();
	Иначе
		УстановитьПараметрыДляДополнительныхСписков(ТекДанные.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДляДополнительныхСписков(Значение = Неопределено)
	
	Если Значение = Неопределено Тогда
		Значение = ПредопределенноеЗначение("Справочник.РеестрВнешнихОтчетов.ПустаяСсылка");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДоступПользователей	, "Ссылка", Значение);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ВремяЗапуска			, "Ссылка", Значение);

КонецПроцедуры

&НаКлиенте
Процедура ЗапускОтчетов(ОтчетДляЗапуска)
	
	ИмяФайлаОтчета	= ПолучитьИмяВременногоФайла(".epf");
	ХранилищеВнешнегоОтчета(ОтчетДляЗапуска).Записать(ИмяФайлаОтчета);

	АдресХранилища	= "";
	Результат		= ПоместитьФайл(АдресХранилища, ИмяФайлаОтчета,,Ложь);
	ИмяОтчета		= ПодключеннаяВнешняяОбработка(АдресХранилища);
	ОткрытьФорму("ВнешняяОбработка."+ИмяОтчета+".Форма");

КонецПроцедуры

&НаСервереБезКонтекста
Функция ХранилищеВнешнегоОтчета(ОтчетДляЗапуска)
	
	Возврат ОтчетДляЗапуска.ПолучитьОбъект().Отчет.Получить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПодключеннаяВнешняяОбработка(Адрес)
	
	Возврат ВнешниеОбработки.Подключить(Адрес);
	
КонецФункции

//#КонецОбласти




