
// Возвращает Истина, если у депонента нет ЦБ на остатках или они есть и не входят в выборку из регистра бумаг без комиссии.
Функция НачислятьКомиссию(Дата, Услуга, Депонент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втЦенныеБумагиБезКомиссии
	|ИЗ
	|	РегистрСведений.ЦенныеБумагиБезКомиссииЗаУслуги.СрезПоследних(&ДатаОстатков, Услуга = &Услуга) КАК ЦенныеБумаги
	|ГДЕ
	|	ЦенныеБумаги.ФлагАктивности
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеннаяБумага
	|;
	|///////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|		КОГДА ЦББезКомиссии.ЦеннаяБумага ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоличествоЦБСКомиссией
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(&ДатаОстатков, СчетДепо.Владелец = &Депонент) КАК Остатки
	|	ЛЕВОЕ СОЕДИНЕНИЕ втЦенныеБумагиБезКомиссии КАК ЦББезКомиссии
	|	ПО Остатки.ЦБ = ЦББезКомиссии.ЦеннаяБумага";
	Запрос.УстановитьПараметр("ДатаОстатков",	Дата);
	Запрос.УстановитьПараметр("Услуга",			Услуга);
	Запрос.УстановитьПараметр("Депонент",		Депонент);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.КоличествоЦБСКомиссией = Null ИЛИ Выборка.КоличествоЦБСКомиссией > 0;
КонецФункции
