
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт

	Структура = Новый Структура;
	Структура.Вставить("Вид", ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
	Структура.Вставить("Наименование", "Поступления на расчетный счет: Розничное ДУ");
	Структура.Вставить("Версия", "1.04");
	Структура.Вставить("БезопасныйРежим", Истина);
	Структура.Вставить("Информация", "");

	Команды = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(
		Команды, 
		"Поступления на расчетный счет: Розничное ДУ",
		"ПоступленияНаРасчетныйСчет_РозничноеДУ",
		"ОткрытиеФормы"
	);

	Структура.Вставить("Команды", Команды);

	Возврат Структура;

КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;

КонецПроцедуры

Функция УстановитьНастройки(ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрыВыполненияКоманды) <> Тип("Структура") тогда возврат "<Настройки не установлены>"; КонецЕсли;
	
	НастройкиВыполнения = ПараметрыВыполненияКоманды.ПараметрыДополнительнойОбработки;
	Если ТипЗнч(НастройкиВыполнения) <> Тип("Структура") Тогда возврат "<Настройки не установлены>"; КонецЕсли;
	
	ЗначенияНастроек = НастройкиВыполнения;
	
	ПредставлениеНастроек = "";
	
	УстановитьПользовательскиеНастройки(ЗначенияНастроек, ПредставлениеНастроек);
	
	Возврат ПредставлениеНастроек;
	
КонецФункции

Процедура УстановитьПользовательскиеНастройки(Настройки, ПредставлениеНастроек="") Экспорт
	
	Если Настройки.Свойство("Значения") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Настройки.Значения);
		ВхНомер = "";
		ВхНомерВвод = "";
		//Если Настройки.Значения.Свойство("СписокРассылки") тогда
		//	СписокРассылки.Загрузить(XMLЗначение(Тип("ХранилищеЗначения"),Настройки.Значения.СписокРассылки).Получить());
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьНастройки(Настройки) Экспорт

	ДопОбработка = ДополнительнаяОбработка.ПолучитьОбъект();
	ДопОбработка.ХранилищеНастроек = Новый ХранилищеЗначения(Настройки);
	ДопОбработка.Записать();

КонецПроцедуры

Функция СтруктураНастрок() Экспорт
	
	Значения = Новый Структура;
	Для каждого РеквизитОбработки Из ЭтотОбъект.Метаданные().Реквизиты Цикл
		Если РеквизитОбработки.Имя <> "ВхНомерВвод" И РеквизитОбработки.Имя <> "ВхНомер" Тогда
			Значения.Вставить(РеквизитОбработки.Имя, ЭтотОбъект[РеквизитОбработки.Имя]);
		КонецЕсли;
	КонецЦикла;

	Возврат Значения;
	
Конецфункции

Процедура ПорученияПоДС(ВидОперации) Экспорт

	Если ВидОперации = Перечисления.ВидыОперацийПоручение.Перевод Тогда
		ПорученияПоДС.Очистить();
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийПоручение.ВводВДУ Тогда
		ПорученияПоДСВвод.Очистить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Поручение.Ссылка КАК ПоручениеПоДС,
		|	Поручение.ДоговорДУ КАК ДоговорДУ,
		|	Поручение.СуммаДС КАК СуммаДС,
		|	Поручение.ВидОперации КАК ВидОперации,
		|	АналитическиеСчета.Ссылка КАК АналитическийСчет,
		|	ВЫБОР
		|		КОГДА Поручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоручение.ВводВДУ)
		|			ТОГДА АналитическиеСчета.ДоговорКонтрагента
		|		ИНАЧЕ Поручение.ДоговорКонтрагента
		|	КОНЕЦ КАК ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА Поручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоручение.ВводВДУ)
		|			ТОГДА Поручение.Контрагент
		|		ИНАЧЕ АналитическиеСчета.СубъектМестаХранения
		|	КОНЕЦ КАК Контрагент,
		|	Поручение.СчетКонтрагента КАК СчетКонтрагента,
		|	ВЫБОР
		|		КОГДА Поручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоручение.ВводВДУ)
		|			ТОГДА ТорговыеКоды.АналитическийСчетЦБ
		|		ИНАЧЕ ТорговыеКоды.АналитическийСчетДС
		|	КОНЕЦ КАК АналитическийСчетПлательщик,
		|	ДоговорыДУ.Код КАК НомерДУ,
		|	НачислениеЗадолженности.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ПорученияПоДС
		|ИЗ
		|	Документ.Поручение КАК Поручение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорДУ КАК ДоговорыДУ
		|		ПО Поручение.ДоговорДУ = ДоговорыДУ.Ссылка
		|			И (ДоговорыДУ.Пул = &Пул)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
		|		ПО Поручение.Ссылка = ПоступлениеНаРасчетныйСчет.ПлановаяПозиция
		|			И (ПоступлениеНаРасчетныйСчет.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
		|		ПО Поручение.ДоговорДУ = НачислениеЗадолженности.ДоговорДУ
		|			И (НачислениеЗадолженности.Контрагент = &КонтрагентНДФЛ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АналитическиеСчета КАК АналитическиеСчета
		|		ПО Поручение.АналитическийСчетПриемник = АналитическиеСчета.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТорговыеКоды КАК ТорговыеКоды
		|		ПО Поручение.ДоговорДУ = ТорговыеКоды.ДоговорДУ
		|ГДЕ
		|	Поручение.ВидОперации = &ВидОперации
		|	И ПоступлениеНаРасчетныйСчет.Ссылка ЕСТЬ NULL
		|	И ВЫБОР
		|			КОГДА Поручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоручение.Перевод)
		|				ТОГДА Поручение.АналитическийСчетИсточник = ТорговыеКоды.АналитическийСчетДС
		|						И Поручение.АналитическийСчетПриемник.МестоХранения = &ЕРС
		|			ИНАЧЕ НЕ &НаличиеНачисленияНДФЛ
		|					ИЛИ НЕ НачислениеЗадолженности.Ссылка ЕСТЬ NULL
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсторияСтатусовОбъектовСрезПоследних.Объект КАК ПоручениеПоДС,
		|	ИсторияСтатусовОбъектовСрезПоследних.Статус КАК Статус
		|ПОМЕСТИТЬ ВТ_СтатусПорученийПоДС
		|ИЗ
		|	РегистрСведений.ИсторияСтатусовОбъектов.СрезПоследних(
		|			,
		|			Объект В
		|				(ВЫБРАТЬ
		|					ПорученияПоДС.ПоручениеПоДС
		|				ИЗ
		|					ВТ_ПорученияПоДС КАК ПорученияПоДС)) КАК ИсторияСтатусовОбъектовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПорученияПоДС.ПоручениеПоДС КАК ПоручениеПоДС,
		|	ПорученияПоДС.ДоговорДУ КАК ДоговорДУ,
		|	ПорученияПоДС.СуммаДС КАК СуммаДС,
		|	ПорученияПоДС.ВидОперации КАК ВидОперации,
		|	ПорученияПоДС.АналитическийСчет КАК АналитическийСчет,
		|	ПорученияПоДС.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ПорученияПоДС.Контрагент КАК Контрагент,
		|	ПорученияПоДС.СчетКонтрагента КАК СчетКонтрагента,
		|	ПорученияПоДС.АналитическийСчетПлательщик КАК АналитическийСчетПлательщик,
		|	ПорученияПоДС.НомерДУ КАК НомерДУ
		|ИЗ
		|	ВТ_ПорученияПоДС КАК ПорученияПоДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтатусПорученийПоДС КАК СтатусПорученийПоДС
		|		ПО ПорученияПоДС.ПоручениеПоДС = СтатусПорученийПоДС.ПоручениеПоДС
		|			И (СтатусПорученийПоДС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектов.Новый))";
	
	Запрос.УстановитьПараметр("Пул", Пул);
	Запрос.УстановитьПараметр("ЕРС", ЕРС);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	Запрос.УстановитьПараметр("НаличиеНачисленияНДФЛ", НаличиеНачисленияНДФЛ);
	Запрос.УстановитьПараметр("КонтрагентНДФЛ", КонтрагентНДФЛ);
	
	ОбщегоНазначенияДУ.ДобавитьВЛогОтладки(Запрос, "ПоступленияНаРасчетныйСчет_РозничноеДУ.ПорученияПоДС");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		Если ВидОперации = Перечисления.ВидыОперацийПоручение.Перевод Тогда
			ПоручениПоДС = ПорученияПоДС.Добавить();
		КонецЕсли;
		
		Если ВидОперации = Перечисления.ВидыОперацийПоручение.ВводВДУ Тогда
			ПоручениПоДС = ПорученияПоДСВвод.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ПоручениПоДС, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьПоступленияДС(ВидОперации) Экспорт

	Если ВидОперации = Перечисления.ВидыОперацийПоручение.Перевод Тогда
		Настройки = Настройки(Перечисления.ВидыОперацийПоручение.Перевод);
		Для каждого ПоручениеПоДС Из ПорученияПоДС Цикл
			Если ПоручениеПоДС.ПоступлениеНаРасчетныйСчет = Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка() Тогда
				ПоручениеПоДС.ПоступлениеНаРасчетныйСчет = Поступление(ПоручениеПоДС, Настройки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийПоручение.ВводВДУ Тогда
		Настройки = Настройки(Перечисления.ВидыОперацийПоручение.ВводВДУ);
		Для каждого ПоручениеПоДС Из ПорученияПоДСВвод Цикл
			Если ПоручениеПоДС.ПоступлениеНаРасчетныйСчет = Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка() Тогда
				ПоручениеПоДС.ПоступлениеНаРасчетныйСчет = Поступление(ПоручениеПоДС, Настройки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Поступление(ПоручениеПоДС, Настройки)

	Поступление = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
	Поступление.Дата = ДатаПоступления + 9*3600;
	Поступление.ДатаВходящегоДокумента = ДатаПоступления;
	Поступление.ДоговорДУ = ПоручениеПоДС.ДоговорДУ;
	
	Поступление.УстановитьНовыйНомер();
	Поступление.БУ = Истина;
	Поступление.ВУ = Истина;
	Поступление.УУ = Истина;
	
	Поступление.НомерВходящегоДокумента = Настройки.ВхНомер;
	Поступление.ВидОперации = Настройки.ВидОперации;
	Поступление.ПлановаяПозиция = ПоручениеПоДС.ПоручениеПоДС;
	Поступление.ДокументОснование = ПоручениеПоДС.ПоручениеПоДС;
	Поступление.СчетДоговораДУ = ЕРС;
	Поступление.АналитическийСчет = ПоручениеПоДС.АналитическийСчет;
	Поступление.СтатьяДвиженияДенежныхСредств = Настройки.СтатьяДДС;
	Поступление.СтатьяЗатрат = Настройки.СтатьяЗатрат;
	Поступление.СчетБанк = ПланыСчетов.Хозрасчетный.РасчетныеСчета;
	
	Поступление.ВалютаДокумента = Справочники.Валюты.RUB;
	Поступление.КурсВзаиморасчетов = 1;
	Поступление.КратностьВзаиморасчетов = 1;
	Поступление.СуммаДокумента = ПоручениеПоДС.СуммаДС;
	
	// Данные корреспондента
	Поступление.Контрагент = ПоручениеПоДС.Контрагент;
	Поступление.СчетКонтрагента = ПоручениеПоДС.СчетКонтрагента;
	Поступление.ДоговорКонтрагента = ПоручениеПоДС.ДоговорКонтрагента;
	Поступление.СчетУчетаРасчетовСКонтрагентом = Настройки.СчетРасчетов;
	Поступление.АналитическийСчетПлательщик = ПоручениеПоДС.АналитическийСчетПлательщик;
	
	Поступление.НазначениеПлатежа = Настройки.НазначениеПлатежа + " " + ПоручениеПоДС.НомерДУ;
	
	// Проверка заполнения
	Если НЕ Поступление.ПроверитьЗаполнение() Тогда
		Описание = НСтр("ru = 'В документе %1 с видом операции: %2 не удалось пройти тест на заполненность обязательных реквизитов.'");
		Описание = СтрШаблон(Описание, Поступление, Поступление.ВидОперации);
		Отказ = Истина;
	КонецЕсли;
	
	// Проведение документа
	Попытка 
		Поступление.Записать(РежимЗаписиДокумента.Проведение);
		ПоступлениеВозврат = Поступление.Ссылка;
	Исключение
		Описание = ОписаниеОшибки();
		ОбщегоНазначенияДУКлиентСервер.СообщитьОбОшибке(Описание);
		ПоступлениеВозврат = Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка();
	КонецПопытки;
	
	Возврат ПоступлениеВозврат;

КонецФункции

Функция Настройки(ВидОперации)

	Настройки = Новый Структура;
	Если ВидОперации = Перечисления.ВидыОперацийПоручение.ВводВДУ Тогда
		Настройки.Вставить("ВхНомер", ВхНомерВвод);
		Настройки.Вставить("СтатьяДДС", СтатьяДДСВвод);
		Настройки.Вставить("СтатьяЗатрат", СтатьяЗатратВвод);
		Настройки.Вставить("СчетРасчетов", СчетРасчетовВвод);
		Настройки.Вставить("НазначениеПлатежа", НазначениеПлатежаВвод);
		Настройки.Вставить("ВидОперации", Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление);
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоручение.Перевод Тогда
		Настройки.Вставить("ВхНомер", ВхНомер);
		Настройки.Вставить("СтатьяДДС", СтатьяДДС);
		Настройки.Вставить("СтатьяЗатрат", СтатьяЗатрат);
		Настройки.Вставить("СчетРасчетов", СчетРасчетов);
		Настройки.Вставить("НазначениеПлатежа", НазначениеПлатежа);
		Настройки.Вставить("ВидОперации", Перечисления.ВидыОперацийПоступлениеДенежныхСредств.СписаниеСБрокерскогоСчета);
	КонецЕсли;
	
	Возврат Настройки;

КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли



