// Режим торгов
Функция ПоискРежимаТоргов(Знач Код, Знач Наименование = "Автоматический ввод данных") Экспорт
	СправочникРежимыТоргов = Справочники.РежимыТоргов.НайтиПоКоду(СокрЛП(Код));
	Если СправочникРежимыТоргов.Пустая() Тогда
		СправочникРежимыТоргов = Справочники.РежимыТоргов.СоздатьЭлемент();
		СправочникРежимыТоргов.Код = СокрЛП(Код);
		СправочникРежимыТоргов.Наименование = СокрЛП(Наименование);
		СправочникРежимыТоргов.Записать();
	КонецЕсли;
	Возврат СправочникРежимыТоргов.Ссылка;
КонецФункции

