
Функция ОстаткиЦБПолучить(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОписаниеВызова = ВнешнийПрограммныйИнтерфейс.ЗафиксироватьНачало("httpСервисы.ReconciliationAPI.ОстаткиЦБПолучить", Запрос);
	
	ТелоЗапроса = "";
	
	Попытка
		
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
		
		ПараметрыЗапроса = ВнешнийПрограммныйИнтерфейс.ReconciliationAPIОстаткиЦБПараметрыЗапроса(ТелоЗапроса);
		
		РазделыСчетовДепоМХ = ФильтрПоРазделамСчетовДепоМХ();
		ПараметрыЗапроса.Вставить("РазделыСчетовДепоМХ", РазделыСчетовДепоМХ);
		
		СтруктураОтвета = ВнешнийПрограммныйИнтерфейс.ReconciliationAPIОстаткиЦБ(ПараметрыЗапроса);
		
		Если Не ЗначениеЗаполнено(СтруктураОтвета) Тогда
			
			ОписаниеОшибки = "Ошибка во входных параметрах";
			
			Ответ = ВнешнийПрограммныйИнтерфейс.httpОтветКлиентскаяОшибка(ОписаниеОшибки);
			
			ВнешнийПрограммныйИнтерфейс.ЗафиксироватьОшибку(ОписаниеВызова, ОписаниеОшибки, ТелоЗапроса);
			
		Иначе
			
			Ответ = ВнешнийПрограммныйИнтерфейс.httpОтветСТеломJSON(СтруктураОтвета, Запрос);
			
			ВнешнийПрограммныйИнтерфейс.ЗафиксироватьОкончание(ОписаниеВызова, ТелоЗапроса);
			
		КонецЕсли;
		
	Исключение
		
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Ответ = ВнешнийПрограммныйИнтерфейс.httpОтветВнутренняяОшибкаСервера(ОписаниеОшибки);
		
		ВнешнийПрограммныйИнтерфейс.ЗафиксироватьОшибку(ОписаниеВызова, ОписаниеОшибки, ТелоЗапроса);
		
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция ФильтрПоРазделамСчетовДепоМХ()
	
	РазделыСчетовДепоМХ = Неопределено;
	
	ИмяОтчета = "Отчет.СверкаЦБсНРДДепозитарий";
	ИмяИсточника = "СтруктураПараметровДепозитарийБэкофис"; // BSLLS:Typo-off
	СтруктураПараметров = ХранилищеОбщихНастроек.Загрузить(ИмяОтчета , ИмяИсточника);
	
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметровCustody(СтруктураПараметров, ИмяОтчета , ИмяИсточника);
	КонецЕсли;
	
	Если СтруктураПараметров <> Неопределено Тогда
		КоличествоРазделов = СтруктураПараметров.ФильтрПоРазделамСчетовДепоМХ.Количество();
		Если КоличествоРазделов > 0 Тогда
			РазделыСчетовДепоМХ = Новый Массив;
			Для Каждого Раздел Из СтруктураПараметров.ФильтрПоРазделамСчетовДепоМХ Цикл
				РазделыСчетовДепоМХ.Добавить(СокрЛП(Раздел.Код));
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РазделыСчетовДепоМХ;
	
КонецФункции

Процедура СтруктураПараметровCustody(СтруктураПараметров, ИмяОтчета , ИмяИсточника)
	
	РольCustody = Метаданные.Роли["Custody"];
	Выборка = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого ПользовательИБ Из Выборка Цикл
		Если ПользовательИБ.Роли.Содержит(РольCustody) Тогда
			СтруктураПараметров = ХранилищеОбщихНастроек.Загрузить(ИмяОтчета , ИмяИсточника, , ПользовательИБ.Имя);
			Если СтруктураПараметров <> Неопределено И СтруктураПараметров.ФильтрПоРазделамСчетовДепоМХ.Количество() > 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
