
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВладелецСчетаДепо = Объект.Владелец.Владелец;
	УстановитьВидимостьИДоступностьЭлементовФормы();
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = НаименованиеРазделаСчетаДепоНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПроцентыСписанияЦБСОбособленногоРаздела) Тогда
		ПараметрыВРегистре = ПараметрыОбособленногоРаздела(ДатаИзмененияПроцентаСписания);
		Если ПроцентСписанияСРаздела <> ПараметрыВРегистре.ПроцентСписания Тогда
			НаборЗаписей = РегистрыСведений.ПроцентыСписанияЦБСОбособленногоРаздела.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.РазделСчетаДЕПО.Установить(Объект.Ссылка);
			НаборЗаписей.Отбор.Период.Установить(ДатаИзмененияПроцентаСписания);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.РазделСчетаДЕПО = Объект.Ссылка;
				НоваяЗапись.Период = ДатаИзмененияПроцентаСписания;
			ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
				НоваяЗапись = НаборЗаписей[0];
			Иначе
				Возврат;
			КонецЕсли;
			НоваяЗапись.ПроцентСписания = ПроцентСписанияСРаздела;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементовФормы()
	Элементы.ГруппаСубклиент.Доступность = Перечисления.ТипыСчетовДепо.НоминальныхДержателей().Найти(Объект.Владелец.ТипСчетаДепо) <> Неопределено;
	Элементы.Субклиент.Доступность = Объект.РазделСубклиента;
	Элементы.Субклиент.ОтметкаНезаполненного = Объект.РазделСубклиента;
	Элементы.Субклиент.АвтоОтметкаНезаполненного = Объект.РазделСубклиента;
	
	Видимость = Объект.ТипРазделаСчетаДЕПО = ПредопределенноеЗначение("Перечисление.ТипыРазделовСчетовДЕПО.БлокированоОбособленный");
	Элементы.СписаниеПоПредписанию.Видимость = Видимость;
	Элементы.СписаниеПоПредписаниюБР.Видимость = Видимость;
	Элементы.ПроцентСписания.Видимость = Видимость;
	Элементы.ПроцентСписанияСРаздела.Видимость = Видимость;
	Элементы.ДатаИзмененияПроцентаСписания.Видимость = Видимость;
	Элементы.ПоказатьИсториюИзмененияПроцентаСписания.Видимость = Видимость;
КонецПроцедуры

&НаКлиенте
Процедура РазделСубклиентаПриИзменении(Элемент)
	УстановитьВидимостьИДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ТипРазделаСчетаДЕПОПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступностьЭлементовФормы();
	РаботаСДиалогамиКлиент.ТипРазделаСчетаДЕПОПриИзменении(Элемент, ЭтотОбъект);
	Объект.Наименование = НаименованиеРазделаСчетаДепоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИсториюИзмененияПроцентаСписания(Команда)
	
	ЗначениеОтбора = Новый Структура("РазделСчетаДЕПО", Объект.Ссылка);
	ПараметрыОткрытия = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.ПроцентыСписанияЦБСОбособленногоРаздела.ФормаСписка", ПараметрыОткрытия);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОбособленногоРаздела(ДатаДанных)
	
	Результат = Новый Структура();
	Результат.Вставить("Дата", ДатаДанных);
	Результат.Вставить("ПроцентСписания", 0);

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроцентыСписанияЦБСОбособленногоРазделаСрезПоследних.Период КАК Период,
	|	ПроцентыСписанияЦБСОбособленногоРазделаСрезПоследних.ПроцентСписания КАК ПроцентСписания
	|ИЗ
	|	РегистрСведений.ПроцентыСписанияЦБСОбособленногоРаздела.СрезПоследних(&Дата, РазделСчетаДЕПО = &Раздел) КАК ПроцентыСписанияЦБСОбособленногоРазделаСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ДатаДанных);
	Запрос.УстановитьПараметр("Раздел", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Дата = Выборка.Период;
		Результат.ПроцентСписания = Выборка.ПроцентСписания;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДатаИзмененияПроцентаСписанияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ПараметрыОбособленногоРаздела = ПараметрыОбособленногоРаздела(ДатаИзмененияПроцентаСписания);
	ПроцентСписанияСРаздела = ПараметрыОбособленногоРаздела.ПроцентСписания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентСписанияСРазделаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделСчетаДепоМХНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСДиалогамиКлиент.РазделСчетаДепоМХНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделСчетаДепоМХАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора = РаботаСДиалогамиКлиент.ДанныеВыбораСУчетомТипаРаздела(
	Объект.ТипРазделаСчетаДЕПО, ПараметрыПолученияДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПараметрыОбособленногоРаздела = ПараметрыОбособленногоРаздела(ТекущаяДатаСеанса());
	ПроцентСписанияСРаздела = ПараметрыОбособленногоРаздела.ПроцентСписания;
	ДатаИзмененияПроцентаСписания = ПараметрыОбособленногоРаздела.Дата;
	
КонецПроцедуры

&НаСервере
Функция НаименованиеРазделаСчетаДепоНаСервере()
	СправочникОбъект = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.РазделыСчетаДепо"));
	Возврат СправочникОбъект.НаименованиеРазделаСчетаДепо();
КонецФункции