
/////////////////////////////////////////////////////////////////////////////////////////
// ОСНОВНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ КОМАНДЫ

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Для Каждого Документ ИЗ ПараметрКоманды Цикл
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Проведен, УведомлениеОтправлено");
		Если Не ЗначениеЗаполнено(Документ) ИЛИ НЕ РеквизитыДокумента.Проведен Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Выгрузка поручения не выполнена, т.к. возможна только для проведенного документа.");
			Продолжить;
		КонецЕсли;
		
		СтруктураВыгрузки = Новый Структура("ПоручениеСсылка, ОшибкиВыгрузки, КодОтчета", Документ, "",
			ПредопределенноеЗначение("Справочник.ЭтапыКД.ПустаяСсылка"));
		
		Если РеквизитыДокумента.УведомлениеОтправлено Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Выгрузка поручения " + СокрЛП(Документ.Ссылка) + ". Уведомление было отправлено ранее");
			Продолжить;
		Иначе
			ВыгрузитьДокументНаСервере(СтруктураВыгрузки);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураВыгрузки.ОшибкиВыгрузки) Тогда
			СообщениеОбОшибке = "Выгрузка поручения %ДокументСсылка% не выполнена:
						|" + СтруктураВыгрузки.ОшибкиВыгрузки;
			СообщениеОбОшибке = СтрЗаменить(СообщениеОбОшибке, "%ДокументСсылка%", СтруктураВыгрузки.ПоручениеСсылка);
			ОбщегоНазначения.СообщитьОбОшибке(СообщениеОбОшибке);
		Иначе
			СообщениеОбУспешнойОбработке = "Выгрузка в НРД. Документ %ДокументСсылка% выгружен";
			СообщениеОбУспешнойОбработке = СтрЗаменить(СообщениеОбУспешнойОбработке, "%ДокументСсылка%", СтруктураВыгрузки.ПоручениеСсылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбУспешнойОбработке);
		КонецЕсли;
		
		Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
			Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Документ.Поручение.Форма.ФормаДокумента" Тогда
				ДоступностьКоманды = НЕ РеквизитыДокумента.УведомлениеОтправлено;
				ПараметрыВыполненияКоманды.Источник.Элементы.ФормаДокументПоручениеВыгрузитьПоручение.Доступность = ДоступностьКоманды;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
 
&НаСервере
Процедура ВыгрузитьДокументНаСервере(СтруктураВыгрузки)
	
	Если ВозможнаИНеобходимаВыгрузка(СтруктураВыгрузки) Тогда
		ВидКД = СтруктураВыгрузки.ПоручениеСсылка.ВидКД;
		Если ВидКДПринадлежитСписку(ВидКД, "MEET,XMET,BMET,OMET") Тогда
			ВыгрузитьСобраниеВXML(СтруктураВыгрузки);
			УстановитьПризнакУведомлениеОтправлено(СтруктураВыгрузки);
		ИначеЕсли ВидКДПринадлежитСписку(ВидКД, "BIDS,TEND,PRIO") Тогда
			ВыгрузитьВыкупВXML(СтруктураВыгрузки);
			УстановитьПризнакУведомлениеОтправлено(СтруктураВыгрузки);
		Иначе 
			УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "!!! Для данного вида КД не определен формат выгрузки");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
 
&НаСервере
Функция ВозможнаИНеобходимаВыгрузка(СтруктураВыгрузки)
	
	ДокументСсылка = СтруктураВыгрузки.ПоручениеСсылка;
	
	Если НЕ ДокументСсылка.ВидОперацииД = Справочники.ВидыОпераций.УчастиеВКД Тогда
		УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "Выгрузка поручения возможна только для поручения на участие в КД!");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ДокументСсылка.Проведен Тогда
		УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "! Не заполнен и/или не проведен документ поручения");
		Возврат Ложь;
	КонецЕсли;
	ВидКД = ДокументСсылка.ВидКД;
	Если НЕ ЗначениеЗаполнено(ВидКД) Тогда
		УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "! Не заполнено значение реквизита 'Вид корпоративного действия'");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДокументСсылка.КарточкаКД) Тогда
		УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "! Не заполнено значение реквизита 'Карточка КД'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураВыгрузки.ОшибкиВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоСобрание = Документы.КорпоративноеДействие_Новый.ЭтоВидКДСобрания(ДокументСсылка.ВидКД);
	ЭтоВыкуп 	= Документы.КорпоративноеДействие_Новый.ЭтоВидКДВыкупа(ДокументСсылка.ВидКД);
	Если НЕ (ЭтоСобрание ИЛИ ЭтоВыкуп ИЛИ ВидКДПринадлежитСписку(ДокументСсылка.ВидКД, "PRIO")) Тогда
		УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "! Для данного вида корпоративного действия выгрузка не предусмотрена");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка.ЦБ) Тогда
		УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "! Не заполнено значение реквизита 'Ценная бумага'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка.СчетДепо) Тогда
		УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "! Не заполнено значение реквизита 'Счет депо'");
	КонецЕсли;
	
	Если ЭтоСобрание И ДокументСсылка.ОтветыНаВопросыКГолосованию.Количество() = 0 Тогда
		УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "! Не найдено результатов по вопросам собрания");
	КонецЕсли;
	
	Если ЭтоВыкуп И НЕ ЗначениеЗаполнено(ДокументСсылка.НомерОпцииКДВыкуп) Тогда
		УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "! Не указан номер опции выкупа");
	КонецЕсли;
			
	Возврат НЕ ЗначениеЗаполнено(СтруктураВыгрузки.ОшибкиВыгрузки);
КонецФункции

&НаСервере
Процедура ВыгрузитьСобраниеВXML(СтруктураВыгрузки)
	
	СтруктураИдентификацииСообщения = СтруктураОбщейИнформацииОСообщении(СтруктураВыгрузки);
	СтруктураПолейЦБ 				= СтруктураИнформацииПоЦеннойБумаге(СтруктураВыгрузки);
	ДокументСсылка					= СтруктураВыгрузки.ПоручениеСсылка;
	ВидКД 							= ДокументСсылка.ВидКД;
	Если СтруктураПолейЦБ = Неопределено ИЛИ ЗначениеЗаполнено(СтруктураВыгрузки.ОшибкиВыгрузки) Тогда
		Возврат;
	КонецЕсли;
			
	РезультатГолосования = РезультатЗапросаПоОтветамДокументаСобрания(ДокументСсылка);
	ВыборкаПоКлиенту = РезультатГолосования.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоКлиенту.Следующий();
		
	Попытка
		
	MeetingInstruction = НовыйОбъектXDTOCorporateActionsNSD("MeetingInstruction");
		AppHdr = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(MeetingInstruction, "AppHdr");
			Fr = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(AppHdr, "Fr");
				OrgId = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(Fr, "OrgId");
					Id = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(OrgId, "Id");
						IdOrgId = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(Id, "OrgId");
							Othr = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(IdOrgId, "Othr");
							Othr.Id = 		СтруктураИдентификацииСообщения.FromId;
							Othr.Issr = 	СтруктураИдентификацииСообщения.Issr;
						IdOrgId.Othr.Добавить(Othr);			
					Id.OrgId = IdOrgId;
				OrgId.Id = Id;
			Fr.OrgId = OrgId;
		AppHdr.Fr = Fr;
			AppHdrTo = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(AppHdr, "To");
				OrgId = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(Fr, "OrgId");
					Id = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(OrgId, "Id");
						IdOrgId = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(Id, "OrgId");
							Othr = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(IdOrgId, "Othr");
							Othr.Id 		= СтруктураИдентификацииСообщения.ToId;
							Othr.Issr 		= СтруктураИдентификацииСообщения.Issr;
						IdOrgId.Othr.Добавить(Othr);			
					Id.OrgId = IdOrgId;
				OrgId.Id = Id;
			AppHdrTo.OrgId = OrgId;
		AppHdr.To = AppHdrTo;
		AppHdr.BizMsgIdr 	= СтруктураИдентификацииСообщения.BizMsgIdr;
		AppHdr.MsgDefIdr 	= СтруктураИдентификацииСообщения.MsgDefIdr;						
		AppHdr.BizSvc 		= СтруктураИдентификацииСообщения.BizSvc;							
		AppHdr.CreDt 		= СтруктураИдентификацииСообщения.CreDtUTC0;
	MeetingInstruction.AppHdr = AppHdr;
		Document = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(MeetingInstruction, "Document");
			MtgInstr = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(Document, "MtgInstr");
				Id = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(MtgInstr, "Id");
				Id.Id 		= СтруктураИдентификацииСообщения.BizMsgIdr;
				Id.CreDtTm 	= СтруктураИдентификацииСообщения.CreDt;
			MtgInstr.Id = Id;
				MtgRef = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(MtgInstr, "MtgRef");
				MtgRef.MtgId 		= СтруктураИдентификацииСообщения.MtgRefId;
				MtgRef.MtgDtAndTm 	= СтруктураИдентификацииСообщения.MtgDtAndTm;
				MtgRef.Tp 			= СтруктураИдентификацииСообщения.MtgTp;
					Clssfctn = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(MtgRef, "Clssfctn");
					Clssfctn.Cd 	= СтруктураИдентификацииСообщения.ClssfctnCd;
				MtgRef.Clssfctn = Clssfctn;
			MtgInstr.MtgRef = MtgRef;
				InstgPty = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(MtgInstr, "InstgPty");
					PrtryId = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(InstgPty, "PrtryId");
					PrtryId.Id 		= СтруктураИдентификацииСообщения.PrtryId;
					PrtryId.Issr 	= СтруктураИдентификацииСообщения.Issr;
				InstgPty.PrtryId = PrtryId;
			MtgInstr.InstgPty = InstgPty;
				SctyId = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(MtgInstr, "SctyId");
					Id = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(SctyId, "Id");
					Id.ISIN 		= СтруктураПолейЦБ.ISIN;
				SctyId.Id = Id;
				SctyId.Desc 		= СтруктураПолейЦБ.SctyDesc;
			MtgInstr.SctyId = SctyId;
				Instr = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(MtgInstr, "Instr");
				Instr.InstrId 		= "1";
				Instr.VoteExctnConf = false;					
					AcctDtls = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(Instr, "AcctDtls");
					AcctDtls.AcctId = СокрЛП(ВыборкаПоКлиенту.СчетДепо.Код);
						InstdBal = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(AcctDtls, "InstdBal");
							Bal = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(InstdBal, "Bal");
							Bal.Unit = ВыборкаПоКлиенту.Unit;
						InstdBal.Bal = Bal;
					AcctDtls.InstdBal.Добавить(InstdBal);
				Instr.AcctDtls = AcctDtls;
					VoteDtls = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(Instr, "VoteDtls");
						ВыборкаОтветов = ВыборкаПоКлиенту.Выбрать();
						VoteInstrForAgndRsltn = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(VoteDtls, "VoteInstrForAgndRsltn");
						Пока ВыборкаОтветов.Следующий() Цикл
							Если ВидКДПринадлежитСписку(ВидКД, "OMET") Тогда 
								GblVoteInstr = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(VoteInstrForAgndRsltn, "GblVoteInstr");
								GblVoteInstr.IssrLabl = ВыборкаОтветов.IssrLabl;
								Если ЗначениеЗаполнено(ВыборкаОтветов.VoteFor) Тогда
									GblVoteInstr.VoteOptn = "CFOR";
								ИначеЕсли ЗначениеЗаполнено(ВыборкаОтветов.VoteAgnst) Тогда
									GblVoteInstr.VoteOptn = "CAGS";
								КонецЕсли;
								VoteInstrForAgndRsltn.GblVoteInstr.Добавить(GblVoteInstr);
							Иначе 
								VoteInstr = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(VoteInstrForAgndRsltn, "VoteInstr");
								VoteInstr.IssrLabl = ВыборкаОтветов.IssrLabl;
								Если ЗначениеЗаполнено(ВыборкаОтветов.VoteFor) Тогда
									VoteInstr.For = ВыборкаОтветов.VoteFor;
								КонецЕсли;
								Если ЗначениеЗаполнено(ВыборкаОтветов.VoteAgnst) Тогда
									VoteInstr.Agnst = ВыборкаОтветов.VoteAgnst;
								КонецЕсли;
								Если ЗначениеЗаполнено(ВыборкаОтветов.VoteAbstn) Тогда
									VoteInstr.Abstn = ВыборкаОтветов.VoteAbstn;
								КонецЕсли;
								VoteInstrForAgndRsltn.VoteInstr.Добавить(VoteInstr);
							КонецЕсли;
						КонецЦикла;
					VoteDtls.VoteInstrForAgndRsltn = VoteInstrForAgndRsltn;
				Instr.VoteDtls = VoteDtls;
			MtgInstr.Instr.Добавить(Instr);
		Document.MtgInstr = MtgInstr;
	MeetingInstruction.Document = Document;
	
	Исключение 		
		ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выгрузка поручения о КД в НРД'"),
					УровеньЖурналаРегистрации.Информация,, ДокументСсылка, 
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "Не удалось сформировать файл выгрузки: " + ПредставлениеОшибки);
		Возврат;
	КонецПопытки;
	
	ЗаписатьXMLЧерезВнешнийИсточник(СтруктураВыгрузки, MeetingInstruction, "MeetingInstruction");

КонецПроцедуры

&НаСервере
Процедура ВыгрузитьВыкупВXML(СтруктураВыгрузки)
	
	СтруктураИдентификацииСообщения = СтруктураОбщейИнформацииОСообщении(СтруктураВыгрузки);
	СтруктураПолейЦБ 				= СтруктураИнформацииПоЦеннойБумаге(СтруктураВыгрузки);
	ДокументСсылка					= СтруктураВыгрузки.ПоручениеСсылка;
	ВидКД 							= ДокументСсылка.ВидКД;
	Если СтруктураПолейЦБ = Неопределено ИЛИ ЗначениеЗаполнено(СтруктураВыгрузки.ОшибкиВыгрузки) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыкупа  = РезультатЗапросаПоОпциямиДокументаВыкупа(ДокументСсылка);
	СтруктураПоВыкупу = РезультатВыкупа.Выбрать();
	СтруктураПоВыкупу.Следующий();
 
	Попытка
		
	CorporateActionInstruction = НовыйОбъектXDTOCorporateActionsNSD("CorporateActionInstruction");
		AppHdr = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(CorporateActionInstruction, "AppHdr");
			Fr = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(AppHdr, "Fr");
				OrgId = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(Fr, "OrgId");
					Id = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(OrgId, "Id");
						IdOrgId = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(Id, "OrgId");
							Othr = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(IdOrgId, "Othr");
							Othr.Id = 		СтруктураИдентификацииСообщения.FromId;
							Othr.Issr = 	СтруктураИдентификацииСообщения.Issr;
						IdOrgId.Othr.Добавить(Othr);			
					Id.OrgId = IdOrgId;
				OrgId.Id = Id;
			Fr.OrgId = OrgId;
		AppHdr.Fr = Fr;
			AppHdrTo = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(AppHdr, "To");
				OrgId = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(Fr, "OrgId");
					Id = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(OrgId, "Id");
						IdOrgId = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(Id, "OrgId");
							Othr = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(IdOrgId, "Othr");
							Othr.Id 		= СтруктураИдентификацииСообщения.ToId;
							Othr.Issr 		= СтруктураИдентификацииСообщения.Issr;
						IdOrgId.Othr.Добавить(Othr);			
					Id.OrgId = IdOrgId;
				OrgId.Id = Id;
			AppHdrTo.OrgId = OrgId;
		AppHdr.To = AppHdrTo;
		AppHdr.BizMsgIdr 	= СтруктураИдентификацииСообщения.BizMsgIdr;
		AppHdr.MsgDefIdr 	= СтруктураИдентификацииСообщения.MsgDefIdr;						
		AppHdr.BizSvc 		= СтруктураИдентификацииСообщения.BizSvc;							
		AppHdr.CreDt 		= СтруктураИдентификацииСообщения.CreDtUTC0;
	CorporateActionInstruction.AppHdr = AppHdr;
		Document = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(CorporateActionInstruction, "Document");
			CorpActnInstr = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(Document, "CorpActnInstr");
				CorpActnGnlInf = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(CorpActnInstr, "CorpActnGnlInf");
				CorpActnGnlInf.CorpActnEvtId = СтруктураИдентификацииСообщения.CorpActnEvtId;
					EvtTp 		= НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(CorpActnGnlInf, "EvtTp");
					EvtTp.Cd 	= СтруктураИдентификацииСообщения.EvtTp;
				CorpActnGnlInf.EvtTp = EvtTp;
					UndrlygScty = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(CorpActnGnlInf, "UndrlygScty");
						FinInstrmId = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(UndrlygScty, "FinInstrmId");
						FinInstrmId.ISIN = СтруктураПолейЦБ.ISIN;
							OthrId = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(FinInstrmId, "OthrId");
							OthrId.Id = СтруктураПолейЦБ.SctyNSDRId;
								Tp = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(OthrId, "Tp");
								Tp.Prtry = "NSDR";
							OthrId.Tp = Tp;
						FinInstrmId.OthrId.Добавить(OthrId);
						OthrId = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(FinInstrmId, "OthrId");
							OthrId.Id = СтруктураПолейЦБ.UndrlygSctyId;
								Tp = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(OthrId, "Tp");
								Tp.Prtry = "RU";
							OthrId.Tp = Tp;
						FinInstrmId.OthrId.Добавить(OthrId);
						FinInstrmId.Desc = СтруктураПолейЦБ.UndrlygSctyDesc;
					UndrlygScty.FinInstrmId = FinInstrmId;
				CorpActnGnlInf.UndrlygScty = UndrlygScty;
			CorpActnInstr.CorpActnGnlInf = CorpActnGnlInf;
            	AcctDtls = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(CorpActnInstr, "AcctDtls");
				AcctDtls.SfkpgAcct = СтруктураПоВыкупу.SfkpgAcct;
			CorpActnInstr.AcctDtls = AcctDtls;
				Instr = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(CorpActnInstr, "CorpActnInstr");
					OptnNb = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(Instr, "OptnNb");
					OptnNb.Nb = СтруктураПоВыкупу.OptnNb;
				Instr.OptnNb = OptnNb;
					OptnTp = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(Instr, "OptnTp");
					OptnTp.Cd = СтруктураПоВыкупу.OptnTp;
				Instr.OptnTp = OptnTp;
					SctiesQty = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(Instr, "SctiesQty");
					Если ВидКДПринадлежитСписку(ВидКД, "TEND") Тогда
					    CondlQty = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(SctiesQty, "CondlQty");
						CondlQty.Unit = СтруктураПоВыкупу.CondlQty;
					SctiesQty.CondlQty = CondlQty;	
					//ИначеЕсли ВидКДПринадлежитСписку(ВидКД, "PRIO") Тогда
						//Идентификация новой ЦБ для PRIO
					    //SctyId = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(SctiesQty, "SctyId");
						//SctyId.Unit = СтруктураПоВыкупу.CondlQty;
					//SctiesQty.SctyId = SctyId;	
					КонецЕсли; 
						InstdOrQtyToRcv = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(SctiesQty, "InstdOrQtyToRcv");
							InstdQty = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(InstdOrQtyToRcv, "InstdQty");
								Qty = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(InstdQty, "Qty");
								Qty.Unit = СтруктураПоВыкупу.Unit;
							InstdQty.Qty = Qty;
						InstdOrQtyToRcv.InstdQty = InstdQty;
					SctiesQty.InstdOrQtyToRcv = InstdOrQtyToRcv;
				Instr.SctiesQty = SctiesQty;
			CorpActnInstr.CorpActnInstr = Instr;
			//Если ВидКДПринадлежитСписку(ВидКД, "PRIO") Тогда
			//  Информация о платеже
			//	SplmtryData = НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(CorpActnInstr, "SplmtryData");
			//CorpActnInstr.SplmtryData = SplmtryData;
			//КонецЕсли;
		Document.CorpActnInstr = CorpActnInstr;
	CorporateActionInstruction.Document = Document;
	
	Исключение 		
		ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выгрузка поручения о КД в НРД'"),
					УровеньЖурналаРегистрации.Информация,, ДокументСсылка, 
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "Не удалось сформировать файл выгрузки: " + ПредставлениеОшибки);
		Возврат;
	КонецПопытки;
	
	ЗаписатьXMLЧерезВнешнийИсточник(СтруктураВыгрузки, CorporateActionInstruction, "CorporateActionInstruction");

КонецПроцедуры

&НаСервере
Процедура ЗаписатьXMLЧерезВнешнийИсточник(СтруктураВыгрузки, ОбъектXDTO, ИмяОсновногоОбъекта)
	
	ДокументСсылка = СтруктураВыгрузки.ПоручениеСсылка;
	
	ЗаписьXML	= Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO, ИмяОсновногоОбъекта);
	СтрокаXML	= ЗаписьXML.Закрыть();
	
	СтрокаОписанияСхемы = "<"+ ИмяОсновногоОбъекта + " xmlns=""http://www.vtbcapital-broker.com/CorporateActionsNSD""" + 
											 " xmlns:xs=""http://www.w3.org/2001/XMLSchema""" + 
											 " xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"">";
	СтрокаXML	= СтрЗаменить(СтрокаXML, СтрокаОписанияСхемы, "<" + ИмяОсновногоОбъекта + ">");
	
	ТекстXML	= Новый ТекстовыйДокумент;
	ТекстXML.ДобавитьСтроку(СтрокаXML);
	
	ИмяФайлаXMLДляПередачи = СокрЛП(ДокументСсылка.Номер)+"_"+Формат(ТекущаяДата(), "ДФ=ddMMyyyy")+".xml";
	
	Попытка
		ПапкаДанных	= СокрЛП(ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.КаталогВыгрузкиРаскрытияСпискаВладельцевISO).Папка);
	  	ТекстXML.Записать(ПапкаДанных+"\"+ ИмяФайлаXMLДляПередачи);
		ЗарегистрироватьЭтапКД(СтруктураВыгрузки);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выгрузка поручения о КД в НРД'"),
					УровеньЖурналаРегистрации.Информация,,ДокументСсылка,
					"Выгружен файл " + ИмяФайлаXMLДляПередачи);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать файл!
											|
											|Возможно указанный в настройках каталог 'Каталог ISO' недоступен или путь некорректен!");
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьЭтапКД(СтруктураВыгрузки)
	
	ДокументСсылка 	= СтруктураВыгрузки.ПоручениеСсылка;
	Этап 			= СтруктураВыгрузки.КодОтчета;
	ТипУведомления 	= "NEWM";
	
	ТипУведомления = Справочники.ТипыУведомления.НайтиПоКоду(ТипУведомления);
	Если Этап.Пустая() Тогда
		УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "Не найден тип уведомления " + ТипУведомления + ". Этап КД не выполнен");
		Возврат;
	КонецЕсли;
	
	ЗаписьЭтапаКД = РегистрыСведений.ЭтапыКД.СоздатьМенеджерЗаписи();
	ЗаписьЭтапаКД.КД 				= ДокументСсылка.КарточкаКД;
	ЗаписьЭтапаКД.ДокументКД 		= ДокументСсылка;
	ЗаписьЭтапаКД.Активность 		= Истина;
	ЗаписьЭтапаКД.Период 			= ДокументСсылка.Дата;
	ЗаписьЭтапаКД.ЭтапКД 			= Этап;
	ЗаписьЭтапаКД.КодОтчета 		= Этап.Код;
	ЗаписьЭтапаКД.НомерСообщения 	= СокрЛП(ДокументСсылка.Номер);
	ЗаписьЭтапаКД.ТипУведомления	= ТипУведомления;
	ЗаписьЭтапаКД.Исходящее			= Истина;
	ЗаписьЭтапаКД.Записать();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакУведомлениеОтправлено(СтруктураВыгрузки)
	ДокументСсылка  = СтруктураВыгрузки.ПоручениеСсылка;
	ДокОбъект 		= ДокументСсылка.ПолучитьОбъект();
	ДокОбъект.УведомлениеОтправлено = Истина;
	ДокОбъект.Записать();
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ ДАННЫХ

&НаСервере
Функция СтруктураИнформацииПоЦеннойБумаге(СтруктураВыгрузки)
	Поручение 			= СтруктураВыгрузки.ПоручениеСсылка;
	ЦеннаяБумага 		= Поручение.ЦБ;
	СтруктураИнформации = Новый Структура;
	ЗапросСпискаКодовЗагрузкиЦБ	= Новый Запрос(ТекстЗапросаПолученияКодаЗагрузкиЦБ());
	ЗапросСпискаКодовЗагрузкиЦБ.УстановитьПараметр("Владелец", ЦеннаяБумага);
	ЗапросСпискаКодовЗагрузкиЦБ.УстановитьПараметр("Биржа"	 , Константы.КлассификаторЗагрузкиНДЦ.Получить());
	ЗапросСпискаКодовЗагрузкиЦБ.УстановитьПараметр("Дата"	 , Поручение.Дата);
	СписокКодовЗагрузкиЦБ = ЗапросСпискаКодовЗагрузкиЦБ.Выполнить().Выгрузить();
	Если СписокКодовЗагрузкиЦБ.Количество()>0 Тогда
		КодЗагрузкиЦБ	= СокрЛП(СписокКодовЗагрузкиЦБ[0].Код);
	Иначе
		УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "! Для 'Ценной бумаги' не найден код загрузки 'НДЦ'");
		Возврат Неопределено;
	КонецЕсли;
	НомерРегистрации = СокрЛП(ЦеннаяБумага.НомерРегистрации);
	Если НЕ ЗначениеЗаполнено(НомерРегистрации) Тогда 
		УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "! Для 'Ценной бумаги' не заполнен регистрационный номер");
		Возврат Неопределено;
	КонецЕсли;
	ОписаниеЦБПоФормеНРД = КодЗагрузкиЦБ+"#"
							+ Лев(СокрЛП(ЦеннаяБумага.ISIN), 2)+"#"
							+ СокрЛП(ЦеннаяБумага.НомерРегистрации)+"#"
							+ СокрЛП(ЦеннаяБумага.Наименование);
	СтруктураИнформации.Вставить("ISIN",			СокрЛП(ЦеннаяБумага.ISIN));					// ISIN ценной бумаги
	СтруктураИнформации.Вставить("SctyDesc",		ОписаниеЦБПоФормеНРД);						// Описание ценной бумаги по форме НРД 
	СтруктураИнформации.Вставить("SctyNSDRId",		КодЗагрузкиЦБ);								// Код НРД
	СтруктураИнформации.Вставить("UndrlygSctyId",	НомерРегистрации);							// Гос номер
	СтруктураИнформации.Вставить("UndrlygSctyDesc",	СокрЛП(ЦеннаяБумага.Наименование));			// Наименование
	Возврат СтруктураИнформации;
КонецФункции

&НаСервере
Функция ТекстЗапросаПолученияКодаЗагрузкиЦБ()
	Возврат "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	КодыЗагрузки.Код
	        |ИЗ
	        |	Справочник.КодыЗагрузки КАК КодыЗагрузки
	        |ГДЕ
	        |	НЕ КодыЗагрузки.ПометкаУдаления
	        |	И КодыЗагрузки.Владелец = &Владелец
	        |	И КодыЗагрузки.Биржа = &Биржа
	        |	И (НАЧАЛОПЕРИОДА(КодыЗагрузки.ДатаОкончанияДействия, ДЕНЬ) = ДАТАВРЕМЯ(1, 1, 1)
	        |			ИЛИ НАЧАЛОПЕРИОДА(КодыЗагрузки.ДатаОкончанияДействия, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ))";
КонецФункции

&НаСервере
Функция СтруктураОбщейИнформацииОСообщении(СтруктураВыгрузки)
	
	ДокументСсылка = СтруктураВыгрузки.ПоручениеСсылка;
	
	ВидКД = ДокументСсылка.ВидКД;
	
	СтруктураИнформации = Новый Структура;
	
	СтруктураИнформации.Вставить("Issr",	"NSDR");											//Организация присвоившая код = НРД
	СтруктураИнформации.Вставить("FromId", 	"MC0292900000");									//Отправитель = "Код НРД депонента"
	СтруктураИнформации.Вставить("ToId", 	"NDC000000000");									//Получатель  = "Код НРД получателя"
	
	СтруктураИнформации.Вставить("BizMsgIdr",   ОбщегоНазначенияКлиентСервер.Транслит(СокрЛП(ДокументСсылка.Номер)));			//Идентификатор бизнес-сообщения, Исходящий номер инструкции
	СтруктураИнформации.Вставить("CreDtUTC0",   Формат(УниверсальноеВремя(ДокументСсылка.Дата), "ДФ=yyyy-MM-ddTHH:mm:ssZ"));	//Дата и время создания сообщения (универсальное)
	СтруктураИнформации.Вставить("CreDt", 		Формат(ДокументСсылка.Дата, "ДФ=yyyy-MM-ddTHH:mm:ssZ"));						//Дата и время создания сообщения
	КарточкаКД = ДокументСсылка.КарточкаКД;
	РеференсКД = КарточкаКД.КДРеференс;
	СтруктураИнформации.Вставить("MtgRefId",		РеференсКД);																//	Референс КД собрания
	СтруктураИнформации.Вставить("MtgDtAndTm",		КарточкаКД.ДатаПроведенияСобрания);											//	Дата проведения собрания
	СтруктураИнформации.Вставить("MtgTp",			СокрЛП(КарточкаКД.ТипСобрания.Код));										//	Тип собрания
	СтруктураИнформации.Вставить("ClssfctnCd",		СокрЛП(КарточкаКД.КлассСобрания.Код));										//	Классификация собрания
	СтруктураИнформации.Вставить("PrtryId",			СокрЛП(КарточкаКД.СчетДЕПО.Код));											//номер депозитарного счета в НРД, по которому направляется инструкция 
	СтруктураИнформации.Вставить("CorpActnEvtId",	РеференсКД);																//Референс КД выкупа
	СтруктураИнформации.Вставить("EvtTp",			СокрЛП(КарточкаКД.ВидКД.Код));												//Тип КД
	
	Если НЕ ЗначениеЗаполнено(РеференсКД) Тогда 
		УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "! Не указан референс КД");
	КонецЕсли;
	
	Если ВидКДПринадлежитСписку(ВидКД, "BIDS,TEND,PRIO") Тогда
		
		СтруктураИнформации.Вставить("BizSvc", 		"CA331");							//Бизнес-сервис (код формы)
		СтруктураИнформации.Вставить("MsgDefIdr",	"seev.033.001.04");					//Тип сообщения ISO 20022
		СтруктураВыгрузки.КодОтчета = Справочники.ЭтапыКД.ИнструкцияПоКорпоративномуДействию;
		
		Если НЕ ЗначениеЗаполнено(СтруктураИнформации.EvtTp) Тогда 
			УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "! Не указан тип КД в карточке КД");
		КонецЕсли;
		
	Иначе 
		
		СтруктураИнформации.Вставить("BizSvc", 		"CA044");							
		СтруктураИнформации.Вставить("MsgDefIdr",	"seev.004.001.04");	
		СтруктураВыгрузки.КодОтчета = Справочники.ЭтапыКД.ИнструкцияДляУчастияВСобрании;
				
		Если НЕ ЗначениеЗаполнено(СтруктураИнформации.MtgDtAndTm) Тогда 
			УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "! Не указана дата проведения собрания в карточке КД");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтруктураИнформации.MtgTp) Тогда 
			УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "! Не указан тип собрания в карточке КД");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтруктураИнформации.ClssfctnCd) Тогда 
			УстановитьСообщениеОбОшибке(СтруктураВыгрузки, "! Не указан класс собрания в карточке КД");
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат СтруктураИнформации;
КонецФункции

&НаСервере
Функция РезультатЗапросаПоОтветамДокументаСобрания(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоручениеОтветыНаВопросыКГолосованию.НомерВопроса КАК IssrLabl,
	               |	ПоручениеОтветыНаВопросыКГолосованию.За КАК VoteFor,
	               |	ПоручениеОтветыНаВопросыКГолосованию.Против КАК VoteAgnst,
	               |	ПоручениеОтветыНаВопросыКГолосованию.Воздержался КАК VoteAbstn,
	               |	ПоручениеОтветыНаВопросыКГолосованию.Ссылка.СчетДепо КАК СчетДепо,
	               |	ПоручениеОтветыНаВопросыКГолосованию.За + ПоручениеОтветыНаВопросыКГолосованию.Против + ПоручениеОтветыНаВопросыКГолосованию.Воздержался КАК Unit
	               |ИЗ
	               |	Документ.Поручение.ОтветыНаВопросыКГолосованию КАК ПоручениеОтветыНаВопросыКГолосованию
	               |ГДЕ
	               |	ПоручениеОтветыНаВопросыКГолосованию.Ссылка = &Ссылка
	               |ИТОГИ
	               |	МАКСИМУМ(Unit)
	               |ПО
	               |	СчетДепо";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Возврат Запрос.Выполнить();
КонецФункции

&НаСервере
Функция РезультатЗапросаПоОпциямиДокументаВыкупа(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Поручение.СчетДепо.Код КАК SfkpgAcct,
	               |	Поручение.КарточкаКД.МинимальноеКодичествоДляУчастияВКД КАК CondlQty,
	               |	Поручение.НомерОпцииКДВыкуп КАК OptnNb,
	               |	ВЫБОР
	               |		КОГДА Поручение.НомерОпцииКДВыкуп = ""001""
	               |			ТОГДА ""CASH""
	               |		ИНАЧЕ ""NOAC""
	               |	КОНЕЦ КАК OptnTp,
	               |	Поручение.КоличествоЦБ КАК Unit
	               |ИЗ
	               |	Документ.Поручение КАК Поручение
	               |ГДЕ
	               |	Поручение.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Возврат Запрос.Выполнить();
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С XDTO

&НаСервере
Функция НовыйОбъектXDTOCorporateActionsNSD(ИмяТипа)
	ПространствоИмен 	= "http://www.vtbcapital-broker.com/CorporateActionsNSD";
	ТипОбъекта 			= ФабрикаXDTO.Тип(ПространствоИмен, ИмяТипа);
	ОбъектXDTO 			= ФабрикаXDTO.Создать(ТипОбъекта);
	Возврат ОбъектXDTO;
КонецФункции

&НаСервере
Функция НовыйОбъектПоСвойствуXDTOCorporateActionsNSD(ОбъектРодитель, ИмяСвойства)
	Тип = ОбъектРодитель.Тип();
	НайденноеСвойство = Тип.Свойства.Получить(ИмяСвойства);
	Если НЕ НайденноеСвойство = Неопределено Тогда 
		ТипОбъекта = НайденноеСвойство.Тип;
		ОбъектXDTO = ФабрикаXDTO.Создать(ТипОбъекта);
		Возврат ОбъектXDTO;
	Иначе 
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выгрузка поручения о КД в НРД'"),
					УровеньЖурналаРегистрации.Информация,,, 
					"Не найдено свойство '" + ИмяСвойства + "' для типа XDTO '" + Тип + "'");
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ВидКДПринадлежитСписку(ВидКД, СтрокаВидов)
	МассивВидовКД = Новый Массив;
	МассивКодов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаВидов, ",");
	Для каждого Код из МассивКодов Цикл
		МассивВидовКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду(Код));
	КонецЦикла;
	Возврат НЕ МассивВидовКД.Найти(ВидКД) = Неопределено;
КонецФункции

&НаСервере
Процедура УстановитьСообщениеОбОшибке(СтруктураВыгрузки, Сообщение)
	СтруктураВыгрузки.ОшибкиВыгрузки = ?(СтруктураВыгрузки.ОшибкиВыгрузки = "", "", СтруктураВыгрузки.ОшибкиВыгрузки + Символы.ПС) + Сообщение;
КонецПроцедуры
