// Глобальные переменные
Перем ЕстьОшибки Экспорт;
Перем вклОтладка Экспорт;
Перем ОписаниеОшибки; // Описание ошибки, из-за которой произошла остановка обработки

// Локальные переменные
Перем ПространствоИменСервиса;
Перем МассивФайлов; // Массив элементов типа "Файл" запросов / ответов
Перем МассивОбработанныхОбъектов; // Массив элементов типа "Файл" запросов / ответов
Перем ФоновоеЗадание;
Перем КешБазыПИФ;
Перем ПроцедурыФункцииОбмена_МО_ФО;
Перем списВыгруженныеОбъекты;

//IMAPPS-19973++
Перем ДанныеДляРассылки;
//IMAPPS-19973--


#Область ПроцедурыФункцииДополнительныхОтчетовОбработок

Функция СведенияОВнешнейОбработке() Экспорт
	
	МассивСтрокИмен = Новый Массив;
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид","Обмены");
	ПараметрыРегистрации.Вставить("НаправлениеОбмена", Перечисления.НаправленияОбменов.Выгрузка);
	ПараметрыРегистрации.Вставить("Назначение",МассивСтрокИмен);
	ПараметрыРегистрации.Вставить("Наименование", "Выгрузка остатков МО ФО");
	ПараметрыРегистрации.Вставить("Версия", "1.33");
	ПараметрыРегистрации.Вставить("БезопасныйРежим",Ложь);
	ПараметрыРегистрации.Вставить("Информация","Выгрузка остатков МО ФО");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "2.1.1.12");
	ПараметрыРегистрации.Вставить("ИспользоватьДляФормыОбъекта", Ложь);
	ПараметрыРегистрации.Вставить("ИспользоватьДляФормыСписка", Истина);
	
	#Область DevOps
	Если ПараметрыРегистрации.Версия = "0.69" Тогда
		//ПараметрыРегистрации.Вставить("ПереименоватьПриЗагрузке", Истина);
		//ПараметрыРегистрации.Вставить("СтароеИмяФайла", "");
		//ПараметрыРегистрации.Вставить("НовоеИмяФайла", 	"");
	КонецЕсли;	
	#КонецОбласти
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд,"Выгрузка остатков МО ФО", "ЗагрузкаFront_MID", "ОткрытиеФормы");
	
	ДобавитьКоманду(ТаблицаКоманд,"Выгрузка остатков МО ФО (в фоне)", "ФоноваяВыгрузка", "ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	Если ИдентификаторКоманды <> "ФоноваяВыгрузка" Тогда Возврат; КонецЕсли;
	
	Если ТипЗнч(ПараметрыВыполненияКоманды) = Тип("Структура") тогда
		Если ПараметрыВыполненияКоманды.Свойство("Узел") Тогда
			ПараметрыВыполненияКоманды.Вставить("Узел", ПараметрыВыполненияКоманды.Узел);
		КонецЕсли;
	КонецЕсли;
	
	ДатаПоз = ТекущаяДата();
	
	ПредставлениеНастроек = УстановитьНастройки(ПараметрыВыполненияКоманды);
	
	ОписаниеОбменов.ВыполнитьКомандуПоОбменам(ЭтотОбъект, ИдентификаторКоманды, ПараметрыВыполненияКоманды, ПараметрыВыполненияКоманды.ДополнительнаяОбработкаСсылка.БезопасныйРежим);
	
КонецПроцедуры

#КонецОбласти

#Область DevOps

Процедура ЗагрузитьНастройки(ПараметрыРегистрации) Экспорт
	
	ВерсияПрименения = "1.02";
	ТекущаяРегистрация = СведенияОВнешнейОбработке();
	Если ВерсияПрименения = ТекущаяРегистрация.Версия Тогда
		ПараметрыРегистрации.Вставить("ЗагружатьНастройки", Истина);
		НастройкиПоУмолчанию(ЭтотОбъект);
		ЗаголовокНастроек = "";
		ЗначенияПараметров = УстановитьПараметры(ЗаголовокНастроек);
		ПараметрыРегистрации.Вставить("Настройки", Новый Структура("Значения, ЗаголовокНастроек", ЗначенияПараметров, ЗаголовокНастроек));
	КонецЕсли;	
	
КонецПроцедуры

Процедура НастройкиПоУмолчанию(Объект) Экспорт
	Объект.АдресWS = "http://amapfront/PROD_AVC_FO-DL/ws/avancore_ws.1cws?wsdl";		
	Объект.ОтборМандат = Ложь;		
	Объект.УзелОбменаДляРегистрацииНенайденных = ПланыОбмена.ИсточникиОбмена.ПолучитьСсылку(Новый УникальныйИдентификатор("6e7c3a3b-7a0d-11ec-80e2-005056b100fc"));
	Объект.УзелОбменаДляРегистрацииНенайденныхСчетовМандатов = ПланыОбмена.ИсточникиОбмена.ПолучитьСсылку(Новый УникальныйИдентификатор("6e7c3a3b-7a0d-11ec-80e2-005056b100fc"));		
	Объект.КоличестовДнейПроверкиИсполненияСделок = -35;
	Объект.ИсполнениеПоСуммеМО = Ложь;
	Объект.КоличествоПортфелейВПакете = 50;
КонецПроцедуры

Функция УстановитьПараметры(Заголовок) Экспорт
	
	Значения = Новый Структура();
	Значения.Вставить("УзелОбменаДляРегистрацииНенайденных",	ЭтотОбъект.УзелОбменаДляРегистрацииНенайденных);
	Значения.Вставить("УзелОбменаДляРегистрацииНенайденныхСчетовМандатов",	ЭтотОбъект.УзелОбменаДляРегистрацииНенайденныхСчетовМандатов);
	Значения.Вставить("АдресWS", ЭтотОбъект.АдресWS);
	Значения.Вставить("ОтборМандат", ЭтотОбъект.ОтборМандат);
	Значения.Вставить("КоличестовДнейПроверкиИсполненияСделок", ЭтотОбъект.КоличестовДнейПроверкиИсполненияСделок);
	Значения.Вставить("УК", ЭтотОбъект.УК);
	Значения.Вставить("ИсполнениеПоСуммеМО", ЭтотОбъект.ИсполнениеПоСуммеМО);
	Значения.Вставить("ДатаНачалоВыгрузкиРЕПО", ЭтотОбъект.ДатаНачалоВыгрузкиРЕПО);
	Значения.Вставить("КоличествоПортфелейВПакете", ЭтотОбъект.КоличествоПортфелейВПакете);
	Значения.Вставить("МандатДляТеста", ЭтотОбъект.МандатДляТеста);
	
	//IMAPPS-19973++
	Значения.Вставить("УчетнаяЗаписьПочты", ЭтотОбъект.УчетнаяЗаписьПочты);
	МассивЭлементов = Новый Массив;
	Для каждого ЭлементСписка Из СписокРассылки Цикл
		МассивЭлементов.Добавить(Новый Структура("Адрес,Представление",ЭлементСписка.Адрес,ЭлементСписка.Представление));
	КонецЦикла;
	Значения.Вставить("СписокРассылки", МассивЭлементов);
	//IMAPPS-19973--
	
	Возврат Значения;
	
КонецФункции

Функция УстановитьНастройки(Знач ПараметрыВыполненияКоманды)
	
	НастройкиВыполнения = ПараметрыВыполненияКоманды.ПараметрыДополнительнойОбработки;
	
	Если ТипЗнч(НастройкиВыполнения) <> Тип("Структура") Тогда
		Возврат "<Настройки не установлены>";
	КонецЕсли;
	
	ЗначенияНастроек		 = НастройкиВыполнения;
	ПредставлениеНастроек	 = "";
	
	УстановитьПользовательскиеНастройки(ЗначенияНастроек, ПредставлениеНастроек);
	
	Возврат ПредставлениеНастроек;
	
КонецФункции // УстановитьНастройки()

Процедура УстановитьПользовательскиеНастройки(Настройки, ПредставлениеНастроек="") Экспорт
	
	//ЗначенияНастроек = Настройки.Значения;
	//ТестовыйРежим = ЗначенияНастроек.ТестовыйРежим; УзелОбменаДляРегистрацииНенайденных
	Если Настройки <> Неопределено И Настройки.Свойство("Значения") Тогда
		Настройки.Значения.Свойство("УзелОбменаДляРегистрацииНенайденных", УзелОбменаДляРегистрацииНенайденных);
		Настройки.Значения.Свойство("УзелОбменаДляРегистрацииНенайденныхСчетовМандатов", УзелОбменаДляРегистрацииНенайденныхСчетовМандатов);
		ПредставлениеНастроек = "Узел для регистрации ненайденных: "+УзелОбменаДляРегистрацииНенайденных;
		Настройки.Значения.Свойство("АдресWS", АдресWS);
		Настройки.Значения.Свойство("ОтборМандат", ОтборМандат);
		Настройки.Значения.Свойство("КоличестовДнейПроверкиИсполненияСделок", КоличестовДнейПроверкиИсполненияСделок);
		Настройки.Значения.Свойство("УК", УК);
		Настройки.Значения.Свойство("ИсполнениеПоСуммеМО", ИсполнениеПоСуммеМО);
		Настройки.Значения.Свойство("ДатаНачалоВыгрузкиРЕПО", ДатаНачалоВыгрузкиРЕПО);
		Настройки.Значения.Свойство("КоличествоПортфелейВПакете", КоличествоПортфелейВПакете);
		Настройки.Значения.Свойство("МандатДляТеста", МандатДляТеста);
		
		//IMAPPS-19973++
		Настройки.Значения.Свойство("УчетнаяЗаписьПочты", УчетнаяЗаписьПочты);
		Если Настройки.Значения.Свойство("СписокРассылки") и ТипЗнч(Настройки.Значения.СписокРассылки) = Тип("Массив") Тогда
			Для каждого ЭлементСписка из Настройки.Значения.СписокРассылки Цикл
				ЗаполнитьЗначенияСвойств(СписокРассылки.Добавить(),ЭлементСписка);
			КонецЦикла;
		КонецЕсли;
		//IMAPPS-19973--
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ПрограммныйИнтерфейс

// Функция подготовки данных БД для выгрузки.
//
// Параметры:
//  Параметры  - Структура - содержит входные параметры, необходимые для работы обработки
//
// Возвращаемое значение:
//   Структура   - Содержит обязательные поля описатели результата выполнения:
//				   ЕстьОшибки - Булево - Показатель ошибок выполнения обработки;
//				   ОписаниеОшибок - Строка - Строка, содержащая описание ошибок.
//
// Дополнительно:
//	 1. В структуру переданных параметров можно передать параметр "Лог" типа "Табличный документ",
//      который будет прикреплен к Бизнес-процессу загрузки.
//   2. В структуру возврат можно передать любые данные (примитивного и ссылочного типа) для следующего шага.
//	 3. В структуру можно передать параметр "МассивСсылок" типа массив, содержащий ссылки выгружаемых реквизитов,
//		на основании которого будут произведены записи в регистр сведений "ПротоколОбмена".
//
Функция ПодготовитьДанные(Параметры) Экспорт

	Отказ = Ложь;
	//ТестовыйРежим = Ложь;
	ФоновоеЗадание = Истина;
	
	СтруктураВозврата = Новый Структура("ЕстьОшибки, ОписаниеОшибок", Ложь, "");
		
	Если НЕ ТипЗнч(Параметры) = Тип("Структура") Тогда
		СтруктураВозврата.ЕстьОшибки = Истина;
		СтруктураВозврата.ОписаниеОшибок = "Не определены параметры обработки";
		Возврат СтруктураВозврата;
	КонецЕсли; 
		
	Параметры.Вставить("ТекстовыйЛог", ТекстовыйЛог); //Ведется лог выгрузки
	
	// Сформируем отбор
	Отбор = СформироватьОтборДляФоновогоЗадания();
	
	// Заполним табличные части обработки
	Заполнить(Отбор, );

	Если ЦенныеБумаги.Количество() = 0
		И ДенежныеСредства.Количество() = 0 Тогда
		СтруктураВозврата.ЕстьОшибки = Истина;
		СтруктураВозврата.ОписаниеОшибок = "Данные для выгрузки отсутствуют";
	КонецЕсли; 
	
	Если НЕ СтруктураВозврата.ЕстьОшибки
		И ЕстьОшибки Тогда
		СтруктураВозврата.ЕстьОшибки = Истина;
		СтруктураВозврата.ОписаниеОшибок = ОписаниеОшибки;
	КонецЕсли; 
	
	Возврат СтруктураВозврата; 

КонецФункции

// Функция записи данных, подготовленных на предыдущем шаге.
//
// Параметры:
//	ДанныеОбмена - Структура - содержит структуру, полученную на шаге подготовки данных. 
//							   Может понадобиться для передачи доп. данных между шагами.
//  Параметры  - Структура - содержит входные параметры, необходимые для работы обработки.
//
// Возвращаемое значение:
//   Структура   - Содержит обязательные поля, описатели результата выполнения:
//				   ЕстьОшибки - Булево - Показатель ошибок выполнения обработки;
//				   ОписаниеОшибок - Строка - Строка, содержащая описание ошибок.
//
//
Функция ЗаписатьДанные(ДанныеОбмена, Параметры) Экспорт

	СтруктураВозврата = Новый Структура("ЕстьОшибки, ОписаниеОшибок", Ложь, ""); 
	
	Если НЕ ТипЗнч(Параметры) = Тип("Структура") Тогда
		СтруктураВозврата.ЕстьОшибки = Истина;
		СтруктураВозврата.ОписаниеОшибок = "Ошибочный тип переданных параметров";
		Возврат СтруктураВозврата;
	КонецЕсли; 
	
	//IMAPPS-19973++
	//Опубликовать();
	
	//Выполним в попытке для случая FAIL
	ЕстьИсключения = Ложь;
	Попытка
		Опубликовать();
	Исключение
		ЕстьИсключения = Истина;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;
	
	Попытка
		ТекстОповещения = "";
		Если ЕстьИсключения Тогда
			ТекстОповещения = "При выгрузке произошла исключительная ситуация:" + Символы.ПС + 
								КраткоеПредставлениеОшибки(ИнформацияОбОшибке) + Символы.ПС + Символы.ПС + 
								"Подробности смотрите по источнику обмена (ВыгрузкаОстатков_ФО) -> Перейти к бизнес-процессам";
		КонецЕсли;
		
		РассылкаСообщения("Загрузка остатков МО -> ФО", ТекстОповещения, ЕстьОшибки, ЕстьИсключения);
		
	Исключение
	КонецПопытки;
	
	
	Если ЕстьИсключения Тогда
		//Передадим исключение выше по стеку, чтобы сохранилось в описании выгрузки по узлу обмена
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецЕсли;
	//IMAPPS-19973--

	Если НЕ СтруктураВозврата.ЕстьОшибки
		И ЕстьОшибки Тогда
		СтруктураВозврата.ЕстьОшибки = Истина;
		СтруктураВозврата.ОписаниеОшибок = ОписаниеОшибки;
	КонецЕсли; 
	
	Возврат СтруктураВозврата;
	
КонецФункции // ЗаписатьДанные()

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункции

// Заполняет табличные части обработки на основании переданного отбора
//
// Параметры:
//  Отбор  - Структура - Структура содержащая массив объектов обработки
//                 		[Мандаты] - Массив - Массив элементов справочника мандатов
//						[СчетаМандатов] - Массив - массив элементов справочника счета мандатов
//
Процедура Заполнить(Отбор, ДатаЗаполнения) Экспорт
	Если ОтборМандат Тогда
		ЗаполнитьСписокМандатДляОтбора();	
	КонецЕсли;
	
	Если ДатаЗаполнения = Неопределено Тогда
		ДатаЗаполнения = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	ТаблицаОтборов = ПолучитьМассивМандатовДляОтбора(Отбор);
	Отбор.Вставить("ОтборМандаты", ТаблицаОтборов.ВыгрузитьКолонку("Мандат"));
	Отбор.Вставить("МассивКодМандат", ТаблицаОтборов.ВыгрузитьКолонку("КодМандата"));
	
	ДатаПоз = ДатаЗаполнения;
	ДатаДляФронт = НачалоДня(ДатаЗаполнения);
	
	ТабИсполСделк = ИсполнениеСделок(ДатаЗаполнения, Отбор); //RKatunin IMDEV-3438
	
	РЕПОДС = РЕПОДенежныеСредстваНаДату(ДатаДляФронт, Отбор); //RKatunin IMDEV-4022
	
	РЕПОДеньги.Загрузить(РЕПОДС);//RKatunin IMDEV-4022
	
	ЦБ = ЦенныеБумагиНаДату(ДатаЗаполнения, Отбор);
	ДС = ДенежныеСредстваНаДату(ДатаЗаполнения, Отбор);
	табСЧА = СЧА_РСА_НаДату(ДатаЗаполнения, Отбор);
	Блк = БлокировкиНаДату(ДатаЗаполнения, Отбор);
	
	ЦенныеБумаги.Загрузить(ЦБ);
	ДенежныеСредства.Загрузить(ДС);
	СЧА_РСА.Загрузить(табСЧА);
	Блокировки.Загрузить(Блк);
	ИсполненияПоСделкам.Загрузить(ТабИсполСделк); //RKatunin IMDEV-3438
	
	Для каждого СтрокаБлк Из Блокировки Цикл
		
		СтрокаБлк.Период = ДатаПоз;
		КодСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаБлк.СчетМандата, "КодСчета");
		СтрокаБлк.ОперацияВнешнийКод = "LOCK:" + КодСчета + ":" + Формат(ДатаДляФронт, "ДФ=yyyyMMddHHmmss");
		
	КонецЦикла;
	
КонецПроцедуры // Заполнить()

Функция ПолучитьТекстЗапросаДляВыгрузкиДСиЦБ()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	т.Портфель КАК Мандат,
	|	ВЫРАЗИТЬ(т.СубпортфельЦБ КАК Справочник.СчетаМандатов) КАК СчетМандата,
	|	т.Валюта КАК Валюта,
	// IMAPPS-32435++
	// |	ВЫБОР
	// |		КОГДА т.ДеньгиУчтеныМО
	// |			ТОГДА 0
	// |		ИНАЧЕ ВЫБОР
	// |				КОГДА т.Направление = ""Покупка""
	// |					ТОГДА -т.СуммаРЕПО
	// |				ИНАЧЕ т.СуммаРЕПО
	// |			КОНЕЦ
	// |	КОНЕЦ КАК Колво,
	// |	ВЫБОР
	// |		КОГДА т.ДеньгиУчтеныМО
	// |			ТОГДА 0
	// |		ИНАЧЕ ВЫБОР
	// |				КОГДА т.Направление = ""Покупка""
	// |					ТОГДА -т.СуммаРЕПО
	// |				ИНАЧЕ т.СуммаРЕПО
	// |			КОНЕЦ
	// |	КОНЕЦ КАК Стоим,
	
	// Выполняем "переворот" в любом случае, т.к. этот "переворот" уже выполнили 
	// в запросе из ФО "СделкиРЕПОДействующие"
	|	ВЫБОР
	|		КОГДА т.ДеньгиУчтеныМО
	|			ТОГДА 0
	|		ИНАЧЕ -т.СуммаРЕПО
    |	КОНЕЦ КАК Колво,
	|	ВЫБОР
	|		КОГДА т.ДеньгиУчтеныМО
	|			ТОГДА 0
	|		ИНАЧЕ -т.СуммаРЕПОРубли
    |	КОНЕЦ КАК Стоим,
	// IMAPPS-32435--
	|	ЛОЖЬ КАК ДоходыКПолучению,
	|	0 КАК СуммаЗадолженность
	|ПОМЕСТИТЬ втРЕПО
	|ИЗ
	|	&РЕПО КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Мандат КАК Мандат,
	|	ВЫРАЗИТЬ(т.СчетМандата КАК Справочник.СчетаМандатов) КАК СчетМандата,
	|	т.Валюта КАК Валюта,
	|	т.Количество КАК Колво,
	|	т.Стоимость КАК Стоим,
	|	т.ДоходыКПолучению КАК ДоходыКПолучению,
	|	т.Задолженность КАК СуммаЗадолженность
	|ПОМЕСТИТЬ втДС
	|ИЗ
	|	&ДС КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Мандат КАК Мандат,
	|	ВЫРАЗИТЬ(т.СчетМандата КАК Справочник.СчетаМандатов) КАК СчетМандата,
	|	т.Актив КАК Актив,
	|	т.Количество КАК Колво,
	|	т.Стоимость КАК Стоим,
	|	т.СуммаНКД КАК СуммаНКД,
	|	т.Задолженность КАК СуммаЗадолженность
	|ПОМЕСТИТЬ втЦБ
	|ИЗ
	|	&ЦБ КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Табл.Мандат КАК Мандат,
	|	Табл.СчетМандата,
	|	Табл.КодСчетаМандата КАК КодСчетаМандата,
	|	Табл.МХ,
	|	Табл.Актив,
	|	Табл.ДоходыКПолучению,
	|	СУММА(Табл.Колво) КАК Колво,
	|	СУММА(Табл.Стоим) КАК Стоим,
	|	СУММА(Табл.СуммаНКД) КАК СуммаНКД,
	|	СУММА(Табл.СуммаЗадолженность) КАК СуммаЗадолженность,
	|	СУММА(Табл.ДСиЗадолженность) КАК ДСиЗадолженность
	|ИЗ
	|	(ВЫБРАТЬ
	|		т.Мандат КАК Мандат,
	|		т.СчетМандата КАК СчетМандата,
	|		т.СчетМандата.КодСчета КАК КодСчетаМандата,
	|		т.СчетМандата.МестоХранения КАК МХ,
	|		т.Валюта КАК Актив,
	|		т.ДоходыКПолучению КАК ДоходыКПолучению,
	|		т.Колво КАК Колво,
	|		т.Стоим КАК Стоим,
	|		0 КАК СуммаНКД,
	|		т.СуммаЗадолженность КАК СуммаЗадолженность,
	|		т.Стоим + т.СуммаЗадолженность КАК ДСиЗадолженность
	|	ИЗ
	|		втРЕПО КАК т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		т.Мандат,
	|		т.СчетМандата,
	|		т.СчетМандата.КодСчета,
	|		т.СчетМандата.МестоХранения,
	|		т.Валюта,
	|		т.ДоходыКПолучению,
	|		т.Колво,
	|		т.Стоим,
	|		0,
	|		т.СуммаЗадолженность,
	|		т.Стоим + т.СуммаЗадолженность
	|	ИЗ
	|		втДС КАК т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		т.Мандат,
	|		т.СчетМандата,
	|		т.СчетМандата.КодСчета,
	|		т.СчетМандата.МестоХранения,
	|		т.Актив,
	|		ЛОЖЬ,
	|		т.Колво,
	|		т.Стоим,
	|		т.СуммаНКД,
	|		т.СуммаЗадолженность,
	|		т.СуммаЗадолженность
	|	ИЗ
	|		втЦБ КАК т) КАК Табл
	|
	|СГРУППИРОВАТЬ ПО
	|	Табл.СчетМандата,
	|	Табл.КодСчетаМандата,
	|	Табл.Мандат,
	|	Табл.МХ,
	|	Табл.Актив,
	|	Табл.ДоходыКПолучению
	|ИТОГИ
	|	МАКСИМУМ(КодСчетаМандата),
	|	СУММА(Колво)
	|ПО
	|	Мандат";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция НайтиПоКодуСчета(КодСчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетаМандатов.Ссылка
		|ИЗ
		|	Справочник.СчетаМандатов КАК СчетаМандатов
		|ГДЕ
		|	СчетаМандатов.КодСчета = &КодСчета";
	
	Запрос.УстановитьПараметр("КодСчета", КодСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.СчетаМандатов.ПустаяСсылка();
	
КонецФункции // НайтиПоКодуСчета()

Функция ОбработатьОшибкиЗагрузки(Ответ)

	Результат = новый Структура("ЕстьОшибки, ЕстьПредупреждения, ТекстОшибки", Ложь,  Ложь, Новый Массив);
    
    СписСубпортфель = Новый Массив;
	Для каждого РегОшибка Из Ответ.ОшибкиЗагрузки.РегистрыСведений Цикл
	    Если РегОшибка.Ошибка="Не заполнен субпортфель." Тогда
	    	Для каждого Субпортфель Из РегОшибка.Измерения Цикл
				Если Субпортфель.Измерение="Субпортфель" Тогда
					Для каждого КлючПоиска Из Субпортфель.КлючиПоиска Цикл
						Если КлючПоиска.Ключ="КодСчета" Тогда
							СчётМандата = НайтиПоКодуСчета(КлючПоиска.Значение);
							Если СписСубпортфель.Найти(СчётМандата)=Неопределено Тогда
								СписСубпортфель.Добавить(СчётМандата);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;						
				КонецЕсли;
			КонецЦикла;
			Результат.ЕстьОшибки = Истина;
			Продолжить;
		КонецЕсли;	
	КонецЦикла;	
	
	//IMAPPS-19973++
	//Если УзелОбменаДляРегистрацииНенайденныхСчетовМандатов <> Неопределено И СписСубпортфель.Количество() > 0 Тогда 
	Если ЗначениеЗаполнено(УзелОбменаДляРегистрацииНенайденныхСчетовМандатов) И СписСубпортфель.Количество() > 0 Тогда 
	//IMAPPS-19973--
		
		Для Каждого СчетМандата Из СписСубпортфель Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбменаДляРегистрацииНенайденныхСчетовМандатов, СчетМандата);
			//Результат.ТекстОшибки = Результат.ТекстОшибки + Символы.ПС + "Счёта мандата "+СчетМандата+" зарегистрированы к обмену. Узел: " + УзелОбменаДляРегистрацииНенайденныхСчетовМандатов;
			Результат.ТекстОшибки.Добавить("Счёта мандата "+СчетМандата+" зарегистрированы к обмену. Узел: " + УзелОбменаДляРегистрацииНенайденныхСчетовМандатов);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;	

КонецФункции // ОбработатьОшибкиЗагрузки()


// Производит публикацию данных для web-service из табличных частей обработки
//
// Параметры:
//  ПересчитатьРыночнуюСтоимость  - Булево - Значение параметра сервиса "ПересчитатьРыночнуюСтоимость"
//  ПересчитатьКомплаинс  		  - Булево - Значение параметра сервиса "ПересчитатьКомплаинс"
//
Процедура Опубликовать(ПересчитатьРыночнуюСтоимость = Ложь, ПересчитатьКомплаинс = Ложь, ДатаПубликации = Неопределено) Экспорт
	
	Если ДатаПубликации=Неопределено Тогда
		ДатаПубликации = ТекущаяДатаСеанса();
	КонецЕсли;
	
	НачалоОбработки = ТекущаяДатаСеанса();
	ИдентификаторСеанса = Новый УникальныйИдентификатор;
	
	ТекстовыйЛог.ДобавитьСтроку("--------- Position set ------------");
	
	СтруктураСервиса = ПолучитьОпределениеСервиса();
	Если СтруктураСервиса.ЕстьОшибки Тогда
		Сообщить(СтруктураСервиса.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	тхтОшибки = "";
	
	Попытка
		
		Определение = СтруктураСервиса.ОпределениеWS;
		ФабрикаСервиса = Определение.ФабрикаXDTO;
		
		Прокси = Новый WSПрокси(Определение, Определение.Сервисы[0].URIПространстваИмен, Определение.Сервисы[0].Имя, Определение.Сервисы[0].ТочкиПодключения[0].Имя);
		
		Если ЭтотОбъект.АдресWS="http://smsk02mg138u/AVC_PP_FO/ws/avancore_ws.1cws?wsdl" Тогда
			Прокси.Пользователь = "admin";
			Прокси.Пароль = "адм232882";
		КонецЕсли;
		
		ПроверитьИСоздатьВиртуальныеСубпортфели(Прокси, ФабрикаСервиса, Отказ, тхтОшибки);
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЕстьОшибки = Истина;
		ТекстовыйЛог.ДобавитьСтроку("Ошибки создания виртуальных субпортфелей");
		ТекстовыйЛог.ДобавитьСтроку(ОписаниеОшибки);
	КонецПопытки;
	
	КоличествоПакет = КоличествоПортфелейВПакете;
	КоличествоВПакете = 0;
	НовыйПакет = Истина;
	
	//IMDEV-3786 RKatunin
	//ОпубликоватьПорученияРЕПОМО(ФабрикаСервиса, Прокси);
	ОпубликоватьСделкиРЕПОМО(ФабрикаСервиса, Прокси);
	//IMDEV-3786 RKatunin
	
	СтруктураВыбора = Новый Структура("ДеньРасчета", Истина);
	СтрокиСделкиРЕПОМО = СделкиРЕПОМО.НайтиСтроки(СтруктураВыбора);
	ТЗСделкиРЕПОМО = СделкиРЕПОМО.Выгрузить(СтрокиСделкиРЕПОМО);
	ТЗСделкиРЕПОМО.Колонки.Добавить("ДеньгиУчтеныМО", Новый ОписаниеТипов("Булево"));
	ТЗСделкиРЕПОМО.ЗаполнитьЗначения(Ложь, "ДеньгиУчтеныМО");
	
	Для каждого СтрокаРЕПОДеньги Из РЕПОДеньги Цикл
		ЗаполнитьЗначенияСвойств(ТЗСделкиРЕПОМО.Добавить(), СтрокаРЕПОДеньги);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДС", ДенежныеСредства.Выгрузить());
	Запрос.УстановитьПараметр("ЦБ", ЦенныеБумаги.Выгрузить());
	Запрос.УстановитьПараметр("РЕПО", ТЗСделкиРЕПОМО);
	Запрос.Текст = ПолучитьТекстЗапросаДляВыгрузкиДСиЦБ();
	
	ВыборкаПортфели = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КоличествоПортфелейВсего = ВыборкаПортфели.Количество();
	КоличествоПортфелей = 0;
	
	Пока ВыборкаПортфели.Следующий() Цикл
		Попытка
			//IMAPPS-19973++
			ДанныеДляРассылки.КоличествоПортфелей = ДанныеДляРассылки.КоличествоПортфелей + 1;
			//IMAPPS-19973--
			
			Если Не ЗначениеЗаполнено(ВыборкаПортфели.Мандат.КодМандата) Тогда
				ТекстОшибки = "У мандата """ + ВыборкаПортфели.Мандат + """ не заполнен код мандата. Выгрузка по мандату не выполнена";
				Сообщить(ТекстОшибки);
				ТекстовыйЛог.ДобавитьСтроку(ТекстОшибки);
				ДобавитьОшибкуВДанныеДляРассылки(ВыборкаПортфели.Мандат, ТекстОшибки, ВыборкаПортфели.Колво);
				ЕстьОшибки = Истина;
				Продолжить;
			КонецЕсли;
			
			ствАктивыНеВыгружать = новый Соответствие;
			
			КоличествоВПакете = КоличествоВПакете + 1;
			КоличествоПортфелей = КоличествоПортфелей + 1;
			
			Если НовыйПакет = Истина Тогда
				
				ТЗАктивыРЕПО = СделкиРЕПОМО.Выгрузить();
				ТЗАктивыРЕПО.Очистить();
				
				ПакетХДТО = ПроцедурыФункцииОбмена_МО_ФО.хдтоСформироватьПакет(ФабрикаСервиса);
				ПакетХДТО.ИспользоватьЧастичнуюЗагрузкуПозиции = Ложь;
				ПакетХДТО.ДоступнаНеПолнаяПозиция = Истина;
				
				СоответствиеПортфелей = Новый Соответствие;
				МассивКодовПортфелейДляУдаленияБлокировок = Новый Массив;
				ТаблицаДляУдаленияБлокировок = Новый ТаблицаЗначений;
				ТаблицаДляУдаленияБлокировок.Колонки.Добавить("КодМандата");
				ТаблицаДляУдаленияБлокировок.Колонки.Добавить("КодСчета");
				ТаблицаДляУдаленияБлокировок.Колонки.Добавить("КодВалюты");
				
				ТаблицаПортфелей = Новый ТаблицаЗначений;
				ТаблицаПортфелей.Колонки.Добавить("Мандат", Новый ОписаниеТипов("СправочникСсылка.Мандаты"), "Мандат");
				ТаблицаПортфелей.Колонки.Добавить("Колво", Новый ОписаниеТипов("Число"), "Количество");
				
				ПакетХДТОФлагПозицииНеВыгружена = ПроцедурыФункцииОбмена_МО_ФО.хдтоСформироватьПакет(ФабрикаСервиса);
			КонецЕсли;
			
			ЕстьОшибкиПоПортфелю = ДобавитьВПакетМандат(ПакетХДТО, ВыборкаПортфели, ствАктивыНеВыгружать, ФабрикаСервиса);
			СоответствиеПортфелей.Вставить(ВыборкаПортфели.Мандат, ЕстьОшибкиПоПортфелю);
			НоваяСтрокаПортфелей = ТаблицаПортфелей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПортфелей, ВыборкаПортфели);
			
			СтруктураВыбора = Новый Структура("Портфель", ВыборкаПортфели.Мандат);
			СтрокиСделкиРЕПОМО = СделкиРЕПОМО.НайтиСтроки(СтруктураВыбора);
			Для каждого СтрокаСделкиРЕПОМО Из СтрокиСделкиРЕПОМО Цикл
				ДобавитьПакетСтрокуАктивыРЕПО(ПакетХДТО, ФабрикаСервиса, СтрокаСделкиРЕПОМО, ДатаПоз);
			КонецЦикла;
			
			ПараметрыОтбора = Новый Структура("ДеньРасчета, НетПоручения, Портфель", Ложь, Истина, ВыборкаПортфели.Мандат);
			СтрокиРЕПОДеньги = РЕПОДеньги.НайтиСтроки(ПараметрыОтбора);
			Если СтрокиРЕПОДеньги.Количество()>0 Тогда
				ДобавитьПакетАктивыРЕПО(ПакетХДТО, ФабрикаСервиса, ДатаПоз, СтрокиРЕПОДеньги);
			КонецЕсли;
			
			//ДобавитьФактПозициюIntraDay(ПакетХДТО, ВыборкаПортфели.Мандат, ФабрикаСервиса, ДатаПубликации);
			
			///Произвести валидацию запроса установки
			//Попытка
			//	ПакетХДТО.Проверить();
			//Исключение
			//	ОписаниеОшибки = ОписаниеОшибки();
			//	ЕстьОшибки = Истина;
			//	ТекстовыйЛог.ДобавитьСтроку("Ошибка валидации запроса установки: " + ОписаниеОшибки);
			//	Возврат;
			//КонецПопытки;
			
			Если КоличествоВПакете = КоличествоПакет Или КоличествоПортфелей = КоличествоПортфелейВсего Тогда
				
				СформироватьПакетФлагПозицияНеВыгружена(СоответствиеПортфелей, ФабрикаСервиса, Прокси, ПакетХДТОФлагПозицииНеВыгружена);
				
				Ответ = Прокси.DownloadPosition(ПакетХДТОФлагПозицииНеВыгружена);
				
				Рез = ПроцедурыФункцииОбмена_МО_ФО.ОбработатьОтвет(Ответ, ФабрикаСервиса, Ложь, Неопределено);
				Если ЗначениеЗаполнено(Рез.ТекстОшибки) Тогда
					ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОшибки);
				КонецЕсли;
				
				Если вклОтладка Тогда
					обЗапись = новый ЗаписьXML;
					обЗапись.УстановитьСтроку("UTF-8");
					ФабрикаСервиса.ЗаписатьXML(обЗапись, ПакетХДТО);
					ТекстовыйЛог.ДобавитьСтроку(обЗапись.Закрыть());
				КонецЕсли;
				
				Ответ = Прокси.DownloadPosition(ПакетХДТО);
				
				ЕстьОшибкиПортфель = Ложь;
				
				Рез = ПроцедурыФункцииОбмена_МО_ФО.ОбработатьОтвет(Ответ, ФабрикаСервиса, вклОтладка, УзелОбменаДляРегистрацииНенайденных, УзелОбменаДляРегистрацииНенайденныхСчетовМандатов);
				Если Рез.ЕстьОшибки Тогда
					ЕстьОшибкиПортфель = Истина;
					ЕстьОшибки = Истина;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Рез.ТекстОшибки) Тогда
					Если ЗначениеЗаполнено(Рез.ТекстОшибкиСервиса) Тогда
						Для каждого ТекСоот Из СоответствиеПортфелей Цикл
							ТекСоот.Значение = Истина;
						КонецЦикла;
						ТаблицаПортфелейСОшибкой = ТаблицаПортфелей;
						ТаблицаПортфелейСОшибкой.Колонки.Добавить("ТекстОшибки");
						ТаблицаПортфелейСОшибкой.ЗаполнитьЗначения(Рез.ТекстОшибкиСервиса, "ТекстОшибки");
						ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОшибкиСервиса);
					Иначе
						ТаблицаПортфелейСОшибкой = ПолучитьМандатыПоНенайденнымОбъектамФактПоз(Рез, ТаблицаПортфелей, СоответствиеПортфелей);
					КонецЕсли;
					ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОшибки);
					//IMAPPS-19973++
					ОбработатьОтветДляРассылки(ТаблицаПортфелейСОшибкой);
					//IMAPPS-19973--
				КонецЕсли;
				
				Если вклОтладка Тогда
					ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОтвета);
				КонецЕсли;
				
			КонецЕсли;
			
			// выгрузка блокировок
			СтрокиБлокировки = Блокировки.НайтиСтроки(новый Структура("Мандат", ВыборкаПортфели.Мандат));
			Если СтрокиБлокировки.Количество() > 0 Тогда
				
				ПакетБлокировкиХДТО = ПроцедурыФункцииОбмена_МО_ФО.хдтоСформироватьПакетПоручений(ФабрикаСервиса);
				ПакетБлокировкиХДТО.ЗапускатьПроверкуЛимитов = Ложь;
				
				Для каждого СтрокаВыгрузить из СтрокиБлокировки Цикл
					хдтоДобавитьВПакетБлокировку(ПакетБлокировкиХДТО, ДатаДляФронт, СтрокаВыгрузить.ОперацияВнешнийКод, СтрокаВыгрузить.Мандат, СтрокаВыгрузить.Валюта, СтрокаВыгрузить.СчетМандата, СтрокаВыгрузить.Количество, СтрокаВыгрузить.Стоимость, ФабрикаСервиса);
					
					НоваяСтрока = ТаблицаДляУдаленияБлокировок.Добавить();
					НоваяСтрока.КодМандата = ВыборкаПортфели.Мандат.КодМандата;
					НоваяСтрока.КодСчета = СтрокаВыгрузить.СчетМандата.КодСчета;
					НоваяСтрока.КодВалюты = СтрокаВыгрузить.Валюта.Код;
				КонецЦикла;
				
				Если вклОтладка Тогда
					обЗапись = Новый ЗаписьXML;
					обЗапись.УстановитьСтроку("UTF-8");
					ФабрикаСервиса.ЗаписатьXML(обЗапись, ПакетБлокировкиХДТО);
					ТекстовыйЛог.ДобавитьСтроку(обЗапись.Закрыть());
				КонецЕсли;
				
				Ответ = Прокси.DownloadOrders(ПакетБлокировкиХДТО);
				
				Рез = ПроцедурыФункцииОбмена_МО_ФО.ОбработатьОтвет(Ответ, ФабрикаСервиса, вклОтладка, Неопределено, УзелОбменаДляРегистрацииНенайденныхСчетовМандатов);
				Если Рез.ЕстьОшибки Тогда
					ЕстьОшибки = Истина;
					ЕстьОшибкиПортфель = Истина;
					СоответствиеПортфелей.Вставить(ВыборкаПортфели.Мандат, Истина);
					ДобавитьОшибкуВДанныеДляРассылки(ВыборкаПортфели.Мандат, "При выгрузке блокировки в ФО возникла ошибка:" + Символы.ПС + Рез.ЕстьОшибки, ВыборкаПортфели.Колво);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Рез.ТекстОшибки) Тогда
					ТекстовыйЛог.ДобавитьСтроку("Ошибка выгрузки блокировки по: " + ВыборкаПортфели.Мандат);
					ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОшибки);
				КонецЕсли;
				
				Если вклОтладка Тогда
					ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОтвета);
				КонецЕсли;
			Иначе
				МассивКодовПортфелейДляУдаленияБлокировок.Добавить(ВыборкаПортфели.Мандат.КодМандата);
			КонецЕсли;
			
			Если КоличествоВПакете = КоличествоПакет Или КоличествоПортфелей = КоличествоПортфелейВсего Тогда
				ПроверитьИУдалитьБлокировкиФО(МассивКодовПортфелейДляУдаленияБлокировок, ТаблицаДляУдаленияБлокировок, ФабрикаСервиса, Прокси, ИдентификаторСеанса);
			КонецЕсли;
			
			Если НовыйПакет = Истина Тогда
				СтруктураПакета = Новый Структура("Справочники, Документы, РегистрыСведений, Рейтинг", Истина, Ложь, Ложь, Ложь);
				ПакетХДТОФлагПозиции = хдтоСформироватьПакет(ФабрикаСервиса, СтруктураПакета);
				//ПакетХДТОФлагПозиции = ПроцедурыФункцииОбмена_МО_ФО.хдтоСформироватьПакет(ФабрикаСервиса);
			КонецЕсли;
			
			Если КоличествоВПакете = КоличествоПакет Или КоличествоПортфелей = КоличествоПортфелейВсего Тогда
				
				СформироватьПакетФлагПозицияВыгружена(СоответствиеПортфелей, ФабрикаСервиса, Прокси, ПакетХДТОФлагПозиции);
				МассивКодовПортфелей = Новый Массив;
				Для каждого Соот Из СоответствиеПортфелей Цикл
					МассивКодовПортфелей.Добавить(Соот.Ключ.КодМандата);
					Если Соот.Значение = Ложь Тогда
						ТекстовыйЛог.ДобавитьСтроку(" "+ Соот.Ключ +" - успех!");
					Иначе
							//IMAPPS-19973++
						ДанныеДляРассылки.КоличествоОшибок = ДанныеДляРассылки.КоличествоОшибок + 1;
							//IMAPPS-19973--
					КонецЕсли;
				КонецЦикла;
				СформироватьПакетФлагПозицияВыгруженаСОшибкой(СоответствиеПортфелей, ФабрикаСервиса, Прокси, ПакетХДТОФлагПозиции);
				
				Ответ = Прокси.DownloadPosition(ПакетХДТОФлагПозиции);
				
				Рез = ПроцедурыФункцииОбмена_МО_ФО.ОбработатьОтвет(Ответ, ФабрикаСервиса, Ложь, Неопределено);
				Если ЗначениеЗаполнено(Рез.ТекстОшибки) Тогда
					ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОшибки);
				КонецЕсли;
				
				ВыполнитьПерерасчетРСА(ФабрикаСервиса, Прокси, ИдентификаторСеанса, МассивКодовПортфелей, ДатаДляФронт);
				
			КонецЕсли;
			
			НовыйПакет = Ложь;
			Если КоличествоПакет = КоличествоВПакете Или КоличествоПортфелей = КоличествоПортфелейВсего Тогда
				КоличествоВПакете = 0;
				НовыйПакет = Истина;
			КонецЕсли;
			
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ЕстьОшибки = Истина;
			ТекстовыйЛог.ДобавитьСтроку("Ошибка выгрузки позиции по: "+ ВыборкаПортфели.Мандат);
			ТекстовыйЛог.ДобавитьСтроку(ОписаниеОшибки);
			//Возврат;
		КонецПопытки;
	КонецЦикла;
	
	ОпубликоватьИсполнениеСделок(ФабрикаСервиса, Прокси); 
	
	//ТЗАктивыРЕПО = СделкиРЕПОМО.Выгрузить();
	//
	//ПараметрыОтбора = Новый Структура("ДеньРасчета, НетПоручения", Ложь, Истина);
	//СтрокиРЕПОДеньги = РЕПОДеньги.НайтиСтроки(ПараметрыОтбора);
	//Для каждого СтрокаРЕПОДеньги Из СтрокиРЕПОДеньги Цикл
	//	ЗаполнитьЗначенияСвойств(ТЗАктивыРЕПО.Добавить(), СтрокаРЕПОДеньги);
	//КонецЦикла;
	//
	//Если ТЗАктивыРЕПО.Количество()>0 Тогда
	//	ОпубликоватьАктивыРЕПО(ФабрикаСервиса, Прокси, ДатаПубликации, ТЗАктивыРЕПО);
	//КонецЕсли;
		
	ВыполнитьРассылкуПоПерерасчетуРСА(ФабрикаСервиса, Прокси, ИдентификаторСеанса, НачалоОбработки, ТекущаяДатаСеанса());
	
	//Если ВыгружатьРейтинги Тогда
	//	ЗаполнитьРейтинги(Прокси, ФабрикаСервиса);
	//КонецЕсли;
	
	////Сохранение файлов
	//ИмяФайлаЗапроса = ФайлXMLПоСхеме(ПакетХДТО, Определение.ФабрикаXDTO);
	//ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайлаЗапроса);
	//АдресФайлаЗапроса = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	//УдалитьФайлы(ИмяФайлаЗапроса);
	//МассивФайлов.Добавить(Новый Структура("ИмяФайла, АдресФайлаВоВременномХранилище", "ЗапросУстановки.xml", АдресФайлаЗапроса)); 
	
КонецПроцедуры // Опубликовать()


Функция хдтоСформироватьПакетИсполнений(ФабрикаСервиса, ДатаВыгрузки) Экспорт
		
	обПакет = ФабрикаСервиса.Создать(ФабрикаСервиса.Тип(ПространствоИменСервиса, "Пакет"));
	обПакет.Документы = ФабрикаСервиса.Создать(обПакет.Свойства().Получить("Документы").Тип);
	
	обПакет.Заголовок = ФабрикаСервиса.Создать(ФабрикаСервиса.Тип(ПространствоИменСервиса, "Заголовок"));
	обПакет.Заголовок.УникальныйИдентификатор = СокрЛП(новый УникальныйИдентификатор());
	обПакет.Заголовок.ДатаВыполнения = ТекущаяДата();
	обПакет.Заголовок.ИдентификаторСистемы = "МО 1.0";
	обПакет.Заголовок.ИмяПользователя = "Сервис";
	обПакет.Заголовок.ДатаВыгрузки = ?(ДатаВыгрузки=Дата(1,1,1), ТекущаяДата(), ДатаВыгрузки);
	
	обПакет.ИспользоватьЧастичнуюЗагрузкуПозиции = Истина;
	обПакет.ДоступнаНеПолнаяПозиция = Истина;
	
	Возврат обПакет;
	
КонецФункции

Функция хдтоСформироватьПакетАктивыВРЕПО(ФабрикаСервиса, ДатаВыгрузки) Экспорт
		
	обПакет = ФабрикаСервиса.Создать(ФабрикаСервиса.Тип(ПространствоИменСервиса, "Пакет"));
	обПакет.РегистрыСведений = ФабрикаСервиса.Создать(обПакет.Свойства().Получить("РегистрыСведений").Тип);
	
	обПакет.Заголовок = ФабрикаСервиса.Создать(ФабрикаСервиса.Тип(ПространствоИменСервиса, "Заголовок"));
	обПакет.Заголовок.УникальныйИдентификатор = СокрЛП(новый УникальныйИдентификатор());
	обПакет.Заголовок.ДатаВыполнения = ТекущаяДата();
	обПакет.Заголовок.ИдентификаторСистемы = "МО 1.0";
	обПакет.Заголовок.ИмяПользователя = "Сервис";
	обПакет.Заголовок.ДатаВыгрузки = ?(ДатаВыгрузки=Дата(1,1,1), ТекущаяДата(), ДатаВыгрузки);
	
	обПакет.ИспользоватьЧастичнуюЗагрузкуПозиции = Истина;
	обПакет.ДоступнаНеПолнаяПозиция = Истина;
	
	Возврат обПакет;
	
КонецФункции

Процедура ДобавитьПакетАктивыРЕПО(ПакетХДТО, ФабрикаСервиса, ДатаИсполнения = Неопределено, ТЗИсточник)

	Если ДатаИсполнения=Неопределено Тогда
		ДатаИсполнения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Для каждого СтрокаТЗ Из ТЗИсточник Цикл
		ДобавитьПакетСтрокуАктивыРЕПО(ПакетХДТО, ФабрикаСервиса,СтрокаТЗ, ДатаИсполнения);
	КонецЦикла;
	
КонецПроцедуры //ДобавитьПакетАктивыРЕПО()

Процедура ДобавитьПакетСтрокуАктивыРЕПО(ПакетХДТО, ФабрикаСервиса, СтрокаТЗ, ДатаИсполнения)

	Если Не СтрокаТЗ.ИсполнениеСделкиРЕПОПоЦБ И Не СтрокаТЗ.ДеньРасчета Тогда
		
		типХДТО	 = ФабрикаСервиса.Тип(ПространствоИменСервиса, "АктивыВРЕПО");
		обХДТО = ФабрикаСервиса.Создать(типХДТО);
		обХДТО.ДатаРасчетов = ДатаИсполнения;
		обХДТО.Портфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоПорфельПоиск(СтрокаТЗ.Портфель, ФабрикаСервиса);
		обХДТО.Актив = ПроцедурыФункцииОбмена_МО_ФО.хдтоАктивПоиск(СтрокаТЗ.Актив, ФабрикаСервиса);
		обХДТО.МестоХранения = ПроцедурыФункцииОбмена_МО_ФО.хдтоМестоХраненияПоиск(СтрокаТЗ.МестоХраненияЦБ, ФабрикаСервиса);
		обХДТО.Субпортфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоСубпортфельПоиск(СтрокаТЗ.СубпортфельЦБ, ФабрикаСервиса);
		
		хдтоПортфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоПорфельПоиск(СтрокаТЗ.Портфель, ФабрикаСервиса); 
		ВнешнийКодСделкаРЕПО = Строка(СтрокаТЗ.СделкаРЕПО.УникальныйИдентификатор());//СтрокаТЗ.НомерСделки+"#"+хдтоПортфель.ВнешнийКод;
		обХДТО.Сделка = ХДТОСделкаРЕПОПоиск(хдтоПортфель, ВнешнийКодСделкаРЕПО, СтрокаТЗ.НомерСделки, ФабрикаСервиса);
		
		обХДТО.Сумма = СтрокаТЗ.СуммаРЕПОРубли;
		обХДТО.Количество = СтрокаТЗ.Количество;
		обХДТО.СделкаСЦК = СтрокаТЗ.СделкаСЦК;
		
		ПакетХДТО.РегистрыСведений.АктивыВРЕПО.Добавить(обХДТО);
		
	КонецЕсли;

КонецПроцедуры


Процедура ОпубликоватьАктивыРЕПО(ФабрикаСервиса, Прокси, ДатаИсполнения = Неопределено, ТЗИсточник)

	Если ДатаИсполнения=Неопределено Тогда
		ДатаИсполнения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ствАктивыНеВыгружать = Новый Соответствие;
	ПакетХДТО = хдтоСформироватьПакетАктивыВРЕПО(ФабрикаСервиса, ДатаИсполнения);
	
	Для каждого СтрокаТЗ Из ТЗИсточник Цикл
	
		Если Не СтрокаТЗ.ИсполнениеСделкиРЕПОПоЦБ И Не СтрокаТЗ.ДеньРасчета Тогда
		
			типХДТО	 = ФабрикаСервиса.Тип(ПространствоИменСервиса, "АктивыВРЕПО");
			обХДТО = ФабрикаСервиса.Создать(типХДТО);
			обХДТО.ДатаРасчетов = ДатаИсполнения;
			обХДТО.Портфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоПорфельПоиск(СтрокаТЗ.Портфель, ФабрикаСервиса);
			обХДТО.Актив = ПроцедурыФункцииОбмена_МО_ФО.хдтоАктивПоиск(СтрокаТЗ.Актив, ФабрикаСервиса);
			обХДТО.МестоХранения = ПроцедурыФункцииОбмена_МО_ФО.хдтоМестоХраненияПоиск(СтрокаТЗ.МестоХраненияЦБ, ФабрикаСервиса);
			обХДТО.Субпортфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоСубпортфельПоиск(СтрокаТЗ.СубпортфельЦБ, ФабрикаСервиса);
			
			хдтоПортфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоПорфельПоиск(СтрокаТЗ.Портфель, ФабрикаСервиса); 
			ВнешнийКодСделкаРЕПО = Строка(СтрокаТЗ.СделкаРЕПО.УникальныйИдентификатор());//СтрокаТЗ.НомерСделки+"#"+хдтоПортфель.ВнешнийКод;
			обХДТО.Сделка = ХДТОСделкаРЕПОПоиск(хдтоПортфель, ВнешнийКодСделкаРЕПО, СтрокаТЗ.НомерСделки, ФабрикаСервиса);
			
			обХДТО.Сумма = СтрокаТЗ.СуммаРЕПО;
			обХДТО.Количество = СтрокаТЗ.Количество;
			обХДТО.СделкаСЦК = СтрокаТЗ.СделкаСЦК;
			
			ПакетХДТО.РегистрыСведений.АктивыВРЕПО.Добавить(обХДТО);
		
		КонецЕсли;
	КонецЦикла;
	
	Ответ = Прокси.DownloadPosition(ПакетХДТО);
	
	ЕстьОшибкиПортфель = Ложь;
	
	Рез = ПроцедурыФункцииОбмена_МО_ФО.ОбработатьОтвет(Ответ, ФабрикаСервиса, вклОтладка, УзелОбменаДляРегистрацииНенайденных);
	Если Рез.ЕстьОшибки Тогда
		ЕстьОшибкиПортфель = Истина;
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Рез.ТекстОшибки) Тогда
		ТекстовыйЛог.ДобавитьСтроку("Ошибка выгрузки исполнения по: "+ ДатаИсполнения);
		ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОшибки);
	КонецЕсли;
	
	Если вклОтладка Тогда
		ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОтвета);
	КонецЕсли;
	
КонецПроцедуры //ОпубликоватьАктивыРЕПО()

Процедура ОпубликоватьИсполнениеСделок(ФабрикаСервиса, Прокси)

	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ИсполнениеСделок", ИсполненияПоСделкам.Выгрузить());
	Запрос.Текст = ПолучитьТекстЗапросаДляВыгрузкиИсполнения();
	
	ВыборкаПериоды = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПериоды.Следующий() Цикл
		Попытка
			
			ствАктивыНеВыгружать = новый Соответствие;
			ПакетХДТО = хдтоСформироватьПакетИсполнений(ФабрикаСервиса, ВыборкаПериоды.ДатаИсполнения);
			
			ПоместитьИсполнениеВПакет(ПакетХДТО, ВыборкаПериоды, ФабрикаСервиса);
			
			Ответ = Прокси.DownloadPosition(ПакетХДТО);	
		
			ЕстьОшибкиПортфель = Ложь;
			
			Рез = ПроцедурыФункцииОбмена_МО_ФО.ОбработатьОтвет(Ответ, ФабрикаСервиса, вклОтладка, УзелОбменаДляРегистрацииНенайденных);
			Если Рез.ЕстьОшибки Тогда
				ЕстьОшибкиПортфель = истина;
				ЕстьОшибки = истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Рез.ТекстОшибки) Тогда
				ТекстовыйЛог.ДобавитьСтроку("Ошибка выгрузки исполнения по: "+ ВыборкаПериоды.ДатаИсполнения);
				ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОшибки);
			КонецЕсли;
			
			Если вклОтладка Тогда
				ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОтвета);
			КонецЕсли	
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ЕстьОшибки = Истина;
			ТекстовыйЛог.ДобавитьСтроку("Ошибка выгрузки исполнения по: "+ ВыборкаПериоды.ДатаИсполнения);
			ТекстовыйЛог.ДобавитьСтроку(ОписаниеОшибки);
		КонецПопытки;
		
	КонецЦикла;
	

КонецПроцедуры //ОпубликоватьИсполнениеСделок()

Функция ПолучитьТекстЗапросаДляВыгрузкиИсполнения()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	т.ДатаИсполнения КАК ДатаИсполнения,
	|	т.Действие КАК Действие,
	|	т.Сделка КАК Сделка,
	|	т.Актив КАК Актив,
	|	т.Портфель КАК Портфель,
	|	т.МестоХранения КАК МестоХранения,
	|	т.Субпортфель КАК Субпортфель,
	|	т.ТипПортфеля КАК ТипПортфеля,
	|	т.Количество КАК Количество,
	|	т.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ втИсполнениеСделок
	|ИЗ
	|	&ИсполнениеСделок КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИсполнениеСделок.ДатаИсполнения КАК ДатаИсполнения,
	|	втИсполнениеСделок.Действие,
	|	втИсполнениеСделок.Сделка,
	|	втИсполнениеСделок.Актив,
	|	втИсполнениеСделок.Портфель,
	|	втИсполнениеСделок.МестоХранения,
	|	втИсполнениеСделок.Субпортфель,
	|	втИсполнениеСделок.ТипПортфеля,                           
	|	втИсполнениеСделок.Количество,
	|	втИсполнениеСделок.Идентификатор
	|ИЗ
	|	втИсполнениеСделок КАК втИсполнениеСделок
	|ГДЕ
	|	втИсполнениеСделок.Действие <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаИсполнения
	|ИТОГИ ПО
	|	ДатаИсполнения";
	
	Возврат ТекстЗапроса;
	 
КонецФункции

Функция ДобавитьВПакетМандат(ПакетХДТО, ВыборкаПортфели, ствАктивыНеВыгружать, ФабрикаСервиса)
	
	ВыборкаПозиции = ВыборкаПортфели.Выбрать();
	
	ЕстьОшибкиПоПортфелю = Ложь;
	
	Пока ВыборкаПозиции.Следующий() Цикл
		
		Если ствАктивыНеВыгружать[ВыборкаПозиции.Актив] <> Неопределено Или ВыборкаПозиции.Актив="НЕОПРЕДЕЛЕНО" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаПозиции.КодСчетаМандата) Тогда
			ТекстОшибки = "У счета мандата """ + ВыборкаПозиции.СчетМандата + """ не заполнен код счета мандата. Выгрузка по счету мандата не выполнена";
			Сообщить(ТекстОшибки);
			ТекстовыйЛог.ДобавитьСтроку(ТекстОшибки);
			ДобавитьОшибкуВДанныеДляРассылки(ВыборкаПозиции.Мандат, ТекстОшибки, ВыборкаПозиции.Колво);
			ЕстьОшибки = Истина;
			ЕстьОшибкиПоПортфелю = Истина;
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаПозиции.МХ) Тогда
			ТекстОшибки = "У счета мандата """ + ВыборкаПозиции.СчетМандата + """ не заполнено место хранения. Выгрузка по счету мандата не выполнена";
			Сообщить(ТекстОшибки);
			ТекстовыйЛог.ДобавитьСтроку(ТекстОшибки);
			ДобавитьОшибкуВДанныеДляРассылки(ВыборкаПозиции.Мандат, ТекстОшибки, ВыборкаПозиции.Колво);
			ЕстьОшибки = Истина;
			ЕстьОшибкиПоПортфелю = Истина;
			Продолжить;
		КонецЕсли;
		
		хдтоДобавитьВПакетФактическаяПозиция(ПакетХДТО,
		ДатаДляФронт,
		ВыборкаПозиции.Актив,
		ВыборкаПозиции.Мандат,
		ВыборкаПозиции.СчетМандата,
		ВыборкаПозиции.ДоходыКПолучению,
		ВыборкаПозиции.МХ,
		ВыборкаПозиции.Колво,
		ВыборкаПозиции.Стоим,
		ВыборкаПозиции.СуммаНКД,
		ВыборкаПозиции.СуммаЗадолженность,
		ВыборкаПозиции.ДСиЗадолженность,
		ФабрикаСервиса);
		
	КонецЦикла;
	
	СтрокиСЧА = СЧА_РСА.НайтиСтроки(новый Структура("Мандат", ВыборкаПортфели.Мандат));
	
	Для каждого СтрокаВыгрузить из СтрокиСЧА Цикл
		хдтоДобавитьВПакетСтоимостьЧистыхАктивов(ПакетХДТО, ДатаДляФронт, СтрокаВыгрузить.Мандат, СтрокаВыгрузить.СЧА, СтрокаВыгрузить.РСА, ФабрикаСервиса);
	КонецЦикла;
	
	Возврат ЕстьОшибкиПоПортфелю;
	
КонецФункции

Функция ХДТОСделкаРЕПОПоиск(хдтоПортфель, СделкаРЕПОВнешнийКод, СделкаРЕПОНомерСделки, ФабрикаСервиса)

	типХДТО	 = ФабрикаСервиса.Тип(ПространствоИменСервиса, "СделкаРЕПОПоиск"); 
	обСделкаРЕПОПоискХДТО = ФабрикаСервиса.Создать(типХДТО); 
	обСделкаРЕПОПоискХДТО.ВнешнийКод = СделкаРЕПОВнешнийКод;
	обСделкаРЕПОПоискХДТО.НомерСделки = СделкаРЕПОНомерСделки;
	обСделкаРЕПОПоискХДТО.Портфель = хдтоПортфель;

	Возврат обСделкаРЕПОПоискХДТО;	

КонецФункции // ХДТОСделкаРЕПОПоиск()

//Процедура ДобавитьФактПозициюIntraDay(обПакет, Мандат, ФабрикаСервиса, Период)
//	
//	Если Период=Неопределено Тогда
//		Период = ТекущаяДата();
//	КонецЕсли; 
//	
//	ПараметрыОтбора = Новый Структура("Портфель", Мандат);
//	СтрокиТЗ = СделкиРЕПОМО.НайтиСтроки(ПараметрыОтбора);
//	Для каждого СтрокаТЗ Из СтрокиТЗ Цикл
//		Если Не СтрокаТЗ.Дата Тогда
//			типХДТО	 = ФабрикаСервиса.Тип(ПространствоИменСервиса, "ФактическаяПозицияIntraDay");
//			обХДТО = ФабрикаСервиса.Создать(типХДТО);
//			обХДТО.Дата = Период; 
//			хдтоПортфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоПорфельПоиск(СтрокаТЗ.Портфель, ФабрикаСервиса);
//			обХДТО.Портфель = хдтоПортфель;
//			обХДТО.Актив = ПроцедурыФункцииОбмена_МО_ФО.хдтоАктивПозицияПоиск(СтрокаТЗ.Валюта, ФабрикаСервиса);
//			обХДТО.МестоХранения = ПроцедурыФункцииОбмена_МО_ФО.хдтоМестоХраненияПоиск(СтрокаТЗ.МестоХранения, ФабрикаСервиса);
//			обХДТО.Субпортфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоСубпортфельПоиск(СтрокаТЗ.Субпортфель, ФабрикаСервиса);
//			
//			обХДТО.Количество = СтрокаТЗ.СуммаРЕПО;
//			обХДТО.Стоимость = СтрокаТЗ.СуммаРЕПО;
//			обПакет.РегистрыСведений.ФактическаяПозицияIntraDay.Добавить(обХДТО);
//		КонецЕсли; 
//		
//	КонецЦикла;

//КонецПроцедуры //ДобавитьФактПозициюIntraDay()

Процедура СформироватьПакетФлагПозицияНеВыгружена(СоответствиеПортфелей, ФабрикаСервиса, Прокси, ПакетХДТО)
	
	Для каждого сс Из СоответствиеПортфелей Цикл
		
		типПортфель = ФабрикаСервиса.Тип(ПространствоИменСервиса, "Портфель");
		обХДТО = ФабрикаСервиса.Создать(типПортфель);
		обХДТО.ВнешнийКод = сс.Ключ.КодМандата;
		обХДТО.НеполноеОбновление = Истина;
		
		типЭлементХДТО = обХДТО.Свойства().Получить("ДополнительныеСведения").Тип;
		
		элХДТО = ФабрикаСервиса.Создать(типЭлементХДТО);
		элХДТО.Ключ = "Лимиты позиция_выгружена";
		элХДТО.Значение = Ложь;
		обХДТО.ДополнительныеСведения.Добавить(элХДТО);
		ПакетХДТО.Справочники.Портфели.Добавить(обХДТО);
		
	КонецЦикла;
	
	Если вклОтладка Тогда
		обЗапись = Новый ЗаписьXML;
		обЗапись.УстановитьСтроку("UTF-8");
		ФабрикаСервиса.ЗаписатьXML(обЗапись, ПакетХДТО);
		ТекстовыйЛог.ДобавитьСтроку(обЗапись.Закрыть());
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПакетФлагПозицияВыгружена(СоответствиеПортфелей, ФабрикаСервиса, Прокси, ПакетХДТО)
	
	Если СоответствиеПортфелей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого сс Из СоответствиеПортфелей Цикл
		
		Если сс.Значение = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		типПортфель = ФабрикаСервиса.Тип(ПространствоИменСервиса, "Портфель");
		обХДТО = ФабрикаСервиса.Создать(типПортфель);
		обХДТО.ВнешнийКод = сс.Ключ.КодМандата;
		обХДТО.НеполноеОбновление = Истина;
		
		типЭлементХДТО = обХДТО.Свойства().Получить("ДополнительныеСведения").Тип;
		
		Если СписокТиповПортфелейПИФ().Найти(сс.Ключ.ТипМандата) <> Неопределено Тогда
			элХДТО = ФабрикаСервиса.Создать(типЭлементХДТО); //ПИФ
			элХДТО.Ключ = "Лимиты позиция_выгружена";
			элХДТО.Значение = Истина;
			обХДТО.ДополнительныеСведения.Добавить(элХДТО);
			ПакетХДТО.Справочники.Портфели.Добавить(обХДТО);
		Иначе
			элХДТО = ФабрикаСервиса.Создать(типЭлементХДТО); //ДУ
			элХДТО.Ключ = "Лимиты позиция_выгружена";
			элХДТО.Значение = Ложь;
			обХДТО.ДополнительныеСведения.Добавить(элХДТО);
			
			элХДТО = ФабрикаСервиса.Создать(типЭлементХДТО);
			элХДТО.Ключ = "Лимиты требуется_перерасчет_РСА";
			элХДТО.Значение = Истина;
			обХДТО.ДополнительныеСведения.Добавить(элХДТО);
			
			элХДТО = ФабрикаСервиса.Создать(типЭлементХДТО);
			элХДТО.Ключ = "Лимиты есть_ошибки_выгрузки_позиции";
			элХДТО.Значение = Ложь;
			обХДТО.ДополнительныеСведения.Добавить(элХДТО);
			ПакетХДТО.Справочники.Портфели.Добавить(обХДТО);
		КонецЕсли;
		
	КонецЦикла;
	
	Если вклОтладка Тогда
		обЗапись = Новый ЗаписьXML;
		обЗапись.УстановитьСтроку("UTF-8");
		ФабрикаСервиса.ЗаписатьXML(обЗапись, ПакетХДТО);
		ТекстовыйЛог.ДобавитьСтроку(обЗапись.Закрыть());
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПакетФлагПозицияВыгруженаСОшибкой(СоответствиеПортфелей, ФабрикаСервиса, Прокси, ПакетХДТО)
	
	Если СоответствиеПортфелей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого сс Из СоответствиеПортфелей Цикл
		
		Если сс.Значение = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		типПортфель = ФабрикаСервиса.Тип(ПространствоИменСервиса, "Портфель");
		обХДТО = ФабрикаСервиса.Создать(типПортфель);
		обХДТО.ВнешнийКод = сс.Ключ.КодМандата;
		обХДТО.НеполноеОбновление = Истина;
		
		типЭлементХДТО = обХДТО.Свойства().Получить("ДополнительныеСведения").Тип;
		
		Если СписокТиповПортфелейПИФ().Найти(сс.Ключ.ТипМандата) = Неопределено Тогда
			элХДТО = ФабрикаСервиса.Создать(типЭлементХДТО); //ДУ
			элХДТО.Ключ = "Лимиты позиция_выгружена";
			элХДТО.Значение = Ложь;
			обХДТО.ДополнительныеСведения.Добавить(элХДТО);
			
			элХДТО = ФабрикаСервиса.Создать(типЭлементХДТО);
			элХДТО.Ключ = "Лимиты требуется_перерасчет_РСА";
			элХДТО.Значение = Истина;
			обХДТО.ДополнительныеСведения.Добавить(элХДТО);
			
			элХДТО = ФабрикаСервиса.Создать(типЭлементХДТО);
			элХДТО.Ключ = "Лимиты есть_ошибки_выгрузки_позиции";
			элХДТО.Значение = Истина;
			обХДТО.ДополнительныеСведения.Добавить(элХДТО);
			ПакетХДТО.Справочники.Портфели.Добавить(обХДТО);
		КонецЕсли;
		
	КонецЦикла;
	
	Если вклОтладка Тогда
		обЗапись = Новый ЗаписьXML;
		обЗапись.УстановитьСтроку("UTF-8");
		ФабрикаСервиса.ЗаписатьXML(обЗапись, ПакетХДТО);
		ТекстовыйЛог.ДобавитьСтроку(обЗапись.Закрыть());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьИУдалитьБлокировкиФО(МассивКодовПортфелей, ТаблицаДляУдаленияБлокировок, ФабрикаСервиса, Прокси ,ИдентификаторСеанса)
	
	//ПакетХДТО = ПроцедурыФункцииОбмена_МО_ФО.хдтоСформироватьПакет(ФабрикаСервиса);
	СтруктураПакета = Новый Структура("Справочники, Документы, РегистрыСведений, Рейтинг", Ложь, Ложь, Ложь, Ложь);
	ПакетХДТО = хдтоСформироватьПакет(ФабрикаСервиса, СтруктураПакета);
	
	ПараметрыОбмена = Новый Структура;
	ПараметрыОбмена.Вставить("ТребуетсяУдалениеБлокировок", Истина);
	ПараметрыОбмена.Вставить("ТребуетсяУдалениеБлокировокДата", ДатаПоз);
	ПараметрыОбмена.Вставить("ТребуетсяУдалениеБлокировокМассивКодовПортфелей", МассивКодовПортфелей);
	ПараметрыОбмена.Вставить("ТребуетсяУдалениеБлокировокТаблицаДляУдаленияБлокировок", ЗначениеВСтрокуВнутр(ТаблицаДляУдаленияБлокировок));
	ПараметрыОбмена.Вставить("ТребуетсяУдалениеБлокировокИдентификаторСеанса", Строка(ИдентификаторСеанса));
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ПараметрыОбмена);
	Комментарий = ЗаписьJSON.Закрыть();
	
	ПакетХДТО.Заголовок.Комментарий = Комментарий;
	
	Если вклОтладка Тогда
		обЗапись = Новый ЗаписьXML;
		обЗапись.УстановитьСтроку("UTF-8");
		ФабрикаСервиса.ЗаписатьXML(обЗапись, ПакетХДТО);
		ТекстовыйЛог.ДобавитьСтроку(обЗапись.Закрыть());
	КонецЕсли;
	
	Ответ = Прокси.DownloadPosition(ПакетХДТО);
	
	Рез = ПроцедурыФункцииОбмена_МО_ФО.ОбработатьОтвет(Ответ, ФабрикаСервиса, Ложь, Неопределено);
	Если ЗначениеЗаполнено(Рез.ТекстОшибки) Тогда
		ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьЗаблокированныеДенежныеСредства(Дата)
	
	ТаблицаДенежныеСредства = ДенежныеСредства.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаДенежныеСредства.Мандат,
	|	ТаблицаДенежныеСредства.СчетМандата,
	|	ТаблицаДенежныеСредства.Валюта,
	|	ТаблицаДенежныеСредства.ВходящийОстаток,
	|	ТаблицаДенежныеСредства.ДневнойОборот,
	|	ТаблицаДенежныеСредства.РЕПО
	|ПОМЕСТИТЬ ДС_КВыгрузке
	|ИЗ
	|	&ТаблицаДС КАК ТаблицаДенежныеСредства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДенежныеСредстваЗаблокированныеОстатки.Мандат,
	|	ДенежныеСредстваЗаблокированныеОстатки.СчетМандата,
	|	ДенежныеСредстваЗаблокированныеОстатки.Валюта,
	|	СУММА(ДенежныеСредстваЗаблокированныеОстатки.ВалютнаяСуммаОстаток) КАК ВалютнаяСуммаОстаток
	|ПОМЕСТИТЬ ДС_Заблокированные
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваЗаблокированные.Остатки(&Дата, ) КАК ДенежныеСредстваЗаблокированныеОстатки
	// IMAPPS-13192 -->
	|	ГДЕ  ДенежныеСредстваЗаблокированныеОстатки.ВалютнаяСуммаОстаток >=0
	// IMAPPS-13192 <--
	|
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредстваЗаблокированныеОстатки.Мандат,
	|	ДенежныеСредстваЗаблокированныеОстатки.СчетМандата,
	|	ДенежныеСредстваЗаблокированныеОстатки.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДС_КВыгрузке.Мандат,
	|	ДС_КВыгрузке.СчетМандата,
	|	ДС_КВыгрузке.Валюта,
	|	ДС_КВыгрузке.ВходящийОстаток,
	|	ДС_КВыгрузке.ДневнойОборот,
	|	ДС_КВыгрузке.РЕПО,
	|	ЕСТЬNULL(ДС_Заблокированные.ВалютнаяСуммаОстаток, 0) КАК Заблокировано
	|ИЗ
	|	ДС_КВыгрузке КАК ДС_КВыгрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДС_Заблокированные КАК ДС_Заблокированные
	|		ПО ДС_КВыгрузке.Мандат = ДС_Заблокированные.Мандат
	|			И ДС_КВыгрузке.СчетМандата = ДС_Заблокированные.СчетМандата
	|			И ДС_КВыгрузке.Валюта = ДС_Заблокированные.Валюта";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ТаблицаДС", ТаблицаДенежныеСредства);
	ДенежныеСредства.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

Процедура ВыполнитьПерерасчетРСА(ФабрикаСервиса, Прокси, ИдентификаторСеанса, МассивКодовПортфелей, ДатаЗаполнения)

	СтруктураПакета = Новый Структура("Справочники, Документы, РегистрыСведений, Рейтинг, ДатаВыгрузки", Ложь, Ложь, Ложь, Ложь, ДатаЗаполнения);
	ПакетХДТО = хдтоСформироватьПакет(ФабрикаСервиса, СтруктураПакета);
	//ПакетХДТО = ПроцедурыФункцииОбмена_МО_ФО.хдтоСформироватьПакет(ФабрикаСервиса);
	
	ПараметрыОбмена = Новый Структура;
	ПараметрыОбмена.Вставить("ТребуетсяПерерасчетРСА", Истина);
	ПараметрыОбмена.Вставить("ТребуетсяПерерасчетРСАДата", ДатаЗаполнения);
	ПараметрыОбмена.Вставить("ТребуетсяПерерасчетРСАМассивКодовПортфелей", МассивКодовПортфелей);
	ПараметрыОбмена.Вставить("ТребуетсяПерерасчетРСАПоВсемПортфелям", Ложь);
	ПараметрыОбмена.Вставить("ТребуетсяПерерасчетРСАИдентификаторСеанса", Строка(ИдентификаторСеанса));
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ПараметрыОбмена);
	Комментарий = ЗаписьJSON.Закрыть();
	
	ПакетХДТО.Заголовок.Комментарий = Комментарий;
	
	Если вклОтладка Тогда
		обЗапись = Новый ЗаписьXML;
		обЗапись.УстановитьСтроку("UTF-8");
		ФабрикаСервиса.ЗаписатьXML(обЗапись, ПакетХДТО);
		ТекстовыйЛог.ДобавитьСтроку(обЗапись.Закрыть());
	КонецЕсли;
	
	Ответ = Прокси.DownloadPosition(ПакетХДТО);
	
	Рез = ПроцедурыФункцииОбмена_МО_ФО.ОбработатьОтвет(Ответ, ФабрикаСервиса, Ложь, Неопределено);
	Если ЗначениеЗаполнено(Рез.ТекстОшибки) Тогда
		ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьРассылкуПоПерерасчетуРСА(ФабрикаСервиса, Прокси, ИдентификаторСеанса, ДатаНачала, ДатаОкончания)

	//ПакетХДТО = ПроцедурыФункцииОбмена_МО_ФО.хдтоСформироватьПакет(ФабрикаСервиса);
	СтруктураПакета = Новый Структура("Справочники, Документы, РегистрыСведений, Рейтинг", Ложь, Ложь, Ложь, Ложь);
	ПакетХДТО = хдтоСформироватьПакет(ФабрикаСервиса, СтруктураПакета);
	
	ПараметрыОбмена = Новый Структура;
	ПараметрыОбмена.Вставить("ТребуетсяПерерасчетРСАВыполнитьРассылку", Истина);
	ПараметрыОбмена.Вставить("ТребуетсяПерерасчетРСАДатаНачала", ДатаНачала);
	ПараметрыОбмена.Вставить("ТребуетсяПерерасчетРСАДатаОкончания", ДатаОкончания);
	ПараметрыОбмена.Вставить("ТребуетсяПерерасчетРСАИдентификаторСеанса", Строка(ИдентификаторСеанса));
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ПараметрыОбмена);
	Комментарий = ЗаписьJSON.Закрыть();
	
	ПакетХДТО.Заголовок.Комментарий = Комментарий;
	
	Если вклОтладка Тогда
		обЗапись = Новый ЗаписьXML;
		обЗапись.УстановитьСтроку("UTF-8");
		ФабрикаСервиса.ЗаписатьXML(обЗапись, ПакетХДТО);
		ТекстовыйЛог.ДобавитьСтроку(обЗапись.Закрыть());
	КонецЕсли;
	
	Ответ = Прокси.DownloadPosition(ПакетХДТО);
	
	Рез = ПроцедурыФункцииОбмена_МО_ФО.ОбработатьОтвет(Ответ, ФабрикаСервиса, Ложь, Неопределено);
	Если ЗначениеЗаполнено(Рез.ТекстОшибки) Тогда
		ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоместитьИсполнениеВПакет(ПакетХДТО, ВыборкаПериода, ФабрикаСервиса)
    
    ВыборкаИсполнений = ВыборкаПериода.Выбрать();
    Пока ВыборкаИсполнений.Следующий() Цикл
		хдтоДобавитьВПакетИсполнениеСделки(ПакетХДТО, ВыборкаИсполнений.Сделка, ВыборкаИсполнений.Актив, ВыборкаИсполнений.Портфель, ВыборкаИсполнений.Субпортфель, ВыборкаИсполнений.МестоХранения, ВыборкаИсполнений.Количество, Истина, ФабрикаСервиса)		
	КонецЦикла; 
    
КонецПроцедуры // ПоместитьИсполнениеВПакет()

Функция СформироватьПакетПоМандату(ВыборкаПортфели, ствАктивыНеВыгружать, ФабрикаСервиса)
	
	ПакетХДТО = ПроцедурыФункцииОбмена_МО_ФО.хдтоСформироватьПакет(ФабрикаСервиса);
	ВыборкаПозиции = ВыборкаПортфели.Выбрать();
	
	Пока ВыборкаПозиции.Следующий() Цикл
		
		Если ствАктивыНеВыгружать[ВыборкаПозиции.Актив] <> Неопределено Или ВыборкаПозиции.Актив="НЕОПРЕДЕЛЕНО" Или ПустаяСтрока(ВыборкаПозиции.Актив) Тогда
			Продолжить;
		КонецЕсли;
		
		//IMAPPS-19973++
		ДанныеДляРассылки.КоличествоФактическихПозиций = ДанныеДляРассылки.КоличествоФактическихПозиций + 1;
		//IMAPPS-19973--
		
		хдтоДобавитьВПакетФактическаяПозиция(ПакетХДТО,
		ДатаДляФронт,
		ВыборкаПозиции.Актив,
		ВыборкаПозиции.Мандат,
		ВыборкаПозиции.СчетМандата,
		ВыборкаПозиции.ДоходыКПолучению,
		ВыборкаПозиции.МХ,
		ВыборкаПозиции.Колво,
		ВыборкаПозиции.Стоим,
		ВыборкаПозиции.СуммаНКД, 
		ВыборкаПозиции.СуммаЗадолженность,
		ВыборкаПозиции.ДСиЗадолженность,
		ФабрикаСервиса);
		
	КонецЦикла;
	
	СтрокиСЧА = СЧА_РСА.НайтиСтроки(новый Структура("Мандат", ВыборкаПортфели.Мандат));
	
	Для каждого СтрокаВыгрузить из СтрокиСЧА Цикл
		хдтоДобавитьВПакетСтоимостьЧистыхАктивов(ПакетХДТО, ДатаДляФронт, СтрокаВыгрузить.Мандат, СтрокаВыгрузить.СЧА, СтрокаВыгрузить.РСА, ФабрикаСервиса);
	КонецЦикла;
	
	СтрокиСделкиРЕПОМО = СделкиРЕПОМО.НайтиСтроки(новый Структура("Портфель", ВыборкаПортфели.Мандат));
	
	Для каждого СтрокаСделкиРЕПОМО из СтрокиСделкиРЕПОМО Цикл
		ОпубликоватьСделкиРЕПО(ПакетХДТО, СтрокаСделкиРЕПОМО, ФабрикаСервиса);
	КонецЦикла;
	        
	Возврат ПакетХДТО;
КонецФункции

Процедура ОпубликоватьСделкиРЕПО(ПакетХДТО, СтрокаСделкиРЕПОМО, ФабрикаСервиса)

	типХДТО	 = ФабрикаСервиса.Тип(ПространствоИменСервиса, "СделкаРЕПО");
	обХДТО = ФабрикаСервиса.Создать(типХДТО);
	обХДТО.Актив = ПроцедурыФункцииОбмена_МО_ФО.хдтоАктивПоиск(СтрокаСделкиРЕПОМО.Актив, ФабрикаСервиса);
	обХДТО.ВалютаРасчетов = ПроцедурыФункцииОбмена_МО_ФО.хдтоВалютаПоиск(СтрокаСделкиРЕПОМО.Валюта, ФабрикаСервиса);
	//обХДТО.ВерхнийДисконт                      
	Если СтрокаСделкиРЕПОМО.СделкаСЦК Тогда
		обХДТО.ВидОперацииРЕПО = "СделкаРЕПО_С_ЦК";
	Иначе
		обХДТО.ВидОперацииРЕПО = "СделкаРЕПО";	
	КонецЕсли;
	
	обХДТО.Внебиржевая = Ложь;
	обХДТО.ВнешнийКод = Строка(СтрокаСделкиРЕПОМО.СделкаРЕПО.УникальныйИдентификатор());
	обХДТО.Дата = СтрокаСделкиРЕПОМО.СделкаРЕПО.Дата;
	обХДТО.ДатаОплатыВторойЧастиРЕПО = СтрокаСделкиРЕПОМО.СделкаРЕПО.ПлановаяДатаПлатежаПо2Части;
	обХДТО.ДатаОплатыПервойЧастиРЕПО = СтрокаСделкиРЕПОМО.СделкаРЕПО.ПлановаяДатаПлатежаПо1Части;
	обХДТО.ДатаПоставкиВторойЧастиРЕПО = СтрокаСделкиРЕПОМО.СделкаРЕПО.ПлановаяДатаПоставкиПо2Части;
	обХДТО.ДатаПоставкиПервойЧастиРЕПО = СтрокаСделкиРЕПОМО.СделкаРЕПО.ПлановаяДатаПоставкиПо1Части;
	//обХДТО.ДляПрогноза
	обХДТО.Количество = СтрокаСделкиРЕПОМО.СделкаРЕПО.Количество;
	обХДТО.Контрагент = ПроцедурыФункцииОбмена_МО_ФО.хдтоКонтрагентПоиск(СтрокаСделкиРЕПОМО.СделкаРЕПО.Контрагент, ФабрикаСервиса);
	//обХДТО.КупонВторойЧастиРЕПО
	//обХДТО.КупонПервойЧастиРЕПО
	обХДТО.МестоХранения = ПроцедурыФункцииОбмена_МО_ФО.хдтоМестоХраненияПоиск(СтрокаСделкиРЕПОМО.МестоХранения, ФабрикаСервиса);
	обХДТО.МестоХраненияЦБ = ПроцедурыФункцииОбмена_МО_ФО.хдтоМестоХраненияПоиск(СтрокаСделкиРЕПОМО.МестоХраненияЦБ, ФабрикаСервиса);
	обХДТО.Направление = СтрокаСделкиРЕПОМО.Направление;
	//обХДТО.НачальныйДисконт
	//обХДТО.НеУчитыватьМестоХраненияЦБ
	//обХДТО.НижнийДисконт
	обХДТО.НомерСделки = СтрокаСделкиРЕПОМО.СделкаРЕПО.НомерСделки;
	//обХДТО.ПометкаУдаления
	обХДТО.Портфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоПорфельПоиск(СтрокаСделкиРЕПОМО.Портфель, ФабрикаСервиса);  
	хдтоПоручениеПоиск = ФабрикаСервиса.Создать(ФабрикаСервиса.Тип(ПространствоИменСервиса, "ПоручениеПоиск"));
	хдтоПоручениеПоиск.ВнешнийКод = Строка(СтрокаСделкиРЕПОМО.СделкаРЕПО.УникальныйИдентификатор());
	обХДТО.Поручение = хдтоПоручениеПоиск;
	обХДТО.Проведен = Истина;
	//обХДТО.РучнаяКорректировка
	обХДТО.СтавкаРЕПО = СтрокаСделкиРЕПОМО.СделкаРЕПО.СрокРЕПО;
	обХДТО.СубПортфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоСубпортфельПоиск(СтрокаСделкиРЕПОМО.Субпортфель, ФабрикаСервиса);
	обХДТО.СубпортфельЦБ = ПроцедурыФункцииОбмена_МО_ФО.хдтоСубпортфельПоиск(СтрокаСделкиРЕПОМО.СубпортфельЦБ, ФабрикаСервиса);
	обХДТО.СуммаВторойЧастиРЕПО = СтрокаСделкиРЕПОМО.СделкаРЕПО.СуммаСделкиПоВторойЧасти;
	обХДТО.СуммаПервойЧастиРЕПО = СтрокаСделкиРЕПОМО.СделкаРЕПО.СуммаСделкиПоПервойЧасти; 
	//обХДТО.ТипПортфеля
	обХДТО.ЦенаВторойЧастиРЕПО = СтрокаСделкиРЕПОМО.СделкаРЕПО.СуммаСделкиПоВторойЧасти/СтрокаСделкиРЕПОМО.СделкаРЕПО.Количество;
	обХДТО.ЦенаПервойЧастиРЕПО = СтрокаСделкиРЕПОМО.СделкаРЕПО.СуммаСделкиПоПервойЧасти/СтрокаСделкиРЕПОМО.СделкаРЕПО.Количество;
	
	ПакетХДТО.Документы.СделкаРЕПО.Добавить(обХДТО);		

КонецПроцедуры //ОпубликоватьСделкиРЕПО()

Процедура ОпубликоватьПорученияРЕПОМО(ФабрикаСервиса, Прокси)
    
    Попытка
		
		ПакетПорученияХДТО = ПроцедурыФункцииОбмена_МО_ФО.хдтоСформироватьПакетПоручений(ФабрикаСервиса);
		ПакетПорученияХДТО.ЗапускатьПроверкуЛимитов = Ложь;
	    
		Для каждого СтрокаСделкиРЕПО из СделкиРЕПОМО Цикл   
			хдтоДобавитьВПакетПоручениеРЕПО(ПакетПорученияХДТО, СтрокаСделкиРЕПО, ФабрикаСервиса);
		КонецЦикла;	
		
		Ответ = Прокси.DownloadOrders(ПакетПорученияХДТО);
					
		Рез = ПроцедурыФункцииОбмена_МО_ФО.ОбработатьОтвет(Ответ, ФабрикаСервиса, вклОтладка, Неопределено);
		Если Рез.ЕстьОшибки Тогда
			ЕстьОшибки = истина;
			ЕстьОшибкиПортфель = истина;
		КонецЕсли;
					
		Если ЗначениеЗаполнено(Рез.ТекстОшибки) Тогда
			ТекстовыйЛог.ДобавитьСтроку("Ошибка выгрузки поручений РЕПО из МО");
			ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОшибки);
		КонецЕсли;
					
		Если вклОтладка Тогда
			ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОтвета);
		КонецЕсли;
				
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЕстьОшибки = Истина;
		ТекстовыйЛог.ДобавитьСтроку("Ошибки создания виртуальных субпортфелей");
		ТекстовыйЛог.ДобавитьСтроку(ОписаниеОшибки);
	КонецПопытки;

КонецПроцедуры // ОпубликоватьСделкиРЕПОМО()

Процедура ОпубликоватьСделкиРЕПОМО(ФабрикаСервиса, Прокси)
	
	Попытка
		
		ПакетХДТО = ПроцедурыФункцииОбмена_МО_ФО.хдтоСформироватьПакет(ФабрикаСервиса);
		
		Для каждого СтрокаСделкиРЕПО из СделкиРЕПОМО Цикл   
			ОпубликоватьСделкиРЕПО(ПакетХДТО, СтрокаСделкиРЕПО, ФабрикаСервиса);
		КонецЦикла;	
		
		Ответ = Прокси.DownloadPosition(ПакетХДТО);
					
		Рез = ПроцедурыФункцииОбмена_МО_ФО.ОбработатьОтвет(Ответ, ФабрикаСервиса, вклОтладка, Неопределено);
		Если Рез.ЕстьОшибки Тогда
			ЕстьОшибки = истина;
			ЕстьОшибкиПортфель = истина;
		КонецЕсли;
					
		Если ЗначениеЗаполнено(Рез.ТекстОшибки) Тогда
			ТекстовыйЛог.ДобавитьСтроку("Ошибка выгрузки сделок РЕПО из МО");
			ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОшибки);
		КонецЕсли;
					
		Если вклОтладка Тогда
			ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОтвета);
		КонецЕсли;
				
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЕстьОшибки = Истина;
		ТекстовыйЛог.ДобавитьСтроку("Ошибки создания виртуальных субпортфелей");
		ТекстовыйЛог.ДобавитьСтроку(ОписаниеОшибки);
	КонецПопытки;

КонецПроцедуры // ОпубликоватьСделкиРЕПОМО()

Процедура хдтоДобавитьВПакетПоручениеРЕПО(ПакетХДТО, СтрокаСделкиРЕПО, ФабрикаСервиса)

	типХДТО = ФабрикаСервиса.Тип(ПространствоИменСервиса, "Поручение");
	обХДТО = ФабрикаСервиса.Создать(типХДТО);
	обХДТО.Проведен = Истина;
	обХДТО.ПометкаУдаления = Ложь;
	обХДТО.ВнешнийКод = Строка(СтрокаСделкиРЕПО.СделкаРЕПО.УникальныйИдентификатор());
	обХДТО.Дата = СтрокаСделкиРЕПО.СделкаРЕПО.Дата;
	обХДТО.Ответственный = хдтоПользовательПоиск("svc_avancore", ФабрикаСервиса);
	обХДТО.Актив = ПроцедурыФункцииОбмена_МО_ФО.хдтоАктивПозицияПоиск(СтрокаСделкиРЕПО.Актив, ФабрикаСервиса);
	
	обХДТО.РеквизитыПоВидуОперации = ФабрикаСервиса.Создать(обХДТО.Свойства().Получить("РеквизитыПоВидуОперации").Тип);
	обХДТО.РеквизитыПоВидуОперации.РЕПО = ФабрикаСервиса.Создать(обХДТО.РеквизитыПоВидуОперации.Свойства().Получить("РЕПО").Тип);

	обХДТО.РеквизитыПоВидуОперации.РЕПО.Направление = СтрокаСделкиРЕПО.Направление;
	обХДТО.РеквизитыПоВидуОперации.РЕПО.Портфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоПорфельПоиск(СтрокаСделкиРЕПО.Портфель, ФабрикаСервиса);
	обХДТО.РеквизитыПоВидуОперации.РЕПО.ВалютаРасчетов = ПроцедурыФункцииОбмена_МО_ФО.хдтоВалютаПоиск(СтрокаСделкиРЕПО.Валюта, ФабрикаСервиса);
	обХДТО.РеквизитыПоВидуОперации.РЕПО.ДатаВторойЧастиРЕПО = СтрокаСделкиРЕПО.СделкаРЕПО.ПлановаяДатаПоставкиПо2Части;
	обХДТО.РеквизитыПоВидуОперации.РЕПО.ДатаПервойЧастиРЕПО = СтрокаСделкиРЕПО.СделкаРЕПО.ПлановаяДатаПоставкиПо1Части;
	обХДТО.РеквизитыПоВидуОперации.РЕПО.МестоХранения = ПроцедурыФункцииОбмена_МО_ФО.хдтоМестоХраненияПоиск(СтрокаСделкиРЕПО.МестоХранения, ФабрикаСервиса);
	обХДТО.РеквизитыПоВидуОперации.РЕПО.МестоХраненияЦБ = ПроцедурыФункцииОбмена_МО_ФО.хдтоМестоХраненияПоиск(СтрокаСделкиРЕПО.МестоХраненияЦБ, ФабрикаСервиса);
	
	обХДТО.РеквизитыПоВидуОперации.РЕПО.СрокРЕПО = СтрокаСделкиРЕПО.СделкаРЕПО.СрокРЕПО;
	обХДТО.РеквизитыПоВидуОперации.РЕПО.СтавкаРЕПО = СтрокаСделкиРЕПО.СделкаРЕПО.СтавкаРЕПО;
	обХДТО.РеквизитыПоВидуОперации.РЕПО.Субпортфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоСубпортфельПоиск(СтрокаСделкиРЕПО.Субпортфель, ФабрикаСервиса);
	обХДТО.РеквизитыПоВидуОперации.РЕПО.СубпортфельЦБ = ПроцедурыФункцииОбмена_МО_ФО.хдтоСубпортфельПоиск(СтрокаСделкиРЕПО.СубпортфельЦБ, ФабрикаСервиса);
	
	обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО = ФабрикаСервиса.Создать(обХДТО.РеквизитыПоВидуОперации.РЕПО.Свойства().Получить("РеквизитыПоВидуРЕПО").Тип);
	
	Если СтрокаСделкиРЕПО.СделкаСЦК Тогда
		обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО_С_ЦК = ФабрикаСервиса.Создать(обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.Свойства().Получить("СделкаРЕПО_С_ЦК").Тип);
		обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО_С_ЦК.ЗаполнениеПоСумме = ФабрикаСервиса.Создать(обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО_С_ЦК.Свойства().Получить("ЗаполнениеПоСумме").Тип); 				
		обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО_С_ЦК.ЗаполнениеПоСумме.СуммаПоручения = СтрокаСделкиРЕПО.СуммаРЕПО;
	Иначе
	    обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО = ФабрикаСервиса.Создать(обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.Свойства().Получить("СделкаРЕПО").Тип);	
	КонецЕсли;
	
	обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоРежимуТоргов = ФабрикаСервиса.Создать(обХДТО.РеквизитыПоВидуОперации.РЕПО.Свойства().Получить("РеквизитыПоРежимуТоргов").Тип);	
	обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоРежимуТоргов.Биржевая =  ФабрикаСервиса.Создать(обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоРежимуТоргов.Свойства().Получить("Биржевая").Тип); 
	обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоРежимуТоргов.Биржевая.Биржа = ПроцедурыФункцииОбмена_МО_ФО.хдтоБиржаПоиск(СтрокаСделкиРЕПО.СделкаРЕПО.Биржа, ФабрикаСервиса);
	//обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоРежимуТоргов.Биржевая.КодКлиента  
	хдтоОбъект = ФабрикаСервиса.Создать(ФабрикаСервиса.Тип(ПространствоИменСервиса, "РежимТорговПоиск"));
	хдтоОбъект.Наименование = СтрокаСделкиРЕПО.СделкаРЕПО.КодКласса;
	обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоРежимуТоргов.Биржевая.РежимТоргов = хдтоОбъект;
	//обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоРежимуТоргов.Биржевая.ТорговыйСчет
	
	//обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО.Котировка
	//обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО.Цена
	//обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО.Купон
	//обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО.ЦенаВВалютеРасчетов
	//обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО.КоличествоЛотов
	//обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО.Лот
	//обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО.Партнер
	//обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО.КодРасчетовРЕПО
	//обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО.ЦенаВВалютеИнструмента
	//обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО.КурсПересчетов
	//обХДТО.РеквизитыПоВидуОперации.РЕПО.РеквизитыПоВидуРЕПО.СделкаРЕПО.КратностьПересчетов
	
			
	ПакетХДТО.Поручения.Добавить(обХДТО);  
	
КонецПроцедуры //хдтоДобавитьВПакетСделкаРЕПО()

#КонецОбласти

Процедура ЗаполнитьРейтинги(Прокси, ФабрикаСервиса)
	
	Запрос = новый Запрос;
	//Запрос.УстановитьПараметр("", );
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка
	|ИЗ
	|	Документ.УстановкаРейтингаПоЭмитенту КАК т
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(т.Дата, ДЕНЬ) В
	|			(ВЫБРАТЬ
	|				НАЧАЛОПЕРИОДА(МАКСИМУМ(т.Дата), ДЕНЬ)
	|			ИЗ
	|				Документ.УстановкаРейтингаПоЭмитенту КАК т)";
	
	обПакет = ПроцедурыФункцииОбмена_МО_ФО.хдтоСформироватьПакет(ФабрикаСервиса);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			хдтоДобавитьВПакетУстановкаРейтингаПоЭмитенту(обПакет, Выборка.Ссылка, ФабрикаСервиса);	
			//Ответ = Прокси.DownloadPosition(обПакет);
			Ответ = Прокси.DownloadPosition(обПакет);
			
			Рез = ПроцедурыФункцииОбмена_МО_ФО.ОбработатьОтвет(Ответ, ФабрикаСервиса, вклОтладка);
			Если Рез.ЕстьОшибки Тогда
				ЕстьОшибки = истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Рез.ТекстОшибки) Тогда
				ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОшибки);
			КонецЕсли;
			
			Если вклОтладка Тогда
				ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОтвета);
			КонецЕсли;
			
			Если не Рез.ЕстьОшибки Тогда
				ТекстовыйЛог.ДобавитьСтроку(" * Выгрузка - успешно *");
			КонецЕсли;
			
		Исключение
				ТекстовыйЛог.ДобавитьСтроку("Выгрузка: "+ Выборка.Ссылка);
				ТекстовыйЛог.ДобавитьСтроку(ОписаниеОшибки());
				ЕстьОшибки = истина;
		КонецПопытки;
	КонецЦикла;
	
	
КонецПроцедуры
//WS PositionSet 

Процедура хдтоДобавитьВПакетФактическаяПозиция(обПакет, Период, вхАктив, вхПортфель, вхСубпортфель, ДоходыКПолучению, вхМХ, Колво, Стоим, СуммаНКД, СуммаЗадолженность, ДСиЗадолженность, ФабрикаСервиса)
	
	типХДТО	 = ФабрикаСервиса.Тип(ПространствоИменСервиса, "ФактическаяПозиция");
	обХДТО = ФабрикаСервиса.Создать(типХДТО);
	обХДТО.Дата = Период;
	обХДТО.Портфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоПорфельПоиск(вхПортфель, ФабрикаСервиса);
	обХДТО.Актив = ПроцедурыФункцииОбмена_МО_ФО.хдтоАктивПозицияПоиск(вхАктив, ФабрикаСервиса);
	обХДТО.МестоХранения = ПроцедурыФункцииОбмена_МО_ФО.хдтоМестоХраненияПоиск(вхМХ, ФабрикаСервиса);
	
	Если ДоходыКПолучению = Истина Тогда
		обХДТО.Субпортфель = хдтоВиртуальныйСубпортфельПоиск(вхСубпортфель, ФабрикаСервиса);
	Иначе
		обХДТО.Субпортфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоСубпортфельПоиск(вхСубпортфель, ФабрикаСервиса);
	КонецЕсли;

	обХДТО.Количество = Колво;
	обХДТО.Стоимость = Стоим;
	обХДТО.НКД = СуммаНКД;
	обХДТО.Задолженность = СуммаЗадолженность;
	обХДТО.СуммаДенежныхСредствСЗадолженностью = ДСиЗадолженность;
	обПакет.РегистрыСведений.ФактическаяПозиция.Добавить(обХДТО);
	
	Отказ = Ложь;
	тхтОшибки = "";
	
КонецПроцедуры

Процедура хдтоДобавитьВПакетСтоимостьЧистыхАктивов(обПакет, Период, Портфель, СЧА, РСА, ФабрикаСервиса)
	
	типХДТО	 = ФабрикаСервиса.Тип(ПространствоИменСервиса, "РыночнаяСтоимостьИСтоимостьЧистыхАктивов");
	обХДТО = ФабрикаСервиса.Создать(типХДТО);
	обХДТО.Период = Период;
	обХДТО.Портфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоПорфельПоиск(Портфель, ФабрикаСервиса);
	обХДТО.СЧА = СЧА;
	обХДТО.РСА = РСА;
	обПакет.РегистрыСведений.СтоимостьЧистыхАктивов.Добавить(обХДТО);
	
КонецПроцедуры

Процедура хдтоДобавитьВПакетБлокировку(обПакет, Период, ВнешнийКод, сПортфель, сАктив, сСубПортфель, Количество, Сумма, ФабрикаСервиса)
	
	//ссДОк = Документы.УстановкаРейтингаПоЭмитенту.ПустаяСсылка();
	типХДТО = ФабрикаСервиса.Тип(ПространствоИменСервиса, "Поручение");
	обХДТО = ФабрикаСервиса.Создать(типХДТО);
	обХДТО.Проведен = Истина;
	обХДТО.ПометкаУдаления = Ложь;
	обХДТО.ВнешнийКод = ВнешнийКод;
	обХДТО.Дата = Период;
	обХДТО.Ответственный = хдтоПользовательПоиск("svc_avancore", ФабрикаСервиса);
	обХДТО.Актив = ПроцедурыФункцииОбмена_МО_ФО.хдтоАктивПозицияПоиск(сАктив, ФабрикаСервиса);
	//<xs:element name="ЛимитСрока" type="xs:decimal" minOccurs="0"/>
	
	обХДТО.РеквизитыПоВидуОперации = ФабрикаСервиса.Создать(обХДТО.Свойства().Получить("РеквизитыПоВидуОперации").Тип);
	обХДТО.РеквизитыПоВидуОперации.НеторговоеПоручение = ФабрикаСервиса.Создать(обХДТО.РеквизитыПоВидуОперации.Свойства().Получить("НеторговоеПоручение").Тип);

	обХДТО.РеквизитыПоВидуОперации.НеторговоеПоручение.ВидОперацииНеторговогоПоручения = "Вывод";
	обХДТО.РеквизитыПоВидуОперации.НеторговоеПоручение.Портфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоПорфельПоиск(сПортфель, ФабрикаСервиса);
	обХДТО.РеквизитыПоВидуОперации.НеторговоеПоручение.ВалютаРасчетов = ПроцедурыФункцииОбмена_МО_ФО.хдтоВалютаПоиск(сАктив, ФабрикаСервиса);
	//обХДТО.РеквизитыПоВидуОперации.НеторговоеПоручение.Субпортфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоСубпортфельПоиск(сСубПортфель, ФабрикаСервиса);
	//обХДТО.РеквизитыПоВидуОперации.НеторговоеПоручение.МестоХранения = ПроцедурыФункцииОбмена_МО_ФО.хдтоМестоХраненияПоиск(сСубПортфель.МестоХранения, ФабрикаСервиса);
	обХДТО.РеквизитыПоВидуОперации.НеторговоеПоручение.СубпортфельЦБ = ПроцедурыФункцииОбмена_МО_ФО.хдтоСубпортфельПоиск(сСубПортфель, ФабрикаСервиса);
	обХДТО.РеквизитыПоВидуОперации.НеторговоеПоручение.МестоХраненияЦБ = ПроцедурыФункцииОбмена_МО_ФО.хдтоМестоХраненияПоиск(сСубПортфель.МестоХранения, ФабрикаСервиса);
	обХДТО.РеквизитыПоВидуОперации.НеторговоеПоручение.Количество = Количество;
	обХДТО.РеквизитыПоВидуОперации.НеторговоеПоручение.СуммаПоручения = Сумма;
	
	обПакет.Поручения.Добавить(обХДТО);
	
КонецПроцедуры

Процедура хдтоДобавитьВПакетУстановкаРейтингаПоЭмитенту(обПакет, ссДок, ФабрикаСервиса)
	
	//ссДОк = Документы.УстановкаРейтингаПоЭмитенту.ПустаяСсылка();
	типХДТО	 = ФабрикаСервиса.Тип(ПространствоИменСервиса, "УстановкаРейтингаПоЭмитенту");
	обХДТО = ФабрикаСервиса.Создать(типХДТО);
	обХДТО.ВнешнийКод = СокрЛП(ссДок.УникальныйИдентификатор());
	обХДТО.Дата = ссДок.Дата;
	обХДТО.РучнаяКорректировка = Ложь;
	обХДТО.Проведен = ссДок.Проведен;
	обХДТО.ПометкаУдаления  = ссДок.ПометкаУдаления;
	обХДТО.Агентство = ПроцедурыФункцииОбмена_МО_ФО.хдтоКонтрагентПоиск(ссДок.Агентство, ФабрикаСервиса);
	обХДТО.Эмитент = ПроцедурыФункцииОбмена_МО_ФО.хдтоКонтрагентПоиск(ссДок.Эмитент, ФабрикаСервиса);
	
	типХДТО_РА = обХДТО.Свойства().Получить("РейтинговыеАгентства").Тип;
	Для каждого СтрокаДок из ссДок.РейтинговыеАгентства Цикл
		обХДТО_РА = ФабрикаСервиса.Создать(типХДТО_РА);
		обХДТО_РА.ШкалаРейтингов = ПроцедурыФункцииОбмена_МО_ФО.хдтоШкалаРейтинговПоиск(СтрокаДок.ШкалаРейтингов, ФабрикаСервиса);
		обХДТО_РА.Рейтинг = ПроцедурыФункцииОбмена_МО_ФО.хдтоРейтингПоиск(СтрокаДок.Рейтинг, ФабрикаСервиса);
		//обХДТО_РА.ПрогнозныйРейтинг = "";
		обХДТО.РейтинговыеАгентства.Добавить(обХДТО_РА);
	КонецЦикла;
	
	типХДТО_Выпуск = обХДТО.Свойства().Получить("РейтингиПоВыпускам").Тип;
	Для каждого СтрокаДок из ссДок.РейтингиПоВыпускам Цикл
		обХДТО_Выпуск = ФабрикаСервиса.Создать(типХДТО_Выпуск);
		обХДТО_Выпуск.Актив = ПроцедурыФункцииОбмена_МО_ФО.хдтоАктивПоиск(СтрокаДок.Актив, ФабрикаСервиса);
		обХДТО_Выпуск.ШкалаРейтингов = ПроцедурыФункцииОбмена_МО_ФО.хдтоШкалаРейтинговПоиск(СтрокаДок.ШкалаРейтингов, ФабрикаСервиса);
		обХДТО_Выпуск.Рейтинг = ПроцедурыФункцииОбмена_МО_ФО.хдтоРейтингПоиск(СтрокаДок.Рейтинг, ФабрикаСервиса);
		//обХДТО_Выпуск.ПрогнозныйРейтинг = "";
		обХДТО.РейтингиПоВыпускам.Добавить(обХДТО_Выпуск);
	КонецЦикла;
	
	обПакет.Документы.УстановкаРейтингаПоЭмитенту.Добавить(обХДТО);
	
КонецПроцедуры

Функция РазрешеноДобавитьВПакетСсылку(СсылкаДляВыгрузки)
	
	Ответ = Ложь;
	
	Если не ВыгружатьАктивыСчета Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если списВыгруженныеОбъекты = Неопределено Тогда
		списВыгруженныеОбъекты = новый Соответствие;
	КонецЕсли;
	
	Если списВыгруженныеОбъекты[СсылкаДляВыгрузки] = Неопределено Тогда
		Ответ = Истина;
		списВыгруженныеОбъекты.Вставить(СсылкаДляВыгрузки, Истина);
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

////////////////
//Вспомогательные процедуры и функции

// Получает определение WS из макета
//
Функция ПолучитьОпределениеСервиса()
	
	СтруктураВозврата = Новый Структура("ОпределениеWS, ЕстьОшибки, ОписаниеОшибки", Неопределено, Ложь, ""); 
	
	Попытка
		//СтруктураВозврата.ОпределениеWS = Новый WSОпределения("http://smsk02mg31u/AVC_UAT_FO/ws/avancore_ws.1cws?wsdl");
		Если ЭтотОбъект.АдресWS="http://smsk02mg138u/AVC_PP_FO/ws/avancore_ws.1cws?wsdl" Тогда
			СтруктураВозврата.ОпределениеWS = Новый WSОпределения(ЭтотОбъект.АдресWS, "admin", "адм232882", ,30);
		Иначе	
			СтруктураВозврата.ОпределениеWS = Новый WSОпределения(ЭтотОбъект.АдресWS,,,,30);
		КонецЕсли;	
	Исключение
		СтруктураВозврата.ЕстьОшибки = Истина;
		СтруктураВозврата.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки; 

	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьОпределениеСервиса()

////////////////
//Формирование xml и валидация

// Возвращает xml объекта данных сервиса
//
Функция ФайлXMLПоСхеме(ОбъектДанных, Фабрика)
	
	ИмяФайлаXML = ПолучитьИмяВременногоФайла("xml");
	Запись = Новый ЗаписьXML;
	Запись.ОткрытьФайл(ИмяФайлаXML);
	Фабрика.ЗаписатьXML(Запись, ОбъектДанных); 
	Запись.Закрыть();
	
	Возврат ИмяФайлаXML;
	
КонецФункции

////////////////
//Фоновое задание

// Формирует структуру отбора для заполнения табличных частей из фонового задания
//
Функция СформироватьОтборДляФоновогоЗадания()
	
	Запрос = Новый Запрос(ПолучитьТекстЗапросаДляФоновогоЗадания());
//	Запрос.УстановитьПараметр("ДатаОстатков", ТекущаяДата());
	Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(ТекущаяДата()-60*60*24));

	Условие = "";
	Если ОтборМандат Тогда 
		ПроверитьУсловиеМандатыОтбор(Условие, Ложь);
		Запрос.УстановитьПараметр("СписМандатОтбор", СписМандатОтбор);
	Иначе
		Если ЗначениеЗаполнено(МандатДляТеста) Тогда
			СписМандатОтбор.Добавить(МандатДляТеста);
			ПроверитьУсловиеМандатыОтбор(Условие, Ложь);
			Запрос.УстановитьПараметр("СписМандатОтбор", СписМандатОтбор);
		КонецЕсли;
	КонецЕсли;

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", Условие);

	Возврат Новый Структура("СчетаМандатов", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетМандата"));

КонецФункции // СформироватьОтборДляФоновогоЗадания()

// Возвращает текст запроса для функции "СформироватьОтборДляФоновогоЗадания"
//
Функция ПолучитьТекстЗапросаДляФоновогоЗадания()

	Возврат
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Остатки.СчетМандата КАК СчетМандата
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДенежныеСредстваОстатки.СчетМандата КАК СчетМандата
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредства.Остатки(&ДатаОстатков, &УсловиеОтбора) КАК ДенежныеСредстваОстатки
	|	ГДЕ
	|		1 = 1
	|		И ДенежныеСредстваОстатки.СчетМандата.Наименование <> ""Счет мандата не определен""
	|		И ЕСТЬNULL(ДенежныеСредстваОстатки.СчетМандата.МестоХранения.ВидБанковскогоСчета, """") <> ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Депозитный)
	|		И (ДенежныеСредстваОстатки.СчетМандата.ВидСчетаМандата.Наименование = ""Брокерский""
	|					И ДенежныеСредстваОстатки.СчетМандата.Владелец.ТипМандата.Ссылка В (ЗНАЧЕНИЕ(Перечисление.ТипыМандата.V), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.Y), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.Q), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.H))
	|				ИЛИ НЕ ДенежныеСредстваОстатки.СчетМандата.Владелец.ТипМандата.Ссылка В (ЗНАЧЕНИЕ(Перечисление.ТипыМандата.V), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.Y), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.Q), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.H)))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЦенныеБумагиОстатки.СчетМандата
	|	ИЗ
	|		РегистрНакопления.ЦенныеБумаги.Остатки(&ДатаОстатков, &УсловиеОтбора) КАК ЦенныеБумагиОстатки
	|	ГДЕ
	|		1 = 1
	|		И ЦенныеБумагиОстатки.СчетМандата.Наименование <> ""Счет мандата не определен""
	|		И ЕСТЬNULL(ЦенныеБумагиОстатки.СчетМандата.МестоХранения.ВидБанковскогоСчета, """") <> ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Депозитный)
	|		И (ЦенныеБумагиОстатки.СчетМандата.ВидСчетаМандата.Наименование = ""Брокерский""
	|					И ЦенныеБумагиОстатки.СчетМандата.Владелец.ТипМандата.Ссылка В (ЗНАЧЕНИЕ(Перечисление.ТипыМандата.V), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.Y), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.Q), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.H))
	|				ИЛИ НЕ ЦенныеБумагиОстатки.СчетМандата.Владелец.ТипМандата.Ссылка В (ЗНАЧЕНИЕ(Перечисление.ТипыМандата.V), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.Y), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.Q), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.H)))) КАК Остатки"
			
	;
	
КонецФункции // ПолучитьТекстЗапросаДляФоновогоЗадания()

////////////////
//Тестовый режим

// Возвращает xml тестового ответа WS PositionClear из макета обработки
//
Функция ПолучитьТестовыйОтветОчистки(Определение)
	
	ФайлПример = ПолучитьИмяВременногоФайла("xml");
	
	Пример = ПолучитьМакет("ПримерОтветаClearPosition");
	Пример.Записать(ФайлПример, КодировкаТекста.UTF8);
	
	Чтение	= Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ФайлПример);
	
	Фабрика = Определение.ФабрикаXDTO;

	ОчисткаРезультат_Тип  = Фабрика.Тип(ПространствоИменСервиса, "ИсхОчисткаУстановка");
	ОчисткаРезультат = Фабрика.ПрочитатьXML(Чтение);
	
	Возврат ОчисткаРезультат.body.ОчисткаРезультат;
	
КонецФункции

// Возвращает xml тестового ответа WS PositionSet из макета обработки
//
Функция ПолучитьТестовыйОтветУстановки(Определение)
	
	ФайлПример = ПолучитьИмяВременногоФайла("xml");
	
	Пример = ПолучитьМакет("ПримерОтветаPositionSet");
	Пример.Записать(ФайлПример, КодировкаТекста.UTF8);
	
	Чтение	= Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ФайлПример);
	
	Фабрика = Определение.ФабрикаXDTO;

	УстановкаРезультат_Тип  = Фабрика.Тип(ПространствоИменСервиса, "ВхИсхПозиция");
	УстановкаРезультат = Фабрика.ПрочитатьXML(Чтение);
	
	Возврат УстановкаРезультат.body.УстановкаРезультат;
	
КонецФункции

// Возвращает данные по денежным средствам на дату находящиеся в РЕПО 
//
// Параметры:
//  Дата  - Дата - Дата, на которую будут получены данные
//  Отбор - Структура - структура отбора данных, содержащая одно из полей:
//						[Мандаты] - Массив - Массив ссылок Справочник.Мандаты
//                      [СчетаМандатов] - Массив ссылок Справочник.СчетаМандатов
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Таблица данных по денежным средствам на дату
//
Функция РЕПОДенежныеСредстваНаДату(Дата, Отбор) Экспорт
	
	Условие = "";
	ДатаЗаполнения =  НачалоДня(Дата);
	
	Запрос = Новый Запрос(ПолучитьТекстЗапросаРЕПОДенежныеСредстваНаДату());
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", Новый Граница(КонецДня(ДатаЗаполнения), ВидГраницы.Включая));
	
	Условие = "Мандат <> ЗНАЧЕНИЕ(Справочник.Мандаты.НеОпределен) И (Мандат.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1) ИЛИ Мандат.ДатаОкончания > &ДатаОкончанияПериода)";
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Если Отбор.Свойство("Мандаты") Тогда
			Условие = Условие + " И Мандат В (&Мандаты)";
			Запрос.УстановитьПараметр("Мандаты", Отбор.Мандаты);
		КонецЕсли; 
		Если Отбор.Свойство("СчетаМандатов") Тогда
			Условие = Условие + ?(ПустаяСтрока(Условие), "", " И ");
			Условие = "СчетМандата В (&СчетаМандатов)";
			Запрос.УстановитьПараметр("СчетаМандатов", Отбор.СчетаМандатов);
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", Условие);
	
	ОбщегоНазначенияМО.ДобавитьВЛогОтладки(Запрос, "Регистр ""Денежные средства, отданные/полученные по РЕПО"": Денежные средства на дату");
	
	РезультатЗапроса = Запрос.Выполнить();;
	
	//ДатаЗаполнения =  ДатаПоз+1;//КонецДня(ТекущаяДата());
	СтруктураСервиса = ПолучитьОпределениеСервиса();
	Если СтруктураСервиса.ЕстьОшибки Тогда
		Сообщить(СтруктураСервиса.ОписаниеОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
	ВалютаРубли = Справочники.Валюты.RUB;
	
	ПозицияРЕПОФО = ПолучитьРЕПОФО(ДатаЗаполнения, Отбор);
	СделкиРЕПОМО.Очистить();
	
	ВыборкаСделкаРЕПО = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаСделкаРЕПО.Следующий() Цикл
		
		НомерСделки = ВыборкаСделкаРЕПО.НомерСделки;
		ВнешнийКод = ВыборкаСделкаРЕПО.Портфель.КодМандата;
		
		СтруктураПоиск = Новый Структура("НомерСделки, Портфель", ВыборкаСделкаРЕПО.НомерСделки, ВыборкаСделкаРЕПО.Портфель);
		СтрокиПозицияРЕПОФО = ПозицияРЕПОФО.НайтиСтроки(СтруктураПоиск);
		Если СтрокиПозицияРЕПОФО.Количество()>0 Тогда
			Продолжить;
		КонецЕсли;
		
		Определение = СтруктураСервиса.ОпределениеWS;
		ФабрикаСервиса = Определение.ФабрикаXDTO;
		URIПространстваИмен = Определение.Сервисы[0].URIПространстваИмен;
		Прокси = Новый WSПрокси(Определение, URIПространстваИмен, Определение.Сервисы[0].Имя, Определение.Сервисы[0].ТочкиПодключения[0].Имя);
		
		Если ЭтотОбъект.АдресWS="http://smsk02mg31u/AVC_PP_FO/ws/avancore_ws.1cws?wsdl" Тогда
			Прокси.Пользователь = "admin";
			Прокси.Пароль = "адм232882";
		КонецЕсли;
		
		ПакетПараметрыЗапроса = хдтоСоздатьПакетЗапросНайтиРЕПО(НомерСделки, ВнешнийКод, ФабрикаСервиса);
		Ответ = Прокси.GetDataOnRequest("СделкаРЕПОПоНомеруИПортфелю", ПакетПараметрыЗапроса);
		
		Рез = ОбработатьОтветПоискРЕПО(Ответ, ФабрикаСервиса, вклОтладка);
		
		Если Не Рез.НайденСделка Тогда
			Если ВыборкаСделкаРЕПО.СделкаРЕПО.Дата>=ДатаНачалоВыгрузкиРЕПО И ДатаНачалоВыгрузкиРЕПО<>Дата(1,1,1) Тогда
				НоваяСделкиРЕПОМО = СделкиРЕПОМО.Добавить();		
				ЗаполнитьЗначенияСвойств(НоваяСделкиРЕПОМО, ВыборкаСделкаРЕПО);
				НоваяСделкиРЕПОМО.ДеньЗаключения = НачалоДня(ВыборкаСделкаРЕПО.СделкаРЕПО.ПлановаяДатаПлатежаПо1Части)=ДатаЗаполнения;
				НоваяСделкиРЕПОМО.ДеньРасчета = НачалоДня(ВыборкаСделкаРЕПО.СделкаРЕПО.ПлановаяДатаПлатежаПо2Части)<=ДатаЗаполнения;
				НоваяСделкиРЕПОМО.Количество = ВыборкаСделкаРЕПО.СделкаРЕПО.Количество;
				НоваяСделкиРЕПОМО.СуммаРЕПО = ?(НоваяСделкиРЕПОМО.ДеньРасчета, -1, 1)*ВыборкаСделкаРЕПО.СделкаРЕПО.СуммаСделкиПоПервойЧасти;
				ДатаПлатежаПо1Части = ВыборкаСделкаРЕПО.СделкаРЕПО.ПлановаяДатаПлатежаПо1Части;
				НоваяСделкиРЕПОМО.СуммаРЕПОРубли = ?(НоваяСделкиРЕПОМО.Валюта=ВалютаРубли, НоваяСделкиРЕПОМО.СуммаРЕПО, РаботаСКурсамиВалют.ПересчитатьВВалюту(НоваяСделкиРЕПОМО.СуммаРЕПО, НоваяСделкиРЕПОМО.Валюта, ВалютаРубли, ДатаПлатежаПо1Части));//?(НоваяСделкиРЕПОМО.ДеньРасчета, -1, 1)*ВыборкаСделкаРЕПО.СделкаРЕПО.СуммаСделкиПоПервойЧасти;
			КонецЕсли; 
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПозицияРЕПОФО;
	
КонецФункции // РЕПОДенежныеСредстваНаДату()

// Возвращает данные по подтвержденным денежным переводам внутри дня 
//
// Параметры:
//  Отбор - Структура - структура отбора данных, содержащая одно из полей:
//						[Мандаты] - Массив - Массив ссылок Справочник.Мандаты
//                      [СчетаМандатов] - Массив ссылок Справочник.СчетаМандатов
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Таблица данных по денежным средствам на дату
//
Функция ПереводыВнутриДняНаДату(Отбор) Экспорт

	Условие = "";
	ТекДата = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Мандат,
	|	т.СчетМандата,
	|	т.Валюта,
	|	т.СуммаВыполненоОборот КАК ВходящийОстаток,
	|	0 КАК РЕПО,
	|	0 КАК ДневнойОборот
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредствВнутриДня.Обороты(&НачДня, &КонецДня, , &СтрокаОтбор) КАК т"
	;

	Запрос.УстановитьПараметр("НачДня", НачалоДня(ТекДата));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекДата));
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Если Отбор.Свойство("Мандаты") Тогда
			Условие = "Мандат В (&Мандаты)";
			Запрос.УстановитьПараметр("Мандаты", Отбор.Мандаты);
		КонецЕсли; 
		Если Отбор.Свойство("СчетаМандатов") Тогда
			Условие = Условие + ?(ПустаяСтрока(Условие), "", " И ");
			Условие = "СчетМандата В (&СчетаМандатов)";
			Запрос.УстановитьПараметр("СчетаМандатов", Отбор.СчетаМандатов);
		КонецЕсли; 
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СтрокаОтбор", Условие);
	
	ОбщегоНазначенияМО.ДобавитьВЛогОтладки(Запрос, "Регистр ""Движения денежных средств внутри дня"": Денежные средства на дату");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции // РЕПОДенежныеСредстваНаДату()

Функция ПолучитьФактПозициюIntraDay(Прокси, ФабрикаСервиса)
    
    ДатыПериодаПозиции = ДатаПредыдущегоДня();
        
	ПакетПараметрыЗапроса = хдтоСоздатьПакетЗапросФактическойПозицииIntraDay(ДатыПериодаПозиции, ФабрикаСервиса);
	
	Ответ = Прокси.GetDataOnRequest("ЗапросФактическойПозицииIntraDay", ПакетПараметрыЗапроса);
			
	Рез = ОбработатьОтветФактПозицииIntraDay(Ответ, ФабрикаСервиса, вклОтладка);	
    
    Возврат Рез.ТЗ_ФО;
    
КонецФункции // ПолучитьФактПозициюIntraDay()

Функция хдтоСоздатьПакетЗапросФактическойПозицииIntraDay(ДатаПозиции, ФабрикаСервиса)
	
	типЗапросУниверсальныхДанных = ФабрикаСервиса.Тип(ПроцедурыФункцииОбмена_МО_ФО.ПолучитьПространствоИменСервиса(), "ЗапросУниверсальныхДанных");
	обХДТОЗапрос = ФабрикаСервиса.Создать(типЗапросУниверсальныхДанных);
	
	типЗаголовок = ФабрикаСервиса.Тип(ПроцедурыФункцииОбмена_МО_ФО.ПолучитьПространствоИменСервиса(), "Заголовок");
	обХДТОЗапрос.Заголовок = ФабрикаСервиса.Создать(типЗаголовок);
	обХДТОЗапрос.Заголовок.УникальныйИдентификатор = "777";
	обХДТОЗапрос.Заголовок.ДатаВыполнения = ТекущаяДатаСеанса();
	обХДТОЗапрос.Заголовок.ИдентификаторСистемы = "МО";
	обХДТОЗапрос.Заголовок.ИмяПользователя = "сп";
	
	типПараметры = обХДТОЗапрос.Тип().Свойства.Получить("Параметры").Тип;
	
	//параметрыЗапроса
	обХДТОПараметры = ФабрикаСервиса.Создать(типПараметры);
	обХДТОПараметры.Ключ = "НачалоПериод";
	типЗначения = обХДТОПараметры.Тип().Свойства.Получить("Значения").Тип;
	
	обХДТОЗначения = ФабрикаСервиса.Создать(типЗначения);
		
	обХДТОЗначения.Значение = ДатаПозиции.ДатаНачала;
	обХДТОПараметры.Значения.Добавить(обХДТОЗначения);
	
	обХДТОЗапрос.Параметры.Добавить(обХДТОПараметры);
	
	обХДТОПараметры = ФабрикаСервиса.Создать(типПараметры);
	обХДТОПараметры.Ключ = "КонецПериод";
	типЗначения = обХДТОПараметры.Тип().Свойства.Получить("Значения").Тип;
	
	обХДТОЗначения = ФабрикаСервиса.Создать(типЗначения);
		
	обХДТОЗначения.Значение = ДатаПозиции.ДатаКонца;
	обХДТОПараметры.Значения.Добавить(обХДТОЗначения);
	
	обХДТОЗапрос.Параметры.Добавить(обХДТОПараметры);

	
	Возврат обХДТОЗапрос;
	
КонецФункции //хдтоСоздатьПакетЗапросФактическойПозицииIntraDay()

Функция хдтоСоздатьПакетЗапросРЕПО(ДатаПозиции, ФабрикаСервиса, Отбор)
	
	типЗапросУниверсальныхДанных = ФабрикаСервиса.Тип(ПроцедурыФункцииОбмена_МО_ФО.ПолучитьПространствоИменСервиса(), "ЗапросУниверсальныхДанных");
	обХДТОЗапрос = ФабрикаСервиса.Создать(типЗапросУниверсальныхДанных);
	
	типЗаголовок = ФабрикаСервиса.Тип(ПроцедурыФункцииОбмена_МО_ФО.ПолучитьПространствоИменСервиса(), "Заголовок");
	обХДТОЗапрос.Заголовок = ФабрикаСервиса.Создать(типЗаголовок);
	обХДТОЗапрос.Заголовок.УникальныйИдентификатор = "777";
	обХДТОЗапрос.Заголовок.ДатаВыполнения = ТекущаяДатаСеанса();
	обХДТОЗапрос.Заголовок.ИдентификаторСистемы = "МО";
	обХДТОЗапрос.Заголовок.ИмяПользователя = "сп";
	
	типПараметры = обХДТОЗапрос.Тип().Свойства.Получить("Параметры").Тип;
	
	//параметрыЗапроса
	обХДТОПараметры = ФабрикаСервиса.Создать(типПараметры);
	обХДТОПараметры.Ключ = "ДатаПериода";
	типЗначения = обХДТОПараметры.Тип().Свойства.Получить("Значения").Тип;
	
	обХДТОЗначения = ФабрикаСервиса.Создать(типЗначения);
	
	обХДТОЗначения.Значение = ДатаПозиции;
	обХДТОПараметры.Значения.Добавить(обХДТОЗначения);
	
	обХДТОЗапрос.Параметры.Добавить(обХДТОПараметры);
	
	Если Отбор.МассивКодМандат.Количество() > 0 Тогда
		
		обХДТОПараметры = ФабрикаСервиса.Создать(типПараметры);
		обХДТОПараметры.Ключ = "ОтборПоПортфелю";
		типЗначения = обХДТОПараметры.Тип().Свойства.Получить("Значения").Тип;
		
		обХДТОЗначения = ФабрикаСервиса.Создать(типЗначения);
		
		обХДТОЗначения.Значение = Истина;
		обХДТОПараметры.Значения.Добавить(обХДТОЗначения);
		
		обХДТОЗапрос.Параметры.Добавить(обХДТОПараметры);
		
		//СписокКодовМандатов
		обХДТОПараметры = ФабрикаСервиса.Создать(типПараметры);
		обХДТОПараметры.Ключ = "СписокВнешнихКодов";
		типЗначения = обХДТОПараметры.Тип().Свойства.Получить("Значения").Тип;
		
		Для каждого КодМандат Из Отбор.МассивКодМандат Цикл
			
			обХДТОЗначения = ФабрикаСервиса.Создать(типЗначения);
			
			обХДТОЗначения.Значение = КодМандат;
			обХДТОПараметры.Значения.Добавить(обХДТОЗначения);
		КонецЦикла;
		
		обХДТОЗапрос.Параметры.Добавить(обХДТОПараметры);
	КонецЕсли;
	
	Возврат обХДТОЗапрос;
	
КонецФункции //хдтоСоздатьПакетЗапросРЕПО()

Функция хдтоСоздатьПакетЗапросНайтиРЕПО(НомерСделки, ВнешнийКодПортфеля, ФабрикаСервиса)
	
	типЗапросУниверсальныхДанных = ФабрикаСервиса.Тип(ПроцедурыФункцииОбмена_МО_ФО.ПолучитьПространствоИменСервиса(), "ЗапросУниверсальныхДанных");
	обХДТОЗапрос = ФабрикаСервиса.Создать(типЗапросУниверсальныхДанных);
	
	типЗаголовок = ФабрикаСервиса.Тип(ПроцедурыФункцииОбмена_МО_ФО.ПолучитьПространствоИменСервиса(), "Заголовок");
	обХДТОЗапрос.Заголовок = ФабрикаСервиса.Создать(типЗаголовок);
	обХДТОЗапрос.Заголовок.УникальныйИдентификатор = "777";
	обХДТОЗапрос.Заголовок.ДатаВыполнения = ТекущаяДатаСеанса();
	обХДТОЗапрос.Заголовок.ИдентификаторСистемы = "МО";
	обХДТОЗапрос.Заголовок.ИмяПользователя = "сп";
	
	типПараметры = обХДТОЗапрос.Тип().Свойства.Получить("Параметры").Тип;
	
	//параметрыЗапроса
	обХДТОПараметры = ФабрикаСервиса.Создать(типПараметры);
	обХДТОПараметры.Ключ = "ВнешнийКод";
	типЗначения = обХДТОПараметры.Тип().Свойства.Получить("Значения").Тип;
	
	обХДТОЗначения = ФабрикаСервиса.Создать(типЗначения);
		
	обХДТОЗначения.Значение = ВнешнийКодПортфеля;
	обХДТОПараметры.Значения.Добавить(обХДТОЗначения);
	
	обХДТОЗапрос.Параметры.Добавить(обХДТОПараметры);
	
	обХДТОПараметры = ФабрикаСервиса.Создать(типПараметры);
	обХДТОПараметры.Ключ = "НомерСделки";
	типЗначения = обХДТОПараметры.Тип().Свойства.Получить("Значения").Тип;
	
	обХДТОЗначения = ФабрикаСервиса.Создать(типЗначения);
		
	обХДТОЗначения.Значение = НомерСделки;
	обХДТОПараметры.Значения.Добавить(обХДТОЗначения);
	
	обХДТОЗапрос.Параметры.Добавить(обХДТОПараметры);
    
	Возврат обХДТОЗапрос;
	
КонецФункции //хдтоСоздатьПакетЗапросРЕПО()

Функция ОбработатьОтветФактПозицииIntraDay(ОтветXDTO, ФабрикаСервиса, вклОтладка = Ложь)

	ТЗ_ФО = Новый ТаблицаЗначений;  
	ТЗ_ФО.Колонки.Добавить("Регистратор");
	ТЗ_ФО.Колонки.Добавить("СделкаРЕПОНомер");
	ТЗ_ФО.Колонки.Добавить("СделкаРЕПОИдентификатор");
	ТЗ_ФО.Колонки.Добавить("НомерСтроки");
	ТЗ_ФО.Колонки.Добавить("Портфель");
	ТЗ_ФО.Колонки.Добавить("ПортфельВнешнийКод");
	ТЗ_ФО.Колонки.Добавить("МестоХраненияВнешнийКод");
	ТЗ_ФО.Колонки.Добавить("Актив");
	ТЗ_ФО.Колонки.Добавить("АктивISIN");
	ТЗ_ФО.Колонки.Добавить("СубпортфельВнешнийКод");
	ТЗ_ФО.Колонки.Добавить("Количество");
	ТЗ_ФО.Колонки.Добавить("Стоимость");
	
	Результат = Новый Структура("ЕстьОшибки, ТекстОшибки, ТЗ_ФО", Ложь, "", ТЗ_ФО);
	
	Если ОтветXDTO.СтатусОтвета.Код <> 0 тогда
		Результат.ТекстОшибки = "Внутренняя ошибка сервиса: "+ ОтветXDTO.СтатусОтвета.Описание;
		Результат.ЕстьОшибки = Истина;
	КонецЕсли;
	
	Для Каждого хдтоОтвеСообщение Из ОтветXDTO.СтатусОтвета.Сообщения Цикл
		Результат.ТекстОшибки = Результат.ТекстОшибки + Символы.ПС + "СтатусОтвета.Сообщения: "+ ?(хдтоОтвеСообщение.ЭтоОшибка, "err", "inf") + " [" + хдтоОтвеСообщение.Код + "] " + хдтоОтвеСообщение.Описание;
	КонецЦикла;
	
	Для каждого ТекСтрока Из ОтветXDTO.Строка Цикл
		
		НоваяСтрока = ТЗ_ФО.Добавить();
		
		Для Каждого ТекПоказатель Из ТекСтрока.Показатель Цикл
			НоваяСтрока[ТекПоказатель.Имя] = ТекПоказатель.Значение;
		КонецЦикла;
		
	КонецЦикла;
	
	Результат.ТЗ_ФО = ТЗ_ФО;
	
	Если вклОтладка Тогда
		обЗапись = новый ЗаписьXML;
		обЗапись.УстановитьСтроку("UTF-8");
		ФабрикаСервиса.ЗаписатьXML(обЗапись, ОтветXDTO);
		Результат.Вставить("ТекстОтвета", обЗапись.Закрыть());
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ОбработатьОтветФактПозицииIntraDay()

Функция ОбработатьОтветРЕПО(ОтветXDTO, ФабрикаСервиса, вклОтладка = Ложь, ДатаПубликации)

	ТЗ_ФО = Новый ТаблицаЗначений;  
	ТЗ_ФО.Колонки.Добавить("Актив");
	ТЗ_ФО.Колонки.Добавить("Валюта");
	ТЗ_ФО.Колонки.Добавить("СделкаСЦК");
	ТЗ_ФО.Колонки.Добавить("НомерСделки");
	ТЗ_ФО.Колонки.Добавить("Направление");
	ТЗ_ФО.Колонки.Добавить("Портфель");
	ТЗ_ФО.Колонки.Добавить("Субпортфель"); 
	ТЗ_ФО.Колонки.Добавить("СубпортфельЦБ");
	ТЗ_ФО.Колонки.Добавить("МестоХранения");
	ТЗ_ФО.Колонки.Добавить("МестоХраненияЦБ");
	ТЗ_ФО.Колонки.Добавить("Количество");
	ТЗ_ФО.Колонки.Добавить("СуммаРЕПО");
	ТЗ_ФО.Колонки.Добавить("СуммаРЕПОРубли");
	ТЗ_ФО.Колонки.Добавить("СделкаРЕПО");
	ТЗ_ФО.Колонки.Добавить("ИсполнениеСделкиРЕПОПоДеньгам");
	ТЗ_ФО.Колонки.Добавить("ИсполнениеСделкиРЕПОПоЦБ");
	ТЗ_ФО.Колонки.Добавить("ДеньРасчета");
	ТЗ_ФО.Колонки.Добавить("ДеньгиУчтеныМО");
	ТЗ_ФО.Колонки.Добавить("НетПоручения");
	
	Результат = Новый Структура("ЕстьОшибки, ТекстОшибки, ТЗ_ФО", Ложь, "", ТЗ_ФО);
	
	Если ОтветXDTO.СтатусОтвета.Код <> 0 тогда
		Результат.ТекстОшибки = "Внутренняя ошибка сервиса: "+ ОтветXDTO.СтатусОтвета.Описание;
		Результат.ЕстьОшибки = Истина;
	КонецЕсли;
	
	Для Каждого хдтоОтвеСообщение Из ОтветXDTO.СтатусОтвета.Сообщения Цикл
		Результат.ТекстОшибки = Результат.ТекстОшибки + Символы.ПС + "СтатусОтвета.Сообщения: "+ ?(хдтоОтвеСообщение.ЭтоОшибка, "err", "inf") + " [" + хдтоОтвеСообщение.Код + "] " + хдтоОтвеСообщение.Описание;
	КонецЦикла;
	
	Для каждого ТекСтрока Из ОтветXDTO.Строка Цикл
		
		НоваяСтрока = ТЗ_ФО.Добавить();
		СуммаВторойЧастиРЕПО = 0;
		СуммаПервойЧастиРЕПО = 0;
		
		МестоХраненияВнешнийКод = "";
		МестоХраненияЦБВнешнийКод = "";
		Для Каждого ТекПоказатель Из ТекСтрока.Показатель Цикл
			Если ТекПоказатель.Имя="АктивВнешнийКод" Тогда
				НоваяСтрока.Актив = ПолучитьАктив(ТекПоказатель.Значение);
			ИначеЕсли ТекПоказатель.Имя="ВалютаРасчетовКод" Тогда
				НоваяСтрока.Валюта = ПолучитьВалюта(ТекПоказатель.Значение);
			ИначеЕсли ТекПоказатель.Имя="СделкаСЦК" Тогда
				НоваяСтрока.СделкаСЦК = ?(ТекПоказатель.Значение="false", Ложь, Истина);
			ИначеЕсли ТекПоказатель.Имя="ПортфельВнешнийКод" Тогда
				НоваяСтрока.Портфель = ПолучитьМандат(ТекПоказатель.Значение);
			ИначеЕсли ТекПоказатель.Имя="МестоХраненияВнешнийКод" Тогда 
				МестоХраненияВнешнийКод = ТекПоказатель.Значение;
			ИначеЕсли ТекПоказатель.Имя="ВидМестаХранения" Тогда 
				НоваяСтрока.МестоХранения = МХПоКоду(МестоХраненияВнешнийКод, ТекПоказатель.Значение);
			ИначеЕсли ТекПоказатель.Имя="МестоХраненияЦБВнешнийКод" Тогда 
				МестоХраненияЦБВнешнийКод = ТекПоказатель.Значение;
			ИначеЕсли ТекПоказатель.Имя="ВидМестаХраненияЦБ" Тогда 
				НоваяСтрока.МестоХраненияЦБ = МХПоКоду(МестоХраненияЦБВнешнийКод, ТекПоказатель.Значение);
			ИначеЕсли ТекПоказатель.Имя="СубпортфельВнешнийКод" Тогда
				НоваяСтрока.Субпортфель = ПолучитьСчетМандата(ТекПоказатель.Значение);
			ИначеЕсли ТекПоказатель.Имя="СубпортфельЦБВнешнийКод" Тогда
				НоваяСтрока.СубпортфельЦБ = ПолучитьСчетМандата(ТекПоказатель.Значение);
			ИначеЕсли ТекПоказатель.Имя="Количество" Тогда
				НоваяСтрока.Количество = ТекПоказатель.Значение;
			ИначеЕсли ТекПоказатель.Имя="Направление" Тогда
				НоваяСтрока.Направление = ТекПоказатель.Значение;
			ИначеЕсли ТекПоказатель.Имя="НомерСделки" Тогда
				НоваяСтрока.НомерСделки = СтрЗаменить(СтрЗаменить(ТекПоказатель.Значение, " ", ""), Символы.НПП, "");
			ИначеЕсли ТекПоказатель.Имя="СуммаПервойЧастиРЕПО" Тогда
				СуммаПервойЧастиРЕПО = Число(СтрЗаменить(СтрЗаменить(ТекПоказатель.Значение, " ", ""), Символы.НПП, ""));
			ИначеЕсли ТекПоказатель.Имя="СуммаВторойЧастиРЕПО" Тогда
				СуммаВторойЧастиРЕПО = Число(СтрЗаменить(СтрЗаменить(ТекПоказатель.Значение, " ", ""), Символы.НПП, ""));
			ИначеЕсли ТекПоказатель.Имя="ДеньРасчета" Тогда
				НоваяСтрока.ДеньРасчета = ?(ТекПоказатель.Значение="true", Истина, Ложь);
			ИначеЕсли ТекПоказатель.Имя="НетПоручения" Тогда
				НоваяСтрока.НетПоручения = ?(ТекПоказатель.Значение="true", Истина, Ложь);
			КонецЕсли;
			
		КонецЦикла;
		
		НоваяСтрока.СуммаРЕПО = ?(НоваяСтрока.ДеньРасчета, СуммаВторойЧастиРЕПО, СуммаПервойЧастиРЕПО);
		
	КонецЦикла;
	
	ВалютаРубли = Справочники.Валюты.RUB;
	
	Для каждого СтрокаТЗ_ФО Из ТЗ_ФО Цикл
		
		ИсполнениеСделкиРЕПОПоДеньгам = Ложь;
		ИсполнениеСделкиРЕПОПоЦБ = Ложь;  
		СделкаЗакрыта = Ложь; 
		СтрокаТЗ_ФО.ДеньгиУчтеныМО = Ложь;
		СтрокаТЗ_ФО.СделкаРЕПО = ПолучитьСделкаРЕПОПоНомеру(СтрокаТЗ_ФО.НомерСделки, ИсполнениеСделкиРЕПОПоДеньгам, ИсполнениеСделкиРЕПОПоЦБ, СделкаЗакрыта, ДатаПубликации);
		СтрокаТЗ_ФО.ИсполнениеСделкиРЕПОПоДеньгам = ИсполнениеСделкиРЕПОПоДеньгам;
		СтрокаТЗ_ФО.ИсполнениеСделкиРЕПОПоЦБ = ИсполнениеСделкиРЕПОПоЦБ;
		ДатаПлатежаПо1Части = СтрокаТЗ_ФО.СделкаРЕПО.ПлановаяДатаПлатежаПо1Части;
		СтрокаТЗ_ФО.СуммаРЕПОРубли = ?(СтрокаТЗ_ФО.СделкаРЕПО.Валюта=ВалютаРубли, СтрокаТЗ_ФО.СуммаРЕПО, РаботаСКурсамиВалют.ПересчитатьВВалюту(СтрокаТЗ_ФО.СуммаРЕПО, СтрокаТЗ_ФО.СделкаРЕПО.Валюта, ВалютаРубли, ДатаПлатежаПо1Части));
		
		Если СтрокаТЗ_ФО.ДеньРасчета Тогда
			//Если НЕ СделкаЗакрыта Тогда
				СтрокаТЗ_ФО.СуммаРЕПО = -СтрокаТЗ_ФО.СуммаРЕПО;
				СтрокаТЗ_ФО.СуммаРЕПОРубли = -СтрокаТЗ_ФО.СуммаРЕПОРубли;
			//КонецЕсли;
		ИначеЕсли СтрокаТЗ_ФО.СделкаРЕПО<>Документы.СделкаРЕПО.ПустаяСсылка() Тогда
			//Если НЕ СделкаЗакрыта Тогда
				СтрокаТЗ_ФО.ДеньгиУчтеныМО = Истина;
			//КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	
	Результат.ТЗ_ФО = ТЗ_ФО;
	
	Если вклОтладка Тогда
		обЗапись = новый ЗаписьXML;
		обЗапись.УстановитьСтроку("UTF-8");
		ФабрикаСервиса.ЗаписатьXML(обЗапись, ОтветXDTO);
		Результат.Вставить("ТекстОтвета", обЗапись.Закрыть());
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ОбработатьОтветРЕПО()

Функция ОбработатьОтветПоискРЕПО(ОтветXDTO, ФабрикаСервиса, вклОтладка = Ложь)

	Результат = Новый Структура("ЕстьОшибки, ТекстОшибки, НайденСделка", Ложь, "", Ложь);
	
	Если ОтветXDTO.СтатусОтвета.Код <> 0 тогда
		Результат.ТекстОшибки = "Внутренняя ошибка сервиса: "+ ОтветXDTO.СтатусОтвета.Описание;
		Результат.ЕстьОшибки = Истина;
	КонецЕсли;
	
	Для Каждого хдтоОтвеСообщение Из ОтветXDTO.СтатусОтвета.Сообщения Цикл
		Результат.ТекстОшибки = Результат.ТекстОшибки + Символы.ПС + "СтатусОтвета.Сообщения: "+ ?(хдтоОтвеСообщение.ЭтоОшибка, "err", "inf") + " [" + хдтоОтвеСообщение.Код + "] " + хдтоОтвеСообщение.Описание;
	КонецЦикла;
	
	Для каждого ТекСтрока Из ОтветXDTO.Строка Цикл
		Для Каждого ТекПоказатель Из ТекСтрока.Показатель Цикл
			Результат.НайденСделка = Не ПустаяСтрока(ТекПоказатель.Значение);
		КонецЦикла;
	КонецЦикла;
	
	Если вклОтладка Тогда
		обЗапись = новый ЗаписьXML;
		обЗапись.УстановитьСтроку("UTF-8");
		ФабрикаСервиса.ЗаписатьXML(обЗапись, ОтветXDTO);
		Результат.Вставить("ТекстОтвета", обЗапись.Закрыть());
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ОбработатьОтветПоискРЕПО()

Функция МХПоКоду(ВнешнийКод, ВидМХ)
                         
	Если ВидМХ="Брокерские счета" Тогда
		ВидМХСпр = "БрокерскиеСчета";
	ИначеЕсли ВидМХ="Банковские счета" Тогда
		ВидМХСпр = "БанковскиеСчета";
	Иначе
		Возврат ПланыВидовХарактеристик.ВидыСчетаМандата.ПустаяСсылка();	
	КонецЕсли;                         
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МХ.Ссылка КАК МестоХранения
		|ИЗ
		|	Справочник."+ВидМХСпр+" КАК МХ
		|ГДЕ
		|	МХ.КодМестаХранения = &КодМестаХранения";
	
	Запрос.УстановитьПараметр("КодМестаХранения", ВнешнийКод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.МестоХранения;
	КонецЕсли;
	
	Возврат ПланыВидовХарактеристик.ВидыСчетаМандата.ПустаяСсылка();

КонецФункции // МХПоКоду(МестоХраненияВнешнийКод, ТекПоказатель.Значение)()


// Возвращает текст запроса для функции "ДенежныеСредстваРЕПОНаДату"
//
Функция ПолучитьТекстЗапросаРЕПОДенежныеСредстваНаДату()

	Возврат
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЦенныеБумагиПолученныеПоРЕПООстатки.Актив ЕСТЬ NULL
	|			ТОГДА ДенежныеСредстваОтданныеВРЕПООстатки.Актив
	|		ИНАЧЕ ЦенныеБумагиПолученныеПоРЕПООстатки.Актив
	|	КОНЕЦ КАК Актив,
	|	ДенежныеСредстваОтданныеВРЕПООстатки.Валюта КАК Валюта,
	|	ДенежныеСредстваОтданныеВРЕПООстатки.Мандат КАК Портфель,
	|	ДенежныеСредстваОтданныеВРЕПООстатки.СделкаРЕПО.НомерСделки КАК НомерСделки,
	|	ДенежныеСредстваОтданныеВРЕПООстатки.СчетМандата КАК Субпортфель,
	|	ДенежныеСредстваОтданныеВРЕПООстатки.СчетМандата.МестоХранения КАК МестоХранения,
	|	ЦенныеБумагиПолученныеПоРЕПООстатки.СчетМандата КАК СубпортфельЦБ,
	|	ЦенныеБумагиПолученныеПоРЕПООстатки.СчетМандата.МестоХранения КАК МестоХраненияЦБ,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваОтданныеВРЕПООстатки.СуммаОстаток < 0
	|			ТОГДА -ДенежныеСредстваОтданныеВРЕПООстатки.СуммаОстаток
	|		ИНАЧЕ ДенежныеСредстваОтданныеВРЕПООстатки.СуммаОстаток
	|	КОНЕЦ КАК СуммаРЕПО,
	|	ИСТИНА КАК СделкаСЦК,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваОтданныеВРЕПООстатки.СделкаРЕПО.ВидРЕПО = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделкаРЕПО.ОбратныйРЕПО)
	|			ТОГДА ""Покупка""
	|		ИНАЧЕ ""Продажа""
	|	КОНЕЦ КАК Направление,
	|	ВЫБОР
	|		КОГДА ЦенныеБумагиПолученныеПоРЕПООстатки.СделкаРЕПО ЕСТЬ NULL
	|			ТОГДА ДенежныеСредстваОтданныеВРЕПООстатки.СделкаРЕПО
	|		ИНАЧЕ ЦенныеБумагиПолученныеПоРЕПООстатки.СделкаРЕПО
	|	КОНЕЦ КАК СделкаРЕПО,
	|	ЛОЖЬ КАК ИсполнениеСделкиРЕПОПоДеньгам,
	|	ЛОЖЬ КАК ИсполнениеСделкиРЕПОПоЦБ
	|ПОМЕСТИТЬ втРЕПО
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваОтданныеВРЕПО.Остатки(&ДатаОкончанияПериода, &Условие) КАК ДенежныеСредстваОтданныеВРЕПООстатки
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ЦенныеБумагиПолученныеПоРЕПО.Остатки(&ДатаОкончанияПериода, &Условие) КАК ЦенныеБумагиПолученныеПоРЕПООстатки
	|		ПО ДенежныеСредстваОтданныеВРЕПООстатки.СделкаРЕПО = ЦенныеБумагиПолученныеПоРЕПООстатки.СделкаРЕПО
	|ГДЕ
	|	ДенежныеСредстваОтданныеВРЕПООстатки.СделкаРЕПО <> ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЦенныеБумагиОтданныеВРЕПООстатки.Актив ЕСТЬ NULL
	|			ТОГДА ДенежныеСредстваПолученныеПоРЕПООстатки.Актив
	|		ИНАЧЕ ЦенныеБумагиОтданныеВРЕПООстатки.Актив
	|	КОНЕЦ,
	|	ДенежныеСредстваПолученныеПоРЕПООстатки.Валюта,
	|	ДенежныеСредстваПолученныеПоРЕПООстатки.Мандат,
	|	ДенежныеСредстваПолученныеПоРЕПООстатки.СделкаРЕПО.НомерСделки,
	|	ДенежныеСредстваПолученныеПоРЕПООстатки.СчетМандата,
	|	ДенежныеСредстваПолученныеПоРЕПООстатки.СчетМандата.МестоХранения,
	|	ЦенныеБумагиОтданныеВРЕПООстатки.СчетМандата,
	|	ЦенныеБумагиОтданныеВРЕПООстатки.СчетМандата.МестоХранения,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваПолученныеПоРЕПООстатки.СуммаОстаток < 0
	|			ТОГДА -ДенежныеСредстваПолученныеПоРЕПООстатки.СуммаОстаток
	|		ИНАЧЕ ДенежныеСредстваПолученныеПоРЕПООстатки.СуммаОстаток
	|	КОНЕЦ,
	|	ИСТИНА,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваПолученныеПоРЕПООстатки.СделкаРЕПО.ВидРЕПО = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделкаРЕПО.ОбратныйРЕПО)
	|			ТОГДА ""Покупка""
	|		ИНАЧЕ ""Продажа""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЦенныеБумагиОтданныеВРЕПООстатки.СделкаРЕПО ЕСТЬ NULL
	|			ТОГДА ДенежныеСредстваПолученныеПоРЕПООстатки.СделкаРЕПО
	|		ИНАЧЕ ЦенныеБумагиОтданныеВРЕПООстатки.СделкаРЕПО
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваПолученныеПоРЕПО.Остатки(&ДатаОкончанияПериода, &Условие) КАК ДенежныеСредстваПолученныеПоРЕПООстатки
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ЦенныеБумагиОтданныеВРЕПО.Остатки(&ДатаОкончанияПериода, &Условие) КАК ЦенныеБумагиОтданныеВРЕПООстатки
	|		ПО ДенежныеСредстваПолученныеПоРЕПООстатки.СделкаРЕПО = ЦенныеБумагиОтданныеВРЕПООстатки.СделкаРЕПО
	|ГДЕ
	|	ДенежныеСредстваПолученныеПоРЕПООстатки.СделкаРЕПО <> ЗНАЧЕНИЕ(Документ.СделкаРЕПО.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРЕПО.Актив,
	|	втРЕПО.Валюта,
	|	втРЕПО.Портфель,
	|	втРЕПО.НомерСделки,
	|	втРЕПО.Субпортфель,
	|	втРЕПО.МестоХранения,
	|	втРЕПО.СубпортфельЦБ,
	|	втРЕПО.МестоХраненияЦБ,
	|	втРЕПО.СуммаРЕПО,
	|	втРЕПО.СделкаСЦК,
	|	втРЕПО.Направление,
	|	втРЕПО.СделкаРЕПО,
	|	втРЕПО.ИсполнениеСделкиРЕПОПоДеньгам,
	|	втРЕПО.ИсполнениеСделкиРЕПОПоЦБ
	|ИЗ
	|	втРЕПО КАК втРЕПО
	|
	|СГРУППИРОВАТЬ ПО
	|	втРЕПО.Актив,
	|	втРЕПО.Валюта,
	|	втРЕПО.Портфель,
	|	втРЕПО.НомерСделки,
	|	втРЕПО.Субпортфель,
	|	втРЕПО.МестоХранения,
	|	втРЕПО.СубпортфельЦБ,
	|	втРЕПО.МестоХраненияЦБ,
	|	втРЕПО.СуммаРЕПО,
	|	втРЕПО.СделкаСЦК,
	|	втРЕПО.Направление,
	|	втРЕПО.СделкаРЕПО,
	|	втРЕПО.ИсполнениеСделкиРЕПОПоДеньгам,
	|	втРЕПО.ИсполнениеСделкиРЕПОПоЦБ
	|
	|ИМЕЮЩИЕ
	|	СУММА(втРЕПО.СуммаРЕПО) <> 0";

КонецФункции // ПолучитьТекстЗапросаРЕПОДенежныеСредстваНаДату()


// Возвращает данные по ценным бумагам на дату находящиеся в РЕПО 
//
// Параметры:
//  Дата  - Дата - Дата, на которую будут получены данные
//  Отбор - Структура - структура отбора данных, содержащая одно из полей:
//						[Мандаты] - Массив - Массив ссылок Справочник.Мандаты
//                      [СчетаМандатов] - Массив ссылок Справочник.СчетаМандатов
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Таблица данных по денежным средствам на дату
//
Функция РЕПОЦенныеБумагиНаДату(Дата, Отбор) Экспорт

	Условие = "";
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли; 
	
	Запрос = Новый Запрос(ПолучитьТекстЗапросаРЕПОЦенныеБумагиНаДату());
	Запрос.УстановитьПараметр("Дата", Дата); // Параметр нужен для отображения в логе
	//Запрос.УстановитьПараметр("ДатаНачалаПериода", Новый Граница(НачалоДня(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Если Отбор.Свойство("Мандаты") Тогда
			Условие = "Мандат В (&Мандаты)";
			Запрос.УстановитьПараметр("Мандаты", Отбор.Мандаты);
		КонецЕсли; 
		Если Отбор.Свойство("СчетаМандатов") Тогда
			Условие = Условие + ?(ПустаяСтрока(Условие), "", " И ");
			Условие = "СчетМандата В (&СчетаМандатов)";
			Запрос.УстановитьПараметр("СчетаМандатов", Отбор.СчетаМандатов);
		КонецЕсли; 
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", Условие);
	
	ОбщегоНазначенияМО.ДобавитьВЛогОтладки(Запрос, "Регистр ""Ценные бумаги, отданные/полученные по РЕПО"": Денежные средства на дату");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции // РЕПОЦенныеБумагиНаДату()

// Возвращает текст запроса для функции "ЦенныеБумагиРЕПОНаДату"
//
Функция ПолучитьТекстЗапросаРЕПОЦенныеБумагиНаДату()

	Возврат
	"ВЫБРАТЬ
	|	ЦенныеБумагиОтданныеВРЕПО.СчетМандата КАК СчетМандата,
	|	ЦенныеБумагиОтданныеВРЕПО.Актив КАК Актив,
	|	0 КАК ВходящийОстаток,
	|	0 КАК ДневнойОборот,
	|	ВЫРАЗИТЬ(ЦенныеБумагиОтданныеВРЕПО.Актив.Объект КАК Справочник.Облигации).ВалютаНоминальнойСтоимости КАК ВалютаНоминальнойСтоимости,
	|	ЦенныеБумагиОтданныеВРЕПО.Мандат КАК Мандат,
	|	0 КАК НКД,
	|	ЦенныеБумагиОтданныеВРЕПО.КоличествоОстаток КАК РЕПО
	|ПОМЕСТИТЬ втРЕПОЦБ
	|ИЗ
	|	РегистрНакопления.ЦенныеБумагиОтданныеВРЕПО.Остатки(&ДатаОкончанияПериода, &Условие) КАК ЦенныеБумагиОтданныеВРЕПО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦенныеБумагиПолученныеПоРЕПО.СчетМандата,
	|	ЦенныеБумагиПолученныеПоРЕПО.Актив,
	|	0,
	|	0,
	|	ВЫРАЗИТЬ(ЦенныеБумагиПолученныеПоРЕПО.Актив.Объект КАК Справочник.Облигации).ВалютаНоминальнойСтоимости,
	|	ЦенныеБумагиПолученныеПоРЕПО.Мандат,
	|	0,
	|	ЦенныеБумагиПолученныеПоРЕПО.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЦенныеБумагиПолученныеПоРЕПО.Остатки(&ДатаОкончанияПериода, &Условие) КАК ЦенныеБумагиПолученныеПоРЕПО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРЕПО.Мандат КАК Мандат,
	|	втРЕПО.СчетМандата КАК СчетМандата,
	|	втРЕПО.Актив КАК Актив,
	|	втРЕПО.ВалютаНоминальнойСтоимости КАК ВалютаНоминальнойСтоимости,
	|	СУММА(втРЕПО.ВходящийОстаток) КАК ВходящийОстаток,
	|	СУММА(втРЕПО.ДневнойОборот) КАК ДневнойОборот,
	|	СУММА(втРЕПО.НКД) КАК НКД,
	|	СУММА(втРЕПО.РЕПО) КАК РЕПО
	|ИЗ
	|	втРЕПОЦБ КАК втРЕПО
	|
	|СГРУППИРОВАТЬ ПО
	|	втРЕПО.Мандат,
	|	втРЕПО.СчетМандата,
	|	втРЕПО.Актив,
	|	втРЕПО.ВалютаНоминальнойСтоимости
	|
	|ИМЕЮЩИЕ
	|	СУММА(втРЕПО.РЕПО) <> 0";

КонецФункции // ПолучитьТекстЗапросаРЕПОЦенныеБумагиНаДату()


// ДСПлюсРЕПО 
Функция ДСПлюсРЕПО(ДС, РЕПО) Экспорт

	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДС", ДС);
	Запрос.УстановитьПараметр("РЕПО", РЕПО);
	
	Запрос.Текст = "
				   |ВЫБРАТЬ
				   |	ДС.Мандат КАК Мандат,
				   |	ДС.СчетМандата КАК СчетМандата,
				   |	ДС.Валюта КАК Валюта,
				   |	ДС.ВходящийОстаток КАК ВходящийОстаток,
				   |	ДС.ДневнойОборот КАК ДневнойОборот,
				   |	0 КАК РЕПО
				   |ПОМЕСТИТЬ втДС
				   |ИЗ
				   |	&ДС КАК ДС
				   |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Р.Мандат КАК Мандат,
	               |	Р.СчетМандата КАК СчетМандата,
	               |	Р.Валюта КАК Валюта,
	               |	Р.ВходящийОстаток КАК ВходящийОстаток,
	               |	Р.ДневнойОборот КАК ДневнойОборот,
	               |	Р.РЕПО КАК РЕПО
	               |ПОМЕСТИТЬ втРЕПО
	               |ИЗ
	               |	&РЕПО КАК Р
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	втДС.Мандат,
				   |	втДС.СчетМандата,
				   |	втДС.Валюта,
				   |	втДС.ВходящийОстаток,
				   |	втДС.ДневнойОборот,
				   |	втДС.РЕПО
				   |ПОМЕСТИТЬ втДСРЕПО
				   |ИЗ
				   |	втДС КАК втДС
				   |
				   |ОБЪЕДИНИТЬ ВСЕ
				   |
	               |ВЫБРАТЬ
	               |	втРЕПО.Мандат,
	               |	втРЕПО.СчетМандата,
	               |	втРЕПО.Валюта,
	               |	втРЕПО.ВходящийОстаток,
	               |	втРЕПО.ДневнойОборот,
	               |	втРЕПО.РЕПО
				   |  
	               |ИЗ
	               |	втРЕПО КАК втРЕПО
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДСРЕПО.Мандат,
	               |	втДСРЕПО.СчетМандата,
	               |	втДСРЕПО.Валюта,
	               |	СУММА(втДСРЕПО.ВходящийОстаток) КАК ВходящийОстаток,
	               |	СУММА(втДСРЕПО.ДневнойОборот) КАК ДневнойОборот,
	               |	СУММА(втДСРЕПО.РЕПО) КАК РЕПО
	               |ИЗ
	               |	втДСРЕПО КАК втДСРЕПО
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втДСРЕПО.Мандат,
	               |	втДСРЕПО.СчетМандата,
	               |	втДСРЕПО.Валюта";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции // ДСПлюсРЕПО()

// ЦБПлюсРЕПО 
Функция ЦБПлюсРЕПО(ЦБ, РЕПОЦБ) Экспорт

	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ЦБ", ЦБ);
	Запрос.УстановитьПараметр("РЕПО", РЕПОЦБ);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦБ.СчетМандата КАК СчетМандата,
	               |	ЦБ.Актив КАК Актив,
	               |	ЦБ.ВходящийОстаток КАК ВходящийОстаток,
	               |	ЦБ.ДневнойОборот КАК ДневнойОборот,
	               |	ЦБ.ВалютаНоминальнойСтоимости КАК ВалютаНоминальнойСтоимости,
	               |	ЦБ.Мандат КАК Мандат,
	               |	ЦБ.НКД КАК НКД,
	               |	0 КАК РЕПО
	               |ПОМЕСТИТЬ втЦБ
	               |ИЗ
	               |	&ЦБ КАК ЦБ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Р.СчетМандата КАК СчетМандата,
	               |	Р.Актив КАК Актив,
	               |	Р.ВходящийОстаток КАК ВходящийОстаток,
	               |	Р.ДневнойОборот КАК ДневнойОборот,
	               |	Р.ВалютаНоминальнойСтоимости КАК ВалютаНоминальнойСтоимости,
	               |	Р.Мандат КАК Мандат,
	               |	Р.НКД КАК НКД,
	               |	Р.РЕПО КАК РЕПО
	               |ПОМЕСТИТЬ втРЕПО
	               |ИЗ
	               |	&РЕПО КАК Р
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втЦБ.СчетМандата,
	               |	втЦБ.Актив,
	               |	втЦБ.ВходящийОстаток,
	               |	втЦБ.ДневнойОборот,
	               |	втЦБ.ВалютаНоминальнойСтоимости,
	               |	втЦБ.Мандат,
	               |	втЦБ.НКД,
	               |	втЦБ.РЕПО
	               |ПОМЕСТИТЬ втЦБРЕПО
	               |ИЗ
	               |	втЦБ КАК втЦБ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	втРЕПО.СчетМандата,
	               |	втРЕПО.Актив,
	               |	втРЕПО.ВходящийОстаток,
	               |	втРЕПО.ДневнойОборот,
	               |	втРЕПО.ВалютаНоминальнойСтоимости,
	               |	втРЕПО.Мандат,
	               |	втРЕПО.НКД,
	               |	втРЕПО.РЕПО
	               |ИЗ
	               |	втРЕПО КАК втРЕПО
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втЦБРЕПО.СчетМандата,
	               |	втЦБРЕПО.Актив,
	               |	СУММА(втЦБРЕПО.ВходящийОстаток) КАК ВходящийОстаток,
	               |	СУММА(втЦБРЕПО.ДневнойОборот) КАК ДневнойОборот,
	               |	втЦБРЕПО.ВалютаНоминальнойСтоимости,
	               |	втЦБРЕПО.Мандат,
	               |	СУММА(втЦБРЕПО.НКД) КАК НКД,
	               |	СУММА(втЦБРЕПО.РЕПО) КАК РЕПО
	               |ИЗ
	               |	втЦБРЕПО КАК втЦБРЕПО
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втЦБРЕПО.СчетМандата,
	               |	втЦБРЕПО.Актив,
	               |	втЦБРЕПО.ВалютаНоминальнойСтоимости,
	               |	втЦБРЕПО.Мандат";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции // ДСПлюсРЕПО()
//WS PositionSet 

//RKatunin IMDEV-3438
Функция хдтоСделкаПоиск(сс, ФабрикаСервиса) Экспорт
	
	хдтоОбъект = ФабрикаСервиса.Создать(ФабрикаСервиса.Тип(ПространствоИменСервиса, "СделкаПоиск"));
	хдтоОбъект.Идентификатор = СокрЛП(сс.НомерСделки);
	
	Возврат хдтоОбъект;
КонецФункции   //RKatunin IMDEV-3438

//RKatunin IMDEV-3438
Процедура хдтоДобавитьВПакетИсполнениеСделки(обПакет, Сделка, вхАктив, вхПортфель, вхСубпортфель, вхМХ, КолвоСуммаАктив, Проведен, ФабрикаСервиса)
	
	типХДТО	 = ФабрикаСервиса.Тип(ПространствоИменСервиса, "ИсполнениеПоСделке");
	обХДТО = ФабрикаСервиса.Создать(типХДТО);
	обХДТО.Проведен = Проведен;
	обХДТО.Сделка = хдтоСделкаПоиск(Сделка, ФабрикаСервиса);
	обХДТО.Актив = ПроцедурыФункцииОбмена_МО_ФО.хдтоАктивПозицияПоиск(вхАктив, ФабрикаСервиса);
	обХДТО.Портфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоПорфельПоиск(вхПортфель, ФабрикаСервиса);
	
	обХДТО.МестоХранения = ПроцедурыФункцииОбмена_МО_ФО.хдтоМестоХраненияПоиск(вхМХ, ФабрикаСервиса);
	обХДТО.Субпортфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоСубпортфельПоиск(вхСубпортфель, ФабрикаСервиса);
	                   
	Количество = КолвоСуммаАктив;
	Если Сделка.ВидОперации=Перечисления.ВидыОперацийСделка.Поступление И ТипЗнч(вхАктив)=Тип("СправочникСсылка.Валюты") Тогда	                                                                                                                          
	    Количество = -Число(Количество);
	ИначеЕсли Сделка.ВидОперации=Перечисления.ВидыОперацийСделка.Продажа И ТипЗнч(вхАктив)=Тип("СправочникСсылка.Активы") Тогда
		Количество = -Число(Количество);
	КонецЕсли;	                    
	                    
	обХДТО.Количество = Количество;
	
	обПакет.Документы.ИсполненияПоСделке.Добавить(обХДТО);
	
	Отказ = Ложь;
	тхтОшибки = "";
	
КонецПроцедуры //RKatunin IMDEV-3438

//RKatunin IMDEV-3438

Функция ЦенныеБумагиНаДату(Дата, Отбор = Неопределено) Экспорт
	
	Условие = "";
	УсловиеМандат = "";
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли; 
	
	Запрос = Новый Запрос(ПолучитьТекстЗапросаЦенныеБумагиНаДату());
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", НачалоДня(Дата));
	
	Условие = "";
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Если Отбор.Свойство("Мандаты") Тогда
			Условие = " И Мандат В (&Мандаты)";
			Запрос.УстановитьПараметр("Мандаты", Отбор.Мандаты);
		КонецЕсли; 
		Если Отбор.Свойство("СчетаМандатов") Тогда
			
			Условие = " И СчетМандата В (&СчетаМандатов)";
			Запрос.УстановитьПараметр("СчетаМандатов", Отбор.СчетаМандатов);
			
			Запрос.УстановитьПараметр("Мандаты", Отбор.ОтборМандаты);
			
		КонецЕсли;
	КонецЕсли;
	
	Если ОтборМандат Тогда
		ПроверитьУсловиеМандатыОтбор(Условие, Истина);
		Запрос.УстановитьПараметр("СписМандатОтбор", СписМандатОтбор);
	КонецЕсли;
	Запрос.УстановитьПараметр("Биржа",Справочники.Биржи.НайтиПоКоду("НРД_02"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", Условие);
	
	ОбщегоНазначенияМО.ДобавитьВЛогОтладки(Запрос, "Регистр ""Ценные бумаги"": Ценные бумаги на дату");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ДоходыКПолучениюНаДату()

Функция ДенежныеСредстваНаДату(Дата, Отбор = Неопределено) Экспорт
	
	Условие = "";
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНачалаПериода", Новый Граница(НачалоДня(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаВыгрузки", КонецДня(Дата));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Период КАК Период,
	|	т.Валюта КАК Валюта,
	|	т.ИсточникКурса КАК ИсточникКурса,
	|	т.Курс КАК Курс,
	|	т.Кратность КАК Кратность
	|ПОМЕСТИТЬ втКурсы
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОкончанияПериода, ) КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Мандат,
	|	т.СчетМандата КАК СчетМандата,
	|	т.Валюта КАК Валюта,
	|	т.СуммаОстаток КАК Количество,
	|	0 КАК Задолженость,
	|	ЛОЖЬ КАК ДоходыКПолучению
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(&ДатаНачалаПериода, Мандат <> ЗНАЧЕНИЕ(Справочник.Мандаты.НеОпределен) И (Мандат.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1) ИЛИ Мандат.ДатаОкончания > &ДатаВыгрузки) &УсловиеОтбора) КАК т
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Мандат,
	|	т.СчетМандата,
	|	т.Валюта,
	|	т.СуммаОстаток,
	|	0,
	|	ИСТИНА
	|ИЗ
	|	РегистрНакопления.ДоходыКПолучению.Остатки(&ДатаНачалаПериода, Мандат <> ЗНАЧЕНИЕ(Справочник.Мандаты.НеОпределен) И (Мандат.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1) ИЛИ Мандат.ДатаОкончания > &ДатаВыгрузки) &УсловиеОтбора) КАК т
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДвиженияДенежныхСредствВнутриДняОбороты.Мандат,
	|	ДвиженияДенежныхСредствВнутриДняОбороты.СчетМандата,
	|	ДвиженияДенежныхСредствВнутриДняОбороты.Валюта,
	|	ДвиженияДенежныхСредствВнутриДняОбороты.СуммаВыполненоОборот,
	|	0,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредствВнутриДня.Обороты(&ДатаНачалаПериода, &ДатаОкончанияПериода, , Мандат <> ЗНАЧЕНИЕ(Справочник.Мандаты.НеОпределен) И (Мандат.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1) ИЛИ Мандат.ДатаОкончания > &ДатаВыгрузки) &УсловиеОтбора) КАК ДвиженияДенежныхСредствВнутриДняОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОстатки.Мандат КАК Мандат,
	|	втОстатки.СчетМандата КАК СчетМандата,
	|	втОстатки.Валюта КАК Валюта,
	|	втОстатки.ДоходыКПолучению КАК ДоходыКПолучению,
	|	СУММА(втОстатки.Количество) КАК Количество,
	|	СУММА(втОстатки.Задолженость) КАК Задолженость
	|ПОМЕСТИТЬ втОстаткиОбщ
	|ИЗ
	|	втОстатки КАК втОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	втОстатки.Мандат,
	|	втОстатки.СчетМандата,
	|	втОстатки.Валюта,
	|	втОстатки.ДоходыКПолучению
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Мандат,
	|	Остатки.СчетМандата,
	|	Остатки.Валюта,
	|	Остатки.ДоходыКПолучению,
	|	СУММА(Остатки.Количество) КАК Количество,
	|	СУММА(Остатки.Количество * ЕСТЬNULL(втКурсы.Курс, 0) / ЕСТЬNULL(втКурсы.Кратность, 1)) КАК Стоимость,
	|	СУММА(Остатки.Задолженость * ЕСТЬNULL(втКурсы.Курс, 0) / ЕСТЬNULL(втКурсы.Кратность, 1)) КАК Задолженность
	|ИЗ
	|	втОстаткиОбщ КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсы КАК втКурсы
	|		ПО Остатки.Валюта = втКурсы.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Мандат,
	|	Остатки.СчетМандата,
	|	Остатки.ДоходыКПолучению,
	|	Остатки.Валюта";
	
	
	Условие = "";
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Если Отбор.Свойство("Мандаты") Тогда
			Условие = " И Мандат В (&Мандаты)";
			Запрос.УстановитьПараметр("Мандаты", Отбор.Мандаты);
		КонецЕсли; 
		Если Отбор.Свойство("СчетаМандатов") Тогда
			
			Условие = " И СчетМандата В (&СчетаМандатов)";
			Запрос.УстановитьПараметр("СчетаМандатов", Отбор.СчетаМандатов);
			
			Запрос.УстановитьПараметр("Мандаты", Отбор.ОтборМандаты);
			
		КонецЕсли;
	КонецЕсли;
	
	Если ОтборМандат Тогда
		ПроверитьУсловиеМандатыОтбор(Условие, Истина);
		Запрос.УстановитьПараметр("СписМандатОтбор", СписМандатОтбор);
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", Условие);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСоединения", " И " + Условие);
	
	ОбщегоНазначенияМО.ДобавитьВЛогОтладки(Запрос, "Регистр ""Денежные средства"": Денежные средства");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ДоходыКПолучениюНаДату()

Функция БлокировкиНаДату(Дата, Отбор = Неопределено) Экспорт

	Условие = "";
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли; 
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата2", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Мандат,
	|	т.СчетМандата,
	|	т.Валюта,
	|	т.Актив,
	|	СУММА(т.ВалютнаяСуммаОстаток) КАК Количество,
	|	СУММА(т.ВалютнаяСуммаОстаток) КАК Стоимость
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваЗаблокированные.Остатки(&Дата1, Мандат <> ЗНАЧЕНИЕ(Справочник.Мандаты.НеОпределен) И (Мандат.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1) ИЛИ Мандат.ДатаОкончания > &Дата1) &УсловиеОтбора) КАК т
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Валюта,
	|	т.Мандат,
	|	т.СчетМандата,
	|	т.Актив";  //
	
	Условие = "";
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Если Отбор.Свойство("Мандаты") Тогда
			Условие = " И Мандат В (&Мандаты)";
			Запрос.УстановитьПараметр("Мандаты", Отбор.Мандаты);
		КонецЕсли; 
		Если Отбор.Свойство("СчетаМандатов") Тогда
			
			Условие = " И СчетМандата В (&СчетаМандатов)";
			Запрос.УстановитьПараметр("СчетаМандатов", Отбор.СчетаМандатов);
			
			Запрос.УстановитьПараметр("Мандаты", Отбор.ОтборМандаты);
			
		КонецЕсли; 
	КонецЕсли;
	
	Если ОтборМандат Тогда
		ПроверитьУсловиеМандатыОтбор(Условие, Истина);
		Запрос.УстановитьПараметр("СписМандатОтбор", СписМандатОтбор);	
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", Условие);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСоединения", " И " + Условие);
	
	ОбщегоНазначенияМО.ДобавитьВЛогОтладки(Запрос, "Регистр ""Денежные средства"": Денежные средства");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ДоходыКПолучениюНаДату()

Функция СЧА_РСА_НаДату(Дата, Отбор = Неопределено) Экспорт

	Условие = "";
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли; 
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", НачалоДня(Дата));
	Запрос.УстановитьПараметр("СписокТиповПортфелейПИФ", СписокТиповПортфелейПИФ());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Мандат,
	|	МАКСИМУМ(т.Период) КАК Период
	|ПОМЕСТИТЬ втПериоды
	|ИЗ
	|	РегистрСведений.РыночнаяСтоимостьПозиции.СрезПоследних(&ДатаОкончанияПериода, (Мандат <> ЗНАЧЕНИЕ(Справочник.Мандаты.НеОпределен) И (Мандат.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1) ИЛИ Мандат.ДатаОкончания > &ДатаОкончанияПериода)) &УсловиеОтбора) КАК т
	|ГДЕ
	|	т.Период >= ДОБАВИТЬКДАТЕ(&ДатаОкончанияПериода, ДЕНЬ, -10)
	|	И НЕ т.Мандат.ТипМандата В (&СписокТиповПортфелейПИФ)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Мандат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПериоды.Мандат,
	|	втПериоды.Период,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(т.Регистратор.Кратность, 0) = 0
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(т.Сумма, 0) * ЕСТЬNULL(т.Регистратор.Курс, 0) / ЕСТЬNULL(т.Регистратор.Кратность, 0)
	|		КОНЕЦ) КАК РСА,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(т.Регистратор.Кратность, 0) = 0
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(т.Сумма, 0) * ЕСТЬNULL(т.Регистратор.Курс, 0) / ЕСТЬNULL(т.Регистратор.Кратность, 0)
	|		КОНЕЦ) КАК СЧА
	|ИЗ
	|	втПериоды КАК втПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РыночнаяСтоимостьПозиции.СрезПоследних(&ДатаОкончанияПериода, (Мандат <> ЗНАЧЕНИЕ(Справочник.Мандаты.НеОпределен) И (Мандат.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1) ИЛИ Мандат.ДатаОкончания > &ДатаОкончанияПериода)) &УсловиеОтбора) КАК т
	|		ПО втПериоды.Период = т.Период
	|			И втПериоды.Мандат = т.Мандат
	|
	|СГРУППИРОВАТЬ ПО
	|	втПериоды.Мандат,
	|	втПериоды.Период";
	
	
	Условие = "";
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Если Отбор.Свойство("Мандаты") Тогда
			Условие = " И Мандат В (&Мандаты)";
			Запрос.УстановитьПараметр("Мандаты", Отбор.Мандаты);
		КонецЕсли; 
		Если Отбор.Свойство("СчетаМандатов") Тогда
			
			Условие = " И СчетМандата В (&СчетаМандатов)";
			Запрос.УстановитьПараметр("СчетаМандатов", Отбор.СчетаМандатов);
			
			Запрос.УстановитьПараметр("Мандаты", Отбор.ОтборМандаты);
			
		КонецЕсли;
	КонецЕсли;
	
	Если ОтборМандат Тогда
		ПроверитьУсловиеМандатыОтбор(Условие, Истина);	
		Запрос.УстановитьПараметр("СписМандатОтбор", СписМандатОтбор);
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", Условие);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСоединения", " И " + Условие);
	
	ОбщегоНазначенияМО.ДобавитьВЛогОтладки(Запрос, "Регистр ""Денежные средства"": Денежные средства");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ДоходыКПолучениюНаДату()

Процедура СЧА_РСА_НаДату_ДополнитьПИФ(НаДату, тз, Отказ = Ложь, ТекстСообщений = "", Отбор)
	
	ствОтборПИФ = новый Соответствие;
	стрОтборПИФ = "";
	списМандаты = новый Массив;
	списСчета = новый Массив;
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Если Отбор.Свойство("Мандаты") Тогда
			СтрокаУсловие = "Мандат В (&Мандаты)";
			//ПроверитьУсловиеМандатыОтбор(СтрокаУсловие);
			списМандаты =  Отбор.Мандаты;
		КонецЕсли;
		
		Если Отбор.Свойство("СчетаМандатов") Тогда
			списСчета = Отбор.СчетаМандатов;
			списМандаты = новый Массив;
			
			Для каждого СчетМандата_ из Отбор.СчетаМандатов Цикл
				списМандаты.Добавить(СчетМандата_.Владелец);
			КонецЦикла;
			
		КонецЕсли; 
	КонецЕсли;
	
	Если списМандаты.Количество() > 0 Тогда
		стрОтборПИФ = "Мандат";
		Для каждого сс Из списМандаты Цикл
			ствОтборПИФ.Вставить(сс, Истина);
		КонецЦикла;
	КонецЕсли;
	
	//СерверПИФ = "AMMGAVANCORE";
	//БазаПИФ = "PROD_AVC_PIF";
	СерверПИФ = "SMSK02MG31U";
	БазаПИФ = "AVC_PP_PIF";
	ЛогинПИФ = "svc_avancore";
	ПарольПИФ = "адм232882";
	
	Попытка
		Внешняя = Новый COMObject("V83.ComConnector");  
		БазаПИФ = Внешняя.Connect("Srvr=""" + СерверПИФ + """;Ref=""" + БазаПИФ + """;Usr=""" + ЛогинПИФ + """;Pwd=""" + ПарольПИФ + """");
	Исключение
		Отказ = Истина;
		ТекстСообщений = ТекстСообщений + Символы.ПС + ОписаниеОшибки();
		Сообщить(ТекстСообщений);
		Возврат;
	КонецПопытки;

	Запрос = БазаПИФ.NewObject("Запрос");
	Запрос.Параметры.Вставить("НаДату", НачалоДня(НаДату));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Период КАК Период,
	|	т.ПИФ КАК ПИФ,
	|	т.СЧА КАК СЧА,
	|		т.СЧА КАК РСА
	|ИЗ
	|	РегистрСведений.СтоимостьЧистыхАктивов.СрезПоследних(&НаДату, ) КАК т";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		пифМандат = ПолучитьСсылкуПоCom(БазаПИФ, Выборка.ПИФ);
		//пифСчетМандата = ПолучитьСчетМандатаПИФ(пифМандат, Выборка.НомерСчета);
		
		Если стрОтборПИФ = "Мандат" Тогда
			Если ствОтборПИФ[пифМандат] = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		//ИначеЕсли стрОтбор = "СчетМандата" Тогда
		//	Если ствОбор[пифСчетМандата] = Неопределено Тогда
		//		Продолжить;
		//	КонецЕсли;
		КонецЕсли;
		
		НовСтрока = тз.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		НовСтрока.Мандат = пифМандат;
		//НовСтрока.СчетМандата = пифСчетМандата;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает текст запроса для функции "ДоходыКПолучениюНаДату"
// MID-117 заменил регистр НКД на ЦенныеБумаги + ЗафиксированыеКотировки
Функция ПолучитьТекстЗапросаЦенныеБумагиНаДату()
	
	Возврат
	"ВЫБРАТЬ
	|	т.Период КАК Период,
	|	т.Валюта КАК Валюта,
	|	т.ИсточникКурса КАК ИсточникКурса,
	|	т.Курс КАК Курс,
	|	т.Кратность КАК Кратность
	|ПОМЕСТИТЬ втКурсы
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОкончанияПериода, ) КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Мандат,
	|	т.СчетМандата КАК СчетМандата,
	|	т.Актив КАК Актив,
	|	т.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	РегистрНакопления.ЦенныеБумаги.Остатки(
	|			&ДатаОкончанияПериода,
	|			Актив.Объект.ВыгружатьФО = ИСТИНА
	|				И Мандат <> ЗНАЧЕНИЕ(Справочник.Мандаты.НеОпределен) И (Мандат.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1) ИЛИ Мандат.ДатаОкончания > &ДатаОкончанияПериода) &УсловиеОтбора) КАК т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Мандат,
	|	Актив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Мандат КАК Мандат,
	|	т.Актив КАК Актив,
	|	т.КотировкаУУ * ЕСТЬNULL(тКурсКотировки.Курс, 0) / ЕСТЬNULL(тКурсКотировки.Кратность, 1) КАК Котировка,
	|	т.Период КАК Период,
	|	т.НоминалОблигации КАК НоминалОблигации,
	|	т.Биржа КАК Биржа
	|ПОМЕСТИТЬ ВтЦены
	|ИЗ
	|	РегистрСведений.ЗафиксированныеКотировки.СрезПоследних(
	|			&ДатаОкончанияПериода,
	|			(Мандат, Актив) В (ВЫБРАТЬ Мандат, Актив ИЗ втОстатки КАК втОстатки)) КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсы КАК тКурсКотировки
	|		ПО т.ВалютаУУ = тКурсКотировки.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Мандат,
	|	Актив,
	|	Биржа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Котировки.Период) КАК Период,
	|	Котировки.Актив
	|ПОМЕСТИТЬ ВтАктивДатаКотировка
	|ИЗ
	|	РегистрСведений.КотировкиЦБНаБирже.СрезПоследних(&ДатаОкончанияПериода, Актив В (ВЫБРАТЬ Актив ИЗ втОстатки КАК втОстатки)) КАК Котировки
	|
	|СГРУППИРОВАТЬ ПО
	|	Котировки.Актив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.Актив КАК Актив,
	|	Котировки.НКД * ЕСТЬNULL(тКурсНКД.Курс, 0) / ЕСТЬNULL(тКурсНКД.Кратность, 1) КАК КотировкаНКД,
	|	Котировки.Период КАК Период,
	|	Котировки.Валюта,
	|	Котировки.Биржа КАК Биржа,
	|	ВтЦены.Мандат КАК Мандат
	|ПОМЕСТИТЬ ВтНКД
	|ИЗ
	|	РегистрСведений.КотировкиЦБНаБирже.СрезПоследних(&ДатаОкончанияПериода, Актив В (ВЫБРАТЬ Актив ИЗ втОстатки КАК втОстатки) И НЕ Биржа = &Биржа) КАК Котировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсы КАК тКурсНКД
	|		ПО Котировки.Валюта = тКурсНКД.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЦены КАК ВтЦены
	|		ПО Котировки.Актив = ВтЦены.Актив
	|			И Котировки.Биржа = ВтЦены.Биржа
	|ГДЕ
	|	Котировки.Активность = ИСТИНА
	|	И ЕСТЬNULL(Котировки.НКД, 0) <> 0
	|	И Котировки.Период В
	|			(ВЫБРАТЬ
	|				ВтАктивДатаКотировка.Период
	|			ИЗ
	|				ВтАктивДатаКотировка
	|			ГДЕ
	|				ВтАктивДатаКотировка.Актив = Котировки.Актив)
	|	И (Котировки.Актив, Котировки.Биржа) В
	|			(ВЫБРАТЬ
	|				ВтЦены.Актив,
	|				ВтЦены.Биржа
	|			ИЗ
	|				ВтЦены КАК ВтЦены)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Актив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Мандат,
	|	Остатки.СчетМандата,
	|	Остатки.Актив,
	|	Остатки.Количество КАК Количество,
	|	Остатки.Количество * ЕСТЬNULL(ВтЦены.Котировка, 0) КАК Стоимость,
	|	Остатки.Количество * ЕСТЬNULL(ВтНКД.КотировкаНКД, 0) КАК СуммаНКД,
	|	ВтНКД.Валюта,
	|	ВтНКД.Биржа,
	|	0 КАК Задолженость
	|ИЗ
	|	втОстатки КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЦены КАК ВтЦены
	|		ПО Остатки.Мандат = ВтЦены.Мандат
	|			И Остатки.Актив = ВтЦены.Актив
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтНКД КАК ВтНКД
	|		ПО Остатки.Актив = ВтНКД.Актив
	|			И Остатки.Мандат = ВтНКД.Мандат";
	
КонецФункции // ПолучитьТекстЗапросаЦенныеБумагиНаДату()
// MPazhukov IMAPPS-10144

Функция ПолучитьВалюту(стрНаименование)
	
	ссВалюты = КешБазыПИФ[стрНаименование];
	Если ссВалюты = Неопределено Тогда
		ссВалюты = Справочники.Валюты.НайтиПоНаименованию(СокрЛП(стрНаименование));
		КешБазыПИФ.Вставить(стрНаименование, ссВалюты);
	КонецЕсли;
	
	Возврат ссВалюты;
КонецФункции

Функция ПолучитьСчетМандатаПИФ(сМандат, стрНаименование)
	
	ссСчет = КешБазыПИФ[стрНаименование];
	Если ссСчет = Неопределено Тогда
		
		Запрос = новый Запрос;
		Запрос.УстановитьПараметр("Владелец", сМандат);
		Запрос.УстановитьПараметр("НомерСчета", стрНаименование);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Ссылка
		|ИЗ
		|	Справочник.СчетаМандатов КАК т
		|ГДЕ
		|	т.Владелец = &Владелец
		|	И ВЫРАЗИТЬ(т.МестоХранения КАК Справочник.БанковскиеСчета).НомерСчета = &НомерСчета";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ссСчет = Выборка.Ссылка;
		КонецЕсли;
		КешБазыПИФ.Вставить(стрНаименование, ссСчет);
	КонецЕсли;
	
	Возврат ссСчет;
КонецФункции

Функция ПолучитьСсылкуПоCom(БазаCom, ОбъектCom) Экспорт 
	
	обXML = БазаCom.NewObject("ЗаписьXML");
	обXML.SetString();
	БазаCom.WriteXML(обXML, ОбъектCom);
	стрXML = обXML.Close();
	стрXML = СтрЗаменить(стрXML, "ПИФ", "Мандаты");
	
	обXML = новый ЧтениеXML;
	обXML.УстановитьСтроку(стрXML);
	
	Возврат ПрочитатьXML(обXML);
КонецФункции

Функция СписокТиповПортфелейПИФ() Экспорт
	
	Спис = новый Массив;
	Спис.Добавить(Перечисления.ТипыМандата.A); // ОПИФA
	Спис.Добавить(Перечисления.ТипыМандата.M); // ОПИФС
	Спис.Добавить(Перечисления.ТипыМандата.O); // ОПИФО
	Спис.Добавить(Перечисления.ТипыМандата.X); // ОПИФИ
	Спис.Добавить(Перечисления.ТипыМандата.H); // ЗПИ Хедж фонд
	Спис.Добавить(Перечисления.ТипыМандата.Q); // ЗПИФ Прямых инв-ий
	Спис.Добавить(Перечисления.ТипыМандата.V); // ЗПИФ ВИ
	Спис.Добавить(Перечисления.ТипыМандата.Y); // ЗПИФ недвижимости
	
	Возврат Спис;
КонецФункции

Функция хдтоПользовательПоиск(Наименование, ФабрикаСервиса) Экспорт
	
	хдтоОбъект = ФабрикаСервиса.Создать(ФабрикаСервиса.Тип(ПространствоИменСервиса, "ПользовательПоиск"));
	хдтоОбъект.Наименование = СокрЛП(Наименование);
	
	Возврат хдтоОбъект;
КонецФункции
 
Процедура ЗаполнитьСписокМандатДляОтбора()
 	
 	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Мандаты.Ссылка КАК Мандат
		|ИЗ
		|	Справочник.Мандаты КАК Мандаты
		|ГДЕ
		|	Мандаты.УК = &УК";
	                          
	Запрос.УстановитьПараметр("УК", УК);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗЗапрос = РезультатЗапроса.Выгрузить();
	МассивМандат = ТЗЗапрос.ВыгрузитьКолонку("Мандат");
	СписМандатОтбор.ЗагрузитьЗначения(МассивМандат);
	
КонецПроцедуры

Процедура ПроверитьУсловиеМандатыОтбор(Условие, ДобавитьИ)

	Если СписМандатОтбор.Количество() Тогда
		Условие = Условие+?(ДобавитьИ, " И ", "")+"Мандат В (&СписМандатОтбор)";
	КонецЕсли;

КонецПроцедуры
//RKatunin IMDEV-3438
Функция ПолучитьПозициюФО(ДатаЗаполнения, ВидПозиции, СоставГрупПозицииДС = "Субпортфель", СоставГрупПозицииЦБ = "Субпортфель")

	СтруктураСервиса = ПолучитьОпределениеСервиса();
	Если СтруктураСервиса.ЕстьОшибки Тогда
		Сообщить(СтруктураСервиса.ОписаниеОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
	Определение = СтруктураСервиса.ОпределениеWS;
	ФабрикаСервиса = Определение.ФабрикаXDTO;
	URIПространстваИмен = Определение.Сервисы[0].URIПространстваИмен;
	Прокси = Новый WSПрокси(Определение, URIПространстваИмен, Определение.Сервисы[0].Имя, Определение.Сервисы[0].ТочкиПодключения[0].Имя); 
	Если ЭтотОбъект.АдресWS="http://smsk02mg31u/AVC_PP_FO/ws/avancore_ws.1cws?wsdl" Тогда
	Прокси = Новый WSПрокси(Определение, URIПространстваИмен, Определение.Сервисы[0].Имя, Определение.Сервисы[0].ТочкиПодключения[0].Имя);
		Прокси.Пользователь = "admin";
		Прокси.Пароль = "адм232882";
	КонецЕсли;
	ТипЗапросПозиции = ФабрикаСервиса.Тип(URIПространстваИмен, "ЗапросПозиции");
	ЗапросПозиции = ФабрикаСервиса.Создать(ТипЗапросПозиции);
	
	ЗапросПозиции.Заголовок = ФабрикаСервиса.Создать(ФабрикаСервиса.Тип("http://avancore.ru/xsd", "Заголовок"));
	ЗапросПозиции.Заголовок.УникальныйИдентификатор = СокрЛП(новый УникальныйИдентификатор());
	ЗапросПозиции.Заголовок.ДатаВыполнения = ТекущаяДата();
	ЗапросПозиции.Заголовок.ИдентификаторСистемы = "МО 1.0";
	ЗапросПозиции.Заголовок.ИмяПользователя = "Сервис";
	ЗапросПозиции.Заголовок.ДатаВыгрузки = КонецДня(ДатаЗаполнения);

	ОбСоставПозиции = ФабрикаСервиса.Создать(ЗапросПозиции.Свойства().Получить("СоставПозиции").Тип);
	ОбСоставПозиции.ВидПозиции = ВидПозиции;
	ЗапросПозиции.СоставПозиции.Добавить(ОбСоставПозиции);
	
	СоставГруппировокДС = ФабрикаСервиса.Создать(ЗапросПозиции.Свойства().Получить("СоставГруппировокДС").Тип);
	СоставГруппировокДС.Реквизит = СоставГрупПозицииДС;
	ЗапросПозиции.СоставГруппировокДС.Добавить(СоставГруппировокДС);
	
	СоставГруппировокВыпусков = ФабрикаСервиса.Создать(ЗапросПозиции.Свойства().Получить("СоставГруппировокВыпусков").Тип);
	СоставГруппировокВыпусков.Реквизит = СоставГрупПозицииЦБ;
	ЗапросПозиции.СоставГруппировокВыпусков.Добавить(СоставГруппировокВыпусков);
	
	ЗапросПозиции.Дата = КонецДня(ДатаЗаполнения);
	
	Ответ = Прокси.GetPosition(ЗапросПозиции);
	
	Возврат Ответ;

КонецФункции // ПолучитьПозициюФО()  

Функция ПолучитьРЕПОФО(ДатыПериодаПозиции, Отбор)
	
	СтруктураСервиса = ПолучитьОпределениеСервиса();
	Если СтруктураСервиса.ЕстьОшибки Тогда
		Сообщить(СтруктураСервиса.ОписаниеОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
	Определение = СтруктураСервиса.ОпределениеWS;
	ФабрикаСервиса = Определение.ФабрикаXDTO;
	URIПространстваИмен = Определение.Сервисы[0].URIПространстваИмен;
	Прокси = Новый WSПрокси(Определение, URIПространстваИмен, Определение.Сервисы[0].Имя, Определение.Сервисы[0].ТочкиПодключения[0].Имя);
	Если ЭтотОбъект.АдресWS="http://smsk02mg31u/AVC_PP_FO/ws/avancore_ws.1cws?wsdl" Тогда
		Прокси.Пользователь = "admin";
		Прокси.Пароль = "адм232882";
	КонецЕсли;
	ПакетПараметрыЗапроса = хдтоСоздатьПакетЗапросРЕПО(ДатыПериодаПозиции, ФабрикаСервиса, Отбор);
	
	Ответ = Прокси.GetDataOnRequest("СделкиРЕПОДействующие", ПакетПараметрыЗапроса);
	
	Рез = ОбработатьОтветРЕПО(Ответ, ФабрикаСервиса, вклОтладка, ДатыПериодаПозиции);
	
	Возврат Рез.ТЗ_ФО;
	
КонецФункции // ПолучитьРЕПОФО()

//RKatunin IMDEV-3438

Функция ПолучитьСделкаРЕПОПоНомеру(НомерСделки, ИсполнениеПоДеньгам, ИсполнениеПоЦБ, СделкаЗакрыта, ДатаПубликации)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокСделкаРЕПО.Ссылка КАК СделкаРЕПО,
		|	ВЫБОР
		|		КОГДА ДокСделкаРЕПО.ФактическаяДатаПлатежаПо2Части > &ДатаПубликации
		|				ИЛИ ДокСделкаРЕПО.ФактическаяДатаПлатежаПо2Части = &ПустаяДата
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ИсполнениеПоДеньгам,
		|	ВЫБОР
		|		КОГДА ДокСделкаРЕПО.ФактическаяДатаПоставкиПо2Части > &ДатаПубликации
		|				ИЛИ ДокСделкаРЕПО.ФактическаяДатаПоставкиПо2Части = &ПустаяДата
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ИсполнениеПоЦБ,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.СуммаОстаток ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ НЕ ВложенныйЗапрос.СуммаОстаток > 0
		|	КОНЕЦ КАК СделкаЗакрыта
		|ИЗ
		|	Документ.СделкаРЕПО КАК ДокСделкаРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДенежныеСредстваОтданныеВРЕПООстатки.СделкаРЕПО КАК СделкаРЕПО,
		|			ДенежныеСредстваОтданныеВРЕПООстатки.СуммаОстаток КАК СуммаОстаток
		|		ИЗ
		|			РегистрНакопления.ДенежныеСредстваОтданныеВРЕПО.Остатки КАК ДенежныеСредстваОтданныеВРЕПООстатки
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ДенежныеСредстваПолученныеПоРЕПООстатки.СделкаРЕПО,
		|			ДенежныеСредстваПолученныеПоРЕПООстатки.СуммаОстаток
		|		ИЗ
		|			РегистрНакопления.ДенежныеСредстваПолученныеПоРЕПО.Остатки КАК ДенежныеСредстваПолученныеПоРЕПООстатки) КАК ВложенныйЗапрос
		|		ПО ДокСделкаРЕПО.Ссылка = ВложенныйЗапрос.СделкаРЕПО
		|ГДЕ
		|	ДокСделкаРЕПО.НомерСделки = &НомерСделки";
	
	Запрос.УстановитьПараметр("НомерСделки", НомерСделки);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.УстановитьПараметр("ДатаПубликации", ДатаПубликации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда  
		
		ИсполнениеПоДеньгам = ВыборкаДетальныеЗаписи.ИсполнениеПоДеньгам;
		ИсполнениеПоЦБ = ВыборкаДетальныеЗаписи.ИсполнениеПоЦБ;
		СделкаЗакрыта = ВыборкаДетальныеЗаписи.СделкаЗакрыта;
		
		Возврат ВыборкаДетальныеЗаписи.СделкаРЕПО;
	КонецЕсли;
	
	ИсполнениеПоДеньгам = Ложь;
	ИсполнениеПоЦБ = Ложь;
		
	Возврат Документы.СделкаРЕПО.ПустаяСсылка();
		
КонецФункции // ПолучитьСделкаРЕПОПоНомеру()

Функция ПолучитьМандат(Портфель)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Мандаты.Ссылка КАК Мандат
		|ИЗ
		|	Справочник.Мандаты КАК Мандаты
		|ГДЕ
		|	Мандаты.КодМандата = &Код";
	           
	Если ТипЗнч(Портфель)=Тип("Строка") Тогда
		Запрос.УстановитьПараметр("Код", Портфель);
	Иначе
		Запрос.УстановитьПараметр("Код", Портфель.ВнешнийКод);
	КонецЕсли;           
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.Мандат;
	КонецЕсли;
	
	Возврат Справочники.Мандаты.ПустаяСсылка();

КонецФункции // ПолучитьМандат()

Функция ПолучитьСчетМандата(КодСчета)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетаМандатов.Ссылка КАК СчетМандата
		|ИЗ
		|	Справочник.СчетаМандатов КАК СчетаМандатов
		|ГДЕ
		|	СчетаМандатов.КодСчета = &КодСчета";
	
	Запрос.УстановитьПараметр("КодСчета", КодСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.СчетМандата;
	Иначе
		УИД = Новый УникальныйИдентификатор(КодСчета); 
		СсылкаСчетМанадат = Справочники.СчетаМандатов.ПолучитьСсылку(УИД);
		//Если СсылкаСчетМанадат Тогда
		//
		//	
		//
		//КонецЕсли;
		Возврат СсылкаСчетМанадат;
	КонецЕсли;
	
	Возврат Справочники.СчетаМандатов.ПустаяСсылка();

КонецФункции // ПолучитьСчетМандата()

Функция ПолучитьАктив(Актив)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Активы.Ссылка КАК Актив
		|ИЗ
		|	Справочник.Активы КАК Активы
		|ГДЕ
		|	Активы.ВнешнийКод = &ВнешнийКод";
	
	Если ТипЗнч(Актив)=Тип("Строка") Тогда
		Запрос.УстановитьПараметр("ВнешнийКод", Актив);	
	Иначе 	
		Запрос.УстановитьПараметр("ВнешнийКод", Актив.ВнешнийКод);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Актив;
	КонецЕсли;
	
	Возврат Справочники.Активы.ПустаяСсылка();	

КонецФункции // ПолучитьАктив()

Функция ПустаяТЗ()
	Возврат Новый ТаблицаЗначений;	
КонецФункции // ПустаяТЗ()

Функция ПолучитьВалюта(Валюта)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Валюта
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Код = &Код";
	
	Если ТипЗнч(Валюта)=Тип("Строка") Тогда
		Запрос.УстановитьПараметр("Код", Валюта);	
	Иначе
		Запрос.УстановитьПараметр("Код", Валюта.Код);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.Валюта;
	КонецЕсли;
	
	Возврат Справочники.Валюты.ПустаяСсылка();
	
КонецФункции // ПолучитьВалюта()
//RKatunin IMDEV-3438

Функция ПолучитьИсполнение(ПозицияФО, Отбор = Неопределено)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТБ.Мандат КАК Мандат,
		|	ТБ.Валюта КАК Валюта,
		|	ТБ.Актив КАК Актив
		|ПОМЕСТИТЬ ВТ_МандатАктив
		|ИЗ
		|	&ТабМандатАктив КАК ТБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИСТИНА КАК Проведен,
		|	ПлановаяПозицияПоЦеннымБумагам.Сделка КАК Сделка,
		|	ПлановаяПозицияПоЦеннымБумагам.Актив КАК Актив,
		|	ПлановаяПозицияПоЦеннымБумагам.Мандат КАК Портфель,
		|	ПлановаяПозицияПоЦеннымБумагам.СчетМандата.МестоХранения КАК МестоХранения,
		|	ПлановаяПозицияПоЦеннымБумагам.СчетМандата КАК Субпортфель,
		|	ПлановаяПозицияПоЦеннымБумагам.Количество КАК Количество,
		|	ПлановаяПозицияПоЦеннымБумагам.ВидДвижения КАК ВидДвижение,
		|	ПлановаяПозицияПоЦеннымБумагам.МоментВремени КАК МоментВремени,
		|	ПлановаяПозицияПоЦеннымБумагам.Сделка.НомерСделки
		|ИЗ
		|	РегистрНакопления.ПлановаяПозицияПоЦеннымБумагам КАК ПлановаяПозицияПоЦеннымБумагам
		|ГДЕ
		|	ПлановаяПозицияПоЦеннымБумагам.Период > ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, &КоличестовДнейПроверкиИсполненияСделок)
		|	И (ПлановаяПозицияПоЦеннымБумагам.Сделка.Внебиржевая
		|			ИЛИ ПлановаяПозицияПоЦеннымБумагам.Сделка.КодКласса ПОДОБНО ""DMA%"")
		|	И ВЫБОР
		|			КОГДА ПлановаяПозицияПоЦеннымБумагам.Сделка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделка.Поступление)
		|				ТОГДА ПлановаяПозицияПоЦеннымБумагам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ИНАЧЕ ПлановаяПозицияПоЦеннымБумагам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		КОНЕЦ
		|	И (ПлановаяПозицияПоЦеннымБумагам.Мандат, ПлановаяПозицияПоЦеннымБумагам.Актив) В
		|			(ВЫБРАТЬ
		|				МандатАктив.Мандат,
		|				МандатАктив.Актив
		|			ИЗ
		|				ВТ_МандатАктив КАК МандатАктив) &УсловиеЦБ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА,
		|	ПлановаяПозицияПоДенежнымСредствам.Сделка,
		|	ПлановаяПозицияПоДенежнымСредствам.Валюта,
		|	ПлановаяПозицияПоДенежнымСредствам.Мандат,
		|	ПлановаяПозицияПоДенежнымСредствам.СчетМандата.МестоХранения,
		|	ПлановаяПозицияПоДенежнымСредствам.СчетМандата,
		|	ПлановаяПозицияПоДенежнымСредствам.Сумма,
		|	ПлановаяПозицияПоДенежнымСредствам.ВидДвижения,
		|	ПлановаяПозицияПоДенежнымСредствам.МоментВремени,
		|	ПлановаяПозицияПоДенежнымСредствам.Сделка.НомерСделки
		|ИЗ
		|	РегистрНакопления.ПлановаяПозицияПоДенежнымСредствам КАК ПлановаяПозицияПоДенежнымСредствам
		|ГДЕ
		|	ПлановаяПозицияПоДенежнымСредствам.Период > ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, &КоличестовДнейПроверкиИсполненияСделок)
		|	И (ПлановаяПозицияПоДенежнымСредствам.Сделка.Внебиржевая
		|			ИЛИ ПлановаяПозицияПоДенежнымСредствам.Сделка.КодКласса ПОДОБНО ""DMA%"")
		|	И ВЫБОР
		|			КОГДА ПлановаяПозицияПоДенежнымСредствам.Сделка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделка.Продажа)
		|				ТОГДА ПлановаяПозицияПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ИНАЧЕ ПлановаяПозицияПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		КОНЕЦ
		|	И (ПлановаяПозицияПоДенежнымСредствам.Мандат, ПлановаяПозицияПоДенежнымСредствам.Валюта) В
		|			(ВЫБРАТЬ
		|				МандатАктив.Мандат,
		|				МандатАктив.Валюта
		|			ИЗ
		|				ВТ_МандатАктив КАК МандатАктив) &УсловиеДС";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("ТабМандатАктив", ПозицияФО);
	Запрос.УстановитьПараметр("КоличестовДнейПроверкиИсполненияСделок", КоличестовДнейПроверкиИсполненияСделок);
	
	УсловиеЦБ = "";
	УсловиеДС = "";
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Если Отбор.Свойство("Мандаты") Тогда
			УсловиеЦБ = УсловиеЦБ + " И ПлановаяПозицияПоЦеннымБумагам.Мандат В (&Мандаты)";
			УсловиеДС = УсловиеДС + " И ПлановаяПозицияПоДенежнымСредствам.Мандат В (&Мандаты)";
			Запрос.УстановитьПараметр("Мандаты", Отбор.Мандаты);
		КонецЕсли; 
		Если Отбор.Свойство("СчетаМандатов") Тогда
			
			УсловиеЦБ = УсловиеЦБ + " И ПлановаяПозицияПоЦеннымБумагам.СчетМандата В (&СчетаМандатов)";
			УсловиеДС = УсловиеДС + " И ПлановаяПозицияПоДенежнымСредствам.СчетМандата В (&СчетаМандатов)";
			Запрос.УстановитьПараметр("СчетаМандатов", Отбор.СчетаМандатов);
			
			Запрос.УстановитьПараметр("Мандаты", Отбор.ОтборМандаты);
			
		КонецЕсли;
	КонецЕсли;
	
	Если ОтборМандат Тогда
		Если СписМандатОтбор.Количество() Тогда
			УсловиеЦБ = УсловиеЦБ + " И ПлановаяПозицияПоЦеннымБумагам.Мандат В (&СписМандатОтбор)";
			УсловиеДС = УсловиеДС + " И ПлановаяПозицияПоДенежнымСредствам.Мандат В (&СписМандатОтбор)";
		КонецЕсли;
		Запрос.УстановитьПараметр("СписМандатОтбор", СписМандатОтбор);
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЦБ", УсловиеЦБ);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДС", УсловиеДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗИсполнение = РезультатЗапроса.Выгрузить();
	
	Возврат ТЗИсполнение;
	
КонецФункции // ПолучитьИсполнение() 

Функция ДатаПредыдущегоДня()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, &КоличестовДнейПроверкиИсполненияСделок), ДЕНЬ) КАК ДатаНачала,
		|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, &КоличестовДнейПроверкиИсполненияСделок), ДЕНЬ) КАК ДатаКонца";
		
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("КоличестовДнейПроверкиИсполненияСделок", -1);
	
	РезультатЗапроса = Запрос.Выполнить();
	ДатыПериода = РезультатЗапроса.Выбрать();
	ДатыПериода.Следующий();
	
	Возврат ДатыПериода;	

КонецФункции // ДатаПредыдущегоДня()

Функция ДатыПериода()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, &КоличестовДнейПроверкиИсполненияСделок), ДЕНЬ) КАК ДатаНачала,
		|	КОНЕЦПЕРИОДА(&Период, ДЕНЬ) КАК ДатаОкончания";
		
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("КоличестовДнейПроверкиИсполненияСделок", КоличестовДнейПроверкиИсполненияСделок);
	
	РезультатЗапроса = Запрос.Выполнить();
	ДатыПериода = РезультатЗапроса.Выбрать();
	ДатыПериода.Следующий();
	
	Возврат ДатыПериода;
	
КонецФункции // ДатыПериода()

Функция ПолучитьСделкиИсполнениеФО()
	
	ДатаЗаполнения = ТекущаяДата(); 
	СтруктураСервиса = ПолучитьОпределениеСервиса();
	Если СтруктураСервиса.ЕстьОшибки Тогда
		Сообщить(СтруктураСервиса.ОписаниеОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
	Определение = СтруктураСервиса.ОпределениеWS;
	ФабрикаСервиса = Определение.ФабрикаXDTO;
	URIПространстваИмен = Определение.Сервисы[0].URIПространстваИмен;
	Прокси = Новый WSПрокси(Определение, URIПространстваИмен, Определение.Сервисы[0].Имя, Определение.Сервисы[0].ТочкиПодключения[0].Имя);
	Если ЭтотОбъект.АдресWS="http://smsk02mg31u/AVC_PP_FO/ws/avancore_ws.1cws?wsdl" Тогда
		Прокси.Пользователь = "admin";
		Прокси.Пароль = "адм232882";
	КонецЕсли;
	
	ТипЗапросСпискаСделок = ФабрикаСервиса.Тип(URIПространстваИмен, "ЗапросСпискаСделок");
	ЗапросСпискаСделок = ФабрикаСервиса.Создать(ТипЗапросСпискаСделок);
	
	ЗапросСпискаСделок.Заголовок = ФабрикаСервиса.Создать(ФабрикаСервиса.Тип("http://avancore.ru/xsd", "Заголовок"));
	ЗапросСпискаСделок.Заголовок.УникальныйИдентификатор = СокрЛП(новый УникальныйИдентификатор());
	ЗапросСпискаСделок.Заголовок.ДатаВыполнения = ТекущаяДата();
	ЗапросСпискаСделок.Заголовок.ИдентификаторСистемы = "МО 1.0";
	ЗапросСпискаСделок.Заголовок.ИмяПользователя = "Сервис";
	ЗапросСпискаСделок.Заголовок.ДатаВыгрузки = КонецДня(ДатаЗаполнения);
	
	ДатыПериода = ДатыПериода();
	ЗаполнитьЗначенияСвойств(ЗапросСпискаСделок, ДатыПериода); 
	ВидОперации = ФабрикаСервиса.Создать(ЗапросСпискаСделок.ВидыОпераций.ВладеющееСвойство.Тип);
	ВидОперации.ВидОперации = "Сделка";
	ЗапросСпискаСделок.ВидыОпераций.Добавить(ВидОперации); 
	ЗапросСпискаСделок.ВыгружатьИсполненияПоСделкам = "Внебиржевые";
	ЗапросСпискаСделок.ТипСделок = "Внебиржевые";
	
	Ответ = Прокси.GetListOfDeals(ЗапросСпискаСделок);
	
	Возврат Ответ;

КонецФункции // ПолучитьИсполнениеФО()

Функция ПолучитьИсполнениеСделокМО(Отбор = Неопределено)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СделкаСЦеннымиБумагами.ФактическаяДатаПоставки <> ДАТАВРЕМЯ(1, 1, 1) КАК Проведен,
		|	СделкаСЦеннымиБумагами.ФактическаяДатаПоставки КАК ДатаИсполнения,
		|	ВЫБОР
		|		КОГДА СделкаСЦеннымиБумагами.ФактическаяДатаПоставки <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ""Исполнение""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Действие,
		|	СделкаСЦеннымиБумагами.Ссылка КАК Сделка,
		|	СделкаСЦеннымиБумагами.Номер КАК Идентификатор,
		|	СделкаСЦеннымиБумагами.Актив КАК Актив,
		|	""Бумаги"" КАК ВидАктива,
		|	СделкаСЦеннымиБумагами.Мандат КАК Портфель,
		|	СделкаСЦеннымиБумагами.СчетМандатаЦБ.МестоХранения КАК МестоХранения,
		|	СделкаСЦеннымиБумагами.СчетМандатаЦБ КАК Субпортфель,
		|	СделкаСЦеннымиБумагами.НомерСделки КАК НомерСделки,
		|	СделкаСЦеннымиБумагами.Количество КАК Количество
		|ИЗ
		|	Документ.СделкаСЦеннымиБумагами КАК СделкаСЦеннымиБумагами
		|ГДЕ
		|	СделкаСЦеннымиБумагами.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, &КоличестовДнейПроверкиИсполненияСделок) И &Период
		|	И (СделкаСЦеннымиБумагами.Внебиржевая
		|			ИЛИ СделкаСЦеннымиБумагами.КодКласса ПОДОБНО ""DMA%"") &УсловиеЦБ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СделкаДенежныеСредства.ФактическаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1),
		|	СделкаДенежныеСредства.ФактическаяДатаПлатежа,
		|	ВЫБОР
		|		КОГДА СделкаДенежныеСредства.ФактическаяДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ""Исполнение""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	СделкаДенежныеСредства.Ссылка,
		|	СделкаДенежныеСредства.Номер,
		|	СделкаДенежныеСредства.Валюта,
		|	""Деньги"",
		|	СделкаДенежныеСредства.Мандат,
		|	СделкаДенежныеСредства.СчетМандатаДС.МестоХранения,
		|	СделкаДенежныеСредства.СчетМандатаДС,
		|	СделкаДенежныеСредства.НомерСделки,
		|	СделкаДенежныеСредства.СуммаСделки
		|ИЗ
		|	Документ.СделкаСЦеннымиБумагами КАК СделкаДенежныеСредства
		|ГДЕ
		|	СделкаДенежныеСредства.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, &КоличестовДнейПроверкиИсполненияСделок) И &Период
		|	И (СделкаДенежныеСредства.Внебиржевая
		|			ИЛИ СделкаДенежныеСредства.КодКласса ПОДОБНО ""DMA%"") &УсловиеДС";
		
		
		
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КоличестовДнейПроверкиИсполненияСделок", КоличестовДнейПроверкиИсполненияСделок);
	
	УсловиеЦБ = "";
	УсловиеДС = "";
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Если Отбор.Свойство("Мандаты") Тогда
			УсловиеЦБ = УсловиеЦБ + " И СделкаСЦеннымиБумагами.Мандат В (&Мандаты)";
			УсловиеДС = УсловиеДС + " И СделкаДенежныеСредства.Мандат В (&Мандаты)";
			Запрос.УстановитьПараметр("Мандаты", Отбор.Мандаты);
		КонецЕсли; 
		Если Отбор.Свойство("СчетаМандатов") Тогда
			
			УсловиеЦБ = УсловиеЦБ + " И СделкаСЦеннымиБумагами.СчетМандатаЦБ В (&СчетаМандатов)";
			УсловиеДС = УсловиеДС + " И СделкаДенежныеСредства.СчетМандатаДС В (&СчетаМандатов)";
			Запрос.УстановитьПараметр("СчетаМандатов", Отбор.СчетаМандатов);
			
			Запрос.УстановитьПараметр("Мандаты", Отбор.ОтборМандаты);
			
		КонецЕсли;
	КонецЕсли;
	
	Если ОтборМандат Тогда
		Если СписМандатОтбор.Количество() Тогда
			УсловиеЦБ = УсловиеЦБ + " И СделкаСЦеннымиБумагами.Мандат В (&СписМандатОтбор)";
			УсловиеДС = УсловиеДС + " И СделкаДенежныеСредства.Мандат В (&СписМандатОтбор)";
		КонецЕсли;
		Запрос.УстановитьПараметр("СписМандатОтбор", СписМандатОтбор);
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЦБ", УсловиеЦБ);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДС", УсловиеДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗИсполнение = РезультатЗапроса.Выгрузить();
	
	Возврат ТЗИсполнение;
	
КонецФункции // ПолучитьИсполнениеСделокМО()

Функция ИсполнениеСделок(Дата, Отбор = Неопределено) Экспорт 
	
	Если ИсполнениеПоСуммеМО Тогда
		СписокПозиций = ПолучитьПозициюФО(Дата, "Плановая");
		
		ПозицияФО = Новый ТаблицаЗначений;
		ПозицияФО.Колонки.Добавить("Мандат", Новый ОписаниеТипов("СправочникСсылка.Мандаты"));
		ПозицияФО.Колонки.Добавить("Актив", Новый ОписаниеТипов("СправочникСсылка.Активы"));
		ПозицияФО.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
		
		Для Каждого ТекущаяПозицияХДТО Из СписокПозиций.ТекущаяПозиция Цикл
		
			Мандат = ПолучитьМандат(ТекущаяПозицияХДТО.Портфель);
			Для каждого ПозицияПортфеляХДТО Из ТекущаяПозицияХДТО.ПозицияПортфеля Цикл
			
				Для каждого ЦенныеБумагиХДТО Из ПозицияПортфеляХДТО.ЦенныеБумаги Цикл
					СтрокаПозицияФО = ПозицияФО.Добавить();
					Актив = ПолучитьАктив(ЦенныеБумагиХДТО.Актив.Актив);	
				
					СтрокаПозицияФО.Мандат = Мандат;
					СтрокаПозицияФО.Актив = Актив;
				КонецЦикла;	
			
				Для каждого ЦенныеБумагиХДТО Из ПозицияПортфеляХДТО.ДенежныеСредства Цикл
					СтрокаПозицияФО = ПозицияФО.Добавить();
					Валюта = ПолучитьВалюта(ЦенныеБумагиХДТО.Актив.Валюта);	
				
					СтрокаПозицияФО.Мандат = Мандат;
					СтрокаПозицияФО.Валюта = Валюта;
				КонецЦикла;
				
			КонецЦикла;
		КонецЦикла;
		
		ИсполненныеСделкиМО = ПолучитьИсполнение(ПозицияФО, Отбор);
	Иначе	
		
		ИсполненныеСделкиМО = ПолучитьИсполнениеСделокМО(Отбор);
		ИсполненныеСделкиФО = ПолучитьСделкиИсполнениеФО();
		
		ИсполненныеСделкиМО.Колонки.Добавить("ИсполнениеПроверка");
		
		Для каждого ИсполнениеФО Из ИсполненныеСделкиФО.ИсполненияПоСделке Цикл
			
			ВидАктива = ?(ИсполнениеФО.Актив.Актив=Неопределено, "Деньги", "Бумаги");
			
			СтруктПоиск = Новый Структура("НомерСделки, ВидАктива", ИсполнениеФО.Сделка.Идентификатор, ВидАктива);
			СделкиМО = ИсполненныеСделкиМО.НайтиСтроки(СтруктПоиск);
			Если СделкиМО.Количество() Тогда
				Для каждого СделкаМО Из СделкиМО Цикл
					Если Не СделкаМО.Проведен И ИсполнениеФО.Количество<>0 Тогда
						СделкаМО.Действие = "Отмена исп";
						СделкаМО.Количество = 0;
						СделкаМО.ИсполнениеПроверка = "ИсполненаФО";
					ИначеЕсли СделкаМО.Проведен И ИсполнениеФО.Количество<>0 Тогда
						СделкаМО.ИсполнениеПроверка = "ИсполненаФО";
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		ТекДата = НачалоДня(ТекущаяДата());
		Для каждого СделкаМО Из ИсполненныеСделкиМО Цикл
			
			Если ТекДата<>НачалоДня(СделкаМО.ДатаИсполнения) И СделкаМО.ИсполнениеПроверка="ИсполненаФО" И СделкаМО.Проведен Тогда
				СделкаМО.Действие = "";
			КонецЕсли;
			
			Если СделкаМО.Действие="Исполнение" Тогда
				Для каждого СделкаФО Из ИсполненныеСделкиФО.Сделки Цикл
					Если СделкаФО.Идентификатор=СделкаМО.Идентификатор Тогда
						Если ТипЗнч(СделкаМО.Актив)=Тип("СправочникСсылка.Активы") Тогда
							СделкаМО.Количество = СделкаФО.Количество;
						ИначеЕсли ТипЗнч(СделкаМО.Актив)=Тип("СправочникСсылка.Валюты") Тогда
							СделкаМО.Количество = СделкаФО.Сумма;
						КонецЕсли;
					КонецЕсли;				
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		     
	КонецЕсли;
    
	Возврат ИсполненныеСделкиМО;

КонецФункции // ИсполнениеСделок()
// MPazhukov IMAPPS-10144

//RKatunin IMDEV-3438
Функция ПолучитьТекстЗапросаИсполнениеСделокВнеБиржДМАНаДату()

	Возврат  "ВЫБРАТЬ
	         |	ИСТИНА КАК Проведен,
	         |	ПлановаяПозицияПоДенежнымСредствам.Сделка КАК Сделка,
	         |	ПлановаяПозицияПоДенежнымСредствам.Валюта КАК Актив,
	         |	ПлановаяПозицияПоДенежнымСредствам.Мандат КАК Портфель,
	         |	ПлановаяПозицияПоДенежнымСредствам.СчетМандата.МестоХранения КАК МестоХранения,
	         |	ПлановаяПозицияПоДенежнымСредствам.СчетМандата КАК Субпортфель,
	         |	ПлановаяПозицияПоДенежнымСредствам.Сумма КАК Количество
	         |ИЗ
	         |	РегистрНакопления.ПлановаяПозицияПоДенежнымСредствам КАК ПлановаяПозицияПоДенежнымСредствам
	         |ГДЕ
	         |	(ПлановаяПозицияПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	         |				И ПлановаяПозицияПоДенежнымСредствам.Сделка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделка.Поступление)
	         |			ИЛИ ПлановаяПозицияПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	         |				И ПлановаяПозицияПоДенежнымСредствам.Сделка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделка.Продажа))
	         |	И ПлановаяПозицияПоДенежнымСредствам.Период МЕЖДУ &ДатаНачалаПериода И &ДатаОкончанияПериода
	         |	И (ПлановаяПозицияПоДенежнымСредствам.Сделка.Внебиржевая
	         |			ИЛИ ПлановаяПозицияПоДенежнымСредствам.Сделка.КодКласса ПОДОБНО ""%DMA%"")
	         |	&УсловиеОтбораПлановаяПозицияПоДенежнымСредствам
	         |
	         |ОБЪЕДИНИТЬ ВСЕ
	         |
	         |ВЫБРАТЬ
	         |	ИСТИНА,
	         |	ПлановаяПозицияПоЦеннымБумагам.Сделка,
	         |	ПлановаяПозицияПоЦеннымБумагам.Актив,
	         |	ПлановаяПозицияПоЦеннымБумагам.Мандат,
	         |	ПлановаяПозицияПоЦеннымБумагам.СчетМандата.МестоХранения,
	         |	ПлановаяПозицияПоЦеннымБумагам.СчетМандата,
	         |	ПлановаяПозицияПоЦеннымБумагам.Количество
	         |ИЗ
	         |	РегистрНакопления.ПлановаяПозицияПоЦеннымБумагам КАК ПлановаяПозицияПоЦеннымБумагам
	         |ГДЕ
	         |	(ПлановаяПозицияПоЦеннымБумагам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	         |				И ПлановаяПозицияПоЦеннымБумагам.Сделка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделка.Поступление)
	         |			ИЛИ ПлановаяПозицияПоЦеннымБумагам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	         |				И ПлановаяПозицияПоЦеннымБумагам.Сделка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделка.Продажа))
	         |	И ПлановаяПозицияПоЦеннымБумагам.Период МЕЖДУ &ДатаНачалаПериода И &ДатаОкончанияПериода
	         |	И (ПлановаяПозицияПоЦеннымБумагам.Сделка.Внебиржевая
	         |			ИЛИ ПлановаяПозицияПоЦеннымБумагам.Сделка.КодКласса ПОДОБНО ""%DMA%"")
	         |	&УсловиеОтбораПлановаяПозицияПоЦеннымБумагам";	

КонецФункции // ПолучитьТекстЗапросаИсполнениеСделокВнеБиржДМАНаДату()  //RKatunin IMDEV-3438

#Область СлужебныеПроцедурыИФункции

Функция хдтоВиртуальныйСубпортфельПоиск(сс, ФабрикаСервиса)
	
	хдтоОбъект = ФабрикаСервиса.Создать(ФабрикаСервиса.Тип(ПространствоИменСервиса, "СубпортфельПоиск"));
	
	КодСчета = СокрЛП(сс.КодСчета);
	КодСчета = Лев(КодСчета, СтрДлина(КодСчета) - 3) + "-VI";
	хдтоОбъект.КодСчета = КодСчета;
	
	ГУИД = СокрЛП(сс.УникальныйИдентификатор());
	хдтоОбъект.ВнешнийКод = Лев(ГУИД, СтрДлина(ГУИД) - 3) + "-vi";;
	
	Возврат хдтоОбъект;
КонецФункции

Функция ПолучитьТекстЗапросаДляВиртуальныхСубпортфелей()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(т.СчетМандата КАК Справочник.СчетаМандатов) КАК СчетМандата,
	|	т.ДоходыКПолучению КАК ДоходыКПолучению
	|ПОМЕСТИТЬ втДС
	|ИЗ
	|	&ДС КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.СчетМандата
	|ИЗ
	|	втДС КАК т
	|ГДЕ
	|	т.ДоходыКПолучению = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	т.СчетМандата";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ПроверитьИСоздатьВиртуальныеСубпортфели(Прокси, ФабрикаСервиса, Отказ, тхтОшибки)
	
	//ПакетХДТО = ПроцедурыФункцииОбмена_МО_ФО.хдтоСформироватьПакет(ФабрикаСервиса);
	// IMAPPS-24915 ++
	//СтруктураПакета = Новый Структура("Справочники, Документы, РегистрыСведений, Рейтинг", Ложь, Ложь, Ложь, Ложь);
	СтруктураПакета = Новый Структура("Справочники, Документы, РегистрыСведений, Рейтинг", Истина, Ложь, Ложь, Ложь);
	// IMAPPS-24915 --
	ПакетХДТО = хдтоСформироватьПакет(ФабрикаСервиса, СтруктураПакета);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДС", ДенежныеСредства.Выгрузить());
	Запрос.Текст = ПолучитьТекстЗапросаДляВиртуальныхСубпортфелей();
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПакетПараметрыЗапроса = хдтоСоздатьПакетПараметрыЗапроса(Выборка, ФабрикаСервиса);
	
	Ответ = Прокси.GetDataOnRequest("СуществующиеВиртуальныеСубпортфели", ПакетПараметрыЗапроса);
	
	Рез = ОбработатьОтветЗапроса(Ответ, ФабрикаСервиса, вклОтладка);
	
	Если Рез.ЕстьОшибки Тогда
		ЕстьОшибки = Истина;
		Если ЗначениеЗаполнено(Рез.ТекстОшибки) Тогда
			ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		
		ГУИД = СокрЛП(Выборка.СчетМандата.УникальныйИдентификатор());
		ВнешнийКод = Лев(ГУИД, СтрДлина(ГУИД) - 3) + "-vi";
		
		НайденнаяСтрока = Рез.ТЗ_ФО.Найти(ВнешнийКод, "ВнешнийКод");
		Если НайденнаяСтрока = Неопределено Тогда
			хдтоДобавитьВПакетВиртуальныйСубпортфель(ПакетХДТО, Выборка.СчетМандата, ВнешнийКод, ФабрикаСервиса, Отказ, тхтОшибки);
		КонецЕсли;
	КонецЦикла;
	
	Если вклОтладка Тогда
		обЗапись = новый ЗаписьXML;
		обЗапись.УстановитьСтроку("UTF-8");
		ФабрикаСервиса.ЗаписатьXML(обЗапись, ПакетХДТО);
		ТекстовыйЛог.ДобавитьСтроку(обЗапись.Закрыть());
	КонецЕсли;
	
	Ответ = Прокси.DownloadPosition(ПакетХДТО);
	
	ЕстьОшибкиПортфель = Ложь;
	
	Рез = ПроцедурыФункцииОбмена_МО_ФО.ОбработатьОтвет(Ответ, ФабрикаСервиса, вклОтладка, УзелОбменаДляРегистрацииНенайденных, УзелОбменаДляРегистрацииНенайденныхСчетовМандатов);
	Если Рез.ЕстьОшибки Тогда
		ЕстьОшибки = Истина;
		Если ЗначениеЗаполнено(Рез.ТекстОшибкиСервиса) Тогда
			ДобавитьОшибкуВДанныеДляРассылки(Справочники.Мандаты.ПустаяСсылка(), "При создании виртуальных субпортфелей в ФО возникла ошибка:" + Символы.ПС + Рез.ТекстОшибкиСервиса);
		Иначе
			ТаблицаПортфелейСОшибкой = ПолучитьМандатыПоНенайденнымОбъектамВиртуальныеСубпортфели(Рез);
			
			//IMAPPS-19973++
			ОбработатьОтветДляРассылки(ТаблицаПортфелейСОшибкой);
			//IMAPPS-19973--
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Рез.ТекстОшибки) Тогда
		ТекстовыйЛог.ДобавитьСтроку("Ошибки создания виртуальных субпортфелей");
		ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОшибки);
	КонецЕсли;
	
	Если вклОтладка Тогда
		ТекстовыйЛог.ДобавитьСтроку(Рез.ТекстОтвета);
	КонецЕсли;
	
КонецПроцедуры

Процедура хдтоДобавитьВПакетВиртуальныйСубпортфель(обПакет, сс, ВнешнийКод, ФабрикаСервиса, Отказ, ТекстОшибки) Экспорт
	
	Если Не ЗначениеЗаполнено(сс.КодСчета) Тогда
		Возврат;
	КонецЕсли;
	
	КодСчета = СокрЛП(сс.КодСчета);
	КодСчета = Лев(КодСчета, СтрДлина(КодСчета) - 3) + "-VI";
	
	//сс = Справочники.СчетаМандатов.ПустаяСсылка();
	типСубпортфель	 = ФабрикаСервиса.Тип(ПространствоИменСервиса, "Субпортфель");
	обХДТО = ФабрикаСервиса.Создать(типСубпортфель);
	//обХДТО.НеполноеОбновление = Ложь;
	обХДТО.ВнешнийКод = ВнешнийКод;
	обХДТО.Наименование = КодСчета;
	обХДТО.КодСчета = КодСчета;
	обХДТО.Портфель = ПроцедурыФункцииОбмена_МО_ФО.хдтоПорфельПоиск(сс.Владелец, ФабрикаСервиса);
	обХДТО.Стратегия = ПроцедурыФункцииОбмена_МО_ФО.хдтоСтратегияПоиск(сс.Стратегия, ФабрикаСервиса);
	обХДТО.ТипИнструментовРисков = СокрЛП(сс.Стратегия.ТипИнструментовРисков.Наименование);
	обХДТО.МестоХранения = ПроцедурыФункцииОбмена_МО_ФО.хдтоМестоХраненияПоиск(сс.МестоХранения, ФабрикаСервиса);
	//обХДТО.Пул = ПроцедурыФункцииОбмена_МО_ФО.хдтоПулПоиск(сс.Пул, ФабрикаСервиса);
	обПакет.Справочники.Субпортфели.Добавить(обХДТО);
	
КонецПроцедуры

#Область ФормированиеПакетаXDTO

Функция хдтоСформироватьПакет(ФабрикаСервиса, СтруктураПакета)
		
	обПакет = ФабрикаСервиса.Создать(ФабрикаСервиса.Тип(ПространствоИменСервиса, "Пакет"));
	Если СтруктураПакета.Справочники Тогда
		обПакет.Справочники = ФабрикаСервиса.Создать(обПакет.Свойства().Получить("Справочники").Тип);
	КонецЕсли; 
	Если СтруктураПакета.Документы Тогда
		обПакет.Документы = ФабрикаСервиса.Создать(обПакет.Свойства().Получить("Документы").Тип);
	КонецЕсли;
	Если СтруктураПакета.РегистрыСведений Тогда
		обПакет.РегистрыСведений = ФабрикаСервиса.Создать(обПакет.Свойства().Получить("РегистрыСведений").Тип);
	КонецЕсли;
	Если СтруктураПакета.Рейтинг Тогда
		обПакет.Рейтинг = ФабрикаСервиса.Создать(обПакет.Свойства().Получить("Рейтинг").Тип);
	КонецЕсли;
		
	обПакет.Заголовок = ФабрикаСервиса.Создать(ФабрикаСервиса.Тип(ПространствоИменСервиса, "Заголовок"));
	обПакет.Заголовок.УникальныйИдентификатор = СокрЛП(новый УникальныйИдентификатор());
	обПакет.Заголовок.ДатаВыполнения = ТекущаяДата();
	обПакет.Заголовок.ИдентификаторСистемы = "МО 1.0";
	обПакет.Заголовок.ИмяПользователя = "Сервис";
	ДатаВыгрузки = Неопределено;
	СтруктураПакета.Свойство("ДатаВыгрузки", ДатаВыгрузки);
	обПакет.Заголовок.ДатаВыгрузки = ?(ДатаВыгрузки=Неопределено, ТекущаяДата(), ДатаВыгрузки);
	
	обПакет.ИспользоватьЧастичнуюЗагрузкуПозиции = Истина;
	обПакет.ДоступнаНеПолнаяПозиция = Истина;
	Возврат обПакет;
	
КонецФункции 

Функция хдтоСоздатьПакетПараметрыЗапроса(Выборка, ФабрикаСервиса)
	
	типЗапросУниверсальныхДанных = ФабрикаСервиса.Тип(ПространствоИменСервиса, "ЗапросУниверсальныхДанных");
	обХДТОЗапрос = ФабрикаСервиса.Создать(типЗапросУниверсальныхДанных);
	
	типЗаголовок = ФабрикаСервиса.Тип(ПространствоИменСервиса, "Заголовок");
	обХДТОЗапрос.Заголовок = ФабрикаСервиса.Создать(типЗаголовок);
	обХДТОЗапрос.Заголовок.УникальныйИдентификатор = "333";
	обХДТОЗапрос.Заголовок.ДатаВыполнения = ТекущаяДатаСеанса();
	обХДТОЗапрос.Заголовок.ИдентификаторСистемы = "МО";
	обХДТОЗапрос.Заголовок.ИмяПользователя = "сп";
	
	типПараметры = обХДТОЗапрос.Тип().Свойства.Получить("Параметры").Тип;
	
	//СписокКодовМандатов
	обХДТОПараметры = ФабрикаСервиса.Создать(типПараметры);
	обХДТОПараметры.Ключ = "СписокВнешнихКодов";
	типЗначения = обХДТОПараметры.Тип().Свойства.Получить("Значения").Тип;
	
	Пока Выборка.Следующий() Цикл
		обХДТОЗначения = ФабрикаСервиса.Создать(типЗначения);
		
		ГУИД = СокрЛП(Выборка.СчетМандата.УникальныйИдентификатор());
		ВнешнийКод = Лев(ГУИД, СтрДлина(ГУИД) - 3) + "-vi";
		
		обХДТОЗначения.Значение = ВнешнийКод;
		обХДТОПараметры.Значения.Добавить(обХДТОЗначения);
	КонецЦикла;
	
	обХДТОЗапрос.Параметры.Добавить(обХДТОПараметры);
	
	Возврат обХДТОЗапрос;
	
КонецФункции

#КонецОбласти

Функция ОбработатьОтветЗапроса(ОтветXDTO, ФабрикаСервиса, вклОтладка = Ложь)
	
	ТЗ_ФО = Новый ТаблицаЗначений;
	ТЗ_ФО.Колонки.Добавить("ВнешнийКод", Новый ОписаниеТипов("Строка"));
	
	Результат = Новый Структура("ЕстьОшибки, ТекстОшибки, ТЗ_ФО", Ложь, "", ТЗ_ФО);
	
	Если ОтветXDTO.СтатусОтвета.Код <> 0 тогда
		Результат.ТекстОшибки = "Внутренняя ошибка сервиса: "+ ОтветXDTO.СтатусОтвета.Описание;
		Результат.ЕстьОшибки = Истина;
	КонецЕсли;
	
	Для Каждого хдтоОтвеСообщение Из ОтветXDTO.СтатусОтвета.Сообщения Цикл
		Результат.ТекстОшибки = Результат.ТекстОшибки + Символы.ПС + "СтатусОтвета.Сообщения: "+ ?(хдтоОтвеСообщение.ЭтоОшибка, "err", "inf") + " [" + хдтоОтвеСообщение.Код + "] " + хдтоОтвеСообщение.Описание;
	КонецЦикла;
	
	Для каждого ТекСтрока Из ОтветXDTO.Строка Цикл
		
		НоваяСтрока = ТЗ_ФО.Добавить();
		
		Для Каждого ТекПоказатель Из ТекСтрока.Показатель Цикл
			НоваяСтрока[ТекПоказатель.Имя] = ТекПоказатель.Значение;
		КонецЦикла;
		
	КонецЦикла;
	
	Результат.ТЗ_ФО = ТЗ_ФО;
	
	Если вклОтладка Тогда
		обЗапись = новый ЗаписьXML;
		обЗапись.УстановитьСтроку("UTF-8");
		ФабрикаСервиса.ЗаписатьXML(обЗапись, ОтветXDTO);
		Результат.Вставить("ТекстОтвета", обЗапись.Закрыть());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивМандатовДляОтбора(Отбор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетаМандатов.Владелец КАК Мандат,
		|	СчетаМандатов.Владелец.КодМандата КАК КодМандата
		|ИЗ
		|	Справочник.СчетаМандатов КАК СчетаМандатов
		|ГДЕ
		|	СчетаМандатов.Ссылка В(&СчетаМандатов)";
	
	Запрос.УстановитьПараметр("СчетаМандатов", Отбор.СчетаМандатов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ()

Функция ПолучитьМандатыПоНенайденнымОбъектамФактПоз(Рез, ТаблицаПортфелей, СоответствиеПортфелей);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЦБ", ЦенныеБумаги.Выгрузить());
	Запрос.УстановитьПараметр("ТаблицаПортфелей", ТаблицаПортфелей);
	Запрос.УстановитьПараметр("МассивНенайденныхАктивов", Рез.МассивНенайденныхАктивов);
	Запрос.УстановитьПараметр("МассивНенайденныхСчетовМандатов", Рез.МассивНенайденныхСчетовМандатов);
	Запрос.УстановитьПараметр("МассивНенайденныхКодовКонтрагентов", Рез.МассивНенайденныхКодовКонтрагентов);
	Запрос.УстановитьПараметр("МассивНенайденныхКодовПортфелей", Рез.МассивНенайденныхКодовПортфелей);
	Запрос.УстановитьПараметр("МассивНенайденныхКодовВалюты", Рез.МассивНенайденныхКодовВалюты);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Мандат КАК Мандат,
	|	ВЫРАЗИТЬ(т.Актив КАК Справочник.Активы) КАК Актив
	|ПОМЕСТИТЬ втЦБ
	|ИЗ
	|	&ЦБ КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Мандат КАК Мандат,
	|	т.Колво КАК Колво
	|ПОМЕСТИТЬ втПортфели
	|ИЗ
	|	&ТаблицаПортфелей КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаМандатов.Владелец КАК Мандат,
	|	""Не найден Субпортфель. КодСчета: "" + СчетаМандатов.КодСчета КАК ТекстОшибки
	|ПОМЕСТИТЬ МандатыСОшибками
	|ИЗ
	|	Справочник.СчетаМандатов КАК СчетаМандатов
	|ГДЕ
	|	СчетаМандатов.Ссылка В(&МассивНенайденныхСчетовМандатов)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втЦБ.Мандат,
	|	""Не найден Актив ("" + втЦБ.Актив.Наименование + "") ВнешнийКод: "" + втЦБ.Актив.ВнешнийКод
	|ИЗ
	|	втЦБ КАК втЦБ
	|ГДЕ
	|	втЦБ.Актив В(&МассивНенайденныхАктивов)
	|	И втЦБ.Мандат В
	|			(ВЫБРАТЬ
	|				втПортфели.Мандат
	|			ИЗ
	|				втПортфели КАК втПортфели)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетаМандатов.Владелец,
	|	""Не найден Портфель. КодМандата: "" + СчетаМандатов.Владелец.КодМандата
	|ИЗ
	|	Справочник.СчетаМандатов КАК СчетаМандатов
	|ГДЕ
	|	СчетаМандатов.Владелец.КодМандата В(&МассивНенайденныхКодовПортфелей)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МандатыСОшибками.Мандат,
	|	МандатыСОшибками.ТекстОшибки,
	|	втПортфели.Колво
	|ИЗ
	|	МандатыСОшибками КАК МандатыСОшибками
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПортфели КАК втПортфели
	|		ПО МандатыСОшибками.Мандат = втПортфели.Мандат
	|
	|УПОРЯДОЧИТЬ ПО
	|	МандатыСОшибками.Мандат.Наименование";
	
	ТаблицаПортфелейСОшибкой = Запрос.Выполнить().Выгрузить();
	
	Для каждого ТекСтрока Из ТаблицаПортфелейСОшибкой Цикл
		СоответствиеПортфелей.Вставить(ТекСтрока.Мандат, Истина);
	КонецЦикла;
	
	Возврат ТаблицаПортфелейСОшибкой;
	
КонецФункции

Функция ПолучитьМандатыПоНенайденнымОбъектамВиртуальныеСубпортфели(Рез)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДС", ДенежныеСредства.Выгрузить());
	Запрос.УстановитьПараметр("МассивНенайденныхКодовПортфелей", Рез.МассивНенайденныхКодовПортфелей);
	Запрос.УстановитьПараметр("МассивНенайденныхСчетовМандатов", Рез.МассивНенайденныхСчетовМандатов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(т.СчетМандата КАК Справочник.СчетаМандатов) КАК СчетМандата,
	|	т.ДоходыКПолучению КАК ДоходыКПолучению
	|ПОМЕСТИТЬ втДС
	|ИЗ
	|	&ДС КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.СчетМандата
	|ПОМЕСТИТЬ т
	|ИЗ
	|	втДС КАК т
	|ГДЕ
	|	т.ДоходыКПолучению = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	т.СчетМандата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.СчетМандата.Владелец КАК Мандат,
	|	""Не найден Субпортфель. КодСчета: "" + т.СчетМандата.КодСчета КАК ТекстОшибки
	|ИЗ
	|	т КАК т
	|ГДЕ
	|	т.СчетМандата В(&МассивНенайденныхСчетовМандатов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.СчетМандата.Владелец,
	|	""Не найден Портфель. КодМандата: "" + т.СчетМандата.Владелец.КодМандата
	|ИЗ
	|	т КАК т
	|ГДЕ
	|	т.СчетМандата.Владелец.КодМандата В(&МассивНенайденныхКодовПортфелей)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Мандат";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ()

Процедура ДобавитьОшибкуВДанныеДляРассылки(Мандат, ТекстОшибки, Колво = 0)
	
	СтруктураПоиска = Новый Структура("Мандат", Мандат);
	НайденныеСтроки = ДанныеДляРассылки.ПозицииСОшибкой.НайтиСтроки(СтруктураПоиска);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяЗапись = ДанныеДляРассылки.ПозицииСОшибкой.Добавить();
		НоваяЗапись.Мандат = Мандат;
		НоваяЗапись.Колво = Колво;
		НоваяЗапись.Комментарий = ТекстОшибки;
	Иначе
		НайденнаяСтрока = НайденныеСтроки[0];
		НайденнаяСтрока.Комментарий = НайденнаяСтрока.Комментарий + Символы.ПС + ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

//IMAPPS-19973++

Функция АктивПоВнешнемуКоду(ВнешнийКод)
	
	Если не ЗначениеЗаполнено(ВнешнийКод) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Актив = ДанныеДляРассылки.КэшНайденныхАктивов.Получить(ВнешнийКод);
	
	Если ЗначениеЗаполнено(Актив) Тогда
		Возврат Актив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Активы.Ссылка
	|ИЗ
	|	Справочник.Активы КАК Активы
	|ГДЕ
	|	Активы.ВнешнийКод = &ВнешнийКод";
	
	Запрос.УстановитьПараметр("ВнешнийКод",ВнешнийКод);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДанныеДляРассылки.КэшНайденныхАктивов.Вставить(ВнешнийКод,Выборка.Ссылка);
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОбработатьОтветДляРассылки(ТаблицаПортфелейСОшибками)
	
	//Если не ТипЗнч(ОтветXDTO) = Тип("ОбъектXDTO") Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//СвойстваОтвета = ОтветXDTO.Свойства();
	//
	//Если СвойстваОтвета.Получить("СтатусОтвета") = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ТекстОшибки = "";
	//
	//Если ОтветXDTO.СтатусОтвета.Код <> 0 Тогда
	//	ТекстОшибки = "Внутренняя ошибка сервиса: "+ ОтветXDTO.СтатусОтвета.Описание;
	//КонецЕсли;
	//
	//Для каждого хдтоОтвеСообщение Из ОтветXDTO.СтатусОтвета.Сообщения Цикл
	//	Если не хдтоОтвеСообщение.ЭтоОшибка = "err" Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	ТекстОшибки = ТекстОшибки + Символы.ПС + "СтатусОтвета.Сообщения: "+ " [" + хдтоОтвеСообщение.Код + "] " + хдтоОтвеСообщение.Описание;
	//КонецЦикла;
	//
	//
	//Если не СвойстваОтвета.Получить("НенайденныеЭлементы") = Неопределено и ТипЗнч(ОтветXDTO.НенайденныеЭлементы) = Тип("ОбъектXDTO") Тогда
	//	НенайденныеЭлементы = ОтветXDTO.НенайденныеЭлементы;
	//	СвойстваНенайденныеЭлементы = НенайденныеЭлементы.Свойства();
	//	
	//	Если не СвойстваНенайденныеЭлементы.Получить("Активы") = Неопределено Тогда
	//		НенайденныеЭлементыАктивы = Новый Массив;
	//		Если ТипЗнч(НенайденныеЭлементы.Активы) = Тип("СписокXDTO") Тогда
	//			НенайденныеЭлементыАктивы = НенайденныеЭлементы.Активы;
	//		ИначеЕсли ТипЗнч(НенайденныеЭлементы.Активы) = Тип("ОбъектXDTO") Тогда
	//			НенайденныеЭлементыАктивы.Добавить(НенайденныеЭлементы.Активы);
	//		КонецЕсли;
	//		
	//		Для каждого обПоиск Из НенайденныеЭлементыАктивы Цикл
	//			Если ЗначениеЗаполнено(обПоиск.Актив.ISIN) Тогда
	//				ТекстОшибки = ТекстОшибки + Символы.ПС + "Не найден Актив ("+обПоиск.Актив.Тип+") ISIN: " + обПоиск.Актив.ISIN;
	//			Иначе
	//				Актив = АктивПоВнешнемуКоду(обПоиск.Актив.ВнешнийКод);
	//				Если ЗначениеЗаполнено(Актив) Тогда
	//					ТекстОшибки = ТекстОшибки + Символы.ПС + "Не найден Актив ("+обПоиск.Актив.Тип+"): " + Актив;
	//				Иначе
	//					ТекстОшибки = ТекстОшибки + Символы.ПС + "Не найден Актив ("+обПоиск.Актив.Тип+") ВнешнийКод: " + обПоиск.Актив.ВнешнийКод;
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли;
	//	
	//	Если не СвойстваНенайденныеЭлементы.Получить("Контрагенты") = Неопределено Тогда
	//		НенайденныеЭлементыКонтрагенты = Новый Массив;
	//		Если ТипЗнч(НенайденныеЭлементы.Контрагенты) = Тип("СписокXDTO") Тогда
	//			НенайденныеЭлементыКонтрагенты = НенайденныеЭлементы.Контрагенты;
	//		ИначеЕсли ТипЗнч(НенайденныеЭлементы.Контрагенты) = Тип("ОбъектXDTO") Тогда
	//			НенайденныеЭлементыКонтрагенты.Добавить(НенайденныеЭлементы.Контрагенты);
	//		КонецЕсли;
	//	
	//		Для каждого обПоиск Из НенайденныеЭлементыКонтрагенты Цикл
	//			ТекстОшибки = ТекстОшибки + Символы.ПС + "Не найден Контрагент. ИНН: " + обПоиск.Контрагент.ИНН;
	//		КонецЦикла;
	//	КонецЕсли;
	//	
	//	Если не СвойстваНенайденныеЭлементы.Получить("Портфели") = Неопределено Тогда
	//		НенайденныеЭлементыПортфели = Новый Массив;
	//		Если ТипЗнч(НенайденныеЭлементы.Портфели) = Тип("СписокXDTO") Тогда
	//			НенайденныеЭлементыПортфели = НенайденныеЭлементы.Портфели;
	//		ИначеЕсли ТипЗнч(НенайденныеЭлементы.Портфели) = Тип("ОбъектXDTO") Тогда
	//			НенайденныеЭлементыПортфели.Добавить(НенайденныеЭлементы.Портфели);
	//		КонецЕсли;
	//		
	//		
	//		Для каждого обПоиск Из НенайденныеЭлементыПортфели Цикл
	//			ТекстОшибки = ТекстОшибки + Символы.ПС + "Не найден Портфель. НомерДоговора: " + обПоиск.Портфель.НомерДоговора;
	//		КонецЦикла;
	//	КонецЕсли;
	//	
	//	Если не СвойстваНенайденныеЭлементы.Получить("Субпортфели") = Неопределено Тогда
	//		НенайденныеЭлементыСубпортфели = Новый Массив;
	//		Если ТипЗнч(НенайденныеЭлементы.Субпортфели) = Тип("СписокXDTO") Тогда
	//			НенайденныеЭлементыСубпортфели = НенайденныеЭлементы.Субпортфели;
	//		ИначеЕсли ТипЗнч(НенайденныеЭлементы.Субпортфели) = Тип("ОбъектXDTO") Тогда
	//			НенайденныеЭлементыСубпортфели.Добавить(НенайденныеЭлементы.Субпортфели);
	//		КонецЕсли;
	//		
	//		
	//		Для каждого обПоиск Из НенайденныеЭлементыСубпортфели Цикл
	//			ТекстОшибки = ТекстОшибки + Символы.ПС + "Не найден Субпортфель. КодСчета: " + обПоиск.Субпортфель.КодСчета;
	//		КонецЦикла;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	//Если не СвойстваОтвета.Получить("ОшибкиЗагрузки") = Неопределено и ТипЗнч(ОтветXDTO.ОшибкиЗагрузки) = Тип("ОбъектXDTO") Тогда
	//	СвойстваОшибкиЗагрузки = ОтветXDTO.ОшибкиЗагрузки.Свойства();
	//	СвойстваОшибкиЗагрузки.Свойство("Документы");
	//КонецЕсли;
	
	//Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		Для каждого ТекСтрока Из ТаблицаПортфелейСОшибками Цикл
			ДобавитьОшибкуВДанныеДляРассылки(ТекСтрока.Мандат, ТекСтрока.ТекстОшибки);
		КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры

Функция ПропискаРассылки(Знач НомерРассылки)
	Перем ПараметрыПодключения, ИмяИБ;
	
	Попытка
		ПараметрыПодключения = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПодключенияИзСтрокиСоединенияИнформационнойБазы(СтрокаСоединенияИнформационнойБазы());
		ИмяИБ = ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия;
	Исключение
	КонецПопытки;
	
	Прописка = " {" + НомерРассылки + ", ib: " + ?(ЗначениеЗаполнено(ИмяИБ), ИмяИБ, "< .. >") + "}";
	
	Возврат Прописка;
КонецФункции // ПропискаРассылки()

Процедура РассылкаСообщения(Знач ТемаСообщения, Знач ТекстСообщения, Знач ЕстьОшибки, Знач ЕстьИсключение)
	
	Если СписокРассылки.Количество() > 0 и НЕ УчетнаяЗаписьПочты.Пустая() тогда
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста, Важность");
		ПараметрыПисьма.Тема = ?(ЕстьИсключение, "{FAIL} ", ?(ЕстьОшибки, "{WARN} ", "{OK} ")) + ТемаСообщения + ПропискаРассылки("r179");
		ПараметрыПисьма.Важность = ?(ЕстьОшибки ИЛИ ЕстьИсключение, ВажностьИнтернетПочтовогоСообщения.Высокая, ВажностьИнтернетПочтовогоСообщения.Обычная);
		
		Кому = Новый Массив;
		Для каждого ТекЯщик из СписокРассылки Цикл
			Кому.Добавить(Новый Структура("Адрес,Представление", ТекЯщик.Адрес, ТекЯщик.Представление));
		КонецЦикла;
		
		ТекстСообщения = "Загрузка произведена по адресу: " + АдресWS + Символы.ПС + Символы.ПС + ТекстСообщения;
		
		ПараметрыПисьма.Кому = Кому;
		ПараметрыПисьма.ТипТекста = "HTML";
		ПараметрыПисьма.Тело = ТекстHTMLСОшибками(ТекстСообщения);
		//ПараметрыПисьма.Тело = ТекстСообщения;
		
		Попытка
			РаботаСПочтовымиСообщениями.ОтправитьСообщение(УчетнаяЗаписьПочты, ПараметрыПисьма);
			текстРассылки = "Рассылка завершена";
		Исключение
			текстРассылки = "Рассылка не удалась: "; 
			Сообщения = ПолучитьСообщенияПользователю(Истина);
			Для Каждого Элемент из Сообщения Цикл
				текстРассылки = текстРассылки + Символы.ПС + Элемент.Текст;
			КонецЦикла;
		КонецПопытки;
		Сообщить(текстРассылки);
		
	КонецЕсли;
	
КонецПроцедуры	

Функция ТекстHTMLСОшибками(ТекстСообщения)
	
	Х =	"";
	Х =	Х + "<html><head><meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" /></head>"+
	"<body style=""font-family:Arial, Helvetica, sans-serif;color:black;"">"+
	"<b>"+ ТекстСообщения +"</b><br/><br/>";
	
	Х = Х + "<b>" + "Всего загружено данных по Портфелям: " + ДанныеДляРассылки.КоличествоПортфелей + "</b><br/>";
	Х = Х + "<b>" + "Всего фактических позиций: " + ДанныеДляРассылки.КоличествоФактическихПозиций + "</b><br/>";
	Х = Х + "<b>" + "Позиций с ошибками: " + ДанныеДляРассылки.КоличествоОшибок + "</b><br/><br/>";
	
	Если ДанныеДляРассылки.ПозицииСОшибкой.Количество() Тогда
		
		//Заголовки
		Х =	Х + "<table BORDERCOLOR=""Black"" border-style= ""solid"" border-collapse =""collapse"" border=""1""><tr>" + Символы.ПС;
		Для каждого Колонка Из ДанныеДляРассылки.ПозицииСОшибкой.Колонки Цикл
			Х =	Х + "<th align=""center"" bgcolor=""#C0C0C0"">" + Колонка.Заголовок + "</th>" + Символы.ПС;
		КонецЦикла;
		Х =	Х + "</tr>" + Символы.ПС;
		
		//Строки
		Для каждого Строка Из ДанныеДляРассылки.ПозицииСОшибкой Цикл
			Х =	Х + "<tr>" + Символы.ПС;
			Для каждого Колонка Из ДанныеДляРассылки.ПозицииСОшибкой.Колонки Цикл
				Значение = Строка(Строка[Колонка.Имя]);
				Значение = СтрЗаменить(Значение, Символы.ПС, "<br/>");
				Х =	Х + "<td>"+ Значение +"</td>" + Символы.ПС;
			КонецЦикла;
		    Х =	Х + "</tr>"+Символы.ПС;
		КонецЦикла;
		
		Х =	Х + "</table>" + Символы.ПС;
	КонецЕсли;
	
	Х =	Х + "</body></html>";
	
	
	
	Возврат Х;
КонецФункции

//IMAPPS-19973--

#КонецОбласти

ПространствоИменСервиса = "http://avancore.ru/xsd";
ЕстьОшибки = Ложь;
МассивФайлов = Новый Массив;
МассивОбработанныхОбъектов = Новый Массив;
ФоновоеЗадание = Ложь;
ОписаниеОшибки = "";
КешБазыПИФ = Новый Соответствие;
вклОтладка = Ложь;

ПроцедурыФункцииОбмена_МО_ФО = Обработки.внПроцедурыИФункцииОбменаСФронтОфис.Создать();
ВыгружатьАктивыСчета = Ложь;

//IMAPPS-19973++
ДанныеДляРассылки = Новый Структура;


ДанныеДляРассылки.Вставить("ПозицииСОшибкой",Новый ТаблицаЗначений);
ДанныеДляРассылки.ПозицииСОшибкой.Колонки.Добавить("Мандат",			Новый ОписаниеТипов("СправочникСсылка.Мандаты"),	"Мандат");
ДанныеДляРассылки.ПозицииСОшибкой.Колонки.Добавить("Колво",				Новый ОписаниеТипов("Число"),						"Количество");
ДанныеДляРассылки.ПозицииСОшибкой.Колонки.Добавить("Комментарий",		Новый ОписаниеТипов("Строка"),						"Комментарий");

ДанныеДляРассылки.Вставить("КэшНайденныхАктивов", Новый Соответствие);
ДанныеДляРассылки.Вставить("КоличествоПортфелей", 0);
ДанныеДляРассылки.Вставить("КоличествоФактическихПозиций", 0);
ДанныеДляРассылки.Вставить("КоличествоОшибок", 0);

//IMAPPS-19973--
