Перем RegExp;
Перем СвойствоНРДid;

Процедура ПриОткрытии()
	
	СписокФорматФайла = Новый СписокЗначений;
	СписокФорматФайла.Добавить(1, "Формат от 22.06.21");
	СписокФорматФайла.Добавить(2, "Формат от 06.10.21");

	ФлСоздаватьКонрагентов = Истина;
	ФлСоздаватьЛицевыеСчета = Истина;
	МножитьЛицСчета  = Истина;
	
	ГруппаПайщики = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("8c127f32-5efa-11e2-b4e9-005056b100ec"));
	
	ЭлементыФормы.ТППустойКонтрагент.Видимость = Ложь;
	ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНенайденныхКонтрагентов.Пометка = Ложь;
	ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНезаполненДР.Пометка = Ложь;
	ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНезаполненныеДублиЛС.Пометка = Ложь;
	ДатаНачМес = НачалоМесяца(ТекущаяДата());
	ДатаДок = КалендарныеГрафики.ПолучитьСледующуюРабочуюДату(, ДатаНачМес, -1)+64800; 
	ДатаИсторическихЗначений = ПоследнийРабочийДеньПредыдущегоМесяца();
	ДатаОткрытияСчета = ПоследнийРабочийДеньПредыдущегоМесяца();
	
	ЭлементыФормы.МножитьЛицСчета.Доступность = ФлСоздаватьЛицевыеСчета;
	
КонецПроцедуры

Функция ПоследнийРабочийДеньПредыдущегоМесяца()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(Календарь.Дата) КАК Дата
		|ИЗ
		|	РегистрСведений.Календарь КАК Календарь
		|ГДЕ
		|	Календарь.Дата < НАЧАЛОПЕРИОДА(&ДатаГрафика, МЕСЯЦ)
		|	И Календарь.РабочийДень";
	
	Запрос.УстановитьПараметр("ДатаГрафика", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.Дата;
	КонецЕсли;
	
	Возврат ТекущаяДата();

КонецФункции // ПоследнийРабочийДеньПредыдущегоМесяца()

Процедура ИмяФайлаНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	// Создаем диалог выбора файла и указываем для чего он будет использоваться
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файл раскрытия владельцев паёв (*.xml;*.xls;*.xlsx)|*.xml;*.xls;*.xlsx";
	Диалог.Заголовок = НСтр("ru=
Выберите файл XML'");
	Если Диалог.Выбрать() Тогда
	    ИмяФайла = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьФайлКоманда(Кнопка)

	Если ФорматГарант=0 Тогда
		ПрочитатьФайлГарантExcel();
	ИначеЕсли ФорматГарант=1 Тогда
		ПрочитатьФайл();
	ИначеЕсли ФорматГарант=2 Тогда
		ПрочитатьФайлЦДФ();
	ИначеЕсли ФорматГарант=3 Тогда
		ПрочитатьФайлГарантExcelNew();
	Иначе
		Предупреждение("Выберите формат файла.");
	КонецЕсли;
	
КонецПроцедуры

//&НаСервере
Функция СтрокиПустойДублиЛС()

	МассивСтрокЛС = ТП.НайтиСтроки(Новый Структура("ЛицевойСчет", Справочники.ЛицевыеСчетаПайщиков.ПустаяСсылка()));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТП.НомСтрФайл КАК НомСтрФайл,
		|	ТП.Контрагент КАК Контрагент,
		|	ВЫРАЗИТЬ(ТП.ДокументЮЛФЛ КАК СТРОКА(256)) КАК ДокументЮЛФЛ,
		|	ТП.ЛицевойСчет КАК ЛицевойСчет
		|ПОМЕСТИТЬ ВТ_ТП
		|ИЗ
		|	&ТП КАК ТП
		|ГДЕ
		|	ТП.ЛицевойСчет <> ЗНАЧЕНИЕ(Справочник.ЛицевыеСчетаПайщиков.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ТП.НомСтрФайл КАК НомСтрФайл,
		|	ВТ_ТП.Контрагент КАК Контрагент,
		|	ВТ_ТП.ДокументЮЛФЛ КАК ДокументЮЛФЛ,
		|	ВТ_ТП.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТ_ТП1.НомСтрФайл КАК НомСтрФайл1,
		|	ВТ_ТП1.Контрагент КАК Контрагент1,
		|	ВТ_ТП1.ДокументЮЛФЛ КАК ДокументЮЛФЛ1,
		|	ВТ_ТП1.ЛицевойСчет КАК ЛицевойСчет1
		|ИЗ
		|	ВТ_ТП КАК ВТ_ТП
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТП КАК ВТ_ТП1
		|		ПО ВТ_ТП.НомСтрФайл <> ВТ_ТП1.НомСтрФайл
		|			И ВТ_ТП.ЛицевойСчет = ВТ_ТП1.ЛицевойСчет";
	
	Запрос.УстановитьПараметр("ТП", ТП);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивСтрокЛСДубли = ТП.НайтиСтроки(Новый Структура("НомСтрФайл, Контрагент, ДокументЮЛФЛ, ЛицевойСчет", ВыборкаДетальныеЗаписи.НомСтрФайл, ВыборкаДетальныеЗаписи.Контрагент, СокрЛП(ВыборкаДетальныеЗаписи.ДокументЮЛФЛ), ВыборкаДетальныеЗаписи.ЛицевойСчет));
		
		Если МассивСтрокЛС.Найти(МассивСтрокЛСДубли[0])=Неопределено Тогда
			МассивСтрокЛС.Добавить(МассивСтрокЛСДубли[0]);
		КонецЕсли;
		
		МассивСтрокЛСДубли = ТП.НайтиСтроки(Новый Структура("НомСтрФайл, Контрагент, ДокументЮЛФЛ, ЛицевойСчет", ВыборкаДетальныеЗаписи.НомСтрФайл1, ВыборкаДетальныеЗаписи.Контрагент1, СокрЛП(ВыборкаДетальныеЗаписи.ДокументЮЛФЛ1), ВыборкаДетальныеЗаписи.ЛицевойСчет1));
		Если МассивСтрокЛС.Найти(МассивСтрокЛСДубли[0])=Неопределено Тогда
			МассивСтрокЛС.Добавить(МассивСтрокЛСДубли[0]);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивСтрокЛС;

КонецФункции // СтрокиПустойДублиЛС()

Функция ОтделитьЦифры(Знач СтрЦифры)
	
	СтрЦифрыВозврат = "";
	ДлЦикл = СтрДлина(СтрЦифры);
	Цифра = Лев(СтрЦифры, 1);
	Пока СтрНайти("1234567890", Цифра) Цикл
		СтрЦифрыВозврат = СтрЦифрыВозврат + Цифра;		
		ДлЦифра = СтрДлина(СтрЦифры);
		СтрЦифры = Прав(СтрЦифры, ДлЦифра-1); 
		Цифра = Лев(СтрЦифры, 1);
	КонецЦикла;
	
	Возврат СтрЦифрыВозврат;
	
КонецФункции

Функция ВыделитьСлово(ИсходнаяСтрока)
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");
	
	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции // ВыделитьСлово()

Процедура СоздатьИсториюФИО(ФизЛицо, Фамилия, Имя, Отчество)

	ЗаписьФИО = РегистрыСведений.ФИОФизЛиц.СоздатьМенеджерЗаписи();
	ЗаписьФИО.Период = ДатаИсторическихЗначений;//НачалоДня(ТекущаяДата());
	ЗаписьФИО.ФизЛицо = ФизЛицо;
	ЗаписьФИО.Фамилия = Фамилия;
	ЗаписьФИО.Имя = Имя;
	ЗаписьФИО.Отчество = Отчество;
	ЗаписьФИО.Записать();

КонецПроцедуры

Процедура СоздатьПаспорт(Контрагент, НомерПаспорт, СерияПаспорт, ДокументЮЛФЛ, ФлГрФР, ИдентСтроки)

	//Паспорт гражданина РФ 45 18
 652457 выдан 21.05.2018г. ГУ МВД РОССИИ ПО Г.МОСКВЕ кп 770-002	
	//Паспорт гражданина РФ 40 02
 410118 выдан 18.04.2002г. 3 Отделом Милиции Калининского района Санкт-Петербурга
	//Паспортиностранного гражданина -
 C4YJHXTZ6 выдан 23.02.2021г. Генеральное консульство Екатеринбурга
	//Паспорт иностранного гражданина -
 C752YWFZV выдан 04.12.2018г. ГОРОД КЁЛЬН
			//Паспорт иностранного гражданина -
 C4YJHXTZ6 выдан 23.02.2021г. Генеральное консульство Екатеринбурга
			//Паспорт иностранного гражданина -
 C4YJHXTZ6 выдан 23.02.2021г. Генеральное консульство Екатеринбурга
			//Паспорт иностранного гражданина -
 C752YWFZV выдан 04.12.2018г. ГОРОД КЁЛЬН
			//Паспорт иностранного гражданина -
 MC2976866 выдан 05.09.2017г. Минское РУВД Минской области
			//Паспорт иностранного гражданина -
 MC 2976866 выдан 05.09.2017г. Минское РУВД Минской области
			//Паспорт иностранного гражданина -
 АВ2560102 выдан 03.05.2012г. Пинский ГОВД Брестской области
			//Паспорт иностранного гражданина 0000
 AA0102665 выдан 22.10.2014г. ГП "ЦГИР "РЕДЖИСТРУ"
			//Паспорт иностранного гражданина KB
 2138142 выдан 11.09.2015г. ОКТЯБРЬСКИЙ РОВД Г. МОГИЛЁВА
	ЗаписьПаспорт = РегистрыСведений.ПаспортныеДанныеФизЛиц.СоздатьМенеджерЗаписи();
	ЗаписьПаспорт.Период = ДатаИсторическихЗначений;//НачалоДня(ТекущаяДата());
	ЗаписьПаспорт.ФизЛицо = Контрагент;  
	
	
	Если ТипЗнч(ДокументЮЛФЛ)=Тип("Структура") Тогда
	
		//КемВыдан, ТипДок, НомерПаспорт, СерияПаспорт, ДатаВыдачи
		Если ДокументЮЛФЛ.ТипДок="21" Тогда
			ЗаписьПаспорт.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПаспортРФ; 
			ЗаписьПаспорт.Гражданство = Справочники.КлассификаторСтранМира.Россия;
		ИначеЕсли ДокументЮЛФЛ.ТипДок="10" Тогда 
		 	ЗаписьПаспорт.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПаспортИностранногоГражданина; 
			ЗаписьПаспорт.Гражданство = Справочники.КлассификаторСтранМира.НайтиПоКоду("203"); 	
		ИначеЕсли ДокументЮЛФЛ.ТипДок="12" Тогда 
			ЗаписьПаспорт.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ВидНаЖительство;
			ЗаписьПаспорт.Гражданство = Справочники.КлассификаторСтранМира.НайтиПоКоду("203"); 				
		КонецЕсли;
        
		Если ПустаяСтрока(СокрЛП(ДокументЮЛФЛ.СерияПаспорт)) И ДокументЮЛФЛ.ТипДок="21" Тогда
			Если Не ПустаяСтрока(СокрЛП(ДокументЮЛФЛ.НомерПаспорт)) Тогда                  
				Если СтрДлина(ДокументЮЛФЛ.НомерПаспорт)>=10 Тогда  		    			
					ЗаписьПаспорт.ДокументСерия = Лев(СтрЗаменить(ДокументЮЛФЛ.НомерПаспорт, " ", ""), 4);
			    	ЗаписьПаспорт.ДокументНомер = Прав(СтрЗаменить(ДокументЮЛФЛ.НомерПаспорт, " ", ""), 6);		
			    КонецЕсли;	
	
			КонецЕсли;
			
		Иначе
			ЗаписьПаспорт.ДокументСерия = ДокументЮЛФЛ.СерияПаспорт;
			ЗаписьПаспорт.ДокументНомер = ДокументЮЛФЛ.НомерПаспорт;
			
	    КонецЕсли;
		
		
		
        ЗаписьПаспорт.ДокументДатаВыдачи = ДокументЮЛФЛ.ДатаВыдачи;
		ЗаписьПаспорт.ДокументКемВыдан = ДокументЮЛФЛ.КемВыдан;
	
	Иначе
	
		Если ФлГрФР Тогда
			ЗаписьПаспорт.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПаспортРФ;
		Иначе
			Возврат;
			ЗаписьПаспорт.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПаспортИностранногоГражданина;
		КонецЕсли;
		
		ЗаписьПаспорт.ДокументСерия = СтрЗаменить(СерияПаспорт, " ", "");
		ЗаписьПаспорт.ДокументНомер = СтрЗаменить(НомерПаспорт, " ", "");
		Если ФлГрФР Тогда
			//ДокументДатаВыдачи = Сред(ДокументЮЛФЛ, 44, 10);	
			//Год = Прав(ДокументДатаВыдачи, 4);
			//Месяц = Сред(ДокументДатаВыдачи, 4, 2);
			//День = Лев(ДокументДатаВыдачи, 2); 
			//ЗаписьПаспорт.ДокументДатаВыдачи = Дата(Год, Месяц, День);
			ЗаписьПаспорт.ДокументДатаВыдачи = ДатаRegExp(ДокументЮЛФЛ, ИдентСтроки, "Даты выдачи паспорта");
			ЗаписьПаспорт.ДокументКемВыдан = Прав(ДокументЮЛФЛ, СтрДлина(ДокументЮЛФЛ)-56); 
			ЗаписьПаспорт.Гражданство = Справочники.КлассификаторСтранМира.Россия;
		Иначе 
			ДокументЮЛФЛСокр = СтрЗаменить(ДокументЮЛФЛ, " ", "");
			Если СтрНайти(ДокументЮЛФЛСокр , "Паспортиностранногогражданина-
") Тогда
				Если СтрНайти(ДокументЮЛФЛСокр , "MC 2976866") Тогда
					ЗаписьПаспорт.ДокументДатаВыдачи = Сред(ДокументЮЛФЛ, 54, 10);
					ЗаписьПаспорт.ДокументКемВыдан = Прав(ДокументЮЛФЛ, СтрДлина(ДокументЮЛФЛ)-66); 
					ЗаписьПаспорт.Гражданство = Справочники.КлассификаторСтранМира.НайтиПоКоду("112");
				Иначе	
					ЗаписьПаспорт.ДокументДатаВыдачи = Сред(ДокументЮЛФЛ, 44, 10);
					ЗаписьПаспорт.ДокументКемВыдан = Прав(ДокументЮЛФЛ, СтрДлина(ДокументЮЛФЛ)-57); 
				КонецЕсли;	
			ИначеЕсли СтрНайти(ДокументЮЛФЛСокр , "Паспортиностранногогражданина0000
") Тогда
					
				ЗаписьПаспорт.ДокументДатаВыдачи = Сред(ДокументЮЛФЛ, 56, 10);
				ЗаписьПаспорт.ДокументКемВыдан = Прав(ДокументЮЛФЛ, СтрДлина(ДокументЮЛФЛ)-68); 
			ИначеЕсли СтрНайти(ДокументЮЛФЛСокр , "ПаспортиностранногогражданинаKB
") Тогда
			
				ЗаписьПаспорт.ДокументДатаВыдачи = Сред(ДокументЮЛФЛ, 44, 10);
				ЗаписьПаспорт.ДокументКемВыдан = Прав(ДокументЮЛФЛ, СтрДлина(ДокументЮЛФЛ)-57); 
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;

	//ЗаписьПаспорт.ДокументКодПодразделения
	Попытка
	    
		ЗаписьПаспорт.Записать();
	
	Исключение
	
	КонецПопытки;
		
КонецПроцедуры

Функция ЗаполнитьВнешнийIDДляЛК()
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("Справочник.Контрагенты");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ВнешнийIDДляЛК", Новый Диапазон(1, Неопределено));
		
	БлокировкаДанных.Заблокировать();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.ВнешнийIDДляЛК КАК ВнешнийIDДляЛК
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ВнешнийIDДляЛК >= &НачальныйНомерIDДляЛК
		|	И НЕ Контрагенты.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВнешнийIDДляЛК УБЫВ";
			
	НачальныйНомерIDДляЛК = ПолныеПрава.ПараметрСеанса("НачальныйНомерIDДляЛК");						
	Запрос.УстановитьПараметр("НачальныйНомерIDДляЛК", НачальныйНомерIDДляЛК); 			
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
		
	МаксимальныйВнешнийIDДляЛК = Выборка.ВнешнийIDДляЛК;
	
	Если ЗначениеЗаполнено(МаксимальныйВнешнийIDДляЛК) Тогда
		ВнешнийIDДляЛК = МаксимальныйВнешнийIDДляЛК + 1;
	Иначе			
		ВнешнийIDДляЛК = НачальныйНомерIDДляЛК; 
	КонецЕсли;
	
	Возврат ВнешнийIDДляЛК;
	
КонецФункции

Процедура ЗаписатьАдресКонрагентаНаСервере(Ссылка, СтрокаАдрес, ТипПочтФакт, Отказ)
	
	Дата = ТекущаяДата();                                
	
	Если ТипПочтФакт="Почтовый" Тогда 
		Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	ИначеЕсли ТипПочтФакт="Фактический" Тогда                           
		Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	ИначеЕсли ТипПочтФакт="ЭлектронныйАдрес" Тогда   
		Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагента;
	КонецЕсли;
	
	НаборЗаписейИсторииИзмененийКИ = РегистрыСведений.ИсторияИзмененияКонтактнойИнформации.СрезПоследних(Дата, Новый Структура("Объект", Ссылка));
	НаборЗаписейРеглПредставлениеАдресаВБазе = РегистрыСведений.ПредставлениеАдресаДляРегламентнойОтчетности.СрезПоследних(Дата, Новый Структура("Контрагент", Ссылка));
	
	НаборЗаписей = РегистрыСведений.ИсторияИзмененияКонтактнойИнформации.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ДатаИсторическихЗначений);
	НаборЗаписей.Отбор.Объект.Установить(Ссылка);
	НаборЗаписей.Отбор.Тип.Установить(Тип);
	НаборЗаписей.Отбор.Вид.Установить(Вид);
	
	НаборЗаписейРеглПредставлениеАдреса = РегистрыСведений.ПредставлениеАдресаДляРегламентнойОтчетности.СоздатьНаборЗаписей();
	НаборЗаписейРеглПредставлениеАдреса.Отбор.Период.Установить(ДатаИсторическихЗначений);
	НаборЗаписейРеглПредставлениеАдреса.Отбор.Контрагент.Установить(Ссылка);
	НаборЗаписейРеглПредставлениеАдреса.Отбор.ВидАдреса.Установить(Вид);
			
	Запись = НаборЗаписей.Добавить();
			
	Запись.Объект = Ссылка; 
	Запись.Тип = Тип;   
	Запись.Вид = Вид; 
    Запись.Период = ДатаИсторическихЗначений;
	Запись.Представление = СтрокаАдрес;
	Запись.АдресРазобран = Ложь;
	
	Запись = НаборЗаписейРеглПредставлениеАдреса.Добавить();
				
	Запись.Контрагент = Ссылка; 
	Запись.Период = ДатаИсторическихЗначений;
	Запись.Представление = СтрокаАдрес;
	Запись.ВидАдреса = Вид;
				
	//Попытка
		НаборЗаписей.Записать();
		НаборЗаписейРеглПредставлениеАдреса.Записать();
	//Исключение
	//	ТекстОшибки = ОписаниеОшибки();
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные не были записаны по причине: " + ТекстОшибки);
	//	Отказ = Истина;
	//КонецПопытки;
	//
КонецПроцедуры

Процедура ЗаписатьФИО(Контрагент, Фамилия, Имя, Отчество)
	
	ФИОСрез = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(,Новый Структура("ФизЛицо",Контрагент));
	
	СтрокаСреза = ФИОСрез.Фамилия + ФИОСрез.Имя + ФИОСрез.Отчество;
	
	Если СтрокаСреза <> (Фамилия + Имя + Отчество) Тогда
		
		МенеджерЗаписи = РегистрыСведений.ФИОФизЛиц.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ФизЛицо 	= Контрагент;
		МенеджерЗаписи.Период 	= ДатаИсторическихЗначений;//НачалоДня(ОбщегоНазначения.ПолучитьРабочуюДату());
		
		МенеджерЗаписи.Фамилия 	= Фамилия;                               
		МенеджерЗаписи.Имя 		= Имя;
		МенеджерЗаписи.Отчество = Отчество;
		
		МенеджерЗаписи.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьНРДid(Контрагент, НРДid);
	
	Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(НРДid) Тогда
		
		МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Объект 	= Контрагент;
		МенеджерЗаписи.Свойство = СвойствоНРДid;
		МенеджерЗаписи.Значение = НРДid;
		
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНРДidКонтрагента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Свойство
	|	И ЗначенияСвойствОбъектов.Объект = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Свойство", СвойствоНРДid);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Значение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ПолучитьКонтрагентаПоНРДid(НРДid)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Контрагент
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Свойство
	|	И ЗначенияСвойствОбъектов.Значение = &Значение";
	
	Запрос.УстановитьПараметр("Значение", НРДid);
	Запрос.УстановитьПараметр("Свойство", СвойствоНРДid);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Контрагент;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция СоздатьКонтрагента(ФИО, ДатаРождения, ИНН, НомерПаспорт, СерияПаспорт, ДокументЮЛФЛ, ФактАдрес, ПочтАдрес, ЭлектронныйАдрес, Страна, ИдентСтроки, НРДid = "")

	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);

	НовКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();	
	
	ФИОЗнач = ФИО;
	Фамилия  = ВыделитьСлово(ФИОЗнач);
	Имя      = ВыделитьСлово(ФИОЗнач);
	Отчество = СокрЛП(ФИОЗнач);
	НовКонтрагент.НаименованиеПолное = Фамилия + " " + Имя + " " + Отчество;  
	НовКонтрагент.Наименование = Фамилия + " " + Лев(Имя, 1) + "." + Лев(Отчество, 1) + ". " + СтрЗаменить(СерияПаспорт, " ", "") + " " + НомерПаспорт;
	НовКонтрагент.Родитель = ГруппаПайщики;	 
	
	НовКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
	НовКонтрагент.Пайщик = Истина;
	НовКонтрагент.ДатаРождения = ДатаРождения;
	НовКонтрагент.ИНН = ИНН;
	НовКонтрагент.ВнешнийIDДляЛК = ЗаполнитьВнешнийIDДляЛК();
	НовКонтрагент.Страна = Страна;

	НовКонтрагент.ОбменДанными.Загрузка = Истина;
	НовКонтрагент.Записать();
	КонтрагентСсылка = НовКонтрагент.Ссылка;
	
	СоздатьИсториюФИО(КонтрагентСсылка, Фамилия, Имя, Отчество); 
	Если Тип("Структура")=ТипЗнч(ДокументЮЛФЛ) Тогда
		СоздатьПаспорт(КонтрагентСсылка, НомерПаспорт, СерияПаспорт, ДокументЮЛФЛ, Истина, ИдентСтроки);	
		Если ДокументЮЛФЛ.ТипДок="12" Или ДокументЮЛФЛ.ТипДок="10" Тогда
			НовКонтрагент.НеРезидент = Истина;		
		КонецЕсли;
	Иначе	
		Если СтрНайти(ДокументЮЛФЛ, "Паспорт гражданина РФ") Тогда
			СоздатьПаспорт(КонтрагентСсылка, НомерПаспорт, СерияПаспорт, ДокументЮЛФЛ, Истина, ИдентСтроки);
		ИначеЕсли СтрНайти(ДокументЮЛФЛ, "Паспорт иностранного гражданина") Тогда
			НовКонтрагент.НеРезидент = Истина;
			СоздатьПаспорт(КонтрагентСсылка, НомерПаспорт, СерияПаспорт, ДокументЮЛФЛ, Ложь, ИдентСтроки);
		КонецЕсли;
	КонецЕсли;
	
	НаборЗаписейПаспорт = РегистрыСведений.ПаспортныеДанныеФизЛиц.СоздатьНаборЗаписей();
	НаборЗаписейПаспорт.Отбор.ФизЛицо.Установить(КонтрагентСсылка);
	НаборЗаписейПаспорт.Прочитать();
	УдостоверениеЛичности = ПаспортныеДанныеФизЛицКлиентСервер.СформироватьСтрокуУдостоверениеЛичности(НаборЗаписейПаспорт);
	НовКонтрагент.ДокументУдостоверяющийЛичность = УдостоверениеЛичности;
	НовКонтрагент.ОбменДанными.Загрузка = Истина;
	НовКонтрагент.Записать();
	
	ЗаписатьАдресКонрагентаНаСервере(КонтрагентСсылка, ФактАдрес, "Фактический", Ложь);
	ЗаписатьАдресКонрагентаНаСервере(КонтрагентСсылка, ПочтАдрес, "Почтовый", Ложь);
	Если Не  ПустаяСтрока(ЭлектронныйАдрес) Тогда
		ЗаписатьАдресКонрагентаНаСервере(КонтрагентСсылка, ЭлектронныйАдрес, "ЭлектронныйАдрес", Ложь);
	КонецЕсли;
                                                                                                               
	ДатаСинхронизацииРегистров = ДатаИсторическихЗначений;//ТекущаяДата();
	Справочники.Контрагенты.СинхронизацияСохраняемыхРеквизитов(НовКонтрагент.Ссылка, ДатаСинхронизацииРегистров, "");
	
	ЗаписатьФИО(КонтрагентСсылка, Фамилия, Имя, Отчество);
	
	ЗаписатьНРДid(КонтрагентСсылка, НРДid);
	
	ЗафиксироватьТранзакцию(); 
	
	Сообщить("Создан контрагент - " + КонтрагентСсылка);  //IMAPPS-36530
	
	Возврат КонтрагентСсылка;	

КонецФункции // СоздатьКонтрагента(ТЗСтр.ФИО, ТЗСтр.НомерПаспорт, ТЗСтр.СерияПаспорт, ТЗСтр.ДокументЮЛФЛ, ТЗСтр.ЮрАдрес, ТЗСтр.ПочтовыйАдрес)()

Функция СоздатьЛицевойСчет(Контрагент, СписЛицСчетов = Неопределено)
                           
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛицевыеСчетаПайщиков.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЛицевыеСчетаПайщиков КАК ЛицевыеСчетаПайщиков
		|ГДЕ
		|	ЛицевыеСчетаПайщиков.Владелец = &Владелец
		|	И ЛицевыеСчетаПайщиков.Пайщик = &Пайщик
		|	И (ЛицевыеСчетаПайщиков.ВидЛицевогоСчета = &ВидЛицевогоСчета
		|			ИЛИ ЛицевыеСчетаПайщиков.ВидЛицевогоСчета = &ВидЛицевогоСчетаТехнический)
		|	И НЕ ЛицевыеСчетаПайщиков.ПометкаУдаления
		|	И НЕ ЛицевыеСчетаПайщиков.Ссылка В (&СписЛС)";
	
	Запрос.УстановитьПараметр("ВидЛицевогоСчета", Перечисления.ВидыЛицевыхСчетов.СчетНоминальногоДержателя);
	Запрос.УстановитьПараметр("ВидЛицевогоСчетаТехнический", Перечисления.ВидыЛицевыхСчетов.Технический);
	Запрос.УстановитьПараметр("Владелец", Фонд);
	Запрос.УстановитьПараметр("Пайщик", Контрагент);
	Если СписЛицСчетов=Неопределено Тогда
		СписЛицСчетов = Новый Массив;
	КонецЕсли;
	Запрос.УстановитьПараметр("СписЛС", СписЛицСчетов);
	
	РезультатЗапроса = Запрос.Выполнить();
				
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка; 
	Иначе     
	    НовыЛицевойСчет = Справочники.ЛицевыеСчетаПайщиков.СоздатьЭлемент();
		НовыЛицевойСчет.Код = СокрЛП(ЛицевойСчет.Код);
		НовыЛицевойСчет.ВидЛицевогоСчета = Перечисления.ВидыЛицевыхСчетов.Технический;
		НовыЛицевойСчет.Владелец = Фонд;
		НовыЛицевойСчет.Пайщик = Контрагент;
		НовыЛицевойСчет.ДатаОткрытия = ДатаОткрытияСчета;
		НовыЛицевойСчет.ОбменДанными.Загрузка = Истина;
		НовыЛицевойСчет.Записать();
		
		Возврат НовыЛицевойСчет.Ссылка;
	КонецЕсли;
    
КонецФункции

Функция ПолучитьБанковскийСчет(НомерСчета, Контрагент) 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанковскиеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.НомерСчета = &НомерСчета
		|	И БанковскиеСчета.Владелец = &Владелец
		|	И НЕ БанковскиеСчета.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.БанковскиеСчета.ПустаяСсылка();

КонецФункции // 

Функция СформироватьПредставление(Поле2, Поле3, Поле4, Поле5, Поле6, Поле7, Поле8, Поле9)
	ПредставлениеАдреса = "";
	Страна = Справочники.КлассификаторСтранМира.Россия;
	Если НачальноеЗначениеВыбора = Неопределено Тогда
		СтруктураДанных = Новый Структура;
		 СтруктураДанных.Вставить("Поле1", "");
		 СтруктураДанных.Вставить("Поле2", Поле2);
		 СтруктураДанных.Вставить("Поле3", Поле3);
		 СтруктураДанных.Вставить("Поле4", Поле4);
		 СтруктураДанных.Вставить("Поле5", Поле5);
		 СтруктураДанных.Вставить("Поле6", Поле6);
		 СтруктураДанных.Вставить("Поле7", Поле7);
		 СтруктураДанных.Вставить("Поле8", Поле8);
		 СтруктураДанных.Вставить("Поле9", Поле9);

		Представление = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(СтруктураДанных);
		
	Иначе
		Представление =
		СокрЛП(Поле2) + ","
		+ СокрЛП(Поле3) + ","
		+ СокрЛП(Поле4) + ","
		+ СокрЛП(Поле5) + ","
		+ СокрЛП(Поле6) + ","
		+ СокрЛП(Поле7) + ","
		+ СокрЛП(Поле8) + ","
		+ СокрЛП(Поле9);
		
		Представление = РегламентированнаяОтчетность.ПредставлениеАдресаВФормате9Запятых(Представление);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Страна) Тогда 
		СтранаНаименование = Страна.НаименованиеПолное;
	Иначе 
		СтранаНаименование = Справочники.КлассификаторСтранМира.Россия.НаименованиеПолное;
	КонецЕсли;
	
	Если Ложь Тогда
		
		Если СтрНачинаетсяС(ВРЕГ(ПредставлениеАдреса), ВРег(СтранаНаименование)) Тогда
			Позиция = СтрДлина(СтранаНаименование) + 1;
			Если Сред(ПредставлениеАдреса, Позиция, 1) = "," Тогда
				Позиция = Позиция + 1;
			КонецЕсли;
		КонецЕсли;
		
		ПредставлениеАдресаРегл = СтранаНаименование  + ", " + ПредставлениеАдреса;
	Иначе
		СтруктураДанных = Новый Структура;
		 СтруктураДанных.Вставить("Поле1", "");
		 СтруктураДанных.Вставить("Поле2", Поле2);
		 СтруктураДанных.Вставить("Поле3", Поле3);
		 СтруктураДанных.Вставить("Поле4", Поле4);
		 СтруктураДанных.Вставить("Поле5", Поле5);
		 СтруктураДанных.Вставить("Поле6", Поле6);
		 СтруктураДанных.Вставить("Поле7", Поле7);
		 СтруктураДанных.Вставить("Поле8", Поле8);
		 СтруктураДанных.Вставить("Поле9", Поле9);

		Если НачальноеЗначениеВыбора = Неопределено Тогда
			ПредставлениеАдресаБезИндекса = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(СтруктураДанных,Истина);
			
		Иначе
			ПредставлениеАдресаБезИндекса =
			СокрЛП(Поле2) + ","
			+ СокрЛП(Поле3) + ","
			+ СокрЛП(Поле4) + ","
			+ СокрЛП(Поле5) + ","
			+ СокрЛП(Поле6) + ","
			+ СокрЛП(Поле7) + ","
			+ СокрЛП(Поле8) + ","
			+ СокрЛП(Поле9);
			
			ПредставлениеАдресаБезИндекса = РегламентированнаяОтчетность.ПредставлениеАдресаВФормате9Запятых(ПредставлениеАдресаБезИндекса);
			
		КонецЕсли;
				
		Если СтрНачинаетсяС(ВРЕГ(Представление), ВРег(СтранаНаименование)) Тогда
			Позиция = СтрДлина(СтранаНаименование) + 1;
			Если Сред(Представление, Позиция, 1) = "," Тогда
				Позиция = Позиция + 1;
			КонецЕсли;
		КонецЕсли;
		
		ПредставлениеАдресаРегл = СтранаНаименование  + ", " + ПредставлениеАдресаБезИндекса;
	КонецЕсли;

	Возврат Представление;
	
КонецФункции // СформироватьПредставление()

Процедура ДобавитьАдрес(Пайщик, СтруктураАдрес)

	НоваяЗапись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	НоваяЗапись.Объект = Пайщик;
	НоваяЗапись.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	НоваяЗапись.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	НоваяЗапись.Поле2 = СтруктураАдрес.Регион;
	НоваяЗапись.Поле3 = СтруктураАдрес.Район;
	НоваяЗапись.Поле4 = СтруктураАдрес.Город;
	НоваяЗапись.Поле5 = СтруктураАдрес.НасПункт;
	НоваяЗапись.Поле6 = СтруктураАдрес.Улица;
	НоваяЗапись.Поле7 = СтруктураАдрес.Дом;
	НоваяЗапись.Поле8 = СтруктураАдрес.Корпус;
	НоваяЗапись.Поле9 = СтруктураАдрес.Квартира;
	НоваяЗапись.ТипДома = Перечисления.ТипыДомов.Дом;
	НоваяЗапись.ТипКорпуса = Перечисления.ТипыКорпусов.Корпус;
	НоваяЗапись.ТипКвартиры = Перечисления.ТипыКвартир.Квартира;
	НоваяЗапись.Представление = СформироватьПредставление(СтруктураАдрес.Регион, СтруктураАдрес.Район, СтруктураАдрес.Город, СтруктураАдрес.НасПункт, СтруктураАдрес.Улица, СтруктураАдрес.Дом, СтруктураАдрес.Корпус, СтруктураАдрес.Квартира);
	НоваяЗапись.АдресРазобран = Истина;
	Попытка
		НоваяЗапись.Записать(Ложь);
	Исключение
		//Сообщить("Не удалось записать адрес " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	
	НоваяЗапись = РегистрыСведений.ИсторияИзмененияКонтактнойИнформации.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период = ДатаИсторическихЗначений;//ТекущаяДата();
	НоваяЗапись.Объект = Пайщик;
	НоваяЗапись.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	НоваяЗапись.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	НоваяЗапись.Поле2 = СтруктураАдрес.Регион;
	НоваяЗапись.Поле3 = СтруктураАдрес.Район;
	НоваяЗапись.Поле4 = СтруктураАдрес.Город;
	НоваяЗапись.Поле5 = СтруктураАдрес.НасПункт;
	НоваяЗапись.Поле6 = СтруктураАдрес.Улица;
	НоваяЗапись.Поле7 = СтруктураАдрес.Дом;
	НоваяЗапись.Поле8 = СтруктураАдрес.Корпус;
	НоваяЗапись.Поле9 = СтруктураАдрес.Квартира;
	НоваяЗапись.ТипДома = Перечисления.ТипыДомов.Дом;
	НоваяЗапись.ТипКорпуса = Перечисления.ТипыКорпусов.Корпус;
	НоваяЗапись.ТипКвартиры = Перечисления.ТипыКвартир.Квартира;
	НоваяЗапись.Представление = СформироватьПредставление(СтруктураАдрес.Регион, СтруктураАдрес.Район, СтруктураАдрес.Город, СтруктураАдрес.НасПункт, СтруктураАдрес.Улица, СтруктураАдрес.Дом, СтруктураАдрес.Корпус, СтруктураАдрес.Квартира);
	НоваяЗапись.АдресРазобран = Истина;
	Попытка
		НоваяЗапись.Записать(Ложь);
	Исключение
		//Сообщить("Не удалось записать адрес " + ОписаниеОшибки());
	КонецПопытки;


КонецПроцедуры

Функция ЛицевойСчет(Пайщик)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛицевыеСчетаПайщиков.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЛицевыеСчетаПайщиков КАК ЛицевыеСчетаПайщиков
		|ГДЕ
		|	ЛицевыеСчетаПайщиков.Владелец = &Владелец
		|	И ЛицевыеСчетаПайщиков.Пайщик = &Пайщик
		|	И ЛицевыеСчетаПайщиков.ВидЛицевогоСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыЛицевыхСчетов.СчетНоминальногоДержателя), ЗНАЧЕНИЕ(Перечисление.ВидыЛицевыхСчетов.Технический))
		|	И НЕ ЛицевыеСчетаПайщиков.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", Фонд);
	Запрос.УстановитьПараметр("Пайщик", Пайщик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ЛицевыеСчетаПайщиков.ПустаяСсылка();

КонецФункции // ЛицевойСчет()

Процедура ПрочитатьФайл()
	
	ТП.Очистить();
	
	ЧтениеXML = Новый ЧтениеXML;	
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	
	Построитель = Новый ПостроительDOM;
 
    Документ = Построитель.Прочитать(ЧтениеXML);
    Пайщики = Документ.ЭлементДокумента.ДочерниеУзлы[10];
    
    ТЗЛог = Новый ТаблицаЗначений;
    ТЗЛог.Колонки.Добавить("ИдентСтроки"); 
    ТЗЛог.Колонки.Добавить("СтруктураФИОДатаРождения");
    ТЗЛог.Колонки.Добавить("НаименованиеСтроки");
    ТЗЛог.Колонки.Добавить("СтрокаНезаполненные");
    
    СписЛогДубли = Новый Массив;
    
    ТЗЛогРезидент = Новый ТаблицаЗначений;
    ТЗЛогРезидент.Колонки.Добавить("СтруктураФИОДатаРождения");
    ТЗЛогРезидент.Колонки.Добавить("НаименованиеСтроки");
    
    НомСтр = 0;
    МассивСтрок = Новый Массив;
	Для Каждого Пайщик Из Пайщики.ДочерниеУзлы Цикл
		
		ПайщикДатаРождения = Дата(1, 1, 1);
		СерияПаспорт = "";
		НомерПаспорт = "";
		
		НомерСчета = Пайщик.ДочерниеУзлы.Элемент(1).ТекстовоеСодержимое;
		
		Если НомерСчета<>СокрЛП(ЛицевойСчет.Код) Тогда Продолжить КонецЕсли;
		НомСтр = НомСтр + 1;
		МассивСтрок.Добавить(НомСтр);
		ИдентСтроки = "Строка " + НомСтр;
		
		СтруктураФИОДатаРождения = Новый Структура("ФИО, ДатаРождения", "", Дата(1,1,1));
		
		ТЗСтр = ТП.Добавить(); 
		ТЗСтр.НомерСтроки = НомСтр;
		ТЗСтр.ДатаРождения = ПайщикДатаРождения;
		
		СтрокаНезаполненные = "";
		ФлНеРезидент = Ложь;
		Для каждого УзелПаи Из Пайщик.ДочерниеУзлы Цикл
			
			Если УзелПаи.ИмяУзла="ЗЛ_НомерСчета" Тогда
				ТЗСтр.НомерСчета = УзелПаи.ТекстовоеСодержимое;
				//Если ПустаяСтрока(СокрЛП(УзелПаи.ТекстовоеСодержимое)) Тогда
				//	СтрокаНезаполненные = СтрокаНезаполненные + "Номер счёта, ";		
				//КонецЕсли;
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_НомерСубСчета" Тогда
				ТЗСтр.НомерСубСчета = УзелПаи.ТекстовоеСодержимое;
				//Если ПустаяСтрока(СокрЛП(УзелПаи.ТекстовоеСодержимое)) Тогда
				//	СтрокаНезаполненные = СтрокаНезаполненные + "Номер суб. счёта, ";		
				//КонецЕсли;
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_ТипСчета" Тогда
				ТЗСтр.ТипСчета = УзелПаи.ТекстовоеСодержимое;	
				//Если ПустаяСтрока(СокрЛП(УзелПаи.ТекстовоеСодержимое)) Тогда
				//	СтрокаНезаполненные = СтрокаНезаполненные + "Тип счёта, ";		
				//КонецЕсли;
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_Наименование" Тогда
				ТЗСтр.ФИО = УзелПаи.ТекстовоеСодержимое;
				СтруктураФИОДатаРождения.ФИО = УзелПаи.ТекстовоеСодержимое;
				НаименованиеСтроки = УзелПаи.ТекстовоеСодержимое;
				//Если ПустаяСтрока(СокрЛП(УзелПаи.ТекстовоеСодержимое)) Тогда
				//	СтрокаНезаполненные = СтрокаНезаполненные + "Наименование, ";		
				//КонецЕсли;
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_Тип" Тогда
				ТипФЛ_ЮЛ = УзелПаи.ТекстовоеСодержимое;	
				//Если ПустаяСтрока(СокрЛП(УзелПаи.ТекстовоеСодержимое)) Тогда
				//	СтрокаНезаполненные = СтрокаНезаполненные + "Тип контрагента, ";		
				//КонецЕсли;
			//ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_СтатусСчета" Тогда
			//	СтатусСчета = УзелПаи.ТекстовоеСодержимое;
			//	Если ПустаяСтрока(СокрЛП(УзелПаи.ТекстовоеСодержимое)) Тогда
			//		СтрокаНезаполненные = СтрокаНезаполненные + "Статус счёта, ";		
			//	КонецЕсли;
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_Документ" Тогда
				ТЗСтр.ДокументЮЛФЛ = УзелПаи.ТекстовоеСодержимое;
				Если ПустаяСтрока(СокрЛП(УзелПаи.ТекстовоеСодержимое)) Тогда
					СтрокаНезаполненные = СтрокаНезаполненные + "Документ, ";		
				КонецЕсли;
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_ДатаРождения" Тогда
				Год = Прав(УзелПаи.ТекстовоеСодержимое, 4);
				Месяц = Сред(УзелПаи.ТекстовоеСодержимое, 4, 2);
				День = Лев(УзелПаи.ТекстовоеСодержимое, 2);
				Если УзелПаи.ТекстовоеСодержимое<>"00.00.0000" Тогда
					ТЗСтр.ДатаРождения = Дата(Год, Месяц, День);
				КонецЕсли;  
				СтруктураФИОДатаРождения.ДатаРождения = ТЗСтр.ДатаРождения;	
				Если ПустаяСтрока(СокрЛП(УзелПаи.ТекстовоеСодержимое)) Или УзелПаи.ТекстовоеСодержимое="00.00.0000" Тогда
					СтрокаНезаполненные = СтрокаНезаполненные + "Дата рождения, ";		
				КонецЕсли;
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_ЮрАдрес" Тогда
				ТЗСтр.ЮрАдрес = УзелПаи.ТекстовоеСодержимое;
				Если ПустаяСтрока(СокрЛП(УзелПаи.ТекстовоеСодержимое)) Тогда
					СтрокаНезаполненные = СтрокаНезаполненные + "Юр. адрес, ";		
				КонецЕсли;
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_ПочтовыйАдрес" Тогда
				ТЗСтр.ПочтовыйАдрес = УзелПаи.ТекстовоеСодержимое;
				//Если ПустаяСтрока(СокрЛП(УзелПаи.ТекстовоеСодержимое)) Тогда
				//	СтрокаНезаполненные = СтрокаНезаполненные + "Почтовый адрес, ";		
				//КонецЕсли;
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_БанкРеквизиты" Тогда
				ТЗСтр.БанкРеквизиты = УзелПаи.ТекстовоеСодержимое;
				ПозПлтельщик = СтрНайти(ТЗСтр.БанкРеквизиты, "Получателем платежа является иное лицо:");
				Если ПозПлтельщик>0 Тогда 
					ПозПлтельщик = ПозПлтельщик + СтрДлина("Получателем платежа является иное лицо:");
					ДлинаБанкРеквизиты = СтрДлина(ТЗСтр.БанкРеквизиты);
					СтрИННПолучатель = Прав(ТЗСтр.БанкРеквизиты, ДлинаБанкРеквизиты - ПозПлтельщик);	
					ПозИННПолучатель = СтрНайти(СтрИННПолучатель, "ИНН")+3;
					ДлинаСтрИННПолучатель = СтрДлина(СтрИННПолучатель);
					СтрИННПолучатель = Прав(СтрИННПолучатель, ДлинаСтрИННПолучатель - ПозИННПолучатель);
					СтрИННПолучатель = ОтделитьЦифры(СтрИННПолучатель);
					Если Не ПустаяСтрока(СтрИННПолучатель) Тогда
						ТЗСтр.ПолучательПлатежа	= ПолучитьКонтрагентПоРеквизиту(СтрИННПолучатель, "ИНН");
						СтрокаРасчетныйСчет = Реквизит(ТЗСтр.БанкРеквизиты, "Расч.счет");
						ТЗСтр.БанковскийСчет = ПолучитьБанковскийСчет(СтрокаРасчетныйСчет, ТЗСтр.ПолучательПлатежа);
					КонецЕсли;
				КонецЕсли;
				Если ПустаяСтрока(СокрЛП(УзелПаи.ТекстовоеСодержимое)) Тогда
					СтрокаНезаполненные = СтрокаНезаполненные + "Банковские реквизиты, ";		
				КонецЕсли;
				Если Не ЗначениеЗаполнено(ТЗСтр.БанковскийСчет) Тогда
					СтрокаНезаполненные = СтрокаНезаполненные + "Банковский счет, ";
				КонецЕсли;
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_ИНН" Тогда
				ТЗСтр.ИНН = УзелПаи.ТекстовоеСодержимое;
				//Если ПустаяСтрока(СокрЛП(УзелПаи.ТекстовоеСодержимое)) Тогда
				//	СтрокаНезаполненные = СтрокаНезаполненные + "ИНН, ";		
				//КонецЕсли;
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_LEI" Тогда
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_СтатусСчета" Тогда
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_Паи_Колво" Тогда
				ТЗСтр.КолПаёв = УзелПаи.ТекстовоеСодержимое;
				//Если ПустаяСтрока(СокрЛП(УзелПаи.ТекстовоеСодержимое)) Тогда
				//	СтрокаНезаполненные = СтрокаНезаполненные + "Количество паёв, ";		
				//КонецЕсли;
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_Паи_КолвоБлок1" Тогда
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_Паи_КолвоЗалог" Тогда
			ИначеЕсли УзелПаи.ИмяУзла="ЗЛ_Паи_Дивиденд" Тогда
				ПайщикФИО = УзелПаи.ТекстовоеСодержимое;
			КонецЕсли;
		КонецЦикла;
		
		Страна = Справочники.КлассификаторСтранМира.ПустаяСсылка();
		Если ТипФЛ_ЮЛ="ФЛ" Тогда
			Если СтрНайти(ТЗСтр.ДокументЮЛФЛ, "Паспорт гражданина РФ") Тогда
				ТЗСтр.СерияПаспорт = СтрЗаменить(Сред(ТЗСтр.ДокументЮЛФЛ, 23, 5), " ", "");
				ТЗСтр.НомерПаспорт = СтрЗаменить(Сред(ТЗСтр.ДокументЮЛФЛ, 31, 6), " ", "");
				Страна = Справочники.КлассификаторСтранМира.Россия;
				ФлНеРезидент = Ложь;
			ИначеЕсли СтрНайти(ТЗСтр.ДокументЮЛФЛ, "Паспорт иностранного гражданина") Тогда   
				ФлНеРезидент = Истина;
			//Паспорт иностранного гражданина -
 C752YWFZV выдан 04.12.2018г. ГОРОД КЁЛЬН
			//Паспорт иностранного гражданина -
 C4YJHXTZ6 выдан 23.02.2021г. Генеральное консульство Екатеринбурга
			//Паспорт иностранного гражданина -
 C4YJHXTZ6 выдан 23.02.2021г. Генеральное консульство Екатеринбурга
			//Паспорт иностранного гражданина -
 C752YWFZV выдан 04.12.2018г. ГОРОД КЁЛЬН
			//Паспорт иностранного гражданина -
 MC2976866 выдан 05.09.2017г. Минское РУВД Минской области
			//Паспорт иностранного гражданина -
 MC 2976866 выдан 05.09.2017г. Минское РУВД Минской области
			//Паспорт иностранного гражданина -
 АВ2560102 выдан 03.05.2012г. Пинский ГОВД Брестской области
			//Паспортиностранногогражданина0000
AA0102665 выдан 22.10.2014г. ГП "ЦГИР "РЕДЖИСТРУ"
			//ПаспортиностранногогражданинаKB
2138142 выдан 11.09.2015г. ОКТЯБРЬСКИЙ РОВД Г. МОГИЛЁВА
				ДокументЮЛФЛ = СтрЗаменить(ТЗСтр.ДокументЮЛФЛ, " ", "");
				Если СтрНайти(ДокументЮЛФЛ , "Паспортиностранногогражданина-
") Тогда
				    Если СтрНайти(ТЗСтр.ДокументЮЛФЛ , "MC 2976866") Тогда
						ТЗСтр.СерияПаспорт = "MC";
						ТЗСтр.НомерПаспорт = "2976866";
					Иначе
						//ТЗСтр.СерияПаспорт = Сред(ТЗСтр.ДокументЮЛФЛ, 23, 5);
						ТЗСтр.НомерПаспорт = Сред(ДокументЮЛФЛ, 32, 9);
					КонецЕсли;		
				ИначеЕсли СтрНайти(ДокументЮЛФЛ , "Паспортиностранногогражданина0000
") Тогда
				
					//ТЗСтр.СерияПаспорт = Сред(ТЗСтр.ДокументЮЛФЛ, 23, 5);
					ТЗСтр.НомерПаспорт = СтрЗаменить(Сред(ДокументЮЛФЛ, 35, 9), " ", "");
				ИначеЕсли СтрНайти(ДокументЮЛФЛ , "ПаспортиностранногогражданинаKB
") Тогда
				
					ТЗСтр.СерияПаспорт = "KB";
					ТЗСтр.НомерПаспорт = СтрЗаменить(Сред(ДокументЮЛФЛ, 33, 7), " ", "");	
				КонецЕсли;
			КонецЕсли;
			
			Если ПустаяСтрока(СокрЛП(ТЗСтр.СерияПаспорт)) Тогда
				СтрокаНезаполненные = СтрокаНезаполненные + "Серия паспорта, ";		
			КонецЕсли;
			Если ПустаяСтрока(СокрЛП(ТЗСтр.НомерПаспорт)) Тогда
				СтрокаНезаполненные = СтрокаНезаполненные + "Номер паспорта, ";		
			КонецЕсли;
			                      
			Контрагент = ПолучитьКонтрагент(ТЗСтр.ФИО, ТЗСтр.ДатаРождения, ТЗСтр.НомерПаспорт, ТЗСтр.СерияПаспорт, ТЗСтр.ДокументЮЛФЛ, СписЛогДубли);
		
			Если Контрагент="РучнойВыбор" Тогда
				ТЗСтр.РучнойВыбор = Истина;
			Иначе 
				ТЗСтр.Контрагент = Контрагент;
			КонецЕсли;
			
			Если ФлСоздаватьКонрагентов И ТЗСтр.Контрагент=Справочники.Контрагенты.ПустаяСсылка() И Не ТЗСтр.РучнойВыбор Тогда
				ТЗСтр.Контрагент = СоздатьКонтрагента(ТЗСтр.ФИО, ТЗСтр.ДатаРождения, ТЗСтр.ИНН, ТЗСтр.НомерПаспорт, ТЗСтр.СерияПаспорт, ТЗСтр.ДокументЮЛФЛ, ТЗСтр.ЮрАдрес, ТЗСтр.ПочтовыйАдрес, "", Страна, ИдентСтроки);
				Если ФлСоздаватьЛицевыеСчета Тогда
				
					ТЗСтр.ЛицевойСчет = СоздатьЛицевойСчет(ТЗСтр.Контрагент);
				
				КонецЕсли;
			ИначеЕсли ФлСоздаватьЛицевыеСчета  И ТЗСтр.Контрагент<>Справочники.Контрагенты.ПустаяСсылка() Тогда			
				
				СписЛицСчетов = Новый Массив; 
				Если МножитьЛицСчета Тогда
					СтруктураПоиск = Новый Структура("Контрагент", ТЗСтр.Контрагент);
					СтрокиТП = ТП.НайтиСтроки(СтруктураПоиск);
					Для Каждого СтрокаТП Из СтрокиТП Цикл
						Если ЗначениеЗаполнено(СтрокаТП.ЛицевойСчет) Тогда
						    СписЛицСчетов.Добавить(СтрокаТП.ЛицевойСчет);
						КонецЕсли;
					КонецЦикла;				
				КонецЕсли;
				
				ТЗСтр.ЛицевойСчет = СоздатьЛицевойСчет(ТЗСтр.Контрагент, СписЛицСчетов);
					
			Иначе 
				ТЗСтр.ЛицевойСчет = ЛицевойСчет(ТЗСтр.Контрагент);	
			КонецЕсли;
		ИначеЕсли ТипФЛ_ЮЛ="ЮЛ" Тогда
			Если СокрЛП(ТЗСтр.ИНН)<>"" Тогда
				ТЗСтр.Контрагент = ПолучитьКонтрагентПоРеквизиту(ТЗСтр.ИНН, "ИНН");	
			КонецЕсли;
			
			//Если СтрНайти(Документ, "ОГРН") Тогда
			//	ТЗСтр.СерияПаспорт = Сред(Документ, 23, 5);
			//	ТЗСтр.НомерПаспорт = Сред(Документ, 31, 6);
			//ИначеЕсли СтрНайти(Документ, "Паспорт иностранного гражданина") Тогда
			//	ТЗСтр.СерияПаспорт = Сред(Документ, 23, 5);
			//	ТЗСтр.НомерПаспорт = Сред(Документ, 31, 6);
			//КонецЕсли;
		КонецЕсли; 
		
		//Если ТЗСтр.Контрагент=НоминальныйДержатель Тогда
		//		
		//КонецЕсли;
		
		Если Не ПустаяСтрока(СтрокаНезаполненные) Тогда
			СтрокаТЗЛог = ТЗЛог.Добавить();	
			СтрокаТЗЛог.ИдентСтроки = ИдентСтроки;
			СтрокаТЗЛог.СтруктураФИОДатаРождения = СтруктураФИОДатаРождения;
    		СтрокаТЗЛог.НаименованиеСтроки = СокрЛП(ТЗСтр.Контрагент) + ", " + НаименованиеСтроки;
    		СтрокаТЗЛог.СтрокаНезаполненные = Лев(СтрокаНезаполненные, СтрДлина(СтрокаНезаполненные)-2);
		КонецЕсли;
		          
		Если ФлНеРезидент Тогда
			СтрокаТЗЛогРезидент = ТЗЛогРезидент.Добавить();	
			СтрокаТЗЛогРезидент.СтруктураФИОДатаРождения = СтруктураФИОДатаРождения;
    		СтрокаТЗЛогРезидент.НаименованиеСтроки = СокрЛП(ТЗСтр.Контрагент)+ ", "+ СокрЛП(ТЗСтр.ФИО);
    	КонецЕсли;		          
		
	КонецЦикла;
	
	Если СписЛогДубли.Количество()>0 Тогда
		ТестСообщения = "В Справочнике Контрагенты найдены следующие дубли по признакам - совпадение по Полному Наименованию + день рождения либо Номер документа.  Просьба проверить";
		Сообщить(ТестСообщения, СтатусСообщения.Внимание);	
		Для каждого ЛогДубли Из СписЛогДубли Цикл
			Сообщить(ЛогДубли);
		КонецЦикла;		
	КонецЕсли;
	
	Если ТЗЛогРезидент.Количество()>0 Тогда
		ТестСообщения = "У следующих созданных в Аванкоре Контрагентов Документ не Паспорт РФ, проверить Резиденство и Страну:";
		Сообщить(ТестСообщения, СтатусСообщения.Внимание);	
		Для каждого СтрокаТЗЛогРезидент Из ТЗЛогРезидент Цикл           
		    СтрокиТП = ТП.НайтиСтроки(СтрокаТЗЛогРезидент.СтруктураФИОДатаРождения);
			Сообщить("Строка " + СтрокиТП[0].НомерСтроки + ", " +СтрокаТЗЛогРезидент.НаименованиеСтроки);           
		КонецЦикла;		
	КонецЕсли;
	
	ТП.Сортировать("Контрагент");
	МассивСтрок = ОбщегоНазначенияАванкорКлиентСервер.СортироватьМассив(МассивСтрок);
	ТП.ЗагрузитьКолонку(МассивСтрок, "НомерСтроки");
	                                
	ТЗЛог.Сортировать("НаименованиеСтроки");
	Для каждого СтрокаТЗЛог Из ТЗЛог Цикл
	    
		//ТестСообщения = "В Справочнике Контрагенты найдены следующие дубли по признакам - совпадение по Полному Наименованию + день рождения либо Номер документа.  Просьба проверить";
		//Сообщить(ТестСообщения, СтатусСообщения.Внимание);
	    СтрокиТП = ТП.НайтиСтроки(СтрокаТЗЛог.СтруктураФИОДатаРождения);
        Сообщить("Строка " + СтрокиТП[0].НомерСтроки + ", " +СтрокаТЗЛог.НаименованиеСтроки + ". Не заполнены - "+ СтрокаТЗЛог.СтрокаНезаполненные);	
	
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
    
КонецПроцедуры

Функция ОпределеитьТипФЛ_ЮЛ(AdditionalInfo, RegData)
	Если СтрНайти(AdditionalInfo, "ИНН")>0 Тогда
		Возврат "ЮЛ"; 	
	ИначеЕсли СтрНайти(AdditionalInfo, "Дата рождения")>0 Тогда
		Возврат "ФЛ"; 		
	ИначеЕсли СтрНайти(RegData, "Сертификат")>0 Тогда
		Возврат "ИнЮЛ";			
	КонецЕсли;	
КонецФункции // ОпределеитьТипФЛ_ЮЛ()

Функция RegExp_Exec()
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.IgnoreCase = Истина; //Игнорировать регистр
	RegExp.Global = Истина; //Поиск всех вхождений шаблона
	RegExp.MultiLine = Ложь; //Многострочный режим
	Возврат RegExp;
КонецФункции

Функция ДатаRegExp(AdditionalInfo, НомСтр = "", СообщениеОшибка = "")

	RegExp.Pattern = "[0-9]{1,2}[\/|\.][0-9]{2,2}[\/|\.][0-9]{4,4}"; //Дата рождения
	Matches = RegExp.Execute(AdditionalInfo);
	ЧислоВхождений = Matches.Count();
	Если ЧислоВхождений=1 Тогда 
		ДатаРождения = Matches.Item(0).Value;   
		RegExp.Pattern = "[0-9]{1,4}"; //Дата рождения
		Matches = RegExp.Execute(ДатаРождения);
		ЧислоВхождений = Matches.Count();		
		Если ЧислоВхождений Тогда
			День = Число(Matches.Item(0).Value);
			Месяц = Число(Matches.Item(1).Value);
			Год = Число(Matches.Item(2).Value);
			Возврат Дата(Год, Месяц, День);		
		КонецЕсли;
	// в рамках задачки IMDEV-7580 - отключи плз вот эту проверку в обработке. Вообще не нужна она тут -
	//Иначе  //Строка 4 в начитываемом файле - Ошибка определения Даты рождения в (подсказка - смотрим через Excel в файле, при этом строка
1 - первая после заголовка таблицы)
		//Сообщить(""+НомСтр+" в начитываемом файле - Ошибка определения "+СообщениеОшибка+" в "+AdditionalInfo + " (подсказка - смотрим через Excel в файле)");
	КонецЕсли;	
    
    Возврат Дата(1, 1, 1);    
        
КонецФункции // ДатаРождения()
  
Функция Реквизит(AdditionalInfo, СтрРеквизит)
	
	RegExp.Pattern = СтрРеквизит+"[^\d]{0,}[\d]{1,}"; //Поиск ИНН р\с БИК
	Matches = RegExp.Execute(AdditionalInfo);
	ЧислоВхождений = Matches.Count();
	Если ЧислоВхождений=1 Тогда 
		РеквизитСтр = Matches.Item(0); 
		RegExp.Pattern = "[\d]{1,}"; 
		Matches = RegExp.Execute(РеквизитСтр);
		ЧислоВхождений = Matches.Count();  
		Если ЧислоВхождений=1 Тогда
			РеквизитСтр = Matches.Item(0); 	
		КонецЕсли;
		Возврат РеквизитСтр.Value;		
	Иначе
	    //Сообщить("Ошибка определения "+СтрРеквизит+" в "+AdditionalInfo);
	КонецЕсли;	
    
    Возврат "";	

КонецФункции // Реквизит() 

Функция email(AdditionalInfo)
	
	RegExp.Pattern = "([A-z0-9_.-]{1,})@([A-z0-9_.-]{1,}).([A-z]{2,8})"; //Поиск ИНН р\с БИК
	Matches = RegExp.Execute(AdditionalInfo);
	ЧислоВхождений = Matches.Count();
	Если ЧислоВхождений=1 Тогда 
		РеквизитСтр = Matches.Item(0); 
		Возврат РеквизитСтр.Value;		
	Иначе
	    //Сообщить("Ошибка определения email "+AdditionalInfo);
	КонецЕсли;	
    
    Возврат "";	

КонецФункции // ИНН(СтрТЗПайщики.AdditionalInfo, RegExp)()

Процедура ПрочитатьФайлГарантExcelNEW()

	ВыбранныйФайл = Новый Файл(ИмяФайла);
	
	Попытка
		Если НЕ ВыбранныйФайл.Существует() Тогда
			ВызватьИсключение("Файл не существует " + ИмяФайла);
		КонецЕсли;
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Excel.Sheets(1).Select();  // Выбрали первый лист
		Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
		Если Версия = "8" тогда
			ФайлСтрок = Excel.Cells.CurrentRegion.Rows.Count;
			ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
		Иначе
			ФайлСтрок = Excel.Cells(1,1).SpecialCells(11).Row;
			ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;
		Конецесли;		
		//В цикле перебираем строки файла 
		
		ТП.Очистить();

		НомСтр = 0;
    	МассивСтрок = Новый Массив;
    	
    	ТЗЛог = Новый ТаблицаЗначений;
	    ТЗЛог.Колонки.Добавить("ИдентСтроки"); 
	    ТЗЛог.Колонки.Добавить("СтруктураФИОДатаРождения");
	    ТЗЛог.Колонки.Добавить("НаименованиеСтроки");
	    ТЗЛог.Колонки.Добавить("СтрокаНезаполненные");
	    
	    СписЛогДубли = Новый Массив;
	    
	    ТЗЛогРезидент = Новый ТаблицаЗначений;
	    ТЗЛогРезидент.Колонки.Добавить("СтруктураФИОДатаРождения");
	    ТЗЛогРезидент.Колонки.Добавить("НаименованиеСтроки");
		
		НачСтрока = 3;
		Для С_чик = НачСтрока по ФайлСтрок цикл 
			//Выводим пользователю информацию
			Состояние("Считываем строки из файла (" + С_чик + " из " + ФайлСтрок + ")", Цел(С_чик/ФайлСтрок*100) , Excel.Cells(С_чик, 1).Text, БиблиотекаКартинок.НайтиВСодержании);
			
			НомСтр = НомСтр + 1;   
			МассивСтрок.Добавить(НомСтр);
			ИдентСтроки = "Строка " + НомСтр;
			
			//Считываем текст из ячейки
			ТекстЯчейки = Excel.Cells(С_чик, 1).Text;
			//Считываем значение ячейки
			ДопИнфо = Excel.Cells(С_чик, 3).Value;
			БанкРеквиз = Excel.Cells(С_чик, 4).Value;
			ЮрАдрес = Excel.Cells(С_чик, 6).Value;
			ФИО = Excel.Cells(С_чик, 1).Value;
			КолПаёв = Excel.Cells(С_чик, 5).Value;
			ПочтовыйАдрес = Excel.Cells(С_чик, 6).Value;
			ДанныеРегистрации = Excel.Cells(С_чик, 19).Value;
			
			Банк = Excel.Cells(С_чик, 11).Value;
			БИК = Excel.Cells(С_чик,12).Value;	
			КоррСчет = Excel.Cells(С_чик, 13).Value;
			РасчетныйСчет = Excel.Cells(С_чик, 18).Value;
			КемВыдан = Excel.Cells(С_чик, 15).Value;
			ТипДок = Excel.Cells(С_чик, 17).Value;
			//КемВыдан = Реквизит(Excel.Cells(С_чик, 11).Value, "Выдан:");
			//ТипДок = Лев(Excel.Cells(С_чик, 11).Value,Найти(Excel.Cells(С_чик, 11).Value,".")-1);
			//Если ТипДок = "Иностранный паспорт" тогда
			//	ТипДок = "10"
			//ИначеЕсли ТипДок = "Вид на жительство в РФ" тогда
			//	ТипДок = "12"
			//ИначеЕсли ТипДок = "Паспорт гражданина РФ" тогда  
			//	ТипДок = "21"
			//ИначеЕсли ТипДок = "ОГРН" тогда  
			//	ТипДок = "OGRN"
			//ИначеЕсли ТипДок = "Св-во о регистрации" тогда
			//	ТипДок = "REGN" 
			//Иначе
			//	ТипДок = "" 
			//КонецЕсли;
			
			НомерПаспортЗначение =Excel.Cells(С_чик, 14).Value;
			Если ТипЗнч(НомерПаспортЗначение) = Тип("Число") Тогда
				НомерПаспорт = Формат(НомерПаспортЗначение, "ЧГ=0");
			ИначеЕсли ТипЗнч(НомерПаспортЗначение) = Тип("Строка") Тогда
				НомерПаспорт = СтрЗаменить(НомерПаспортЗначение, " ", "")
			КонецЕсли;
			СерияПаспортЗначение = СтрЗаменить(Excel.Cells(С_чик, 16).Value, " ", "");
			Если ТипЗнч(СерияПаспортЗначение) = Тип("Число") Тогда
				СерияПаспорт = Формат(СерияПаспортЗначение, "ЧГ=0");
			ИначеЕсли ТипЗнч(СерияПаспортЗначение) = Тип("Строка") Тогда
				СерияПаспорт = СтрЗаменить(СерияПаспортЗначение, " ", "")
			КонецЕсли;
			ДатаВыдачи =  Excel.Cells(С_чик, 20).Value;

			ПайщикДатаРождения = Дата(1, 1, 1);
			
			СтруктураПаспорт = Новый Структура("КемВыдан, ТипДок, НомерПаспорт, СерияПаспорт, ДатаВыдачи", КемВыдан, ТипДок, НомерПаспорт, СерияПаспорт, ДатаВыдачи);
			
			СтруктураФИОДатаРождения = Новый Структура("ФИО, ДатаРождения", "", Дата(1,1,1));
	        
	        СтрокаНезаполненные = "";
			ФлНеРезидент = Ложь;
		    СозданКонрагент = Ложь;
		    
		   	Если ТипДок="21" Или ТипДок="12" Или ТипДок="10" Тогда
				ТипФЛ_ЮЛ = "ФЛ";
				ДатаРождения = ДатаRegExp(ДопИнфо, ИдентСтроки, "Даты рождения");
			Иначе
				ТипФЛ_ЮЛ = "ЮЛ";
				ДатаРождения = Дата(1,1,1);			
			КонецЕсли;
			
			ТЗСтр = ТП.Добавить(); 
			ТЗСтр.НомерСтроки = НомСтр;
			ТЗСтр.НомСтрФайл = НомСтр;
			ТЗСтр.ДатаРождения = ДатаРождения;	
			
			Если ПустаяСтрока(СокрЛП(ТЗСтр.ДатаРождения)) Тогда
				СтрокаНезаполненные = СтрокаНезаполненные + "Дата рождения, ";		
			КонецЕсли;			
		    //ТЗСтр.НомерСчета = СтрТЗПайщики.DepoAccNumber;
		    //ТЗСтр.НомерСубСчета = УзелПаи.ТекстовоеСодержимое;
		    //ТЗСтр.ТипСчета = УзелПаи.ТекстовоеСодержимое;	
		    ТЗСтр.ФИО = ФИО;   
		    
		    Если ТипДок="12" Или ТипДок="10" Тогда
				ТЗСтр.НеРезидент = Истина;
				ФлНеРезидент = Истина;	
			КонецЕсли;
		    
		    ТЗСтр.ДокументЮЛФЛ = ДанныеРегистрации; 
		    СтруктураФИОДатаРождения.ДатаРождения = ТЗСтр.ДатаРождения; 
		    СтруктураФИОДатаРождения.ФИО = ФИО;
		    
		    ТЗСтр.ЮрАдрес = ЮрАдрес;
			Если ПустаяСтрока(СокрЛП(ЮрАдрес)) Тогда
				СтрокаНезаполненные = СтрокаНезаполненные + "Юр. адрес, ";		
			КонецЕсли;
			
			ТЗСтр.ПочтовыйАдрес = ПочтовыйАдрес;
		    ТЗСтр.ЭлектронныйАдрес = email(ДопИнфо);
		    //ПайщикФИО = СтрТЗПайщики.PartnerName;
		    Страна = Справочники.КлассификаторСтранМира.ПустаяСсылка();
			Если ТипФЛ_ЮЛ="ФЛ" Тогда
			    
			    ТЗСтр.ДатаРождения = ДатаRegExp(ДопИнфо, ИдентСтроки, "Даты рождения"); 
			    ТЗСтр.НомерПаспорт = НомерПаспорт;
			    ТЗСтр.СерияПаспорт = СерияПаспорт;
			    
			    Если ПустаяСтрока(СокрЛП(ТЗСтр.СерияПаспорт)) И ТипДок="21" Тогда
			    	Если Не ПустаяСтрока(СокрЛП(ТЗСтр.НомерПаспорт)) Тогда                  
			    		Если СтрДлина(ТЗСтр.НомерПаспорт)>=10 Тогда
			    			ТЗСтр.СерияПаспорт = Лев(СокрЛП(ТЗСтр.НомерПаспорт), 4);
			    			ТЗСтр.НомерПаспорт = Прав(СокрЛП(ТЗСтр.НомерПаспорт), 6);	
			    		Иначе 
			    			СтрокаНезаполненные = СтрокаНезаполненные + "Серия паспорта, ";		
			    		КонецЕсли;	
			    	Иначе
						СтрокаНезаполненные = СтрокаНезаполненные + "Серия паспорта, ";		
					КонецЕсли;
				КонецЕсли;
				Если ПустаяСтрока(СокрЛП(ТЗСтр.НомерПаспорт)) Тогда
					СтрокаНезаполненные = СтрокаНезаполненные + "Номер паспорта, ";		
				КонецЕсли;
			
				Контрагент = ПолучитьКонтрагент(ТЗСтр.ФИО, ТЗСтр.ДатаРождения, ТЗСтр.НомерПаспорт, ТЗСтр.СерияПаспорт, ТЗСтр.ДокументЮЛФЛ, СписЛогДубли);
			
				Если Контрагент="РучнойВыбор" Тогда
					ТЗСтр.РучнойВыбор = Истина;
				Иначе 
					ТЗСтр.Контрагент = Контрагент;
				КонецЕсли;
			
				Если ФлСоздаватьКонрагентов И ТЗСтр.Контрагент=Справочники.Контрагенты.ПустаяСсылка() И Не ТЗСтр.РучнойВыбор Тогда
					ТЗСтр.Контрагент = СоздатьКонтрагента(ТЗСтр.ФИО, ТЗСтр.ДатаРождения, ТЗСтр.ИНН, ТЗСтр.НомерПаспорт, ТЗСтр.СерияПаспорт, СтруктураПаспорт, ТЗСтр.ЮрАдрес, ТЗСтр.ПочтовыйАдрес, ТЗСтр.ЭлектронныйАдрес, Страна, ИдентСтроки);
					Если ФлСоздаватьЛицевыеСчета Тогда
						ТЗСтр.ЛицевойСчет = СоздатьЛицевойСчет(ТЗСтр.Контрагент);
					КонецЕсли;
					СозданКонрагент = Истина;
				ИначеЕсли ФлСоздаватьЛицевыеСчета И ТЗСтр.Контрагент<>Справочники.Контрагенты.ПустаяСсылка() Тогда	
					
					СписЛицСчетов = Новый Массив; 
					Если МножитьЛицСчета Тогда
						СтруктураПоиск = Новый Структура("Контрагент", ТЗСтр.Контрагент);
						СтрокиТП = ТП.НайтиСтроки(СтруктураПоиск);
						Для Каждого СтрокаТП Из СтрокиТП Цикл
							Если ЗначениеЗаполнено(СтрокаТП.ЛицевойСчет) Тогда
								СписЛицСчетов.Добавить(СтрокаТП.ЛицевойСчет);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					ТЗСтр.ЛицевойСчет = СоздатьЛицевойСчет(ТЗСтр.Контрагент, СписЛицСчетов);
						
				Иначе 
					ТЗСтр.ЛицевойСчет = ЛицевойСчет(ТЗСтр.Контрагент);	
				КонецЕсли;
			ИначеЕсли ТипФЛ_ЮЛ="ЮЛ" Тогда
			
				СтрИННПолучатель = Реквизит(ДанныеРегистрации, "ИНН"); 
				Если Не ПустаяСтрока(СтрИННПолучатель)  Тогда
					КонтрагентЮЛ = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", СтрИННПолучатель);	
				Иначе
					КонтрагентЮЛ = Справочники.Контрагенты.ПустаяСсылка();
				КонецЕсли;
				
				Если КонтрагентЮЛ=Справочники.Контрагенты.ПустаяСсылка() Тогда
					СтрОГРНПолучатель = Реквизит(ДанныеРегистрации, "ОГРН");
					ТЗСтр.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ОГРН", СтрОГРНПолучатель);
					Если ТЗСтр.Контрагент=Справочники.Контрагенты.ПустаяСсылка() Тогда
						ТЗСтр.Контрагент = ПолучитьКонтрагентПоРеквизиту(СтрОГРНПолучатель, "НомерДокументаГосРег");
					КонецЕсли;
				Иначе
					ТЗСтр.Контрагент = КонтрагентЮЛ;
				КонецЕсли;
			
			КонецЕсли;
		
			ТЗСтр.БанкРеквизиты = БанкРеквиз;
			
			СтрИННПолучатель = Реквизит(БанкРеквиз, "ИНН");
			СтрОГРНПолучатель = Реквизит(БанкРеквиз, "ОГРН");
			СтрРасчетныйСчет = Реквизит(БанкРеквиз, "р/с");  
			БИКБанка = Реквизит(БанкРеквиз, "БИК");
			Если ПустаяСтрока(СтрРасчетныйСчет) Тогда
				СтрРасчетныйСчет = Реквизит(БанкРеквиз, "Расч.счет");			
			КонецЕсли;
			
			Если ПустаяСтрока(СтрИННПолучатель) Тогда
				ТЗСтр.ПолучательПлатежа = ?(НДПолучательПлатежа,  НоминальныйДержатель, ТЗСтр.Контрагент);
			Иначе
				ТЗСтр.ПолучательПлатежа = ?(НДПолучательПлатежа, НоминальныйДержатель, ПолучитьКонтрагентПоРеквизиту(СтрИННПолучатель, "ИНН"));
				Если ТЗСтр.ПолучательПлатежа=Справочники.Контрагенты.ПустаяСсылка() Тогда
					ТЗСтр.ПолучательПлатежа	= ПолучитьКонтрагентПоРеквизиту(СтрОГРНПолучатель, "ОГРН");
					Если ТЗСтр.ПолучательПлатежа=Справочники.Контрагенты.ПустаяСсылка() Тогда
						ТЗСтр.ПолучательПлатежа	= ПолучитьКонтрагентПоРеквизиту(СтрОГРНПолучатель, "НомерДокументаГосРег");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если Не ПустаяСтрока(СтрРасчетныйСчет) Тогда
			    ТЗСтр.БанковскийСчет = ПолучитьБанковскийСчет(СтрРасчетныйСчет, ТЗСтр.ПолучательПлатежа);				
				Если ТЗСтр.БанковскийСчет = Справочники.БанковскиеСчета.ПустаяСсылка() и ФорматГарантNew = 1 Тогда
					ТЗСтр.БанковскийСчет = СоздатьБСчет(СтрРасчетныйСчет, ТЗСтр.ПолучательПлатежа,БИКБанка);
				КонецЕсли
			КонецЕсли;
			
			ТЗСтр.КолПаёв = Число(КолПаёв);
			
			Если Не ПустаяСтрока(СтрокаНезаполненные) Тогда
				СтрокаТЗЛог = ТЗЛог.Добавить();	
				СтрокаТЗЛог.ИдентСтроки = ИдентСтроки;
				СтрокаТЗЛог.СтруктураФИОДатаРождения = СтруктураФИОДатаРождения;
	    		СтрокаТЗЛог.НаименованиеСтроки = СокрЛП(ТЗСтр.Контрагент) + ", " + ФИО;
	    		СтрокаТЗЛог.СтрокаНезаполненные = Лев(СтрокаНезаполненные, СтрДлина(СтрокаНезаполненные)-2);
			КонецЕсли;
			          
			Если ФлНеРезидент И СозданКонрагент Тогда
				СтрокаТЗЛогРезидент = ТЗЛогРезидент.Добавить();	
				СтрокаТЗЛогРезидент.СтруктураФИОДатаРождения = СтруктураФИОДатаРождения;
	    		СтрокаТЗЛогРезидент.НаименованиеСтроки = СокрЛП(ТЗСтр.Контрагент)+ ", "+ СокрЛП(ТЗСтр.ФИО);
	    	КонецЕсли;
						
		КонецЦикла;  
		
		Если СписЛогДубли.Количество()>0 Тогда
			ТестСообщения = "В Справочнике Контрагенты найдены следующие дубли по признакам - совпадение по Полному Наименованию + день рождения либо Номер документа.  Просьба проверить";
			Сообщить(ТестСообщения, СтатусСообщения.Внимание);	
			Для каждого ЛогДубли Из СписЛогДубли Цикл
				Сообщить(ЛогДубли);
			КонецЦикла;		
		КонецЕсли;
		
		Если ТЗЛогРезидент.Количество()>0 Тогда
			ТестСообщения = "У следующих созданных в Аванкоре Контрагентов Документ не Паспорт РФ, проверить Резидентство и Страну:";
			Сообщить(ТестСообщения, СтатусСообщения.Внимание);
			ТестСообщения = "Внимание! У следующих созданных контрагентов проставлено временно гражданство Чехия. Требуется зайти в карточку созданного контрагента и поправить страну и гражданство на верные.";
			Сообщить(ТестСообщения, СтатусСообщения.Внимание);	
			Для каждого СтрокаТЗЛогРезидент Из ТЗЛогРезидент Цикл           
				СтрокиТП = ТП.НайтиСтроки(СтрокаТЗЛогРезидент.СтруктураФИОДатаРождения);
				Сообщить("Строка " + СтрокиТП[0].НомерСтроки + ", " +СтрокаТЗЛогРезидент.НаименованиеСтроки);           
			КонецЦикла;
		КонецЕсли;
		
		ТП.Сортировать("Контрагент");
		МассивСтрок = ОбщегоНазначенияАванкорКлиентСервер.СортироватьМассив(МассивСтрок);
		ТП.ЗагрузитьКолонку(МассивСтрок, "НомерСтроки");
		
		ТЗЛог.Сортировать("НаименованиеСтроки");
		Для каждого СтрокаТЗЛог Из ТЗЛог Цикл
		
			СтрокиТП = ТП.НайтиСтроки(СтрокаТЗЛог.СтруктураФИОДатаРождения);
			Сообщить("Строка " + СтрокиТП[0].НомерСтроки + ", " +СтрокаТЗЛог.НаименованиеСтроки + ". Не заполнены - "+ СтрокаТЗЛог.СтрокаНезаполненные);	
		
		КонецЦикла;
		
		
	Исключение
		Сообщить(ОписаниеОшибки());		 
	КонецПопытки;
	Если НЕ Excel = Неопределено тогда
		Excel.DisplayAlerts = 0; 
		Excel.Quit();
		Excel.DisplayAlerts = 1;		
	КонецЕсли;	
	
КонецПроцедуры //ПрочитатьФайлГарантExcel()

Функция СоздатьБСчет(Рсчет,Владелец,БИК)
	НовыйСчет = Справочники.БанковскиеСчета.СоздатьЭлемент();
	НовыйСчет.Владелец = Владелец;
	НовыйСчет.НомерСчета = Рсчет;
	НовыйСчет.ВалютаДенежныхСредств = Справочники.Валюты.RUB;
	
	//Если ПоляПоиска.Свойство("ПИФ") Тогда
	//	НовыйСчет.ПИФ = ПоляПоиска.ПИФ;		
	//КонецЕсли; 
	
	БанкСсылка = Справочники.Банки.НайтиПоКоду(БИК);
	//Если БанкСсылка.Пустая() Тогда
	//	БанкСсылка = НовыйБанк(ДеревоКэша, Источник.Bank_BIK, Источник);		
	//КонецЕсли; 
	
	НовыйСчет.Наименование = "Расчетный в " + БанкСсылка.Наименование;
	НовыйСчет.Банк = БанкСсылка;	
	НовыйСчет.ВидСчета = Перечисления.ВидБанковскогоСчета.Расчетный;
	НовыйСчет.Записать();
	 
		
	Возврат НовыйСчет.Ссылка;
	
	
	
	
КонецФункции

Процедура ПрочитатьФайлГарантExcel()
	
	ВыбранныйФайл = Новый Файл(ИмяФайла);
	
	Попытка
		Если НЕ ВыбранныйФайл.Существует() Тогда
			ВызватьИсключение("Файл не существует " + ИмяФайла);
		КонецЕсли;
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Excel.Sheets(1).Select();  // Выбрали первый лист
		Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
		Если Версия = "8" тогда
			ФайлСтрок = Excel.Cells.CurrentRegion.Rows.Count;
			ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
		Иначе
			ФайлСтрок = Excel.Cells(1,1).SpecialCells(11).Row;
			ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;
		Конецесли;		
		//В цикле перебираем строки файла 
		
		ТП.Очистить();

		НомСтр = 0;
		МассивСтрок = Новый Массив;
	
		ТЗЛог = Новый ТаблицаЗначений;
		ТЗЛог.Колонки.Добавить("ИдентСтроки"); 
		ТЗЛог.Колонки.Добавить("СтруктураФИОДатаРождения");
		ТЗЛог.Колонки.Добавить("НаименованиеСтроки");
		ТЗЛог.Колонки.Добавить("СтрокаНезаполненные");
	
		СписЛогДубли = Новый Массив;
	
		ТЗЛогРезидент = Новый ТаблицаЗначений;
		ТЗЛогРезидент.Колонки.Добавить("СтруктураФИОДатаРождения");
		ТЗЛогРезидент.Колонки.Добавить("НаименованиеСтроки");
		
		НачСтрока = 3;
		Для С_чик = НачСтрока по ФайлСтрок цикл 
			//Выводим пользователю информацию
			Состояние("Считываем строки из файла (" + С_чик + " из " + ФайлСтрок + ")", Цел(С_чик/ФайлСтрок*100) , Excel.Cells(С_чик, 1).Text, БиблиотекаКартинок.НайтиВСодержании);
			
			НомСтр = НомСтр + 1;
			МассивСтрок.Добавить(НомСтр); 
			НомСтрExcel = НомСтр + НачСтрока - 1;
			ИдентСтроки = "Строка " + НомСтрExcel;
			
			//Считываем текст из ячейки
			ТекстЯчейки = Excel.Cells(С_чик, 1).Text;
			//Считываем значение ячейки
			ДопИнфо = Excel.Cells(С_чик, 1).Value;
			БанкРеквиз = Excel.Cells(С_чик, 2).Value;
			ЮрАдрес = Excel.Cells(С_чик, 5).Value;
			ФИО = Excel.Cells(С_чик, 6).Value;
			КолПаёв = Excel.Cells(С_чик, 7).Value;
			ПочтовыйАдрес = Excel.Cells(С_чик, 8).Value;
			ДанныеРегистрации = Excel.Cells(С_чик, 9).Value;

			Банк = Excel.Cells(С_чик, 10).Value;
			БИК = Excel.Cells(С_чик,11).Value;	
			КоррСчет = Excel.Cells(С_чик, 12).Value;
			РасчетныйСчет = Excel.Cells(С_чик, 13).Value;

			КемВыдан = Excel.Cells(С_чик, 14).Value;
			ТипДок = Excel.Cells(С_чик, 15).Value;
			НомерПаспортЗначение =Excel.Cells(С_чик, 16).Value;
			Если ТипЗнч(НомерПаспортЗначение) = Тип("Число") Тогда
				НомерПаспорт = Формат(НомерПаспортЗначение, "ЧГ=0");
			ИначеЕсли ТипЗнч(НомерПаспортЗначение) = Тип("Строка") Тогда
				НомерПаспорт = СтрЗаменить(НомерПаспортЗначение, " ", "")
			КонецЕсли;
			СерияПаспортЗначение = СтрЗаменить(Excel.Cells(С_чик, 17).Value, " ", "");
			Если ТипЗнч(СерияПаспортЗначение) = Тип("Число") Тогда
				СерияПаспорт = Формат(СерияПаспортЗначение, "ЧГ=0");
			ИначеЕсли ТипЗнч(СерияПаспортЗначение) = Тип("Строка") Тогда
				СерияПаспорт = СтрЗаменить(СерияПаспортЗначение, " ", "")
			КонецЕсли;
			
			ДатаВыдачи = ДатаRegExp(Excel.Cells(С_чик, 18).Value, ИдентСтроки, "Даты выдачи паспорта");
			НРДid = СокрЛП(Excel.Cells(С_чик, 19).Value);

			ПайщикДатаРождения = Дата(1, 1, 1);
			
			СтруктураПаспорт = Новый Структура("КемВыдан, ТипДок, НомерПаспорт, СерияПаспорт, ДатаВыдачи", КемВыдан, ТипДок, НомерПаспорт, СерияПаспорт, ДатаВыдачи);
			
			СтруктураФИОДатаРождения = Новый Структура("ФИО, ДатаРождения", "", Дата(1,1,1));
			
			СтрокаНезаполненные = "";
			ФлНеРезидент = Ложь;
			СозданКонрагент = Ложь;
			
			Если ТипДок="21" Или ТипДок="12" Или ТипДок="10" Или ТипДок="00" Тогда
				ТипФЛ_ЮЛ = "ФЛ";
				ДатаРождения = ДатаRegExp(ДопИнфо, ИдентСтроки, "Даты рождения");
			Иначе
				ТипФЛ_ЮЛ = "ЮЛ";
				ДатаРождения = Дата(1,1,1);			
			КонецЕсли;
			
			ТЗСтр = ТП.Добавить(); 
			ТЗСтр.НомерСтроки = НомСтр;
			ТЗСтр.НомСтрФайл = НомСтр + НачСтрока - 1;
			ТЗСтр.ДатаРождения = ДатаРождения;
			ТЗСтр.НРДid = НРДid;
			
			Если ПустаяСтрока(СокрЛП(ТЗСтр.ДатаРождения)) Тогда
				СтрокаНезаполненные = СтрокаНезаполненные + "Дата рождения, ";		
			КонецЕсли;			
		    //ТЗСтр.НомерСчета = СтрТЗПайщики.DepoAccNumber;
		    //ТЗСтр.НомерСубСчета = УзелПаи.ТекстовоеСодержимое;
		    //ТЗСтр.ТипСчета = УзелПаи.ТекстовоеСодержимое;	
		    ТЗСтр.ФИО = ФИО;   
		    
		    Если ТипДок="12" Или ТипДок="10" Тогда
				ТЗСтр.НеРезидент = Истина;
				ФлНеРезидент = Истина;	
			КонецЕсли;
		    
		    ТЗСтр.ДокументЮЛФЛ = ДанныеРегистрации; 
		    СтруктураФИОДатаРождения.ДатаРождения = ТЗСтр.ДатаРождения; 
		    СтруктураФИОДатаРождения.ФИО = ФИО;
		    
		    ТЗСтр.ЮрАдрес = ЮрАдрес;
			Если ПустаяСтрока(СокрЛП(ЮрАдрес)) Тогда
				СтрокаНезаполненные = СтрокаНезаполненные + "Юр. адрес, ";		
			КонецЕсли;
			
			ТЗСтр.ПочтовыйАдрес = ПочтовыйАдрес;
		    ТЗСтр.ЭлектронныйАдрес = email(ДопИнфо);
		    //ПайщикФИО = СтрТЗПайщики.PartnerName;
		    Страна = Справочники.КлассификаторСтранМира.ПустаяСсылка();
		    Если ТипФЛ_ЮЛ="ФЛ" Тогда
			    
			    ТЗСтр.ДатаРождения = ДатаRegExp(ДопИнфо, ИдентСтроки, "Даты рождения"); 
			    ТЗСтр.НомерПаспорт = НомерПаспорт;
			    ТЗСтр.СерияПаспорт = СерияПаспорт;
			    
			    Если ПустаяСтрока(СокрЛП(ТЗСтр.СерияПаспорт)) И ТипДок="21" Тогда
			    	Если Не ПустаяСтрока(СокрЛП(ТЗСтр.НомерПаспорт)) Тогда                  
			    		Если СтрДлина(ТЗСтр.НомерПаспорт)>=10 Тогда
			    			ТЗСтр.СерияПаспорт = Лев(СокрЛП(ТЗСтр.НомерПаспорт), 4);
			    			ТЗСтр.НомерПаспорт = Прав(СокрЛП(ТЗСтр.НомерПаспорт), 6);	
			    		Иначе 
			    			СтрокаНезаполненные = СтрокаНезаполненные + "Серия паспорта, ";		
			    		КонецЕсли;	
			    	Иначе
			    		СтрокаНезаполненные = СтрокаНезаполненные + "Серия паспорта, ";		
			    	КонецЕсли;
			    КонецЕсли;
				Если ПустаяСтрока(СокрЛП(ТЗСтр.НомерПаспорт)) Тогда
					СтрокаНезаполненные = СтрокаНезаполненные + "Номер паспорта, ";		
				КонецЕсли;
			    
			    Контрагент = ПолучитьКонтрагент(ТЗСтр.ФИО, ТЗСтр.ДатаРождения, ТЗСтр.НомерПаспорт, ТЗСтр.СерияПаспорт, ТЗСтр.ДокументЮЛФЛ, СписЛогДубли, ТЗСтр.НРДid);
			
				Если Контрагент="РучнойВыбор" Тогда
					ТЗСтр.РучнойВыбор = Истина;
				Иначе 
					ТЗСтр.Контрагент = Контрагент;
				КонецЕсли;
			    
			    Если ФлСоздаватьКонрагентов И ТЗСтр.Контрагент=Справочники.Контрагенты.ПустаяСсылка() И Не ТЗСтр.РучнойВыбор Тогда
					ТЗСтр.Контрагент = СоздатьКонтрагента(ТЗСтр.ФИО, ТЗСтр.ДатаРождения, ТЗСтр.ИНН, ТЗСтр.НомерПаспорт, ТЗСтр.СерияПаспорт, СтруктураПаспорт, ТЗСтр.ЮрАдрес, ТЗСтр.ПочтовыйАдрес, ТЗСтр.ЭлектронныйАдрес, Страна, ИдентСтроки, ТЗСтр.НРДid);
					Если ФлСоздаватьЛицевыеСчета Тогда
						ТЗСтр.ЛицевойСчет = СоздатьЛицевойСчет(ТЗСтр.Контрагент);
					КонецЕсли;
					СозданКонрагент = Истина;	
				ИначеЕсли ФлСоздаватьЛицевыеСчета И ТЗСтр.Контрагент<>Справочники.Контрагенты.ПустаяСсылка() Тогда	
					
					СписЛицСчетов = Новый Массив; 
					Если МножитьЛицСчета Тогда
						СтруктураПоиск = Новый Структура("Контрагент", ТЗСтр.Контрагент);
						СтрокиТП = ТП.НайтиСтроки(СтруктураПоиск);
						Для Каждого СтрокаТП Из СтрокиТП Цикл
							Если ЗначениеЗаполнено(СтрокаТП.ЛицевойСчет) Тогда
							    СписЛицСчетов.Добавить(СтрокаТП.ЛицевойСчет);
							КонецЕсли;
						КонецЦикла;				
					КонецЕсли;
					
					ТЗСтр.ЛицевойСчет = СоздатьЛицевойСчет(ТЗСтр.Контрагент, СписЛицСчетов);		
						
				Иначе 
					ТЗСтр.ЛицевойСчет = ЛицевойСчет(ТЗСтр.Контрагент);	
				КонецЕсли;
				
				Если ПустаяСтрока(СокрЛП(ТЗСтр.ЛицевойСчет)) Тогда
					СтрокаНезаполненные = СтрокаНезаполненные + "Лицевой счёт, ";		
				КонецЕсли;
				
			ИначеЕсли ТипФЛ_ЮЛ="ЮЛ" Тогда
                
				СтрИННПолучатель = Реквизит(ДанныеРегистрации, "ИНН"); 
				Если Не ПустаяСтрока(СтрИННПолучатель)  Тогда
					КонтрагентЮЛ = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", СтрИННПолучатель);	
				Иначе
					КонтрагентЮЛ = Справочники.Контрагенты.ПустаяСсылка();
				КонецЕсли;
				
				Если КонтрагентЮЛ=Справочники.Контрагенты.ПустаяСсылка() Тогда
					СтрОГРНПолучатель = Реквизит(ДанныеРегистрации, "ОГРН");  
					Если Не ПустаяСтрока(СтрОГРНПолучатель)  Тогда
						ТЗСтр.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ОГРН", СтрОГРНПолучатель);
					Иначе
						СтрОГРНПолучатель = Реквизит(ДанныеРегистрации, "Св-во о регистрации");
						Если Не ПустаяСтрока(СтрОГРНПолучатель)  Тогда
							ТЗСтр.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ОГРН", СтрОГРНПолучатель);
							Если ТЗСтр.Контрагент=Справочники.Контрагенты.ПустаяСсылка() Тогда
								ТЗСтр.Контрагент = ПолучитьКонтрагентПоРеквизиту(СтрОГРНПолучатель, "НомерДокументаГосРег");
							КонецЕсли;
						Иначе						
							ТЗСтр.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
						КонецЕсли;						
					КонецЕсли;
				Иначе
					ТЗСтр.Контрагент = КонтрагентЮЛ;
				КонецЕсли;
			  //IMAPPS-20588{  
			   Если ФлСоздаватьЛицевыеСчета И ТЗСтр.Контрагент<>Справочники.Контрагенты.ПустаяСсылка() Тогда	
					СписЛицСчетов = Новый Массив; 
					Если МножитьЛицСчета Тогда
						СтруктураПоиск = Новый Структура("Контрагент", ТЗСтр.Контрагент);
						СтрокиТП = ТП.НайтиСтроки(СтруктураПоиск);
						Для Каждого СтрокаТП Из СтрокиТП Цикл
							Если ЗначениеЗаполнено(СтрокаТП.ЛицевойСчет) Тогда
							    СписЛицСчетов.Добавить(СтрокаТП.ЛицевойСчет);
							КонецЕсли;
						КонецЦикла;				
					КонецЕсли;
					
					ТЗСтр.ЛицевойСчет = СоздатьЛицевойСчет(ТЗСтр.Контрагент, СписЛицСчетов);		
						
				Иначе 
				//}IMAPPS-20588 
			    	ТЗСтр.ЛицевойСчет = ЛицевойСчет(ТЗСтр.Контрагент);	
			    КонецЕсли;
			    
			    Если ПустаяСтрока(СокрЛП(ТЗСтр.ЛицевойСчет)) Тогда
					СтрокаНезаполненные = СтрокаНезаполненные + "Лицевой счёт, ";		
				КонецЕсли;
			    
			КонецЕсли;
		    
	    	ТЗСтр.БанкРеквизиты = БанкРеквиз;
			
			СтрИННПолучатель = Реквизит(БанкРеквиз, "ИНН");
			СтрОГРНПолучатель = Реквизит(БанкРеквиз, "ОГРН");
			СтрРасчетныйСчет = Реквизит(БанкРеквиз, "р/с");
			Если ПустаяСтрока(СтрРасчетныйСчет) Тогда
				СтрРасчетныйСчет = Реквизит(БанкРеквиз, "Расч.счет");			
			КонецЕсли;
			
			Если ПустаяСтрока(СтрИННПолучатель) Тогда
				ТЗСтр.ПолучательПлатежа	= ?(НДПолучательПлатежа,  НоминальныйДержатель, ТЗСтр.Контрагент);
			Иначе
				ТЗСтр.ПолучательПлатежа	= ?(НДПолучательПлатежа,  НоминальныйДержатель, ПолучитьКонтрагентПоРеквизиту(СтрИННПолучатель, "ИНН"));
				Если ТЗСтр.ПолучательПлатежа=Справочники.Контрагенты.ПустаяСсылка() Тогда
					ТЗСтр.ПолучательПлатежа	= ПолучитьКонтрагентПоРеквизиту(СтрОГРНПолучатель, "ОГРН");
					Если ТЗСтр.ПолучательПлатежа=Справочники.Контрагенты.ПустаяСсылка() Тогда
						ТЗСтр.ПолучательПлатежа	= ПолучитьКонтрагентПоРеквизиту(СтрОГРНПолучатель, "НомерДокументаГосРег");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если Не ПустаяСтрока(СтрРасчетныйСчет) Тогда
			    ТЗСтр.БанковскийСчет = ПолучитьБанковскийСчет(СтрРасчетныйСчет, ТЗСтр.ПолучательПлатежа);				
			КонецЕсли;
			
			ТЗСтр.КолПаёв = Число(КолПаёв);
			
			Если Не ПустаяСтрока(СтрокаНезаполненные) Тогда
				СтрокаТЗЛог = ТЗЛог.Добавить();	
				СтрокаТЗЛог.ИдентСтроки = ИдентСтроки;
				СтрокаТЗЛог.СтруктураФИОДатаРождения = СтруктураФИОДатаРождения;
	    		СтрокаТЗЛог.НаименованиеСтроки = СокрЛП(ТЗСтр.Контрагент) + ", " + ФИО;
	    		СтрокаТЗЛог.СтрокаНезаполненные = Лев(СтрокаНезаполненные, СтрДлина(СтрокаНезаполненные)-2);
			КонецЕсли;
			          
			Если ФлНеРезидент И СозданКонрагент Тогда
				СтрокаТЗЛогРезидент = ТЗЛогРезидент.Добавить();	
				СтрокаТЗЛогРезидент.СтруктураФИОДатаРождения = СтруктураФИОДатаРождения;
				СтрокаТЗЛогРезидент.НаименованиеСтроки = СокрЛП(ТЗСтр.Контрагент)+ ", "+ СокрЛП(ТЗСтр.ФИО);
			КонецЕсли;
						
		КонецЦикла;  
		
		Если СписЛогДубли.Количество()>0 Тогда
			ТестСообщения = "В Справочнике Контрагенты найдены следующие дубли по признакам - совпадение по Полному Наименованию + день рождения либо Номер документа.  Просьба проверить";
			Сообщить(ТестСообщения, СтатусСообщения.Внимание);	
			Для каждого ЛогДубли Из СписЛогДубли Цикл
				Сообщить(ЛогДубли);
			КонецЦикла;		
		КонецЕсли;
		
		Если ТЗЛогРезидент.Количество()>0 Тогда
			ТестСообщения = "У следующих созданных в Аванкоре Контрагентов Документ не Паспорт РФ, проверить Резидентство и Страну:";
			Сообщить(ТестСообщения, СтатусСообщения.Внимание);
			ТестСообщения = "Внимание! У следующих созданных контрагентов проставлено временно гражданство Чехия. Требуется зайти в карточку созданного контрагента и поправить страну и гражданство на верные.";
			Сообщить(ТестСообщения, СтатусСообщения.Внимание);	
			Для каждого СтрокаТЗЛогРезидент Из ТЗЛогРезидент Цикл           
			    СтрокиТП = ТП.НайтиСтроки(СтрокаТЗЛогРезидент.СтруктураФИОДатаРождения);
				Сообщить("Строка " + СтрокиТП[0].НомерСтроки + ", " +СтрокаТЗЛогРезидент.НаименованиеСтроки);           
			КонецЦикла;		
		КонецЕсли;
		
		ТП.Сортировать("Контрагент");
		МассивСтрок = ОбщегоНазначенияАванкорКлиентСервер.СортироватьМассив(МассивСтрок);
		ТП.ЗагрузитьКолонку(МассивСтрок, "НомерСтроки");
		
		ТЗЛог.Сортировать("НаименованиеСтроки");
		Для каждого СтрокаТЗЛог Из ТЗЛог Цикл
		
			СтрокиТП = ТП.НайтиСтроки(СтрокаТЗЛог.СтруктураФИОДатаРождения);
			Сообщить("Строка " + СтрокиТП[0].НомерСтроки + ", " +СтрокаТЗЛог.НаименованиеСтроки + ". Не заполнены - "+ СтрокаТЗЛог.СтрокаНезаполненные);	
		
		КонецЦикла;
		
		
	Исключение
		Сообщить(ОписаниеОшибки());		 
	КонецПопытки;
	Если НЕ Excel = Неопределено тогда
		Excel.DisplayAlerts = 0; 
		Excel.Quit();
		Excel.DisplayAlerts = 1;		
	КонецЕсли;	
	
КонецПроцедуры //ПрочитатьФайлГарантExcel()

Процедура ПрочитатьФайлГарант()

	ТП.Очистить();
	
	ЧтениеXML = Новый ЧтениеXML;	
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	
	Построитель = Новый ПостроительDOM;
 
    Документ = Построитель.Прочитать(ЧтениеXML); 
    
    СписФонд_Атрибуты = Новый СписокЗначений;
    Для каждого Атрибут Из Документ.ЭлементДокумента.ДочерниеУзлы[0].Атрибуты Цикл
	    СписФонд_Атрибуты.Добавить(Атрибут.ЗначениеУзла, Атрибут.ИмяУзла);		
	КонецЦикла;
    
    Пайщики = Документ.ЭлементДокумента.ДочерниеУзлы[0].ДочерниеУзлы;
    
    ТЗЛог = Новый ТаблицаЗначений;
    ТЗЛог.Колонки.Добавить("ИдентСтроки"); 
    ТЗЛог.Колонки.Добавить("СтруктураФИОДатаРождения");
    ТЗЛог.Колонки.Добавить("НаименованиеСтроки");
    ТЗЛог.Колонки.Добавить("СтрокаНезаполненные");
    
    СписЛогДубли = Новый Массив;
    
    ТЗЛогРезидент = Новый ТаблицаЗначений;
    ТЗЛогРезидент.Колонки.Добавить("СтруктураФИОДатаРождения");
    ТЗЛогРезидент.Колонки.Добавить("НаименованиеСтроки");
    
    ТЗПайщики = Новый ТаблицаЗначений;
    ТЗПайщики.Колонки.Добавить("Id");
	ТЗПайщики.Колонки.Добавить("AdditionalInfo");
	ТЗПайщики.Колонки.Добавить("BankInfo");
	ТЗПайщики.Колонки.Добавить("DepoAccNumber");
	ТЗПайщики.Колонки.Добавить("Order");
	ТЗПайщики.Колонки.Добавить("OrderField");
	ТЗПайщики.Колонки.Добавить("Owner");
	ТЗПайщики.Колонки.Добавить("Owner_Caption");
	ТЗПайщики.Колонки.Добавить("PartnerAddress");
	ТЗПайщики.Колонки.Добавить("PartnerName");
	ТЗПайщики.Колонки.Добавить("PayQtyAcc");
	ТЗПайщики.Колонки.Добавить("PostAddress");
	ТЗПайщики.Колонки.Добавить("RegData");
   	 
    НомСтр = 0;
    МассивСтрок = Новый Массив;
	Для Каждого Пайщик Из Пайщики Цикл
        
        СтрТЗПайщики = ТЗПайщики.Добавить();
		Для каждого Пайщик_Атрибут Из Пайщик.Атрибуты Цикл
			СтрТЗПайщики[Пайщик_Атрибут.ИмяУзла] = Пайщик_Атрибут.ЗначениеУзла;
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого СтрТЗПайщики Из ТЗПайщики Цикл
	    
	    НаименованиеСтроки = "";
	    
	    ПайщикДатаРождения = Дата(1, 1, 1);
		СерияПаспорт = "";
		НомерПаспорт = "";
		
		НомСтр = НомСтр + 1;   
		МассивСтрок.Добавить(НомСтр);
		ИдентСтроки = "Строка " + НомСтр;
		
		СтруктураФИОДатаРождения = Новый Структура("ФИО, ДатаРождения", "", Дата(1,1,1));
        
        СтрокаНезаполненные = "";
		ФлНеРезидент = Ложь;
	    
	    ТипФЛ_ЮЛ = ОпределеитьТипФЛ_ЮЛ(СтрТЗПайщики.AdditionalInfo, СтрТЗПайщики.RegData);
	    
		ТЗСтр = ТП.Добавить(); 
		ТЗСтр.НомерСтроки = НомСтр;
		ТЗСтр.ДатаРождения = ПайщикДатаРождения;				
	    ТЗСтр.НомерСчета = СтрТЗПайщики.DepoAccNumber;
	    //ТЗСтр.НомерСубСчета = УзелПаи.ТекстовоеСодержимое;
	    //ТЗСтр.ТипСчета = УзелПаи.ТекстовоеСодержимое;	
	    ТЗСтр.ФИО = СтрТЗПайщики.PartnerName;   
	   
	    ТЗСтр.ДокументЮЛФЛ = СтрТЗПайщики.RegData;
	    СтруктураФИОДатаРождения.ФИО = СтрТЗПайщики.PartnerName;
	    
	    ТЗСтр.ЮрАдрес = СтрТЗПайщики.PartnerAddress;
		Если ПустаяСтрока(СокрЛП(СтрТЗПайщики.PartnerAddress)) Тогда
			СтрокаНезаполненные = СтрокаНезаполненные + "Юр. адрес, ";		
		КонецЕсли;
		
		ТЗСтр.ПочтовыйАдрес = СтрТЗПайщики.PostAddress;
	    ТЗСтр.ЭлектронныйАдрес = email(СтрТЗПайщики.AdditionalInfo);
	    //ПайщикФИО = СтрТЗПайщики.PartnerName;
	    Страна = Справочники.КлассификаторСтранМира.ПустаяСсылка();
	    Если ТипФЛ_ЮЛ="ФЛ" Тогда
		    ТЗСтр.ДатаРождения = ДатаRegExp(СтрТЗПайщики.AdditionalInfo, ИдентСтроки, "Даты рождения"); 
		    ТЗСтр.НомерПаспорт = Реквизит(СтрТЗПайщики.RegData, "Номер");
		    ТЗСтр.СерияПаспорт = Реквизит(СтрТЗПайщики.RegData, "серия");
		    
		    Контрагент = ПолучитьКонтрагент(ТЗСтр.ФИО, ТЗСтр.ДатаРождения, ТЗСтр.НомерПаспорт, ТЗСтр.СерияПаспорт, ТЗСтр.ДокументЮЛФЛ, СписЛогДубли);
		
			Если Контрагент="РучнойВыбор" Тогда
				ТЗСтр.РучнойВыбор = Истина;
			Иначе 
				ТЗСтр.Контрагент = Контрагент;
			КонецЕсли;
		    
		    Если ФлСоздаватьКонрагентов И ТЗСтр.Контрагент=Справочники.Контрагенты.ПустаяСсылка() И Не ТЗСтр.РучнойВыбор Тогда
				ТЗСтр.Контрагент = СоздатьКонтрагента(ТЗСтр.ФИО, ТЗСтр.ДатаРождения, ТЗСтр.ИНН, ТЗСтр.НомерПаспорт, ТЗСтр.СерияПаспорт, ТЗСтр.ДокументЮЛФЛ, ТЗСтр.ЮрАдрес, ТЗСтр.ПочтовыйАдрес, ТЗСтр.ЭлектронныйАдрес, Страна, ИдентСтроки);
				Если ФлСоздаватьЛицевыеСчета Тогда
					ТЗСтр.ЛицевойСчет = СоздатьЛицевойСчет(ТЗСтр.Контрагент);
				КонецЕсли;
			ИначеЕсли ФлСоздаватьЛицевыеСчета И ТЗСтр.Контрагент<>Справочники.Контрагенты.ПустаяСсылка() Тогда			
				
				СписЛицСчетов = Новый Массив; 
				Если МножитьЛицСчета Тогда
					СтруктураПоиск = Новый Структура("Контрагент", ТЗСтр.Контрагент);
					СтрокиТП = ТП.НайтиСтроки(СтруктураПоиск);
					Для Каждого СтрокаТП Из СтрокиТП Цикл
						Если ЗначениеЗаполнено(СтрокаТП.ЛицевойСчет) Тогда
						    СписЛицСчетов.Добавить(СтрокаТП.ЛицевойСчет);
						КонецЕсли;
					КонецЦикла;				
				КонецЕсли;
                
				ТЗСтр.ЛицевойСчет = СоздатьЛицевойСчет(ТЗСтр.Контрагент, СписЛицСчетов);	
				
			Иначе 
				ТЗСтр.ЛицевойСчет = ЛицевойСчет(ТЗСтр.Контрагент);	
			КонецЕсли;
		    
		ИначеЕсли ТипФЛ_ЮЛ="ЮЛ" Тогда
			ТЗСтр.ИНН = Реквизит(СтрТЗПайщики.AdditionalInfo, "ИНН");
			СтрОГРНПолучатель = Реквизит(СтрТЗПайщики.AdditionalInfo, "ОГРН");
			Контрагент = Справочники.Контрагенты.ПустаяСсылка(); 
			Если СокрЛП(ТЗСтр.ИНН)<>"" Тогда
				Контрагент = ПолучитьКонтрагентПоРеквизиту(ТЗСтр.ИНН, "ИНН");
			КонецЕсли;             
			
			Если Контрагент=Справочники.Контрагенты.ПустаяСсылка() Тогда
				ТЗСтр.Контрагент = ПолучитьКонтрагентПоРеквизиту(СтрОГРНПолучатель, "ОГРН");
				Если ТЗСтр.ПолучательПлатежа=Справочники.Контрагенты.ПустаяСсылка() Тогда
					ТЗСтр.ПолучательПлатежа	= ПолучитьКонтрагентПоРеквизиту(СтрОГРНПолучатель, "НомерДокументаГосРег");
				КонецЕсли;
			Иначе
				ТЗСтр.Контрагент = Контрагент;
			КонецЕсли;			
			
		КонецЕсли;
	    
    	СтруктураФИОДатаРождения.ДатаРождения = ТЗСтр.ДатаРождения;	
		//Если ПустаяСтрока(СокрЛП(СтрТЗПайщики.ТекстовоеСодержимое)) Или СтрТЗПайщики.ТекстовоеСодержимое="00.00.0000" Тогда
		//	СтрокаНезаполненные = СтрокаНезаполненные + "Дата рождения, ";		
		//КонецЕсли;
       
		ТЗСтр.БанкРеквизиты = СтрТЗПайщики.BankInfo;
		
		СтрИННПолучатель = Реквизит(СтрТЗПайщики.BankInfo, "ИНН");
		СтрРасчетныйСчет = Реквизит(СтрТЗПайщики.BankInfo, "р/с");
		Если ПустаяСтрока(СтрРасчетныйСчет) Тогда
			СтрРасчетныйСчет = Реквизит(СтрТЗПайщики.BankInfo, "Расч.счет");			
		КонецЕсли;
		
		Если ПустаяСтрока(СтрИННПолучатель) Тогда
			ТЗСтр.ПолучательПлатежа	= ТЗСтр.Контрагент;
		Иначе
			ТЗСтр.ПолучательПлатежа	= ПолучитьКонтрагентПоРеквизиту(СтрИННПолучатель, "ИНН");
		КонецЕсли;
		Если Не ПустаяСтрока(СтрРасчетныйСчет) Тогда
			ТЗСтр.БанковскийСчет = ПолучитьБанковскийСчет(СтрРасчетныйСчет, ТЗСтр.ПолучательПлатежа);
		КонецЕсли;
		
		ТЗСтр.КолПаёв = Число(СтрТЗПайщики.PayQtyAcc);
			
		
		//Если ТипФЛ_ЮЛ="ФЛ" Тогда
		//	Если СтрНайти(ТЗСтр.ДокументЮЛФЛ, "Паспорт гражданина РФ") Тогда
		//		ТЗСтр.СерияПаспорт = Сред(ТЗСтр.ДокументЮЛФЛ, 23, 5);
		//		ТЗСтр.НомерПаспорт = Сред(ТЗСтр.ДокументЮЛФЛ, 31, 6);
		//		Страна = Справочники.КлассификаторСтранМира.Россия;
		//		ФлНеРезидент = Ложь;
		//	ИначеЕсли СтрНайти(ТЗСтр.ДокументЮЛФЛ, "Паспорт иностранного гражданина") Тогда   
		//		ФлНеРезидент = Истина;
		//	//Паспорт иностранного гражданина -
 C752YWFZV выдан 04.12.2018г. ГОРОД КЁЛЬН
		//	//Паспорт иностранного гражданина -
 C4YJHXTZ6 выдан 23.02.2021г. Генеральное консульство Екатеринбурга
		//	//Паспорт иностранного гражданина -
 C4YJHXTZ6 выдан 23.02.2021г. Генеральное консульство Екатеринбурга
		//	//Паспорт иностранного гражданина -
 C752YWFZV выдан 04.12.2018г. ГОРОД КЁЛЬН
		//	//Паспорт иностранного гражданина -
 MC2976866 выдан 05.09.2017г. Минское РУВД Минской области
		//	//Паспорт иностранного гражданина -
 MC 2976866 выдан 05.09.2017г. Минское РУВД Минской области
		//	//Паспорт иностранного гражданина -
 АВ2560102 выдан 03.05.2012г. Пинский ГОВД Брестской области
		//	//Паспортиностранногогражданина0000
AA0102665 выдан 22.10.2014г. ГП "ЦГИР "РЕДЖИСТРУ"
		//	//ПаспортиностранногогражданинаKB
2138142 выдан 11.09.2015г. ОКТЯБРЬСКИЙ РОВД Г. МОГИЛЁВА
		//		ДокументЮЛФЛ = СтрЗаменить(ТЗСтр.ДокументЮЛФЛ, " ", "");
		//		Если СтрНайти(ДокументЮЛФЛ , "Паспортиностранногогражданина-
") Тогда
		//		    Если СтрНайти(ТЗСтр.ДокументЮЛФЛ , "MC 2976866") Тогда
		//				ТЗСтр.СерияПаспорт = "MC";
		//				ТЗСтр.НомерПаспорт = "2976866";
		//			Иначе
		//				//ТЗСтр.СерияПаспорт = Сред(ТЗСтр.ДокументЮЛФЛ, 23, 5);
		//				ТЗСтр.НомерПаспорт = Сред(ДокументЮЛФЛ, 32, 9);
		//			КонецЕсли;		
		//		ИначеЕсли СтрНайти(ДокументЮЛФЛ , "Паспортиностранногогражданина0000
") Тогда
		//		
		//			//ТЗСтр.СерияПаспорт = Сред(ТЗСтр.ДокументЮЛФЛ, 23, 5);
		//			ТЗСтр.НомерПаспорт = Сред(ДокументЮЛФЛ, 35, 9);
		//		ИначеЕсли СтрНайти(ДокументЮЛФЛ , "ПаспортиностранногогражданинаKB
") Тогда
		//		
		//			ТЗСтр.СерияПаспорт = "KB";
		//			ТЗСтр.НомерПаспорт = Сред(ДокументЮЛФЛ, 33, 7);	
		//		КонецЕсли;
		//	КонецЕсли;
		//	
		//	Если ПустаяСтрока(СокрЛП(ТЗСтр.СерияПаспорт)) Тогда
		//		СтрокаНезаполненные = СтрокаНезаполненные + "Серия паспорта, ";		
		//	КонецЕсли;
		//	Если ПустаяСтрока(СокрЛП(ТЗСтр.НомерПаспорт)) Тогда
		//		СтрокаНезаполненные = СтрокаНезаполненные + "Номер паспорта, ";		
		//	КонецЕсли;
		//	                      
		//	Контрагент = ПолучитьКонтрагент(ТЗСтр.ФИО, ТЗСтр.ДатаРождения, ТЗСтр.НомерПаспорт, ТЗСтр.СерияПаспорт, ТЗСтр.ДокументЮЛФЛ, СписЛогДубли);
		//
		//	Если Контрагент="РучнойВыбор" Тогда
		//		ТЗСтр.РучнойВыбор = Истина;
		//	Иначе 
		//		ТЗСтр.Контрагент = Контрагент;
		//	КонецЕсли;
		//	
		//	Если ФлСоздаватьКонрагентов И ТЗСтр.Контрагент=Справочники.Контрагенты.ПустаяСсылка() И Не ТЗСтр.РучнойВыбор Тогда
		//		ТЗСтр.Контрагент = СоздатьКонтрагента(ТЗСтр.ФИО, ТЗСтр.ДатаРождения, ТЗСтр.ИНН, ТЗСтр.НомерПаспорт, ТЗСтр.СерияПаспорт, ТЗСтр.ДокументЮЛФЛ, ТЗСтр.ЮрАдрес, ТЗСтр.ПочтовыйАдрес, Страна);
		//		Если ФлСоздаватьЛицевыеСчета Тогда
		//		
		//			ТЗСтр.ЛицевойСчет = СоздатьЛицевойСчет(ТЗСтр.Контрагент);
		//		
		//		КонецЕсли;
			//ИначеЕсли ФлСоздаватьЛицевыеСчета  И ТЗСтр.Контрагент<>Справочники.Контрагенты.ПустаяСсылка() Тогда			
			//	ТЗСтр.ЛицевойСчет = СоздатьЛицевойСчет(ТЗСтр.Контрагент);	
			//Иначе 
			//	ТЗСтр.ЛицевойСчет = ЛицевойСчет(ТЗСтр.Контрагент);	
			//КонецЕсли;
		//ИначеЕсли ТипФЛ_ЮЛ="ЮЛ" Тогда
						
			//Если СтрНайти(Документ, "ОГРН") Тогда
			//	ТЗСтр.СерияПаспорт = Сред(Документ, 23, 5);
			//	ТЗСтр.НомерПаспорт = Сред(Документ, 31, 6);
			//ИначеЕсли СтрНайти(Документ, "Паспорт иностранного гражданина") Тогда
			//	ТЗСтр.СерияПаспорт = Сред(Документ, 23, 5);
			//	ТЗСтр.НомерПаспорт = Сред(Документ, 31, 6);
			//КонецЕсли;
		//КонецЕсли; 
	
		Если Не ПустаяСтрока(СтрокаНезаполненные) Тогда
			СтрокаТЗЛог = ТЗЛог.Добавить();	
			СтрокаТЗЛог.ИдентСтроки = ИдентСтроки;
			СтрокаТЗЛог.СтруктураФИОДатаРождения = СтруктураФИОДатаРождения;
			СтрокаТЗЛог.НаименованиеСтроки = СокрЛП(ТЗСтр.Контрагент) + ", " + НаименованиеСтроки;
			СтрокаТЗЛог.СтрокаНезаполненные = Лев(СтрокаНезаполненные, СтрДлина(СтрокаНезаполненные)-2);
		КонецЕсли;
		          
		Если ФлНеРезидент Тогда
			СтрокаТЗЛогРезидент = ТЗЛогРезидент.Добавить();	
			СтрокаТЗЛогРезидент.СтруктураФИОДатаРождения = СтруктураФИОДатаРождения;
			СтрокаТЗЛогРезидент.НаименованиеСтроки = СокрЛП(ТЗСтр.Контрагент)+ ", "+ СокрЛП(ТЗСтр.ФИО);
		КонецЕсли;		          
	КонецЦикла;	
		
	Если СписЛогДубли.Количество()>0 Тогда
		ТестСообщения = "В Справочнике Контрагенты найдены следующие дубли по признакам - совпадение по Полному Наименованию + день рождения либо Номер документа.  Просьба проверить";
		Сообщить(ТестСообщения, СтатусСообщения.Внимание);	
		Для каждого ЛогДубли Из СписЛогДубли Цикл
			Сообщить(ЛогДубли);
		КонецЦикла;		
	КонецЕсли;
	
	Если ТЗЛогРезидент.Количество()>0 Тогда
		ТестСообщения = "У следующих созданных в Аванкоре Контрагентов Документ не Паспорт РФ, проверить Резиденство и Страну:";
		Сообщить(ТестСообщения, СтатусСообщения.Внимание);	
		Для каждого СтрокаТЗЛогРезидент Из ТЗЛогРезидент Цикл           
		    СтрокиТП = ТП.НайтиСтроки(СтрокаТЗЛогРезидент.СтруктураФИОДатаРождения);
			Сообщить("Строка " + СтрокиТП[0].НомерСтроки + ", " +СтрокаТЗЛогРезидент.НаименованиеСтроки);           
		КонецЦикла;		
	КонецЕсли;
	
	ТП.Сортировать("Контрагент");
	МассивСтрок = ОбщегоНазначенияАванкорКлиентСервер.СортироватьМассив(МассивСтрок);
	ТП.ЗагрузитьКолонку(МассивСтрок, "НомерСтроки");
	                                
	ТЗЛог.Сортировать("НаименованиеСтроки");
	Для каждого СтрокаТЗЛог Из ТЗЛог Цикл
	    
		//ТестСообщения = "В Справочнике Контрагенты найдены следующие дубли по признакам - совпадение по Полному Наименованию + день рождения либо Номер документа.  Просьба проверить";
		//Сообщить(ТестСообщения, СтатусСообщения.Внимание);
	    СтрокиТП = ТП.НайтиСтроки(СтрокаТЗЛог.СтруктураФИОДатаРождения);
        Сообщить("Строка " + СтрокиТП[0].НомерСтроки + ", " +СтрокаТЗЛог.НаименованиеСтроки + ". Не заполнены - "+ СтрокаТЗЛог.СтрокаНезаполненные);	
	
	КонецЦикла;
	
	ЧтениеXML.Закрыть();	

КонецПроцедуры

Процедура ПрочитатьФайлЦДФ()
	
	Сообщить("" + Формат(ТекущаяДата(), "ДФ='yyyy.MM.dd HH:mm:ss'; ДП=") + " Начало обработки эксель-файлов");
	
	ВыбранныйФайл = Новый Файл(ИмяФайла);
	
	СоответствиеДУЛ = СоздатьСоответвиеДУЛ();
	
	Попытка
		Если НЕ ВыбранныйФайл.Существует() Тогда
			ВызватьИсключение("Файл не существует " + ИмяФайла);
		КонецЕсли;
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Excel.Sheets(2).Select(); // Выбрали первый лист
		Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
		Если Версия = "8" тогда
			ФайлСтрок = Excel.Cells.CurrentRegion.Rows.Count;
			ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
		Иначе
			ФайлСтрок = Excel.Cells(1,1).SpecialCells(11).Row;
			ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;
		Конецесли;
		//В цикле перебираем строки файла 
		
		ТП.Очистить();
		
		НомСтр = 0;
		МассивСтрок = Новый Массив;
		
		ТЗЛог = Новый ТаблицаЗначений;
		ТЗЛог.Колонки.Добавить("ИдентСтроки"); 
		ТЗЛог.Колонки.Добавить("СтруктураФИОДатаРождения");
		ТЗЛог.Колонки.Добавить("НаименованиеСтроки");
		ТЗЛог.Колонки.Добавить("СтрокаНезаполненные");
		
		СписЛогДубли = Новый Массив;
		
		ТЗЛогРезидент = Новый ТаблицаЗначений;
		ТЗЛогРезидент.Колонки.Добавить("СтруктураФИОДатаРождения");
		ТЗЛогРезидент.Колонки.Добавить("НаименованиеСтроки");
		
		НачСтрока = 2;
		Для С_чик = НачСтрока по ФайлСтрок цикл 
			//Выводим пользователю информацию
			Состояние("Считываем строки из файла (" + С_чик + " из " + ФайлСтрок + ")", Цел(С_чик/ФайлСтрок*100) , Excel.Cells(С_чик, 1).Text, БиблиотекаКартинок.НайтиВСодержании);
			
			НомСтр = НомСтр + 1;
			МассивСтрок.Добавить(НомСтр); 
			НомСтрExcel = НомСтр + НачСтрока - 1;
			ИдентСтроки = "Строка " + НомСтрExcel;
			
			//Считываем текст из ячейки
			НомерСтрокиФайла = Excel.Cells(С_чик, 1).Value;
			
			Если Не ЗначениеЗаполнено(НомерСтрокиФайла) Тогда
				Продолжить;
			КонецЕсли;
			//Считываем значение ячейки
			НРДid = СокрЛП(Excel.Cells(С_чик, 3).Value);
			ЮрАдрес = Excel.Cells(С_чик, 13).Value;
			ТипСчета = Excel.Cells(С_чик, 4).Value;
			ФИО = Excel.Cells(С_чик, 5).Value;
			КолПаёв = Excel.Cells(С_чик, 20).Value;
			ПочтовыйАдрес = Excel.Cells(С_чик, 14).Value;
			ДанныеРегистрации = Excel.Cells(С_чик, 7).Value;
			
			Банк = Excel.Cells(С_чик, 17).Value;
			БИК = Excel.Cells(С_чик,15).Value;	
			КоррСчет = Excel.Cells(С_чик, 18).Value;
			РасчетныйСчет = СокрЛП(Excel.Cells(С_чик, 16).Value);
			ИНН = Excel.Cells(С_чик, 19).Value;
			
			БанкРеквиз = "р/с " + РасчетныйСчет + " в " + Банк + " к/с " + КоррСчет + " БИК " + БИК + " ИНН " + ИНН;
			
			ВидДок = Excel.Cells(С_чик, 8).Value;
			НомерПаспортЗначение =Excel.Cells(С_чик, 10).Value;
			Если ТипЗнч(НомерПаспортЗначение) = Тип("Число") Тогда
				НомерПаспорт = Формат(НомерПаспортЗначение, "ЧГ=0");
			ИначеЕсли ТипЗнч(НомерПаспортЗначение) = Тип("Строка") Тогда
				НомерПаспорт = СтрЗаменить(НомерПаспортЗначение, " ", "")
			КонецЕсли;
			СерияПаспортЗначение = СтрЗаменить(Excel.Cells(С_чик, 9).Value, " ", "");
			Если ТипЗнч(СерияПаспортЗначение) = Тип("Число") Тогда
				СерияПаспорт = Формат(СерияПаспортЗначение, "ЧГ=0");
			ИначеЕсли ТипЗнч(СерияПаспортЗначение) = Тип("Строка") Тогда
				СерияПаспорт = СтрЗаменить(СерияПаспортЗначение, " ", "")
			КонецЕсли;
			ДатаВыдачи = Excel.Cells(С_чик, 11).Value;
			КемВыдан = Excel.Cells(С_чик, 12).Value;
			
			КодТипДок = СоответствиеДУЛ.Получить(ВидДок);
			Если ЗначениеЗаполнено(КодТипДок) Тогда
				ТипДок = КодТипДок;
			Иначе
				ТипДок = Неопределено;
			КонецЕсли;
			
			ПайщикДатаРождения = Дата(1, 1, 1);
			
			СтруктураПаспорт = Новый Структура("КемВыдан, ТипДок, НомерПаспорт, СерияПаспорт, ДатаВыдачи", КемВыдан, ТипДок, НомерПаспорт, СерияПаспорт, ДатаВыдачи);
			
			СтруктураФИОДатаРождения = Новый Структура("ФИО, ДатаРождения", "", Дата(1,1,1));
			
			СтрокаНезаполненные = "";
			ФлНеРезидент = Ложь;
			СозданКонрагент = Ложь;
			
			Если ТипДок="21" Или ТипДок="12" Или ТипДок="10" Или ТипДок="00" Тогда
				ТипФЛ_ЮЛ = "ФЛ";
				ДатаРождения = Excel.Cells(С_чик, 24).Value;
			Иначе
				ТипФЛ_ЮЛ = "ЮЛ";
				ДатаРождения = Дата(1,1,1);
			КонецЕсли;
			
			ТЗСтр = ТП.Добавить(); 
			ТЗСтр.НомерСтроки = НомСтр;
			ТЗСтр.НомСтрФайл = НомСтр + НачСтрока - 1;
			ТЗСтр.ДатаРождения = ДатаРождения;
			ТЗСтр.НРДid = НРДid;
			
			Если ПустаяСтрока(СокрЛП(ТЗСтр.ДатаРождения)) Тогда
				СтрокаНезаполненные = СтрокаНезаполненные + "Дата рождения, ";
			КонецЕсли;
			ТЗСтр.ТипСчета = ТипСчета;
			ТЗСтр.ФИО = ФИО;
			
			Если ТипДок="12" Или ТипДок="10" Тогда
				ТЗСтр.НеРезидент = Истина;
				ФлНеРезидент = Истина;
			КонецЕсли;
			
			ТЗСтр.ДокументЮЛФЛ = ДанныеРегистрации; 
			СтруктураФИОДатаРождения.ДатаРождения = ТЗСтр.ДатаРождения; 
			СтруктураФИОДатаРождения.ФИО = ФИО;
			
			ТЗСтр.ЮрАдрес = ЮрАдрес;
			Если ПустаяСтрока(СокрЛП(ЮрАдрес)) Тогда
				СтрокаНезаполненные = СтрокаНезаполненные + "Юр. адрес, ";
			КонецЕсли;
			
			ТЗСтр.ПочтовыйАдрес = ПочтовыйАдрес;
			Страна = Справочники.КлассификаторСтранМира.ПустаяСсылка();
			Если ТипФЛ_ЮЛ="ФЛ" Тогда
				
				ТЗСтр.НомерПаспорт = НомерПаспорт;
				ТЗСтр.СерияПаспорт = СерияПаспорт;
				
				Если ПустаяСтрока(СокрЛП(ТЗСтр.СерияПаспорт)) И ТипДок="21" Тогда
					Если Не ПустаяСтрока(СокрЛП(ТЗСтр.НомерПаспорт)) Тогда
						Если СтрДлина(ТЗСтр.НомерПаспорт)>=10 Тогда
							ТЗСтр.СерияПаспорт = Лев(СокрЛП(ТЗСтр.НомерПаспорт), 4);
							ТЗСтр.НомерПаспорт = Прав(СокрЛП(ТЗСтр.НомерПаспорт), 6);
						Иначе 
							СтрокаНезаполненные = СтрокаНезаполненные + "Серия паспорта, ";
						КонецЕсли;
					Иначе
						СтрокаНезаполненные = СтрокаНезаполненные + "Серия паспорта, ";
					КонецЕсли;
				КонецЕсли;
				Если ПустаяСтрока(СокрЛП(ТЗСтр.НомерПаспорт)) Тогда
					СтрокаНезаполненные = СтрокаНезаполненные + "Номер паспорта, ";
				КонецЕсли;
				
				Контрагент = ПолучитьКонтрагент(ТЗСтр.ФИО, ТЗСтр.ДатаРождения, ТЗСтр.НомерПаспорт, ТЗСтр.СерияПаспорт, ТЗСтр.ДокументЮЛФЛ, СписЛогДубли, ТЗСтр.НРДid);
				
				Если Контрагент="РучнойВыбор" Тогда
					ТЗСтр.РучнойВыбор = Истина;
				Иначе 
					ТЗСтр.Контрагент = Контрагент;
				КонецЕсли;
				
				Если ФлСоздаватьКонрагентов И ТЗСтр.Контрагент=Справочники.Контрагенты.ПустаяСсылка() И Не ТЗСтр.РучнойВыбор Тогда
					ТЗСтр.Контрагент = СоздатьКонтрагента(ТЗСтр.ФИО, ТЗСтр.ДатаРождения, ТЗСтр.ИНН, ТЗСтр.НомерПаспорт, ТЗСтр.СерияПаспорт, СтруктураПаспорт, ТЗСтр.ЮрАдрес, ТЗСтр.ПочтовыйАдрес, ТЗСтр.ЭлектронныйАдрес, Страна, ИдентСтроки, ТЗСтр.НРДid);
					Если ФлСоздаватьЛицевыеСчета Тогда
						ТЗСтр.ЛицевойСчет = СоздатьЛицевойСчет(ТЗСтр.Контрагент);
					КонецЕсли;
					СозданКонрагент = Истина;	
				ИначеЕсли ФлСоздаватьЛицевыеСчета И ТЗСтр.Контрагент<>Справочники.Контрагенты.ПустаяСсылка() Тогда	
					
					СписЛицСчетов = Новый Массив; 
					Если МножитьЛицСчета Тогда
						СтруктураПоиск = Новый Структура("Контрагент", ТЗСтр.Контрагент);
						СтрокиТП = ТП.НайтиСтроки(СтруктураПоиск);
						Для Каждого СтрокаТП Из СтрокиТП Цикл
							Если ЗначениеЗаполнено(СтрокаТП.ЛицевойСчет) Тогда
								СписЛицСчетов.Добавить(СтрокаТП.ЛицевойСчет);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					ТЗСтр.ЛицевойСчет = СоздатьЛицевойСчет(ТЗСтр.Контрагент, СписЛицСчетов);
					
				Иначе
					ТЗСтр.ЛицевойСчет = ЛицевойСчет(ТЗСтр.Контрагент);
				КонецЕсли;
				
				Если ПустаяСтрока(СокрЛП(ТЗСтр.ЛицевойСчет)) Тогда
					СтрокаНезаполненные = СтрокаНезаполненные + "Лицевой счёт, ";
				КонецЕсли;
				
			ИначеЕсли ТипФЛ_ЮЛ="ЮЛ" Тогда
				
				СтрИННПолучатель = Реквизит(ДанныеРегистрации, "ИНН"); 
				Если Не ПустаяСтрока(СтрИННПолучатель)  Тогда
					КонтрагентЮЛ = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", СтрИННПолучатель);	
				Иначе
					КонтрагентЮЛ = Справочники.Контрагенты.ПустаяСсылка();
				КонецЕсли;
				
				Если КонтрагентЮЛ=Справочники.Контрагенты.ПустаяСсылка() Тогда
					СтрОГРНПолучатель = Реквизит(ДанныеРегистрации, "ОГРН");  
					Если Не ПустаяСтрока(СтрОГРНПолучатель)  Тогда
						ТЗСтр.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ОГРН", СтрОГРНПолучатель);
					Иначе
						СтрОГРНПолучатель = Реквизит(ДанныеРегистрации, "Св-во о регистрации");
						Если Не ПустаяСтрока(СтрОГРНПолучатель)  Тогда
							ТЗСтр.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ОГРН", СтрОГРНПолучатель);
							Если ТЗСтр.Контрагент=Справочники.Контрагенты.ПустаяСсылка() Тогда
								ТЗСтр.Контрагент = ПолучитьКонтрагентПоРеквизиту(СтрОГРНПолучатель, "НомерДокументаГосРег");
							КонецЕсли;
						Иначе
							ТЗСтр.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
						КонецЕсли;
					КонецЕсли;
				Иначе
					ТЗСтр.Контрагент = КонтрагентЮЛ;
				КонецЕсли;
				Если ФлСоздаватьЛицевыеСчета И ТЗСтр.Контрагент<>Справочники.Контрагенты.ПустаяСсылка() Тогда	
					СписЛицСчетов = Новый Массив; 
					Если МножитьЛицСчета Тогда
						СтруктураПоиск = Новый Структура("Контрагент", ТЗСтр.Контрагент);
						СтрокиТП = ТП.НайтиСтроки(СтруктураПоиск);
						Для Каждого СтрокаТП Из СтрокиТП Цикл
							Если ЗначениеЗаполнено(СтрокаТП.ЛицевойСчет) Тогда
								СписЛицСчетов.Добавить(СтрокаТП.ЛицевойСчет);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					ТЗСтр.ЛицевойСчет = СоздатьЛицевойСчет(ТЗСтр.Контрагент, СписЛицСчетов);
					
				Иначе
					ТЗСтр.ЛицевойСчет = ЛицевойСчет(ТЗСтр.Контрагент);
				КонецЕсли;
				
				Если ПустаяСтрока(СокрЛП(ТЗСтр.ЛицевойСчет)) Тогда
					СтрокаНезаполненные = СтрокаНезаполненные + "Лицевой счёт, ";
				КонецЕсли;
				
			КонецЕсли;
			
			ТЗСтр.БанкРеквизиты = БанкРеквиз;
			
			СтрИННПолучатель = Реквизит(БанкРеквиз, "ИНН");
			СтрОГРНПолучатель = Реквизит(БанкРеквиз, "ОГРН");
			СтрРасчетныйСчет = РасчетныйСчет;
			Если ПустаяСтрока(СтрРасчетныйСчет) Тогда
				СтрРасчетныйСчет = Реквизит(БанкРеквиз, "Расч.счет");
			КонецЕсли;
			
			Если ПустаяСтрока(СтрИННПолучатель) Тогда
				ТЗСтр.ПолучательПлатежа	= ?(НДПолучательПлатежа,  НоминальныйДержатель, ТЗСтр.Контрагент);
			Иначе
				ТЗСтр.ПолучательПлатежа	= ?(НДПолучательПлатежа,  НоминальныйДержатель, ПолучитьКонтрагентПоРеквизиту(СтрИННПолучатель, "ИНН"));
				Если ТЗСтр.ПолучательПлатежа=Справочники.Контрагенты.ПустаяСсылка() Тогда
					ТЗСтр.ПолучательПлатежа	= ПолучитьКонтрагентПоРеквизиту(СтрОГРНПолучатель, "ОГРН");
					Если ТЗСтр.ПолучательПлатежа=Справочники.Контрагенты.ПустаяСсылка() Тогда
						ТЗСтр.ПолучательПлатежа	= ПолучитьКонтрагентПоРеквизиту(СтрОГРНПолучатель, "НомерДокументаГосРег");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если Не ПустаяСтрока(СтрРасчетныйСчет) Тогда
				ТЗСтр.БанковскийСчет = ПолучитьБанковскийСчет(СтрРасчетныйСчет, ТЗСтр.ПолучательПлатежа);
				
				Если ТЗСтр.БанковскийСчет = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда
					ТЗСтр.БанковскийСчет = ПолучитьБанковскийСчет(СтрРасчетныйСчет, НоминальныйДержатель);
				КонецЕсли;
				
			КонецЕсли;
			
			Если КолПаёв = Неопределено Тогда
				ТЗСтр.КолПаёв = 0;
			Иначе
				ТЗСтр.КолПаёв = Число(КолПаёв);
			КонецЕсли;
			
			Если Не ПустаяСтрока(СтрокаНезаполненные) Тогда
				СтрокаТЗЛог = ТЗЛог.Добавить();	
				СтрокаТЗЛог.ИдентСтроки = ИдентСтроки;
				СтрокаТЗЛог.СтруктураФИОДатаРождения = СтруктураФИОДатаРождения;
				СтрокаТЗЛог.НаименованиеСтроки = СокрЛП(ТЗСтр.Контрагент) + ", " + ФИО;
				СтрокаТЗЛог.СтрокаНезаполненные = Лев(СтрокаНезаполненные, СтрДлина(СтрокаНезаполненные)-2);
			КонецЕсли;
			
			Если ФлНеРезидент И СозданКонрагент Тогда
				СтрокаТЗЛогРезидент = ТЗЛогРезидент.Добавить();
				СтрокаТЗЛогРезидент.СтруктураФИОДатаРождения = СтруктураФИОДатаРождения;
				СтрокаТЗЛогРезидент.НаименованиеСтроки = СокрЛП(ТЗСтр.Контрагент)+ ", "+ СокрЛП(ТЗСтр.ФИО);
			КонецЕсли;
			
		КонецЦикла;
		
		Если СписЛогДубли.Количество()>0 Тогда
			ТестСообщения = "В Справочнике Контрагенты найдены следующие дубли по признакам - совпадение по Полному Наименованию + день рождения либо Номер документа.  Просьба проверить";
			Сообщить(ТестСообщения, СтатусСообщения.Внимание);
			Для каждого ЛогДубли Из СписЛогДубли Цикл
				Сообщить(ЛогДубли);
			КонецЦикла;
		КонецЕсли;
		
		Если ТЗЛогРезидент.Количество()>0 Тогда
			ТестСообщения = "У следующих созданных в Аванкоре Контрагентов Документ не Паспорт РФ, проверить Резидентство и Страну:";
			Сообщить(ТестСообщения, СтатусСообщения.Внимание);
			ТестСообщения = "Внимание! У следующих созданных контрагентов проставлено временно гражданство Чехия. Требуется зайти в карточку созданного контрагента и поправить страну и гражданство на верные.";
			Сообщить(ТестСообщения, СтатусСообщения.Внимание);
			Для каждого СтрокаТЗЛогРезидент Из ТЗЛогРезидент Цикл
				СтрокиТП = ТП.НайтиСтроки(СтрокаТЗЛогРезидент.СтруктураФИОДатаРождения);
				Сообщить("Строка " + СтрокиТП[0].НомерСтроки + ", " +СтрокаТЗЛогРезидент.НаименованиеСтроки);           
			КонецЦикла;
		КонецЕсли;
		
		ТП.Сортировать("Контрагент");
		МассивСтрок = ОбщегоНазначенияАванкорКлиентСервер.СортироватьМассив(МассивСтрок);
		ТП.ЗагрузитьКолонку(МассивСтрок, "НомерСтроки");
		
		ТЗЛог.Сортировать("НаименованиеСтроки");
		Для каждого СтрокаТЗЛог Из ТЗЛог Цикл
			
			СтрокиТП = ТП.НайтиСтроки(СтрокаТЗЛог.СтруктураФИОДатаРождения);
			Сообщить("Строка " + СтрокиТП[0].НомерСтроки + ", " +СтрокаТЗЛог.НаименованиеСтроки + ". Не заполнены - "+ СтрокаТЗЛог.СтрокаНезаполненные);	
			
		КонецЦикла;
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Если НЕ Excel = Неопределено тогда
		Excel.DisplayAlerts = 0; 
		Excel.Quit();
		Excel.DisplayAlerts = 1;
	КонецЕсли;
	
	Сообщить("" + Формат(ТекущаяДата(), "ДФ='yyyy.MM.dd HH:mm:ss'; ДП=") + " Окончание обработки эксель-файлов");
	
КонецПроцедуры //ПрочитатьФайлГарантExcel()

Процедура ПрочитатьФайлОт220621() //предыдущий формат файла
	
	ТП.Очистить();
	
	ЧтениеXML = Новый ЧтениеXML;	
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	
	Построитель = Новый ПостроительDOM;
 
    Документ = Построитель.Прочитать(ЧтениеXML);
    Пайщики = Документ.ЭлементДокумента.ДочерниеУзлы[12];
	Для Каждого Пайщик Из Пайщики.ДочерниеУзлы Цикл
		
		ПайщикДатаРождения = Дата(1, 1, 1);
		СерияПаспорт = "";
		НомерПаспорт = "";
		Для каждого УзелПаи Из Пайщик.ДочерниеУзлы Цикл
						
			Если УзелПаи.ИмяУзла="party_dtls" Тогда
				
				ПайщикФИО = УзелПаи.ДочерниеУзлы[0].ТекстовоеСодержимое;
				Для каждого УзелИнфо  Из УзелПаи.ДочерниеУзлы[2].ДочерниеУзлы[0].ДочерниеУзлы[0].ДочерниеУзлы Цикл
					Если УзелИнфо.ИмяУзла="birthday" Тогда
						ПайщикДатаРождения = ПреобразоватьДата(УзелИнфо.ТекстовоеСодержимое);
					ИначеЕсли УзелИнфо.ИмяУзла="person_id" Тогда
						Для каждого УзелПаспорт Из УзелИнфо.ДочерниеУзлы[1].ДочерниеУзлы Цикл
							Если УзелПаспорт.ИмяУзла="doc_ser" Тогда
								СерияПаспорт = УзелПаспорт.ТекстовоеСодержимое;		
							ИначеЕсли УзелПаспорт.ИмяУзла="doc_num" Тогда
								НомерПаспорт = УзелПаспорт.ТекстовоеСодержимое;
							ИначеЕсли УзелПаспорт.ИмяУзла="dtls_apart" Тогда
								СерияПаспорт = УзелПаспорт.ДочерниеУзлы[0].ТекстовоеСодержимое;		
								НомерПаспорт = УзелПаспорт.ДочерниеУзлы[1].ТекстовоеСодержимое;
						    КонецЕсли;
						КонецЦикла;
					КонецЕсли;	
				КонецЦикла;
				
			ИначеЕсли УзелПаи.ИмяУзла="security_balance"  Тогда
				УзелКолПаёв = УзелПаи.ДочерниеУзлы[1].ДочерниеУзлы[0].ДочерниеУзлы[0];
				КолПаёв = УзелКолПаёв.ТекстовоеСодержимое;
	 		КонецЕсли;
		КонецЦикла;
				
		ТЗСтр = ТП.Добавить();
		ТЗСтр.ФИО = ПайщикФИО;
		ТЗСтр.ДатаРождения = ПайщикДатаРождения;
		ТЗСтр.СерияПаспорт = СерияПаспорт;
		ТЗСтр.НомерПаспорт = НомерПаспорт;
		ТЗСтр.Контрагент = ПолучитьКонтрагент(ПайщикФИО, ПайщикДатаРождения, НомерПаспорт);
		
		ТЗСтр.КолПаёв = КолПаёв;
		
	КонецЦикла;
 
    ЧтениеXML.Закрыть();
КонецПроцедуры

Функция ПолучитьКонтрагентПоРеквизиту(ЗначениеРеквизита, ИмяРеквизита)
	Возврат Справочники.Контрагенты.НайтиПоРеквизиту(ИмяРеквизита, ЗначениеРеквизита);
КонецФункции // ПолучитьКонтрагентПоРеквизиту()

Функция ПолучитьКонтрагент(ПайщикФИО, ПайщикДатаРождения, ДокументНомер, ДокументСерия = "", ДокументСтрока = "", СписЛогДубли = "", НРДid = Неопределено)
	
	Контрагент = ПолучитьКонтрагентаПоНРДid(НРДid);
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Контрагент;
	КонецЕсли;
	
	ФИОЗнач = ПайщикФИО;
	Фамилия  = ВыделитьСлово(ФИОЗнач);
	Имя      = ВыделитьСлово(ФИОЗнач);
	Отчество = СокрЛП(ФИОЗнач);
	
	НормализованноеФИО = "" + Фамилия + " " + Имя + " " + Отчество;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка, 
		//IMAPPS-36530
		|	МАКСИМУМ(Контрагенты.ДатаРождения) КАК ДатаРождения
		|ИЗ
		|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПервых КАК ПаспортныеДанныеФизЛицСрезПервых
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО ПаспортныеДанныеФизЛицСрезПервых.ФизЛицо = Контрагенты.Ссылка
		|ГДЕ
		|	(Контрагенты.Наименование = &Наименование
		|			ИЛИ Контрагенты.НаименованиеПолное = &Наименование)
		|	И ВЫБОР
		|			КОГДА &ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
		//IMAPPS-36530
		|					ИЛИ Контрагенты.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ПаспортныеДанныеФизЛицСрезПервых.ДокументНомер = &ДокументНомер
		|			ИНАЧЕ Контрагенты.ДатаРождения = &ДатаРождения
		|		КОНЕЦ
		|	И НЕ Контрагенты.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	Контрагенты.Ссылка";
	
	Запрос.УстановитьПараметр("ДатаРождения", ПайщикДатаРождения);
	Запрос.УстановитьПараметр("Наименование", НормализованноеФИО);
	Запрос.УстановитьПараметр("ДокументНомер", ДокументНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			НРДidКонтрагента = ПолучитьНРДidКонтрагента(ВыборкаДетальныеЗаписи.Ссылка);
			
			Если Не ЗначениеЗаполнено(НРДidКонтрагента) Тогда
				ЗаписатьНРДid(ВыборкаДетальныеЗаписи.Ссылка, НРДid);
			КонецЕсли;
			
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
	ИначеЕсли ВыборкаДетальныеЗаписи.Количество()>1 Тогда
		СписокДублей = Новый Массив;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СписокДублей.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			СписЛогДубли.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			//СсылкаВозврат = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЛицевыеСчетаПайщиков.Пайщик КАК Пайщик
			|ИЗ
			|	Справочник.ЛицевыеСчетаПайщиков КАК ЛицевыеСчетаПайщиков
			|ГДЕ
			|	ЛицевыеСчетаПайщиков.Пайщик В(&МассивПайщик)
			|	И ЛицевыеСчетаПайщиков.Владелец = &Владелец 
			//IMAPPS-36530
			|	И ЛицевыеСчетаПайщиков.ВидЛицевогоСчета В (&ВидЛицевогоСчета, ЗНАЧЕНИЕ(Перечисление.ВидыЛицевыхСчетов.Технический))
			|	И НЕ ЛицевыеСчетаПайщиков.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ВидЛицевогоСчета", Перечисления.ВидыЛицевыхСчетов.СчетНоминальногоДержателя);
		Запрос.УстановитьПараметр("Владелец", Фонд);
		Запрос.УстановитьПараметр("МассивПайщик", СписокДублей);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			НРДidКонтрагента = ПолучитьНРДidКонтрагента(ВыборкаДетальныеЗаписи.Пайщик);
			
			Если Не ЗначениеЗаполнено(НРДidКонтрагента) Тогда
				ЗаписатьНРДid(ВыборкаДетальныеЗаписи.Пайщик, НРДid);
			КонецЕсли;
			
			Возврат ВыборкаДетальныеЗаписи.Пайщик;
		КонецЕсли;
		
		Возврат "РучнойВыбор";
	Иначе
	
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//	"ВЫБРАТЬ ПЕРВЫЕ 1
		//	|	ПаспортныеДанныеФизЛицСрезПервых.ФизЛицо КАК ФизЛицо
		//	|ИЗ
		//	|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПервых КАК ПаспортныеДанныеФизЛицСрезПервых
		//	|ГДЕ
		//	|	ПаспортныеДанныеФизЛицСрезПервых.ДокументСерия = &ДокументСерия
		//	|	И ПаспортныеДанныеФизЛицСрезПервых.ДокументНомер = &ДокументНомер";
		//
		//Запрос.УстановитьПараметр("ДокументСерия", СтрЗаменить(ДокументСерия, " ", ""));
		//Запрос.УстановитьПараметр("ДокументНомер", СтрЗаменить(ДокументНомер, " ", ""));
		//
		//РезультатЗапроса = Запрос.Выполнить();
		//
		//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		//
		//	Возврат ВыборкаДетальныеЗаписи.ФизЛицо;	
		//
		//КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции // ПолучитьКонтрагент()

Функция ПреобразоватьДата(ТекстДата)

	Год = Лев(ТекстДата, 4);
	Месяц = Сред(ТекстДата, 6, 2);
	День = Прав(ТекстДата, 2);
	
	Возврат Дата(Год, Месяц, День);

КонецФункции // ПреобразоватьДата()

Процедура СоздатьДокумент(Кнопка)
	
	//ПолучателиПлатежа = ТП.Скопировать(,"ПолучательПлатежа");
	//ПолучателиПлатежа.Свернуть("ПолучательПлатежа");
	//Для Каждого Получатель из ПолучателиПлатежа Цикл
		НовыйДокумент = Документы.СписокВладельцевНоминальногоДержателя.СоздатьДокумент();
		НовыйДокумент.Дата = ДатаДок;
		НовыйДокумент.ПИФ = Фонд;
		НовыйДокумент.НоминальныйДержатель = НоминальныйДержатель;
		НовыйДокумент.ЛицевойСчет = ЛицевойСчет;
		//НовыйДокумент.Депонент = Получатель.ПолучательПлатежа;
		//НайдСтроки = ТП.НайтиСтроки(Новый Структура("ПолучательПлатежа", Получатель.ПолучательПлатежа));
		Для каждого СтроТП Из ТП Цикл
			Если не ЗначениеЗаполнено(СтроТП.Контрагент) Или 
				Не ЗначениеЗаполнено(СтроТП.КолПаёв) ИЛИ
				Не ЗначениеЗаполнено(СтроТП.ЛицевойСчет) ИЛИ
				Не ЗначениеЗаполнено(СтроТП.БанковскийСчет) Тогда
				Сообщить("По строке "+СтроТП.НомерСтроки+" - Не заполнены обязательные поля у " + СтроТП.ФИО + ". Не заполнены: " + 
				?(ЗначениеЗаполнено(СтроТП.Контрагент), "", "контрагент") + ", " +
				?(ЗначениеЗаполнено(СтроТП.КолПаёв), "", "количество паёв") + ", " +
				?(ЗначениеЗаполнено(СтроТП.ЛицевойСчет), "", "лицевой счет") + ", " +
				?(ЗначениеЗаполнено(СтроТП.БанковскийСчет), "", "банковский счет"));
				Продолжить;
			КонецЕсли;
			НовыйВладделец = НовыйДокумент.Владельцы.Добавить();
			НовыйВладделец.Контрагент = СтроТП.Контрагент;
			НовыйВладделец.КоличествоПаев = СтроТП.КолПаёв;
			НовыйВладделец.ЛицевойСчет = СтроТП.ЛицевойСчет;
			НовыйВладделец.БанковскийСчет = СтроТП.БанковскийСчет;
			НовыйВладделец.НРДid = СтроТП.НРДid;
			//НовыйВладделец.Депонент = СтроТП.ПолучательПлатежа;
		КонецЦикла;
		
		//НовыйДокумент.Владельцы.Свернуть("Контрагент, ЛицевойСчет, БанковскийСчет","КоличествоПаев");
		Форма = НовыйДокумент.ПолучитьФорму("ФормаДокумента");
		Форма.Открыть();
	//КонецЦикла;
	
КонецПроцедуры

Процедура НоминальныйДержательПриИзменении(Элемент)
	
	ЛицевойСчет = ЗаполнитьЛицевойСчет();
	
КонецПроцедуры

Процедура ФондПриИзменении(Элемент)
	
	ЛицевойСчет = ЗаполнитьЛицевойСчет();
	
КонецПроцедуры


Процедура ТППриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если Не ЗначениеЗаполнено(ДанныеСтроки.Контрагент) Тогда
		
		ОформлениеСтроки.ЦветФона = WebЦвета.Бежевый;		
	
	КонецЕсли;
	Если ДанныеСтроки.РучнойВыбор Тогда
	
		ОформлениеСтроки.ЦветФона = WebЦвета.Лазурный;	
	
	КонецЕсли;
КонецПроцедуры

Процедура ТПЛицевойСчетНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭлементыФормы.ТП.Видимость=Ложь Тогда
		Предупреждение("Отмените отборы и повторите выбор."); 
		Возврат;
	КонецЕсли;
	
	//IMAPPS-19394 ++
	ПараметрыОтбора = Новый Структура("Владелец, Пайщик", Фонд, ЭлементыФормы.ТП.ТекущиеДанные.Контрагент);
	//ПараметрыОтбора = Новый Структура("Владелец", Фонд);
	//IMAPPS-19394 --
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	 
	ОткрытьФорму("Справочник.ЛицевыеСчетаПайщиков.Форма.ФормаВыбораУпр", ПараметрыФормы, Элемент);
	
КонецПроцедуры

Функция ЗаполнитьЛицевойСчет()

	Если ЗначениеЗаполнено(Фонд) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЛицевыеСчетаПайщиков.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ЛицевыеСчетаПайщиков КАК ЛицевыеСчетаПайщиков
			|ГДЕ
			|	ЛицевыеСчетаПайщиков.Владелец = &Фонд
			|	И ЛицевыеСчетаПайщиков.Пайщик = &Владелец
			|";
	
		
		Запрос.УстановитьПараметр("Владелец", НоминальныйДержатель);
		Запрос.УстановитьПараметр("Фонд", Фонд);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
	
	КонецЕсли;

	Возврат Справочники.ЛицевыеСчетаПайщиков.ПустаяСсылка();
	
КонецФункции

Процедура ЛицевойСчетНачалоВыбора(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ТПКонтрагентПриИзменении(Элемент)
	ЭлементыФормы.ТП.ТекущиеДанные.ЛицевойСчет = ЛицевойСчет(Элемент.Значение);
КонецПроцедуры

Процедура ТППустойКонтрагентПриИзменении(Элемент)
	ЭлементыФормы.ТППустойКонтрагент.ТекущиеДанные.ЛицевойСчет = ЛицевойСчет(Элемент.Значение);
КонецПроцедуры

Процедура КоманднаяПанель2ПоказатьНенайденныхКонтрагентов(Кнопка)
	
	Если Кнопка.Имя="ПоказатьНенайденныхКонтрагентов" Тогда
		
		Если ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНезаполненДР.Пометка Тогда
			ПоказатьПредупреждение(, "Отбор ненаденных конрагентов невозможен. Отключите отбор по незаполнненым дням роджения");
			Возврат;		
		КонецЕсли;
		
		Если ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНезаполненныеДублиЛС.Пометка Тогда
			ПоказатьПредупреждение(, "Отбор по незаполнненым дням роджения невозможен. Отключите отбор незаполненных и дублей ЛС.");
			Возврат;
		КонецЕсли;
		
		Если ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНенайденныхКонтрагентов.Пометка Тогда
			
			ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНенайденныхКонтрагентов.Пометка = Ложь;
			ЭлементыФормы.ТП.Видимость = Истина;
			ЭлементыФормы.ТППустойКонтрагент.Видимость = Ложь;
			
			Для каждого СтрокаМассива Из СписСтрокПустойКонтрагент Цикл
			
				ПараметрыОтбора = Новый Структура("БанкРеквизиты, ДокументЮЛФЛ, ИНН, КолПаёв, НомерПаспорт, НомерСубСчета, ФИО, ЮрАдрес", СтрокаМассива.Значение.БанкРеквизиты, СтрокаМассива.Значение.ДокументЮЛФЛ, СтрокаМассива.Значение.ИНН, СтрокаМассива.Значение.КолПаёв, СтрокаМассива.Значение.НомерПаспорт, СтрокаМассива.Значение.НомерСубСчета, СтрокаМассива.Значение.ФИО, СтрокаМассива.Значение.ЮрАдрес);
				СтрокиТП = ТППустойКонтрагент.НайтиСтроки(ПараметрыОтбора);
				
				ИндексСтрокиТП = ТП.Индекс(СтрокаМассива.Значение);
				СтрокаТП = ТП.Получить(ИндексСтрокиТП);
				ЗаполнитьЗначенияСвойств(СтрокаТП, СтрокиТП[0]);
			
			КонецЦикла;
		
		Иначе 	
			МассивПустойКонтрагент = ТП.НайтиСтроки(Новый структура("Контрагент", Справочники.Контрагенты.ПустаяСсылка()));
			СписСтрокПустойКонтрагент.ЗагрузитьЗначения(МассивПустойКонтрагент);
			ЭлементыФормы.ТП.Видимость = Ложь;
			ЭлементыФормы.ТППустойКонтрагент.Видимость = Истина;
			ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНенайденныхКонтрагентов.Пометка= Истина;
			
			ТППустойКонтрагент.Очистить();
			Для каждого СтрокаПустойКонтрагент Из МассивПустойКонтрагент Цикл
			
				НоваСтрока = ТППустойКонтрагент.Добавить();
				ЗаполнитьЗначенияСвойств(НоваСтрока, СтрокаПустойКонтрагент);
			
			КонецЦикла;	
		КонецЕсли;
	ИначеЕсли Кнопка.Имя="ПоказатьНезаполненДР" Тогда
	
		Если ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНенайденныхКонтрагентов.Пометка Тогда
			ПоказатьПредупреждение(, "Отбор по незаполнненым дням роджения невозможен. Отключите отбор ненаденных конрагентов.");
			Возврат;
		КонецЕсли;
		
		Если ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНезаполненныеДублиЛС.Пометка Тогда
			ПоказатьПредупреждение(, "Отбор по незаполнненым дням роджения невозможен. Отключите отбор незаполненных и дублей ЛС.");
			Возврат;
		КонецЕсли;

		Если ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНезаполненДР.Пометка Тогда
			
			ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНезаполненДР.Пометка = Ложь;
			
			ЭлементыФормы.ТП.Видимость = Истина;
			ЭлементыФормы.ТППустойКонтрагент.Видимость = Ложь;
			
			Для каждого СтрокаМассива Из СписСтрокПустойДР Цикл
			
				ПараметрыОтбора = Новый Структура("БанкРеквизиты, ДокументЮЛФЛ, ИНН, КолПаёв, НомерПаспорт, НомерСубСчета, ФИО, ЮрАдрес", СтрокаМассива.Значение.БанкРеквизиты, СтрокаМассива.Значение.ДокументЮЛФЛ, СтрокаМассива.Значение.ИНН, СтрокаМассива.Значение.КолПаёв, СтрокаМассива.Значение.НомерПаспорт, СтрокаМассива.Значение.НомерСубСчета, СтрокаМассива.Значение.ФИО, СтрокаМассива.Значение.ЮрАдрес);
				СтрокиТП = ТППустойКонтрагент.НайтиСтроки(ПараметрыОтбора);
				
				ИндексСтрокиТП = ТП.Индекс(СтрокаМассива.Значение);
				СтрокаТП = ТП.Получить(ИндексСтрокиТП);
				ЗаполнитьЗначенияСвойств(СтрокаТП, СтрокиТП[0]);
			
			КонецЦикла;
		
		Иначе
			МассивПустойДР = ТП.НайтиСтроки(Новый Структура("ДатаРождения", Дата(1,1,1)));
			СписСтрокПустойДР.Очистить();
			ЭлементыФормы.ТП.Видимость = Ложь;
			ЭлементыФормы.ТППустойКонтрагент.Видимость = Истина;
			ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНезаполненДР.Пометка= Истина;
			
			ТППустойКонтрагент.Очистить();
			Для каждого СтрокаПустойДР Из МассивПустойДР Цикл
				Если (СтрокаПустойДР.Контрагент<>Справочники.Контрагенты.ПустаяСсылка() И СтрокаПустойДР.Контрагент.ЮрФизЛицо=Перечисления.ЮрФизЛицо.ФизЛицо) Или Не ПустаяСтрока(СтрокаПустойДР.НомерПаспорт) Тогда
					СписСтрокПустойДР.Добавить(СтрокаПустойДР);
					НоваСтрока = ТППустойКонтрагент.Добавить();
					ЗаполнитьЗначенияСвойств(НоваСтрока, СтрокаПустойДР);	
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	
	ИначеЕсли Кнопка.Имя="ПоказатьНезаполненныеДублиЛС" Тогда
	
		Если ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНенайденныхКонтрагентов.Пометка Тогда
			ПоказатьПредупреждение(, "Отбор по незаполнненым и дублям ЛС невозможен. Отключите отбор ненаденных конрагентов.");
			Возврат;
		КонецЕсли;
		
		Если ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНезаполненДР.Пометка Тогда
			ПоказатьПредупреждение(, "Отбор ненаденных и дублям ЛС невозможен. Отключите отбор по незаполнненым дням роджения");
			Возврат;		
		КонецЕсли;
		
		Если ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНезаполненныеДублиЛС.Пометка Тогда
			
			ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНезаполненныеДублиЛС.Пометка = Ложь;
			
			ЭлементыФормы.ТП.Видимость = Истина;
			ЭлементыФормы.ТППустойКонтрагент.Видимость = Ложь;
			
			Для каждого СтрокаМассива Из СписСтрокПустойДублиЛС Цикл
				
				ПараметрыОтбора = Новый Структура("БанкРеквизиты, ДокументЮЛФЛ, ИНН, КолПаёв, НомерПаспорт, НомерСубСчета, ФИО, ЮрАдрес", СтрокаМассива.Значение.БанкРеквизиты, СтрокаМассива.Значение.ДокументЮЛФЛ, СтрокаМассива.Значение.ИНН, СтрокаМассива.Значение.КолПаёв, СтрокаМассива.Значение.НомерПаспорт, СтрокаМассива.Значение.НомерСубСчета, СтрокаМассива.Значение.ФИО, СтрокаМассива.Значение.ЮрАдрес);
				СтрокиТП = ТППустойКонтрагент.НайтиСтроки(ПараметрыОтбора);
				
				ИндексСтрокиТП = ТП.Индекс(СтрокаМассива.Значение);
				СтрокаТП = ТП.Получить(ИндексСтрокиТП);
				ЗаполнитьЗначенияСвойств(СтрокаТП, СтрокиТП[0]);
			
			КонецЦикла;
		
		Иначе
			МассивПустойДублиЛС = СтрокиПустойДублиЛС();
			СписСтрокПустойДублиЛС.Очистить();
			ЭлементыФормы.ТП.Видимость = Ложь;
			ЭлементыФормы.ТППустойКонтрагент.Видимость = Истина;
			ЭлементыФормы.КоманднаяПанель2.Кнопки.ПоказатьНезаполненныеДублиЛС.Пометка= Истина;
			
			ТППустойКонтрагент.Очистить();
			Для каждого СтрокаПустойДР Из МассивПустойДублиЛС Цикл
				СписСтрокПустойДублиЛС.Добавить(СтрокаПустойДР);
				НоваСтрока = ТППустойКонтрагент.Добавить();
				ЗаполнитьЗначенияСвойств(НоваСтрока, СтрокаПустойДР);	
			КонецЦикла;	
		КонецЕсли;	
	
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура КоманднаяПанель2СоздатьКонтрагентов(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ФлСоздаватьЛицевыеСчетаПриИзменении(Элемент)
	ЭлементыФормы.МножитьЛицСчета.Доступность = ФлСоздаватьЛицевыеСчета;
КонецПроцедуры

Процедура ФорматГарант1ПриИзменении(Элемент)
	Если ФорматГарантNew = 1 Тогда
		ФорматГарант = 	0
	Конецесли;	
КонецПроцедуры

Процедура ФорматГарантПриИзменении(Элемент)
	
КонецПроцедуры

Функция СоздатьСоответвиеДУЛ()
	
	СоответствиеДУЛ = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыУдостоверяющиеЛичность.Наименование КАК Наименование,
		|	ДокументыУдостоверяющиеЛичность.КодИМНС КАК КодИМНС
		|ИЗ
		|	Справочник.ДокументыУдостоверяющиеЛичность КАК ДокументыУдостоверяющиеЛичность
		|ГДЕ
		|	ДокументыУдостоверяющиеЛичность.КодИМНС <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеДУЛ.Вставить(ВыборкаДетальныеЗаписи.Наименование, ВыборкаДетальныеЗаписи.КодИМНС);
	КонецЦикла;
	
	Возврат СоответствиеДУЛ;
	
КонецФункции

RegExp = RegExp_Exec();
СвойствоНРДid = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("НРД id клиента", Истина);
