&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Расчет(Команда)
	РасчетНаСервере();
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОчиститьНаСервере()
	
	Объект.НачисленныеКомиссии.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере()
	Объект.НачисленныеКомиссии.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	УслугиДепозитарияОстатки.Инициатор,
	|	УслугиДепозитарияОстатки.Услуга,
	|	УслугиДепозитарияОстатки.МестоХранения,
	|	УслугиДепозитарияОстатки.Валюта,
	|	УслугиДепозитарияОстатки.ТипТарифа,
	|	УслугиДепозитарияОстатки.СтавкаНДС,
	|	УслугиДепозитарияОстатки.ТарифОстаток,
	|	УслугиДепозитарияОстатки.СуммаВВалютеОстаток КАК СуммаВВалюте,
	|	УслугиДепозитарияОстатки.СуммаВсегоОстаток КАК СуммаВсего,
	|	УслугиДепозитарияОстатки.СуммаНДСОстаток КАК СуммаНДС,
	|	УслугиДепозитарияОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.УслугиДепозитария.Остатки(&Дата, 
	|	"+?(ЗначениеЗаполнено(Объект.Депонент),"Инициатор = &Инициатор","")+") КАК УслугиДепозитарияОстатки
	|ГДЕ
	|	УслугиДепозитарияОстатки.СуммаОстаток > 0");
	Запрос.УстановитьПараметр("Дата",Объект.Дата);
	
	Если ЗначениеЗаполнено(Объект.Депонент) Тогда
		Запрос.УстановитьПараметр("Инициатор",Объект.Депонент);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.НачисленныеКомиссии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
КонецПроцедуры

//#КонецОбласти

