#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРСВ(Команда)
	СоздатьРСВНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Заполнить();
	ЗначениеВДанныеФормы(ОбработкаОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура СоздатьРСВНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СоздатьРСВ();
	ОбработкаОбъект.Заполнить();
	ЗначениеВДанныеФормы(ОбработкаОбъект, Объект);
КонецПроцедуры

#КонецОбласти

