
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда 
		 
		ЗаполнитьШапкуДокументаСервер();
								
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КонтрагентПриИзмененииОбработка();
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииОбработка();
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	
	УслугиУслугаПриИзмененииНаСервере();
	
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УслугиУслугаПриИзмененииНаСервере()
	
	ИдСтроки				=	Элементы.Услуги.ТекущаяСтрока;
	ТекСтрока = Объект.Услуги.НайтиПоИдентификатору(ИдСтроки);
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//проверка на существование операции у услуги.
	Операция = ЗначениеРеквизитаНаСервере(ТекСтрока.Услуга,"Операция");
	Если ТипЗнч(Операция) = Тип("СправочникСсылка.ВидыОпераций") Тогда
	
		ТекСтрока.ВидОперации	=	Операция;
	
	КонецЕсли; 
	
	//заполнение тарифа, типа тарифа, валюты.
	ДатаРасчета = ДатаРасчетаКомиссии();
	СтруктураТариф		= 	РегистрыСведений.Тарифы.ПолучитьПоследнее(ДатаРасчета, Новый Структура("Услуга",ТекСтрока.Услуга));
	ТекСтрока.Тариф		=	СтруктураТариф.Тариф;
	ТекСтрока.ТипТарифа	=	СтруктураТариф.ТипТарифа;
	ТекСтрока.Валюта	=	ЗначениеРеквизитаНаСервере(ТекСтрока.Услуга,"Валюта");
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьШапкуДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ОбщегоНазначения.ЗаполнитьШапкуДокумента(ТекущийОбъект, ПараметрыСеанса.ТекущийПользователь, , );
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаНаСервере(Источник, ИмяРеквизита)
	Перем Результат;
	Если Источник <> Неопределено Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, ИмяРеквизита);
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура КонтрагентПриИзмененииОбработка()
	
	Элементы.Контрагент.Заголовок =  ?(ТипЗнч(Объект.Контрагент)=Тип("СправочникСсылка.Контрагенты"),"Депонент:","Вн. депозитарий:");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.Услуги.Очистить();
	ДатаРасчета = ДатаРасчетаКомиссии();
	ВыборкаУслуг = РасчетТарифов.ФормированиеСпискаЕжемесячныхУслуг(ДатаРасчета, Объект.Договор);
	Пока ВыборкаУслуг.Следующий() Цикл
		РасчетныеПараметры = РасчетТарифов.РасчетСтоимостиУслуги(ДатаРасчета, Объект.Договор, ВыборкаУслуг.Услуга);
		Если ТипЗнч(РасчетныеПараметры) = Тип("Структура") Тогда
			НС = Объект.Услуги.Добавить();
			НС.Услуга = ВыборкаУслуг.Услуга;
			НС.Валюта = ВыборкаУслуг.Услуга.Валюта;
			НС.ВидОперации = ВыборкаУслуг.Услуга.Операция;
			ЗаполнитьЗначенияСвойств(НС, РасчетныеПараметры);
			НС.СуммаСделки = РасчетныеПараметры.Сумма;
			
		ИначеЕсли ТипЗнч(РасчетныеПараметры) = Тип("ТаблицаЗначений") Тогда
			Для Каждого РасчетныйПараметр Из РасчетныеПараметры Цикл
				НС = Объект.Услуги.Добавить();
				НС.Услуга = ВыборкаУслуг.Услуга;
				НС.Валюта = ВыборкаУслуг.Услуга.Валюта;
				НС.ВидОперации = ВыборкаУслуг.Услуга.Операция;
				ЗаполнитьЗначенияСвойств(НС, РасчетныйПараметр);
				НС.СуммаСделки = РасчетныйПараметр.Сумма;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ДатаРасчетаКомиссии()
	
	Если ЗначениеЗаполнено(Объект.ПериодРасчетаКомиссии) Тогда
		Возврат КонецДня(Объект.ПериодРасчетаКомиссии);
	Иначе
		Возврат Объект.Дата;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасшифроватьСтрокуТЧНаСервере(Договор,ПериодРасчетаКомиссии,Услуга,Выгодоприобретатель,ВариантНачисленияКомиссии)
	
	ОтчетОбъект = Отчеты.РасчетКомиссии.Создать();
	ОтчетОбъект.ТекущийДокументДоговор = Договор;
	ОтчетОбъект.ТекущийДокументПериодРасчетаКомиссии = ПериодРасчетаКомиссии;
	ОтчетОбъект.ТекущаяСтрокаТЧУслуга = Услуга;
	ОтчетОбъект.ТекущаяСтрокаТЧВыгодоприобретатель = Выгодоприобретатель;
	ОтчетОбъект.ТекущаяСтрокаТЧВариантНачисления = ВариантНачисленияКомиссии;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ОтчетОбъект.СкомпоноватьРезультат(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаКлиенте
Процедура РасшифроватьСтрокуТЧ(Команда)  
	
	Если не ЗначениеЗаполнено(Объект.ПериодРасчетаКомиссии) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен период расчета.'"),,"ПериодРасчетаКомиссии",,);
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	
	Если не ЗначениеЗаполнено(ТекущаяСтрока.СуммаКомиссии) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнена сумма комиссии. Расчет не будет выполнен.'"),,,,);
		Возврат;
	КонецЕсли;
	
	Если не ТекущаяСтрока.ТипТарифа = ПредопределенноеЗначение("Перечисление.ТипыТарифов.ПроцентОтНачисления") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Расшифровка создается только для типа тарифа ""Процент от начисления"".'"),,,,);
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = РасшифроватьСтрокуТЧНаСервере(Объект.Договор,Объект.ПериодРасчетаКомиссии,ТекущаяСтрока.Услуга,ТекущаяСтрока.Выгодоприобретатель,ПредопределенноеЗначение("Перечисление.ВариантыНачисленияКомиссий.Месяц"));
	
	ТабличныйДокумент.Автомасштаб = Истина;
	ТабличныйДокумент.ОтображатьСетку = ЛОЖЬ;
	ТабличныйДокумент.ТолькоПросмотр = ИСТИНА;
	
	ТабличныйДокумент.Показать("Расшифровка показателей строки");
	
КонецПроцедуры

//#КонецОбласти

