

&НаКлиенте
Процедура Установить(Команда)
	
	Заголовок = "";
	ЗначенияПараметров = УстановитьПараметры(Заголовок);
	ОповеститьОВыборе(новый Структура("Значения,ЗаголовокНастроек", ЗначенияПараметров,Заголовок));
	
КонецПроцедуры

&НаСервере
Функция УстановитьПараметры(Заголовок)
	
	Значения = Новый Структура;
	
	Значения.Вставить("ПочтовыйЛогин", Объект.ПочтовыйЛогин);
	Значения.Вставить("СписокРассылки", XMLСтрока(Новый ХранилищеЗначения(Объект.СписокРассылки.Выгрузить())));
	Значения.Вставить("СерверМО", Объект.СерверМО);
	Значения.Вставить("БазаМО", Объект.БазаМО);
	Значения.Вставить("ЛогинМО", Объект.ЛогинМО);
	Значения.Вставить("ПарольМО", Объект.ПарольМО);
	Значения.Вставить("УполномоченноеЛицоФИО", Объект.УполномоченноеЛицоФИО);
	Значения.Вставить("УполномоченноеЛицоФИОru", Объект.УполномоченноеЛицоФИОru);
	Значения.Вставить("УполномоченноеЛицоТелефон", Объект.УполномоченноеЛицоТелефон);
	
	ПредставлениеПочты = ?(Объект.СписокРассылки.Количество()>0, "Установлен список рассылки","");
	Заголовок = ПредставлениеПочты;
	Заголовок = СокрЛП(Заголовок);

	Возврат Значения;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.НастройкиАлгоритма)=Тип("Структура") тогда
		
		Настройки = Параметры.НастройкиАлгоритма;
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.УстановитьПользовательскиеНастройки(Настройки);
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВТБпоУмолчанию(Команда)
	
	//Sopolnova
	//725-55-40 66237
	//Сополнова Екатерина 
	//(495)7255540, 66237
		
	Объект.УполномоченноеЛицоФИО = "SOPOLNOVA EKATERINA";
	Объект.УполномоченноеЛицоФИОru = "Сополнова Екатерина";
	Объект.УполномоченноеЛицоТелефон = "(495)7255540 66237";
	
КонецПроцедуры
