
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбрабатываемаяДата = ТекущаяДата();

	Если ОбрабатываемаяДата < НачалоДня(ОбрабатываемаяДата)+12*3600 Тогда
		ОбрабатываемаяДата = ОбщегоНазначения.ПредыдущийРабочийДень(ОбрабатываемаяДата);
	КонецЕсли;
	
	Объект.ДатаЗагрузки = ОбрабатываемаяДата;

	ЗаполнитьКаталогОтчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогОтчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Объект.КаталогОтчетов = Диалоги.ВыборКаталога(Объект.КаталогОтчетов);
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗагрузкиПриИзменении(Элемент)

	Если НЕ ЗначениеЗаполнено(Объект.ДатаЗагрузки) Тогда
		Объект.ДатаЗагрузки = ТекущаяДата();
	КонецЕсли;	 
	ЗаполнитьКаталогОтчетов();
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКаталогОтчетов()
	
	Объект.КаталогОтчетов	= РеквизитФормыВЗначение("Объект").ПолучитьТекущуюПапкуОтчетовНКЦ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанныеОтчетов(Команда)
	ПрочитатьДанныеОтчетовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	СформироватьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеОтчетовНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПрочитатьДанныеОтчетовНКЦ();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СформироватьДокументы();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

