
Процедура УдалитьЗаписиЗаПериод(НачалоПериода, КонецПериода) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЖурналВходящихДокументов.Период
	|ИЗ
	|	РегистрСведений.ЖурналВходящихДокументов КАК ЖурналВходящихДокументов
	|ГДЕ
	|	ЖурналВходящихДокументов.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналВходящихДокументов.Период");
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ЖурналВходящихДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры
