
// Возвращает Истина, если документ уже выгружен в ЭДО, иначе - Ложь.
Функция ДокументВыгруженВЭДО(ДокументСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РегистрацияДокументовВЭДО.Документ) КАК КоличествоЗаписей
	|ИЗ
	|	РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияДокументовВЭДО
	|ГДЕ
	|	РегистрацияДокументовВЭДО.Документ = &Документ";
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат (Выборка.Следующий() И Выборка.КоличествоЗаписей > 0);
КонецФункции

// Фиксирует выгрузку документа в ЭДО в регистре сведений РегистрацияДокументовВЭДО
Процедура РегистрироватьВыгрузкуДокументаВЭДО(ДокументСсылка, ТаблицаПараметров) Экспорт
	НаборЗаписей = РегистрыСведений.РегистрацияДокументовВЭДО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
    НоваяЗапись = НаборЗаписей.Добавить();
    НоваяЗапись.Документ		= ДокументСсылка;
    НоваяЗапись.ДатаВыгрузки	= ТекущаяДата();
	НоваяЗапись.Пользователь	= ПараметрыСеанса.ТекущийПользователь;
	// Значения из таблицы параметров выгрузки
	НайденнаяСтрока = ТаблицаПараметров.Найти("DocumentNumber", "ИмяПараметра");
	Если НайденнаяСтрока <> Неопределено Тогда
		НоваяЗапись.НомерОтчетаВСЭД	= НайденнаяСтрока.ЗначениеПараметра;
	КонецЕсли;
	СтрокаDocId = ТаблицаПараметров.Найти("NewDocId", "ИмяПараметра");
	Если СтрокаDocId <> Неопределено Тогда
		НоваяЗапись.Идентификатор = СтрокаDocId.ЗначениеПараметра;
	КонецЕсли;
	НаборЗаписей.Записать();	
КонецПроцедуры

Функция ПоследнееВремяРегистрации(Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(МАКСИМУМ(РегистрацияДокументовВЭДО.ДатаВыгрузки), ДАТАВРЕМЯ(1,1,1)) КАК ДатаВыгрузки
	               |ИЗ
	               |	РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияДокументовВЭДО
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(РегистрацияДокументовВЭДО.ДатаВыгрузки, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаВыгрузки;
	Иначе
		Возврат НачалоДня(Дата);
	КонецЕсли; 
КонецФункции // ()

Функция ПоследняяВыгруженнаяВыписка(Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(МАКСИМУМ(Выписка.Дата), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыгрузки
	               |ИЗ
	               |	Документ.Выписка КАК Выписка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияДокументовВЭДО
	               |		ПО Выписка.Ссылка = РегистрацияДокументовВЭДО.Документ
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(Выписка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаВыгрузки;
	Иначе
		Возврат НачалоДня(Дата);
	КонецЕсли; 
КонецФункции // ()
