
Перем СтруктураДСиЦБсИП;
Перем БухгалтерскиеИтоги;


Функция СведенияОВнешнейОбработке() Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("Вид",             "ЗаполнениеОбъекта"); //Перечисления.ВидыДополнительныхОтчетовИОбработок.НачислениеПроцентов.
	Структура.Вставить("Наименование",    "SF 22.1 Расчет вознаграждения за успех: из  инвестиционного дохода за период, согласно настройке, с использованием базовой рыночной стоимости, безусловно согранияением взнаграждения от величены СЧА, с коэффициентом");
	Структура.Вставить("Версия",          "1.00");
	Структура.Вставить("БезопасныйРежим", Истина);
	Структура.Вставить("Информация",      "");
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Идентификатор");
	Команды.Колонки.Добавить("Представление");
	Команды.Колонки.Добавить("Модификатор");
	Команды.Колонки.Добавить("ПоказыватьОповещение");
	Команды.Колонки.Добавить("Использование");
	
	Структура.Вставить("Команды", Команды);
	
	Назначение = Новый Массив;
	Назначение.Добавить("Документ.НачислениеВознаграждения");
	
	Структура.Вставить("Назначение", Назначение);
	
	Возврат Структура;
	
КонецФункции

// FVasiliev  12.03.2026 
Процедура  УстановитьПользовательскиеНастройки(Настройки) Экспорт
	ТаблицаКоэффициентов = XMLЗначение(Тип("ХранилищеЗначения"), Настройки.ТаблицаКоэффициентов);
КонецПроцедуры

Функция РасчетСуммыЗаУправление(СтруктураПараметров)
	
	//ДатаНачала = НачалоГода(СтруктураПараметров.Дата);
	//ДатаНачала = ?(СтруктураПараметров.ДатаНачалаДУ>(ДатаНачала), СтруктураПараметров.ДатаНачалаДУ, ДатаНачала);
	//
	//ДатаОкончания = КонецГода(СтруктураПараметров.Дата);
	//ДатаОкончания = ?(ЗначениеЗаполнено(СтруктураПараметров.ДатаОкончанияДУ) и СтруктураПараметров.ДатаОкончанияДУ<ДатаОкончания, СтруктураПараметров.ДатаОкончанияДУ, ДатаОкончания);
	
	Запрос = Новый Запрос;
	// IMAPPS-9987
	// считать вознаграждение ТОЛЬКО за квартал
	//	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПараметров.ДатаНачалаРасчета);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(СтруктураПараметров.ДатаНачалаРасчета));
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(СтруктураПараметров.ДатаОкончанияРасчета));
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоКвартала(СтруктураПараметров.ДатаОкончанияРасчета));
	Запрос.УстановитьПараметр("КонецПериода", СтруктураПараметров.ДатаОкончанияРасчета);
	Запрос.УстановитьПараметр("ДоговорДУ", СтруктураПараметров.ДоговорДУ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			СчетДт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы)),
	|			,
	|			СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетВознаграждениеУКЗаУправление),
	|			,
	|			ДоговорДУ = &ДоговорДУ
	|				) КАК ХозрасчетныйОборотыДтКт
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОборотыДтКт.СуммаОборот";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат ?(Результат.СуммаОборот=NULL, 0, Результат.СуммаОборот);
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция СуммыДСиЦБсИП(СтруктураПараметров)
	СтруктураВозврата = Новый Структура;
	//СтруктураВозврата.Вставить("СуммаВложения", 0);
	//СтруктураВозврата.Вставить("СуммаИзъятия", 0);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПараметров.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",  СтруктураПараметров.ДатаОкончания);
	Запрос.УстановитьПараметр("ДоговорДУ",     СтруктураПараметров.ДоговорДУ);
	Запрос.Текст = 
	//kmusorin IMAPPS-7198 По согласию с IMDEV переделано на регистр ВводыВыводыДУ
	
	//"ВЫБРАТЬ
	//|	ЕСТЬNULL(СтоимостьАктивовУправленческийОбороты.ДоговорДУ, ХозрасчетныйОбороты.ДоговорДУ) КАК ДоговорДУ,
	//|	СУММА(ВЫБОР
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВводВыводЦенныхБумагИзДУ
	//|				ТОГДА ЕСТЬNULL(СтоимостьАктивовУправленческийОбороты.СуммаПриход, 0)
	//|			ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0)
	//|		КОНЕЦ) КАК СуммаОборотКт,
	//|	СУММА(ВЫБОР
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВводВыводЦенныхБумагИзДУ
	//|				ТОГДА ЕСТЬNULL(СтоимостьАктивовУправленческийОбороты.СуммаРасход, 0)
	//|			ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0)
	//|		КОНЕЦ) КАК СуммаОборотДт
	//|ПОМЕСТИТЬ ВводыВыводы
	//|ИЗ
	//|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	//|			&НачалоПериода,
	//|			&КонецПериода,
	//|			Регистратор,
	//|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВводВыводАктивовВИзДУ),
	//|			,
	//|			ДоговорДУ = &ДоговорДУ
	//|				,
	//|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСБюджетом)),
	//|			) КАК ХозрасчетныйОбороты
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьАктивовУправленческий.Обороты(
	//|				&НачалоПериода,
	//|				&КонецПериода,
	//|				Регистратор,
	//|				ДоговорДУ = &ДоговорДУ
	//|					) КАК СтоимостьАктивовУправленческийОбороты
	//|		ПО ХозрасчетныйОбороты.Регистратор = СтоимостьАктивовУправленческийОбороты.Регистратор
	//|ГДЕ
	//|	НЕ ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВводВыводЦенныхБумагИзДУ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЕСТЬNULL(СтоимостьАктивовУправленческийОбороты.ДоговорДУ, ХозрасчетныйОбороты.ДоговорДУ)
	//|
	//|ОБЪЕДИНИТЬ
	//|                        
	//|ВЫБРАТЬ
	//|	ЕСТЬNULL(СтоимостьАктивовУправленческийОбороты.ДоговорДУ, ХозрасчетныйОбороты.ДоговорДУ),
	//|	СУММА(ВЫБОР
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВводВыводЦенныхБумагИзДУ
	//|					ИЛИ СтоимостьАктивовУправленческийОбороты.Регистратор ССЫЛКА Документ.ВводВыводЦенныхБумагИзДУ
	//|					ИЛИ НачисленныйКупонныйДоходУправленческийОбороты.Регистратор ССЫЛКА Документ.ВводВыводЦенныхБумагИзДУ  //IMAPPS-741
	//|				ТОГДА ЕСТЬNULL(СтоимостьАктивовУправленческийОбороты.СуммаПриход, 0)
	//|                    + ЕСТЬNULL(НачисленныйКупонныйДоходУправленческийОбороты.СуммаПриход, 0)                                //IMAPPS-741
	//|			ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0)
	//|		КОНЕЦ),
	//|	СУММА(ВЫБОР
	//|			КОГДА ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВводВыводЦенныхБумагИзДУ
	//|					ИЛИ СтоимостьАктивовУправленческийОбороты.Регистратор ССЫЛКА Документ.ВводВыводЦенныхБумагИзДУ
	//|					ИЛИ НачисленныйКупонныйДоходУправленческийОбороты.Регистратор ССЫЛКА Документ.ВводВыводЦенныхБумагИзДУ  //IMAPPS-741
	//|				ТОГДА ЕСТЬNULL(СтоимостьАктивовУправленческийОбороты.СуммаРасход, 0)
	////				   |                    + ЕСТЬNULL(НачисленныйКупонныйДоходУправленческийОбороты.СуммаПриход, 0)                                //IMAPPS-741
	//|			ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0)
	//|		КОНЕЦ)
	//|ИЗ
	//|	Документ.ВводВыводЦенныхБумагИзДУ КАК ВводВыводЦенныхБумагИзДУ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	//|				&НачалоПериода,
	//|				&КонецПериода,
	//|				Регистратор,
	//|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВводВыводАктивовВИзДУ),
	//|				,
	//|				ДоговорДУ = &ДоговорДУ
	//|					,
	//|				НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСБюджетом)),
	//|				) КАК ХозрасчетныйОбороты
	//|		ПО (ХозрасчетныйОбороты.Регистратор = ВводВыводЦенныхБумагИзДУ.Ссылка)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьАктивовУправленческий.Обороты(
	//|				&НачалоПериода,
	//|				&КонецПериода,
	//|				Регистратор,
	//|				ДоговорДУ = &ДоговорДУ
	//|					) КАК СтоимостьАктивовУправленческийОбороты
	//|		ПО ВводВыводЦенныхБумагИзДУ.Ссылка = СтоимостьАктивовУправленческийОбороты.Регистратор
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НачисленныйКупонныйДоходУправленческий.Обороты(                                  //IMAPPS-741
	//|				&НачалоПериода,                                                                                             //IMAPPS-741
	//|				&КонецПериода,                                                                                              //IMAPPS-741
	//|				Регистратор,                                                                                                //IMAPPS-741
	//|				ДоговорДУ = &ДоговорДУ                                                                                      //IMAPPS-741
	//|					) КАК НачисленныйКупонныйДоходУправленческийОбороты   //IMAPPS-741
	//|		ПО ВводВыводЦенныхБумагИзДУ.Ссылка = НачисленныйКупонныйДоходУправленческийОбороты.Регистратор                      //IMAPPS-741
	//|ГДЕ                                                                                                                       
	//|	ВводВыводЦенныхБумагИзДУ.Проведен = ИСТИНА
	//|	И ВводВыводЦенныхБумагИзДУ.ПометкаУдаления = ЛОЖЬ
	//|	И ВводВыводЦенныхБумагИзДУ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	//|	И ВводВыводЦенныхБумагИзДУ.ДоговорДУ = &ДоговорДУ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЕСТЬNULL(СтоимостьАктивовУправленческийОбороты.ДоговорДУ, ХозрасчетныйОбороты.ДоговорДУ)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВводыВыводы.ДоговорДУ,
	//|	СУММА(ВводыВыводы.СуммаОборотКт) КАК СуммаОборотКт,
	//|	СУММА(ВводыВыводы.СуммаОборотДт) КАК СуммаОборотДт
	//|ИЗ
	//|	ВводыВыводы КАК ВводыВыводы
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВводыВыводы.ДоговорДУ";
	
	//kmusorin IMAPPS-7198 По согласию с IMDEV переделано на регистр ВводыВыводыДУ
	
	"ВЫБРАТЬ
	|	ВводыВыводыДУОбороты.Период КАК Период,
	|	ВводыВыводыДУОбороты.Регистратор КАК Регистратор,
	|	ВводыВыводыДУОбороты.ДоговорДУ КАК ДоговорДУ,
	|	ВводыВыводыДУОбороты.Валюта КАК Валюта,
	|	ВводыВыводыДУОбороты.ВалютнаяСуммаОборот КАК ВалютнаяСуммаОборот,
	|	ВводыВыводыДУОбороты.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ ВТВводовВыводов_Нов
	|ИЗ
	|	РегистрНакопления.ВводыВыводыДУ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ДоговорДУ = &ДоговорДУ) КАК ВводыВыводыДУОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВводовВыводов_Нов.ДоговорДУ КАК ДоговорДУ,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ВТВводовВыводов_Нов.СуммаОборот > 0
	|					ТОГДА ВТВводовВыводов_Нов.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(18, 2))) КАК СуммаОборотКт,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ВТВводовВыводов_Нов.СуммаОборот < 0
	|					ТОГДА -1 * ВТВводовВыводов_Нов.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(18, 2))) КАК СуммаОборотДт
	|ИЗ
	|	ВТВводовВыводов_Нов КАК ВТВводовВыводов_Нов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТВводовВыводов_Нов.ДоговорДУ";
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		СтруктураВозврата.Вставить("СуммаИзъятия", Результат.СуммаОборотДт);
		СтруктураВозврата.Вставить("СуммаВложения", Результат.СуммаОборотКт);		
	Иначе
		СтруктураВозврата.Вставить("СуммаВложения", 0);
		СтруктураВозврата.Вставить("СуммаИзъятия", 0);
	КонецЕсли;
	Возврат СтруктураВозврата;
КонецФункции

Функция СправкаРасчет(ПоказателиСправки)
	ТабДокументШапка = Новый ТабличныйДокумент;
	ТабДокументТело  = Новый ТабличныйДокумент;
	ТабДокументПодвал  = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("СправкаРасчет");
	ОбластьЗаголовок  = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок1 = Макет.ПолучитьОбласть("Заголовок1");
	ОбластьТело       = Макет.ПолучитьОбласть("ТелоРасчета");
	ОбластьПодвал     = Макет.ПолучитьОбласть("Подвал2");
	//ОбластьПодвал1    = Макет.ПолучитьОбласть("Подвал1");
	ОбластьЗаголовок2 = Макет.ПолучитьОбласть("Заголовок2");
	
	ОбластьЗаголовок.Параметры.ДатаНомерДоговораДУ = "№"+ПоказателиСправки.НомерДоговораДУ+ " от "+Формат(ПоказателиСправки.ДатаДоговораДУ, "ДФ='dd MMMM yyyy'")+"г.";
	ТабДокументШапка.Вывести(ОбластьЗаголовок);
	
	ОбластьЗаголовок2.Параметры.ПериодРасчета = "за период управления с "+ Формат(ПоказателиСправки.НачалоРасчета, "ДФ='dd MMMM yyyy'")+"г." + " по "+Формат(ПоказателиСправки.ОкончаниеРасчета, "ДФ='dd MMMM yyyy'")+"г.";
	ОбластьЗаголовок2.Параметры.П000 = ПоказателиСправки.П000;
	СуммаПлата = Формат(ПоказателиСправки.П000, "ЧДЦ=2; ЧН=0,00") + " рублей (" + РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОКР(ПоказателиСправки.П000, 2), Константы.ВалютаРегламентированногоУчета.Получить(), ЛОЖЬ) + ")";
	ОбластьЗаголовок2.Параметры.ПлатаЗаУправление = "Плата за управлнеи за период с "+ Формат(ПоказателиСправки.НачалоРасчета, "ДФ='dd MMMM yyyy'")+"г." 
	+ " по "+Формат(ПоказателиСправки.ОкончаниеРасчета, "ДФ='dd MMMM yyyy'")+"г. составила: " + СуммаПлата;
	ТабДокументТело.Вывести(ОбластьЗаголовок2);
	
	ОбластьЗаголовок1.Параметры.ПериодРасчета = "за период управления с "+ Формат(ПоказателиСправки.НачалоРасчета, "ДФ='dd MMMM yyyy'")+"г." + " по "+Формат(ПоказателиСправки.ОкончаниеРасчета, "ДФ='dd MMMM yyyy'")+"г.";
	ТабДокументТело.Вывести(ОбластьЗаголовок1);
	
	//ОбластьПодвал.Параметры.Клиент      = "Клиент: "     +ПоказателиСправки.ДоговорДУ.Клиент.НаименованиеПолное;
	//ОбластьПодвал.Параметры.Управляющий = "Управляющий: "+ СокрЛП(ПоказателиСправки.ДоговорДУ.УправляющаяКомпания.НаименованиеПолное)
	//+ Символы.ПС + ПолучитьПодписанта(ПоказателиСправки.ДоговорДУ.УправляющаяКомпания);
	
	ТекстИтога = "Вознаграждение управляющего за успех за период с "+Формат(ПоказателиСправки.НачалоРасчета, "ДФ=dd.MM.yyyy")+" г. по "+Формат(ПоказателиСправки.ОкончаниеРасчета, "ДФ=dd.MM.yyyy")+" г., составило:";
	СуммаИтог = Формат(ПоказателиСправки.П023, "ЧДЦ=2; ЧН=0,00") + " рублей (" + РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОКР(ПоказателиСправки.П023, 2), Константы.ВалютаРегламентированногоУчета.Получить(), ЛОЖЬ) + ")";
	ВознаграждениеЗаУспех = ТекстИтога + СуммаИтог;
	ТекстВознаграждения = "Итоговое вознаграждение Управляющего, за период управления с " + Формат(ПоказателиСправки.НачалоРасчета, "ДФ=dd.MM.yyyy") 
	+ " по " + Формат(ПоказателиСправки.ОкончаниеРасчета, "ДФ=dd.MM.yyyy") + ":";
	СуммаВознаграждение = ПоказателиСправки.П023 +  ПоказателиСправки.П000;
	СуммаИтог = Формат(СуммаВознаграждение, "ЧДЦ=2; ЧН=0,00") + " рублей (" + РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОКР(СуммаВознаграждение, 2), Константы.ВалютаРегламентированногоУчета.Получить(), ЛОЖЬ) + ")";
	ИтоговоеВознаграждениеЗаУспех = ТекстВознаграждения + СуммаИтог;
	
	ЗаполнитьЗначенияСвойств(ОбластьТело.Параметры, ПоказателиСправки);
	ОбластьТело.Параметры.ВознаграждениеЗаУспех = ВознаграждениеЗаУспех;
	ОбластьТело.Параметры.ИтоговоеВознаграждениеЗаУспех = ИтоговоеВознаграждениеЗаУспех;
	ТабДокументТело.Вывести(ОбластьТело);
	//ОбластьПодвал1.Параметры.ТекстИтог = ТекстИтога;
	//ОбластьПодвал1.Параметры.СуммаИтог = СуммаИтог;
	//ТабДокументТело.Вывести(ОбластьПодвал1);
	ОбластьПодвал.Параметры.Клиент      = ПоказателиСправки.ДоговорДУ.Клиент.НаименованиеПолное;
	ОбластьПодвал.Параметры.Управляющий = СокрЛП(ПоказателиСправки.ДоговорДУ.УправляющаяКомпания.НаименованиеПолное)
	+ Символы.ПС + ПолучитьПодписанта(ПоказателиСправки.ДоговорДУ.УправляющаяКомпания);
	ТабДокументПодвал.Вывести(ОбластьПодвал);
	
	//Если ПоказателиСправки.СтруктураСЧА.ТаблицаСЧА_РСА.Количество() > 0 тогда
	//	ОбластьШапкаРасшифровкаСЧА = Макет.ПолучитьОбласть("ШапкаРасшифровкиСЧА");
	//    ОбластьСтрокаРасшифровкаСЧА = Макет.ПолучитьОбласть("СтрокаРасшифровкиСЧА");
	//	ОбластьПодвалСЧА = Макет.ПолучитьОбласть("ПодвалСЧА");

	//	ТабДокументПодвал.ВывестиГоризонтальныйРазделительСтраниц();
	//	ОбластьШапкаРасшифровкаСЧА.Параметры.Клиент 		= ПоказателиСправки.ДоговорДУ.Клиент.НаименованиеПолное;
	//	ОбластьШапкаРасшифровкаСЧА.Параметры.ДатаНач 		= Формат(ПоказателиСправки.НачалоРасчета, "ДФ=dd.MM.yyyy"); 
	//	ОбластьШапкаРасшифровкаСЧА.Параметры.ДатаКон 		= Формат(ПоказателиСправки.ОкончаниеРасчета, "ДФ=dd.MM.yyyy");  
	//	ОбластьШапкаРасшифровкаСЧА.Параметры.ВалютаРасчета 	= ОбщегоНазначенияДУ.ВалютаРеглУчета(ПоказателиСправки.ДоговорДУ);
	//    ТабДокументПодвал.Вывести(ОбластьШапкаРасшифровкаСЧА);
	//	ИтогоСча = 0;                       
	//	Для каждого стр из ПоказателиСправки.СтруктураСЧА.ТаблицаСЧА_РСА Цикл
	//		ОбластьСтрокаРасшифровкаСЧА.Параметры.ДатаСЧА= "Стоимость чистых активов на " + Формат(стр.Дата, "ДФ=dd.MM.yyyy");
	//		ОбластьСтрокаРасшифровкаСЧА.Параметры.Сумма= стр.СЧА;
	//		ТабДокументПодвал.Вывести(ОбластьСтрокаРасшифровкаСЧА);

	//		ИтогоСча = ИтогоСча + стр.СЧА;
	//	КонецЦикла;
	//	ОбластьПодвалСЧА.Параметры.СуммаСЧА = ИтогоСча;
	//	ОбластьПодвалСЧА.Параметры.КоличествоДней = ПоказателиСправки.СтруктураСЧА.КоличествоДней;
	//	ОбластьПодвалСЧА.Параметры.Сча = Формат(ПоказателиСправки.СтруктураСЧА.СЧА,"ЧДЦ=2");
	//	ТабДокументПодвал.Вывести(ОбластьПодвалСЧА);

		
	//КонецЕсли;

	
	Возврат Новый ХранилищеЗначения(Новый Структура("ШапкаРасчет, ТелоРасчет, ПодвалРасчет, НачалоПериода, ОкончаниеПериода", ТабДокументШапка, ТабДокументТело, ТабДокументПодвал, ПоказателиСправки.НачалоРасчета, ПоказателиСправки.ОкончаниеРасчета)); 
	
КонецФункции

Функция ИнвестиционныйДоход_Базовый(СтруктураПараметров)
	//ДатаНачалаРасчета = НачалоГода(СтруктураПараметров.Дата)-1;
	//ДатаНачалаРасчета = ?(СтруктураПараметров.ДатаНачалаДУ>(ДатаНачалаРасчета), СтруктураПараметров.ДатаНачалаДУ, ДатаНачалаРасчета);
	//
	//ДатаОкончанияРасчета = КонецГода(СтруктураПараметров.Дата);
	//ДатаОкончанияРасчета = ?(ЗначениеЗаполнено(СтруктураПараметров.ДатаОкончанияДУ) и СтруктураПараметров.ДатаОкончанияДУ<ДатаОкончанияРасчета, СтруктураПараметров.ДатаОкончанияДУ, ДатаОкончанияРасчета);
	
	//СтруктураРасчетаБазовойРСА = РасчетБазовойРСА(СтруктураПараметров);
	//Kmusorin  IMAPPS-7198
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	РегистрБРСАСрезПоследних.Период,
	|	РегистрБРСАСрезПоследних.БРСА
	|ИЗ
	|	РегистрСведений.РегистрБРСА.СрезПоследних(&Период, ДоговорДУ = &ДоговорДУ) КАК РегистрБРСАСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", СтруктураПараметров.ДатаНачалаРасчета);
	Запрос.УстановитьПараметр("ДоговорДУ", СтруктураПараметров.ДоговорДУ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	БазоваяРСА = 0;
	Если Выборка.Следующий() Тогда
		Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ДоговорДУ.ДатаВозобновленияУправления) ИЛИ Выборка.Период > СтруктураПараметров.ДоговорДУ.ДатаВозобновленияУправления Тогда
			БазоваяРСА =РегистрыСведений.РегистрБРСА.ЗначенияБРСА(СтруктураПараметров.ДатаНачалаРасчета, СтруктураПараметров.ДоговорДУ);
		КонецЕсли;
	 
	КонецЕсли; 
	//Kmusorin  IMAPPS-7198	
	//РСА_Начало    = СтруктураРасчетаБазовойРСА.БазоваяРСА;
	РСА_Окончание = РегистрыСведений.РегистрРСА_СЧА.ЗначенияСЧА_РСА(СтруктураПараметров.ДатаОкончанияРасчета, СтруктураПараметров.ДоговорДУ).СЧА;
	
	ПараметрыДСиЦБсИП = Новый Структура;
	//Kmusorin  IMAPPS-7198	
	//ПараметрыДСиЦБсИП.Вставить("ДатаНачала", СтруктураПараметров.ДатаНачалаРасчета+1);
	ПараметрыДСиЦБсИП.Вставить("ДатаНачала", СтруктураПараметров.ДатаНачалаРасчета);
	//Kmusorin  IMAPPS-7198
	
	ПараметрыДСиЦБсИП.Вставить("ДатаОкончания", СтруктураПараметров.ДатаОкончанияРасчета);
	ПараметрыДСиЦБсИП.Вставить("ДоговорДУ", СтруктураПараметров.ДоговорДУ);
	
	
	СтруктураДСиЦБсИП = СуммыДСиЦБсИП(ПараметрыДСиЦБсИП);
	
	ПриростРСА = (РСА_Окончание-БазоваяРСА)+(СтруктураДСиЦБсИП.СуммаИзъятия-СтруктураДСиЦБсИП.СуммаВложения);
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("РСА_Начало"   , БазоваяРСА);
	СтруктураВозврата.Вставить("РСА_Окончание", РСА_Окончание);
	СтруктураВозврата.Вставить("СуммаВложения", СтруктураДСиЦБсИП.СуммаВложения);
	СтруктураВозврата.Вставить("СуммаИзъятия" , СтруктураДСиЦБсИП.СуммаИзъятия);
	СтруктураВозврата.Вставить("ПриростРСА"   , ПриростРСА);
	//Показатели расчета базовой
	//СтруктураВозврата.Вставить("БазоваяРСА_Расчетная", СтруктураРасчетаБазовойРСА.БазоваяРСА_Расчетная);
	//СтруктураВозврата.Вставить("РСА_Минус_Управление", СтруктураРасчетаБазовойРСА.РСА_Минус_Управление);
	СтруктураВозврата.Вставить("БазоваяРСА"          , БазоваяРСА);
	Возврат СтруктураВозврата;
КонецФункции

Функция РасчетБРСА(СтруктураПараметров)
	
	РСА_конец = РегистрыСведений.РегистрРСА_СЧА.ЗначенияСЧА_РСА(СтруктураПараметров.ДатаОкончанияРасчета, СтруктураПараметров.ДоговорДУ).СЧА;
	
	//Kmusorin  IMAPPS-7198  убрал повторный вызов ф-ции расчета суммы вводов с аналогичными параметрами. Первичный вызов в функции ИнвестиционныйДоход_Базовый	
	//ПараметрыДСиЦБсИП = Новый Структура;
	//ПараметрыДСиЦБсИП.Вставить("ДатаНачала", СтруктураПараметров.ДатаНачалаРасчета+1);
	//ПараметрыДСиЦБсИП.Вставить("ДатаОкончания", СтруктураПараметров.ДатаОкончанияРасчета);
	//ПараметрыДСиЦБсИП.Вставить("ДоговорДУ", СтруктураПараметров.ДоговорДУ);
	
	//СтруктураДСиЦБсИП = СуммыДСиЦБсИП(ПараметрыДСиЦБсИП);
	//Kmusorin  IMAPPS-7198	
	БРСА_Расчетная         = СтруктураПараметров.БРСА_Прошлая+СтруктураДСиЦБсИП.СуммаВложения-СтруктураДСиЦБсИП.СуммаИзъятия;
	РСАМинусВознаграждения = РСА_Конец-СтруктураПараметров.ВознаграждениеMF-СтруктураПараметров.ВознаграждениеSF;
	
	Возврат Макс(0, БРСА_Расчетная, РСАМинусВознаграждения);
	
КонецФункции


Функция КоличествоМесяцевВПериоде(Период)
	Если Период=Перечисления.Периодичность.Месяц Тогда
		Возврат 1;
	ИначеЕсли Период=Перечисления.Периодичность.Квартал Тогда
		Возврат 3;
	ИначеЕсли Период=Перечисления.Периодичность.Декада Тогда
		Возврат 4;
	ИначеЕсли Период=Перечисления.Периодичность.Полугодие Тогда
		Возврат 6;
	ИначеЕсли Период=Перечисления.Периодичность.Год Тогда
		Возврат 12;
	Иначе
		Возврат 3; //По умолчанию используем период Квартал
	КонецЕсли;
КонецФункции

Функция ГраницыПериодаРасчета(СтруктураПараметров)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("РасчетнаяДатаНачала", Дата(1, 1, 1));
	СтруктураВозврата.Вставить("РасчетнаяДатаОкончания", Дата(1, 1, 1));
	СтруктураВозврата.Вставить("КоличествоДнейВГоду", 0);
	КоличествоМесяцевВПериоде = КоличествоМесяцевВПериоде(СтруктураПараметров.НастройкиАлгоритма.Периодичность);
	//СтруктураДоговораДУ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтруктураПараметров.ДоговорДУ, "ДатаВводаСредствВДУ, ДатаНачала, ДатаОкончания");
	//Определение начала периода расчета
	
	//Корректировка по типу периода
	Если СтруктураПараметров.НастройкиАлгоритма.ТипПериода="Календарный" Тогда
		//kmusorin IMAPPS-7198		
		//НачальнаяДата    =  НачалоГода(СтруктураПараметров.ДатаДокумента);
		НачальнаяДата = ?(ЗначениеЗаполнено(СтруктураПараметров.СтруктураДоговораДУ.ДатаВозобновленияУправления),СтруктураПараметров.СтруктураДоговораДУ.ДатаВозобновленияУправления,НачалоГода(СтруктураПараметров.ДатаДокумента));
		//kmusorin IMAPPS-7198		
	Иначе //Инвестиционный
		Если СтруктураПараметров.НастройкиАлгоритма.ДатаНачалаРасчета="ДатаПодписанияДоговора" Тогда
			НачальнаяДата = СтруктураПараметров.СтруктураДоговораДУ.ДатаНачала;   
		Иначе
			НачальнаяДата = СтруктураПараметров.СтруктураДоговораДУ.ДатаВводаСредствВДУ; 
		КонецЕсли;
	КонецЕсли;
	
	//НачальнаяДата = ?(ЗначениеЗаполнено(СтруктураПараметров.НастройкиАлгоритма.ДатаНачалаРасчета), СтруктураПараметров.НастройкиАлгоритма.ДатаНачалаРасчета, СтруктураПараметров.ДатаВводаСредствВДУ);
	
	КоличествоМесяцев = ОбщегоНазначенияДУ.КоличествоПериодов(НачальнаяДата, СтруктураПараметров.ДатаДокумента, "Месяц")-1;
	КоличествоКварталов = ОбщегоНазначенияДУ.КоличествоПериодов(НачальнаяДата, СтруктураПараметров.ДатаДокумента, "Квартал");
	//Если День(НачальнаяДата)>День(СтруктураПараметров.ДатаДокумента) Тогда
	//	КоличествоМесяцев=КоличествоМесяцев-1;
	//КонецЕсли;
#Область kmusorin_IMAPPS_7198	
	////kmusorin IMAPPS-7198	
	////ПрошедшиеПериоды  = Цел(КоличествоМесяцев/КоличествоМесяцевВПериоде)*КоличествоМесяцевВПериоде;
	//ПрошедшиеПериоды  = КоличествоКварталов*КоличествоМесяцевВПериоде;
	////РасчетнаяДатаНачала = НачалоДня(ОбщегоНазначенияДУ.ДобавитьКДате(НачальнаяДата, "Месяц", ПрошедшиеПериоды));
	//Если СтруктураПараметров.СтруктураДоговораДУ.ДатаВозобновленияУправления <> Дата(1,1,1) И ПрошедшиеПериоды <= КоличествоМесяцевВПериоде Тогда
	//	
	//	РасчетнаяДатаНачала = НачальнаяДата;
	//	
	//Иначе 
	//	//РасчетнаяДатаНачала = НачалоДня(ОбщегоНазначенияДУ.ДобавитьКДате(НачалоМесяца(НачальнаяДата), "Месяц", ПрошедшиеПериоды));
	//	
	//	РасчетнаяДатаНачала = НачалоДня(НачалоКвартала(СтруктураПараметров.ДатаДокумента));
	//	
	//	//РасчетнаяДатаНачала = НачальнаяДата;
	//	
	//КонецЕсли;	
	////kmusorin IMAPPS-7198
#КонецОбласти

	// MPazhukov IMAPPS-9987
	// Сделаное "kmusorin IMAPPS-7198" закоментировано, смысл не понятен
	ПрошедшиеПериоды  = Цел(КоличествоМесяцев/КоличествоМесяцевВПериоде)*КоличествоМесяцевВПериоде;
	РасчетнаяДатаНачала = НачалоДня(ОбщегоНазначенияДУ.ДобавитьКДате(НачальнаяДата, "Месяц", ПрошедшиеПериоды));
	// MPazhukov IMAPPS-9987
	
	ПрошедшиеПериоды  = КоличествоКварталов*КоличествоМесяцевВПериоде;
	
	// AKudryashov IMAPPS-10791
	Если СтруктураПараметров.СтруктураДоговораДУ.ДатаВозобновленияУправления <> Дата(1,1,1) И ПрошедшиеПериоды <= КоличествоМесяцевВПериоде Тогда
		РасчетнаяДатаНачала = НачальнаяДата;	
	Иначе
		Если СтруктураПараметров.НастройкиАлгоритма.Периодичность = Перечисления.Периодичность.Квартал Тогда 
			РасчетнаяДатаНачала = НачалоДня(НачалоКвартала(СтруктураПараметров.ДатаДокумента));
		КонецЕсли;
	КонецЕсли;	
	// AKudryashov IMAPPS-10791
	
	//Корректировка дат от периода договора
	Если СтруктураПараметров.НастройкиАлгоритма.ДатаНачалаРасчета="ДатаПодписанияДоговора" Тогда
		РасчетнаяДатаНачала = НачалоДня(Макс(РасчетнаяДатаНачала, СтруктураПараметров.СтруктураДоговораДУ.ДатаНачала));   
	Иначе
		РасчетнаяДатаНачала = НачалоДня(Макс(РасчетнаяДатаНачала,СтруктураПараметров.СтруктураДоговораДУ.ДатаВводаСредствВДУ)); 
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураПараметров.СтруктураДоговораДУ.ДатаОкончания) Тогда
		РасчетнаяДатаОкончания = КонецДня(Мин(СтруктураПараметров.ДатаДокумента, СтруктураПараметров.СтруктураДоговораДУ.ДатаОкончания));
	Иначе
		РасчетнаяДатаОкончания = КонецДня(СтруктураПараметров.ДатаДокумента);
	КонецЕсли;
	
	//Определение количества дней в расчитываемом году для дальнейших расчетов
	ДельтаЛет = Цел(КоличествоМесяцев/12);
	НачалоРасчетногоГода = ОбщегоНазначенияДУ.ДобавитьКДате(НачальнаяДата, "Год", ДельтаЛет);
	КонецРасчетногоГода  = ОбщегоНазначенияДУ.ДобавитьКДате(НачальнаяДата, "Год", ДельтаЛет+1)-1;
	КоличествоДнейВГоду = ОбщегоНазначенияДУ.КоличествоПериодов(НачалоРасчетногоГода, КонецРасчетногоГода, "День");
	
	//Заполнение структуры возврата
	СтруктураВозврата.РасчетнаяДатаНачала    = РасчетнаяДатаНачала;
	СтруктураВозврата.РасчетнаяДатаОкончания = РасчетнаяДатаОкончания;
	СтруктураВозврата.КоличествоДнейВГоду  = КоличествоДнейВГоду;
	
	Возврат СтруктураВозврата;
КонецФункции

Функция РезультатРасчета(ПользовательскиеНастройки, СтруктураПараметров) Экспорт
	Перем СтруктураВозврата;
	
	//Начальная проверка существования нужных настроек расчета
	Если ПользовательскиеНастройки=Неопределено Тогда
		ОбщегоНазначенияДУКлиентСервер.СообщитьОбОшибке("Отсутствуют настройки алгоритма");
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура(
	"СуммаВознаграждения, СтавкаВознаграждения, БРСА, БРСА_Начальная, СправкаРасчет",
	0,
	0,
	0,
	0,
	Новый ХранилищеЗначения(Новый Структура("ШапкаРасчет, ТелоРасчет, ПодвалРасчет, НачалоПериода, ОкончаниеПериода", Новый ТабличныйДокумент(), Новый ТабличныйДокумент(), Новый ТабличныйДокумент()))
	);
	// Если в рег.задании произойде ошибка, то никогда не узнаешь причину!
	Попытка
		
		//Инициализация параметров для расчета
		ПоказателиСправки = Новый Структура;
		ПоказателиСправки.Вставить("ДатаРасчета", "");
		ПоказателиСправки.Вставить("НачалоРасчета", "");
		ПоказателиСправки.Вставить("ОкончаниеРасчета", "");
		
		ПоказателиСправки.Вставить("ДоговорДУ", "");
		ПоказателиСправки.Вставить("ДатаДоговораДУ", "");
		ПоказателиСправки.Вставить("НомерДоговораДУ", "");
		
		ПоказателиСправки.Вставить("П000", 0);
		ПоказателиСправки.Вставить("П011", 0);
		ПоказателиСправки.Вставить("П012", 0);
		ПоказателиСправки.Вставить("П013", 0);
		ПоказателиСправки.Вставить("П014", 0);
		ПоказателиСправки.Вставить("П015", 0);
		
		ПоказателиСправки.Вставить("П021", 0);
		ПоказателиСправки.Вставить("П021Строка", "");
		ПоказателиСправки.Вставить("П022", 0);
		ПоказателиСправки.Вставить("П023", 0);
		
		ПоказателиСправки.Вставить("П031", 0);
		ПоказателиСправки.Вставить("П032", 0);
		ПоказателиСправки.Вставить("П033", 0);  
		
		ПоказателиСправки.Вставить("П04", 0);
		ПоказателиСправки.Вставить("П05", 0);
		ПоказателиСправки.Вставить("П05", 0);
		ПоказателиСправки.Вставить("П051", 0);
		ПоказателиСправки.Вставить("П06", 0);
		
		СтруктураПараметровДУ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтруктураПараметров.ДоговорДУ, "ДатаВводаСредствВДУ, ДатаНачала, ДатаОкончания, Код, ДатаПриостановкиУправления, ДатаВозобновленияУправления");   //kmusorin IMAPPS-7198
		ПВХ                   = ПланыВидовХарактеристик.ПараметрыДоговораДУ;
		ПроцентВознаграждения = УправлениеПараметрамиДоговораДУ.ПолучитьПараметрДоговораДУ(СтруктураПараметров.ДоговорДУ, ПВХ.ВеличинаВознагражденияЗаУспех, СтруктураПараметров.Дата);
		
		//Определение границ периода
		СтруктураПараметровПериода = Новый Структура;
		СтруктураПараметровПериода.Вставить("ДатаДокумента"     , СтруктураПараметров.Дата); 
		СтруктураПараметровПериода.Вставить("СтруктураДоговораДУ", СтруктураПараметровДУ);
		СтруктураПараметровПериода.Вставить("НастройкиАлгоритма", ПользовательскиеНастройки.Значения);
		
		СтруктураПериодаРасчета = ГраницыПериодаРасчета(СтруктураПараметровПериода);
		РасчетнаяДатаНачала     = СтруктураПериодаРасчета.РасчетнаяДатаНачала;
		РасчетнаяДатаОкончания  = СтруктураПериодаРасчета.РасчетнаяДатаОкончания;
		ДнейВГоду     = СтруктураПериодаРасчета.КоличествоДнейВГоду;
		
		Если РасчетнаяДатаНачала > РасчетнаяДатаОкончания Тогда
			Возврат СтруктураВозврата;  
		КонецЕсли;
		
		// IMAPPS-29983 ++
		//Если СтруктураПараметровПериода.СтруктураДоговораДУ.ДатаПриостановкиУправления = Дата(1,1,1) Тогда
		// IMAPPS-29983 --
			СтруктураПараметровПриростРСА = Новый Структура;
			СтруктураПараметровПриростРСА.Вставить("Дата", СтруктураПараметров.Дата);
			СтруктураПараметровПриростРСА.Вставить("ДоговорДУ", СтруктураПараметров.ДоговорДУ);
			
			СтруктураПараметровПриростРСА.Вставить("ДатаНачалаРасчета"   , РасчетнаяДатаНачала);
			СтруктураПараметровПриростРСА.Вставить("ДатаОкончанияРасчета", РасчетнаяДатаОкончания);
			СтруктураПараметровПриростРСА.Вставить("ДатаНачалаДУ"   , СтруктураПараметровДУ.ДатаНачала);
			СтруктураПараметровПриростРСА.Вставить("ДатаОкончанияДУ", СтруктураПараметровДУ.ДатаОкончания);
			
			СтруктураРасчетаПриростРСА = ИнвестиционныйДоход_Базовый(СтруктураПараметровПриростРСА);
			
			СтруктураПараметровУправление = Новый Структура;
			СтруктураПараметровУправление.Вставить("Дата", СтруктураПараметров.Дата);
			СтруктураПараметровУправление.Вставить("ДоговорДУ", СтруктураПараметров.ДоговорДУ);
			СтруктураПараметровУправление.Вставить("ДатаНачалаДУ", СтруктураПараметровДУ.ДатаНачала);
			СтруктураПараметровУправление.Вставить("ДатаОкончанияДУ", СтруктураПараметровДу.ДатаОкончания);
			СтруктураПараметровУправление.Вставить("ДатаНачалаРасчета"   , РасчетнаяДатаНачала);
			СтруктураПараметровУправление.Вставить("ДатаОкончанияРасчета", РасчетнаяДатаОкончания);
			
			СуммаЗаУправление = РасчетСуммыЗаУправление(СтруктураПараметровУправление);
			//РачетнаяВеличинаВознаграждения = (СтруктураРасчетаПриростРСА.ПриростРСА-СуммаЗаУправление)*(ПроцентВознаграждения/100);
			//ИтоговыйРасчет = ?(СтруктураРасчетаПриростРСА.ПриростРСА>0, Макс(0, РачетнаяВеличинаВознаграждения), 0);
			
			СуммаЗаУправление = Окр(СуммаЗаУправление,2);
			//РачетнаяВеличинаВознаграждения = Окр(РачетнаяВеличинаВознаграждения,2);
			//ИтоговыйРасчет = Окр(ИтоговыйРасчет,2);
			//ИнициализироватьБухгалтерскиеИтоги(СтруктураПараметров.ДоговорДУ, РасчетнаяДатаНачала, РасчетнаяДатаОкончания);	
			
			// + FVasiliev  12.03.2026 
			КоэффициентВознаграждения = ПроцентПоТаблицеКоэффициентов(СтруктураРасчетаПриростРСА, СтруктураПараметровПериода, ПоказателиСправки, ПроцентВознаграждения / 100);
			//ВеличинаВознаграждения = УправлениеПараметрамиДоговораДУ.ПолучитьПараметрДоговораДУ(СтруктураПараметров.ДоговорДУ, ПВХ.ВеличинаВознагражденияЗаУспех, СтруктураПараметров.Дата);
			//РазмерыВознаграждения = ПолучитьРазмерВознаграждения(СтруктураПараметров.ДоговорДУ, СтруктураПараметров.Дата, Базис, ВеличинаВознаграждения);
			//СтруктураПроцент = РазмерыВознаграждения.Получить(ПВХ.ВеличинаВознагражденияЗаУспех);
			//СуммаЗаУправление = НачалоРасчета(СтруктураПараметров, СтруктураПараметровДУ, ПользовательскиеНастройки, ПВХ);
			РачетнаяВеличинаВознаграждения = ОКР((СтруктураРасчетаПриростРСА.ПриростРСА-СуммаЗаУправление) * КоэффициентВознаграждения, 2);
			ИтоговыйРасчет = ?(СтруктураРасчетаПриростРСА.ПриростРСА-СуммаЗаУправление > 0, Макс(0, РачетнаяВеличинаВознаграждения), 0);
			ИтоговыйРасчет = Окр(ИтоговыйРасчет,2);
			
			//СуммаЗаУправление = Окр(СуммаЗаУправление,2);
			//РачетнаяВеличинаВознаграждения = Окр(РачетнаяВеличинаВознаграждения,2);
			 //- FVasiliev IMAPPS-35828 12.03.2026.
			
			//Расчет БРСА
			БРСА=0;
			БРСА_Начальная = СтруктураРасчетаПриростРСА.БазоваяРСА;
			пРассчитыватьБРСА = Ложь;
			ПользовательскиеНастройки.Значения.Свойство("РассчитыватьБРСА", пРассчитыватьБРСА);
			Если НЕ пРассчитыватьБРСА=Неопределено и пРассчитыватьБРСА Тогда
				СтруктураПараметровБРСА = Новый Структура;
				СтруктураПараметровУправление.Вставить("ДатаНачалаРасчета"   , РасчетнаяДатаНачала);
				СтруктураПараметровУправление.Вставить("ДатаОкончанияРасчета", РасчетнаяДатаОкончания);
				СтруктураПараметровУправление.Вставить("ДоговорДУ", СтруктураПараметров.ДоговорДУ);
				СтруктураПараметровУправление.Вставить("БРСА_Прошлая", СтруктураРасчетаПриростРСА.БазоваяРСА);
				СтруктураПараметровУправление.Вставить("ВознаграждениеMF", СуммаЗаУправление);
				СтруктураПараметровУправление.Вставить("ВознаграждениеSF", ИтоговыйРасчет);
				БРСА = РасчетБРСА(СтруктураПараметровУправление);				
			КонецЕсли;
			
			//Заполнение показателей для справки-расчета
			ПоказателиСправки.ДатаРасчета   = Формат(СтруктураПараметров.Дата, "ДФ=dd.MM.yyyy");
			ПоказателиСправки.НачалоРасчета    = РасчетнаяДатаНачала;
			ПоказателиСправки.ОкончаниеРасчета = РасчетнаяДатаОкончания;
			ПоказателиСправки.ДоговорДУ   = СтруктураПараметров.ДоговорДУ;
			ПоказателиСправки.ДатаДоговораДУ = СтруктураПараметровДУ.ДатаНачала;
			ПоказателиСправки.НомерДоговораДУ = СтруктураПараметровДУ.Код;
			
			ПоказателиСправки.П000 = СуммаЗаУправление;
			ПоказателиСправки.П011 = СтруктураРасчетаПриростРСА.РСА_Начало;
			ПоказателиСправки.П012 = СтруктураРасчетаПриростРСА.РСА_Окончание;
			ПоказателиСправки.П013 = СтруктураРасчетаПриростРСА.СуммаВложения;
			ПоказателиСправки.П014 = СтруктураРасчетаПриростРСА.СуммаИзъятия;
			
			ПоказателиСправки.П015 = СтруктураРасчетаПриростРСА.ПриростРСА-СуммаЗаУправление;
			
			ПоказателиСправки.П021 = КоэффициентВознаграждения * 100;
			ПоказателиСправки.П022 = РачетнаяВеличинаВознаграждения;
			ПоказателиСправки.П023 = ИтоговыйРасчет;
			
			ПоказателиСправки.П031 = ПоказателиСправки.П011 + ПоказателиСправки.П013 - ПоказателиСправки.П014;
			//ПоказателиСправки.П032 = ПоказателиСправки.П012 - СуммаЗаУправление - ИтоговыйРасчет;
			ПоказателиСправки.П032 = ПоказателиСправки.П012 - ОКР(СуммаЗаУправление, 2) - ИтоговыйРасчет; // VTB
			
			ПоказателиСправки.П033 = ?(ПоказателиСправки.П031>ПоказателиСправки.П032,ПоказателиСправки.П031,ПоказателиСправки.П032);
			
			//СтруктураСЧА = СреднееСЧА_РСА(СтруктураПараметров.ДоговорДУ, РасчетнаяДатаНачала, РасчетнаяДатаОкончания);	
			//ПоказателиСправки.Вставить("СтруктураСЧА",СтруктураСЧА);
			//ДоходОтСЧА = СтруктураСЧА.СЧА*0.2/100;
			//
			//ПоказателиСправки.П04  = ПолучитьРасходы(СтруктураПараметров.ДоговорДУ, РасчетнаяДатаНачала, РасчетнаяДатаОкончания);
			//  ПоказателиСправки.П05  = Окр(ДоходОтСЧА,2);
			//ПоказателиСправки.П051 = Окр(СтруктураСЧА.СЧА,2);

			//ПоказателиСправки.П06 = ?((ПоказателиСправки.П04 - ПоказателиСправки.П05)>0,ПоказателиСправки.П04 - ПоказателиСправки.П05,0); 

			//СуммаЗаУправление = РасчетСуммыЗаУправление(СтруктураПараметровУправление);
			//РачетнаяВеличинаВознаграждения = (СтруктураРасчетаПриростРСА.ПриростРСА-СуммаЗаУправление)*(ПроцентВознаграждения/100);
			//ИтоговыйРасчет = ?(СтруктураРасчетаПриростРСА.ПриростРСА>0, Макс(0, РачетнаяВеличинаВознаграждения), 0);
			
			//СуммаЗаУправление = Окр(СуммаЗаУправление,2);
			//РачетнаяВеличинаВознаграждения = Окр(РачетнаяВеличинаВознаграждения,2);
			//ИтоговыйРасчет = Окр(ИтоговыйРасчет,2);
			//ИнициализироватьБухгалтерскиеИтоги(СтруктураПараметров.ДоговорДУ, РасчетнаяДатаНачала, РасчетнаяДатаОкончания);	
			
			//Расчет БРСА
			//БРСА=0;
			//БРСА_Начальная = СтруктураРасчетаПриростРСА.БазоваяРСА;
			//пРассчитыватьБРСА = Ложь;
			//ПользовательскиеНастройки.Значения.Свойство("РассчитыватьБРСА", пРассчитыватьБРСА);
			//Если НЕ пРассчитыватьБРСА=Неопределено и пРассчитыватьБРСА Тогда
			//	СтруктураПараметровБРСА = Новый Структура;
			//	СтруктураПараметровУправление.Вставить("ДатаНачалаРасчета"   , РасчетнаяДатаНачала);
			//	СтруктураПараметровУправление.Вставить("ДатаОкончанияРасчета", РасчетнаяДатаОкончания);
			//	СтруктураПараметровУправление.Вставить("ДоговорДУ", СтруктураПараметров.ДоговорДУ);
			//	СтруктураПараметровУправление.Вставить("БРСА_Прошлая", СтруктураРасчетаПриростРСА.БазоваяРСА);
			//	СтруктураПараметровУправление.Вставить("ВознаграждениеMF", СуммаЗаУправление);
			//	СтруктураПараметровУправление.Вставить("ВознаграждениеSF", ИтоговыйРасчет);
			//	БРСА = РасчетБРСА(СтруктураПараметровУправление);				
			//КонецЕсли;
			
			СтруктураВозврата.СуммаВознаграждения	 = ИтоговыйРасчет;
			СтруктураВозврата.СправкаРасчет			 = СправкаРасчет(ПоказателиСправки);
			СтруктураВозврата.СтавкаВознаграждения	 = КоэффициентВознаграждения * 100;
			СтруктураВозврата.БРСА					 = БРСА;
			СтруктураВозврата.БРСА_Начальная		 = БРСА_Начальная;
			//СтруктураВозврата.БРСА					 = ПоказателиСправки.П012;
			//СтруктураВозврата.БРСА_Начальная		 = ПоказателиСправки.П011;
			
		// IMAPPS-29983 ++
		//КонецЕсли;   
		// IMAPPS-29983 --
		
	Исключение
		Ошибка = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(Ошибка);
		ЗаписьЖурналаРегистрации("Ошибка выполнения", УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
		Сообщить(Ошибка);
	КонецПопытки;
	
	Возврат СтруктураВозврата;
КонецФункции

Функция СреднееСЧА_РСА(ДоговорДУ, ДатаНачала, ДатаОкончания, ТипДня ="КалендарныйТип" )
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СЧА", 0);
	СтруктураВозврата.Вставить("РСА", 0);
	СтруктураВозврата.Вставить("ТаблицаСЧА_РСА", Новый ТаблицаЗначений);
	СтруктураВозврата.Вставить("КоличествоДней", 0);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КалендарныеГрафики.ДатаГрафика КАК Дата
	|ИЗ
	|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	|ГДЕ
	|	КалендарныеГрафики.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.РегламентированныйКалендарь)
	|	И КалендарныеГрафики.ДатаГрафика МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И КалендарныеГрафики.ДеньВключенВГрафик";
	Если ТипДня="КалендарныйТип" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КалендарныеГрафики.ДеньВключенВГрафик", "ИСТИНА");
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	ТаблицаСЧА_РСА = РегистрыСведений.РегистрРСА_СЧА.ТЗ_СЧА_РСА_НаДаты(Запрос.Выполнить().Выгрузить(), ДоговорДУ);
		
	КоличествоДней = ТаблицаСЧА_РСА.Количество();
	Если НЕ КоличествоДней=0 Тогда
		СтруктураВозврата.СЧА = ТаблицаСЧА_РСА.Итог("СЧА")/КоличествоДней;
		СтруктураВозврата.РСА = ТаблицаСЧА_РСА.Итог("РСА")/КоличествоДней;
		СтруктураВозврата.ТаблицаСЧА_РСА = ТаблицаСЧА_РСА;
		СтруктураВозврата.КоличествоДней = КоличествоДней;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
КонецФункции

Процедура ИнициализироватьБухгалтерскиеИтоги(ДоговорДУ, ДатаНачала, ДатаОкончания)
	
	БухгалтерскиеИтоги = Обработки.БухгалтерскиеИтоги.Создать();
	
	Итоги = "НачальныйОстатокДт, НачальныйОстатокКт,
	|НачальныйыРазвернутыйОстатокДт, НачальныйРазвернутыйОстатокКт,
	|КонечныйОстатокДт, КонечныйОстатокКт, 
	|КонечныйРазвернутыйОстатокДт,КонечныйРазвернутыйОстатокКт,
	|ОборотДт, ОборотКт, КорОборотДт, КорОборотКт";
	
	Ресурсы = "Сумма,Количество";
	
	Группировки = "Счет, КорСчет, Субконто1, Субконто2, Субконто3";
	
	Отбор = Новый Структура;
	Отбор.Вставить("ДоговорДУ", ДоговорДУ);
	
	БухгалтерскиеИтоги.РассчитатьИтоги("Хозрасчетный", Итоги, Ресурсы, Группировки, Новый Граница(НачалоДня(ДатаНачала), ВидГраницы.Включая), Новый Граница(КонецДня(ДатаОкончания), ВидГраницы.Включая), , , , , , Отбор);
	
КонецПроцедуры

Функция ПолучитьРасходы(ДоговорДУ, ДатаНачала, ДатаОкончания)
	
	ДепозитарныеУслуги 		= БухгалтерскиеИтоги.ДО(ПланыСчетов.Хозрасчетный.ДепозитарныеУслуги);
	УслугиБанка 			= БухгалтерскиеИтоги.ДО(ПланыСчетов.Хозрасчетный.УслугиБанка);
	УслугиСпецдепозитария 	= БухгалтерскиеИтоги.ДО(ПланыСчетов.Хозрасчетный.УслугиСпецдепозитария);
	ПрочиеРасходыПрочие 	= БухгалтерскиеИтоги.ДО(ПланыСчетов.Хозрасчетный.ПрочиеРасходыПрочие);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ДенежныеСредстваУправленческий.СтатьяДДС = &КомиссияБиржи
	|					ТОГДА ДенежныеСредстваУправленческий.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК КомиссияБиржи,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ДенежныеСредстваУправленческий.СтатьяДДС В (&КомиссияБрокера, &КомиссияПосредника)
	|					ТОГДА ДенежныеСредстваУправленческий.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК КомиссияБрокера
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУправленческий КАК ДенежныеСредстваУправленческий
	|ГДЕ
	|	ДенежныеСредстваУправленческий.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредстваУправленческий.ДоговорДУ = &ДоговорДУ
	|	И ДенежныеСредстваУправленческий.СтатьяДДС В (&КомиссияБиржи, &КомиссияБрокера, &КомиссияПосредника)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ПОМЕСТИТЬ Счета
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&СписокСчетов)
	|	И Хозрасчетный.ЗапретитьИспользоватьВПроводках = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	NULL КАК ДатаРегистратора,
	|	ХозрасчетныйОстатки.СуммаОстатокКт КАК Сумма
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&КонецПериодаГраница,
	|			Счет В
	|				(ВЫБРАТЬ
	|					Счета.Счет
	|				ИЗ
	|					Счета КАК Счета),
	|			,
	|			ДоговорДУ = &ДоговорДУ) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.Счет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоНачисленномуДоходу)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет,
	|	ХозрасчетныйОстатки.Субконто3.Дата,
	|	ХозрасчетныйОстатки.СуммаОстатокКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериодаГраница, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоНачисленномуДоходу), , ДоговорДУ = &ДоговорДУ) КАК ХозрасчетныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Счета.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоНачисленномуДоходу)
	|			ТОГДА ""Начисление % от средней СЧА""
	|		ИНАЧЕ Счета.Счет.Наименование
	|	КОНЕЦ КАК СчетПредставление,
	|	Остатки.ДатаРегистратора КАК ДатаРегистратора,
	|	ЕСТЬNULL(Остатки.Сумма, 0) КАК Сумма
	|ИЗ
	|	Счета КАК Счета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО Счета.Счет = Остатки.Счет
	|ГДЕ
	|	ЕСТЬNULL(Остатки.Сумма, 0) <> 0";
	
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	Запрос.УстановитьПараметр("КомиссияБиржи", ПредопределенноеЗначение("Справочник.СтатьиДвиженияДенежныхСредств.КомиссияБиржи"));
	Запрос.УстановитьПараметр("КомиссияБрокера", ПредопределенноеЗначение("Справочник.СтатьиДвиженияДенежныхСредств.КомиссияБрокера"));
	Запрос.УстановитьПараметр("КомиссияПосредника", ПредопределенноеЗначение("Справочник.СтатьиДвиженияДенежныхСредств.КомиссияПосредника"));
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("КонецПериодаГраница", Новый Граница(КонецДня(ДатаОкончания), ВидГраницы.Включая));
	
	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.НачисленныеВознаграждения);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ОбязательноеСтрахование);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеВзаиморасчеты);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.НДФЛ);
	// IMAPPS-13736 ++
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоНачисленномуДоходу);
	// IMAPPS-13736 --
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	
	ОбщегоНазначенияДУ.ДобавитьВЛогОтладки(Запрос, "Отчет управляющего ДУ, согласно 482П - Раздел 6.1 - Комиссии");
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	КомиссияБиржи = 0;
	КомиссияБрокера = 0;
	
	Комиссии = РезультатЗапроса[0].Выгрузить();
	
	Если Комиссии.Количество() > 0 Тогда
		
		КомиссияБиржи = Комиссии[0].КомиссияБиржи;
		КомиссияБрокера = Комиссии[0].КомиссияБрокера;
		
	КонецЕсли; 
	
	//vtb 29.06
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ХозрасчетныйОбороты.СуммаОборотДт как ИныеКомиссии
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходыПрочие),
	|			,
	|			ДоговорДУ = &ДоговорДУ
	|				И Субконто1 В (&СтатьиРасходов),
	|			,
	|			) КАК ХозрасчетныйОбороты";
	
	СтатьиРасходов = Новый Массив; 	
	СтатьиРасходов.Добавить(ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ОбязательноеСтрахование"));
	СтатьиРасходов.Добавить(ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.УслугиАудитора"));
	
	Запрос.УстановитьПараметр("ДоговорДУ", ДоговорДУ);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("СтатьиРасходов", СтатьиРасходов);
	
	
	ПрочиеРасходыПрочие = 0;
	ИныеКомиссии = Запрос.Выполнить().Выгрузить();	
	
	Если ИныеКомиссии.Количество() > 0 Тогда
		ПрочиеРасходыПрочие = ИныеКомиссии[0].ИныеКомиссии;
	КонецЕсли; 
	
	
	ДанныеРаздела = Новый Структура;
	ДанныеРаздела.Вставить("КомиссияБиржи", КомиссияБиржи);
	ДанныеРаздела.Вставить("КомиссияБрокера", КомиссияБрокера);
	ДанныеРаздела.Вставить("ДепозитарныеУслуги", ДепозитарныеУслуги);
	ДанныеРаздела.Вставить("УслугиБанка", УслугиБанка);
	ДанныеРаздела.Вставить("УслугиСпецдепозитария", УслугиСпецдепозитария);
	ДанныеРаздела.Вставить("ПрочиеРасходыПрочие", ПрочиеРасходыПрочие);
	ДанныеРаздела.Вставить("Обязательства", РезультатЗапроса[3].Выгрузить());
	
		ИтогоСумма = 
	ДанныеРаздела.КомиссияБиржи + 
	ДанныеРаздела.КомиссияБрокера + 
	ДанныеРаздела.ДепозитарныеУслуги +
	ДанныеРаздела.УслугиБанка +
	ДанныеРаздела.УслугиСпецдепозитария +
	ДанныеРаздела.ПрочиеРасходыПрочие;

	Возврат ИтогоСумма;
	
КонецФункции


Функция ПолучитьПодписанта(УК)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтактныеЛица.Ссылка
	|ИЗ
	|	Справочник.КонтактныеЛица КАК КонтактныеЛица
	|ГДЕ
	|	КонтактныеЛица.Владелец = &УК
	|	И КонтактныеЛица.ПометкаУдаления = ЛОЖЬ
	|	И КонтактныеЛица.Роль = &Роль";
	Запрос.УстановитьПараметр("УК", УК);
	Запрос.УстановитьПараметр("Роль", Справочники.РолиКонтактныхЛиц.РуководительПодразделения);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат СокрЛП(Выборка.Ссылка.Должность) + ": " + Выборка.Ссылка.Фамилия + " " + Лев(Выборка.Ссылка.Имя, 1) + "." + Лев(Выборка.Ссылка.Отчество, 1) + ".";
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции	

// FVasiliev IMAPPS-35828 12.03.2026. 
#Область IMAPPS35828
	
// Функция получает размер вознаграждения
//
// Параметры:
//  ПИФ - фонд
//  Дата - дата
//  МассивПараметровФонда  - массив из параметров, для которых необходимо рассчитать вознаграждения
//  Базис - базис
//  СпособНачисления - способ начисления (значение по-умолчанию: Неопределено)
//
// Возвращаемое значение:
//  РазмерыВознаграждения = соответствие, в которое передаются размеры вознаграждений
//
Функция ПолучитьРазмерВознаграждения(ДоговорДУ, Дата, Базис, ЗначениеПараметраДоговораДУ = Неопределено)  
	
	СоотВознаграждений = Новый Соответствие;
	
	ФиксСумма = Ложь;
	
	ВалютаРеглУчета = ОбщегоНазначенияДУ.ВалютаРеглУчета(ДоговорДУ);
	
	КурсКратностьРегл = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаРеглУчета, ВалютаРеглУчета, Дата);
	
	МассивПараметровДоговораДУ = Новый Массив;
	МассивПараметровДоговораДУ.Добавить(ПланыВидовХарактеристик.ПараметрыДоговораДУ.ВеличинаВознагражденияУК);
	
	Для каждого СтрокаМассива из МассивПараметровДоговораДУ Цикл
		СоотВознаграждений.Вставить(СтрокаМассива, 0);
	КонецЦикла;
	
	Для каждого СтрокаМассива из МассивПараметровДоговораДУ Цикл
		Если ЗначениеПараметраДоговораДУ = Неопределено Тогда
			Значение = УправлениеПараметрамиДоговораДУ.ПолучитьПараметрДоговораДУ(ДоговорДУ, СтрокаМассива, Дата);
		Иначе
			Значение = ЗначениеПараметраДоговораДУ;
		КонецЕсли;
		
		// может у нас от старых доков просто число пришло
		Если ТипЗнч(Значение) = Тип("Число") Тогда
			СоотВознаграждений.Вставить(СтрокаМассива,Число(Значение));
			Продолжить;
		КонецЕсли;
		
		МассивИзСтрокЛесенки = УправлениеПараметрамиДоговораДУ.РазобратьЗначениеВознаграждения(Значение);
		
		Для каждого СтрокаЛесенки из МассивИзСтрокЛесенки Цикл
			
			Добавляем = Ложь;
			Прерываем = Ложь;
			
			Если СтрокаЛесенки.ТипСравнения = "<" Тогда
				Если Базис < СтрокаЛесенки.Значение Тогда
					Добавляем = Истина;
					Прерываем = Истина;										
				КонецЕсли;
			ИначеЕсли СтрокаЛесенки.ТипСравнения = ">=" Тогда
				Если Базис >= СтрокаЛесенки.Значение Тогда
					Добавляем = Истина;
					Прерываем = Ложь;		
				КонецЕсли;
			Иначе
				Если Базис > СтрокаЛесенки.Значение Тогда
					Добавляем = Истина;
					Прерываем = Ложь;		
				КонецЕсли;
			КонецЕсли;
			
			Если Добавляем Тогда
				Если СтрокаЛесенки.Суммой Тогда
					
					Если СтрокаЛесенки.Свойство("Валюта") и СтрокаЛесенки.Валюта <> ВалютаРеглУчета Тогда
						КурсКратность = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаРеглУчета, СтрокаЛесенки.Валюта, Дата);
						
						СуммаВознаграждения = Окр(МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаЛесенки.РазмерВознаграждения,
						СтрокаЛесенки.Валюта, ВалютаРеглУчета, 
						КурсКратность.Курс, КурсКратностьРегл.Курс,
						КурсКратность.Кратность, КурсКратностьРегл.Кратность), 2);
					Иначе
						СуммаВознаграждения = СтрокаЛесенки.РазмерВознаграждения;
					КонецЕсли;
					
					СоотВознаграждений.Вставить(СтрокаМассива, Новый Структура("РазмерВознаграждения",СуммаВознаграждения));
					
				Иначе
					СоотВознаграждений.Вставить(СтрокаМассива, СтрокаЛесенки.РазмерВознаграждения);
				КонецЕсли;
			КонецЕсли;
			
			Если Прерываем Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СоотВознаграждений;
	
КонецФункции // ПолучитьРазмерВознаграждения()

Функция ПолучитьНачалоПериодаРасчета(Период, Дата)
	
	СтруктураОтвета = Новый Структура("ДатаНачала, ДатаОкончания", Дата(1,1,1), Дата(1,1,1));
	
	Если Период=Перечисления.Периодичность.Месяц Тогда
		
		СтруктураОтвета.ДатаНачала = НачалоМесяца(Дата);
		СтруктураОтвета.ДатаОкончания = КонецМесяца(Дата); 
		Возврат СтруктураОтвета;
		
	ИначеЕсли Период=Перечисления.Периодичность.Квартал Тогда
		
		СтруктураОтвета.ДатаНачала = НачалоКвартала(Дата);
		СтруктураОтвета.ДатаОкончания = КонецКвартала(Дата); 
		Возврат СтруктураОтвета;
		
	ИначеЕсли Период=Перечисления.Периодичность.Декада Тогда
		
		Если Месяц(Дата) >= 9 Тогда
			
			СтруктураОтвета.ДатаНачала = ДобавитьМесяц(НачалоГода(Дата), 9);
			СтруктураОтвета.ДатаОкончания = КонецГода(Дата); 
			Возврат СтруктураОтвета;
			
		ИначеЕсли Месяц(Дата) >= 5 Тогда
			
			СтруктураОтвета.ДатаНачала = ДобавитьМесяц(НачалоГода(Дата), 5);
			СтруктураОтвета.ДатаОкончания = КонецМесяца(ДобавитьМесяц(НачалоГода(Дата), 8)); 
			Возврат СтруктураОтвета;
			
		Иначе
			
			СтруктураОтвета.ДатаНачала = НачалоГода(Дата);
			СтруктураОтвета.ДатаОкончания = КонецМесяца(ДобавитьМесяц(НачалоГода(Дата), 4)); 
			Возврат СтруктураОтвета;			
			
		КонецЕсли;		
		
	ИначеЕсли Период=Перечисления.Периодичность.Полугодие Тогда
		
		Если Месяц(Дата) >= 7 Тогда
			
			СтруктураОтвета.ДатаНачала = ДобавитьМесяц(НачалоГода(Дата), 7);
			СтруктураОтвета.ДатаОкончания = КонецГода(Дата);
			Возврат СтруктураОтвета;		
			
		Иначе
			
			СтруктураОтвета.ДатаНачала = НачалоГода(Дата);
			СтруктураОтвета.ДатаОкончания = КонецМесяца(ДобавитьМесяц(НачалоГода(Дата), 6));
			Возврат СтруктураОтвета;	
			
		КонецЕсли;
	ИначеЕсли Период=Перечисления.Периодичность.Год Тогда
		
		СтруктураОтвета.ДатаНачала = НачалоГода(Дата);
		СтруктураОтвета.ДатаОкончания =КонецГода(Дата);
		Возврат СтруктураОтвета;	

	Иначе
		
				СтруктураОтвета.ДатаНачала = НачалоКвартала(Дата);
		СтруктураОтвета.ДатаОкончания = КонецКвартала(Дата); 
		Возврат СтруктураОтвета;

	КонецЕсли;
	
КонецФункции

Функция ГраницыПериодаРасчетаНачало(СтруктураПараметров)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("РасчетнаяДатаНачала", Дата(1, 1, 1));
	СтруктураВозврата.Вставить("РасчетнаяДатаОкончания", Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ПредполагаемаяДатаОкончания", Дата(1, 1, 1));
	
	СтурктураРасчета = ПолучитьНачалоПериодаРасчета(СтруктураПараметров.НастройкиАлгоритма.Периодичность, СтруктураПараметров.ДатаДокумента);
	
	РасчетнаяДатаНачала = СтурктураРасчета.ДатаНачала;
	ПредполагаемаяДатаОкончания = СтурктураРасчета.ДатаОкончания;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.СтруктураДоговораДУ.ДатаОкончания) Тогда
		РасчетнаяДатаОкончания = КонецДня(Мин(СтруктураПараметров.ДатаДокумента, СтруктураПараметров.СтруктураДоговораДУ.ДатаОкончания));
	Иначе
		РасчетнаяДатаОкончания = КонецДня(СтруктураПараметров.ДатаДокумента);
	КонецЕсли;
	
	Если РасчетнаяДатаНачала > РасчетнаяДатаОкончания Тогда
		
		//Заполнение структуры возврата
		СтруктураВозврата.РасчетнаяДатаНачала    = РасчетнаяДатаНачала;
		СтруктураВозврата.РасчетнаяДатаОкончания = РасчетнаяДатаНачала;
		СтруктураВозврата.ПредполагаемаяДатаОкончания = РасчетнаяДатаНачала;
		
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	//Заполнение структуры возврата
	СтруктураВозврата.РасчетнаяДатаНачала    = РасчетнаяДатаНачала;
	СтруктураВозврата.РасчетнаяДатаОкончания = РасчетнаяДатаОкончания;
	СтруктураВозврата.ПредполагаемаяДатаОкончания = ПредполагаемаяДатаОкончания;
	
	
	Возврат СтруктураВозврата;
КонецФункции

Функция  НачалоРасчета(СтруктураПараметров, СтруктураПараметровДУ, ПользовательскиеНастройки, ПВХ)

	//Определение границ периода
	СтруктураПараметровПериода = Новый Структура;
	СтруктураПараметровПериода.Вставить("ДатаДокумента"     , СтруктураПараметров.Дата); 
	СтруктураПараметровПериода.Вставить("СтруктураДоговораДУ", СтруктураПараметровДУ);
	СтруктураПараметровПериода.Вставить("НастройкиАлгоритма", ПользовательскиеНастройки.Значения);
	
	
	СтруктураПериодаРасчета = ГраницыПериодаРасчетаНачало(СтруктураПараметровПериода);
	НачалоПериода = СтруктураПериодаРасчета.РасчетнаяДатаНачала;
	КонецПериода  = СтруктураПериодаРасчета.РасчетнаяДатаОкончания;
    ПредполагаемаяДатаРасчета = СтруктураПериодаРасчета.ПредполагаемаяДатаОкончания;
	
	ВеличинаВознаграждения = УправлениеПараметрамиДоговораДУ.ПолучитьПараметрДоговораДУ(СтруктураПараметров.ДоговорДУ, ПВХ.ВеличинаВознагражденияУК, СтруктураПараметров.Дата);
	
	РазмерыВознаграждения = ПолучитьРазмерВознаграждения(СтруктураПараметров.ДоговорДУ, СтруктураПараметров.Дата, 0, ВеличинаВознаграждения);
	
	Ответ = РазмерыВознаграждения.Получить(ПВХ.ВеличинаВознагражденияУК);
	
	Если ТипЗнч(Ответ) = ТИП("Число") Тогда
		РезультирующаяСумма = Ответ; 
	Иначе
		РезультирующаяСумма	= Ответ.РазмерВознаграждения;
	КонецЕсли;
	ВсегоДней = (ПредполагаемаяДатаРасчета - НачалоПериода) / 60 / 60 / 24;
	ПрошлоДней = (КонецПериода - НачалоПериода) / 60 / 60 / 24;
	
	Если ВсегоДней = 0 Тогда
		РезультирующаяСумма = 0;
	Иначе
		РезультирующаяСумма = РезультирующаяСумма *  ПрошлоДней/ВсегоДней;
	КонецЕсли;
	                                               
	РезультирующаяСумма = Окр(РезультирующаяСумма,2);
	
	Возврат РезультирующаяСумма;

КонецФункции

Функция ПроцентПоТаблицеКоэффициентов(СтруктураРасчетаПриростРСА, СтруктураПараметровПериода, ПоказателиСправки, СтруктураКоэффициент)
	
	Коэффициент = 0;
	//Коэффициент = СтруктураКоэффициент;

	Если СтруктураПараметровПериода.НастройкиАлгоритма.Свойство("ТаблицаКоэффициентов") Тогда 
	//	Сообщить(СтруктураПараметровПериода.НастройкиАлгоритма.ТаблицаКоэффициентов);
		ТаблицаКоэфициентовХранилище = XMLЗначение(Тип("ХранилищеЗначения"),СтруктураПараметровПериода.НастройкиАлгоритма.ТаблицаКоэффициентов).Получить(); 
		//Сообщить("" + ТипЗнч(ТаблицаКоэффициентов) + "/ " + ТаблицаКоэфициентовХранилище.Количество() + "/ " + ПоказателиСправки.П015);
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЗ.МинГраница,
			|	ТЗ.МаксГраница,
			|	ТЗ.Коэффициент
			|ПОМЕСТИТЬ Данные
			|ИЗ
			|	&ТЗ КАК ТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Данные.Коэффициент
			|ИЗ
			|	Данные КАК Данные
			|ГДЕ
			|	Данные.МинГраница <= &СуммаСЧА
			|	И Данные.МаксГраница >= &СуммаСЧА";

			//"ВЫБРАТЬ
			//|	ТЗ.МинГраница,
			//|	ТЗ.МаксГраница,
			//|	ТЗ.Коэффициент
			//|ПОМЕСТИТЬ Данные
			//|ИЗ
			//|	&ТЗ КАК ТЗ
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	МАКСИМУМ(Данные.МинГраница) КАК МинГраница
			//|ПОМЕСТИТЬ МаксМинГраница
			//|ИЗ
			//|	Данные КАК Данные
			//|ГДЕ
			//|	Данные.МинГраница <= &СуммаСЧА
			//|	И Данные.МаксГраница >= &СуммаСЧА
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	Данные.Коэффициент,
			//|	Данные.МинГраница,
			//|	Данные.МаксГраница
			//|ИЗ
			//|	МаксМинГраница КАК МаксМинГраница
			//|		ПОЛНОЕ СОЕДИНЕНИЕ Данные КАК Данные
			//|		ПО МаксМинГраница.МинГраница = Данные.МинГраница";
		
		//Запрос.УстановитьПараметр("СуммаСЧА", СреднееСЧА_РСА.СЧА*1000);
		Запрос.УстановитьПараметр("СуммаСЧА", СтруктураРасчетаПриростРСА.РСА_Окончание);
		Запрос.УстановитьПараметр("ТЗ", ТаблицаКоэфициентовХранилище);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
			//Сообщить("СЧА: " + СреднееСЧА_РСА.СЧА);    
			//Сообщить ("Мин " + ВыборкаДетальныеЗаписи.МинГраница + " макс " + ВыборкаДетальныеЗаписи.МаксГраница + " Коэф " + ВыборкаДетальныеЗаписи.Коэффициент);
			Коэффициент =  ВыборкаДетальныеЗаписи.Коэффициент;   
			//Сообщить("Процент " + Процент); 
		ИначеЕсли  СтруктураРасчетаПриростРСА.РСА_Окончание <= 0 Тогда
			Сообщить("Дохода нет", СтатусСообщения.Важное);
		Иначе
			Сообщить("Не заполнена таблица коэфицентов по договору",СтатусСообщения.Важное);
		КонецЕсли;
	//Иначе
	//	Процент = ЗначениеЛесенки;
	КонецЕсли;	

	ТекстКоэффициенты = "Ставка Вознаграждения за успех, %, определенная согласно Приложению 1:";
	ТаблицаКоэфициентовХранилище.Сортировать("МинГраница");
	КоличествоСтрок = ТаблицаКоэфициентовХранилище.Количество();
	Для инд = 0 По КоличествоСтрок - 1 Цикл
		СтрокаТЗ = ТаблицаКоэфициентовХранилище.Получить(инд);
		МинГраницаСтрокой = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОКР(СтрокаТЗ.МинГраница, 2),, Истина);
		СтрокаТЗ.МаксГраница = Мин(СтрокаТЗ.МаксГраница, 9999999999999); // Обработка ограничения числа прописью
		МаксГраницаСтрокой = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОКР(СтрокаТЗ.МаксГраница, 2),, Истина);
		Процент = ОКР(СтрокаТЗ.Коэффициент * 100, 3);
		
		Если Инд = 0 Тогда // Для первой строки
			ТекстКоэффициенты = ТекстКоэффициенты + Символы.ПС 
			+ "•	" + Процент + "% при СЧА до " + СтрокаТЗ.МаксГраница + " (" + МаксГраницаСтрокой + ") руб. включительно;";
		ИначеЕсли Инд = КоличествоСтрок - 1 Тогда // Для последней строки
			ТекстКоэффициенты = ТекстКоэффициенты + Символы.ПС 
			+ "•	" + Процент + "% при СЧА свыше " + СтрокаТЗ.МинГраница + " (" + МинГраницаСтрокой + ") руб";
		Иначе	
			ТекстКоэффициенты = ТекстКоэффициенты + Символы.ПС 
			+ "•	" + Процент + "% при СЧА свыше " + СтрокаТЗ.МинГраница + " (" + МинГраницаСтрокой + ") руб. до " 
			+ СтрокаТЗ.МаксГраница + " (" + МаксГраницаСтрокой + ") руб. включительно;";
		КонецЕсли;
	
	КонецЦикла;
	
	ПоказателиСправки.П021Строка = ТекстКоэффициенты;
	ПоказателиСправки.П021 = Коэффициент;
		
	Возврат Коэффициент;
КонецФункции

#КонецОбласти
