

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение") Тогда
		
		Если Основание.ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо Тогда 
			
			Дата = ?(ЗначениеЗаполнено(Основание.ДатаИсполненияПоручения), Основание.ДатаИсполненияПоручения, Основание.Дата);
			ДокументОснование = Основание;
			
			Если ТипЗнч(Основание.СчетДепо) = Тип("СправочникСсылка.СчетаДепо") Тогда
				ВладелецСчета = Основание.СчетДепо.Владелец;
			ИначеЕсли ТипЗнч(Основание.СчетДепо) = Тип("СправочникСсылка.СчетаДепоМХ") Тогда
				ВладелецСчета = Основание.СчетДепо.ВладелецСчетаДепоМХ;
			КонецЕсли;
			
			СчетДепо = Основание.СчетДепо;
			НаименованиеРазделаСчетаДепо = Строка(ТипРазделаСчетаДЕПО);
			
			Если ТипЗнч(ВладелецСчета) = Тип("СправочникСсылка.Контрагенты") Тогда
				Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	ДоговорыКонтрагентов.Ссылка,
				|	ДоговорыКонтрагентов.Код,
				|	ДоговорыКонтрагентов.ДатаНачалоДействия
				|ИЗ
				|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
				|ГДЕ
				|	ДоговорыКонтрагентов.Владелец = &Владелец
				|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
				|	И (ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.Депозитарный)
				|	ИЛИ ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.МежДепозитарный))");
				Запрос.УстановитьПараметр("Владелец", ВладелецСчета);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					НомерДепозитарногоДоговора = Выборка.Код;
					ДатаДепозитарногоДоговора = Выборка.ДатаНачалоДействия;
				Иначе
					Проверка = Истина;
					Сообщить("Отсутствует депозитарный договор. Документ не создан.");
					Возврат;	
				КонецЕсли;
				ТипСчетаДепо = Основание.СчетДепо.ТипСчетаДепо;
			Иначе
				ТипСчетаДепо = Основание.СчетДепо.ТипСчета;
			КонецЕсли;
			
			Если ТипЗнч(Основание.Депонент) = Тип("СправочникСсылка.Контрагенты") Тогда
				РазделСчетаДепоМХ = Основание.РазделСчетаДепоМХ;
			Иначе
				НаименованиеРазделаСчетаДепо = Основание.РазделСчетаДепоМХ;
			КонецЕсли;
			
			НомерСчета = НомерДепозитарногоДоговора;
			ТипРазделаСчетаДЕПО = Основание.ТипРазделаСчетаДЕПО;
			Залогодержатель = Основание.Залогодержатель;
			
			Если ТипЗнч(Основание.СчетДепо) = Тип("СправочникСсылка.СчетаДепо") Тогда
				РазделСубклиента = Основание.РазделСубклиента;
				Субклиент = Основание.Субклиент;
			КонецЕсли;
			
			Если ТипРазделаСчетаДЕПО = Перечисления.ТипыРазделовСчетовДЕПО.ОбеспеченияДержатель Тогда
				Брокер = Основание.Брокер;
			КонецЕсли;
			
			Комментарий = Основание.Комментарий;

		Иначе
			
			Проверка = Истина;
			Сообщить("На основании данного вида поручения нельзя создать документ Открытие раздела счета депо !!!");
			Возврат;
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипРазделаСчетаДЕПО = Перечисления.ТипыРазделовСчетовДЕПО.БлокированоВЗалоге
		И НЕ ЗначениеЗаполнено(Залогодержатель) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Для раздела " + ТипРазделаСчетаДЕПО + " необходимо указать залогодержателя.", Отказ);
		Возврат;
	КонецЕсли;
	
	Если ТипРазделаСчетаДЕПО = Перечисления.ТипыРазделовСчетовДЕПО.ОбеспеченияДержатель И Не ЗначениеЗаполнено(Брокер) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Для раздела Обеспечения (Держатель) необходимо указать брокера", Отказ);
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если НЕ СозданиеРазделаСчетаДепоДепонента() Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбщегоНазначения.ПроверкаЗаполненностиРеквизитов1(ВладелецСчета) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	РасчетныеПараметры = РасчетТарифов.РасчетСтоимостиУслуги(
							Дата,
							Справочники.ДоговорыКонтрагентов.НайтиПоКоду(Лев(СокрЛП(СчетДЕПО.Код),7)),
							Новый Структура("Операция, МестоХранения1, МестоХранения2",Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо,Неопределено,Неопределено));
	Если РасчетныеПараметры <> Неопределено Тогда
								
		Движение = Движения.УслугиДепозитария.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Инициатор = ВладелецСчета;
		Движение.Услуга = РасчетныеПараметры.Услуга;
		Движение.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118;
		Движение.Валюта = РасчетныеПараметры.Валюта;
		Движение.Сумма = РасчетныеПараметры.Сумма;
		Движение.СуммаВВалюте = Конвертации.КонвертацияВалюты(Дата, Движение.Сумма, РасчетныеПараметры.Валюта);
		Движение.СуммаНДС = РасчетТарифов.РТ_РасчетНДС(Движение.СтавкаНДС, Движение.Сумма);
		Движение.СуммаВсего = РасчетТарифов.РТ_ОбщаяСумма(Движение.СтавкаНДС,Движение.Сумма,Движение.СуммаНДС);
		Движение.Сумма = Движение.СуммаВсего - Движение.СуммаНДС;
		Движение.ТипТарифа = РасчетныеПараметры.ТипТарифа;
		Движение.Тариф = РасчетныеПараметры.Тариф;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если Проведен Тогда
		НовыйОбъект	= РазделСчетаДепо.ПолучитьОбъект();
		НовыйОбъект.ОперацияОткрытияСчета =	Ссылка;
		НовыйОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Помечаем на удаление счет депо и убираем ссылки на документ открытия
	Если ЗначениеЗаполнено(РазделСчетаДепо) Тогда
		СчетДепоОбъект 							= РазделСчетаДепо.ПолучитьОбъект();
		СчетДепоОбъект.ПометкаУдаления 			= Истина;
		СчетДепоОбъект.ОперацияОткрытияСчета	= Документы.ОткрытиеРазделаСчетаДепо.ПустаяСсылка();
		СчетДепоОбъект.ВходящийНомерПоручения	= Документы.Поручение.ПустаяСсылка();
		СчетДепоОбъект.Записать();
	КонецЕсли;
	// Убираем ссылки на счет депо
	Если ТипРазделаСчетаДепо = Перечисления.ТипыРазделовСчетовДЕПО.Основной Тогда
		Если ТипЗнч(СчетДепо) = Тип("СправочникСсылка.СчетаДепо") Тогда
			ИмяОсновногоРазделаСчетаДепо	= "ОсновнойРазделСчетаДепо";
			ИмяСправочника					= "РазделыСчетаДепо";
		Иначе
			ИмяОсновногоРазделаСчетаДепо	= "ОсновнойРазделСчета";
			ИмяСправочника					= "РазделыСчетаДепоМХ";
		КонецЕсли;
		
		Если СчетДепо[ИмяОсновногоРазделаСчетаДепо] = РазделСчетаДепо Тогда
			СчетДепоОбъект = СчетДепо.ПолучитьОбъект();
			СчетДепоОбъект[ИмяОсновногоРазделаСчетаДепо] = Справочники[ИмяСправочника].ПустаяСсылка();
			СчетДепоОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Если РучнойВвод Тогда
		Возврат;
	КонецЕсли;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	// Помечаем на удаление счет депо и убираем ссылки на документ открытия
	Если ЗначениеЗаполнено(РазделСчетаДепо) Тогда
		СчетДепоОбъект 							= РазделСчетаДепо.ПолучитьОбъект();
		СчетДепоОбъект.ПометкаУдаления 			= Истина;
		СчетДепоОбъект.ОперацияОткрытияСчета	= Документы.ОткрытиеРазделаСчетаДепо.ПустаяСсылка();
		СчетДепоОбъект.ВходящийНомерПоручения	= Документы.Поручение.ПустаяСсылка();
		СчетДепоОбъект.Записать();
	КонецЕсли;
	// Убираем ссылки на счет депо
	Если ТипРазделаСчетаДепо = Перечисления.ТипыРазделовСчетовДЕПО.Основной Тогда
		
		Если ТипЗнч(СчетДепо) = Тип("СправочникСсылка.СчетаДепоМХ") Тогда
			ТипСпр			= "РазделыСчетаДепоМХ";
			ИмяРеквизита	= "ОсновнойРазделСчета";
		Иначе
			ТипСпр			= "РазделыСчетаДепо";
			ИмяРеквизита	= "ОсновнойРазделСчетаДепо";
		КонецЕсли;
		
		Если СчетДепо[ИмяРеквизита] = РазделСчетаДепо Тогда
			СчетДепоОбъект = СчетДепо.ПолучитьОбъект();
			СчетДепоОбъект[ИмяРеквизита] = Справочники[ТипСпр].ПустаяСсылка();
			СчетДепоОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//процедуры печати

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	СтруктураПечатныхФорм = Новый Структура;
	Возврат СтруктураПечатныхФорм;
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#Если Клиент Тогда
	
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
КонецПроцедуры

#КонецЕсли

Функция СозданиеРазделаСчетаДепоДепонента()
	
	Если ТипЗнч(СчетДепо) = Тип("СправочникСсылка.СчетаДепоМХ") Тогда
		ТипСпр = "РазделыСчетаДепоМХ";
	Иначе
		ТипСпр = "РазделыСчетаДепо";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РазделСчетаДепо) Тогда
		НовыйОбъект	= РазделСчетаДепо.ПолучитьОбъект();
		Если НовыйОбъект.ПометкаУдаления Тогда
			НовыйОбъект.ПометкаУдаления = Ложь;
		КонецЕсли;
	Иначе
		НовыйОбъект = Справочники[ТипСпр].СоздатьЭлемент();
		НовыйОбъект.Код = Справочники.ПравилаФормированияКодовРазделовСчетовДепо.КодРаздела(ТипРазделаСчетаДЕПО, НаименованиеРазделаСчетаДепо, СчетДепо, Субклиент);
			
		СообщениеОбОшибке = Новый СообщениеПользователю;
		СообщениеОбОшибке.Текст = "Не удалось создать раздел счета депо" + ?(ТипСпр = "РазделыСчетаДепоМХ", " МХ.", ".");
		Если НЕ ЗначениеЗаполнено(НовыйОбъект.Код) Тогда
			СообщениеОбОшибке.Текст = СообщениеОбОшибке.Текст
			+ " Не найдено правило формирования кода для типа раздела " + ТипРазделаСчетаДЕПО;
			СообщениеОбОшибке.Сообщить();
			Возврат Ложь;
		КонецЕсли;		
		Если НайденКодРаздела(ТипСпр, НовыйОбъект.Код, СчетДепо) Тогда
			СообщениеОбОшибке.Текст = СообщениеОбОшибке.Текст
			+ " Уже существует раздел с кодом " + СокрЛП(НовыйОбъект.Код);
			СообщениеОбОшибке.Сообщить();
			Возврат Ложь;
		КонецЕсли;
		
		НовыйОбъект.Наименование = Справочники.РазделыСчетаДепо.НаименованиеРазделаСчетаДепоПоТипу(
			ТипРазделаСчетаДЕПО, Залогодержатель, Дата);
			
		Если ТипРазделаСчетаДЕПО = Перечисления.ТипыРазделовСчетовДЕПО.ОбеспеченияДержатель
			И ТипЗнч(НовыйОбъект) = Тип("СправочникОбъект.РазделыСчетаДепо") Тогда
			НовыйОбъект.Брокер = Брокер;
		КонецЕсли;
		Если ТипСпр = "РазделыСчетаДепо" Тогда
			НовыйОбъект.Залогодержатель = Залогодержатель;
		КонецЕсли;
		НовыйОбъект.Владелец = СчетДепо;
		НовыйОбъект.ТипРазделаСчетаДЕПО = ТипРазделаСчетаДЕПО;
	КонецЕсли;
	
	Если ТипЗнч(СчетДепо) = Тип("СправочникСсылка.СчетаДепо") Тогда
		НовыйОбъект.РазделСубклиента = РазделСубклиента;
		НовыйОбъект.Субклиент = Субклиент;
		
		ДатаНачалаСвязиРазделовСчетаДепоИМХ = Константы.ДатаНачалаОбменаНеторговымиОперациями.Получить();
		ПрименяетсяСвязьРазделовСчетаДепоИМХ = ЗначениеЗаполнено(ДатаНачалаСвязиРазделовСчетаДепоИМХ) И Дата >= ДатаНачалаСвязиРазделовСчетаДепоИМХ;
		Если ПрименяетсяСвязьРазделовСчетаДепоИМХ Тогда
			НовыйОбъект.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
		КонецЕсли;
	КонецЕсли;
	
	НовыйОбъект.ВходящийНомерПоручения = ДокументОснование;
	НовыйОбъект.ДатаОткрытияСчета = Дата;  	
	НовыйОбъект.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.Открыт;
	НовыйОбъект.ПроверитьЗаполнение();
	НовыйОбъект.Записать();
	
	Если Не ЗначениеЗаполнено(РазделСчетаДепо) Тогда
		РазделСчетаДепо = НовыйОбъект.Ссылка;
	КонецЕсли;
	
	СчетДепоОбъект = СчетДепо.ПолучитьОбъект();
	Если ТипРазделаСчетаДЕПО = Перечисления.ТипыРазделовСчетовДЕПО.Основной И Не РазделСубклиента Тогда
		
		Если ТипЗнч(СчетДепо) = Тип("СправочникСсылка.СчетаДепоМХ") Тогда
			СчетДепоОбъект.ОсновнойРазделСчета = НовыйОбъект.Ссылка;
		Иначе
			СчетДепоОбъект.ОсновнойРазделСчетаДепо = НовыйОбъект.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	СчетДепоОбъект.Записать();
	Возврат Истина;
КонецФункции // СозданиеСчетаДепоДепонента()

Функция НайденКодРаздела(ТипСпр, НовыйКод, СчетДепо)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СправочникРазделы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РазделыСчетаДепоМХ КАК СправочникРазделы
	|ГДЕ
	|	СправочникРазделы.Код = &Код
	|	И СправочникРазделы.Владелец = &СчетДепо
	|ДЛЯ ИЗМЕНЕНИЯ
	|	Справочник.РазделыСчетаДепоМХ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "РазделыСчетаДепоМХ", ТипСпр);
	Запрос.УстановитьПараметр("Код", НовыйКод);
	Запрос.УстановитьПараметр("СчетДепо", СчетДепо);
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ТипЗнч(СчетДепо) = Тип("СправочникСсылка.СчетаДепо")
		И Перечисления.ТипыСчетовДепо.НоминальныхДержателей().Найти(СчетДепо.ТипСчетаДепо) <> Неопределено Тогда
		Если РазделСубклиента Тогда
			ПроверяемыеРеквизиты.Добавить("Субклиент");
		ИначеЕсли ЗначениеЗаполнено(Субклиент) И Не РазделСубклиента Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не установлен флаг ""Раздел субклиента"" при заполненном поле ""Субклиент""");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

