//////////////////////////////////////////////////////////////////////////////// 
// ПЕРЕМЕННЫЕ МОДУЛЯ 

Перем МХ_Константа;
Перем ВалютаРегламентированногоУчета;

//////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		ТипПеревода = Перечисления.ТипыПереводов.Списание;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off

Процедура ОбработкаПроведения(Отказ, Режим)
	
	КонтрольНаВидПорученияИОперации();
	
	ЕстьДопСвойствоОперацияЦБ = ДополнительныеСвойства.Свойство("ОперацияЦБ");
	
	// Проверка "Конвертации" - документы с незаполненными ТЧ конвертаций в зависимости от типа не проводим и ругаемся!
	Если ВидОперацииД = Справочники.ВидыОпераций.Конвертация Тогда
		Если (ТипКонвертации = Перечисления.ТипыКонвертаций.Аннулирование) И (ЦенныеБумагиСписываемые.Количество()=0 ИЛИ Списание.Количество()=0) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не верное указано количество списания по операции 'Конвертация - Аннулирование' - проверьте данные табличных частей!", Отказ);
			Возврат;
		ИначеЕсли (ЦенныеБумагиСписываемые.Количество()=0 ИЛИ ЦенныеБумагиЗачисляемые.Количество()=0 ИЛИ Списание.Количество()=0 ИЛИ Зачисление.Количество()=0) И Не (ТипКонвертации = Перечисления.ТипыКонвертаций.Аннулирование) Тогда 
			ОбщегоНазначения.СообщитьОбОшибке("Не верное указано количество по операции 'Конвертация' - проверьте данные табличных частей!", Отказ);
			Возврат;
		КонецЕсли;
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.УчастиеВКД Тогда
		Если НеПроверятьНаличиеКарточкиКД Тогда
			НеобходимыеРеквизиты = "";
		Иначе
			НеобходимыеРеквизиты = "КарточкаКД";
		КонецЕсли;
		РеквизитыШапки = Новый Структура(НеобходимыеРеквизиты);
		Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
		ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, РеквизитыШапки, Отказ, Заголовок);
	ИначеЕсли ЗначениеЗаполнено(ПаиТипЗаявки) Тогда
		ТекстОшибкиЗаполнения = "";
		Если Не ПройденКонтрольЗаполненияПаи(ПаиТипЗаявки, ТекстОшибкиЗаполнения) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибкиЗаполнения, Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ВидОперацииД = Справочники.ВидыОпераций.ЗакрытиеРазделаСчетаДепо
		И ТипЗнч(Депонент) = Тип("СправочникСсылка.Контрагенты") Тогда
		// Проверить возможность закрытия раздела счета
		
		// Если ручное проведение пользователем - дополнительно проверить остатки ЦБ
		Если Не ДополнительныеСвойства.Свойство("ЭтоЗакрытиеСчетаДепо") Тогда
			
			ДанныеПоОстаткам = ОстаткиЦБПоРазделамСчетовДепоДокумента();
			Если ДанныеПоОстаткам.ЕстьОстаткиЦБ Тогда 
				
				Для Каждого СтруктОстатки Из ДанныеПоОстаткам.МассивОстатки Цикл 
					Сообщить(	"По закрываемому разделу счета есть не нулевые остатки:
								| - Счет ДЕПО МХ: "+СтруктОстатки.СчетДепоМХ+";
								| - Раздел счета ДЕПО МХ: "+СтруктОстатки.РазделСчетаДепоМХ+";
								| - Счет ДЕПО: "+СтруктОстатки.СчетДепо+";
								| - Раздел счета ДЕПО: "+СтруктОстатки.РазделСчетаДепо+";
								| - Ценная бумага: "+СтруктОстатки.ЦБ+";
								| - Остаток: "+СтруктОстатки.КоличествоОстаток+".");
				КонецЦикла;
				
				Отказ	= Истина;
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЕстьНеисполненныеПорученияПоПассивномуРазделу()Тогда
			Отказ	= Истина;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	НеобходимРасчетНалога = Документы.НачисленныйНалог.РасчетНалогаРазрешен(ВидОперацииД);
	Если НеобходимРасчетНалога Тогда
		СоздатьНачислениеНалога();
	КонецЕсли;
	
	Если Документы.Поручение.ЭтоИнвентарноеПоручениеСИсполнениемВРежимеЧастичногоИсполнения(Ссылка) Тогда
		
		ПереформироватьОперацииЦБ(Отказ);
	
	ИначеЕсли ЗначениеЗаполнено(ДатаИсполненияПоручения) Тогда
	
		Если Документы.Поручение.ОперацияБлокирована(ЭтотОбъект) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Инициатор блокирован, внешние операции с ЦБ запрещены!", Отказ);
			Возврат;
		КонецЕсли;				
				
		Если ТипЗнч(ВидОперацииД) = Тип("СправочникСсылка.ВидыОпераций") Тогда
			Если ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеСчетаДепо Тогда
				СоздатьОбновитьДокумент("ОткрытиеСчетаДепо", Отказ);
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо
						И (ТипЗнч(Депонент) = Тип("СправочникСсылка.Контрагенты")
						Или ТипЗнч(Депонент) = Тип("СправочникСсылка.МестаХранения")) Тогда
				СоздатьОбновитьДокумент("ОткрытиеРазделаСчетаДепо", Отказ);
				
				Если ОткрытьВМХ И ТипЗнч(Депонент) = Тип("СправочникСсылка.МестаХранения") Тогда
					ДокОткрытиеРазделаСчетаДепо = ДокументОснование.ПолучитьОбъект();
					ДокОткрытиеРазделаСчетаДепо.ДатаИсполненияПоручения = ДатаИсполненияПоручения;
					ДокОткрытиеРазделаСчетаДепо.РазделСчетаДепоМХ = РазделСчетаДепоМХПоДокументуОснованию(ДокОткрытиеРазделаСчетаДепо);
					Если Не ЗначениеЗаполнено(ДокОткрытиеРазделаСчетаДепо.РазделСчетаДепоМХ) Тогда
						Комментарий = "Не удалось получить Раздел счета депо МХ '" + ДокОткрытиеРазделаСчетаДепо.НомерРазделаСчетаДепоМХ + "'.";
						ЗаписьЖурналаРегистрации("Получение раздела счета депо МХ", УровеньЖурналаРегистрации.Ошибка, 
						Метаданные.Документы.Поручение, Ссылка, Комментарий);
						ОбщегоНазначения.СообщитьОбОшибке(Комментарий, Отказ);
						Возврат;
					КонецЕсли;
					
					Попытка
						ДокОткрытиеРазделаСчетаДепо.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						ЗаписьЖурналаРегистрации("Проведение Открытия раздела счета депо", УровеньЖурналаРегистрации.Ошибка,,,
												"Не удалось провести поручение на открытие счета депо");
						ИнформацияОбОшибке = ИнформацияОбОшибке();
						ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
						ВызватьИсключение ОписаниеОшибки;
					КонецПопытки;
				КонецЕсли;
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ЗакрытиеРазделаСчетаДепо
						И (ТипЗнч(Депонент) = Тип("СправочникСсылка.Контрагенты")
						Или ТипЗнч(Депонент) = Тип("СправочникСсылка.МестаХранения")) Тогда
				СоздатьОбновитьДокумент("ЗакрытиеРазделаСчетаДепо", Отказ);
				
				Если ЗакрытьВМХ И ТипЗнч(Депонент) = Тип("СправочникСсылка.МестаХранения") Тогда
					// Если это поручение на закрытие активного раздела
					ДокЗакрытиеРазделаСчетаДепо = ДокументОснование.ПолучитьОбъект();
					ДокЗакрытиеРазделаСчетаДепо.ДатаИсполненияПоручения = ДатаИсполненияПоручения;
					ДокЗакрытиеРазделаСчетаДепо.КодОтчетаНРД = КодОтчетаНРД;
					
					Попытка
						ДокЗакрытиеРазделаСчетаДепо.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						ЗаписьЖурналаРегистрации("Проведение Закрытия раздела счета депо", УровеньЖурналаРегистрации.Ошибка,,,
												"Не удалось провести поручение на закрытие раздела счета депо");
						ИнформацияОбОшибке = ИнформацияОбОшибке();
						ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
						ВызватьИсключение ОписаниеОшибки;
					КонецПопытки;
				КонецЕсли;
				
				Если ТипЗнч(Депонент) = Тип("СправочникСсылка.Контрагенты") Тогда
					// Если это поручение на закрытие пассивного раздела, то проверяем, что это последний открытый пассивный раздел
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	КОЛИЧЕСТВО(*) КАК КоличествоНезакрытыхРазделов
						|ПОМЕСТИТЬ ВТНезакрытыеРазделы
						|ИЗ
						|	Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
						|ГДЕ
						|	РазделыСчетаДепо.Владелец = &СчетДепо
						|	И РазделыСчетаДепо.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Открыт)
						|	И РазделыСчетаДепо.Ссылка <> &РазделСчетаДепо
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	Поручение.Ссылка КАК Ссылка
						|ПОМЕСТИТЬ ВТПоручения
						|ИЗ
						|	Документ.Поручение КАК Поручение
						|ГДЕ
						|	Поручение.СчетДепо = &СчетДепо
						|	И Поручение.ВидОперацииД = &ВидОперацииД
						|	И Поручение.Проведен
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ ПЕРВЫЕ 1
						|	ВТПоручения.Ссылка КАК Ссылка
						|ИЗ
						|	ВТПоручения КАК ВТПоручения
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПоручений.СрезПоследних(
						|				&Период,
						|				Поручение В
						|					(ВЫБРАТЬ
						|						ВТПоручения.Ссылка КАК Ссылка
						|					ИЗ
						|						ВТПоручения КАК ВТПоручения)) КАК СтатусыПорученийСрезПоследних
						|		ПО ВТПоручения.Ссылка = СтатусыПорученийСрезПоследних.Поручение
						|			И (СтатусыПорученийСрезПоследних.СтатусПоручения ЕСТЬ NULL
						|				ИЛИ СтатусыПорученийСрезПоследних.СтатусПоручения <> ЗНАЧЕНИЕ(Перечисление.СтатусыПоручений.Исполнено))
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНезакрытыеРазделы КАК ВТНезакрытыеРазделы
						|		ПО (ВТНезакрытыеРазделы.КоличествоНезакрытыхРазделов = 0)
						|
						|УПОРЯДОЧИТЬ ПО
						|	Ссылка УБЫВ
						|АВТОУПОРЯДОЧИВАНИЕ";
					
					Запрос.УстановитьПараметр("ВидОперацииД", Справочники.ВидыОпераций.ЗакрытиеСчетаДепо);
					Запрос.УстановитьПараметр("СчетДепо", СчетДепо);
					Запрос.УстановитьПараметр("Период", Дата);
					Запрос.УстановитьПараметр("РазделСчетаДепо", РазделСчетаДепо);
					
					Выборка = Запрос.Выполнить().Выбрать();
					
					Если Выборка.Следующий() Тогда
						
						ДокЗакрытиеСчетаДепо = Выборка.Ссылка.ПолучитьОбъект();
						ДокЗакрытиеСчетаДепо.ДатаИсполненияПоручения = ТекущаяДата();
						
						Попытка
							ДокЗакрытиеСчетаДепо.Записать(РежимЗаписиДокумента.Проведение);
						Исключение
							ЗаписьЖурналаРегистрации("Проведение Закрытия раздела счета депо", УровеньЖурналаРегистрации.Ошибка,,,
													"Не удалось провести поручение на закрытие раздела счета депо");
							ИнформацияОбОшибке = ИнформацияОбОшибке();
							ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
							ВызватьИсключение ОписаниеОшибки;
						КонецПопытки;
						
					КонецЕсли; 					
					
				КонецЕсли;
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ЗакрытиеСчетаДепо Тогда
				СоздатьОбновитьДокумент("ЗакрытиеСчетаДепо", Отказ);
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ОтменаПоручения Тогда
				СоздатьОбновитьДокумент("ОтменаПоручения", Отказ);
				СоздатьДокументРазблокировкиЦБ(Отказ);
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ОтменаОператораСчетаДепо Тогда
				СоздатьОбновитьДокумент("ОтменаПредставителяСчетаДепо", Отказ);
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.НазначениеОператораСчетаДепо Тогда
				СоздатьОбновитьДокумент("НазначениеПредставителяСчетаДепо", Отказ);
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Перевод Тогда
				// Документ ОперацияЦБ создается вводом на основании
			ИначеЕсли ВидОперацииД.КлассОпераций = Перечисления.КлассыОпераций.Инвентарные
					Или ВидОперацииД.КлассОпераций = Перечисления.КлассыОпераций.Комплексные Тогда
				// BSLLS:EmptyCodeBlock-off
				Если Документы.Поручение.ЭтоМультиПоручениеП35_2(Ссылка) Тогда
					// Документ ОперацияЦБ создается при загрузке входящего пакета MS035
				ИначеЕсли Документы.Поручение.ЭтоНеторговоеПоручениеСоСпискомЦБ(ЭтотОбъект) Тогда
					Документы.Поручение.СоздатьОбновитьОперацииЦБ(Ссылка, РежимЗаписиДокумента.Проведение, , , КодОтчетаНРД);
				Иначе
					СоздатьОбновитьДокумент("ОперацииЦБ", Отказ);
				КонецЕсли;
				// BSLLS:EmptyCodeBlock-on
			ИначеЕсли ЗначениеЗаполнено(Константы.ДатаНачалаФормированияГО.Получить())
					  И НачалоДня(Дата) >= НачалоДня(Константы.ДатаНачалаФормированияГО.Получить())
					  И (ВидОперацииД = Справочники.ВидыОпераций.НачислениеДоходаПрочие
						ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ВыкупСписаниеЦБ
						ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ПогашениеНКД
						ИЛИ ВидОперацииД = Справочники.ВидыОпераций.Погашение
						ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ПогашениеЦБЧастичное
						ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ПогашениеЦБПолное
						ИЛИ ВидОперацииД = Справочники.ВидыОпераций.СписаниеАкцийПриЛиквидацииЭмитента
						ИЛИ ВидОперацииД = Справочники.ВидыОпераций.СписаниеОбесценившихсяЦенныхБумаг
						ИЛИ ВидОперацииД = Справочники.ВидыОпераций.НачислениеДивидендов
						ИЛИ ВидОперацииД = Справочники.ВидыОпераций.НачислениеДоходаПрочие
						ИЛИ ВидОперацииД = Справочники.ВидыОпераций.Конвертация
						ИЛИ ВидОперацииД = Справочники.ВидыОпераций.НачислениеДоходовЦБ
						ИЛИ ВидОперацииД = Справочники.ВидыОпераций.Выкуп) Тогда
				Если Документы.НачисленныйНалог.ИспользоватьРасчетНДФЛПоПрогрессивнойШкале(Дата)
					И ВидОперацииД.ВыплатаДоходаВДенежнойФорме Тогда
					// Для этого кейса глобальные операции и выписки формируются в документе ПлатежнаяОперация
				Иначе
					Документы.Поручение.СоздатьОбновитьДокументыГО(Ссылка, Отказ, ОбщегоНазначения.ДатаДокумента(Ссылка));
				КонецЕсли;
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Конвертация Тогда
				СоздатьОбновитьДокумент("КонвертацияЦБ", Отказ);
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ПогашениеНКД Тогда 
				СоздатьОбновитьДокумент("ПогашениеНКД", Отказ);
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Погашение
					  ИЛИ ВидОперацииД = Справочники.ВидыОпераций.СписаниеАкцийПриЛиквидацииЭмитента
					  ИЛИ ВидОперацииД = Справочники.ВидыОпераций.СписаниеОбесценившихсяЦенныхБумаг
					  ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ВыкупСписаниеЦБ Тогда 
				СоздатьОбновитьДокумент("ПогашениеЦБ", Отказ);
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ПогашениеЦБЧастичное Тогда 	
				СоздатьОбновитьДокумент("ПогашениеЦБЧастичное", Отказ);
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ПогашениеЦБПолное
					  ИЛИ ВидОперацииД = Справочники.ВидыОпераций.Выкуп  Тогда 		
				СоздатьОбновитьДокумент("ПогашениеЦБПолное", Отказ);
			// {{ Новый функционал по задаче ACC-1922
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ПриемЦБНаОбслуживание
					  ИЛИ ВидОперацииД = Справочники.ВидыОпераций.СнятиеЦБсОбслуживания Тогда 
				СоздатьОбновитьДокумент("ЦенныеБумагиОбслуживание", Отказ);
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.УчастиеВКД Тогда 
				СоздатьОбновитьДокумент("УчастиеВКД", Отказ);
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ВидОперацииИзменениеАнкетныхДанных() Тогда
				НачалоФормированияЦепочки = Константы.ДатаНачалаФормированияЦепочкиОперацийПоПоручениям.Получить();
				Если Дата >= НачалоФормированияЦепочки И ЗначениеЗаполнено(НачалоФормированияЦепочки) Тогда
					СоздатьОбновитьДокумент("ИзменениеАнкетныхДанных", Отказ);
				КонецЕсли;
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ИзменениеКатегорииСчетовДепонента И ЗначениеЗаполнено(ДатаИсполненияПоручения) Тогда
				УчетНаСчетахТипаЦ = РегистрыСведений.КлиентыСУчетомНаСчетахТипаC.ЦБКлиентаУчитываютсяНаСчетеТипаС(ДатаИсполненияПоручения, Депонент);
				Если УчетНаСчетахТипаЦ = ИмеетСчетаТипаC Тогда
					ТекстОшибки = "Этот депонент по данным учета " + ?(ИмеетСчетаТипаC, "уже имеет счета", "и так не имеет счетов")
									+ " типа С на дату " + Формат(ДатаИсполненияПоручения, "ДФ=дд.ММ.гггг""");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , Отказ);
					Возврат;
				Иначе
					СоздатьОбновитьДокумент("ИзменениеКатегорииСчетовДепонента", Отказ);
				КонецЕсли;
			КонецЕсли;
			Если СнятьЦеннуюБумагуСОбслуживания Тогда
				СнятьЦенныеБумагиСОбслуживания(Отказ);
			КонецЕсли;
		ИначеЕсли ТипЗнч(ВидОперацииД) = Тип("ПеречислениеСсылка.ВидыОтчетов") 
					И Не Документы.Поручение.ЭтоПериодическиеВыпискиОСостоянииСчетаДЕПО(ЭтотОбъект) Тогда
			Если ЗначениеЗаполнено(Константы.ДатаНачалаФормированияОперацийПоПоручениямНаОтчет.Получить())
				И НачалоДня(Дата) >= НачалоДня(Константы.ДатаНачалаФормированияОперацийПоПоручениямНаОтчет.Получить()) Тогда
				СоздатьОбновитьДокумент("ФормированиеОтчетаВыписки", Отказ);
			Иначе
				СоздатьОбновитьДокумент("Выписка", Отказ);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Не ЕстьДопСвойствоОперацияЦБ И Не ЭтоВыплатаДоходаПоПрогрессивнойШкалеНДФЛ() Тогда
			УдалятьПодчиненныеПоручения = Ложь;
			Если Не Документы.Поручение.ЭтоПериодическиеВыпискиОСостоянииСчетаДЕПО(ЭтотОбъект) Тогда
				Документы.Поручение.УдалитьДокументыНаОснованииПоручения(Ссылка, УдалятьПодчиненныеПоручения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Проведен И ОткрытьВМХ 
		И ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо
		И ТипЗнч(Депонент) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		СформироватьПоручениеНаОткрытиеРазделаСчетаМХ(Отказ);
	КонецЕсли;
	
	Если Проведен И ЗакрытьВМХ 
		И ВидОперацииД = Справочники.ВидыОпераций.ЗакрытиеРазделаСчетаДепо
		И ТипЗнч(Депонент) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		СформироватьПоручениеНаЗакрытиеРазделаСчетаМХ(Отказ);
	КонецЕсли;
	
	Если Проведен И ВидОперацииД = Справочники.ВидыОпераций.ЗакрытиеСчетаДепо Тогда
		СформироватьПорученияНаЗакрытиеРазделовСчета(Отказ);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НеобходимоФормироватьУведомлениеОИсполненииОперацийСЦБ") Тогда
		Если ДополнительныеСвойства.НеобходимоФормироватьУведомлениеОИсполненииОперацийСЦБ Тогда
			ДобавитьЗаписьВРССостоянияУведомленийОбОперацияхСЦБ();
		КонецЕсли;
	КонецЕсли;
	
	Если ВидОперацииД = Справочники.ВидыОпераций.Перевод И ЗначениеЗаполнено(ДатаИсполненияПоручения)
		И Не ЕстьДопСвойствоОперацияЦБ Тогда
		
		ВстречноеПоручение = Документы.Поручение.ВстречноеПоручениеПеревод(Ссылка);
		Если Не ЗначениеЗаполнено(ВстречноеПоручение) Тогда 
			ОбщегоНазначения.СообщитьОбОшибке("Не найдено или не проведено встречное поручение для " + Ссылка, Отказ);
			Возврат;
		КонецЕсли;
		
		ОперацияЦБСсылка = СвязаннаяОперацияЦБ();
		Если ОперацияЦБСсылка.Проведен Тогда 
			ОбщегоНазначения.СообщитьОбОшибке("Для данного поручения уже проведена операция с ценными бумагами " + ОперацияЦБСсылка + " отмените ее проведение перед изменением этого поручения.", Отказ);
			Возврат;
		КонецЕсли;
		
		ОперацияЦБ = ОперацияЦБСсылка.ПолучитьОбъект();
		Если ОперацияЦБ <> Неопределено Или КодОтчетаНРД <> "" Тогда
			ВстречноеПоручениеОбъект = ВстречноеПоручение.ПолучитьОбъект();
			ВстречноеПоручениеОбъект.ДополнительныеСвойства.Вставить("ОперацияЦБ",ОперацияЦБСсылка);
			ВстречноеПоручениеОбъект.КодОтчетаНРД = КодОтчетаНРД;
			ВстречноеПоручениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		Если ОперацияЦБ = Неопределено Тогда 
			ОперацияЦБ = Документы.ОперацииЦБ.СоздатьДокумент();
			ОперацияЦБ.УстановитьСсылкуНового(ОперацияЦБСсылка);
		КонецЕсли;
		
		Если Инициатор = Депонент ИЛИ ТипПеревода = Перечисления.ТипыПереводов.Списание Тогда
			ОперацияЦБ.ЗаполнитьОперациюНаОснованииПорученияИСвязатьПоручения(Ссылка);
		Иначе 
			ОперацияЦБ.ЗаполнитьОперациюНаОснованииПорученияИСвязатьПоручения(ВстречноеПоручение);
		КонецЕсли;
		
		НеобходимоНачислятьКомиссиюСтароеЗначение = РегистрыСведений.ДокументыКНачислениюКомиссииДепо.НеобходимоНачислитьКомиссию(Ссылка);
		ПровестиОперациюЦБ = (СчетДепоМХ = СчетДепоМХКонтрагента И РазделСчетаДепоМХ = РазделСчетаДепоМХКонтрагента)
			ИЛИ (ДатаИсполненияПоручения <> Дата(1, 1, 1)
				И ДатаИсполненияПорученияВДепозитарииМХ <> Дата(1, 1, 1)
				И ДатаИсполненияПорученияВМестеРасчетов <> Дата(1, 1, 1));
		Если ДополнительныеСвойства.Свойство("ПереводЦБПоМежклиентскойСделкеПоДаннымКафка") Тогда
			ОперацияЦБ.Дата = КонецДня(ТекущаяДатаСеанса());
			ОперацияЦБ.ДатаИсполненияВДепозитарииМХ = ОперацияЦБ.Дата;
			ОперацияЦБ.ДатаИсполненияВМестеРасчетов = ОперацияЦБ.Дата;
			ОперацияЦБ.Записать(РежимЗаписиДокумента.Запись);
		ИначеЕсли ПровестиОперациюЦБ Тогда
			ОперацияЦБ.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОперацияЦБ.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		ДополнительныеСвойства.Вставить("ОперацияЦБ", ОперацияЦБ.Ссылка);
		НеобходимоНачислятьКомиссиюНовоеЗначение = РегистрыСведений.ДокументыКНачислениюКомиссииДепо.НеобходимоНачислитьКомиссию(Ссылка);
		Если НеобходимоНачислятьКомиссиюНовоеЗначение <> НеобходимоНачислятьКомиссиюСтароеЗначение Тогда
			ДополнительныеСвойства.Вставить("ФлагНачислитьКомиссиюДепоИзмененАвтоматически", Истина);
		КонецЕсли;
		
	КонецЕсли;

	СформироватьДвижениеПоСтатусуПоручения(Отказ);
	
	ОтключитьЗаполнениеПризнакаНачислитьКомиссию = ДополнительныеСвойства.Свойство("ВведеноИнтерактивно")
		И ДополнительныеСвойства.ВведеноИнтерактивно = Истина;
	
	Если Не ОтключитьЗаполнениеПризнакаНачислитьКомиссию
		И НеобходимоИзменитьПризнакНачислитьКомиссиюДепоПриИсполнении() Тогда
		НачислитьКомиссиюДепо = ЗначениеЗаполнено(ДатаИсполненияПоручения);
		РегистрыСведений.ДокументыКНачислениюКомиссииДепо.УстановитьЗначение(Ссылка, НачислитьКомиссиюДепо);
	КонецЕсли;
	
	СформироватьДвиженияПоРегиструДенежныхСредств();
	
	ОбменДаннымиКафка.ЗаписатьОбъектВИсходящиеСообщенияКафкаПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on

Процедура СнятьЦенныеБумагиСОбслуживания(Отказ)
	Перем ЦеннаяБумага, МассивЦБ;
	
	МассивЦБ = Новый Массив;
	Если ВидОперацииД = Справочники.ВидыОпераций.Конвертация Тогда
		ТаблицаЦБ = Списание.Выгрузить(, "ЦеннаяБумага");
		ТаблицаЦБ.Свернуть("ЦеннаяБумага");
		МассивЦБ = ТаблицаЦБ.ВыгрузитьКолонку("ЦеннаяБумага");
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Погашение
				ИЛИ ВидОперацииД = Справочники.ВидыОпераций.СписаниеАкцийПриЛиквидацииЭмитента
				ИЛИ ВидОперацииД = Справочники.ВидыОпераций.СписаниеОбесценившихсяЦенныхБумаг
				ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ВыкупСписаниеЦБ Тогда
		МассивЦБ.Добавить(ЦБ);
	КонецЕсли;
	Для Каждого ЦеннаяБумага Из МассивЦБ Цикл
		СоздатьОбновитьДокументСнятияЦБСОбслуживания(ЦеннаяБумага, Отказ);
	КонецЦикла;
КонецПроцедуры

Процедура СоздатьОбновитьДокументСнятияЦБСОбслуживания(ЦеннаяБумага, Отказ)
	Перем Параметры, Документ;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидОперацииД",		Справочники.ВидыОпераций.СнятиеЦБсОбслуживания);
	Запрос.УстановитьПараметр("ДокументОснование",	Ссылка);
	Запрос.УстановитьПараметр("ЦеннаяБумага",		ЦеннаяБумага);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦенныеБумагиОбслуживание.Ссылка КАК ДокументОбслуживания
	|ИЗ
	|	Документ.ЦенныеБумагиОбслуживание КАК ЦенныеБумагиОбслуживание
	|ГДЕ
	|	ЦенныеБумагиОбслуживание.ВидОперацииД = &ВидОперацииД
	|	И ЦенныеБумагиОбслуживание.ДокументОснование = &ДокументОснование
	|	И ЦенныеБумагиОбслуживание.ЦБ = &ЦеннаяБумага
	|
	|ДЛЯ ИЗМЕНЕНИЯ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Документ = Выборка.ДокументОбслуживания.ПолучитьОбъект();
	Иначе
		Документ = Документы.ЦенныеБумагиОбслуживание.СоздатьДокумент();
	КонецЕсли;
	
	Если Документ.ПометкаУдаления Тогда
		Документ.ПометкаУдаления = Ложь;
		Документ.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;	
	
	// Структура для заполнения документа снятия с обслуживания
	Параметры = Новый Структура;
	Параметры.Вставить("ВидОперацииД", Справочники.ВидыОпераций.СнятиеЦБсОбслуживания);
	Параметры.Вставить("ДатаИсполненияПоручения", ДатаИсполненияПоручения);
	Параметры.Вставить("Дата", Дата);
	Параметры.Вставить("Ссылка", Ссылка);
	Параметры.Вставить("ВходящийНомерПоручения", ВходящийНомерПоручения);
	Параметры.Вставить("Инициатор", Инициатор);
	Параметры.Вставить("ЦБ", ЦеннаяБумага);
	
	Документ.Заполнить(Параметры);
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
	КонецПопытки;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка = Истина Тогда
		Если ДополнительныеСвойства.Свойство("Перенумерация") И ДополнительныеСвойства.Перенумерация Тогда // BSLLS:Typo-off
			ЗаполнитьОчиститьУИН();
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	СтатусПоручения = РегистрыСведений.СтатусыПоручений.СтатусПоручения(Ссылка);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Ссылка.Проведен И Ссылка.ВидОперацииД <> ВидОперацииД Тогда
		ТекстСообщения = "Нельзя изменять вид операции проведенного поручения, т.к. на основании данного поручения созданы документы!";
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
	КонецЕсли;

	ЭтоПерепроведениеИсполненногоПорученияПоДвижениюЦБ = (РежимЗаписи = РежимЗаписиДокумента.Проведение И Ссылка.Проведен
															И СтатусПоручения = Перечисления.СтатусыПоручений.Исполнено
															И Документы.Поручение.ЭтоПоручениеПоДвижениюЦБ(ВидОперацииД));
	Если ЭтоПерепроведениеИсполненногоПорученияПоДвижениюЦБ Тогда
		ТекстСообщения = "Повторное проведение " + Ссылка + " в статусе Исполнено запрещено, обратитесь в команду Поддержки!";
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Ссылка.Проведен И Ссылка.ВидОперацииД <> ВидОперацииД Тогда
		ТекстСообщения = "Нельзя изменять вид операции проведенного поручения, т.к. на основании данного поручения созданы документы!";
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
	КонецЕсли;
		
	// Продублируем единственную ЦБ в шапке для поддержания работоспособности неттинга и отбора в списке
	Если Документы.Поручение.ЭтоНеторговоеПоручениеСоСпискомЦБ(ЭтотОбъект) Тогда
		Если ЦенныеБумагиСписываемые.Количество() = 1 Тогда
			ЦБ = ЦенныеБумагиСписываемые[0].ЦеннаяБумага;
			КоличествоЦБ = ЦенныеБумагиСписываемые[0].Количество;
			ЦенаСделкиЦБ = ЦенныеБумагиСписываемые[0].Цена;
			СуммаСделки = ЦенныеБумагиСписываемые[0].Сумма;
		Иначе
			ЦБ = Неопределено;
			КоличествоЦБ = 0;
			ЦенаСделкиЦБ = 0;
			СуммаСделки = 0;
			Если ЕстьСтрокиСПовторяющейсяЦБ() Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьНачислениеНалога();
	Если Не ЗначениеЗаполнено(ПричинаОтмены) И ВидОперацииД = Справочники.ВидыОпераций.ОтменаПоручения Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана причина отмены для поручения на отмену!!!", Отказ);
		Возврат;
	КонецЕсли;	
	
	Если ВидОперацииД = Справочники.ВидыОпераций.Конвертация И Не ЗначениеЗаполнено(ТипКонвертации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан 'Тип конвертации' по поручению на конвертацию!!!", Отказ);
		Возврат;
	КонецЕсли;	
	
	Если ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеСчетаДепо И Не ЗначениеЗаполнено(ВидСчетаДепо) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан 'Вид счета ДЕПО' для поручения на Открытие счета ДЕПО!!!", Отказ);
		Возврат;
	КонецЕсли;
	
	Если ВидОперацииД = Перечисления.ВидыОтчетов.ВыпискаОСостоянииСчетаДЕПО
		Или ВидОперацииД = Перечисления.ВидыОтчетов.ОтчетОбОперацияхПоСчетуДЕПО
		Или ВидОперацииД = Перечисления.ВидыОтчетов.СводныйОтчетОСовершеннойОперации Тогда
		
		Если Справочники.Контрагенты.ОсобыеУсловия(Инициатор) Тогда
			Если НЕ РегистрыСведений.ОтветственныеЛицаОрганизаций.ПользовательМожетРедактироватьОсобыеУсловия() Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Особые условия: " + Инициатор 
				+ ". Выполнение операции доступно Ответственному за особых клиентов", Отказ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Документы.Поручение.ЭтоПериодическиеВыпискиОСостоянииСчетаДЕПО(ЭтотОбъект) Тогда
		Если Не ЗначениеЗаполнено(ДатаНачПериода) Тогда
			ТекстСообщения = "Не указано начиная с какой даты нужно присылать выписку!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если Не ОбщегоНазначения.РабочийДень(ДатаНачПериода) Тогда
			ТекстСообщения = "Дата, начиная с которой нужно присылать выписку не является рабочим днем!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СчетДепо) Тогда
			ТекстСообщения = "Не указан счет ДЕПО по которому необходимо предоставлять выписку!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ВладелецСчета = СчетДепо.Владелец;
		КлассификаторНРД = Справочники.КлассификаторыЗагрузки.НДЦ();
		ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
		КодНРДВладельцаСчета = Справочники.КодыЗагрузки.НайтиПоВладельцуИБирже(ВладелецСчета, КлассификаторНРД, ТекущаяДата);
		Если Не ЗначениеЗаполнено(КодНРДВладельцаСчета) Тогда
			ТекстСообщения = "Для владельца счета (" + Строка(ВладелецСчета) + ") не задан актуальный код НРД!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
	Если ЭтоНовый() Тогда
		Если Не ЗначениеЗаполнено(Автор) Тогда
			Автор	= ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		Изменил	= Справочники.Пользователи.ПустаяСсылка();
	Иначе
		Изменил	= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если Отказ Тогда
		Сообщить("Этот документ не является последним. Запись запрещена",СтатусСообщения.ОченьВажное);
	Иначе
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение
			 И ВходящийНомерПоручения <> Номер
			 И НЕ ЗначениеЗаполнено(ВходящийНомерПоручения) Тогда
			ВходящийНомерПоручения = Номер;
		КонецЕсли;
	КонецЕсли;
	
	// Обновим комментарий если надо
	Если Не ЗначениеЗаполнено(Комментарий)
		 И ( ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеСчетаДепо
		 	 ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо
			 ИЛИ ВидОперацииД = Справочники.ВидыОпераций.НазначениеОператораСчетаДепо ) Тогда
		ПараметрыДоговора = ПолучитьПараметрыДоговораПоПоручению();
		Если ПараметрыДоговора.Количество()>0 Тогда
			Если ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеСчетаДепо
				 ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо Тогда
				Комментарий	= "Депозитарный договор №"+ПараметрыДоговора[0].Код+" от "
					+Формат(ПараметрыДоговора[0].ДатаНачалоДействия, "ДФ=dd.MM.yyyy");
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.НазначениеОператораСчетаДепо Тогда
				Комментарий	= "Договор обслуживания на финансовых рынках №"+ПараметрыДоговора[0].Код
					+" от "+Формат(ПараметрыДоговора[0].ДатаНачалоДействия, "ДФ=dd.MM.yyyy");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Если (ТипЗнч(ВидОперацииД) = Тип("СправочникСсылка.ВидыОпераций")) И ВидОперацииД.ДвижениеПоЦБ Тогда
		Если ЗначениеЗаполнено(ДатаИсполненияПоручения)
			И (НЕ ЗначениеЗаполнено(ДатаИсполненияПорученияВДепозитарииМХ)
			ИЛИ НЕ ЗначениеЗаполнено(ДатаИсполненияПорученияВМестеРасчетов)) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Необходимо указывать даты исполнения в депозитарии МХ и в месте расчетов!", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ВидОперацииД) = Тип("СправочникСсылка.ВидыОпераций")
		И (ВидОперацииД = Справочники.ВидыОпераций.ПередачаВЗалог
			ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ВозвратИзЗалога)
		И НЕ ЗначениеЗаполнено(Залогодержатель) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Для операций с залогами необходимо указать залогодержателя.", Отказ);
		Возврат;
	КонецЕсли;
	
	Если ВидОперацииД = Справочники.ВидыОпераций.НачислениеДоходовЦБ
			И НЕ ЗначениеЗаполнено(ЦББазовая) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Для операций начисления доходов ценными бумагами необходимо указать базовую ЦБ.", Отказ);
		Возврат;
	КонецЕсли;
	
	// Контроль равенства счетов ДЕПО и счетов МХ для перевода между разделами
	Если ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда 
		Если СчетДепо <> СчетДепоКонтрагента Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Счет ДЕПО депонента не равен счету ДЕПО контрагента!", Отказ);
			Возврат;
		КонецЕсли;
		Если СчетДепоМХ <> СчетДепоМХКонтрагента Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Счет ДЕПО МХ депонента не равен счету ДЕПО МХ контрагента!", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//Контроль квалифицированного инвестора
	//Возможно изменим режим проведения
	КонтрольКвалИнвестора(РежимЗаписи, Отказ);
		
	Если (РежимЗаписи = РежимЗаписиДокумента.Проведение И ЗначениеЗаполнено(ДатаИсполненияПоручения))
			ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
			ИЛИ ПометкаУдаления Тогда
		Если РегистрыСведений.СтатусыПоручений.СтатусПоручения(Ссылка) = Перечисления.СтатусыПоручений.Отменено Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Это поручение отменено. Распроведите поручение на отмену.", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	Если (РежимЗаписи = РежимЗаписиДокумента.Проведение И ЗначениеЗаполнено(ДатаИсполненияПоручения))
			ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
			ИЛИ ПометкаУдаления Тогда
		Если РегистрыСведений.СтатусыПоручений.СтатусПоручения(Ссылка) = Перечисления.СтатусыПоручений.Отменено Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Это поручение отменено. Распроведите поручение на отмену.", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаИсполненияПоручения) И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ЕстьНеттоПоручениеСПустойДатойИсполнения() Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Сначала необходимо исполнить связанное нетто-поручение!", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ссылка) И ПринятьВОбработку
		ИЛИ ЗначениеЗаполнено(Ссылка) И НЕ Ссылка.ПринятьВОбработку И ПринятьВОбработку Тогда // Попытка установки флажка
		Причина = ПричинаЗапретаУстановкиФлажкаПринятьВОбработку();
		Если ЗначениеЗаполнено(Причина) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Запрещено устанавливать флажок ""Принять в обработку"" в "
			+ ?(ЗначениеЗаполнено(Ссылка), Ссылка, "поручении") + " по причине: " + Символы.ПС + Причина, Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипРазделаСчетаДЕПО = Перечисления.ТипыРазделовСчетовДЕПО.ОбеспеченияДержатель И Не ЗначениеЗаполнено(Брокер) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Для раздела Обеспечения (Держатель) необходимо указать брокера", Отказ);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидПоручения) Тогда
		ВидПоручения = ВидПоручения();
	КонецЕсли;
	
	Если НеобходимоФормироватьУведомлениеОИсполненииОперацийСЦБ(РежимЗаписи) Тогда
		ДополнительныеСвойства.Вставить("НеобходимоФормироватьУведомлениеОИсполненииОперацийСЦБ", Истина);
	ИначеЕсли НеобходимоУдалитьУведомлениеОИсполненииОперацийСЦБ(РежимЗаписи) Тогда
		УдалитьЗаписьИзРССостоянияУведомленийОбОперацияхСЦБ();
	КонецЕсли;
	
	Если ТипЗнч(ВидОперацииД) = Тип("СправочникСсылка.ВидыОпераций")
		И ВидОперацииД.ВыплатаДоходаВДенежнойФорме
		И Документы.НачисленныйНалог.ИспользоватьРасчетНДФЛПоПрогрессивнойШкале(Дата)
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		СчетаДепо = ЦенныеБумагиСписываемые.Выгрузить(, "СчетДепо");
		МаксДаты = Документы.Поручение.МаксимальныеПлановыеДатыРасчетов(Дата, СчетаДепо);
		Для Каждого Строка Из ЦенныеБумагиСписываемые Цикл
			Если Не (Строка.ПлановаяДатаРасчетов >= НачалоДня(Дата)
					И Строка.ПлановаяДатаРасчетов <= МаксДаты[Строка.СчетДепо]) Тогда
					
				ОбщегоНазначения.СообщитьОбОшибке("Плановая дата расчетов для счета Депо " + СокрЛП(Строка.СчетДепо)
					+ " должна быть в интервале с " + Формат(Дата, "ДФ=dd.MM.yyyy") + " по "
					+ Формат(МаксДаты[Строка.СчетДепо], "ДФ=dd.MM.yyyy"), Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОснованиеОперацииДКУ) И ЮрФизЛицоДепонентаКонтрагентаОдинаково() Тогда
	
		КодыВидовПорученийДляЗаполненияСтрока =
			РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("696.КодыВидовПорученийДляЗаполненияКодаОснованияОперацииВПоручении");
		КодыВидовПорученийДляЗаполнения = СтрРазделить(КодыВидовПорученийДляЗаполненияСтрока, ",", Ложь);
		КодВидаПоручения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидПоручения, "Код");
		Если КодыВидовПорученийДляЗаполнения.Найти(КодВидаПоручения) <> Неопределено Тогда
			ОснованиеОперацииДКУ = Справочники.КодыОснованияОперацийДКУ.TR01;
		КонецЕсли;
	
	КонецЕсли;
	
	ВидыОперацийДляПередачиВКафка = Новый Массив;
	ВидыОперацийДляПередачиВКафка.Добавить(Справочники.ВидыОпераций.Погашение);
	ВидыОперацийДляПередачиВКафка.Добавить(Справочники.ВидыОпераций.ВыкупСписаниеЦБ);
	
	Если ТипЗнч(ВидОперацииД) = Тип("СправочникСсылка.ВидыОпераций")
		И ВидыОперацийДляПередачиВКафка.Найти(ВидОперацииД) <> Неопределено Тогда
		Для Каждого СтрокаТЧ Из ЦенныеБумагиСписываемые Цикл
			Если Не ЗначениеЗаполнено(СтрокаТЧ.DepoId) Тогда
				СтрокаТЧ.DepoId = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
		КонецЦикла;
		СтрокиКУдалению = Новый Массив;
		Для Каждого СтараяСтрока Из Ссылка.ЦенныеБумагиСписываемые Цикл
			Если ЦенныеБумагиСписываемые.Найти(СтараяСтрока.DepoId, "DepoId") = Неопределено Тогда
				ДанныеУдаляемойСтроки = Новый Структура("DepoId, СчетДепо, РазделСчетаДепо, РазделСчетаДепоМХ, ЦеннаяБумага, Количество");
				ЗаполнитьЗначенияСвойств(ДанныеУдаляемойСтроки, СтараяСтрока);
				СтрокиКУдалению.Добавить(ДанныеУдаляемойСтроки);
			КонецЕсли;
		КонецЦикла;
		Если СтрокиКУдалению.Количество() Тогда
			ДополнительныеСвойства.Вставить("СтрокиКУдалению", СтрокиКУдалению);
		КонецЕсли;
	КонецЕсли;
	
	Документы.Поручение.ЭтоПоручениеПрошлоКонтрольПоУказу520(ЭтотОбъект);
	
	ЗаполнитьОчиститьУИН();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ПометкаУдаления Тогда
		ПометитьНаУдалениеПодчиненныеДокументы();
	Иначе
		ВыполнитьКонтрольПоручения(Перечисления.СобытияКонтроляПоручений.ПриЗаписи, Отказ);
	КонецЕсли;
	Если Не Проведен Тогда
		ОбменДаннымиКафка.ЗаписатьОбъектВИсходящиеСообщенияКафкаПриЗаписиДокумента(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьНачислениеНалога() Экспорт 
	Если ВидОперацииД = Справочники.ВидыОпераций.НачислениеДивидендов Тогда
		Для Каждого Строка Из ЦенныеБумагиСписываемые Цикл
			Если ЗначениеЗаполнено(ЦБ.ГруппаЦБ) И ЦБ.ГруппаЦБ = Справочники.ГруппаЦБДляНалогообложения.НайтиПоКоду("1C") Тогда
				Строка.НачислитьНалог = НЕ Строка.СчетДепо.Владелец.УправляющаяКомпания;
			КонецЕсли;
			ПроверитьНеобходимостьНачисленияНалога(Строка);
		КонецЦикла;
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ПогашениеНКД 
		И НЕ (ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Облигация И ЦБ.ВидЦБ = Перечисления.ВидыОблигаций.Государственная) Тогда 
		Для Каждого Строка Из ЦенныеБумагиСписываемые Цикл
			Если Строка.СчетДепо.Владелец.НеРезидент И Строка.СчетДепо.Владелец.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
				Строка.НачислитьНалог = Истина;
			КонецЕсли;
			ПроверитьНеобходимостьНачисленияНалога(Строка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если ЕстьПроведенныеПодчиненныеПоручения() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Вначале отмените проведение подчиненных поручений.", Отказ);
	Иначе
		УдалятьПодчиненныеПоручения = Ложь;
		Если Не Документы.Поручение.ЭтоПериодическиеВыпискиОСостоянииСчетаДЕПО(ЭтотОбъект) Тогда
			Документы.Поручение.УдалитьДокументыНаОснованииПоручения(Ссылка, УдалятьПодчиненныеПоручения);
		КонецЕсли;
	КонецЕсли;
	
	// Свойство ОбработкаУдаленияПроведения присваивается, чтобы при отмене встречного поручение не искать первое встречное поручение
	Если ВидОперацииД = Справочники.ВидыОпераций.Перевод И ДополнительныеСвойства.Свойство("ОбработкаУдаленияПроведения") = Ложь Тогда
		ВстречноеПоручение = Документы.Поручение.ВстречноеПоручениеПеревод(Ссылка);
		Если ВстречноеПоручение.Проведен И ЗначениеЗаполнено(ВстречноеПоручение)  Тогда
			ОбъектВстречноеПоручение = ВстречноеПоручение.ПолучитьОбъект();
			ОбъектВстречноеПоручение.ДополнительныеСвойства.Вставить("ОбработкаУдаленияПроведения",Истина);
			ОбъектВстречноеПоручение.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Если РучнойВвод Тогда
		Возврат;
	КонецЕсли;
	
	Префикс 				= НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	Номер					= НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	ВходящийНомерПоручения	= ?(ЗначениеЗаполнено(ВходящийНомерПоручения), ВходящийНомерПоручения, Номер);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ВходящийНомерПоручения	= "";
	НомерПорученияВБО		= "";
	ОчиститьЗависимыеОтВидаОперацииРеквизиты();
	КодОтчетаНРД			= "";
	ИдентификаторЗагрузки	= "";
	ПринятьВОбработку		= Ложь;
	ДатаИсполненияПоручения	= '00010101';
	ДатаИсполненияПорученияВДепозитарииМХ	= '00010101';
	ДатаИсполненияПорученияВМестеРасчетов	= '00010101';
	ПланируемаяДатаРасчетов	= '00010101';
	ДатаСделки				= '00010101';
	РучнойВвод              = Ложь;
	Проверено               = Ложь;
	ЗагруженоИзВнешнегоИсточника = Ложь;	
	Если Документы.НачисленныйНалог.ИспользоватьРасчетНДФЛПоПрогрессивнойШкале(ТекущаяДатаСеанса()) Тогда
		ОчиститьПоляТабЧастиЦенныеБумагиСписываемые();
	КонецЕсли;
	УведомлениеСУДКОтправлено = Ложь;
	ДокументОснование = Неопределено;
	ДоговорОснованияДКУНомер = "";
	ДоговорОснованияДКУДата = '00010101';
	ОснованиеОперацииДКУ = Неопределено;
	ИсточникЗагрузки = Неопределено;
	Для Каждого Строка Из ЦенныеБумагиСписываемые Цикл
		Строка.ИдентификаторЗагрузки = "";
		Строка.ИдентификаторДействияВQUIK = Неопределено;
	КонецЦикла;
	ДополнительнаяИнформацияДляНРД = "";
	УИН = "";
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	УдалятьПодчиненныеПоручения = Истина;
	Документы.Поручение.УдалитьДокументыНаОснованииПоручения(Ссылка, УдалятьПодчиненныеПоручения);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперацииД = Справочники.ВидыОпераций.Перемещение
		ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
		ПроверяемыеРеквизиты.Добавить("МХКонтрагент");
		ПроверяемыеРеквизиты.Добавить("СчетДепоМХКонтрагента");
		ПроверяемыеРеквизиты.Добавить("РазделСчетаДепоМХКонтрагента");
	КонецЕсли;
	Если ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо И ТипЗнч(СчетДепо) = Тип("СправочникСсылка.СчетаДепо")
		И Перечисления.ТипыСчетовДепо.НоминальныхДержателей().Найти(СчетДепо.ТипСчетаДепо) <> Неопределено Тогда
		Если РазделСубклиента Тогда
			ПроверяемыеРеквизиты.Добавить("Субклиент");
		ИначеЕсли ЗначениеЗаполнено(Субклиент) И Не РазделСубклиента Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не установлен флаг ""Раздел субклиента"" при заполненном поле ""Субклиент""");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли; 
	
	ИмяПараметра = "2060.ДатаНачалаОбязательногоЗаполненияТипаПереводаВПоручении";
	Если ВидОперацииД = Справочники.ВидыОпераций.Перевод
			И Не ЗначениеЗаполнено(ТипПеревода)
			И РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра(ИмяПараметра, Дата(3999, 12, 31)) <= НачалоДня(Дата) Тогда
		ПроверяемыеРеквизиты.Добавить("ТипПеревода");
	КонецЕсли;
	
	Если Документы.Поручение.ТребуетсяПроверкаКарточкиКД(ЭтотОбъект) Тогда
		УведомлятьПочтовымСообщениемПриНезаполненнойКарточкеКД = Ложь;
		ПроверятьНаличиеКарточкиКД = НЕ НеПроверятьНаличиеКарточкиКД;
		Если ПроверятьНаличиеКарточкиКД И НЕ ЗначениеЗаполнено(КарточкаКД) Тогда
			Если УведомлятьПочтовымСообщениемПриНезаполненнойКарточкеКД Тогда
				Документы.Поручение.ОтложенноеУведомлениеПисьмом_КарточкаКД_НеЗаполнена(ЭтотОбъект);
			КонецЕсли;
			ОбщегоНазначения.СообщитьОбОшибке("Для проведения поручения необходима карточка КД!", Отказ);
		КонецЕсли;
	КонецЕсли;
	Документы.Поручение.ПроверитьДлинуКомментария(ЭтотОбъект, Отказ);
	
	ДополнитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты);
	
	СобытияКонтроля = Новый Массив;
	СобытияКонтроля.Добавить(Перечисления.СобытияКонтроляПоручений.ПриПроведении);
	СобытияКонтроля.Добавить(Перечисления.СобытияКонтроляПоручений.ПриПроведенииСЗапретом);
	ВыполнитьКонтрольПоручения(СобытияКонтроля, Отказ);
КонецПроцедуры

Процедура ДополнитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты)
	
	Если ВидПоручения = Справочники.ВидыИнвентарныхПоручений.П35_2
		Или ВидПоручения = Справочники.ВидыИнвентарныхПоручений.П36_2 Тогда
		ПроверяемыеРеквизиты.Добавить("ПаиБИК");
		ПроверяемыеРеквизиты.Добавить("ПаиНаименованиеБанка");
		ПроверяемыеРеквизиты.Добавить("ПаиГородБанка");
		ПроверяемыеРеквизиты.Добавить("ПаиКоррСчет");
		ПроверяемыеРеквизиты.Добавить("ПаиРасчетныйСчет");
		ПроверяемыеРеквизиты.Добавить("ПаиИНН");
		ПроверяемыеРеквизиты.Добавить("ПаиПолучатель");
	КонецЕсли;
	Если Документы.ПлатежнаяОперация.РазрешеныПлатежныеОперацииПоПоручению(Ссылка) Тогда
		ПроверяемыеРеквизиты.Добавить("ЦенныеБумагиСписываемые.БанковскийСчет");
	КонецЕсли;
	
	Если ОснованиеОперацииДКУ = Справочники.КодыОснованияОперацийДКУ.TR39 Тогда
		ПроверяемыеРеквизиты.Добавить("ОснованиеОперацииДКУИноеНаименование");
	КонецЕсли; 
	
	Если ВидПоручения = Справочники.ВидыИнвентарныхПоручений.П16
		Или ВидПоручения = Справочники.ВидыИнвентарныхПоручений.П16_1 Тогда
		
		Если Не ЗначениеЗаполнено(КраткийКодНРД) Тогда
			ПроверяемыеРеквизиты.Добавить("СчетДепоКонтрагента");
			ПроверяемыеРеквизиты.Добавить("РазделСчетаДепоКонтрагента");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура СформироватьДвиженияПоРегиструДенежныхСредств()
	
	НеобходимыДвижения = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ДатаДвиженийПоДС") <= Дата
		И ТипЗнч(ВидОперацииД) = Тип("СправочникСсылка.ВидыОпераций") И ВидОперацииД.ВыплатаДоходаВДенежнойФорме;
	Если НеобходимыДвижения Тогда
		Для Каждого СтрокаВыплаты Из ЦенныеБумагиСписываемые Цикл
			Движение = Движения.ДенежныеСредства.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Выплата = Ссылка;
			Движение.БанковскийСчет = БанковскийСчет;
			Движение.Депонент = СтрокаВыплаты.СчетДепо.Владелец;
			Движение.Валюта = Валюта;
			ЭтоИностраннаяЦБ = Справочники.ВидыЦББанкаРоссии.ЭтоВидИностраннойЦБ(ЦБ.ВидЦББанкаРоссии);
			Если ЭтоИностраннаяЦБ Тогда
				Движение.ВалютнаяСумма = СтрокаВыплаты.СуммаКВыплатеПоИПД;
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.НачислениеДоходаПрочие И СтрокаВыплаты.НДФЛУдержан Тогда
				Движение.ВалютнаяСумма = СтрокаВыплаты.Сумма - СтрокаВыплаты.СуммаНалога;
			Иначе
				Движение.ВалютнаяСумма = СтрокаВыплаты.Сумма;
			КонецЕсли;
			ПараметрыКурсаВалюты = ОбщегоНазначения.ПолучитьКурсВалюты(Валюта, СтрокаВыплаты.ПлановаяДатаРасчетов);
			Курс = ?(ЗначениеЗаполнено(ПараметрыКурсаВалюты.Курс), ПараметрыКурсаВалюты.Курс, 1);
			Кратность = ?(ЗначениеЗаполнено(ПараметрыКурсаВалюты.Кратность), ПараметрыКурсаВалюты.Кратность, 1);
			Движение.Сумма = Движение.ВалютнаяСумма * (Курс / Кратность);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьПоляТабЧастиЦенныеБумагиСписываемые()
	Для Каждого Строка Из ЦенныеБумагиСписываемые Цикл
		Строка.СуммаНалога = 0;
		Строка.DepoId = "";
	КонецЦикла;
КонецПроцедуры

Процедура ПереформироватьОперацииЦБ(Отказ)
	
	ДанныеИсполнения = Документы.ИсполнениеПоручения.ДанныеИсполненияПоручения(Ссылка);
	
	Если ДополнительныеСвойства.Свойство("РежимЗаписиИсполнения") Тогда
		РежимЗаписиИсполнения = ДополнительныеСвойства.РежимЗаписиИсполнения;
	Иначе
		РежимЗаписиИсполнения = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	
	Если РежимЗаписиИсполнения = РежимЗаписиДокумента.Проведение Тогда
		ФлагПроведения = Истина;
		ОперацияЦБ = ПодчиненнаяОперацияЦБ(ДанныеИсполнения.КоличествоОтчета, ДанныеИсполнения.Дата, ФлагПроведения);
		Если ЗначениеЗаполнено(ОперацияЦБ) Тогда
			Возврат;
		КонецЕсли;
		
		Если ДанныеИсполнения.Статус = Перечисления.СтатусыПоручений.Исполнено Тогда
			ФлагПроведения = Ложь;
			ОперацияЦБ = ПодчиненнаяОперацияЦБ(ДанныеИсполнения.КоличествоОтчета, Неопределено, ФлагПроведения);
			Если НЕ ЗначениеЗаполнено(ОперацияЦБ) Тогда
				ОперацияЦБ = НоваяОперацияЦБ(ДанныеИсполнения.КоличествоОтчета);
			КонецЕсли;
			
			ЗаполнитьПровестиОперациюЦБ(ОперацияЦБ, РежимЗаписиДокумента.Проведение);
			
		ИначеЕсли ДанныеИсполнения.Статус = Перечисления.СтатусыПоручений.ИсполненоЧастично Тогда
			ФлагПроведения = Ложь;
			ОперацияЦБ = ПодчиненнаяОперацияЦБ(ДанныеИсполнения.НачальныйОстаток, Неопределено, ФлагПроведения);
			Если НЕ ЗначениеЗаполнено(ОперацияЦБ) Тогда
				ОперацияЦБ = НоваяОперацияЦБ(ДанныеИсполнения.НачальныйОстаток);
			КонецЕсли;
			
			ТекстОшибки = РезультатПроведенияОперацииЦБ(ОперацияЦБ, ДанныеИсполнения);
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ);
				Возврат;
			КонецЕсли;
			
			ТекстОшибки = РезультатСозданияОперацииЦБ(ОперацияЦБ, ДанныеИсполнения.КонечныйОстаток);
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ);
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли РежимЗаписиИсполнения = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ФлагПроведения = Истина;
		ОтменяемаяОперацияЦБ = ПодчиненнаяОперацияЦБ(ДанныеИсполнения.КоличествоОтчета, ДанныеИсполнения.Дата,
			ФлагПроведения);
		Если НЕ ЗначениеЗаполнено(ОтменяемаяОперацияЦБ) Тогда
			Возврат;
		КонецЕсли;
		
		СписокОпераций = СписокПодчиненныхОперацийЦБ();
		Если СписокОпераций[СписокОпераций.Количество()-1] <> ОтменяемаяОперацияЦБ Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Исполнения поручений нужно распроводить в обратном порядке!", Отказ);
			Возврат;
		КонецЕсли;
			
		Если ДанныеИсполнения.Статус = Перечисления.СтатусыПоручений.Исполнено Тогда
			ТекстОшибки = РезультатОтменыОперацииЦБ(ОтменяемаяОперацияЦБ);
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ);
				Возврат;
			КонецЕсли;
			
		ИначеЕсли ДанныеИсполнения.Статус = Перечисления.СтатусыПоручений.ИсполненоЧастично Тогда
			ФлагПроведения = Ложь;
			ОперацияПолучатель = ПодчиненнаяОперацияЦБ(Неопределено, Неопределено, ФлагПроведения);
			Если НЕ ЗначениеЗаполнено(ОперацияПолучатель) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"У %1 не найдена подчиненная непроведенная операция ЦБ", Ссылка);
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ);
				Возврат;
			КонецЕсли;
			
			ТекстОшибки = РезультатОбъединенияОперацийЦБ(ОперацияПолучатель, ОтменяемаяОперацияЦБ.Количество);
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ);
				Возврат;
			КонецЕсли;
			
			Выписка = ПодчиненнаяВыписка(ОтменяемаяОперацияЦБ);
			УдалитьДокумент(Выписка);
			УдалитьДокумент(ОтменяемаяОперацияЦБ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПодчиненнаяВыписка(ОперацияЦБ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Выписка.Ссылка КАК Выписка
	|ИЗ
	|	Документ.Выписка КАК Выписка
	|ГДЕ
	|	Выписка.ДокументОснование = &Поручение
	|	И Выписка.ОперацияЦБ = &ОперацияЦБ
	|";
	Запрос.УстановитьПараметр("Поручение",	Ссылка);
	Запрос.УстановитьПараметр("ОперацияЦБ",	ОперацияЦБ);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Выписка;
		КонецЕсли;
	КонецЕсли;
	Возврат Документы.Выписка.ПустаяСсылка();
	
КонецФункции

Процедура УдалитьДокумент(ДокументСсылка)
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		Документ = ДокументСсылка.ПолучитьОбъект();
		Сообщить("Удален документ: " + Документ + Символы.ПС, СтатусСообщения.Информация);
		Документ.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Функция СписокПодчиненныхОперацийЦБ()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОперацииЦБ.Ссылка КАК ОперацияЦБ
	|ИЗ
	|	Документ.ОперацииЦБ КАК ОперацииЦБ
	|ГДЕ
	|	ОперацииЦБ.ДокументОснование = &ДокументОснование
	|	И НЕ ОперацииЦБ.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОперацииЦБ.Дата
	|";
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОперацияЦБ");
	
КонецФункции

Функция РезультатОтменыОперацииЦБ(ОтменяемаяОперацияЦБ)
	
	ОперацияЦБ = ОтменяемаяОперацияЦБ.ПолучитьОбъект();
	ОперацияЦБ.Дата = Дата;
	ОперацияЦБ.ДатаИсполненияВДепозитарииМХ	= '00010101';
	ОперацияЦБ.ДатаИсполненияВМестеРасчетов	= '00010101';
	
	Попытка
		ОперацияЦБ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Исключение
		ТекстОшибки = "Не удалось отменить проведение " + ОперацияЦБ + ". " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат ТекстОшибки;
	КонецПопытки;
	Возврат "";
	
КонецФункции
			
Процедура ЗаполнитьПровестиОперациюЦБ(ОперацияЦБ, РежимЗаписиОперации)
	
	Документ = ОперацияЦБ.ПолучитьОбъект();
	
	Если Документ.ПометкаУдаления Тогда
		Документ.ПометкаУдаления = Ложь;
		Документ.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;	
	
	Документ.ДополнительныеСвойства.Вставить("ОставитьБезИзмененийКоличествоСуммуОперацииЦБ");
	Документ.Заполнить(Ссылка);
	
	Документ.Записать(РежимЗаписиОперации);
	
КонецПроцедуры

Функция НоваяОперацияЦБ(Количество)
	
	ДокументОбъект = Документы.ОперацииЦБ.СоздатьДокумент();
	ДокументОбъект.Заполнить(Ссылка);
	ДокументОбъект.ДатаИсполненияВДепозитарииМХ	= '00010101';
	ДокументОбъект.ДатаИсполненияВМестеРасчетов	= '00010101';
	ДокументОбъект.Количество = Количество;
	ДокументОбъект.Сумма = ДокументОбъект.Количество * ДокументОбъект.Цена;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции

Функция ПодчиненнаяОперацияЦБ(Количество = Неопределено, Дата = Неопределено, ФлагПроведения = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОперацииЦБ.Ссылка КАК ОперацияЦБ
	|ИЗ
	|	Документ.ОперацииЦБ КАК ОперацииЦБ
	|ГДЕ
	|	ОперацииЦБ.ДокументОснование = &ДокументОснование
	|	И (&ФлагПроведения = Неопределено ИЛИ ОперацииЦБ.Проведен = &ФлагПроведения)
	|	И (&Дата = Неопределено ИЛИ ОперацииЦБ.Дата = &Дата)
	|	И (&Количество = Неопределено ИЛИ ОперацииЦБ.Количество = &Количество) 
	|";
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	Запрос.УстановитьПараметр("ФлагПроведения", ФлагПроведения);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Количество", Количество);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ОперацияЦБ;
		КонецЕсли;
	КонецЕсли;
	Возврат Документы.ОперацииЦБ.ПустаяСсылка();
	
КонецФункции

Функция РезультатОбъединенияОперацийЦБ(ОперацияЦБСсылка, КоличествоДругойОперации)
	
	ОперацияЦБ = ОперацияЦБСсылка.ПолучитьОбъект();
	ОперацияЦБ.Количество = ОперацияЦБ.Количество + КоличествоДругойОперации;
	ОперацияЦБ.Сумма = ОперацияЦБ.Количество * ОперацияЦБ.Цена;
	
	Попытка
		ОперацияЦБ.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ТекстОшибки = "Не удалось записать " + ОперацияЦБ + ". " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат ТекстОшибки;
	КонецПопытки;
	Возврат "";
	
КонецФункции

Функция РезультатПроведенияОперацииЦБ(ОперацияЦБСсылка, ДанныеИсполнения)
	
	ОперацияЦБ = ОперацияЦБСсылка.ПолучитьОбъект();
	ОперацияЦБ.Дата = ДанныеИсполнения.Дата;
	ОперацияЦБ.ДатаИсполненияВДепозитарииМХ	= ДанныеИсполнения.ДатаИсполненияВДепозитарииМХ;
	ОперацияЦБ.ДатаИсполненияВМестеРасчетов	= ДанныеИсполнения.ДатаИсполненияВМестеРасчетов;
	ОперацияЦБ.Количество = ДанныеИсполнения.КоличествоОтчета;
	ОперацияЦБ.Сумма = ОперацияЦБ.Количество * ОперацияЦБ.Цена;
	
	Попытка
		ОперацияЦБ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстОшибки = "Не удалось провести " + ОперацияЦБ + ". " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат ТекстОшибки;
	КонецПопытки;
	Возврат "";
	
КонецФункции

Функция РезультатСозданияОперацииЦБ(ИсходнаяОперацияЦБ, КонечныйОстаток)
	
	ОперацияЦБ = Документы.ОперацииЦБ.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ОперацияЦБ, ИсходнаяОперацияЦБ);
	ОперацияЦБ.Проведен = Ложь;
	ОперацияЦБ.ПометкаУдаления = Ложь;
	ОперацияЦБ.Дата = Дата;
	ОперацияЦБ.ДатаИсполненияВДепозитарииМХ	= '00010101';
	ОперацияЦБ.ДатаИсполненияВМестеРасчетов	= '00010101';
	ОперацияЦБ.Количество = КонечныйОстаток;
	ОперацияЦБ.Сумма = ОперацияЦБ.Количество * ОперацияЦБ.Цена;
	Попытка
		ОперацияЦБ.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ТекстОшибки = "Не удалось записать новую операцию ЦБ на основании " + Ссылка + ". "
			+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат ТекстОшибки;
	КонецПопытки;
	Возврат "";
	
КонецФункции

Функция ПолучитьПараметрыДоговораПоПоручению()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Код,
	|	ДатаНачалоДействия,
	|	Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ПометкаУдаления
	|	И (ДатаНачалоДействия <= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) ИЛИ ДатаНачалоДействия = ДАТАВРЕМЯ(1,1,1))
	|	И (ДатаОкончанияДействия >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) ИЛИ ДатаОкончанияДействия = ДАТАВРЕМЯ(1,1,1))
	|	И Владелец		= &Владелец
	|	И ТипДоговора	= ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.Депозитарный)");

	Запрос.УстановитьПараметр("Владелец", Инициатор);
	Запрос.УстановитьПараметр("Дата"	, Дата);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПроверкаНаНаличиеДокументовСозданныхНаОснованииТекущего() Экспорт
	
	Перем ЗапретРедактирования;
	Перем ВидыОпераций;
	
	ВидыОпераций = Справочники.ВидыОпераций;
	
	ЗапретРедактирования = Ложь;
	
	Если ЭтоНовый() Тогда
		Возврат ЗапретРедактирования;
	КонецЕсли; 
	
	Если ВидОперацииД = ВидыОпераций.ОткрытиеСчетаДепо Тогда
		
		ЗапретРедактирования = НЕ Документы.ОткрытиеСчетаДепо.НайтиПоРеквизиту("ДокументОснование", Ссылка).Пустая();
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.ОткрытиеРазделаСчетаДепо Тогда
		
		ЗапретРедактирования = НЕ Документы.ОткрытиеРазделаСчетаДепо.НайтиПоРеквизиту("ДокументОснование", Ссылка).Пустая();
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.ЗакрытиеСчетаДепо Тогда
		
		ЗапретРедактирования = НЕ Документы.ЗакрытиеСчетаДепо.НайтиПоРеквизиту("ДокументОснование", Ссылка).Пустая();
		
	ИначеЕсли	ВидОперацииД = ВидыОпераций.НазначениеОператораСчетаДепо 
			  	ИЛИ ВидОперацииД = ВидыОпераций.НазначениеПопечителяСчетаДепо 
			  	ИЛИ ВидОперацииД = ВидыОпераций.НазначениеРаспорядителяСчетаДепо	Тогда	
		
		ЗапретРедактирования = НЕ Документы.НазначениеПредставителяСчетаДепо.НайтиПоРеквизиту("ДокументОснование", Ссылка).Пустая();
		
	ИначеЕсли   ВидОперацииД = ВидыОпераций.ОтзывПопечителяСчетаДепо
				ИЛИ ВидОперацииД = ВидыОпераций.ОтменаОператораСчетаДепо
				ИЛИ ВидОперацииД = ВидыОпераций.ОтменаРаспорядителяСчетаДепо Тогда	
		
		ЗапретРедактирования = НЕ Документы.ОтменаПредставителяСчетаДепо.НайтиПоРеквизиту("ДокументОснование", Ссылка).Пустая();	
		
	ИначеЕсли	ВидОперацииД = ВидыОпераций.Депонирование
				ИЛИ ВидОперацииД = ВидыОпераций.СнятиеСДепонирования
				ИЛИ ВидОперацииД = ВидыОпераций.Блокирование
				ИЛИ ВидОперацииД = ВидыОпераций.Обременение 
				ИЛИ ВидОперацииД = ВидыОпераций.Перевод 
				ИЛИ ВидОперацииД = ВидыОпераций.Перемещение
				ИЛИ ВидОперацииД = ВидыОпераций.ПереводМеждуРазделамиСчетаДепо
				ИЛИ ВидОперацииД = ВидыОпераций.ПередачаВЗалог
				ИЛИ ВидОперацииД = ВидыОпераций.ВозвратИзЗалога 
				ИЛИ ВидОперацииД = ВидыОпераций.СнятиеОбременения 
				ИЛИ ВидОперацииД = ВидыОпераций.Разблокирование Тогда	
		
		ЗапретРедактирования = НЕ Документы.ОперацииЦБ.НайтиПоРеквизиту("ДокументОснование", Ссылка).Пустая();	 	
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.ПредоставлениеУведомления Тогда
		
		ЗапретРедактирования = НЕ Документы.Выписка.НайтиПоРеквизиту("ДокументОснование", Ссылка).Пустая();	
		
	КонецЕсли;          
	
	Если ЗапретРедактирования Тогда
		Сообщить("На основании данного поручения есть введенные документы!");
	КонецЕсли; 
	
	Возврат ЗапретРедактирования;
	
КонецФункции

Процедура ПометитьНаУдалениеПодчиненныеДокументы()
	Сообщение = Новый СообщениеПользователю;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДокументыПоПоручению.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.СтруктураПодчиненности(&Ссылка) КАК ДокументыПоПоручению
	|ГДЕ НЕ ДокументыПоПоручению.Ссылка ССЫЛКА ДОкумент.ТехническаяОперация");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если ДокументОбъект <> Неопределено Тогда
			Сообщение.Текст = Сообщение.Текст + "Помечен на удаление: " + ДокументОбъект + Символы.ПС;
			ДокументОбъект.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Сообщение.Текст) Тогда
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

Функция ЕстьПроведенныеПодчиненныеПоручения()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДокументыПоПоручению.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.СтруктураПодчиненности(&Ссылка) КАК ДокументыПоПоручению
	|ГДЕ
	|	ДокументыПоПоручению.Ссылка.Проведен
	|	И ДокументыПоПоручению.Ссылка ССЫЛКА Документ.Поручение");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Возврат НЕ Запрос.Выполнить().Пустой()
КонецФункции

Функция ЕстьНеисполненныеПорученияПоПассивномуРазделу()
	
	ЕстьНеисполненныеПоручения = Ложь;
	
	СтатусыПоручений = Новый Массив;
	СтатусыПоручений.Добавить(Перечисления.СтатусыПоручений.Обрабатывается);
	СтатусыПоручений.Добавить(Перечисления.СтатусыПоручений.ИсполненоЧастично);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РазделСчетаДепо", РазделСчетаДепо);
	Запрос.УстановитьПараметр("СтатусыПоручений", СтатусыПоручений);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументПоручение.Ссылка КАК Ссылка,
	|	СтатусыПорученийСрезПоследних.СтатусПоручения КАК СтатусПоручения
	|ИЗ
	|	Документ.Поручение КАК ДокументПоручение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПоручений.СрезПоследних КАК СтатусыПорученийСрезПоследних
	|		ПО ДокументПоручение.Ссылка = СтатусыПорученийСрезПоследних.Поручение
	|			И (СтатусыПорученийСрезПоследних.СтатусПоручения В (&СтатусыПоручений))
	|ГДЕ
	|	ДокументПоручение.РазделСчетаДепо = &РазделСчетаДепо
	|	И ДокументПоручение.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументПоручение.Ссылка,
	|	СтатусыПорученийСрезПоследних.СтатусПоручения
	|ИЗ
	|	Документ.Поручение.ЦенныеБумагиСписываемые КАК ДокументПоручение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПоручений.СрезПоследних КАК СтатусыПорученийСрезПоследних
	|		ПО ДокументПоручение.Ссылка = СтатусыПорученийСрезПоследних.Поручение
	|			И (СтатусыПорученийСрезПоследних.СтатусПоручения В (&СтатусыПоручений))
	|ГДЕ
	|	ДокументПоручение.РазделСчетаДепо = &РазделСчетаДепо
	|	И ДокументПоручение.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументПоручение.Ссылка,
	|	СтатусыПорученийСрезПоследних.СтатусПоручения
	|ИЗ
	|	Документ.Поручение.Списание КАК ДокументПоручение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПоручений.СрезПоследних КАК СтатусыПорученийСрезПоследних
	|		ПО ДокументПоручение.Ссылка = СтатусыПорученийСрезПоследних.Поручение
	|			И (СтатусыПорученийСрезПоследних.СтатусПоручения В (&СтатусыПоручений))
	|ГДЕ
	|	ДокументПоручение.РазделСчетаДепо = &РазделСчетаДепо
	|	И ДокументПоручение.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументПоручение.Ссылка,
	|	СтатусыПорученийСрезПоследних.СтатусПоручения
	|ИЗ
	|	Документ.Поручение.Зачисление КАК ДокументПоручение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПоручений.СрезПоследних КАК СтатусыПорученийСрезПоследних
	|		ПО ДокументПоручение.Ссылка = СтатусыПорученийСрезПоследних.Поручение
	|			И (СтатусыПорученийСрезПоследних.СтатусПоручения В (&СтатусыПоручений))
	|ГДЕ
	|	ДокументПоручение.РазделСчетаДепо = &РазделСчетаДепо
	|	И ДокументПоручение.Ссылка.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЕстьНеисполненныеПоручения = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По закрываемому разделу счета есть неисполненные поручения:");
		Пока ВыборкаЗапроса.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ВыборкаЗапроса.Ссылка, ВыборкаЗапроса.Ссылка);				
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЕстьНеисполненныеПоручения;
	
КонецФункции

Процедура СформироватьДвижениеПоСтатусуПоручения(Отказ)
	
	КлючСтрокиПоручения = Неопределено;
	Если Документы.Поручение.ЭтоИнвентарноеПоручениеСИсполнениемВРежимеЧастичногоИсполнения(Ссылка) Тогда
		// Установка статуса для этого кейса выполняется в Операции ЦБ
	
	ИначеЕсли ЗначениеЗаполнено(ДатаИсполненияПоручения) Тогда
		РегистрыСведений.СтатусыПоручений.УстановитьСтатус(Движения, Ссылка, ДатаИсполненияПоручения,
			Перечисления.СтатусыПоручений.Исполнено);
		Если ВидОперацииД = Справочники.ВидыОпераций.ОтменаПоручения
			И ТипЗнч(ОтменяемоеПоручение) = Тип("ДокументСсылка.Поручение") Тогда
			РегистрыСведений.СтатусыПоручений.УстановитьСтатус(Движения, ОтменяемоеПоручение, ДатаИсполненияПоручения,
				Перечисления.СтатусыПоручений.Отменено);
		КонецЕсли;
		
	ИначеЕсли Документы.НачисленныйНалог.НеподтвержденныеДокументыНачисленияНДФЛПоДивидендам(Ссылка) Тогда
		Документы.ПлатежнаяОперация.СоздатьПлатежныеОперацииПоПоручению(Ссылка, КлючСтрокиПоручения, Отказ);
		РегистрыСведений.СтатусыПоручений.УстановитьСтатус(Движения, Ссылка, Дата,
			Перечисления.СтатусыПоручений.ПодтверждениеНалога);
	Иначе
		Документы.ПлатежнаяОперация.СоздатьПлатежныеОперацииПоПоручению(Ссылка, КлючСтрокиПоручения, Отказ);
		РегистрыСведений.СтатусыПоручений.УстановитьСтатус(Движения, Ссылка, Дата, Перечисления.СтатусыПоручений.Обрабатывается);
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьОбновитьДокумент(ИмяДокумента, Отказ)
	ДокументСсылка = Документы[ИмяДокумента].НайтиПоРеквизиту("ДокументОснование", Ссылка);
	
	Если ДокументСсылка.Пустая() Тогда
		Документ = Документы[ИмяДокумента].СоздатьДокумент();
	Иначе
		Документ = ДокументСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если Документ.ПометкаУдаления Тогда
		Документ.ПометкаУдаления = Ложь;
		Документ.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;	
	
	Документ.Заполнить(Ссылка);
	
	Если ДополнительныеСвойства.Свойство("ВведеноИнтерактивно")
		И ДополнительныеСвойства.ВведеноИнтерактивно = Истина Тогда
		// При записи поручения из формы не перезаполняем признак "Начислить комиссию Депо"
		Документ.ДополнительныеСвойства.Вставить("ОтключитьЗаполнениеПризнакаНачислитьКомиссию", Истина);
	КонецЕсли;
	
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ОчиститьЗависимыеОтВидаОперацииРеквизиты() Экспорт
	
	Исключения = Новый Массив;
	Исключения.Добавить(Справочники.ВидыОпераций.НазначениеОператораСчетаДепо);
	Исключения.Добавить(Справочники.ВидыОпераций.ОтменаОператораСчетаДепо);
	
	Исключения.Добавить(Справочники.ВидыОпераций.НазначениеПопечителяСчетаДепо);	
	Исключения.Добавить(Справочники.ВидыОпераций.ОтзывПопечителяСчетаДепо);
	Исключения.Добавить(Справочники.ВидыОпераций.НазначениеРаспорядителяСчетаДепо);
	Исключения.Добавить(Справочники.ВидыОпераций.ОтменаРаспорядителяСчетаДепо);
	
	Исключения.Добавить(Справочники.ВидыОпераций.ОтменаПоручения);
	Исключения.Добавить(Справочники.ВидыОпераций.Конвертация);
	Исключения.Добавить(Справочники.ВидыОпераций.Выкуп);
	Исключения.Добавить(Справочники.ВидыОпераций.Погашение);
	
	Исключения.Добавить(Справочники.ВидыОпераций.СписаниеАкцийПриЛиквидацииЭмитента);
	Исключения.Добавить(Справочники.ВидыОпераций.СписаниеОбесценившихсяЦенныхБумаг);
	Исключения.Добавить(Справочники.ВидыОпераций.ВыкупСписаниеЦБ);
	Исключения.Добавить(Справочники.ВидыОпераций.НачислениеДоходовЦБ);
	
	Исключения.Добавить(Справочники.ВидыОпераций.СнятиеЦБсОбслуживания);
	Исключения.Добавить(Справочники.ВидыОпераций.ПриемЦБНаОбслуживание);
	
	ДобавитьОперацииВыплатыДоходаВДенежнойФорме(Исключения);
	
	Если Исключения.Найти(ВидОперацииД) <> Неопределено Тогда
		Депонент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	МассивОперацийСТипомСчета = Новый Массив;
	МассивОперацийСТипомСчета.Добавить(Справочники.ВидыОпераций.ОткрытиеСчетаДепо);
	Если МассивОперацийСТипомСчета.Найти(ВидОперацииД) = Неопределено Тогда
		ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ПустаяСсылка();
	КонецЕсли;
	
	МассивОперацийСТипомРазделаСчета = Новый Массив;
	МассивОперацийСТипомРазделаСчета.Добавить(Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо);
	МассивОперацийСТипомРазделаСчета.Добавить(Справочники.ВидыОпераций.ЗакрытиеРазделаСчетаДепо);
	
	Если МассивОперацийСТипомРазделаСчета.Найти(ВидОперацииД) = Неопределено Тогда
		ТипРазделаСчетаДЕПО = Перечисления.ТипыРазделовСчетовДЕПО.ПустаяСсылка();
	КонецЕсли;
		
	МассивОперацийБезСчетаДепо = Новый Массив;
	МассивОперацийБезСчетаДепо.Добавить(Справочники.ВидыОпераций.ОткрытиеСчетаДепо);
	Если НЕ МассивОперацийБезСчетаДепо.Найти(ВидОперацииД) = Неопределено Тогда
		СчетДепо = Справочники.СчетаДепо.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОперацииВыплатыДоходаВДенежнойФорме(Исключения)
	Операции = Справочники.ВидыОпераций.ОперацииВыплатыДоходаВДенежнойФорме();
	Для Каждого Операция Из Операции Цикл
		Исключения.Добавить(Операция);
	КонецЦикла;
КонецПроцедуры

Функция ЕстьНеттоПоручениеСПустойДатойИсполнения()
	
	Если ЭтоНовый() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧПоручения.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НеттоПоручение.Поручения КАК ТЧПоручения
	|ГДЕ
	|	ТЧПоручения.Ссылка.Проведен
	|	И ТЧПоручения.Ссылка.ДатаИсполнения = ДАТАВРЕМЯ(1, 1, 1)
	|	И ТЧПоручения.Поручение = &Поручение");
	Запрос.УстановитьПараметр("Поручение", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();
	
КонецФункции

Функция ПричинаЗапретаУстановкиФлажкаПринятьВОбработку()
	ПричинаЗапрета = "";
	Если ЗначениеЗаполнено(ДатаИсполненияПоручения) Тогда
		ПричинаЗапрета = "У поручения заполнена дата исполнения";
	ИначеЕсли Документы.Поручение.ОперацияБлокирована(ЭтотОбъект) Тогда
		ПричинаЗапрета = "Инициатор блокирован, внешние операции с ЦБ запрещены";
	ИначеЕсли Не ЗначениеЗаполнено(Ссылка) Тогда
		ПричинаЗапрета = "";
	Иначе
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТЧПоручения.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.НеттоПоручение.Поручения КАК ТЧПоручения
		|ГДЕ
		|	ТЧПоручения.Ссылка.Проведен
		|	И ТЧПоручения.Поручение = &Поручение");
		Запрос.УстановитьПараметр("Поручение", Ссылка);
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			ПричинаЗапрета = "Поручение учтено в нетто-поручении";
		КонецЕсли;
	КонецЕсли;	
	Возврат ПричинаЗапрета;		
КонецФункции

Процедура СформироватьПоручениеНаОткрытиеРазделаСчетаМХ(Отказ)
	
	Если ЗначениеЗаполнено(СчетДепоМХ) И ЗначениеЗаполнено(НомерРазделаСчетаДепоМХ) Тогда
		
		ДокОткрытияРазделаМХ = Документы.Поручение.НайтиПоРеквизиту("ДокументОснование", Ссылка);
		Если ДокОткрытияРазделаМХ = Документы.Поручение.ПустаяСсылка() Тогда
			
			ДокОткрытияРазделаМХ = Документы.Поручение.СоздатьДокумент();
			ДокОткрытияРазделаМХ.Дата					= Дата;
			ДокОткрытияРазделаМХ.ДокументОснование		= Ссылка;
			ДокОткрытияРазделаМХ.ОткрытьВМХ				= Истина;
			ДокОткрытияРазделаМХ.ВидОперацииД			= Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо;
			ДокОткрытияРазделаМХ.Инициатор				= СчетДепоМХ.ВладелецСчетаДепоМХ;
			ДокОткрытияРазделаМХ.Депонент				= СчетДепоМХ.Владелец;
			ДокОткрытияРазделаМХ.СчетДепо				= СчетДепоМХ;
			ДокОткрытияРазделаМХ.ТипРазделаСчетаДЕПО	= ТипРазделаСчетаДЕПО;
			ДокОткрытияРазделаМХ.РазделСчетаДепоМХ		= НомерРазделаСчетаДепоМХ;
			ЭтоТипРазделаОбеспеченияДержатель			= (ТипРазделаСчетаДЕПО = Перечисления.ТипыРазделовСчетовДЕПО.ОбеспеченияДержатель);
			ДокОткрытияРазделаМХ.Брокер					= ?(ЭтоТипРазделаОбеспеченияДержатель, Брокер, Неопределено);
			
			Попытка
				ДокОткрытияРазделаМХ.Записать(РежимЗаписиДокумента.Проведение);
				Если ЭтоТипРазделаОбеспеченияДержатель Тогда
					Документы.Поручение.ВыгрузитьПоручение(ДокОткрытияРазделаМХ.Ссылка);
				КонецЕсли;
			Исключение
				ЗаписьЖурналаРегистрации("Проведение Открытия раздела счета МХ", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
				ВызватьИсключение ОписаниеОшибки;				
			КонецПопытки;
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Для создания поручения на открытие раздела счета МХ должны быть заполнены:
																|Счет депо МХ и Номер раздела счета депо МХ", Отказ);		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПоручениеНаЗакрытиеРазделаСчетаМХ(Отказ)
	
	Если ЗначениеЗаполнено(СчетДепоМХ) И ЗначениеЗаполнено(РазделСчетаДепоМХ) Тогда
		
		// Если активный раздел счета депо общий (т.е. относится к нескольким разным пассивным разделам),
		// то такой активный раздел не закрывать
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РазделыСчетаДепо.Ссылка) КАК КоличествоСсылок
			|ИЗ
			|	Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
			|ГДЕ
			|	РазделыСчетаДепо.РазделСчетаДепоМХ = &РазделыСчетаДепоМХ
			|	И РазделыСчетаДепо.СтатусСчетаДепо = &СтатусСчетаДепо
			|	И РазделыСчетаДепо.Ссылка <> &РазделыСчетаДепо";
		
		Запрос.УстановитьПараметр("РазделыСчетаДепоМХ", РазделСчетаДепоМХ); 
		Запрос.УстановитьПараметр("СтатусСчетаДепо", Перечисления.СтатусыСчетовДепо.Открыт);
		Запрос.УстановитьПараметр("РазделыСчетаДепо", РазделСчетаДепо);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			
			Если Выборка.КоличествоСсылок = 0 Тогда 
		
				ДокЗакрытияРазделаМХ = Документы.Поручение.НайтиПоРеквизиту("ДокументОснование", Ссылка);
				Если ДокЗакрытияРазделаМХ = Документы.Поручение.ПустаяСсылка() Тогда
					
					ДокЗакрытияРазделаМХ = Документы.Поручение.СоздатьДокумент();
					ДокЗакрытияРазделаМХ.Дата					= Дата;
					ДокЗакрытияРазделаМХ.ДокументОснование		= Ссылка;
					ДокЗакрытияРазделаМХ.ЗакрытьВМХ				= Истина;
					ДокЗакрытияРазделаМХ.ВидОперацииД			= Справочники.ВидыОпераций.ЗакрытиеРазделаСчетаДепо;
					ДокЗакрытияРазделаМХ.Инициатор				= СчетДепоМХ.ВладелецСчетаДепоМХ;
					ДокЗакрытияРазделаМХ.Депонент				= СчетДепоМХ.Владелец;
					ДокЗакрытияРазделаМХ.СчетДепо				= СчетДепоМХ;
					ДокЗакрытияРазделаМХ.ТипРазделаСчетаДЕПО	= ТипРазделаСчетаДЕПО;
					ДокЗакрытияРазделаМХ.РазделСчетаДепоМХ		= РазделСчетаДепоМХ.Код;
					
					Попытка
						ДокЗакрытияРазделаМХ.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						ЗаписьЖурналаРегистрации("Проведение Закрытия раздела счета МХ", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
						ИнформацияОбОшибке = ИнформацияОбОшибке();
						ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
						ВызватьИсключение ОписаниеОшибки;				
					КонецПопытки;
				КонецЕсли;	
					
			Иначе 
				ОбщегоНазначения.СообщитьОбОшибке("Активный раздел не может быть закрыт, т.к. по нему есть активные пассивные разделы", Отказ);	
			КонецЕсли;
		КонецЕсли;	
		
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Для создания поручения на закрытие раздела счета МХ должны быть заполнены:
																|Счет депо МХ и Раздел счета депо МХ", Отказ);		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПорученияНаЗакрытиеРазделовСчета(Отказ)
	
	Если ЗначениеЗаполнено(СчетДепо) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РазделыСчетаДепо.Ссылка КАК РазделСчетаДепо,
			|	РазделыСчетаДепо.Владелец.Владелец КАК Депонент,
			|	РазделыСчетаДепоМХ.Ссылка КАК РазделСчетаДепоМХ,
			|	РазделыСчетаДепо.ТипРазделаСчетаДЕПО КАК ТипРазделаСчетаДЕПО,
			|	Поручение.Ссылка КАК Поручение,
			|	РазделыСчетаДепоМХ.Владелец КАК СчетДепоМХ
			|ПОМЕСТИТЬ ВТПредварительноНаЗакрытие
			|ИЗ
			|	Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепоМХ КАК РазделыСчетаДепоМХ
			|		ПО РазделыСчетаДепо.РазделСчетаДепоМХ = РазделыСчетаДепоМХ.Ссылка
			|			И (РазделыСчетаДепоМХ.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Открыт))
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручение
			|		ПО РазделыСчетаДепо.Владелец = Поручение.СчетДепо
			|			И РазделыСчетаДепо.Ссылка = Поручение.РазделСчетаДепо
			|			И (Поручение.ДокументОснование = &ДокументОснование)
			|			И (Поручение.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ЗакрытиеРазделаСчетаДепо))
			|ГДЕ
			|	РазделыСчетаДепо.Владелец = &СчетДепо
			|	И РазделыСчетаДепо.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Открыт)
			|	И Поручение.Ссылка ЕСТЬ NULL
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РазделыСчетаДепо.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РазделыСчетаДепо.Ссылка) КАК КоличествоСсылок
			|ПОМЕСТИТЬ ВТСчетчикИспользованияРазделаМХ
			|ИЗ
			|	Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
			|ГДЕ
			|	РазделыСчетаДепо.РазделСчетаДепоМХ <> ЗНАЧЕНИЕ(Справочник.РазделыСчетаДепоМХ.ПустаяСсылка)
			|	И РазделыСчетаДепо.РазделСчетаДепоМХ В
			|			(ВЫБРАТЬ
			|				ВТПредварительноНаЗакрытие.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ
			|			ИЗ
			|				ВТПредварительноНаЗакрытие КАК ВТПредварительноНаЗакрытие)
			|	И РазделыСчетаДепо.РазделСчетаДепоМХ.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Открыт)
			|
			|СГРУППИРОВАТЬ ПО
			|	РазделыСчетаДепо.РазделСчетаДепоМХ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТПредварительноНаЗакрытие.РазделСчетаДепо КАК РазделСчетаДепо,
			|	ВТПредварительноНаЗакрытие.Депонент КАК Депонент,
			|	ВЫБОР
			|		КОГДА ВТСчетчикИспользованияРазделаМХ.КоличествоСсылок = 1
			|			ТОГДА ВТПредварительноНаЗакрытие.РазделСчетаДепоМХ
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РазделыСчетаДепоМХ.ПустаяСсылка)
			|	КОНЕЦ КАК РазделСчетаДепоМХ,
			|	ВТПредварительноНаЗакрытие.ТипРазделаСчетаДЕПО КАК ТипРазделаСчетаДЕПО,
			|	ВТПредварительноНаЗакрытие.Поручение КАК Поручение,
			|	ВЫБОР
			|		КОГДА ВТСчетчикИспользованияРазделаМХ.КоличествоСсылок = 1
			|			ТОГДА ВТПредварительноНаЗакрытие.СчетДепоМХ
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РазделыСчетаДепоМХ.ПустаяСсылка)
			|	КОНЕЦ КАК СчетДепоМХ
			|ИЗ
			|	ВТПредварительноНаЗакрытие КАК ВТПредварительноНаЗакрытие
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСчетчикИспользованияРазделаМХ КАК ВТСчетчикИспользованияРазделаМХ
			|		ПО ВТПредварительноНаЗакрытие.РазделСчетаДепоМХ = ВТСчетчикИспользованияРазделаМХ.РазделСчетаДепоМХ";
		
		Запрос.УстановитьПараметр("ДокументОснование", Ссылка); 		
		Запрос.УстановитьПараметр("СчетДепо", СчетДепо);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			ДокЗакрытияРаздела = Документы.Поручение.СоздатьДокумент();
			ДокЗакрытияРаздела.Дата					= Дата;
			ДокЗакрытияРаздела.ДокументОснование	= Ссылка;  			
			ДокЗакрытияРаздела.ВидОперацииД			= Справочники.ВидыОпераций.ЗакрытиеРазделаСчетаДепо;
			ДокЗакрытияРаздела.Инициатор			= Константы.ОрганизацияПоУмолчанию.Получить();
			ДокЗакрытияРаздела.СчетДепо				= СчетДепо;
			ДокЗакрытияРаздела.Депонент				= Выборка.Депонент;
			ДокЗакрытияРаздела.РазделСчетаДепо		= Выборка.РазделСчетаДепо;
			ДокЗакрытияРаздела.ТипРазделаСчетаДЕПО	= Выборка.ТипРазделаСчетаДЕПО;
			
			Если ЗначениеЗаполнено(Выборка.СчетДепоМХ) И ЗначениеЗаполнено(Выборка.РазделСчетаДепоМХ) Тогда 
				ДокЗакрытияРаздела.ЗакрытьВМХ	= Истина;
				ДокЗакрытияРаздела.СчетДепоМХ	= Выборка.СчетДепоМХ;
			    ДокЗакрытияРаздела.РазделСчетаДепоМХ	= Выборка.РазделСчетаДепоМХ;
			КонецЕсли;	
			
			ДанныеПоОстаткам = ДокЗакрытияРаздела.ОстаткиЦБПоРазделамСчетовДепоДокумента();
			Если ДанныеПоОстаткам.ЕстьОстаткиЦБ Тогда 
				РежимЗаписи = РежимЗаписиДокумента.Запись;
				Для Каждого СтруктОстатки Из ДанныеПоОстаткам.МассивОстатки Цикл 
					Сообщить(	"По закрываемому разделу счета есть не нулевые остатки:
								| - Счет ДЕПО МХ: "+СтруктОстатки.СчетДепоМХ+";
								| - Раздел счета ДЕПО МХ: "+СтруктОстатки.РазделСчетаДепоМХ+";
								| - Счет ДЕПО: "+СтруктОстатки.СчетДепо+";
								| - Раздел счета ДЕПО: "+СтруктОстатки.РазделСчетаДепо+";
								| - Ценная бумага: "+СтруктОстатки.ЦБ+";
								| - Остаток: "+СтруктОстатки.КоличествоОстаток+".");
				КонецЦикла;
			Иначе 
				РежимЗаписи = РежимЗаписиДокумента.Проведение;
			КонецЕсли;
			
			Попытка
				ДокЗакрытияРаздела.ДополнительныеСвойства.Вставить("ЭтоЗакрытиеСчетаДепо",Истина);
				ДокЗакрытияРаздела.Записать(РежимЗаписи);
			Исключение
				ЗаписьЖурналаРегистрации("Проведение Закрытия раздела счета", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
				ВызватьИсключение ОписаниеОшибки;				
			КонецПопытки;
			
		КонецЦикла;

	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Для создания поручения на закрытие раздела счета должны быть заполнены:
																|Счет депо", Отказ);		
	КонецЕсли;
	
КонецПроцедуры

Функция ОстаткиЦБПоРазделамСчетовДепоДокумента() Экспорт 
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
		|	ОстаткиЦБОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
		|	ОстаткиЦБОстатки.ЦБ КАК ЦБ,
		|	ОстаткиЦБОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиЦБОстатки.СчетДепоМХ КАК СчетДепоМХ,
		|	ОстаткиЦБОстатки.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ
		|ИЗ
		|	РегистрНакопления.ОстаткиЦБ.Остатки(
		|			&Период,
		|			    СчетДепо = &СчетДепо
		|				И РазделСчетаДепо = &РазделСчетаДепо
		|				//УСЛОВИЕ_СЧЕТ_ДЕПО_МХ
		|				//УСЛОВИЕ_РАЗДЕЛ_СЧЕТА_ДЕПО_МХ
		|				) КАК ОстаткиЦБОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОстаткиЦБОстатки.СчетДепо.Владелец.Наименование,
		|	ОстаткиЦБОстатки.СчетДепо,
		|	ОстаткиЦБОстатки.РазделСчетаДепо");
	
	    // Текущая дата - чтобы учитывать актуальный остаток ЦБ
		Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДатаСеанса())); 		
		Запрос.УстановитьПараметр("СчетДепо", СчетДепо);
		Запрос.УстановитьПараметр("РазделСчетаДепо", РазделСчетаДепо);
		
		Если ЗакрытьВМХ Тогда 
			
			Если ЗначениеЗаполнено(СчетДепоМХ) Тогда 
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УСЛОВИЕ_СЧЕТ_ДЕПО_МХ","И СчетДепоМХ = &СчетДепоМХ");
				Запрос.УстановитьПараметр("СчетДепоМХ", СчетДепоМХ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РазделСчетаДепоМХ) Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УСЛОВИЕ_РАЗДЕЛ_СЧЕТА_ДЕПО_МХ","И РазделСчетаДепоМХ = &РазделСчетаДепоМХ");
			    Запрос.УстановитьПараметр("РазделСчетаДепоМХ", РазделСчетаДепоМХ);
			КонецЕсли;
			
		КонецЕсли;
		
		РезультатОстатки = Запрос.Выполнить();
		Результат = Новый Структура("ЕстьОстаткиЦБ,МассивОстатки", Ложь, Новый Массив);
		
		Если Не РезультатОстатки.Пустой() Тогда 
			
			Результат.ЕстьОстаткиЦБ = Истина;
			ВыборкаОстатки = РезультатОстатки.Выбрать();
			
			МассивОстатки = Новый Массив;
			Пока ВыборкаОстатки.Следующий() Цикл
				
				СтруктОстатки = Новый Структура;
				СтруктОстатки.Вставить("СчетДепоМХ",ВыборкаОстатки.СчетДепоМХ);
				СтруктОстатки.Вставить("РазделСчетаДепоМХ",ВыборкаОстатки.РазделСчетаДепоМХ);
				СтруктОстатки.Вставить("СчетДепо",ВыборкаОстатки.СчетДепо);
				СтруктОстатки.Вставить("РазделСчетаДепо",ВыборкаОстатки.РазделСчетаДепо);
				СтруктОстатки.Вставить("ЦБ",ВыборкаОстатки.ЦБ);
				СтруктОстатки.Вставить("КоличествоОстаток",ВыборкаОстатки.КоличествоОстаток);
				
				Результат.МассивОстатки.Добавить(СтруктОстатки);
				
			КонецЦикла;
			
		КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Процедура СоздатьДокументРазблокировкиЦБ(Отказ)
	
	Если Не ОтменяемоеПоручение.ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоручениеБлокировкиЦБ.Ссылка КАК ПоручениеБлокировкиЦБ
	|ИЗ
	|	Документ.Поручение КАК ПоручениеБлокировкиЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК ПоручениеРазблокировкиЦБ
	|		ПО (ПоручениеРазблокировкиЦБ.ДокументОснование = &ПоручениеОтмены)
	|			И (ПоручениеРазблокировкиЦБ.ВидОперацииД = &Перевод)
	|ГДЕ
	|	ПоручениеБлокировкиЦБ.ДокументОснование = &ОтменяемоеПоручение
	|	И ПоручениеБлокировкиЦБ.ВидОперацииД = &Перевод
	|	И ПоручениеРазблокировкиЦБ.Ссылка ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("ОтменяемоеПоручение"	, ОтменяемоеПоручение);
	Запрос.УстановитьПараметр("ПоручениеОтмены"		, Ссылка);
	Запрос.УстановитьПараметр("Перевод", Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект = Выборка.ПоручениеБлокировкиЦБ.Скопировать();
		РазделСчетаДепо = ДокументОбъект.РазделСчетаДепо;
		ДокументОбъект.РазделСчетаДепо = ДокументОбъект.РазделСчетаДепоКонтрагента;
		ДокументОбъект.РазделСчетаДепоКонтрагента = РазделСчетаДепо;
		ДокументОбъект.ДокументОснование = Ссылка;
		ДокументОбъект.Дата = ДатаИсполненияПоручения + 1;
		ДокументОбъект.ДатаИсполненияПоручения = ДокументОбъект.Дата;
		ДокументОбъект.ДатаИсполненияПорученияВДепозитарииМХ = ДокументОбъект.Дата;
		ДокументОбъект.ДатаИсполненияПорученияВМестеРасчетов = ДокументОбъект.Дата;
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ТекстСообщения = "Создано поручение на перевод ЦБ с блокировочного раздела, номер документа " + ДокументОбъект.Номер;
		Исключение
			Отказ = Истина;
			ТекстСообщения = "Не удалось провести поручение на перевод ЦБ с блокировочного раздела";
		КонецПопытки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

Функция НеобходимоФормироватьУведомлениеОИсполненииОперацийСЦБ(РежимЗаписи)
	
	СнятиеСДепонирования = Справочники.ВидыОпераций.СнятиеСДепонирования;
	ПереводМеждуРазделамиСчетаДепо = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо;
	БлокированоРасчеты = Перечисления.ТипыРазделовСчетовДЕПО.БлокированоРасчеты;
	Перемещение = Справочники.ВидыОпераций.Перемещение;
	
	КодыВидовОперацийЦБ = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("2163.КодыВидовОперацийЦБДляУведомления");
	МассивКодовВидовОперацийЦБДляУведомления = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КодыВидовОперацийЦБ);
	
	Если ТипЗнч(ВидОперацииД) = Тип("СправочникСсылка.ВидыОпераций") Тогда
		Если НЕ МассивКодовВидовОперацийЦБДляУведомления.Найти(Строка(ВидОперацииД.Код)) <> Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если (ВидОперацииД = СнятиеСДепонирования И РазделСчетаДепо.ТипРазделаСчетаДЕПО <> БлокированоРасчеты)
		Или (ВидОперацииД = ПереводМеждуРазделамиСчетаДепо И РазделСчетаДепоКонтрагента.ТипРазделаСчетаДЕПО <> БлокированоРасчеты)
		Или (ВидОперацииД = Перемещение И РазделСчетаДепоКонтрагента.ТипРазделаСчетаДЕПО <> БлокированоРасчеты)
		Или ВидОперацииД = Справочники.ВидыОпераций.Перевод Или ВидОперацииД = Справочники.ВидыОпераций.Депонирование Тогда
		ЭтоТорговаяОперация = ЗначениеЗаполнено(БанковскийСчет) И (СуммаСделки <> 0 Или ЦенныеБумагиСписываемые.Итог("Сумма") <> 0);
		Если Не ЭтоТорговаяОперация И РежимЗаписи = РежимЗаписиДокумента.Проведение И ЗначениеЗаполнено(ДатаИсполненияПоручения)
			И (РегистрыСведений.СтатусыПоручений.СтатусПоручения(Ссылка) <> Перечисления.СтатусыПоручений.Исполнено Или Ссылка = Документы.Поручение.ПустаяСсылка()) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

Функция НеобходимоУдалитьУведомлениеОИсполненииОперацийСЦБ(РежимЗаписи)
	
	Если Ссылка = Документы.Поручение.ПустаяСсылка() Тогда
		Возврат Ложь;
	КонецЕсли;
	Если РегистрыСведений.СтатусыПоручений.СтатусПоручения(Ссылка) = Перечисления.СтатусыПоручений.Исполнено И 
		(РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Или Не ЗначениеЗаполнено(ДатаИсполненияПоручения)) Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

Процедура КонтрольКвалИнвестора(РежимЗаписи, Отказ)
	ЭтоПроведение = (РежимЗаписи = РежимЗаписиДокумента.Проведение) Или (Проведен И РежимЗаписи = РежимЗаписиДокумента.Запись);
	
	Если ВидОперацииД <> Справочники.ВидыОпераций.Депонирование Или Не ЭтоПроведение Тогда
		Возврат;
	КонецЕсли;
	
	Если КвалифицированныйИнвесторПо11_8_пзн Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦенныеБумаги.ВидЦББанкаРоссии.ВидИнструмента КАК ВидИнструмента,
	|	ЦенныеБумаги.ДляКвалифицированныхИнвесторов КАК ДляКвалифицированныхИнвесторов,
	|	ЦенныеБумаги.Представление КАК ЦБ,
	|	ЦенныеБумаги.ISIN КАК ISIN
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|ГДЕ
	|	ЦенныеБумаги.Ссылка В(&ЦБДляПроверки)
	|	И ЦенныеБумаги.ДляКвалифицированныхИнвесторов";
	
	Запрос.УстановитьПараметр("ЦБДляПроверки", ЦенныеБумагиСписываемые.ВыгрузитьКолонку("ЦеннаяБумага"));
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДепонента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Депонент, "ЮридическиеФизическиеЛица, Код");
	ЮрФизЛицо = ДанныеДепонента.ЮридическиеФизическиеЛица;
	НомерДоговораДепонента = СокрЛП(ДанныеДепонента.Код);
	ЭтоКвалифицированныйИнвестор = РегистрыСведений.РеестрКвалифицированныхИнвесторовПоЗакону.ЕстьКИПОЗакону(ЮрФизЛицо, ТекущаяДатаСеанса());
	Если ЭтоКвалифицированныйИнвестор Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаЦБ = РезультатЗапроса.Выбрать();
	Пока ВыборкаЦБ.Следующий() Цикл
		ЕстьКвалификацияИнвестора = РегистрыСведений.РеестрКвалифицированныхИнвесторовРОФР.ЕстьКвалификацияИнвестора(
		ЮрФизЛицо, ВыборкаЦБ.ВидИнструмента, ТекущаяДатаСеанса());
		Если Не ЕстьКвалификацияИнвестора Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Проведение поручения %1 невозможно, т.к. клиент %2 (договор %3) 
			|не является Квалифицированным инвестором, а ЦБ %4 (ISIN %5) предназначена для квалифицированных инвесторов",
			Ссылка, Депонент, НомерДоговораДепонента, ВыборкаЦБ.ЦБ, ВыборкаЦБ.ISIN);
			ТемаПисьма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Проведение поручения %1 невозможно", Ссылка);
			Если ДополнительныеСвойства.Свойство("ВведеноИнтерактивно") и ДополнительныеСвойства.ВведеноИнтерактивно Тогда
				Отказ = (РежимЗаписи = РежимЗаписиДокумента.Проведение);
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения);
			Иначе
				РежимЗаписи = РежимЗаписиДокумента.Запись;
				СформироватьУведомлениеВCustody(ТемаПисьма,ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьУведомлениеВCustody(ТемаПисьма, ТекстСообщения)
	    
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОНеПройденномКонтролеКвалИнвестораПриИсполненииПоручений;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	Если Не ЗначениеЗаполнено(НастройкиОбмена) Тогда
		ОписаниеОшибки = "Не заполнены параметры внешнего источника рассылки'"+ВнешнийИсточник+"'";
		ЗаписьЖурналаРегистрации("Поручение клиента. Проверка на квал инвестора",
									УровеньЖурналаРегистрации.Ошибка,
									,
									,
									ОписаниеОшибки);
        Возврат;                            
       
	КонецЕсли;
	
	ТекстПисьма	= ТекстСообщения;
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена"		, НастройкиОбмена);
	ПараметрыУведомления.Вставить("ТемаПисьма"			, ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма"			, ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма"		, ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Кодировка"			, "UTF-8");
	ПараметрыУведомления.Вставить("Важность"			, ВажностьИнтернетПочтовогоСообщения.Обычная);
    
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
	
КонецПроцедуры

Функция ЕстьСтрокиСПовторяющейсяЦБ()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦенныеБумагиСписываемые.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЦенныеБумагиСписываемые.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ЦенныеБумагиСписываемые
	|ИЗ
	|	&ЦенныеБумагиСписываемые КАК ЦенныеБумагиСписываемые
	|ГДЕ
	|	ЦенныеБумагиСписываемые.ЦеннаяБумага <> &ПустаяЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумагиСписываемые.ЦеннаяБумага КАК ЦеннаяБумага,
	|	КОЛИЧЕСТВО(*) КАК КоличествоСтрок
	|ИЗ
	|	ЦенныеБумагиСписываемые КАК ЦенныеБумагиСписываемые
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумагиСписываемые.ЦеннаяБумага
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) > 1";
	
	Запрос.УстановитьПараметр("ЦенныеБумагиСписываемые", ЦенныеБумагиСписываемые.Выгрузить(, "НомерСтроки, ЦеннаяБумага"));
	Запрос.УстановитьПараметр("ПустаяЦеннаяБумага", Справочники.ЦенныеБумаги.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПовторяющиесяЦБ = РезультатЗапроса.Выбрать();
	ТекстОшибки = "В табличной части имеются строки с повторяющейся ЦБ: ";
	Пока ПовторяющиесяЦБ.Следующий() Цикл
		ТекстОшибки = ТекстОшибки + ПовторяющиесяЦБ.ЦеннаяБумага + "; ";
	КонецЦикла;
	ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки);
	Возврат Истина;
КонецФункции
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОПЕРАЦИЙ НКД И ПОГАШЕНИЙ (ПОЛНОЕ + ЧАСТИЧНОЕ)

Процедура ПересчетПогашенияПоСуммеИПД()
	КоличествоЦБ = ЦенныеБумагиСписываемые.Итог("Количество");
	
	Если КоличествоЦБ = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Итоговое количество для пересчета меньше или рано 0! Пересчет 'сумм' невозможен!");
		Возврат;
	КонецЕсли;
	
	СуммаИПДНаЕд = СуммаИПД / КоличествоЦБ;
	
	Для Каждого Строка ИЗ ЦенныеБумагиСписываемые Цикл
		Строка.Сумма = Строка.Количество * СуммаИПДНаЕд;
	КонецЦикла;	
КонецПроцедуры

// Выполняет запрос для получения облигаций и купонов, которые необходимо погасить 
// на дату документа. Вызывается в документе ПогашениеКупона
//
// Параметры
//  Ссылка       - ссылка на документ
//
// Возвращаемое значение:
//   результат запроса
//
Функция ВыполнитьЗапросДляПодбораОблигацийКупоновДляПогашения(ТолькоКупонные = Истина, СчетДепоМХДокумента = Неопределено)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОстаткиЦБОстатки.СчетДепо.Владелец КАК Депонент,
	|	ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБОстатки.ЦБ КАК ЦеннаяБумага,
	|	ОстаткиЦБОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБОстатки.СчетДепоМХ КАК СчетДепоМХ,
	|	ОстаткиЦБОстатки.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ОстаткиЦБОстатки.СтатусЦБ КАК СтатусЦБ,
	|	ОстаткиЦБОстатки.КоличествоОстаток КАК Количество,
	|	ЕСТЬNULL(НоминалЦБСрезПоследних.Сумма, 0) КАК Номинал,
	|	ЕСТЬNULL(КотировкиСрезПоследних.Nkd, 0) КАК НКД,
	|	ОстаткиЦБОстатки.ЦБ.ISIN КАК ISIN,
	|	ОстаткиЦБОстатки.ЦБ.НомерРегистрации КАК НомерРегистрации,
	|	ОстаткиЦБОстатки.РазделСчетаДепо.ТипРазделаСчетаДЕПО КАК ТипРазделаСчетаДЕПО
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&Дата,
	|			ЦБ = &ЦБ
	|				И &ОтборПоКупоннымОблигациям
	|				И &ОтборПоСчетуДепоМХ) КАК ОстаткиЦБОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ.СрезПоследних(&Дата, ) КАК НоминалЦБСрезПоследних
	|		ПО ОстаткиЦБОстатки.ЦБ = НоминалЦБСрезПоследних.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Котировки.СрезПоследних(
	|				&Дата,
	|				Биржа = &Биржа
	|					И РежимТоргов = &РежимТоргов) КАК КотировкиСрезПоследних
	|		ПО ОстаткиЦБОстатки.ЦБ = КотировкиСрезПоследних.ЦеннаяБумага");
	
	Если ЗначениеЗаполнено(ДатаФиксации) Тогда
		Если ФиксацияНаУтро = ИСТИНА Тогда
			СекундВЧасе = 60 * 60;
			ДатаФиксацииСУчетомВремени = НачалоДня(ДатаФиксации) + (СекундВЧасе * 7);
		Иначе
			ДатаФиксацииСУчетомВремени = КонецДня(ДатаФиксации);
		Конецесли;
		Запрос.УстановитьПараметр("Дата", Новый Граница(ДатаФиксацииСУчетомВремени, ВидГраницы.Включая));
	Иначе
		Запрос.УстановитьПараметр("Дата", МоментВремени());
	КонецЕсли;
	Запрос.УстановитьПараметр("ЦБ", ЦБ);
	
	СтрокаУсловия = ?(ТолькоКупонные, "ЦБ.КупоннаяОблигация", "ИСТИНА");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоКупоннымОблигациям", СтрокаУсловия);
	
	Запрос.УстановитьПараметр("РежимТоргов", Справочники.РежимыТоргов.Рыночный);
	Если БанковскийСчет.ВалютаДенежныхСредств = ВалютаРегламентированногоУчета Тогда
		Запрос.УстановитьПараметр("Биржа", Справочники.Биржи.MICEX);
	Иначе
		Запрос.УстановитьПараметр("Биржа", Справочники.Биржи.Внебирж);
	КонецЕсли;

	Запрос.УстановитьПараметр("СчетДепоМХ", СчетДепоМХДокумента);
	СтрокаУсловия = ?(ЗначениеЗаполнено(СчетДепоМХДокумента), "СчетДепоМХ = &СчетДепоМХ", "ИСТИНА");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСчетуДепоМХ", СтрокаУсловия);
	
	Возврат Запрос.Выполнить();
КонецФункции

// Выполняет автоматическое заполнение табличной части документа, облигациями,
// которые (или купоны которых) необходимо погасить.
//
// Параметры
//  Ссылка      - ДокументСсылка.ПогашениеКупона - Ссылка на документ
Процедура ЗаполнитьПогашаемыеОблигацииКупоны(ТолькоКупонные, СчетДепоМХДокумента = Неопределено) Экспорт
	Если (ВидОперацииД = Справочники.ВидыОпераций.НачислениеДивидендов
		ИЛИ ВидОперацииД = Справочники.ВидыОпераций.НачислениеДоходаПрочие)
		И НЕ ЗначениеЗаполнено(ДатаФиксации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнена 'Дата фиксации' для 'Начисления дивидендов'!!!");
		Возврат;
	КонецЕсли;
	
	Результат = ВыполнитьЗапросДляПодбораОблигацийКупоновДляПогашения(ТолькоКупонные, СчетДепоМХДокумента);
	
	ЗаполнитьПогашаемыеОблигацииКупоныПоВидуОперации(Результат);
	ОповеститьОНаличииОбособленныхСчетов(Результат);
	
	ВыплатаВВалютеРеглУчета = Валюта = ВалютаРегламентированногоУчета;
	РеквизитыЦБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЦБ, "ВидЦБ, ВидЦББанкаРоссии");
	РасчетПоИностраннойЦБ = Справочники.ВидыЦББанкаРоссии.ЭтоВидИностраннойЦБ(РеквизитыЦБ.ВидЦББанкаРоссии);
	НачислитьНДФЛНаИностранныеДивиденды = РасчетПоИностраннойЦБ
		И Справочники.ВидыОпераций.ЭтоВыплатаДоходаПоАкциямИлиИнымЦБ(ВидОперацииД);
	Если ВидОперацииД = Справочники.ВидыОпераций.ПогашениеНКД И Дата >= Константы.ДатаНачалаНачисленияНДФЛНаГособлигации.Получить() Тогда 
		НачислятьНалог = Не Справочники.ВидыЦББанкаРоссии.ЭтоВидИностраннойЦБ(РеквизитыЦБ.ВидЦББанкаРоссии);
	Иначе 
		НачислятьНалог = (ВыплатаВВалютеРеглУчета И НЕ РеквизитыЦБ.ВидЦБ = Перечисления.ВидыОблигаций.Государственная
			Или НачислитьНДФЛНаИностранныеДивиденды);
	КонецЕсли;
						
	Если НачислятьНалог Тогда
		РассчитатьИЗаполнитьНалогиПоВыплатеДохода();
	КонецЕсли;
	
	ЗаполнитьБанковскиеСчета();
	
	Если ТипЗнч(ВидОперацииД) = Тип("СправочникСсылка.ВидыОпераций")
		И ВидОперацииД.ВыплатаДоходаВДенежнойФорме
		И Документы.НачисленныйНалог.ИспользоватьРасчетНДФЛПоПрогрессивнойШкале(Дата) Тогда
		
		Для Каждого Строка Из ЦенныеБумагиСписываемые Цикл
			Строка.ПлановаяДатаРасчетов = ПланируемаяДатаРасчетов;
		КонецЦикла;
		Документы.Поручение.ЗаполнитьВалютуНалога(Ссылка, ЦенныеБумагиСписываемые);
		Документы.Поручение.ЗаполнитьСуммуНалога(Ссылка, ЦенныеБумагиСписываемые);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПогашаемыеОблигацииКупоныПоВидуОперации(Результат)
	
	Если ВидОперацииД = Справочники.ВидыОпераций.ПогашениеНКД Или ВидОперацииД = Справочники.ВидыОпераций.Выкуп Тогда
		Выборка = Результат.Выбрать();
		ИнформацияОКупоне = ЦБ.Купоны.Найти(ДатаФиксации, "ДатаФиксацииСписка");
		Пока Выборка.Следующий() Цикл
			стрЦБ = ЦенныеБумагиСписываемые.Добавить();
			ЗаполнитьЗначенияСвойств(стрЦБ, Выборка);
			Если ИнформацияОКупоне <> Неопределено Тогда
				стрЦБ.Сумма = ОпределитьПолученныйНКД(Выборка, ИнформацияОКупоне);
			КонецЕсли;
		КонецЦикла;
		ОбщееКоличествоЦБ = ЦенныеБумагиСписываемые.Итог("Количество");
		РаспределяемСуммуИПДПропорциональноКоличествуЦБ = Не РасчетнымМетодом И ЗначениеЗаполнено(СуммаИПД) И ОбщееКоличествоЦБ <> 0;
		Если РаспределяемСуммуИПДПропорциональноКоличествуЦБ Тогда
			РаспределитьСуммуВыплатыПоСтрокамПропорциональноКоличествуЦБ(ОбщееКоличествоЦБ);
		Иначе
			СуммаИПД = ЦенныеБумагиСписываемые.Итог("Сумма");
		КонецЕсли;
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ПогашениеЦБПолное И Не ЗначениеЗаполнено(СуммаИПД) Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ЦенныеБумагиСписываемые.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			НоваяСтрока.Сумма = НоваяСтрока.Количество * Выборка.Номинал;
		КонецЦикла;
		СуммаИПД = ЦенныеБумагиСписываемые.Итог("Сумма");
	Иначе
		ЦенныеБумагиСписываемые.Загрузить(Результат.Выгрузить());
		ПересчетПогашенияПоСуммеИПД();
	КонецЕсли;
	
КонецПроцедуры

// Определение полученного НКД; Если установлен флаг рассчитывать, то рассчитываем НКД исходя из данных в
// таблице купонов для бумаги, в противном случае берем из котировок.
//
// Параметры:
//  Выборка				- ВыборкаИзРезультатаЗапроса - Выборка из запроса
//  ИнформацияОКупоне	- СтрокаТабличнойЧасти - Строка табличной части купоны справочника ЦенныеБумаги
//							справочника ЦенныеБумаги
//
// Возвращаемое значение:
//  Число - Рассчитанная сумма
Функция ОпределитьПолученныйНКД(Выборка, ИнформацияОКупоне)
	// Расчет суммы погашения
	Если РасчетнымМетодом Тогда
		Если ИнформацияОКупоне.Сумма = 0 Тогда
			Если ИнформацияОКупоне.Купон = 0 Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Неверно заполнен текущий купонный период для " + Выборка.ЦБКод + ".
				| Заполнение купонных периодов осуществляется в справочнике ""Ценные бумаги"".
				| Документ проведен не будет!");
				Возврат 0;
			Иначе
				Сто = 100;
				ДлинаПериода = (ИнформацияОКупоне.ДатаПогашения - ИнформацияОКупоне.ДатаВыпуска) / ОбщегоНазначенияПовтИсп.СекундВСутках() + 1;
				СуммаТЧ = Окр(ИнформацияОКупоне.Купон / ИнформацияОКупоне.СрокОбращения * ДлинаПериода * Выборка.Номинал / Сто, 2);
			КонецЕсли;
		Иначе
			СуммаТЧ = ИнформацияОКупоне.Сумма;
		КонецЕсли;
	ИначеЕсли Не ЗначениеЗаполнено(СуммаИПД) Тогда
		Если Выборка.НКД = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("НКД по " + Выборка.ЦеннаяБумага + " равно 0.");
		КонецЕсли;
		СуммаТЧ = Окр(Выборка.НКД, 2);
	Иначе
		СуммаТЧ = 0;
	КонецЕсли;
	
	СуммаТЧ = СуммаТЧ * Выборка.Количество;
	
	Возврат СуммаТЧ;
КонецФункции

Процедура РаспределитьСуммуВыплатыПоСтрокамПропорциональноКоличествуЦБ(ОбщееКоличествоЦБ)
	СуммаИПДНаЕд = СуммаИПД / ОбщееКоличествоЦБ;
	Для Каждого Строка Из ЦенныеБумагиСписываемые Цикл
		Строка.Сумма = Строка.Количество * СуммаИПДНаЕд;
	КонецЦикла;
КонецПроцедуры

Процедура ОповеститьОНаличииОбособленныхСчетов(Результат)
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипРазделаСчетаДЕПО = Перечисления.ТипыРазделовСчетовДЕПО.БлокированоОбособленный Тогда
			
			ТекстОбособленныйСчет = "Поручение " + СокрЛП(Номер) + " от "
			+ Дата + " указан раздел с типом Блокировано (обособл.), Счет депо: " + СокрЛП(Выборка.СчетДепо)
			+ ", Раздел счета депо: " + СокрЛП(Выборка.РазделСчетаДепо)
			+ ?(ЗначениеЗаполнено(Выборка.ISIN), ", ISIN: " + Выборка.ISIN, "Регистрационный номер ЦБ: "
			+ Выборка.НомерРегистрации);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОбособленныйСчет);
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьБанковскиеСчета() Экспорт
	
	СчетаДляВыплатыДоходов			 = СчетаДляВыплатыДоходов(Дата, БанковскийСчет.ВалютаДенежныхСредств);
	РасчетныеКодыДляВыплатыДоходов	 = РасчетныеКодыДляВыплатыДоходов(Дата, БанковскийСчет.ВалютаДенежныхСредств);
	БрокерскиеСчета					 = БрокерскиеСчета(Дата, БанковскийСчет.ВалютаДенежныхСредств);
	
	Для Каждого Строка Из ЦенныеБумагиСписываемые Цикл
		
		ТекущийДепонент = Строка.СчетДепо.Владелец;
		
		НайденБанковскийСчет = НайденБанковскийСчетИзСчетовДляВыплатыДоходов(ТекущийДепонент, Строка, СчетаДляВыплатыДоходов);
		Если Не НайденБанковскийСчет Тогда
			НайденБанковскийСчет
				= НайденБанковскийСчетИзРасчетныхКодовДляВыплатыДоходовКлиентам(ТекущийДепонент, Строка, РасчетныеКодыДляВыплатыДоходов);
		КонецЕсли;
		Если Не НайденБанковскийСчет Тогда
			НайденБанковскийСчет = НайденБанковскийСчетИзБрокерскихСчетов(ТекущийДепонент, Строка, БрокерскиеСчета);
		КонецЕсли;
		
		Если НайденБанковскийСчет Тогда
			ПроверитьНеобходимостьНачисленияНалога(Строка);
		КонецЕсли;
		
		Строка.Комментарий = Документы.НачисленныйНалог.КомментарийОНалогеУдержанномВИностраннойЮрисдикции(
			Строка.СуммаНалогаВИностраннойЮрисдикции,
			Строка.ВалютаНалога,
			СтавкаИПДНалогаВИностраннойЮрисдикции);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СчетаДляВыплатыДоходов(Дата, Валюта)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетаСрезПоследних.Счет.Владелец КАК Депонент,
	|	МАКСИМУМ(СчетаСрезПоследних.Счет) КАК БанковскийСчет
	|ИЗ
	|	РегистрСведений.СчетаДляВыплатыДоходов.СрезПоследних(
	|			&ДатаСреза,
	|			Счет.ВалютаДенежныхСредств = &Валюта
	|				И ФлагАктивности) КАК СчетаСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетаСрезПоследних.Счет.Владелец";
	Запрос.УстановитьПараметр("ДатаСреза",	Дата);
	Запрос.УстановитьПараметр("Валюта",		Валюта);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция РасчетныеКодыДляВыплатыДоходов(Дата, Валюта)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетныеКоды.Клиент КАК Депонент,
	|	РасчетныеКоды.РасчетныйКод КАК РасчетныйКод
	|ИЗ
	|	РегистрСведений.РасчетныеКодыДляВыплатыДоходовКлиентам.СрезПоследних(&ДатаСреза, Валюта = &Валюта) КАК РасчетныеКоды";
	Запрос.УстановитьПараметр("ДатаСреза",	Дата);
	Запрос.УстановитьПараметр("Валюта",		Валюта);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция БрокерскиеСчета(Дата, Валюта)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Право.Клиент КАК Депонент,
	|	Право.Значение КАК ПравоПредоставлено
	|ПОМЕСТИТЬ втПравоИспользованияЦБКлиентов
	|ИЗ
	|	РегистрСведений.ПравоИспользованияЦБКлиентов.СрезПоследних(&ДатаСреза, ) КАК Право
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БС.Клиент КАК Депонент,
	|	БС.Счет КАК БанковскийСчет
	|ПОМЕСТИТЬ втБрокерскиеСчета
	|ИЗ
	|	РегистрСведений.БрокерскиеСчета.СрезПоследних(
	|			&ДатаСреза,
	|			Банк = &БанкНРД
	|				И ТипСчета = &ТипСпецБрокерский
	|				И Валюта = &Валюта) КАК БС
	|ГДЕ
	|	БС.ФлагАктивности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Депонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Право.Депонент КАК Депонент,
	|	Право.ПравоПредоставлено КАК ПравоПредоставлено
	|ИЗ
	|	втПравоИспользованияЦБКлиентов КАК Право
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БС.Депонент КАК Депонент,
	|	БС.БанковскийСчет КАК БанковскийСчет,
	|	ЕСТЬNULL(Права.ПравоПредоставлено, ЛОЖЬ) КАК ИспользованиеДС
	|ИЗ
	|	втБрокерскиеСчета КАК БС
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПравоИспользованияЦБКлиентов КАК Права
	|		ПО БС.Депонент = Права.Депонент";
	Запрос.УстановитьПараметр("ДатаСреза",			Дата);
	Запрос.УстановитьПараметр("БанкНРД",			Константы.РасчетныйБанк.Получить());
	Запрос.УстановитьПараметр("ТипСпецБрокерский",	Перечисления.ТипыНазначенияБанковскихСчетов.Брокерский);
	Запрос.УстановитьПараметр("Валюта",				Валюта);
	Запрос.УстановитьПараметр("ПустойДепонент",		Справочники.Контрагенты.ПустаяСсылка());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура;
	Результат.Вставить("Права",	РезультатЗапроса[2].Выгрузить());
	Результат.Вставить("БС",	РезультатЗапроса[3].Выгрузить());
	Возврат Результат;
КонецФункции

Процедура РассчитатьИЗаполнитьНалогиПоВыплатеДохода() Экспорт
	
	СтруктураНачисленияНалога = Документы.Поручение.СтруктураНачисленияНалогаПоВыплатеДохода(ЭтотОбъект);
	
	НужноНачислитьНДФЛНаЕврооблигацию = Документы.Поручение.НужноНачислитьНДФЛНаЕврооблигацию(СтруктураНачисленияНалога);
	Если НужноНачислитьНДФЛНаЕврооблигацию Тогда 
		СтруктураКурсаВалюты = ОбщегоНазначения.ПолучитьКурсВалюты(СтруктураНачисленияНалога.ВалютаНоминала, СтруктураНачисленияНалога.ДатаПогашения);
	КонецЕсли;
	
	ДатаНачалаИсключенияНерезидентовИзНачисленияНДФЛНаГособлигации = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ДатаНачалаИсключенияНерезидентовИзНачисленияНДФЛНаГособлигации");
	
	Для Каждого СтрокаДанных ИЗ ЦенныеБумагиСписываемые Цикл
		
		ДепонентСтроки			= СтрокаДанных.СчетДепо.Владелец;
		СтрокаДанных.Резидент	= ДанныеФизлиц.ЯвляетсяНалоговымРезидентом(Дата, ДепонентСтроки);
		
		Если СтрокаДанных.НДФЛУдержан Тогда
			Продолжить;
		КонецЕсли;
			
		Если ДепонентСтроки.Субброкер = Истина Тогда
			ДепонентСтроки = Новый Структура("ЮрФизЛицо, УправляющаяКомпания", СтрокаДанных.РазделСчетаДепо.Субклиент.ЮрФизЛицо, Ложь);
		КонецЕсли;
		
		НачислятьНалог 			= Документы.Поручение.ЯвляемсяНалоговымАгентомДляДепонента(ДепонентСтроки,
			СтруктураНачисленияНалога);
		
		НалогооблагаемаяБаза	= СтрокаДанных.Сумма;
		Если НужноНачислитьНДФЛНаЕврооблигацию Тогда 
			НалогооблагаемаяБазаВРуб = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(НалогооблагаемаяБаза, СтруктураНачисленияНалога.ВалютаНоминала,
				ВалютаРегламентированногоУчета, СтруктураКурсаВалюты.Курс, 1, СтруктураКурсаВалюты.Кратность, 1); 
		Иначе 
			НалогооблагаемаяБазаВРуб = НалогооблагаемаяБаза;
		КонецЕсли;
		Количество = СтрокаДанных.Количество; 
				
		Документы.Поручение.ЗаполнитьСтавкуИСуммуНалогаВСтруктуреНачисления(СтруктураНачисленияНалога,
			СтрокаДанных.Резидент, НалогооблагаемаяБазаВРуб, Количество, СтрокаДанных.СчетДепо, СтрокаДанных.РазделСчетаДепо); 		 		
		Если НачислятьНалог Тогда
			Если Документы.НачисленныйНалог.ИспользоватьРасчетНДФЛПоПрогрессивнойШкале(Дата) Тогда
				ИсключаяСвойства = "СуммаНалога";
			Иначе
				ИсключаяСвойства = Неопределено;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаДанных, СтруктураНачисленияНалога,, ИсключаяСвойства);
			
			Если Не СтрокаДанных.Резидент И Дата >= ДатаНачалаИсключенияНерезидентовИзНачисленияНДФЛНаГособлигации 
				И СтруктураНачисленияНалога.ЭтоГосОблигация Тогда 
				СтрокаДанных.НачислитьНалог = Ложь;
			КонецЕсли;
			
			Если Не НужноНачислитьНДФЛНаЕврооблигацию 
				И Не Документы.НачисленныйНалог.ИспользоватьРасчетНДФЛПоПрогрессивнойШкале(Дата) Тогда 
				СтрокаДанных.СуммаОсвобожденнаяОтНалога = СтрокаДанных.Сумма - НалогооблагаемаяБазаВРуб;
			КонецЕсли;
		Иначе
			ОчиститьНалогиВСтроке(СтрокаДанных);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ДИВИДЕНДОВ

Процедура СоздатьНачислениеНалога(ТекущиеДанныеСчетДепо = Неопределено) Экспорт
	
	ТаблицаНалогов = Документы.Поручение.ДанныеДляСозданияДокументовПоНалогам(Ссылка, ТекущиеДанныеСчетДепо);
	
	Если ТекущиеДанныеСчетДепо = Неопределено Тогда
		УдалитьЛишниеНачислениеНалога(ЦенныеБумагиСписываемые.ВыгрузитьКолонку("СчетДепо"));
	КонецЕсли;
	
	МассивНачислений = Новый Массив();
	
	Для Каждого СтрокаНалогов Из ТаблицаНалогов Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаНалогов.СсылкаНаНачисленныйНалог) Тогда
			ДокументНачисленныйНалог = Документы.НачисленныйНалог.СоздатьДокумент();
			ДокументНачисленныйНалог.ОбменДанными.Загрузка = Истина;
			ДокументНачисленныйНалог.Дата = Дата(Лев(Строка(СтрокаНалогов.Дата), 11) + Формат(ТекущаяДатаСеанса(), "ДЛФ=В"));
			ДокументНачисленныйНалог.Записать(РежимЗаписиДокумента.Запись);
			ДокументНачисленныйНалог.ОбменДанными.Загрузка = Ложь;
			ДокументНачисленныйНалог.Заполнить(СтрокаНалогов);
		ИначеЕсли СтрокаНалогов.Перезаполнить Тогда
			ДокументНачисленныйНалог = СтрокаНалогов.СсылкаНаНачисленныйНалог.ПолучитьОбъект();
			ДокументНачисленныйНалог.Подтвержден = Ложь;
			ДокументНачисленныйНалог.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			ДокументНачисленныйНалог.Заполнить(СтрокаНалогов);
		Иначе
			Продолжить;
		КонецЕсли;
		
		ДокументНачисленныйНалог.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
		МассивНачислений.Добавить(ДокументНачисленныйНалог.Ссылка);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивНачислений) Тогда
		СформироватьУведомлениеПоНачислениюНалога(МассивНачислений);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьЛишниеНачислениеНалога(МассивСчетовДепо)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленныйНалог.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.НачисленныйНалог КАК НачисленныйНалог
		|ГДЕ
		|	НачисленныйНалог.Основание = &Основание
		|	И НЕ НачисленныйНалог.СчетДепо В (&СчетДепо)
		|	И НЕ НачисленныйНалог.Подтвержден";
	
	Запрос.УстановитьПараметр("Основание", Ссылка);
	Запрос.УстановитьПараметр("СчетДепо", МассивСчетовДепо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НачисленныйНалогСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		НачисленныйНалогОбъект = НачисленныйНалогСсылка.ПолучитьОбъект();
		НачисленныйНалогОбъект.ПометкаУдаления = Истина;
		НачисленныйНалогОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьУведомлениеПоНачислениюНалога(МассивНачислений)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачисленныйНалог.Основание КАК Основание,
	|	НачисленныйНалог.Основание.Дата КАК ОснованиеДата,
	|	НачисленныйНалог.Основание.Номер КАК ОснованиеНомер,
	|	НачисленныйНалог.Основание.ПериодНачисления КАК ОснованиеПериодНачисления,
	|	НачисленныйНалог.Номер КАК Номер,
	|	НачисленныйНалог.Дата КАК Дата,
	|	НачисленныйНалог.Депонент.Представление КАК ДепонентПредставление,
	|	НачисленныйНалог.СчетДепо.Владелец.Код КАК ДепонентКод,
	|	НачисленныйНалог.Депонент.ЮрФизЛицо КАК ЮрФизЛицо
	|ИЗ
	|	Документ.НачисленныйНалог КАК НачисленныйНалог
	|ГДЕ
	|	НачисленныйНалог.Ссылка В(&МассивНачислений)
	|ИТОГИ
	|	МИНИМУМ(Основание),
	|	МИНИМУМ(ОснованиеДата),
	|	МИНИМУМ(ОснованиеНомер),
	|	МИНИМУМ(ОснованиеПериодНачисления)
	|ПО
	|	ЮрФизЛицо";
	
	Запрос.УстановитьПараметр("МассивНачислений", МассивНачислений);
	ВыборкаЮрФизЛицо = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЮрФизЛицо.Следующий() Цикл
		
		Если ВыборкаЮрФизЛицо.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОПодтвержденииНачисленияНалоговЮЛ;
			ВидЮрФизЛица = "ЮЛ";
		ИначеЕсли ВыборкаЮрФизЛицо.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОПодтвержденииНачисленияНалоговФЛ;
			ВидЮрФизЛица = "ФЛ";
		Иначе
			ВызватьИсключение "Не удалось определить вид лица депонента!";
		КонецЕсли;
		НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
		
		Если Не ЗначениеЗаполнено(НастройкиОбмена) Тогда
			ОписаниеОшибки = "Не заполнены параметры внешнего источника рассылки'" + ВнешнийИсточник + "'";
			ЗаписьЖурналаРегистрации("Поручение клиента. Уведомление по начислению налога",
				УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
			Возврат;
		КонецЕсли;
		
		ТипОснования = ТипЗнч(ВыборкаЮрФизЛицо.Основание);
		ОписаниеОснования = Строка(ТипОснования) + " №" + СокрЛП(ВыборкаЮрФизЛицо.ОснованиеНомер) + " от: "
			+ Формат(ВыборкаЮрФизЛицо.ОснованиеДата, "ДФ=dd.MM.yyyy");
		
		ВидВыплаты = ВыборкаЮрФизЛицо.ОснованиеПериодНачисления;
		ТемаПисьма = "Просьба подтвердить налог по выплате для " + ВидЮрФизЛица + " (" + ВидВыплаты + ")";
			
		ТекстПисьма =
			"Уважаемые коллеги,
			|
			|Согласно договоренности направляю вам уведомление на подтверждение исчисленного и подлежащего удержанию НДФЛ по выплате доходов указанного(ых) клиента(ов) в 1С.
			|
			|Обратите внимание, согласно внесенным изменениям в порядок удержания НДФЛ у клиентов и в соответствии с регламентом ДС не могут быть перечислены клиенту(ам) без подтверждения налога (несмотря на отсутствие в поручении «согласия на частичное исполнение»).
			|
			|Во избежание нарушения регуляторных требований (11-7/пз-н) просьба подтвердить сумму налога в течение 2 часов после получения данного уведомления. 
			|
			|На основании " + ОписаниеОснования + " 
			|";
		
		ВыборкаНачисления = ВыборкаЮрФизЛицо.Выбрать();
		
		Пока ВыборкаНачисления.Следующий() Цикл
			ТекстПисьма = ТекстПисьма + "
				|Начисление налога №" + ВыборкаНачисления.Номер + " от: " + ВыборкаНачисления.Дата + "
				|
				|	Клиент: " + ВыборкаНачисления.ДепонентПредставление + "
				|	Договор: " + СокрЛП(ВыборкаНачисления.ДепонентКод) + "
				|";
		КонецЦикла;
		
		ТекстПисьма = ТекстПисьма + Символы.ПС + "Пожалуйста обращайтесь, если возникнут вопросы/уточнения.";
		
		ПараметрыУведомления = Новый Соответствие;
		ПараметрыУведомления.Вставить("НастройкиОбмена"	, НастройкиОбмена);
		ПараметрыУведомления.Вставить("ТемаПисьма"		, ТемаПисьма);
		ПараметрыУведомления.Вставить("ТекстПисьма"		, ТекстПисьма);
		ПараметрыУведомления.Вставить("ТипТекстаПисьма"	, ТипТекстаПочтовогоСообщения.ПростойТекст);
		ПараметрыУведомления.Вставить("Кодировка"		, "UTF-8");
		ПараметрыУведомления.Вставить("Важность"		, ВажностьИнтернетПочтовогоСообщения.Обычная);
		
		РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПЕЧАТИ

#Если Клиент Тогда
	
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	Если ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеСчетаДепо Тогда
		СтруктураПечатныхФорм.Вставить("ОткрытиеСчетаДепо","Открытие счета депо");
	ИначеЕсли ВидОперацииД   = Справочники.ВидыОпераций.КорректировкаРеквизитовСчетаДепо Тогда	
		СтруктураПечатныхФорм.Вставить("КорректировкаСчетаДепо","Корректировка счета депо");
	ИначеЕсли ВидОперацииД   = Справочники.ВидыОпераций.ЗакрытиеСчетаДепо Тогда	
		СтруктураПечатныхФорм.Вставить("ЗакрытиеСчетаДепо","Закрытие счета депо");
	ИначеЕсли ВидОперацииД   = Справочники.ВидыОпераций.НазначениеПопечителяСчетаДепо Тогда
		СтруктураПечатныхФорм.Вставить("НазначениеПопечителя","Назначение попечителя");
	ИначеЕсли ВидОперацииД   = Справочники.ВидыОпераций.ОтзывПопечителяСчетаДепо Тогда
		СтруктураПечатныхФорм.Вставить("ОтзывПопечителя","Отзыв попечителя");
	ИначеЕсли ВидОперацииД   = Справочники.ВидыОпераций.НазначениеОператораСчетаДепо Тогда
		СтруктураПечатныхФорм.Вставить("ОператорРапорядительСчетаДепо", "Оператор рапорядитель счета депо");
	ИначеЕсли  ВидОперацииД   = Справочники.ВидыОпераций.Депонирование  
		ИЛИ    ВидОперацииД   = Справочники.ВидыОпераций.СнятиеСДепонирования				
		ИЛИ    ВидОперацииД   = Справочники.ВидыОпераций.Обременение
		ИЛИ    ВидОперацииД   = Справочники.ВидыОпераций.ВозвратИзЗалога
		ИЛИ    ВидОперацииД   = Справочники.ВидыОпераций.Конвертация
		ИЛИ    ВидОперацииД   = Справочники.ВидыОпераций.Перевод
		ИЛИ    ВидОперацииД   = Справочники.ВидыОпераций.ПередачаВЗалог
		ИЛИ    ВидОперацииД   = Справочники.ВидыОпераций.Перемещение
		ИЛИ    ВидОперацииД   = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо
		ИЛИ    ВидОперацииД   = Справочники.ВидыОпераций.Погашение
	    ИЛИ    ВидОперацииД   = Справочники.ВидыОпераций.СписаниеАкцийПриЛиквидацииЭмитента
	    ИЛИ    ВидОперацииД   = Справочники.ВидыОпераций.СписаниеОбесценившихсяЦенныхБумаг
		ИЛИ    ВидОперацииД   = Справочники.ВидыОпераций.ВыкупСписаниеЦБ
		ИЛИ    ВидОперацииД   = Справочники.ВидыОпераций.СнятиеОбременения
		ИЛИ    ВидОперацииД   = Справочники.ВидыОпераций.Разблокирование Тогда
		
		СтруктураПечатныхФорм.Вставить("ОперацииСЦБ", "Операции СЦБ");
	ИначеЕсли ВидОперацииД   = Справочники.ВидыОпераций.ПредоставлениеУведомления  Тогда
		СтруктураПечатныхФорм.Вставить("Уведомление", "Уведомление");
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ПустаяСсылка() Тогда 
		СтруктураПечатныхФорм.Вставить("ОткрытиеСчетаДепо","Открытие счета депо");
		СтруктураПечатныхФорм.Вставить("КорректировкаСчетаДепо","Корректировка счета депо");
		СтруктураПечатныхФорм.Вставить("ЗакрытиеСчетаДепо","Закрытие счета депо");
		СтруктураПечатныхФорм.Вставить("НазначениеПопечителя","Назначение попечителя");
		СтруктураПечатныхФорм.Вставить("ОтзывПопечителя","Отзыв попечителя");
		СтруктураПечатныхФорм.Вставить("ОператорРапорядительСчетаДепо", "Оператор рапорядитель счета депо");
		СтруктураПечатныхФорм.Вставить("ОперацииСЦБ", "Операции СЦБ");
		СтруктураПечатныхФорм.Вставить("ОперацииСЦБ", "Операции СЦБ");
		СтруктураПечатныхФорм.Вставить("Уведомление", "Уведомление");
	КонецЕсли;
	
	Возврат СтруктураПечатныхФорм;
	
КонецФункции

Процедура ПечатьПорученияОткрытиеСчетаДепо()
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.Поручение.ПолучитьМакет("ОткрытиеСчетаДепо");
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	
	Депозитарий = Константы.ОрганизацияПоУмолчанию.Получить();
	Если Депозитарий.Пустая() тогда
		Сообщить("Не выбрано значение организации, используемое по умолчанию!!!");
		Возврат;
	КонецЕсли;
	
	Область.Параметры.Организация	= "Депозитарий " + Депозитарий.Наименование; 
	ДанныеЛицензии					= ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Депозитарий);
	Область.Параметры.ДатаЛицензии	= Формат(ДанныеЛицензии.ДатаЛицензии,"ДЛФ=DD");
	Область.Параметры.НомерЛицензии	= "Лицензия № " + ДанныеЛицензии.НомерЛицензии; 
	Область.Параметры.ФактАдрес		= КонтактнаяИнформация.ПолучитьАдресИзКонтактнойИнформации(Депозитарий,"Фактический");
	Область.Параметры.ТелФакс		= КонтактнаяИнформация.ПолучитьТелефонИзКонтактнойИнформации(Депозитарий);
	ТабДок.Вывести(Область);
	
	Если Инициатор.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		
		Область = Макет.ПолучитьОбласть("ШапкаФизик");
		Область.Параметры.ФИО = Инициатор.НаименованиеПолное;
		ДанныеПаспорта = ОбщегоНазначения.ПаспортныеДанные(Инициатор.ФизЛицо, Дата);
		Область.Параметры.ПаспортСерия = ДанныеПаспорта.Серия;
		Область.Параметры.ПаспортНомер = ДанныеПаспорта.Номер;
		Область.Параметры.ДатаВыдачиПаспорта = Формат(ДанныеПаспорта.ДатаВыдачи,"ДФ=dd.MM.yyyy")+"г.";
		Область.Параметры.МестоВыдачиПаспорта = ДанныеПаспорта.Выдан;
		Область.Параметры.Организация = Депозитарий.Наименование;
		
		Если ТипСчетаДепо = Перечисления.ТипыСчетовДепо.Залогодержателя Тогда
			
			Область.Параметры.Собственник 			= "[ ]" ;
			Область.Параметры.Залогодержатель		= "[Х]";
			
		ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.Владельца  Тогда	
			Область.Параметры.Собственник 			= "[Х]";
			Область.Параметры.Залогодержатель		= "[ ]";
		Иначе
			Область.Параметры.Собственник 			="[ ]";
			Область.Параметры.Залогодержатель		="[ ]";
			Сообщить("Не правильно указан тип счета депо!");
		КонецЕсли; 
		
		Область.Параметры.ДоговорНомер				= Инициатор.ОсновнойДоговорКонтрагента.Наименование + " №"
		+ Строка(Инициатор.ОсновнойДоговорКонтрагента.Код)
		+ " от " + Формат(Инициатор.ОсновнойДоговорКонтрагента.ДатаНачалоДействия,"ДЛФ=DD");
		
		Область.Параметры.ОрганизацияОзнакомлен		= "		С условиями осуществления депозитарной деятельности "
		+ Депозитарий.НаименованиеПлательщикаПриПеречисленииНалогов+" ознакомлен.";
		Область.Параметры.ОрганизацияГарантия		= "		Настоящим гарантирую, что все ценные бумаги, которые будут" 
		+ "	депонироваться мною в Депозитарий "	+Депозитарий.НаименованиеПлательщикаПриПеречисленииНалогов
		+ ", принадлежат или переданны мне в залог в полном"
		+ " соответствии с законодательством Российской Федерации.";
	Иначе	
		
		Область = Макет.ПолучитьОбласть("ШапкаЮрик");        
		ПараметрыОбласти = Область.Параметры;
		ПараметрыОбласти.ФИО = "Я, нижеподписавшийся " + Инициатор.ОсновноеКонтактноеЛицо.Наименование
		+ ", "+Инициатор.ОсновноеКонтактноеЛицо.Должность;
		ПараметрыОбласти.ОрганизацияНаименование 	= Депозитарий.Наименование;
		ПараметрыОбласти.ДепонентСчет      		= "отдельный счет депо на имя "+Инициатор.НаименованиеПолное;
		//установка типа счета
		Если ТипСчетаДепо = Перечисления.ТипыСчетовДепо.Залогодержателя Тогда
			ПараметрыОбласти.Собственник = "[ ]";
			ПараметрыОбласти.Залогодержатель = "[Х]";
			ПараметрыОбласти.ДУ = "[ ]";
			ПараметрыОбласти.НД = "[ ]"; 
			
		ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.Владельца  Тогда	
			ПараметрыОбласти.Собственник = "[Х]";
			ПараметрыОбласти.Залогодержатель = "[ ]";
			ПараметрыОбласти.ДУ = "[ ]";
			ПараметрыОбласти.НД = "[ ]";
		ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ДоверительногоУправляющего  Тогда	
			ПараметрыОбласти.Собственник = "[ ]";
			ПараметрыОбласти.Залогодержатель = "[ ]";
			ПараметрыОбласти.ДУ = "[Х]";
			ПараметрыОбласти.НД = "[ ]";
		ИначеЕсли ТипСчетаДепо = Перечисления.ТипыСчетовДепо.НоминальногоДержателя  Тогда	
			ПараметрыОбласти.Собственник = "[ ]";
			ПараметрыОбласти.Залогодержатель = "[ ]";
			ПараметрыОбласти.ДУ = "[ ]";
			ПараметрыОбласти.НД = "[Х]";
		Иначе
			ПараметрыОбласти.Собственник = "[ ]";
			ПараметрыОбласти.Залогодержатель = "[ ]";
			ПараметрыОбласти.ДУ = "[ ]";
			ПараметрыОбласти.НД = "[ ]";
			Сообщить("Не правильно указан тип счета депо!");
		КонецЕсли; 
		ПараметрыОбласти.ДанныеДоговор  = "для учета и/или хранения ценных бумаг на основании договора "
		+ "счета депо (договора о междепозитарных отношениях) №"
		+ Строка(Инициатор.ОсновнойДоговорКонтрагента.Код) + " "
		+ Строка(Инициатор.ОсновнойДоговорКонтрагента.Наименование)  + " от "
		+ Формат(Инициатор.ОсновнойДоговорКонтрагента.ДатаНачалоДействия,"ДЛФ=DD");                                            
		ПараметрыОбласти.ОрганизацияОзнакомлен 	= "		С условиями осуществления депозитарной деятельности "
		+ Депозитарий.НаименованиеПлательщикаПриПеречисленииНалогов+" ознакомлен.";
		ПараметрыОбласти.ОрганизацияГарантия = "		Настоящим гарантирую, что все ценные бумаги, которые будут" 
		+ "	депонироваться в Депозитарий "	+Депозитарий.НаименованиеПлательщикаПриПеречисленииНалогов
		+ ", принадлежат, или доверены, или переданны в залог или на депозитарное обслуживание";
		ПараметрыОбласти.ДепонентНаименование = Инициатор.НаименованиеПолное;
		
	КонецЕсли;
	
	ТабДок.Вывести(Область);
	
	ВывестиПодвалМакетаВТабличныйДокумент(Макет, ТабДок);
	
	ФормированиеПечатныхФорм.ПоказатьТабличныйДокумент(ТабДок);
	
КонецПроцедуры

Процедура ПечатьПорученияКорректировкаСчетаДепо()
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.Поручение.ПолучитьМакет("КорректировкаСчетаДепо");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(Область);
	//Шапка
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ДанныеДепонент	=	"Депонент " + Инициатор.НаименованиеПолное;
	//установка номера счета депо
	НомерКодаСчета = 1;
	Пока НомерКодаСчета < 12 Цикл
		
		Область.Параметры["П"+НомерКодаСчета]        = Сред(СокрЛП(СчетДепо.Код),НомерКодаСчета,1);
		НомерКодаСчета	 =	НомерКодаСчета + 1;
		
	КонецЦикла; 
	//установка данных депозитарного договора.
	Если  (ТипЗнч(СчетДепо)=Тип("СправочникСсылка.СчетаДепоМХ")) И (НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(СчетДепо)) Тогда
		Область.Параметры.ДанныеДоговор		=	СчетДепо.НомерДоговора + " от " + Формат(СчетДепо.ДатаДоговора,"ДЛФ=DD");
	Иначе 	
		Область.Параметры.ДанныеДоговор		=	СчетДепо.НомерДепозитарногоДоговора + " от " + Формат(СчетДепо.ДатаЗаключенияДепозитарногоДоговора,"ДФ=dd.MM.yyyy; ДЛФ=DD");	
	КонецЕсли; 
	
	ТабДок.Вывести(Область);
	
	ВывестиПодвалМакетаВТабличныйДокумент(Макет, ТабДок);
	
	ФормированиеПечатныхФорм.ПоказатьТабличныйДокумент(ТабДок);
	
КонецПроцедуры

Процедура ПечатьПорученияЗакрытияСчетаДепо()
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.Поручение.ПолучитьМакет("ЗакрытиеСчетаДепо");
	// Заголовок	
	Область = Макет.ПолучитьОбласть("Заголовок");
	
	Депозитарий = Константы.ОрганизацияПоУмолчанию.Получить();
	Если Депозитарий.Пустая() тогда
		Сообщить("Не выбрано значение организации, используемое по умолчанию!!!");
		Возврат;
	КонецЕсли;
	
	Область.Параметры.Организация	= Депозитарий.Наименование; 
	ДанныеЛицензии					= ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Депозитарий);
	Область.Параметры.ДатаЛицензии	= ДанныеЛицензии.ДатаЛицензии + " г.";
	Область.Параметры.НомерЛицензии	= ДанныеЛицензии.НомерЛицензии; 
	Область.Параметры.ФактАдрес		= КонтактнаяИнформация.ПолучитьАдресИзКонтактнойИнформации(Депозитарий,"Фактический");
	Область.Параметры.ТелФакс		= КонтактнаяИнформация.ПолучитьТелефонИзКонтактнойИнформации(Депозитарий);
	
	Область.Параметры.ДанныеОрганизации	= "Я, нижеподписавшийся, обладая необходимыми на то полномочиями,"
	+ "настоящим поручаю закрыть счет депо в Депозитарии "
	+ Депозитарий.НаименованиеПлательщикаПриПеречисленииНалогов + ".";	
	ТабДок.Вывести(Область);
	//Шапка
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ДанныеДепонент	=	"Депонент " + Инициатор.НаименованиеПолное;
	//установка номера счета депо
	НомерКодаСчета = 1;
	Пока НомерКодаСчета < 12 Цикл
		
		Область.Параметры["П"+НомерКодаСчета]        = Сред(СокрЛП(СчетДепо.Код),НомерКодаСчета,1);
		НомерКодаСчета	 =	НомерКодаСчета + 1;
		
	КонецЦикла; 
	//установка данных депозитарного договора.
	Если  (ТипЗнч(СчетДепо)=Тип("СправочникСсылка.СчетаДепоМХ")) И (НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(СчетДепо)) Тогда
		Область.Параметры.ДанныеДоговор		=	СчетДепо.НомерДоговора + " от " + Формат(СчетДепо.ДатаДоговора,"ДЛФ=DD");
	Иначе 	
		Область.Параметры.ДанныеДоговор		=	СчетДепо.НомерДепозитарногоДоговора + " от " + Формат(СчетДепо.ДатаЗаключенияДепозитарногоДоговора,"ДФ=dd.MM.yyyy; ДЛФ=DD");	
	КонецЕсли; 
	
	ТабДок.Вывести(Область);
	
	ВывестиПодвалМакетаВТабличныйДокумент(Макет, ТабДок);
	
	ФормированиеПечатныхФорм.ПоказатьТабличныйДокумент(ТабДок);
	
КонецПроцедуры

Процедура ПечатьПорученияНазначениеПопечителяСчетаДепо()
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.Поручение.ПолучитьМакет("НазначениеПопечителя");
	// Заголовок	
	Область = Макет.ПолучитьОбласть("Заголовок");
	
	Депозитарий = Константы.ОрганизацияПоУмолчанию.Получить();
	Если Депозитарий.Пустая() тогда
		Сообщить("Не выбрано значение организации, используемое по умолчанию!!!");
		Возврат;
	КонецЕсли;
	
	Область.Параметры.Организация	= Депозитарий.Наименование; 
	ДанныеЛицензии					= ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Депозитарий);
	Область.Параметры.ДатаЛицензии	= ДанныеЛицензии.ДатаЛицензии + " г.";
	Область.Параметры.НомерЛицензии	= ДанныеЛицензии.НомерЛицензии; 
	Область.Параметры.ФактАдрес		= КонтактнаяИнформация.ПолучитьАдресИзКонтактнойИнформации(Депозитарий,"Фактический");
	Область.Параметры.ТелФакс		= КонтактнаяИнформация.ПолучитьТелефонИзКонтактнойИнформации(Депозитарий);
	
	Область.Параметры.ДанныеОрганизации	= "     Я, нижеподписавшийся, обладая необходимыми на то полномочиями,"
	+ "настоящим поручаю зарегистрировать в Депозитарии "
	+ Депозитарий.НаименованиеПлательщикаПриПеречисленииНалогов 
	+ " Попечителя счета депо, полномочия которого определены в "
	+ " Соглашении о Попечителе к договору счета депо.";	
	ТабДок.Вывести(Область);
	//Шапка
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ДанныеДепонент	=	"Депонент " + Инициатор.НаименованиеПолное;
	//установка номера счета депо
	НомерКодаСчета = 1;
	Пока НомерКодаСчета < 12 Цикл
		
		Область.Параметры["П"+НомерКодаСчета]        = Сред(СокрЛП(СчетДепо.Код),НомерКодаСчета,1);
		НомерКодаСчета	 							 = НомерКодаСчета + 1;
		
	КонецЦикла; 
	//установка параметров попечитель и лицензия
	
	Область.Параметры.Попечитель			= ПредставительСчетаДепо.НаименованиеПолное;
	ДанныеЛицензии							= ФормированиеПечатныхФорм.ДепозитарнаяЛицензияЮрика(ПредставительСчетаДепо);
	Область.Параметры.Лицензия				= ДанныеЛицензии.НомерЛицензии;
	
	//установка данных депозитарного договора.
	Если  (ТипЗнч(СчетДепо)=Тип("СправочникСсылка.СчетаДепоМХ")) И (НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(СчетДепо)) Тогда
		Область.Параметры.ДанныеДоговор		=	СчетДепо.НомерДоговора + " от " + Формат(СчетДепо.ДатаДоговора,"ДЛФ=DD");
	Иначе 	
		Область.Параметры.ДанныеДоговор		=	СчетДепо.НомерДепозитарногоДоговора + " от " + Формат(СчетДепо.ДатаЗаключенияДепозитарногоДоговора,"ДФ=dd.MM.yyyy; ДЛФ=DD");	
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Наименование КАК Номер,
	|	ДоговорыКонтрагентов.ДатаНачалоДействия КАК ДатаНачалоДействия
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ТипДоговора = &ТипДоговора
	|	И ДоговорыКонтрагентов.СчетДепо = &СчетДепо
	|	И ДоговорыКонтрагентов.Попечитель = &Попечитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачалоДействия УБЫВ";
	
	Запрос.УстановитьПараметр("ТипДоговора",Перечисления.ТипыДоговоров.СоглашениеОПопечителе);
	Запрос.УстановитьПараметр("СчетДепо",СчетДепо);
	Запрос.УстановитьПараметр("Попечитель",ПредставительСчетаДепо);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Область.Параметры.ДоговорСоглашение		=	"№ " + Выборка.Номер + " от "+ Формат(Выборка.ДатаНачалоДействия,"ДЛФ = Д") + " г.";
	Иначе	
		Область.Параметры.ДоговорСоглашение		=	"№         от                     г.";
	КонецЕсли;
	
	ТабДок.Вывести(Область);
	
	ВывестиПодвалМакетаВТабличныйДокумент(Макет, ТабДок);
	
	ФормированиеПечатныхФорм.ПоказатьТабличныйДокумент(ТабДок);
	
КонецПроцедуры

Процедура ПечатьПорученияОтзывПопечителяСчетаДепо()
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.Поручение.ПолучитьМакет("ОтзывПопечителя");
	// Заголовок	
	Область = Макет.ПолучитьОбласть("Заголовок");
	
	Депозитарий = Константы.ОрганизацияПоУмолчанию.Получить();
	Если Депозитарий.Пустая() тогда
		Сообщить("Не выбрано значение организации, используемое по умолчанию!!!");
		Возврат;
	КонецЕсли;
	
	Область.Параметры.Организация	= Депозитарий.НаименованиеПолное; 
	ДанныеЛицензии					= ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Депозитарий);
	Область.Параметры.ДатаЛицензии	= ДанныеЛицензии.ДатаЛицензии + " г.";
	Область.Параметры.НомерЛицензии	= ДанныеЛицензии.НомерЛицензии; 
	Область.Параметры.ФактАдрес		= КонтактнаяИнформация.ПолучитьАдресИзКонтактнойИнформации(Депозитарий,"Фактический");
	Область.Параметры.ТелФакс		= КонтактнаяИнформация.ПолучитьТелефонИзКонтактнойИнформации(Депозитарий);
	
	Область.Параметры.ДанныеОрганизации	= "     Я, нижеподписавшийся, обладая необходимыми на то полномочиями,"
	+ "настоящим отзываю все полномочия зарегистрированного ранее в Депозитарии "
	+ Депозитарий.НаименованиеПлательщикаПриПеречисленииНалогов 
	+ " Попечителя счета депо.";
	
	ТабДок.Вывести(Область);
	//Шапка
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ДанныеДепонент = "Депонент " + Инициатор.НаименованиеПолное;
	//установка номера счета депо
	НомерКодаСчета = 1;
	Пока НомерКодаСчета < 12 Цикл
		
		Область.Параметры["П"+НомерКодаСчета] = Сред(СокрЛП(СчетДепо.Код), НомерКодаСчета, 1);
		НомерКодаСчета = НомерКодаСчета + 1;
		
	КонецЦикла; 
	//установка параметров попечитель и лицензия
	
	Область.Параметры.Попечитель = ПредставительСчетаДепо.НаименованиеПолное;
	ДанныеЛицензии = ФормированиеПечатныхФорм.ДепозитарнаяЛицензияЮрика(ПредставительСчетаДепо);
	Область.Параметры.Лицензия = ДанныеЛицензии.НомерЛицензии;
	
	//установка данных депозитарного договора.
	Если  (ТипЗнч(СчетДепо)=Тип("СправочникСсылка.СчетаДепоМХ")) И (НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(СчетДепо)) Тогда
		Область.Параметры.ДанныеДоговор = СчетДепо.НомерДоговора + " от " + Формат(СчетДепо.ДатаДоговора,"ДЛФ=DD");
	Иначе 	
		Область.Параметры.ДанныеДоговор = СчетДепо.НомерДепозитарногоДоговора + " от " + Формат(СчетДепо.ДатаЗаключенияДепозитарногоДоговора,"ДФ=dd.MM.yyyy; ДЛФ=DD");	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Наименование КАК Номер,
	|	ДоговорыКонтрагентов.ДатаНачалоДействия КАК ДатаНачалоДействия
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ТипДоговора = &ТипДоговора
	|	И ДоговорыКонтрагентов.СчетДепо = &СчетДепо
	|	И ДоговорыКонтрагентов.Попечитель = &Попечитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачалоДействия УБЫВ";
	
	Запрос.УстановитьПараметр("ТипДоговора", Перечисления.ТипыДоговоров.СоглашениеОПопечителе);
	Запрос.УстановитьПараметр("СчетДепо", СчетДепо);
	Запрос.УстановитьПараметр("Попечитель", ПредставительСчетаДепо);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Область.Параметры.ДоговорСоглашение = Выборка.Номер + " от "+ Формат(Выборка.ДатаНачалоДействия,"ДЛФ = Д") + " г.";
	Иначе	
		Область.Параметры.ДоговорСоглашение = "         от                     г.";
	КонецЕсли;
	
	ТабДок.Вывести(Область);
	
	ВывестиПодвалМакетаВТабличныйДокумент(Макет, ТабДок);
	
	ФормированиеПечатныхФорм.ПоказатьТабличныйДокумент(ТабДок);
	
КонецПроцедуры

Процедура ПечатьПорученияОператораРаспорядителяСчетаДепо()
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.Поручение.ПолучитьМакет("ОператорРапорядительСчетаДепо");
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	
	Депозитарий = Константы.ОрганизацияПоУмолчанию.Получить();
	Если Депозитарий.Пустая() тогда
		Сообщить("Не выбрано значение организации, используемое по умолчанию!!!");
		Возврат;
	КонецЕсли;
	
	Область.Параметры.Организация = Депозитарий.НаименованиеПолное;
	ДанныеЛицензии = ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Депозитарий);	 
	Область.Параметры.ЛицензияНомер = "Лицензия № "+ДанныеЛицензии.НомерЛицензии + " от";
	Область.Параметры.ЛицензияДата = ДанныеЛицензии.ДатаЛицензии + " г.";
	ТабДок.Вывести(Область);
	
	//Форма Д22 / Форма Д21
	Если ВидОперацииД = Справочники.ВидыОпераций.НазначениеОператораСчетаДепо
		ИЛИ ВидОперацииД   = Справочники.ВидыОпераций.ОтменаОператораСчетаДепо   Тогда
		Область = Макет.ПолучитьОбласть("ФормаД22");
		ТабДок.Вывести(Область);
	Иначе
		Область = Макет.ПолучитьОбласть("ФормаД21");
		ТабДок.Вывести(Область);  
	КонецЕсли;	  
	
	//Шапка
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ДанныеДепонент = "Депонент " + Инициатор.НаименованиеПолное;
	Область.Параметры.Организация 	 = Депозитарий.НаименованиеПолное;
	//установка номера счета депо
	НомерКодаСчета = 1;
	Пока НомерКодаСчета < 12 Цикл
		
		Область.Параметры["П"+НомерКодаСчета]        = Сред(СокрЛП(СчетДепо.Код),НомерКодаСчета,1);
		НомерКодаСчета	 =	НомерКодаСчета + 1;
		
	КонецЦикла;
	//ПредставительСчета
	Если ВидОперацииД = Справочники.ВидыОпераций.НазначениеОператораСчетаДепо Тогда
		Область.Параметры.ПредставительСчета = "поручаю [V]НАЗНАЧИТЬ/[ ]ОТМЕНИТЬ (нужное подчеркнуть) Оператора счета "
		+ "(раздела счета) депо " + ПредставительСчетаДепо.НаименованиеПолное;	
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ОтменаОператораСчетаДепо   Тогда	 
		Область.Параметры.ПредставительСчета = "поручаю [ ]НАЗНАЧИТЬ/[V]ОТМЕНИТЬ (нужное подчеркнуть) Оператора счета "
		+ "(раздела счета) депо " + ПредставительСчетаДепо.НаименованиеПолное;
		
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.НазначениеРаспорядителяСчетаДепо   Тогда
		Область.Параметры.ПредставительСчета = "поручаю [V]НАЗНАЧИТЬ/[ ]ОТМЕНИТЬ (нужное подчеркнуть) Рапорядителя счета "
		+ "(раздела счета) депо в лице " + ПредставительСчетаДепо.НаименованиеПолное;
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ОтменаРаспорядителяСчетаДепо   Тогда	
		Область.Параметры.ПредставительСчета = "поручаю [ ]НАЗНАЧИТЬ/[V]ОТМЕНИТЬ (нужное подчеркнуть) Рапорядителя счета "
		+ "(раздела счета) депо в лице " + ПредставительСчетаДепо.НаименованиеПолное;
	КонецЕсли;	
	//установка данных депозитарного договора.
	Если  (ТипЗнч(СчетДепо)=Тип("СправочникСсылка.СчетаДепоМХ")) И (НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(СчетДепо)) Тогда
		Область.Параметры.ДанныеДоговор = СчетДепо.НомерДоговора + " от " + Формат(СчетДепо.ДатаДоговора,"ДЛФ=DD");
	Иначе 	
		Область.Параметры.ДанныеДоговор = СчетДепо.НомерДепозитарногоДоговора + " от " + Формат(СчетДепо.ДатаЗаключенияДепозитарногоДоговора,"ДФ=dd.MM.yyyy; ДЛФ=DD");	
	КонецЕсли; 
	
	Область.Параметры.НомерДоверенности = НомерДоверенностиПредставителя + " от "+ Формат(ДатаНачалаДоверенности,"ДЛФ=DD");
	
	ТабДок.Вывести(Область);
	
	//Подвал Оператора или Распорядителя
	Если ВидОперацииД   = Справочники.ВидыОпераций.НазначениеОператораСчетаДепо
		ИЛИ ВидОперацииД   = Справочники.ВидыОпераций.ОтменаОператораСчетаДепо   Тогда
		Область = Макет.ПолучитьОбласть("ПодвалОператор");
		Область.Параметры.ПодписьДепонент     = Инициатор.Наименование;
		Область.Параметры.ПодписьОператора    = ПредставительСчетаДепо.Руководитель;
		ТабДок.Вывести(Область);
	Иначе
		Область = Макет.ПолучитьОбласть("ПодвалРаспорядитель");
		Область.Параметры.ПодписьДепонент 	 = Инициатор.Наименование;
		Область.Параметры.ПодписьРапорядитель = ПредставительСчетаДепо.Руководитель;
		ТабДок.Вывести(Область);  
	КонецЕсли;
	
	ФормированиеПечатныхФорм.ПоказатьТабличныйДокумент(ТабДок);
	
КонецПроцедуры

Процедура ПечатьПорученияОперацииЦБ()
	
	ТабДок 	= Новый ТабличныйДокумент;
	Макет 	= Документы.Поручение.ПолучитьМакет("ОперацииСЦБ");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	//установка параметров Заголовка
	Депозитарий = Константы.ОрганизацияПоУмолчанию.Получить();
	Если Депозитарий.Пустая() тогда
		Сообщить("Не выбрано значение организации, используемое по умолчанию!!!");
		Возврат;
	КонецЕсли;
	Область.Параметры.Организация = Депозитарий.НаименованиеПолное;
	ДанныеЛицензии = ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Депозитарий);	 
	Область.Параметры.ЛицензияНомер = "Лицензия № "+ДанныеЛицензии.НомерЛицензии + " от ";
	Область.Параметры.ЛицензияДата = ДанныеЛицензии.ДатаЛицензии + " г. ";
	ТабДок.Вывести(Область);
	
	//Форма Д11
	Область = Макет.ПолучитьОбласть("ФормаД11");
	Область.Параметры.Дата = Формат(Дата,"ДЛФ=DD");
	
	ТабДок.Вывести(Область);
	//Шапка
	Область = Макет.ПолучитьОбласть("Шапка");
	//Депонент
	Если ЗначениеЗаполнено(Инициатор) Тогда
		Область.Параметры.Депонент						= Инициатор.НаименованиеПолное;
		Область.Параметры.СчетДепоНомер 				= СчетДепо.Код;
		Область.Параметры.РазделСчетаДепо				= РазделСчетаДепо.Наименование+" "+СокрЛП(РазделСчетаДепо.Код);
		Область.Параметры.ТипСчета						= СчетДепо.ТипСчетаДепо;
		// МХ Депонент
		Если МХ_ПоУмолчанию Тогда	
			Область.Параметры.МХДепонента               = МХ_Константа;
		Иначе	
			Область.Параметры.МХДепонента				= МХДепонента.Наименование;	
		КонецЕсли;
		//Документ депонент
		Если Инициатор.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			Область.Параметры.Документ_Депонент  = ФормированиеПечатныхФорм.ПолучитьПаспорныеДанныеСтрокой(Инициатор.ФизЛицо);//паспортные данные
		Иначе
			Область.Параметры.Документ_Депонент  = "Свидетельство о регистрации № " + Инициатор.НомерГосударственнойРегистрации
			+ " выдано " + Инициатор. НаименованиеОрганаРегистрации
			+ " дата выдачи " + Формат(Инициатор.ДатаГосударственнойРегистрации,"ДЛФ=DD");//свидетельство о регистрации
		КонецЕсли;                                   
		Область.Параметры.КонтактноеЛицо				= Инициатор.ОсновноеКонтактноеЛицо;	
	КонецЕсли; 
	//Контрагент
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Область.Параметры.Контрагент					= Контрагент.НаименованиеПолное;
		Область.Параметры.СчетДепоНомерКонтрагент 		= СчетДепоКонтрагента.Код;
		Область.Параметры.РазделСчетаДепоКонтрагент		= РазделСчетаДепоКонтрагента.Наименование+" "+СокрЛП(РазделСчетаДепоКонтрагента.Код);	
		Область.Параметры.ТипСчетаКонтрагент			= СчетДепоКонтрагента.ТипСчетаДепо;
		// МХ Контрагент
		Если МХ_ПоУмолчанию Тогда		
			Область.Параметры.МХДепонентаКонтрагент		= МХ_Константа;
		Иначе		
			Область.Параметры.МХДепонентаКонтрагент		= МХКонтрагент.Наименование;
		КонецЕсли; 
		//Документ Контрагент
		Если Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			Область.Параметры.Документ_Контрагент  = ФормированиеПечатныхФорм.ПолучитьПаспорныеДанныеСтрокой(Контрагент.ФизЛицо);//паспортные данные
		Иначе
			Область.Параметры.Документ_Контрагент  = "Свидетельство о регистрации № " + Контрагент.НомерГосударственнойРегистрации
			+ " выдано " + Контрагент. НаименованиеОрганаРегистрации
			+ " дата выдачи " + Формат(Контрагент.ДатаГосударственнойРегистрации,"ДЛФ=DD");//свидетельство о регистрации
		КонецЕсли;            
		Область.Параметры.КонтактноеЛицоКонтрагент		= Контрагент.ОсновноеКонтактноеЛицо;
	КонецЕсли;
	//ЦБ
	Область.Параметры.Эмитент						= ЦБ.Эмитент.НаименованиеПолное;
	Область.Параметры.ВидЦБ                         = Строка(ЦБ.ТипЦБ) + " " + Строка(ЦБ.ВидЦБ);
	Область.Параметры.НомРег                        = ЦБ.НомерРегистрации;
	Область.Параметры.ДатаРег                       = Формат(ЦБ.ДатаГосРег,"ДЛФ=DD");
	//получение номинал ЦБ из регистра сведений НоминалЦБ.
	Номинал	=	РегистрыСведений.НоминалЦБ.ПолучитьПоследнее(Дата,Новый Структура("ЦеннаяБумага",ЦБ)).Сумма;
	
	Область.Параметры.Номинал                       = Номинал;
	Область.Параметры.НоминалПрописью               = ФормированиеПечатныхФорм.КоличествоПрописью(Номинал);
	Область.Параметры.Количество                    = КоличествоЦБ;
	Область.Параметры.КоличествоПрописью            = ФормированиеПечатныхФорм.КоличествоПрописью(КоличествоЦБ);
	Область.Параметры.ЦенаСделки					= ЦенаСделкиЦБ * КоличествоЦБ;
	Область.Параметры.ЦенаСделкиПрописью            = ФормированиеПечатныхФорм.КоличествоПрописью(ЦенаСделкиЦБ * КоличествоЦБ);
	ТабДок.Вывести(Область);  
	
	//Операция   
	Область = Макет.ПолучитьОбласть("Операция");
	Область.Параметры.ВидОперации = ВидОперацииД;
	Область.Параметры.Комментарий = Комментарий;
	ТабДок.Вывести(Область);  
	
	//Отметки   
	Область = Макет.ПолучитьОбласть("Отметки");
	Если Инициатор.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		Область.Параметры.ПодписьДепонент    = ОбщегоНазначения.ДанныеФизЛица(Константы.ОрганизацияПоУмолчанию.Получить(), Инициатор.ФизЛицо, РабочаяДата).Представление;
	Иначе
		Область.Параметры.ПодписьДепонент    = Инициатор.Руководитель;
	КонецЕсли;
	Если Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		Область.Параметры.ПодписьКонтрагент  = Контрагент.Наименование;
	Иначе
		Область.Параметры.ПодписьКонтрагент  = Контрагент.Руководитель;	
	КонецЕсли; 	
	
	ТабДок.Вывести(Область);  	
	ФормированиеПечатныхФорм.ПоказатьТабличныйДокумент(ТабДок);
	
КонецПроцедуры

Процедура ПечатьПорученияУведомлениеВыписка()
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.Поручение.ПолучитьМакет("Уведомление");
	// Заголовок	
	Область = Макет.ПолучитьОбласть("Заголовок");
	
	Депозитарий = Константы.ОрганизацияПоУмолчанию.Получить();
	Если Депозитарий.Пустая() тогда
		Сообщить("Не выбрано значение организации, используемое по умолчанию!!!");
		Возврат;
	КонецЕсли;
	
	Область.Параметры.Организация	= Депозитарий.Наименование; 
	ДанныеЛицензии					= ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Депозитарий);
	Область.Параметры.ДатаЛицензии	= ДанныеЛицензии.ДатаЛицензии + " г.";
	Область.Параметры.НомерЛицензии	= ДанныеЛицензии.НомерЛицензии;
	
	// фактический адрес - не квартира, а офис
	ФактАдрес						= КонтактнаяИнформация.ПолучитьАдресИзКонтактнойИнформации(Депозитарий,"Фактический");
	Область.Параметры.ФактАдрес		= СтрЗаменить(ФактАдрес,"кв.","офис");
	Область.Параметры.ТелФакс		= КонтактнаяИнформация.ПолучитьТелефонИзКонтактнойИнформации(Депозитарий);
	
	ТабДок.Вывести(Область);
	//Шапка
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ДанныеДепонент	=	"Депонент " + Инициатор.НаименованиеПолное;
	//установка номера счета депо
	НомерКодаСчета = 1;
	Пока НомерКодаСчета < 12 Цикл
		
		Область.Параметры["П"+НомерКодаСчета]        = Сред(СокрЛП(СчетДепо.Код),НомерКодаСчета,1);
		НомерКодаСчета	 =	НомерКодаСчета + 1;
		
	КонецЦикла; 
	ТабДок.Вывести(Область);
	
	//Уведомление
	Область = Макет.ПолучитьОбласть("Уведомление");	
	Если ( НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(ДатаНачПериода)) И ( НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(ДатаКонПериода))  Тогда
		Область.Параметры.в1			= "V";
		Область.Параметры.ВыбрПериод	= "с " + Формат(ДатаНачПериода,"ДЛФ=DD")+ " по " + Формат(ДатаКонПериода,"ДЛФ=DD");
	Иначе		
		Область.Параметры.в1			= "";		
		Область.Параметры.ВыбрПериод	= "с______________________г. по_______________________г. ";
	КонецЕсли; 
	Область.Параметры.в2    = "";
	Область.Параметры.в3    = "";
	Область.Параметры.в4    = "";
	Область.Параметры.в5    = "";
	Область.Параметры.в6    = "";
	Область.Параметры.в7    = "";
	
	//уведомление
	Если ЭмитентУведомление.Пустая() Тогда
		Если НЕ МХДепонента.Пустая() Тогда		
			Область.Параметры.в2    = "V";	
		Иначе 
			Область.Параметры.в2    = "";	
		КонецЕсли; 
	Иначе	
		Если НЕ МХКонтрагент.Пустая() Тогда		
			Область.Параметры.в4    = "V";	
		Иначе 
			Область.Параметры.в3    = "V";	
		КонецЕсли; 		
	КонецЕсли;
	//выписка
	Если ЭмитентВыписка.Пустая() Тогда
		Область.Параметры.в5    = "V";	
	Иначе	
		Если МХКонтрагент.Пустая() Тогда		
			Область.Параметры.в7    = "V";	
		Иначе 
			Область.Параметры.в6    = "V";	
		КонецЕсли; 		
	КонецЕсли;
	
	ТабДок.Вывести(Область);	
	
	ВывестиПодвалМакетаВТабличныйДокумент(Макет, ТабДок);
	
	ФормированиеПечатныхФорм.ПоказатьТабличныйДокумент(ТабДок);
	
КонецПроцедуры

Процедура ВывестиПодвалМакетаВТабличныйДокумент(Макет, ТабДок)
	
	Область = Макет.ПолучитьОбласть("Подвал");
	Область.Параметры.ПодписьДепонент = Инициатор.Наименование;
	ТабДок.Вывести(Область);
	
КонецПроцедуры

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
		
	Перем ВидыОпераций;
	
	ВидыОпераций = Справочники.ВидыОпераций;
	
	Если Не ЗначениеЗаполнено(Инициатор) Тогда
		
		Сообщить("Не выбран Инициатор поручения! Печать не возможна!");
		Возврат;
		
	КонецЕсли; 
	
	Если ВидОперацииД = ВидыОпераций.ОткрытиеСчетаДепо Тогда
		
		Если ТипЗнч(Инициатор) = Тип("СправочникСсылка.МестаХранения") Тогда
			Сообщить("Для вида операции: " + ВидОперацииД + " - Нет печатной формы.");
		Иначе
			ПечатьПорученияОткрытиеСчетаДепо();
		КонецЕсли;
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.НазначениеОператораСчетаДепо
		ИЛИ ВидОперацииД = ВидыОпераций.ОтменаОператораСчетаДепо   
		ИЛИ ВидОперацииД = ВидыОпераций.НазначениеРаспорядителяСчетаДепо 
		ИЛИ ВидОперацииД = ВидыОпераций.ОтменаРаспорядителяСчетаДепо Тогда
		
		ПечатьПорученияОператораРаспорядителяСчетаДепо();
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.НазначениеПопечителяСчетаДепо Тогда
		
		ПечатьПорученияНазначениеПопечителяСчетаДепо();
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.ОтзывПопечителяСчетаДепо Тогда 
		
		ПечатьПорученияОтзывПопечителяСчетаДепо();
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.ЗакрытиеСчетаДепо Тогда	
		
		ПечатьПорученияЗакрытияСчетаДепо();
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.КорректировкаРеквизитовСчетаДепо Тогда	
		
		ПечатьПорученияКорректировкаСчетаДепо();		    					
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.ПредоставлениеУведомления Тогда	
		
		ПечатьПорученияУведомлениеВыписка();
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.ОткрытиеРазделаСчетаДепо Тогда	
		
		Сообщить("Для данного вида поручения печатной формы не предусмотренно!");
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.Депонирование  
		ИЛИ ВидОперацииД = ВидыОпераций.СнятиеСДепонирования				
		ИЛИ ВидОперацииД = ВидыОпераций.Обременение
		ИЛИ ВидОперацииД = ВидыОпераций.ВозвратИзЗалога
		ИЛИ ВидОперацииД = ВидыОпераций.Конвертация
		ИЛИ ВидОперацииД = ВидыОпераций.Перевод
		ИЛИ ВидОперацииД = ВидыОпераций.ПередачаВЗалог
		ИЛИ ВидОперацииД = ВидыОпераций.Перемещение
		ИЛИ ВидОперацииД = ВидыОпераций.ПереводМеждуРазделамиСчетаДепо
		ИЛИ ВидОперацииД = ВидыОпераций.Погашение
		ИЛИ ВидОперацииД = ВидыОпераций.СписаниеАкцийПриЛиквидацииЭмитента
		ИЛИ ВидОперацииД = ВидыОпераций.СписаниеОбесценившихсяЦенныхБумаг
		ИЛИ ВидОперацииД = ВидыОпераций.ВыкупСписаниеЦБ
		ИЛИ ВидОперацииД = ВидыОпераций.СнятиеОбременения
		ИЛИ ВидОперацииД = ВидыОпераций.Разблокирование Тогда
		
		ПечатьПорученияОперацииЦБ();
		
	Иначе
		
		Сообщить("Для данного вида поручения печатной формы не предусмотренно!");
		
	КонецЕсли;   
		
КонецПроцедуры
	
#КонецЕсли

Процедура ОтправитьУведомлениеСУДК(ВебСервисДоступен = Истина) Экспорт
	
	Если Не Проведен Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ должен быть проведен!");
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(ДатаИсполненияПоручения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поручение ещё не исполнено!");
		Возврат;
	КонецЕсли;
	РегламентнаяВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Если Не ЗначениеЗаполнено(РегламентнаяВалюта) Тогда
		ТекстОшибки = "Не задана валюта регламентированного учета!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	СчетаДепо = ЦенныеБумагиСписываемые.ВыгрузитьКолонку("СчетДепо");
	ВладельцыСчетовДепо = ВладельцыСчетовДепо(СчетаДепо, Дата);
	ЭтоИностраннаяЦБ = Справочники.ВидыЦББанкаРоссии.ЭтоВидИностраннойЦБ(ЦБ.ВидЦББанкаРоссии);
	
	Если ВебСервисДоступен Тогда
		Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
	КонецЕсли;
	
	Если ВидОперацииД = Справочники.ВидыОпераций.Выкуп Тогда
		ПараметрВебСервиса = НовыйПараметрВебСервиса(Прокси, "SendEmailAboutSecuritiesRedemption");
		Для Каждого СтрокаКупон Из ЦенныеБумагиСписываемые Цикл
			ДанныеСчетаДепо = ВладельцыСчетовДепо.Найти(СтрокаКупон.СчетДепо);
			ПараметрВебСервиса.clientId 		= ?(ДанныеСчетаДепо = Неопределено, "", СокрЛП(ДанныеСчетаДепо.КодВладельца));
			ПараметрВебСервиса.securityName 	= СокрЛП(ЦБ.Эмитент);
			ПараметрВебСервиса.gosRegNumber 	= ЦБ.НомерРегистрации;
			ПараметрВебСервиса.isin 			= ЦБ.ISIN;
			ПараметрВебСервиса.quantity 		= СтрокаКупон.Количество;
			Если ЭтоИностраннаяЦБ Тогда
				ПараметрВебСервиса.rateSize 		= ВыплатаНа1ЦБ;
			Иначе
				ПараметрВебСервиса.rateSize 		= ?(СтрокаКупон.Количество = 0, 0, СтрокаКупон.Сумма / СтрокаКупон.Количество);
			КонецЕсли;
			ПараметрВебСервиса.rateCurrency 	= Валюта.НаименованиеДляОтчетов;
			ПараметрВебСервиса.incomeAmount 	= ?(ЭтоИностраннаяЦБ, СтрокаКупон.СуммаКВыплатеПоИПД, СтрокаКупон.Сумма);
			ПараметрВебСервиса.incomeCurrency 	= Валюта.НаименованиеДляОтчетов;
			Если ВебСервисДоступен Тогда
				РезультатВызова = Прокси.SendEmailAboutSecuritiesRedemption(ПараметрВебСервиса);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ПогашениеЦБПолное Или ВидОперацииД = Справочники.ВидыОпераций.ПогашениеЦБЧастичное Тогда
		ПараметрВебСервиса = НовыйПараметрВебСервиса(Прокси, "SendEmailAboutBondsRedemption");
		Для Каждого СтрокаКупон Из ЦенныеБумагиСписываемые Цикл
			ДанныеСчетаДепо = ВладельцыСчетовДепо.Найти(СтрокаКупон.СчетДепо);
			ПараметрВебСервиса.clientId 		= ?(ДанныеСчетаДепо = Неопределено, "", СокрЛП(ДанныеСчетаДепо.КодВладельца));
			ПараметрВебСервиса.bondsPaymentType	= ?(ВидОперацииД = Справочники.ВидыОпераций.ПогашениеЦБПолное, "Full", "Partial");
			ПараметрВебСервиса.securityName 	= СокрЛП(ЦБ.Эмитент);
			ПараметрВебСервиса.gosRegNumber 	= ЦБ.НомерРегистрации;
			ПараметрВебСервиса.isin 			= ЦБ.ISIN;
			ПараметрВебСервиса.dateCutOff 		= ДатаФиксации;
			ПараметрВебСервиса.quantity 		= СтрокаКупон.Количество;
			ПараметрВебСервиса.rateCurrency 	= Валюта.НаименованиеДляОтчетов;
			ПараметрВебСервиса.incomeCurrency 	= Валюта.НаименованиеДляОтчетов;
			Если ЭтоИностраннаяЦБ Тогда
				ПараметрВебСервиса.rateSize 		= ВыплатаНа1ЦБ;
				ПараметрВебСервиса.incomeAmount 	= СтрокаКупон.СуммаКВыплатеПоИПД;
			Иначе
				ПараметрВебСервиса.rateSize			= ?(СтрокаКупон.Количество = 0, 0, СтрокаКупон.Сумма / СтрокаКупон.Количество);
				ПараметрВебСервиса.incomeAmount 	= СтрокаКупон.Сумма;
			КонецЕсли;
			Если ВебСервисДоступен Тогда
				РезультатВызова = Прокси.SendEmailAboutBondsRedemption(ПараметрВебСервиса);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ПогашениеНКД Тогда
		ПараметрВебСервиса = НовыйПараметрВебСервиса(Прокси, "SendEmailAboutBondsCouponPayment");
		СтруктураНачисленияНалога = Документы.Поручение.СтруктураНачисленияНалогаПоВыплатеДохода(Ссылка);
		НачисленНалогНаЕврооблигацию = Документы.Поручение.НужноНачислитьНДФЛНаЕврооблигацию(СтруктураНачисленияНалога);
		Если НачисленНалогНаЕврооблигацию Тогда 
			СтруктураКурсаВалюты = ОбщегоНазначения.ПолучитьКурсВалюты(ЦБ.ВалютаНоминала, Дата);
		КонецЕсли;
		Для Каждого СтрокаКупон Из ЦенныеБумагиСписываемые Цикл
			Если НачисленНалогНаЕврооблигацию Тогда 
				Если СтрокаКупон.НачислитьНалог Тогда 
					СуммаНалогаВВалюте = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(СтрокаКупон.СуммаНалога, РегламентнаяВалюта,
						СтруктураНачисленияНалога.ВалютаНоминала, 1, СтруктураКурсаВалюты.Курс, 1, СтруктураКурсаВалюты.Кратность);
				Иначе 
					СуммаНалогаВВалюте = 0;
				КонецЕсли;
				СуммаБезНалога = СтрокаКупон.Сумма - СуммаНалогаВВалюте;
			Иначе 
				СуммаБезНалога = СтрокаКупон.Сумма - ?(СтрокаКупон.НачислитьНалог И (Валюта = РегламентнаяВалюта), СтрокаКупон.СуммаНалога, 0);
			КонецЕсли;
			ДанныеСчетаДепо = ВладельцыСчетовДепо.Найти(СтрокаКупон.СчетДепо);
			ПараметрВебСервиса.clientId 		= ?(ДанныеСчетаДепо = Неопределено, "", СокрЛП(ДанныеСчетаДепо.КодВладельца));
			ПараметрВебСервиса.securityName 	= СокрЛП(ЦБ.Эмитент);
			ПараметрВебСервиса.gosRegNumber 	= ЦБ.НомерРегистрации;
			ПараметрВебСервиса.isin 			= ЦБ.ISIN;
			ПараметрВебСервиса.dateCutOff 		= ДатаФиксации;
			ПараметрВебСервиса.quantity 		= СтрокаКупон.Количество;
			ПараметрВебСервиса.rateCurrency 	= Валюта.НаименованиеДляОтчетов;
			ПараметрВебСервиса.accrualCurrency 	= Валюта.НаименованиеДляОтчетов;
			ПараметрВебСервиса.taxAmount 		= СтрокаКупон.СуммаНалога;
			ПараметрВебСервиса.incomeCurrency 	= Валюта.НаименованиеДляОтчетов;
			Если ЭтоИностраннаяЦБ Тогда
				ПараметрВебСервиса.rateSize 		= ВыплатаНа1ЦБ;
				ПараметрВебСервиса.accrualAmount 	= СтрокаКупон.СуммаКВыплатеПоИПД + СтрокаКупон.СуммаНалога;
				ПараметрВебСервиса.taxCurrency 		= Валюта.НаименованиеДляОтчетов;
				ПараметрВебСервиса.incomeAmount 	= СтрокаКупон.СуммаКВыплатеПоИПД;
			Иначе
				ПараметрВебСервиса.rateSize 		= ?(СтрокаКупон.Количество = 0, 0, СтрокаКупон.Сумма / СтрокаКупон.Количество);
				ПараметрВебСервиса.accrualAmount 	= СтрокаКупон.Сумма;
				ПараметрВебСервиса.taxCurrency 		= РегламентнаяВалюта.НаименованиеДляОтчетов;
				ПараметрВебСервиса.incomeAmount 	= СуммаБезНалога;
			КонецЕсли;
			Если ВебСервисДоступен Тогда
				РезультатВызова = Прокси.SendEmailAboutBondsCouponPayment(ПараметрВебСервиса);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.НачислениеДивидендов Или ВидОперацииД = Справочники.ВидыОпераций.НачислениеДоходаПрочие Тогда
		ПараметрВебСервиса = НовыйПараметрВебСервиса(Прокси, "SendEmailAboutDividend1");
		Если ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Акция Или ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Облигация Тогда
			securityName = Строка(ЦБ.Эмитент) + " / " + ?(ЦБ.ВидЦБ = Перечисления.ВидыАкций.Обыкновенная, "АО", "АП") + " / ";
		Иначе
			securityName = Строка(ЦБ);
		КонецЕсли;
		Для Каждого СтрокаДивиденд Из ЦенныеБумагиСписываемые Цикл
			СуммаБезНалога = СтрокаДивиденд.Сумма - ?(СтрокаДивиденд.НачислитьНалог И (Валюта = РегламентнаяВалюта), СтрокаДивиденд.СуммаНалога, 0);
			ДанныеСчетаДепо = ВладельцыСчетовДепо.Найти(СтрокаДивиденд.СчетДепо);
			ПараметрВебСервиса.accrualCurrency 	= СокрП(Валюта.НаименованиеДляОтчетов);
			ПараметрВебСервиса.clientId 		= ?(ДанныеСчетаДепо = Неопределено, "", СокрЛП(ДанныеСчетаДепо.КодВладельца));
			ПараметрВебСервиса.d1 				= КоэффициентД1;
			ПараметрВебСервиса.d2 				= КоэффициентД2;
			ПараметрВебСервиса.dateCutOff 		= ДатаФиксации;
			ПараметрВебСервиса.gosRegNumber 	= ЦБ.НомерРегистрации;
			ПараметрВебСервиса.incomeCurrency 	= Валюта.НаименованиеДляОтчетов;
			ПараметрВебСервиса.isin 			= ЦБ.ISIN;
			ПараметрВебСервиса.quantity 		= СтрокаДивиденд.Количество;
			ПараметрВебСервиса.rateCurrency 	= Валюта.НаименованиеДляОтчетов;
			ПараметрВебСервиса.securityName 	= securityName;			
			ПараметрВебСервиса.taxAmount 		= СтрокаДивиденд.СуммаНалога;
			Если ЭтоИностраннаяЦБ Тогда
				ПараметрВебСервиса.accrualAmount 	= СтрокаДивиденд.СуммаКВыплатеПоИПД + СтрокаДивиденд.СуммаНалога;
				ПараметрВебСервиса.incomeAmount 	= СтрокаДивиденд.СуммаКВыплатеПоИПД;
				ПараметрВебСервиса.rateSize 		= ВыплатаНа1ЦБ;
				ПараметрВебСервиса.taxCurrency 		= Валюта.НаименованиеДляОтчетов;
			Иначе
				ПараметрВебСервиса.accrualAmount 	= СтрокаДивиденд.Сумма;
				ПараметрВебСервиса.incomeAmount 	= СуммаБезНалога;
				ПараметрВебСервиса.rateSize 		= ?(СтрокаДивиденд.Количество = 0, 0 , СтрокаДивиденд.Сумма / СтрокаДивиденд.Количество);
				ПараметрВебСервиса.taxCurrency 		= РегламентнаяВалюта.НаименованиеДляОтчетов;
			КонецЕсли;
			Если ВебСервисДоступен Тогда
				Прокси.SendEmailAboutDividend1(ПараметрВебСервиса);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ЗаписьЖурналаРегистрации("Уведомления СУДК", УровеньЖурналаРегистрации.Информация, , , "Отправлено уведомление по "+Ссылка);
	Если ВебСервисДоступен Тогда
		УведомлениеСУДКОтправлено = Истина;
		ОбменДанными.Загрузка = Истина;
		Записать();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Симуляция отправки уведомления СУДК прошла успешно.");
	КонецЕсли;
	
КонецПроцедуры

Функция ВладельцыСчетовДепо(СчетаДепо, Дата)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаДепо.Ссылка КАК СчетДепо,
	|	СчетаДепо.Владелец КАК Владелец,
	|	КодыЗагрузки.Код КАК КодВладельца
	|ИЗ
	|	Справочник.СчетаДепо КАК СчетаДепо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО СчетаДепо.Владелец = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = &Клиенты)
	|			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &Дата)
	|			И (ЛОЖЬ = КодыЗагрузки.ПометкаУдаления)
	|ГДЕ
	|	СчетаДепо.Ссылка В(&СчетаДепо)");
	Запрос.УстановитьПараметр("Клиенты", Справочники.КлассификаторыЗагрузки.Клиенты);
	Запрос.УстановитьПараметр("СчетаДепо", СчетаДепо);
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции

Функция НовыйПараметрВебСервиса(Прокси, ИмяФункции)
	Если Прокси = Неопределено Тогда
		Возврат Новый Структура("accrualAmount,accrualCurrency,bondsPaymentType,clientId,d1,d2,dateCutOff,gosRegNumber,incomeAmount,incomeCurrency,isin,quantity,rateCurrency,rateSize,securityName,taxAmount,taxCurrency");
	КонецЕсли;
	Фабрика = Прокси.ФабрикаXDTO;
	ПространствоИмен = Прокси.ТочкаПодключения.Интерфейс.URIПространстваИмен;
	ТипПараметраВебСервиса = Фабрика.Тип(ПространствоИмен, ИмяФункции);
	ПараметрВебСервиса = Фабрика.Создать(ТипПараметраВебСервиса);
	Возврат ПараметрВебСервиса;
КонецФункции

Функция ВидПоручения()
	
	Если ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
		Возврат Справочники.ВидыИнвентарныхПоручений.П20;
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Перемещение Тогда
		Возврат Справочники.ВидыИнвентарныхПоручений.П10;
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо Тогда
		Возврат Справочники.ВидыИнвентарныхПоручений.П90;
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.ЗакрытиеРазделаСчетаДепо Тогда
		Возврат Справочники.ВидыИнвентарныхПоручений.П91;
	Иначе
		Если ВидОперацииД = Справочники.ВидыОпераций.Депонирование
			Или ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
			
			ЭтоПоручениеПоПаям = ЭтоПоручениеПоПаям();
			ЮрФизЛицоДепонентаКонтрагентаОдинаково = ЮрФизЛицоДепонентаКонтрагентаОдинаково();
			
			Если ВидОперацииД = Справочники.ВидыОпераций.Депонирование И ЮрФизЛицоДепонентаКонтрагентаОдинаково Тогда
				Возврат Справочники.ВидыИнвентарныхПоручений.П35;
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования И ЮрФизЛицоДепонентаКонтрагентаОдинаково Тогда
				Возврат Справочники.ВидыИнвентарныхПоручений.П36_Реестр;
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Депонирование И ЭтоПоручениеПоПаям Тогда
				Возврат Справочники.ВидыИнвентарныхПоручений.П35_2;
			ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования И ЭтоПоручениеПоПаям Тогда
				Возврат Справочники.ВидыИнвентарныхПоручений.П36_2;
			КонецЕсли;
		КонецЕсли;
		
		Если СчетДепоКонтрагента.ПризнакСчетаДепо = Перечисления.ПризнакиСчетаДепо.СчетКонтрагента ИЛИ СчетДепоКонтрагента = Справочники.СчетаДепо.ПустаяСсылка() Тогда
			Если МХКонтрагент = Константы.МестоХраненияПоУмолчанию.Получить() Тогда
				Если ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
					Если СуммаСделки = 0 И ЦенныеБумагиСписываемые.Итог("Сумма") = 0 Тогда
						Возврат Справочники.ВидыИнвентарныхПоручений.П16;
					Иначе
						Возврат Справочники.ВидыИнвентарныхПоручений.П19_0;
					КонецЕсли;
				ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Депонирование Тогда
					Если СуммаСделки = 0 И ЦенныеБумагиСписываемые.Итог("Сумма") = 0 Тогда
						Возврат Справочники.ВидыИнвентарныхПоручений.П16_1;
					Иначе
						Возврат Справочники.ВидыИнвентарныхПоручений.П19_1;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
					Возврат Справочники.ВидыИнвентарныхПоручений.П36;
				ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Депонирование Тогда
					Возврат Справочники.ВидыИнвентарныхПоручений.П37;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.ВидыИнвентарныхПоручений.ПустаяСсылка();
КонецФункции // ВидПоручения()

Процедура ДобавитьЗаписьВРССостоянияУведомленийОбОперацияхСЦБ()
	
	Запись = РегистрыСведений.СостоянияУведомленийОбОперацияхСЦБ.СоздатьМенеджерЗаписи();
	Запись.Поручение = Ссылка;
	Запись.Подготовлено = Ложь;
	Запись.Записать();

КонецПроцедуры

Процедура УдалитьЗаписьИзРССостоянияУведомленийОбОперацияхСЦБ()
	
	НаборЗаписей = РегистрыСведений.СостоянияУведомленийОбОперацияхСЦБ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Поручение.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоВыплатаДоходаПоПрогрессивнойШкалеНДФЛ()
	Возврат ТипЗнч(ВидОперацииД) = Тип("СправочникСсылка.ВидыОпераций")
		И ВидОперацииД.ВыплатаДоходаВДенежнойФорме
		И Документы.НачисленныйНалог.ИспользоватьРасчетНДФЛПоПрогрессивнойШкале(Дата);
КонецФункции

// Возвращает необходимость изменения признака "Начислить комиссию депо" при исполнении или отмене исполнения
//   поручений с видами Отмена и УчастиеВКД
// 
// Возвращаемое значение:
//  Булево - признак необходимости изменения НачислитьКомиссиюДепо
//
Функция НеобходимоИзменитьПризнакНачислитьКомиссиюДепоПриИсполнении() Экспорт
	
	ОрганизацияПоУмолчанию = ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию();
	МестоХраненияПоУмолчанию = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияПоУмолчанию");
	
	Возврат Инициатор <> ОрганизацияПоУмолчанию
		И Инициатор <> МестоХраненияПоУмолчанию
		И (ВидОперацииД = Справочники.ВидыОпераций.УчастиеВКД
		Или ВидОперацииД = Справочники.ВидыОпераций.ОтменаПоручения);
	
КонецФункции

Функция ЮрФизЛицоДепонентаКонтрагентаОдинаково()
	
	Если ЗначениеЗаполнено(Депонент) И ТипЗнч(Депонент) = Тип("СправочникСсылка.Контрагенты")
		И ЗначениеЗаполнено(Контрагент) Тогда
		
		ДепонентЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Депонент, "ЮридическиеФизическиеЛица");
		КонтрагентЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ЮридическиеФизическиеЛица");
		
		Результат = ЗначениеЗаполнено(ДепонентЮрФизЛицо)
			И ЗначениеЗаполнено(КонтрагентЮрФизЛицо) И (ДепонентЮрФизЛицо = КонтрагентЮрФизЛицо);
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьНеобходимостьНачисленияНалога(Строка)
	
	РеквизитыДепонента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Строка.СчетДепо, Новый Структура("ЮрФизЛицо", "Владелец.ЮрФизЛицо"));
	ВалютаПоручения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчет, "ВалютаДенежныхСредств");
	ДепонентЮрЛицо = РеквизитыДепонента.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
	ОчиститьНалог =
		ЗначениеЗаполнено(ВалютаПоручения) И ВалютаПоручения <> ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ВалютаРегламентированногоУчета")
		И (Не Строка.Резидент Или ДепонентЮрЛицо);
	Если Не ОчиститьНалог И ВидОперацииД = Справочники.ВидыОпераций.ПогашениеНКД И ЗначениеЗаполнено(Строка.БанковскийСчет) Тогда
		Если Не Строка.Резидент И ДепонентЮрЛицо Тогда
			Возврат;
		КонецЕсли;
		ТипыБрокерскихБанковскихСчетов = Новый СписокЗначений;
		ТипыБрокерскихБанковскихСчетов.Добавить(Перечисления.ТипыНазначенияБанковскихСчетов.Брокерский);
		ТипыБрокерскихБанковскихСчетов.Добавить(Перечисления.ТипыНазначенияБанковскихСчетов.БрокерскийТранзит);
		ТипНазначения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.БанковскийСчет, "ТипНазначения");
		Если ТипыБрокерскихБанковскихСчетов.НайтиПоЗначению(ТипНазначения) <> Неопределено Тогда
			ОчиститьНалог = Истина;
		КонецЕсли;
	КонецЕсли;
	Если ОчиститьНалог Тогда
		ОчиститьНалогиВСтроке(Строка);
	КонецЕсли;
	
КонецПроцедуры

Функция НайденБанковскийСчетИзСчетовДляВыплатыДоходов(ТекущийДепонент, Строка, СчетаДляВыплатыДоходов)
	
	НайденБанковскийСчет = Ложь;
	
	Если ВидОперацииД.ВыплатаДоходаВДенежнойФорме Тогда
		
		ТекущийСчетДляВыплатыДоходов = СчетаДляВыплатыДоходов.Найти(ТекущийДепонент, "Депонент");
		Если ТекущийСчетДляВыплатыДоходов <> Неопределено Тогда
			Строка.БанковскийСчет = ТекущийСчетДляВыплатыДоходов.БанковскийСчет;
			НайденБанковскийСчет = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НайденБанковскийСчет;
	
КонецФункции

Функция НайденБанковскийСчетИзРасчетныхКодовДляВыплатыДоходовКлиентам(ТекущийДепонент, Строка, РасчетныеКодыДляВыплатыДоходов)
	
	НайденБанковскийСчет = Ложь;
	
	ТекущийРасчетныйКод = РасчетныеКодыДляВыплатыДоходов.Найти(ТекущийДепонент, "Депонент");
	Если ТекущийРасчетныйКод <> Неопределено Тогда
		Строка.БанковскийСчет = ТекущийРасчетныйКод.РасчетныйКод;
		НайденБанковскийСчет = Истина;
	КонецЕсли;
	
	Возврат НайденБанковскийСчет;
	
КонецФункции

Функция НайденБанковскийСчетИзБрокерскихСчетов(ТекущийДепонент, Строка, БрокерскиеСчета)
	
	НайденБанковскийСчет = Ложь;
	
	ИмяРеквизитаДепонент = "Депонент";
	ТекущийБС = БрокерскиеСчета.БС.Найти(ТекущийДепонент, ИмяРеквизитаДепонент);
	Если ТекущийБС <> Неопределено Тогда
		Строка.БанковскийСчет = ТекущийБС.БанковскийСчет;
		НайденБанковскийСчет = Истина;
	Иначе
		// Продолжим поиск в БС по пустому депоненту с правом для текущего депонента
		Права = БрокерскиеСчета.Права.Найти(ТекущийДепонент, ИмяРеквизитаДепонент);
		Если Права <> Неопределено Тогда
			ПравоИспользованияДС = Права.ПравоПредоставлено;
		Иначе
			ПравоИспользованияДС = Ложь;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить(ИмяРеквизитаДепонент,	Справочники.Контрагенты.ПустаяСсылка());
		Отбор.Вставить("ИспользованиеДС",		ПравоИспользованияДС);
		СтрокиБС = БрокерскиеСчета.БС.НайтиСтроки(Отбор);
		Если СтрокиБС.Количество() > 0 Тогда
			Строка.БанковскийСчет = СтрокиБС[0].БанковскийСчет;
			НайденБанковскийСчет = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НайденБанковскийСчет;
	
КонецФункции

Процедура ОчиститьНалогиВСтроке(СтрокаДанных)
	
	СтрокаДанных.НачислитьНалог 			= Ложь;
	СтрокаДанных.СуммаОсвобожденнаяОтНалога = 0;
	СтрокаДанных.СтавкаНалога				= 0;
	СтрокаДанных.СуммаНалога				= 0;
	СтрокаДанных.СтатьиНКРФСоглашения		= "";
	
КонецПроцедуры

Функция ЭтоПоручениеПоПаям()
	Если Не ЗначениеЗаполнено(ПаиТипЗаявки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Документы.Поручение.ЭтоНеторговоеПоручениеСоСпискомЦБ(ЭтотОбъект) И ЦенныеБумагиСписываемые.Количество() > 0 Тогда
		ТипЦБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦенныеБумагиСписываемые[0].ЦеннаяБумага, "ТипЦБ");
	Иначе
		ТипЦБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦБ, "ТипЦБ");
	КонецЕсли;
	
	Возврат ТипЦБ = Перечисления.ТипыЦБ.Пай;
КонецФункции

Функция ПройденКонтрольЗаполненияПаи(ПаиТипЗаявки, ТекстОшибкиЗаполнения)
	
	Если ПаиТипЗаявки = Перечисления.ПаиТипыЗаявок.REDEMPTION Тогда
		ПройденКонтроль = ЦенныеБумагиСписываемые.Итог("Количество") > 0;
		ТекстОшибкиЗаполнения = ?(ПройденКонтроль, "", "Не указано количество!");
	ИначеЕсли ПаиТипЗаявки = Перечисления.ПаиТипыЗаявок.SINGLE_BUY Или ПаиТипЗаявки = Перечисления.ПаиТипыЗаявок.MULTI_BUY Тогда
		ПройденКонтроль = ЦенныеБумагиСписываемые.Итог("Сумма") > 0;
		ТекстОшибкиЗаполнения = ?(ПройденКонтроль, "", "Не указана сумма!");
	Иначе
		ТекстОшибкиЗаполнения = "";
		ПройденКонтроль = Истина;
	КонецЕсли;
	
	Возврат ПройденКонтроль;
	
КонецФункции

Процедура КонтрольНаВидПорученияИОперации()
	ИмяПараметра = ИмяПараметраКонтроляПоВидуОперации(ВидОперацииД);
	Если ИмяПараметра <> Неопределено Тогда
		КодыВидовПорученийСтрокой = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра(ИмяПараметра, "");
		КодыВидовПоручений = СтрРазделить(КодыВидовПорученийСтрокой, ",");
		КодВидаПоручения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидПоручения, "Код");
		Если КодыВидовПоручений.Найти(КодВидаПоручения) = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вид поручения не соответствует виду операции!", ЭтотОбъект, "ВидПоручения");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ИмяПараметраКонтроляПоВидуОперации(ВидОперации)
	ПараметрыКонтроляПоВидуПоручения = Новый Соответствие;
	ПараметрыКонтроляПоВидуПоручения.Вставить(Справочники.ВидыОпераций.Депонирование,
		"1365.КонтрольПорученийНаВидПорученияИОперации.ЗачислениеЦБ");
	ПараметрыКонтроляПоВидуПоручения.Вставить(Справочники.ВидыОпераций.СнятиеСДепонирования,
		"1365.КонтрольПорученийНаВидПорученияИОперации.СписаниеЦБ");
	Возврат ПараметрыКонтроляПоВидуПоручения[ВидОперации];
КонецФункции

Функция РазделСчетаДепоМХПоДокументуОснованию(ДокОткрытиеРазделаСчетаДепо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РазделыСчетаДепоМХ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РазделыСчетаДепоМХ КАК РазделыСчетаДепоМХ
	|ГДЕ
	|	РазделыСчетаДепоМХ.Код = &Код
	|	И РазделыСчетаДепоМХ.Владелец = &Владелец
	|	И РазделыСчетаДепоМХ.ТипРазделаСчетаДЕПО = &ТипРаздела
	|	И РазделыСчетаДепоМХ.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Открыт)";
	
	Запрос.УстановитьПараметр("Код", ДокОткрытиеРазделаСчетаДепо.НомерРазделаСчетаДепоМХ);
	Запрос.УстановитьПараметр("Владелец", ДокОткрытиеРазделаСчетаДепо.СчетДепоМХ);
	Запрос.УстановитьПараметр("ТипРаздела", ДокОткрытиеРазделаСчетаДепо.ТипРазделаСчетаДЕПО);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Результат = Выборка.Ссылка;
	Иначе 
		Результат = Справочники.РазделыСчетаДепоМХ.ПустаяСсылка();
	КонецЕсли;
	Возврат Результат; 
	
КонецФункции

Функция СвязаннаяОперацияЦБ()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОперацииЦБ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОперацииЦБ КАК ОперацииЦБ
	|ГДЕ
	|	(ОперацииЦБ.ДокументОснование = &ДокументОснование
	|			ИЛИ ОперацииЦБ.ДокументОснованиеВстречный = &ДокументОснование)
	|	");
	
	Запрос.УстановитьПараметр("ДокументОснование",Ссылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Документы.ОперацииЦБ.ПолучитьСсылку();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьОчиститьУИН()
	Если Документы.Поручение.ТребуетсяУИН(ВидОперацииД, ВидПоручения, РазделСчетаДепо) Тогда
		ИННОрганизации = Константы.ОрганизацияПоУмолчанию.Получить().ИНН;
		ИсточникИНН = "";
		ИННКонтрагента = ИННКонтрагента(ИсточникИНН);
		ДатаПоручения = Формат(Дата, "ДФ=""ддММгггг""");
		НомерПоручения = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Номер, 18, "0", "Слева");
		УИН = "1" + СокрЛП(ИННОрганизации) + ИННКонтрагента + ДатаПоручения + НомерПоручения;
		ДлинаУИН = СтрДлина(УИН);
		СтандартнаяДлинаУИН = 47;
		ДлинаИННЮрЛиц = 10;
		Если ДлинаУИН <> СтандартнаяДлинаУИН Тогда
			ТекстСообщения = "Длина УИН не равна ожидавшимся " + Строка(СтандартнаяДлинаУИН) + " символам (" + Строка(ДлинаУИН) + ")!";
			Если Не ЗначениеЗаполнено(Контрагент) Тогда
				Причина = "в поручении не указан контрагент - не возможно определить его ИНН и вставить в УИН ...";
				ТекстСообщения = ТекстСообщения + " Вероятная причина - " + Причина;
			ИначеЕсли Не ЗначениеЗаполнено(ИННКонтрагента) Тогда
				Причина = "не заполнены ни ИНН в карточке Контрагента, ни ИНН в карточке его Юрлица ...";
				ТекстСообщения = ТекстСообщения + " Вероятная причина - " + Причина;
			Иначе
				Если СтрДлина(ИННКонтрагента) <> ДлинаИННЮрЛиц Тогда
					Причина = "длина " + ИсточникИНН + " (" + ИННКонтрагента + ") не равна 10 символам ...";
					ТекстСообщения = ТекстСообщения + " Вероятная причина - " + Причина;
				КонецЕсли;
			КонецЕсли;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Поле = "УИН";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		КонецЕсли;
	Иначе
		УИН = "";
	КонецЕсли;
КонецПроцедуры

Функция ИННКонтрагента(ИсточникИНН)
	ИННКонтрагента = "";
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ЮрЛицо = Контрагент.ЮридическиеФизическиеЛица;
		Если ЗначениеЗаполнено(ЮрЛицо) И ТипЗнч(ЮрЛицо) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
			ИННКонтрагента = СокрЛП(ЮрЛицо.ИНН);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ИННКонтрагента) Тогда
			ИННКонтрагента = СокрЛП(Контрагент.ИНН);
			ИсточникИНН = "ИНН в карточке контрагента";
		Иначе
			ИсточникИНН = "ИНН в карточке юридического лица контрагента";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИННКонтрагента;
КонецФункции

Процедура ВыполнитьКонтрольПоручения(СобытиеКонтроля, Отказ)
	Если ДополнительныеСвойства.Свойство("ОтменитьКонтроль") И ДополнительныеСвойства.ОтменитьКонтроль Тогда
		Возврат;
	КонецЕсли;
	
	СообщенияКонтроля = Справочники.КонтрольПоручений.СообщенияКонтроляПоручений(Ссылка, СобытиеКонтроля);
	
	Если СообщенияКонтроля.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Справочники.КонтрольПоручений.ПоказатьСообщенияКонтроляПоручений(СообщенияКонтроля, Отказ);
	Для Каждого РезультатКонтроля Из СообщенияКонтроля Цикл
		Если РезультатКонтроля.ОтправкаУведомленияПоЭлектроннойПочте Тогда
			Если Отказ Тогда
				// Это может происходить внутри транзакции, пример в обработчике собития ПередЗаписью, поэтому если писать
				// в регистр уведомлений к отправке  в том же сеансе, то при при откате транзакции исчезнет и новая запись
				// с уведомлением. Приходится писать в другом сеансе с использованием механизма фоновых заданий
				ПараметрыФоновогоЗадания = Новый Массив;
				ПараметрыФоновогоЗадания.Добавить(Ссылка);
				ПараметрыФоновогоЗадания.Добавить(СообщенияКонтроля);
				Ключ = Новый УникальныйИдентификатор;
				Наименование = "Отправить письмо с результатом сработавшего контроля поручения";
				ФоновыеЗадания.Выполнить("УправлениеЭлектроннойПочтой.ОтправитьСообщенияКонтроляПорученийПоЭлектроннойПочте",
											ПараметрыФоновогоЗадания, Ключ, Наименование);
			Иначе
				УправлениеЭлектроннойПочтой.ОтправитьСообщенияКонтроляПорученийПоЭлектроннойПочте(Ссылка, СообщенияКонтроля);
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

МХ_Константа = Константы.МестоХраненияПоУмолчанию.Получить();	
ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
