
#Область СлужебныеПроцедурыИФункции

// Функция - Получить список услуг
//
// Параметры:
//  Основание	 - ДокументСсылка.ИзменениеТарифногоПлана - Ссылка на документ
// 
// Возвращаемое значение:
//   - СписокЗначений - Список Услуг из таблиц ДействующиеУслугиКОтмене и УслугиКНазначению
//
Функция ПолучитьСписокУслуг(Основание) Экспорт
	
	СписокУслуг = Новый СписокЗначений;
	
	Для Каждого ДействующаяУслугаКОтмене Из Основание.ДействующиеУслугиКОтмене Цикл
		Если Не ДействующаяУслугаКОтмене.Дубль Тогда
			СписокУслуг.Добавить(ДействующаяУслугаКОтмене.Услуга, , Ложь);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УслугаКНазначению Из Основание.УслугиКНазначению Цикл
		Если Не УслугаКНазначению.Дубль Тогда
			СписокУслуг.Добавить(УслугаКНазначению.Услуга, , Истина);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокУслуг;
	
КонецФункции

// Процедура - Удалить записи регистра сведений регистр назначенных комиссий
//
// Параметры:
//  Основание	 - ДокументСсылка.ИзменениеТарифногоПлана - Ссылка на документ, записи которого будут удалены
//  Отказ		 - Булево - Отказ от выполнения операции
//
Процедура УдалитьЗаписиРегистраСведенийРегистрНазначенныхКомиссий(Основание, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрНазначенныхКомиссий.Период КАК Период,
	|	РегистрНазначенныхКомиссий.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РегистрНазначенныхКомиссий.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.РегистрНазначенныхКомиссий КАК РегистрНазначенныхКомиссий
	|ГДЕ
	|	РегистрНазначенныхКомиссий.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.РегистрНазначенныхКомиссий.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
			НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(ВыборкаДетальныеЗаписи.ДоговорКонтрагента);
			НаборЗаписей.Отбор.Услуга.Установить(ВыборкаДетальныеЗаписи.Услуга);
			НаборЗаписей.Записать();
			
		Исключение
			ОтменитьТранзакцию();
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации("Попытка отмены : " + Основание,
			УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
			Отказ = Истина;
			
			ВызватьИсключение ПредставлениеОшибки;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Процедура - Изменить записи регистра сведений регистр назначенных комиссий
//
// Параметры:
//  Основание	 - ДокументСсылка.ИзменениеТарифногоПлана - Ссылка на документ, записи которого будут изменены
//  Отказ		 - Булево - Отказ от выполнения операции
//
Процедура ИзменитьЗаписиРегистраСведенийРегистрНазначенныхКомиссий(Основание, Отказ) Экспорт
	
	ДатаИзмененияТарифа = Основание.ДатаИзмененияТарифа;
	ДоговорСКлиентом	= Основание.ДоговорСКлиентом;
	
	СписокУслуг = Документы.ИзменениеТарифногоПлана.ПолучитьСписокУслуг(Основание);
	
	НачатьТранзакцию();
	
	Для Каждого УслугаВРегистр Из СписокУслуг Цикл
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.РегистрНазначенныхКомиссий.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ДатаИзмененияТарифа);
			НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(ДоговорСКлиентом);
			НаборЗаписей.Отбор.Услуга.Установить(УслугаВРегистр.Значение);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			
			НоваяЗапись.Период 				= ДатаИзмененияТарифа;
			НоваяЗапись.ДоговорКонтрагента 	= ДоговорСКлиентом;
			НоваяЗапись.Услуга				= УслугаВРегистр.Значение;
			
			НоваяЗапись.ФлагАктивности = УслугаВРегистр.Пометка;
			
			НоваяЗапись.Основание = Основание;
			
			НаборЗаписей.Записать(Ложь); // Документ не будет проведен если хотя бы одна запись уже будет в регистре ранее
			
		Исключение
			ОтменитьТранзакцию();
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации("Попытка проведения : " + Основание,
			УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
			Отказ = Истина;
			
			ВызватьИсключение ПредставлениеОшибки;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Процедура - Удалить записи регистра сведений Предоставленные документы
//
// Параметры:
//  Основание	 - ДокументСсылка.ИзменениеТарифногоПлана - Ссылка на документ, записи которого будут удалены
//  Отказ		 - Булево - Отказ от выполнения операции
//
Процедура УдалитьЗаписиРегистраСведенийПредоставленныеДокументы(Основание, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПредоставленныеДокументы.Период КАК Период,
	|	ПредоставленныеДокументы.Депонент КАК Депонент,
	|	ПредоставленныеДокументы.ВидДокумента КАК ВидДокумента,
	|	ПредоставленныеДокументы.Лицо КАК Лицо
	|ИЗ
	|	РегистрСведений.ПредоставленныеДокументы КАК ПредоставленныеДокументы
	|ГДЕ
	|	ПредоставленныеДокументы.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.ПредоставленныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
			НаборЗаписей.Отбор.Депонент.Установить(ВыборкаДетальныеЗаписи.Депонент);
			НаборЗаписей.Отбор.ВидДокумента.Установить(ВыборкаДетальныеЗаписи.ВидДокумента);
			НаборЗаписей.Отбор.Лицо.Установить(ВыборкаДетальныеЗаписи.Лицо);
			НаборЗаписей.Записать();
			
		Исключение
			ОтменитьТранзакцию();
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации("Попытка отмены : " + Основание,
			УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
			Отказ = Истина;
			
			ВызватьИсключение ПредставлениеОшибки;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Процедура - Изменить записи регистра сведений Предоставленные документы
//
// Параметры:
//  Основание	 - ДокументСсылка.ИзменениеТарифногоПлана - Ссылка на документ, записи которого будут изменены
//  Отказ		 - Булево - Отказ от выполнения операции
//
Процедура ИзменитьЗаписиРегистраСведенийПредоставленныеДокументы(Основание, Отказ) Экспорт
	
	СписокУслуг = Документы.ИзменениеТарифногоПлана.ПолучитьСписокУслуг(Основание);
	Если СписокУслуг.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Период = Основание.Дата;
	Депонент = Основание.Клиент;
	ВидДокумента = Справочники.ВидыДокументовУдостоверяющихПолномочия.ДополнительноеСоглашениеТариф;
	Лицо = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Депонент, "ЮридическиеФизическиеЛица");
	
	Попытка
		
		НаборЗаписей = РегистрыСведений.ПредоставленныеДокументы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Период);
		НаборЗаписей.Отбор.Депонент.Установить(Депонент);
		НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента);
		НаборЗаписей.Отбор.Лицо.Установить(Лицо);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Период					= Период;
		НоваяЗапись.Депонент				= Депонент;
		НоваяЗапись.ВидДокумента			= ВидДокумента;
		НоваяЗапись.Лицо					= Лицо;
		
		НоваяЗапись.ДатаПредоставления 		= Основание.ДатаИзмененияТарифа;
		НоваяЗапись.Примечание				= "" + Основание.НовыйТарифныйПлан;
		
		НоваяЗапись.Основание = Основание;
		
		НаборЗаписей.Записать(Ложь); // Документ не будет проведен если запись уже будет в регистре ранее
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации("Попытка проведения : " + Основание,
		УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
		Отказ = Истина;
		
		ВызватьИсключение ПредставлениеОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

// Процедура - Изменить предыдущую запись регистра сведений Предоставленные документы
//
// Параметры:
//  Основание	 - ДокументСсылка.ИзменениеТарифногоПлана - Ссылка на документ, запись ранее которого будет изменена
//  Отказ		 - Булево - Отказ от выполнения операции
//  ЭтоУдаление	 - Булево - Информация о причине изменения предыдущей записи
//
Процедура ИзменитьПредыдущуюЗаписьРегистраСведенийПредоставленныеДокументы(Основание, Отказ, ЭтоУдаление) Экспорт
	
	СписокУслуг = Документы.ИзменениеТарифногоПлана.ПолучитьСписокУслуг(Основание);
	Если СписокУслуг.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Период = Основание.Дата;
	Депонент = Основание.Клиент;
	ВидДокумента = Справочники.ВидыДокументовУдостоверяющихПолномочия.ДополнительноеСоглашениеТариф;
	Лицо = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Депонент, "ЮридическиеФизическиеЛица");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПредоставленныеДокументы.Период КАК Период,
	|	ПредоставленныеДокументы.Депонент КАК Депонент,
	|	ПредоставленныеДокументы.ВидДокумента КАК ВидДокумента,
	|	ПредоставленныеДокументы.Лицо КАК Лицо,
	|	ПредоставленныеДокументы.СрокДействия КАК СрокДействия,
	|	ПредоставленныеДокументы.ДатаПредоставления КАК ДатаПредоставления,
	|	ПредоставленныеДокументы.Примечание КАК Примечание,
	|	ПредоставленныеДокументы.ПредоставленнаяФорма КАК ПредоставленнаяФорма,
	|	ПредоставленныеДокументы.Основание КАК Основание
	|ИЗ
	|	РегистрСведений.ПредоставленныеДокументы КАК ПредоставленныеДокументы
	|ГДЕ
	|	ПредоставленныеДокументы.Период < &Период
	|	И ПредоставленныеДокументы.Депонент = &Депонент
	|	И ПредоставленныеДокументы.ВидДокумента = &ВидДокумента
	|	И ПредоставленныеДокументы.Лицо = &Лицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Запрос.УстановитьПараметр("Депонент", Депонент);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Лицо", Лицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.ПредоставленныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
			НаборЗаписей.Отбор.Депонент.Установить(ВыборкаДетальныеЗаписи.Депонент);
			НаборЗаписей.Отбор.ВидДокумента.Установить(ВыборкаДетальныеЗаписи.ВидДокумента);
			НаборЗаписей.Отбор.Лицо.Установить(ВыборкаДетальныеЗаписи.Лицо);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			
			НоваяЗапись.Период					= ВыборкаДетальныеЗаписи.Период;
			НоваяЗапись.Депонент				= ВыборкаДетальныеЗаписи.Депонент;
			НоваяЗапись.ВидДокумента			= ВыборкаДетальныеЗаписи.ВидДокумента;
			НоваяЗапись.Лицо					= ВыборкаДетальныеЗаписи.Лицо;
			
			Если ЭтоУдаление Тогда
				НоваяЗапись.СрокДействия 			= Дата(1, 1, 1);
			Иначе
				СрокДействияПредварительно 			= НачалоДня(Основание.ДатаИзмененияТарифа) - 1;
				НоваяЗапись.СрокДействия 			= Макс(СрокДействияПредварительно, ВыборкаДетальныеЗаписи.ДатаПредоставления);
			КонецЕсли;
			
			НоваяЗапись.ДатаПредоставления 		= ВыборкаДетальныеЗаписи.ДатаПредоставления;
			НоваяЗапись.Примечание				= ВыборкаДетальныеЗаписи.Примечание;
			НоваяЗапись.ПредоставленнаяФорма	= ВыборкаДетальныеЗаписи.ПредоставленнаяФорма;
			
			НоваяЗапись.Основание 				= ВыборкаДетальныеЗаписи.Основание;
			
			НаборЗаписей.Записать(Истина); // Перезаписать
			
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации("Попытка изменения срока действия : " + Основание,
			УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
			Отказ = Истина;
			
			ВызватьИсключение ПредставлениеОшибки;
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти