
#Область СлужебныеПроцедурыИФункции

// Процедура - Заполнить действующие услуги
//
Процедура ЗаполнитьДействующиеУслуги() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Основание", Ссылка);
	
	Запрос.УстановитьПараметр("Период", ДатаИзмененияТарифа);
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорСКлиентом);
	
	Запрос.УстановитьПараметр("ПустойДоговор", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрНазначенныхКомиссийСрезПоследних.Период КАК Период,
	|	РегистрНазначенныхКомиссийСрезПоследних.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.РегистрНазначенныхКомиссий.СрезПоследних(
	|			&Период,
	|			ДоговорКонтрагента = &ДоговорКонтрагента
	|				И ДоговорКонтрагента <> &ПустойДоговор
	|				И Основание <> &Основание) КАК РегистрНазначенныхКомиссийСрезПоследних
	|ГДЕ
	|	РегистрНазначенныхКомиссийСрезПоследних.ФлагАктивности = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Услуга";
	
	ДействующиеУслуги = Запрос.Выполнить().Выгрузить();
	
	ДействующиеУслугиКОтмене.Загрузить(ДействующиеУслуги);
	
	НайтиДублиУслуг();
	
КонецПроцедуры

// Процедура - Заполнить услуги к назначению (по новому тарифному плану)
//
Процедура ЗаполнитьУслугиКНазначению() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НовыйТарифныйПлан", НовыйТарифныйПлан);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТарифныеПланыУслугиТарифногоПлана.Услуга КАК Услуга
	|ИЗ
	|	Справочник.ТарифныеПланы.УслугиТарифногоПлана КАК ТарифныеПланыУслугиТарифногоПлана
	|ГДЕ
	|	ТарифныеПланыУслугиТарифногоПлана.Ссылка = &НовыйТарифныйПлан
	|
	|СГРУППИРОВАТЬ ПО
	|	ТарифныеПланыУслугиТарифногоПлана.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	Услуга";
	
	УслугиНовогоТарифногоПлана = Запрос.Выполнить().Выгрузить();
	
	УслугиКНазначению.Загрузить(УслугиНовогоТарифногоПлана);
	
	НайтиДублиУслуг();
	
КонецПроцедуры

// Процедура - Найти одинаковые услуги среди ДействующиеУслугиКОтмене и УслугиКНазначению
//
Процедура НайтиДублиУслуг() Экспорт
	
	Для Каждого ДействующаяУслуга Из ДействующиеУслугиКОтмене Цикл
		
		ДействующаяУслуга.Дубль = Ложь;
		
	КонецЦикла;
	
	Для Каждого УслугаКНазначению Из УслугиКНазначению Цикл
		
		СтруктураПоиска = Новый Структура("Услуга", УслугаКНазначению.Услуга);
		
		Дубли = ДействующиеУслугиКОтмене.НайтиСтроки(СтруктураПоиска);
		
		Если Дубли.Количество() > 0 Тогда
			
			УслугаКНазначению.Дубль = Истина;
			
			Для Каждого ДействующаяУслуга Из Дубли Цикл
				
				ДействующаяУслуга.Дубль = Истина;
				
			КонецЦикла;
		Иначе
			
			УслугаКНазначению.Дубль = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - При копировании
//
// Параметры:
//  ОбъектКопирования	 - ДокументОбъект.ИзменениеТарифногоПлана - Объект копирования
//
Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаИзмененияТарифа = Дата(1, 1, 1);
	
	ДействующиеУслугиКОтмене.Очистить();
	
	Комментарий = "";
	
	Изменил = Справочники.Пользователи.ПустаяСсылка();
	
	Автор = Справочники.Пользователи.ПустаяСсылка();
	
КонецПроцедуры

// Процедура - Обработка проведения
//
// Параметры:
//  Отказ			 - Булево - Признак проведения документа
//  РежимПроведения	 - РежимПроведенияДокумента - Текущий режим проведения
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОбработкаУдаленияПроведения(Отказ);
	
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Попытка
		
		Документы.ИзменениеТарифногоПлана.ИзменитьЗаписиРегистраСведенийРегистрНазначенныхКомиссий(Ссылка, Отказ);
		
		Документы.ИзменениеТарифногоПлана.ИзменитьЗаписиРегистраСведенийПредоставленныеДокументы(Ссылка, Отказ);
		
		ЭтоУдаление = Ложь;
		
		Документы.ИзменениеТарифногоПлана.ИзменитьПредыдущуюЗаписьРегистраСведенийПредоставленныеДокументы(Ссылка, Отказ, ЭтоУдаление);
		
	Исключение
		
		ТекстСообщения = ОписаниеОшибки();
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

// Процедура - Обработка удаления проведения
//
// Параметры:
//  Отказ	 - Булево - Признак отмены проведения документа
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Попытка
		
		Документы.ИзменениеТарифногоПлана.УдалитьЗаписиРегистраСведенийРегистрНазначенныхКомиссий(Ссылка, Отказ);
		
		Документы.ИзменениеТарифногоПлана.УдалитьЗаписиРегистраСведенийПредоставленныеДокументы(Ссылка, Отказ);
		
		ЭтоУдаление = Истина;
		
		Документы.ИзменениеТарифногоПлана.ИзменитьПредыдущуюЗаписьРегистраСведенийПредоставленныеДокументы(Ссылка, Отказ, ЭтоУдаление);
		
	Исключение
		
		ТекстСообщения = ОписаниеОшибки();
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

// Процедура - Перед записью
//
// Параметры:
//  Отказ			 - Булево - Признак записи документа
//  РежимЗаписи		 - РежимЗаписиДокумента - Текущий режим записи
//  РежимПроведения	 - РежимПроведенияДокумента - Текущий режим проведения
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЭтоНовый() Тогда
		
		Изменил = ПараметрыСеанса.ТекущийПользователь;
		
	Иначе
		
		Автор = ПараметрыСеанса.ТекущийПользователь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти