Процедура ЗаполнитьРеквизитыПриВводеНовогоДокумента(Объект) Экспорт
	Если Объект.ЭтоНовый() Тогда 
        Объект.Организация = ПараметрыСеанса.Организация;
		Объект.Автор = ПараметрыСеанса.Сотрудник;
		Объект.Дата = ТекущаяДата();
		Объект.УстановитьНовыйНомер();
	Иначе
		Объект.Изменил = ПараметрыСеанса.Сотрудник;
	КонецЕсли;	
КонецПроцедуры

Функция ПроверкаРеквизитов(Объект, СписокРеквизитов) Экспорт
	Результат = Ложь;
	Для Каждого Реквизит  Из СписокРеквизитов Цикл
		Если ОбщегоНазначения.ЗначениеНеЗаполнено(Объект[Реквизит.Значение]) Тогда
			Сообщить("Необходимо заполнить реквизит "+Реквизит.Значение, СтатусСообщения.Важное);
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ПолучитьПараметрыВалюты(Валюта, Дата) Экспорт
	РеглВалюта = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Константы.ВалютаРегламентированногоУчета.Получить()));
	РеглВалюта.Курс = ?(ОбщегоНазначения.ЗначениеНеЗаполнено(РеглВалюта.Курс), 1, РеглВалюта.Курс) ;
	Результат = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Валюта));
	Результат.Курс = ?(ОбщегоНазначения.ЗначениеНеЗаполнено(Результат.Курс), 1, Результат.Курс)/РеглВалюта.Курс;
	Результат.Кратность = ?(ОбщегоНазначения.ЗначениеНеЗаполнено(Результат.Кратность), 1, Результат.Кратность);
	Возврат Результат;
КонецФункции

Функция ПолучитьКурсПоНаименованиюВалюты(НаименованиеВалюты, Дата) Экспорт
	Валюта = Справочники.Валюты.НайтиПоНаименованию(СокрЛП(НаименованиеВалюты));
	Если Валюта.Пустая() Тогда
		Возврат 0;
	Иначе
		ПараметрВ = ПолучитьПараметрыВалюты(Валюта, Дата);
	КонецЕсли;
	Возврат ПараметрВ.Курс;
КонецФункции