
// Создает движение по РС СтатусыПоручений.
//
// Параметры:
//  Движения			 - Движения - Движения документа
//  Поручение			 - ДокументСсылка.Поручение - Поручение
//  Дата				 - Дата - Период движения
//  Статус				 - ПеречислениеСсылка.СтатусыПоручений - Устанавливаемый статус
//  КоличествоИсполнения - Число - Исполненное количество ЦБ (необязательный)
//
Процедура УстановитьСтатус(Движения, Поручение, Дата, Статус, КоличествоИсполнения = 0) Экспорт
	Перем Движение;
	
	Если Поручение.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.СтатусыПоручений.Добавить();
	Движение.Период				= Дата;
	Движение.Поручение			= Поручение;
	Движение.СтатусПоручения	= Статус;
	Движение.КоличествоИсполнения = КоличествоИсполнения;
	
	Движения.СтатусыПоручений.Записать();
КонецПроцедуры

// Возвращает самый последний установленный статус для переданного поручения.
//
// Параметры:
//  Поручение	 - ДокументСсылка.Поручение	 - Поручение, для которого возвращается статус
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыПоручений
//
Функция СтатусПоручения(Поручение) Экспорт
	Перем Отбор;
	
	Отбор = Новый Структура("Поручение", Поручение);
	Возврат РегистрыСведений.СтатусыПоручений.ПолучитьПоследнее(, Отбор).СтатусПоручения;
КонецФункции
