
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыПоУмолчанию();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыПоУмолчанию()
	
	ПараметрПериод = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПользовательскийПараметрПериод					= Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрПериод.ИдентификаторПользовательскойНастройки);
	ПользовательскийПараметрПериод.Использование	= Истина;
	ПользовательскийПараметрПериод.Значение			= ТекущаяДата();

КонецПроцедуры
