//////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС

Процедура СформироватьОтчет(Таблица) Экспорт
	РезультатЗапроса = СформироватьЗапрос();
	Если РезультатЗапроса.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Данные для формирования отчета не обнаружены!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Макет = ПолучитьМакет("Отчет");
	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаОснование	= Макет.ПолучитьОбласть("Шапка|Основание");
	ОбластьШапкаОтчет		= Макет.ПолучитьОбласть("Шапка|Отчет");
	ОбластьСтрокаОснование	= Макет.ПолучитьОбласть("Строка|Основание");
	ОбластьСтрокаОтчет		= Макет.ПолучитьОбласть("Строка|Отчет");
	ОбластьПодвалОснование	= Макет.ПолучитьОбласть("Подвал|Основание");
	ОбластьПодвалОтчет		= Макет.ПолучитьОбласть("Подвал|Отчет");

	// ЗАГОЛОВОК
	СтруктураЗаголовка = СформироватьПараметрыШапкиМакета();
	ОбластьЗаголовок.Параметры.Заполнить(СтруктураЗаголовка);
	Таблица.Вывести(ОбластьЗаголовок);
	
	// ШАПКА
	ОбластьШапкаОтчет.Параметры.Организация = СокрЛП(ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию().ЮридическоеЛицо.Наименование);
	Если ПоказыватьДокументОснование Тогда
		Таблица.Вывести(ОбластьШапкаОснование);
		Таблица.Присоединить(ОбластьШапкаОтчет);
	Иначе
		Таблица.Вывести(ОбластьШапкаОтчет);
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		// СТРОКА ОТЧЕТА
		ОчиститьЗначенияПараметровМакета(ОбластьСтрокаОтчет.Параметры);
		// Заполнение параметров строки
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаОтчет.Параметры, Выборка);
		Если Выборка.ВведенаПрогрессивнаяШкала Тогда
			ДополнитьКомментарий(ОбластьСтрокаОтчет.Параметры, Выборка);
		КонецЕсли;
		
		СкорректироватьВалютуНалога(ОбластьСтрокаОтчет.Параметры, Выборка);
		
		Если ПоказыватьДокументОснование Тогда
			ОчиститьЗначенияПараметровМакета(ОбластьСтрокаОснование.Параметры);
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаОснование.Параметры, Выборка);
			Таблица.Вывести(ОбластьСтрокаОснование);
			Таблица.Присоединить(ОбластьСтрокаОтчет);
		Иначе
			Таблица.Вывести(ОбластьСтрокаОтчет);
		КонецЕсли;
	КонецЦикла;
	
	// ПОДВАЛ ОТЧЕТА
	Если ПоказыватьДокументОснование Тогда
		Таблица.Вывести(ОбластьПодвалОснование);
		Таблица.Присоединить(ОбластьПодвалОтчет);
	Иначе
		Таблица.Вывести(ОбластьПодвалОтчет);
	КонецЕсли;
	
	// Установим ширину для колонок
	Если ПоказыватьДокументОснование Тогда
		УстановитьШиринуКолонки(Таблица, 0, 28);	// Документ-основание
	КонецЕсли;
	
	УстановитьШиринуКолонки(Таблица, 1, 10);	// Дата получения дохода на СДС
	УстановитьШиринуКолонки(Таблица, 3, 8);		// Валюта выплаты
	УстановитьШиринуКолонки(Таблица, 4, 50);	// Полное наименование эмитента /Номер гос.регистрации или ISIN ЦБ
	УстановитьШиринуКолонки(Таблица, 5, 18);	// Наименование плательщика
	УстановитьШиринуКолонки(Таблица, 6, 18);	// Сумма дохода на 1 ЦБ
	УстановитьШиринуКолонки(Таблица, 7, 11);	// Номер счета ДЕПО
	УстановитьШиринуКолонки(Таблица, 8, 15);	// Количество ЦБ на дату фиксации
	УстановитьШиринуКолонки(Таблица, 10, 11);	// Дата фиксации для выплаты дохода
	УстановитьШиринуКолонки(Таблица, 19, 12);	// Дата передачи депоненту дохода / возврата
	УстановитьШиринуКолонки(Таблица, 24, 45);	// Комментарий
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

Процедура СкорректироватьВалютуНалога(ПараметрыОбласти, Выборка)
	Если Не ( (Выборка.СуммаНачисленногоНалога + Выборка.СуммаНалогаПоСтавке15СПревышения) <> 0
				Или Выборка.СуммаУплаченногоНалога <> 0) Тогда
		ПараметрыОбласти.ВалютаНалога = "";
		ПараметрыОбласти.ВалютаНалогаНаименование = "";
	КонецЕсли;
КонецПроцедуры

Процедура ДополнитьКомментарий(ПараметрыОбласти, Выборка)
	Комментарий = Новый Массив;
	Если ЗначениеЗаполнено(Выборка.Комментарий) Тогда
		Комментарий.Добавить(БезЗнаковПрепинанияЛП(Выборка.Комментарий));
	КонецЕсли;
	Если Выборка.ЭтоЕврооблигацияМинфина И Выборка.СуммаНачисленногоНалога > 0 Тогда
		Комментарий.Добавить(" по курсу ЦБ " + Выборка.КурсВалюты + " на " + Формат(Выборка.ДатаНачисленияНалога, "ДЛФ=D"));
	КонецЕсли;
	ПараметрыОбласти.Комментарий = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(Комментарий, ", ");
КонецПроцедуры

// Удаляет знаки препинания в начале и в конце строки. Возвращает исправленную строку.
//
// Параметры:
//  СтрокаИсточник	 - Строка - строка, в которой надо убрать знаки препинания 
//  ЗнакиПрепинания	 - Строка - знаки, которые убираются в исходной строке
// 
// Возвращаемое значение:
//  Строка
//
Функция БезЗнаковПрепинанияЛП(Знач СтрокаИсточник, ЗнакиПрепинания = ".,;")
	СтрокаИсточник = СокрЛП(СтрокаИсточник);
	Если СтрНайти(ЗнакиПрепинания, Лев(СтрокаИсточник, 1)) > 0 Тогда
		СтрокаИсточник = Сред(СтрокаИсточник, 2);
	КонецЕсли;
	Если СтрНайти(ЗнакиПрепинания, Прав(СтрокаИсточник, 1)) > 0 Тогда
		СтрокаИсточник = Лев(СтрокаИсточник, СтрДлина(СтрокаИсточник) - 1);
	КонецЕсли;
	Возврат СтрокаИсточник;
КонецФункции

// Возвращает результат запроса к БД
Функция СформироватьЗапрос()
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНачала",    	 НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("ДатаОкончания", 	 КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("ОплатаНалога", 	 Перечисления.ВидыПлатежныхОпераций.ОплатаНалога);
	Запрос.УстановитьПараметр("ВыплатаДохода", 	 Перечисления.ВидыПлатежныхОпераций.ВыплатаДохода);
	Запрос.УстановитьПараметр("ОрганизацияПоУмолчанию", Константы.ОрганизацияПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("Облигация",       Перечисления.ТипыЦБ.Облигация);
	Запрос.УстановитьПараметр("Государственная", Перечисления.ВидыОблигаций.Государственная);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ПустаяВалюта",    Справочники.Валюты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДатаВводаПрогрШкалы", Константы.ДатаВводаРасчетаНДФЛПоПрогрессивнойШкале.Получить());
	ЗаполнитьПараметрыЗапросаПоОтборуСКД(Запрос);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБСписываемые.Ссылка КАК Поручение,
	|	СУММА(ЦБСписываемые.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_Поручения
	|ИЗ
	|	Документ.Поручение.ЦенныеБумагиСписываемые КАК ЦБСписываемые
	|ГДЕ
	|	ЦБСписываемые.Ссылка.Проведен
	|	И ЦБСписываемые.ПлановаяДатаРасчетов МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВЫРАЗИТЬ(ЦБСписываемые.Ссылка.ВидОперацииД КАК Справочник.ВидыОпераций).ВыплатаДоходаВДенежнойФорме
	|	И &ОтборПорученийПоПоручению
	|	И &ВыводитьПоручения
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦБСписываемые.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗамещающееПоручениеЦБСписываемые.Ссылка.Дата КАК Дата,
	|	0 КАК СуммаВыплаты,
	|	ЕСТЬNULL(ГОЦенныеБумаги.Ссылка.БанковскийСчет.ВалютаДенежныхСредств, ЗамещающееПоручениеЦБСписываемые.Ссылка.БанковскийСчет.ВалютаДенежныхСредств) КАК ВалютаВыплаты,
	|	ЕСТЬNULL(ГОЦенныеБумаги.ЦеннаяБумага, ЗамещающееПоручениеЦБСписываемые.ЦеннаяБумага) КАК ЦеннаяБумага,
	|	&ОрганизацияПоУмолчанию КАК ПлатежныйАгент,
	|	ЕСТЬNULL(ГОЦенныеБумаги.Ссылка.ВыплатаНа1ЦБ, ЗамещающееПоручениеЦБСписываемые.Ссылка.ВыплатаНа1ЦБ) КАК СуммаДоходаНа1ЦБ,
	|	ЕСТЬNULL(ГОЦенныеБумаги.Ссылка.СчетДепо, ЗамещающееПоручениеЦБСписываемые.СчетДепо) КАК СчетДепо,
	|	ЕСТЬNULL(ГОЦенныеБумаги.РазделСчетаДепо, ЗамещающееПоручениеЦБСписываемые.РазделСчетаДепо) КАК РазделСчетаДепо,
	|	ЕСТЬNULL(ГОЦенныеБумаги.Сумма, ЗамещающееПоручениеЦБСписываемые.Сумма) КАК Сумма,
	|	ЕСТЬNULL(ГОЦенныеБумаги.СуммаНалога, ЗамещающееПоручениеЦБСписываемые.СуммаНалога) КАК СуммаНалогаДокумента,
	|	0 КАК СуммаНедополученногоДохода,
	|	ЕСТЬNULL(ГОЦенныеБумаги.Ссылка.Комментарий, ЗамещающееПоручениеЦБСписываемые.Ссылка.Комментарий) КАК Комментарий,
	|	ЕСТЬNULL(ГОЦенныеБумаги.Ссылка, ЗамещающееПоручениеЦБСписываемые.Ссылка) КАК ДокументСсылка,
	|	ЕСТЬNULL(ГОЦенныеБумаги.Ссылка.ВидГлобальнойОперации, ЗамещающееПоручениеЦБСписываемые.Ссылка.ВидОперацииД) КАК НаименованиеВыплаты,
	|	ЕСТЬNULL(ГОЦенныеБумаги.Ссылка.ДатаФиксации, ЗамещающееПоручениеЦБСписываемые.Ссылка.ДатаФиксации) КАК ДатаФиксации,
	|	ЕСТЬNULL(ГОЦенныеБумаги.Количество, ЗамещающееПоручениеЦБСписываемые.Количество) КАК Количество,
	|	ЕСТЬNULL(ГОЦенныеБумаги.Ссылка.ДокументОснование, ЗамещающееПоручениеЦБСписываемые.Ссылка) КАК ОснованиеГОперации,
	|	ЕСТЬNULL(ГОЦенныеБумаги.Ссылка.ДокументОснование.Дата, ЗамещающееПоручениеЦБСписываемые.Ссылка.Дата) КАК ДатаОснования,
	|	ЗамещающееПоручениеЦБСписываемые.НДФЛУдержан КАК НДФЛУдержан,
	|	ЕСТЬNULL(ГОЦенныеБумаги.СуммаБезНалога, ВЫБОР
	|			КОГДА ЕСТЬNULL(ЗамещающееПоручениеЦБСписываемые.ЦеннаяБумага.ВидЦББанкаРоссии.ИностраннаяЦБ, ЛОЖЬ)
	|				ТОГДА ЗамещающееПоручениеЦБСписываемые.СуммаКВыплатеПоИПД
	|			ИНАЧЕ ЗамещающееПоручениеЦБСписываемые.Сумма - ЗамещающееПоручениеЦБСписываемые.СуммаНалога
	|		КОНЕЦ) КАК СуммаБезНалога,
	|	ЗамещающееПоручениеЦБСписываемые.Ссылка.Дата КАК ДатаПередачиДохода,
	|	ВЫРАЗИТЬ(&ВалютаРегламентированногоУчета КАК Справочник.Валюты) КАК ВалютаНалога,
	|	ЗамещающееПоручениеЦБСписываемые.СтавкаНалога КАК СтавкаНалогаДокумента,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГОЦенныеБумаги.Ссылка.ДокументОснование.Дата, ЗамещающееПоручениеЦБСписываемые.Ссылка.Дата) >= &ДатаВводаПрогрШкалы
	|				И &ДатаВводаПрогрШкалы <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВведенаПрогрессивнаяШкала,
	|	ВЫБОР
	|		КОГДА ГОЦенныеБумаги.Ссылка ЕСТЬ NULL
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Порядок
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	Документ.Поручение.ЦенныеБумагиСписываемые КАК ЗамещающееПоручениеЦБСписываемые
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГлобальнаяОперация.ЦенныеБумаги КАК ГОЦенныеБумаги
	|		ПО ЗамещающееПоручениеЦБСписываемые.Ссылка = ГОЦенныеБумаги.Ссылка.ДокументОснование
	|			И ЗамещающееПоручениеЦБСписываемые.СчетДепо = ГОЦенныеБумаги.Ссылка.СчетДепо
	|			И ЗамещающееПоручениеЦБСписываемые.РазделСчетаДепо = ГОЦенныеБумаги.РазделСчетаДепо
	|			И (ГОЦенныеБумаги.Ссылка.Проведен)
	|			И (ГОЦенныеБумаги.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И (ГОЦенныеБумаги.Ссылка.ВидГлобальнойОперации ССЫЛКА Справочник.ВидыОпераций)
	|			И (ГОЦенныеБумаги.Ссылка.ВидГлобальнойОперации.ВыплатаДоходаВДенежнойФорме)
	|			И (ГОЦенныеБумаги.ЦеннаяБумага.НФИ = 0)
	|			И (&ОтборГОперацийПоПлатежномуАгенту)
	|			И (&ОтборГОперацийПоЦеннойБумаге)
	|			И (&ОтборГОперацийПоПоручению)
	|			И (&ОтборГОперацийПоДепоненту)
	|ГДЕ
	|	ЗамещающееПоручениеЦБСписываемые.Ссылка.Проведен
	|	И ЗамещающееПоручениеЦБСписываемые.ПлановаяДатаРасчетов МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЗамещающееПоручениеЦБСписываемые.Ссылка.ВидОперацииД ССЫЛКА Справочник.ВидыОпераций
	|	И ЗамещающееПоручениеЦБСписываемые.Ссылка.ВидОперацииД.ВыплатаДоходаВДенежнойФорме
	|	И ЗамещающееПоручениеЦБСписываемые.ЦеннаяБумага.НФИ = 0
	|	И &ОтборЗамещающихПорученийПоПлатежномуАгенту
	|	И &ОтборЗамещающихПорученийПоЦеннойБумаге
	|	И &ОтборЗамещающихПорученийПоПоручению
	|	И &ОтборЗамещающихПорученийПоДепоненту
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Поручения.Поручение.Дата,
	|	ВТ_Поручения.Поручение.СуммаИПД,
	|	ВТ_Поручения.Поручение.Валюта,
	|	ВТ_Поручения.Поручение.ЦБ,
	|	ВТ_Поручения.Поручение.ПлатежныйАгент,
	|	ВТ_Поручения.Поручение.ВыплатаНа1ЦБ,
	|	NULL,
	|	NULL,
	|	0,
	|	0,
	|	0,
	|	ВТ_Поручения.Поручение.Комментарий,
	|	ВТ_Поручения.Поручение,
	|	ВЫРАЗИТЬ(ВТ_Поручения.Поручение.ВидОперацииД КАК Справочник.ВидыОпераций),
	|	ВТ_Поручения.Поручение.ДатаФиксации,
	|	ВТ_Поручения.Количество,
	|	NULL,
	|	ВТ_Поручения.Поручение.Дата,
	|	ЛОЖЬ,
	|	0,
	|	ВТ_Поручения.Поручение.ДатаИсполненияПоручения,
	|	ВЫРАЗИТЬ(&ВалютаРегламентированногоУчета КАК Справочник.Валюты),
	|	0,
	|	ВЫБОР
	|		КОГДА ВТ_Поручения.Поручение.Дата >= &ДатаВводаПрогрШкалы
	|				И &ДатаВводаПрогрШкалы <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	1
	|ИЗ
	|	ВТ_Поручения КАК ВТ_Поручения
	|ГДЕ
	|	ВТ_Поручения.Поручение.ЦБ.НФИ = 0
	|	И &ОтборПорученийПоПлатежномуАгенту
	|	И &ОтборПорученийПоЦеннойБумаге
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.ОснованиеГОперации КАК ОснованиеГОперации,
	|	втДанные.СчетДепо КАК СчетДепо,
	|	втДанные.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ЦБСписываемые.НачислитьНалог КАК ОрганизацияЯвляетсяНалоговымАгентом,
	|	ЦБСписываемые.Комментарий КАК Комментарий,
	|	НАЧАЛОПЕРИОДА(ПлатежнаяОперацияОплатаНалога.Дата, ДЕНЬ) КАК ДатаУплатыНалога,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЦБСписываемые.НДФЛУдержан, ЛОЖЬ)
	|			ТОГДА ЦБСписываемые.СуммаНалога
	|		ИНАЧЕ ПлатежнаяОперацияОплатаНалога.Сумма
	|	КОНЕЦ КАК СуммаУплаченногоНалога,
	|	0 КАК СуммаДоходаПереданногоДепонентуВозврата,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПередачиДепонентуДоходаВозврата,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачисленияНалога,
	|	0 КАК КурсВалюты,
	|	0 КАК КратностьВалюты,
	|	0 КАК Ставка,
	|	0 КАК СуммаНалогаПоСтавке15СПревышения,
	|	0 КАК СуммаНачисленногоНалога
	|ПОМЕСТИТЬ втДополнительныеПоляНесвернутые
	|ИЗ
	|	втДанные КАК втДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК ЦБСписываемые
	|		ПО втДанные.ОснованиеГОперации = ЦБСписываемые.Ссылка
	|			И втДанные.СчетДепо = ЦБСписываемые.СчетДепо
	|			И втДанные.РазделСчетаДепо = ЦБСписываемые.РазделСчетаДепо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежнаяОперация КАК ПлатежнаяОперацияОплатаНалога
	|		ПО втДанные.ОснованиеГОперации = ПлатежнаяОперацияОплатаНалога.Основание
	|			И втДанные.СчетДепо = ПлатежнаяОперацияОплатаНалога.СчетДепо
	|			И втДанные.РазделСчетаДепо = ПлатежнаяОперацияОплатаНалога.РазделСчетаДепо
	|			И (ПлатежнаяОперацияОплатаНалога.ВидОперации = &ОплатаНалога)
	|			И (ПлатежнаяОперацияОплатаНалога.Проведен)
	|ГДЕ
	|	НЕ втДанные.ОснованиеГОперации ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втДанные.ОснованиеГОперации,
	|	втДанные.СчетДепо,
	|	втДанные.РазделСчетаДепо,
	|	ЦБСписываемые.НачислитьНалог,
	|	ЦБСписываемые.Комментарий,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	0,
	|	ПлатежнаяОперацияВыплатаДохода.Сумма,
	|	НАЧАЛОПЕРИОДА(ПлатежнаяОперацияВыплатаДохода.Дата, ДЕНЬ),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	втДанные КАК втДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК ЦБСписываемые
	|		ПО втДанные.ОснованиеГОперации = ЦБСписываемые.Ссылка
	|			И втДанные.СчетДепо = ЦБСписываемые.СчетДепо
	|			И втДанные.РазделСчетаДепо = ЦБСписываемые.РазделСчетаДепо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежнаяОперация КАК ПлатежнаяОперацияВыплатаДохода
	|		ПО втДанные.ОснованиеГОперации = ПлатежнаяОперацияВыплатаДохода.Основание
	|			И втДанные.СчетДепо = ПлатежнаяОперацияВыплатаДохода.СчетДепо
	|			И втДанные.РазделСчетаДепо = ПлатежнаяОперацияВыплатаДохода.РазделСчетаДепо
	|			И (ПлатежнаяОперацияВыплатаДохода.ВидОперации = &ВыплатаДохода)
	|			И (ПлатежнаяОперацияВыплатаДохода.Проведен)
	|ГДЕ
	|	НЕ втДанные.ОснованиеГОперации ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втДанные.ОснованиеГОперации,
	|	втДанные.СчетДепо,
	|	втДанные.РазделСчетаДепо,
	|	ЦБСписываемые.НачислитьНалог,
	|	ЦБСписываемые.Комментарий,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	0,
	|	0,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	НАЧАЛОПЕРИОДА(НачисленныйНалог.Дата, ДЕНЬ),
	|	НачисленныйНалог.КурсВалюты,
	|	НачисленныйНалог.КратностьВалюты,
	|	НачисленныйНалог.Ставка,
	|	НачисленныйНалог.СуммаНалогаПоСтавке15СПревышения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЦБСписываемые.НДФЛУдержан, ЛОЖЬ)
	|			ТОГДА ЦБСписываемые.СуммаНалога
	|		ИНАЧЕ НачисленныйНалог.СуммаНалога
	|	КОНЕЦ
	|ИЗ
	|	втДанные КАК втДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК ЦБСписываемые
	|		ПО втДанные.ОснованиеГОперации = ЦБСписываемые.Ссылка
	|			И втДанные.СчетДепо = ЦБСписываемые.СчетДепо
	|			И втДанные.РазделСчетаДепо = ЦБСписываемые.РазделСчетаДепо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачисленныйНалог КАК НачисленныйНалог
	|		ПО втДанные.ОснованиеГОперации = НачисленныйНалог.Основание
	|			И втДанные.СчетДепо = НачисленныйНалог.СчетДепо
	|			И втДанные.РазделСчетаДепо = НачисленныйНалог.РазделСчетаДепо
	|			И (НачисленныйНалог.Проведен)
	|ГДЕ
	|	НЕ втДанные.ОснованиеГОперации ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДопПоля.ОснованиеГОперации КАК ОснованиеГОперации,
	|	ДопПоля.СчетДепо КАК СчетДепо,
	|	ДопПоля.РазделСчетаДепо КАК РазделСчетаДепо,
	|	МАКСИМУМ(ДопПоля.ОрганизацияЯвляетсяНалоговымАгентом) КАК ОрганизацияЯвляетсяНалоговымАгентом,
	|	МАКСИМУМ(ДопПоля.Комментарий) КАК Комментарий,
	|	МАКСИМУМ(ДопПоля.ДатаУплатыНалога) КАК ДатаУплатыНалога,
	|	СУММА(ДопПоля.СуммаУплаченногоНалога) КАК СуммаУплаченногоНалога,
	|	СУММА(ДопПоля.СуммаДоходаПереданногоДепонентуВозврата) КАК СуммаДоходаПереданногоДепонентуВозврата,
	|	МАКСИМУМ(ДопПоля.ДатаПередачиДепонентуДоходаВозврата) КАК ДатаПередачиДепонентуДоходаВозврата,
	|	МАКСИМУМ(ДопПоля.ДатаНачисленияНалога) КАК ДатаНачисленияНалога,
	|	МАКСИМУМ(ДопПоля.КурсВалюты) КАК КурсВалюты,
	|	МАКСИМУМ(ДопПоля.КратностьВалюты) КАК КратностьВалюты,
	|	МАКСИМУМ(ДопПоля.Ставка) КАК Ставка,
	|	СУММА(ДопПоля.СуммаНалогаПоСтавке15СПревышения) КАК СуммаНалогаПоСтавке15СПревышения,
	|	СУММА(ДопПоля.СуммаНачисленногоНалога) КАК СуммаНачисленногоНалога
	|ПОМЕСТИТЬ втДополнительныеПоля
	|ИЗ
	|	втДополнительныеПоляНесвернутые КАК ДопПоля
	|
	|СГРУППИРОВАТЬ ПО
	|	ДопПоля.ОснованиеГОперации,
	|	ДопПоля.СчетДепо,
	|	ДопПоля.РазделСчетаДепо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.Дата КАК Дата,
	|	втДанные.СуммаВыплаты КАК СуммаВыплаты,
	|	втДанные.ВалютаВыплаты КАК ВалютаВыплаты,
	|	втДанные.ВалютаВыплаты.НаименованиеДляОтчетов КАК ВалютаВыплатыНаименование,
	|	ВЫРАЗИТЬ(втДанные.ЦеннаяБумага.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ПолноеНаименование КАК ПолноеНаименованиеЭмитента,
	|	ВЫБОР
	|		КОГДА втДанные.ЦеннаяБумага.НомерРегистрации <> """"
	|			ТОГДА втДанные.ЦеннаяБумага.НомерРегистрации
	|		ИНАЧЕ втДанные.ЦеннаяБумага.ISIN
	|	КОНЕЦ КАК НомерРегистрацииISIN,
	|	ВЫБОР
	|		КОГДА втДанные.ЦеннаяБумага.ТипЦБ = &Облигация
	|				И втДанные.ЦеннаяБумага.ВидЦБ = &Государственная
	|				И втДанные.ВалютаВыплаты <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЕврооблигацияМинфина,
	|	втДанные.ЦеннаяБумага КАК ЦеннаяБумага,
	|	втДанные.ПлатежныйАгент КАК ПлатежныйАгент,
	|	втДанные.СуммаДоходаНа1ЦБ КАК СуммаДоходаНа1ЦБ,
	|	втДанные.СчетДепо КАК СчетДепо,
	|	втДанные.Сумма КАК Сумма,
	|	втДанные.СуммаНедополученногоДохода КАК СуммаНедополученногоДохода,
	|	втДанные.Комментарий КАК Комментарий,
	|	втДанные.ДокументСсылка КАК ДокументСсылка,
	|	втДанные.НаименованиеВыплаты КАК НаименованиеВыплаты,
	|	втДанные.ДатаФиксации КАК ДатаФиксации,
	|	втДанные.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА втДополнительныеПоля.ОрганизацияЯвляетсяНалоговымАгентом ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА втДополнительныеПоля.ОрганизацияЯвляетсяНалоговымАгентом
	|			ТОГДА ""Да""
	|		ИНАЧЕ ""Нет""
	|	КОНЕЦ КАК ОрганизацияЯвляетсяНалоговымАгентом,
	|	втДанные.ВалютаНалога КАК ВалютаНалога,
	|	втДанные.ВалютаНалога.НаименованиеДляОтчетов КАК ВалютаНалогаНаименование,
	|	ВЫБОР
	|		КОГДА НЕ втДанные.ВведенаПрогрессивнаяШкала
	|				И втДанные.ВалютаВыплаты <> &ВалютаРегламентированногоУчета
	|				И втДанные.ВалютаВыплаты <> &ПустаяВалюта
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА втДанные.ВведенаПрогрессивнаяШкала
	|			ТОГДА ЕСТЬNULL(втДополнительныеПоля.ДатаУплатыНалога, ДАТАВРЕМЯ(1, 1, 1))
	|		КОГДА втДанные.СуммаНалогаДокумента <> 0
	|			ТОГДА втДанные.ДатаПередачиДохода
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаУплатыНалога,
	|	ЕСТЬNULL(втДополнительныеПоля.СуммаНалогаПоСтавке15СПревышения, 0) КАК СуммаНалогаПоСтавке15СПревышения,
	|	ВЫБОР
	|		КОГДА втДанные.ВведенаПрогрессивнаяШкала
	|				И НЕ втДанные.НДФЛУдержан
	|			ТОГДА ЕСТЬNULL(втДополнительныеПоля.СуммаНачисленногоНалога, 0)
	|		ИНАЧЕ втДанные.СуммаНалогаДокумента
	|	КОНЕЦ КАК СуммаНачисленногоНалога,
	|	ВЫБОР
	|		КОГДА втДанные.ВведенаПрогрессивнаяШкала
	|				И НЕ втДанные.НДФЛУдержан
	|			ТОГДА ЕСТЬNULL(втДополнительныеПоля.Ставка, 0)
	|		ИНАЧЕ втДанные.СтавкаНалогаДокумента
	|	КОНЕЦ КАК СтавкаНалога,
	|	ВЫБОР
	|		КОГДА втДанные.ВведенаПрогрессивнаяШкала
	|				И НЕ втДанные.НДФЛУдержан
	|			ТОГДА ЕСТЬNULL(втДополнительныеПоля.СуммаДоходаПереданногоДепонентуВозврата, 0)
	|		ИНАЧЕ втДанные.СуммаБезНалога
	|	КОНЕЦ КАК СуммаДоходаПереданногоДепонентуВозврата,
	|	ВЫБОР
	|		КОГДА втДанные.ВведенаПрогрессивнаяШкала
	|				И НЕ втДанные.НДФЛУдержан
	|			ТОГДА ЕСТЬNULL(втДополнительныеПоля.СуммаУплаченногоНалога, 0)
	|		ИНАЧЕ втДанные.СуммаНалогаДокумента
	|	КОНЕЦ КАК СуммаУплаченногоНалога,
	|	ВЫБОР
	|		КОГДА втДанные.ВведенаПрогрессивнаяШкала
	|			ТОГДА ЕСТЬNULL(втДополнительныеПоля.ДатаПередачиДепонентуДоходаВозврата, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ втДанные.ДатаПередачиДохода
	|	КОНЕЦ КАК ДатаПередачиДепонентуДоходаВозврата,
	|	ЕСТЬNULL(втДополнительныеПоля.Комментарий, """") КАК КомментарийПоручения,
	|	ЕСТЬNULL(втДополнительныеПоля.ДатаНачисленияНалога, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачисленияНалога,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДополнительныеПоля.КратностьВалюты, 1) = 0
	|			ТОГДА ЕСТЬNULL(втДополнительныеПоля.КурсВалюты, 0)
	|		ИНАЧЕ ЕСТЬNULL(втДополнительныеПоля.КурсВалюты, 0) / ЕСТЬNULL(втДополнительныеПоля.КратностьВалюты, 1)
	|	КОНЕЦ КАК КурсВалюты,
	|	втДанные.ВведенаПрогрессивнаяШкала КАК ВведенаПрогрессивнаяШкала
	|ИЗ
	|	втДанные КАК втДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДополнительныеПоля КАК втДополнительныеПоля
	|		ПО втДанные.ОснованиеГОперации = втДополнительныеПоля.ОснованиеГОперации
	|			И втДанные.СчетДепо = втДополнительныеПоля.СчетДепо
	|			И втДанные.РазделСчетаДепо = втДополнительныеПоля.РазделСчетаДепо
	|
	|УПОРЯДОЧИТЬ ПО
	|	втДанные.ДатаОснования,
	|	Дата,
	|	втДанные.Порядок,
	|	СчетДепо";
	ВыполнитьОбработкуИЗаменуТекстаЗапроса(Запрос);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
КонецФункции

// Процедура выполняет замену ключей текста запроса на корректный текст компиляции
Процедура ВыполнитьОбработкуИЗаменуТекстаЗапроса(Запрос)
	ЗаменяемыеСтроки = Новый Соответствие;
	
	Отбор = ОтборПоПлатежномуАгенту(Запрос.Параметры);
	ЗаменяемыеСтроки.Вставить("&ОтборГОперацийПоПлатежномуАгенту", Отбор.ГОперации);
	ЗаменяемыеСтроки.Вставить("&ОтборЗамещающихПорученийПоПлатежномуАгенту", Отбор.ЗамещающиеПоручения);
	ЗаменяемыеСтроки.Вставить("&ОтборПорученийПоПлатежномуАгенту", Отбор.Поручения);
	
	Отбор = ОтборПоЦеннойБумаге(Запрос.Параметры);
	ЗаменяемыеСтроки.Вставить("&ОтборГОперацийПоЦеннойБумаге", Отбор.ГОперации);
	ЗаменяемыеСтроки.Вставить("&ОтборЗамещающихПорученийПоЦеннойБумаге", Отбор.ЗамещающиеПоручения);
	ЗаменяемыеСтроки.Вставить("&ОтборПорученийПоЦеннойБумаге", Отбор.Поручения);
	
	Отбор = ОтборПоПоручению(Запрос.Параметры);
	ЗаменяемыеСтроки.Вставить("&ОтборГОперацийПоПоручению", Отбор.ГОперации);
	ЗаменяемыеСтроки.Вставить("&ОтборЗамещающихПорученийПоПоручению", Отбор.ЗамещающиеПоручения);
	ЗаменяемыеСтроки.Вставить("&ОтборПорученийПоПоручению", Отбор.Поручения);
	
	Отбор = ОтборПоДепоненту(Запрос.Параметры);
	ЗаменяемыеСтроки.Вставить("&ОтборГОперацийПоДепоненту", Отбор.ГОперации);
	ЗаменяемыеСтроки.Вставить("&ОтборЗамещающихПорученийПоДепоненту", Отбор.ЗамещающиеПоручения);
	ЗаменяемыеСтроки.Вставить("&ВыводитьПоручения", Отбор.Поручения);
	
	Для Каждого КлючИЗначение Из ЗаменяемыеСтроки Цикл
		Запрос.Текст = СтрЗаменить(Запрос.Текст, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
КонецПроцедуры

Функция НоваяСтруктураОтбора()
	Возврат Новый Структура("ГОперации, ЗамещающиеПоручения, Поручения", "Истина", "Истина", "Истина");
КонецФункции

Функция ОтборПоПлатежномуАгенту(ПараметрыЗапроса)
	Отбор = НоваяСтруктураОтбора();
	Если УстановленОтборПо("ПлатежныйАгент", ПараметрыЗапроса) Тогда
		Отбор.ГОперации = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ПлатежныйАгентВидСравнения,
			"&ПлатежныйАгент", "ГОЦенныеБумаги.Ссылка.ПлатежныйАгент", , , ПараметрыЗапроса.ПлатежныйАгент); 
		Отбор.ЗамещающиеПоручения = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ПлатежныйАгентВидСравнения,
			"&ПлатежныйАгент", "ЗамещающееПоручениеЦБСписываемые.Ссылка.ПлатежныйАгент", , , ПараметрыЗапроса.ПлатежныйАгент); 
		Отбор.Поручения = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ПлатежныйАгентВидСравнения,
			"&ПлатежныйАгент", "ВТ_Поручения.Поручение.ПлатежныйАгент", , , ПараметрыЗапроса.ПлатежныйАгент); 
	КонецЕсли;
	Возврат Отбор;
КонецФункции

Функция ОтборПоЦеннойБумаге(ПараметрыЗапроса)
	Отбор = НоваяСтруктураОтбора();
	Если УстановленОтборПо("ЦеннаяБумага", ПараметрыЗапроса) Тогда
		Отбор.ГОперации = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ЦеннаяБумагаВидСравнения,
			"&ЦеннаяБумага", "ГОЦенныеБумаги.ЦеннаяБумага", , , ПараметрыЗапроса.ЦеннаяБумага); 
		Отбор.ЗамещающиеПоручения = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ЦеннаяБумагаВидСравнения,
			"&ЦеннаяБумага", "ЗамещающееПоручениеЦБСписываемые.ЦеннаяБумага", , , ПараметрыЗапроса.ЦеннаяБумага); 
		Отбор.Поручения = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ЦеннаяБумагаВидСравнения,
			"&ЦеннаяБумага", "ВТ_Поручения.Поручение.ЦБ", , , ПараметрыЗапроса.ЦеннаяБумага); 
	КонецЕсли;
	Возврат Отбор;
КонецФункции

Функция ОтборПоПоручению(ПараметрыЗапроса)
	Отбор = НоваяСтруктураОтбора();
	Если УстановленОтборПо("Поручение", ПараметрыЗапроса) Тогда
		Отбор.ГОперации = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ПоручениеВидСравнения,
			"&Поручение", "ГОЦенныеБумаги.Ссылка.ДокументОснование", , , ПараметрыЗапроса.Поручение); 
		Отбор.ЗамещающиеПоручения = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ПоручениеВидСравнения,
			"&Поручение", "ЗамещающееПоручениеЦБСписываемые.Ссылка", , , ПараметрыЗапроса.Поручение); 
		Отбор.Поручения = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ПоручениеВидСравнения,
			"&Поручение", "ЦБСписываемые.Ссылка", , , ПараметрыЗапроса.Поручение); 
	КонецЕсли;
	Возврат Отбор;
КонецФункции

Функция ОтборПоДепоненту(ПараметрыЗапроса)
	Отбор = НоваяСтруктураОтбора();
	Если УстановленОтборПо("Депонент", ПараметрыЗапроса) Тогда
		Отбор.ГОперации = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ДепонентВидСравнения,
			"&Депонент", "ГОЦенныеБумаги.Ссылка.СчетДепо.Владелец", , , ПараметрыЗапроса.Депонент); 
		Отбор.ЗамещающиеПоручения = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ДепонентВидСравнения,
			"&Депонент", "ЗамещающееПоручениеЦБСписываемые.СчетДепо.Владелец", , , ПараметрыЗапроса.Депонент); 
		Отбор.Поручения = "Ложь"; 
	КонецЕсли;
	Возврат Отбор;
КонецФункции

Процедура ЗаполнитьПараметрыЗапросаПоОтборуСКД(Запрос)
	сзПараметрыЗапроса = Новый СписокЗначений;
	сзПараметрыЗапроса.Добавить("ПлатежныйАгент");
	сзПараметрыЗапроса.Добавить("ЦеннаяБумага");
	сзПараметрыЗапроса.Добавить("Поручение");
	сзПараметрыЗапроса.Добавить("Депонент");
	
	Для Каждого элПарам Из сзПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(элПарам.Значение, 					Неопределено);
		Запрос.УстановитьПараметр(элПарам.Значение + "ВидСравнения",	Неопределено);
		Запрос.УстановитьПараметр(элПарам.Значение + "Использование",	Ложь);
	КонецЦикла;	 

	// Заполним структуру параметров на основании данных отбора
	ЭлементыОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
		
	Для Каждого Эл Из ЭлементыОтбора Цикл
		Если Эл.Использование Тогда
			
			ИмяПараметра1 = СокрЛП(эл.ЛевоеЗначение);
			ИмяПараметра2 = СокрЛП(эл.ЛевоеЗначение)+"ВидСравнения";
			ИмяПараметра3 = СокрЛП(эл.ЛевоеЗначение)+"Использование";
			
			Если Запрос.Параметры.Свойство(ИмяПараметра1) Тогда
				Запрос.Параметры[ИмяПараметра1] = эл.ПравоеЗначение;
			КонецЕсли;
			
			Если Запрос.Параметры.Свойство(ИмяПараметра2) Тогда
				Запрос.Параметры[ИмяПараметра2] = эл.ВидСравнения;
				
			КонецЕсли;
			
			Если Запрос.Параметры.Свойство(ИмяПараметра3) Тогда
				Запрос.Параметры[ИмяПараметра3] = эл.Использование;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Возвращает структуру параметров шапки макета
Функция СформироватьПараметрыШапкиМакета()
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ДтНач", Формат(ДатаНач, "ДФ=dd.MM.yyyy"));
	СтруктураВозврата.Вставить("ДтКон", Формат(ДатаКон, "ДФ=dd.MM.yyyy"));
	Возврат СтруктураВозврата;
КонецФункции
    
// Очищает значения параметров области макета
Процедура ОчиститьЗначенияПараметровМакета(ПараметрыМакета)
	Для Инд = 0 По (ПараметрыМакета.Количество() - 1) Цикл
		ПараметрыМакета.Установить(Инд, Неопределено);
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьШиринуКолонки(Таблица, НомерКолонкиБезДокументаОснования, Ширина)
	мНомерКолонки = ?(ПоказыватьДокументОснование, НомерКолонкиБезДокументаОснования + 1, НомерКолонкиБезДокументаОснования);
	мКолонка = Таблица.Область(, мНомерКолонки, , мНомерКолонки);
	мКолонка.ШиринаКолонки = Ширина;
КонецПроцедуры

Функция УстановленОтборПо(ИмяПараметра, ПараметрыЗапроса)
	Возврат ЗначениеЗаполнено(ПараметрыЗапроса[ИмяПараметра]) И ПараметрыЗапроса[ИмяПараметра+"Использование"] = Истина; 
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);