
&НаКлиенте
Процедура Сформировать(Команда)
	Если Объект.ДатаОкончания < Объект.ДатаНачала Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Указан не корректный период, сформировать отчет нет возможности";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;	                                                 
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТабДокумент = ОбработкаОбъект.ВыполнитьСверкуСделокСОтчетомБрокераSQL( ,УстанавливатьФлаг);
	ТабДокумент.ФиксацияСверху = 2;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	//Диалог = Новый ДиалогРедактированияСтандартногоПериода(); 
	//Диалог.Период = ПеременнаяТипаСтандартныйПериод; 
	//Если Диалог.Редактировать() Тогда 
	//ПеременнаяТипаСтандартныйПериод = Диалог.Период; 
	//КонецЕсли;
КонецПроцедуры

#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ИсключаемыеДоговорыДУ.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ДоговорДУ");    
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.ПолучитьСсылку(Новый УникальныйИдентификатор("7bd55693-f2b1-11e6-9418-005056b100fc"));
	НастройкиОбработки = ОбработкаСсылка.ХранилищеНастроек.Получить();
	ПредставлениеНастроек = "";
	ОбработкаОбъект.УстановитьПользовательскиеНастройки(НастройкиОбработки, ПредставлениеНастроек);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	//IMAPPS-37692 ++
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ДоговорДУ"));
	НовоеОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
  	
	ЭлементПоле = ЭтаФорма.Элементы.Найти("СписокДоговоровДУКомБрокРЕПО");
	Если НЕ ЭлементПоле = Неопределено Тогда
   		ЭлементПоле.ОграничениеТипа = НовоеОписаниеТипов;
	КонецЕсли;	
	//IMAPPS-37692 --
	  
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура СписокДоговоровДУКомБрокРЕПОПриИзменении(Элемент)
	
	//IMAPPS-37692 ++
	МассивДоговоровДУ = Объект.СписокДоговоровДУКомБрокРЕПО.ВыгрузитьЗначения();
	Объект.СписокДоговоровДУКомБрокРЕПО.ЗагрузитьЗначения(ОбщегоНазначенияДУ.УдалитьПовторяющиесяЭлементыМассива(МассивДоговоровДУ));
    //IMAPPS-37692 --
	
КонецПроцедуры
 