#Область ПрограммныйИнтерфейс

Функция ЗаписатьНовыйОбъектВФорме(Форма) Экспорт
	
	ЭтоНовый = НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка);	
	Если ЭтоНовый Тогда
		Если ОбщегоНазначения.ЭтоСсылкаДокумента(Форма.Объект.Ссылка) Тогда
			ТекстВопроса = "Для выполнения данной операции необходимо записать документ. Записать?";
		Иначе // Справочник
			ТекстВопроса = "Для выполнения данной операции необходимо записать элемент. Записать?";
		КонецЕсли; 
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат Ложь;
		Иначе
			Попытка
				Возврат Форма.Записать();
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли; 	
КонецФункции
 
// Процедура выводит форму структуры подчиненности документа
// Параметры:
//  ДокументСсылка - ДокументСсылка
// 
Процедура ПоказатьСтруктуруПодчиненностиДокумента(ДокументСсылка) Экспорт
	
	ФормаСтруктурыПодчиненности = ПолучитьФорму("ОбщаяФорма.ФормаСтруктурыПодчиненности", , , ДокументСсылка); 		
	ФормаСтруктурыПодчиненности.ДокументИсточник = ДокументСсылка;
	ФормаСтруктурыПодчиненности.Открыть();
	 
КонецПроцедуры

Процедура НапечататьДвиженияДокумента(ДокументСсылка) Экспорт

	Если ОбщегоНазначения.ЗначениеНеЗаполнено(ДокументСсылка) Тогда
		Предупреждение("Сначала запишите документ!");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Документ", ДокументСсылка);
	ОткрытьФорму("Отчет.ДвиженияДокумента.Форма.ФормаОтчета", ПараметрыОткрытия, , ДокументСсылка);

КонецПроцедуры // НапечататьДвиженияДокумента()

#Область ТипРазделаСчетаДепо

// Процедура, вызываемая из одноименного обработчика события формы
//
// Параметры:
//  Элемент				 - ПолеФормы - поле, для которого открывается форма выбора
//  ДанныеВыбора		 - СписокЗначений, Неопределено - данные для выбора
//  СтандартнаяОбработка - Булево - признак стандартной обработки события
//  Форма				 - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры
//
Процедура РазделСчетаДепоМХНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Форма) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = ОтборПоТипуРазделаСчетаДепо(Форма.Объект.ТипРазделаСчетаДЕПО);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", Отбор);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	
	ОткрытьФорму("Справочник.РазделыСчетаДепоМХ.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

// Возвращает настройки компоновки данных с настроенным отбором по типу раздела счета Депо
//
// Параметры:
//  ТипРазделаСчетаДЕПО	 - СправочникСсылка.РасзделСчетаДепо - раздел счета депо
// 
// Возвращаемое значение:
//  НастройкиКомпоновкиДанных - настройки для передачи в форму выбора справочника РазделыСчетаДепоМХ
//
Функция ОтборПоТипуРазделаСчетаДепо(ТипРазделаСчетаДЕПО) Экспорт
	
	РазрешенныеТипыРазделов = Новый СписокЗначений;
	РазрешенныеТипыРазделов.Добавить(ТипРазделаСчетаДЕПО);
	Если ТипРазделаСчетаДЕПО = ПредопределенноеЗначение("Перечисление.ТипыРазделовСчетовДЕПО.БлокированоОбособленный") Тогда
		РазрешенныеТипыРазделов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыРазделовСчетовДЕПО.Основной"));
	КонецЕсли;
	
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипРазделаСчетаДЕПО");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = РазрешенныеТипыРазделов;
	
	Возврат НастройкиКомпоновки;
	
КонецФункции

// Возвращает доступные для выбора разделы счета депо МХ с учетом типа раздела
//
// Параметры:
//  ТипРазделаСчетаДЕПО		 - Перечисление.ТипыРазделовСчетовДЕПО - тип раздела счета депо для отбора
//  ПараметрыПодбора		 - Структура, Неопределено - параметры поиска (см. АвтоПодбор)
//  СтандартнаяОбработка	 - Булево - Признак стандартной обработки из формы
// 
// Возвращаемое значение:
//  СписокЗначений - список разделов счетов депо МХ
//
Функция ДанныеВыбораСУчетомТипаРаздела(ТипРазделаСчетаДЕПО, ПараметрыПодбора, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Если ПараметрыПодбора = Неопределено Тогда
		ПараметрыПодбора = Новый Структура;
	КонецЕсли;
	ПараметрыПодбора.Вставить("УчитыватьТипРаздела", Истина);
	ПараметрыПодбора.Вставить("ТипРазделаСчетаДЕПО", ТипРазделаСчетаДЕПО);
	
	Возврат ПолучитьДанныеВыбора(Тип("СправочникСсылка.РазделыСчетаДепоМХ"), ПараметрыПодбора);
	
КонецФункции

// Процедура, вызываемая из одноименного обработчика события формы
//
// Параметры:
//  Элемент	 - ПолеФормы - поле, для которого обрабатывается изменение значения
//  Форма	 - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры
//
Процедура ТипРазделаСчетаДЕПОПриИзменении(Элемент, Форма) Экспорт
	
	Если ТипыРазделовСчетовРазличны(Форма.Объект.ТипРазделаСчетаДЕПО, Форма.Объект.РазделСчетаДепоМХ) Тогда
		Форма.Объект.РазделСчетаДепоМХ = ПредопределенноеЗначение("Справочник.РазделыСчетаДепоМХ.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

Функция ТипыРазделовСчетовРазличны(ТипРаздела, РазделМХ)
	
	Если Не ЗначениеЗаполнено(РазделМХ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Истина;
	ТипРазделаМХ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РазделМХ, "ТипРазделаСчетаДЕПО");
	Если ТипРаздела = ТипРазделаМХ
		Или (ТипРаздела = ПредопределенноеЗначение("Перечисление.ТипыРазделовСчетовДЕПО.БлокированоОбособленный")
		И ТипРазделаМХ = ПредопределенноеЗначение("Перечисление.ТипыРазделовСчетовДЕПО.Основной")) Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Заполняет указаную колонку переданной табличной части ценными бумагами (в зависимости от типа данных
// в колонке, это либо ссылки на справочник ЦБ либо строковые ISIN). Ценные бумаги вводятся пользователем
//	в диалоговом окне путем копирования колоки с ISIN из Excel или еще какой-то таблицы, например отчета 1С.
//
// Параметры:
//  ТабЧасть - ТабличнаяЧасть
//  ИмяКолонки - Строка - имя колонки в которую нужно поместить ЦБ (либо в виде ссылки. либо в виде ISIN);
//  ФормаОбъект - Форма - форма в которую производится загрузка
//
Процедура ЗагрузитьВТабличнуюЧастьСписокЦБИзExcel(ТабЧасть, ИмяКолонки, ФормаОбъект) Экспорт
	ПолучитьСсылкиИзISIN = ТипДанныхВКолонкеСсылкаНаСправочникЦБ(ТабЧасть, ИмяКолонки);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПолучитьСсылкиИзISIN", ПолучитьСсылкиИзISIN);
	ДополнительныеПараметрыОповещения = Новый Структура;
	ДополнительныеПараметрыОповещения.Вставить("ТабЧасть", ТабЧасть);
	ДополнительныеПараметрыОповещения.Вставить("ИмяКолонки", ИмяКолонки);
	СверкаПоСтатикеЦБ = ФормаОбъект.ИмяФормы = "Обработка.СверкаПоСтатикеЦБв1СиBQ.Форма.Форма";
	ДополнительныеПараметрыОповещения.Вставить("СверкаПоСтатикеЦБ", СверкаПоСтатикеЦБ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаСпискаЦБЗавершение", РаботаСДиалогамиКлиент, ДополнительныеПараметрыОповещения);
	ОткрытьФорму("Обработка.ЗагрузкаСпискаЦБИзExcel.Форма", ПараметрыФормы, ФормаОбъект, , , , ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

// Показывает диалог выбора периода.
// Параметры:
//	ПериодНачало - Дата - возвращаемый параметр
//	ПериодКонец - Дата - возвращаемый параметр
// Возвращаемое значение:
//	- Булево
Функция ИзмененПериод(ПериодНачало, ПериодКонец) Экспорт
	ЕстьИзменения = Ложь;
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала	= ПериодНачало;
	Диалог.Период.ДатаОкончания	= ?(ПериодНачало = Дата('0001-01-01'), ПериодКонец, НачалоДня(ПериодНачало));
	Диалог.Период.Вариант		= ВариантСтандартногоПериода.ПроизвольныйПериод;
	
	Если Диалог.Редактировать() Тогда
		НоваяДатаНачала = Диалог.Период.ДатаНачала;
		НоваяДатаКонца = НачалоДня(Диалог.Период.ДатаОкончания);
	КонецЕсли;
	
	Если ПериодНачало <> НоваяДатаНачала Или ПериодКонец <> НоваяДатаКонца Тогда
		ПериодНачало = НоваяДатаНачала;
		ПериодКонец = НоваяДатаКонца;
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	Возврат ЕстьИзменения;
КонецФункции

#КонецОбласти


#Область ВспомогательныеПроцедурыИФункции

#Область ИмпортСпискаЦБВТабличныеЧастиИзExcel

// Обработчик оповещения о завершении работы с формой импорта списка ЦБ из Excel
// Параметры:
//  Результат - Массив
//  ДополнительныеПараметры - структура
Процедура ЗагрузкаСпискаЦБЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		МассивЦБ = Результат;
		ТабЧасть = ДополнительныеПараметры.ТабЧасть;
		ИмяКолонки = ДополнительныеПараметры.ИмяКолонки;
		Для Каждого ЦБ Из МассивЦБ Цикл
			НовСтрока = ТабЧасть.Добавить();
			НовСтрока[ИмяКолонки] = ЦБ;
			Если ДополнительныеПараметры.СверкаПоСтатикеЦБ Тогда
				СтруктураТипаЦБ = РаботаСДаннымиBQВызовСервера.ТипКодаИКодДляСверки(ЦБ);
				НовСтрока.ТипКодаДляСверки = СтруктураТипаЦБ.ТипКода;
				НовСтрока.КодДляСверки = СтруктураТипаЦБ.Код;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ТипДанныхВКолонкеСсылкаНаСправочникЦБ(ТабЧасть, ИмяКолонки)
	// Определим тип значений в колонке
	НовСтрока = ТабЧасть.Добавить();
	ТипДанныхСсылкаНаСправочникЦБ = ТипЗнч(НовСтрока[ИмяКолонки]) = Тип("СправочникСсылка.ЦенныеБумаги");
	ТабЧасть.Удалить(НовСтрока);
	
	Возврат ТипДанныхСсылкаНаСправочникЦБ;
КонецФункции

#КонецОбласти

#КонецОбласти