#Область ПрограммныйИнтерфейс

// Создает запись в регистре
// Параметры:
//  Период	 			- Дата
//  ТипДокумента		- Строка - описывает тип документа, например "Документ.Поручение"
//  ВидОперации			- СправочникСсылка.ВидыОпераций, ПеречислениеСсылка.КлассыОпераций, ПеречислениеСсылка.ВидыОтчетов, Строка - нужно для
//							тех документов, которым устанавливаются разные префиксы в зависимости от операции (Поручение, ОперацииЦБ, Выписка).
//  Префикс				- Строка
//  ПрефиксСлужебный	- Строка
//  Комментарий			- Строка
Процедура СоздатьЗапись(Период, ТипДокумента, ВидОперации, Префикс, ПрефиксСлужебный, Комментарий) Экспорт
	ЗаписьРС = РегистрыСведений.ПрефиксыНомеровДокументов.СоздатьМенеджерЗаписи();
	ЗаписьРС.Период = Период;
	ЗаписьРС.ТипДокумента = ТипДокумента;
	ЗаписьРС.ВидОперации = ВидОперации;
	ЗаписьРС.Префикс = Префикс;
	ЗаписьРС.ПрефиксСлужебный = ПрефиксСлужебный;
	ЗаписьРС.Комментарий = Комментарий;
	ЗаписьРС.Записать();
КонецПроцедуры

#КонецОбласти