
Функция ЭтоВидКДВыкупа(Вид) Экспорт
	МассивВидовКД = Новый Массив;
	МассивВидовКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("BIDS"));
	МассивВидовКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("TEND"));
	Возврат НЕ МассивВидовКД.Найти(Вид) = Неопределено;
КонецФункции

Функция ЭтоВидКДСобрания(Вид) Экспорт
	МассивВидовКД = Новый Массив;
	МассивВидовКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("XMET"));
	МассивВидовКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("MEET"));
	МассивВидовКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("BMET"));
	МассивВидовКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("OMET"));
	Возврат НЕ МассивВидовКД.Найти(Вид) = Неопределено;
КонецФункции

Функция КорпоративноеДействиеПоРеференсу(КДРеференс) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КорпоративноеДействие_Новый.Ссылка
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый КАК КорпоративноеДействие_Новый
	|ГДЕ
	|	НЕ КорпоративноеДействие_Новый.ПометкаУдаления
	|	И КорпоративноеДействие_Новый.КДРеференс = &КДРеференс");
	Запрос.УстановитьПараметр("КДРеференс", КДРеференс);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе 
		Возврат Документы.КорпоративноеДействие_Новый.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция НайтиПоРеференсуИСчетуДепо(КДРеференс, СчетДепо) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КД.Ссылка КАК КД
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый КАК КД
	|ГДЕ
	|	НЕ КД.ПометкаУдаления
	|	И КД.КДРеференс = &КДРеференс
	|	И КД.СчетДЕПО = &СчетДЕПО");	
	Запрос.УстановитьПараметр("КДРеференс",	КДРеференс);
	Запрос.УстановитьПараметр("СчетДЕПО",	СчетДЕПО);	
	Выборка = Запрос.Выполнить().Выбрать();
	КД = Документы.КорпоративноеДействие_Новый.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		КД = Выборка.КД;
	КонецЕсли;	
	Возврат КД;
КонецФункции

// Функция - КДПо входящему референсу и счету депо
//
// Возвращает ссылку на КД по входящему референсу и счету депо
//
// Параметры:
//  КДРеференсВходящий	 - Строка - Референс КД
//  СчетДепо			 - СправочникСсылка.СчетаДепоМХ - Счет депо
//  ТолькоОдинДокумент	 - Булево - Не обязательный, при установке в Истина, если находится более одного документа возвращает пустую ссылку
// 
// Возвращаемое значение:
//   - ДокументСсылка.КорпоративноеДействие_Новый
//
Функция КДПоВходящемуРеференсуИСчетуДепо(КДРеференсВходящий, СчетДепо, ТолькоОдинДокумент = Ложь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КД.Ссылка КАК КД
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый КАК КД
	|ГДЕ
	|	НЕ КД.ПометкаУдаления
	|	И КД.КДРеференсВходящий = &КДРеференсВходящий
	|	И КД.СчетДЕПО = &СчетДЕПО");
	
	Запрос.УстановитьПараметр("КДРеференсВходящий", КДРеференсВходящий);
	Запрос.УстановитьПараметр("СчетДЕПО", СчетДЕПО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Документы.КорпоративноеДействие_Новый.ПустаяСсылка();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Если ТолькоОдинДокумент И Выборка.Количество() > 1 Тогда
			Возврат Документы.КорпоративноеДействие_Новый.ПустаяСсылка();
		КонецЕсли;
		
		Выборка.Следующий();
		Возврат Выборка.КД;
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьДостаточностьДанныхДляОтправкиУведомлений(КДСсылка, МассивСообщенийОбОшибкахЗаполнения) Экспорт
	Если НЕ ЗначениеЗаполнено(КДСсылка.КДРеференс) Тогда
		МассивСообщенийОбОшибкахЗаполнения.Добавить("Не указан референс корпоративного действия");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(КДСсылка.ВидКД.Код) Тогда
		МассивСообщенийОбОшибкахЗаполнения.Добавить("Не указан вид корпоративного действия (код вида)");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(КДСсылка.Эмитент) Тогда
		МассивСообщенийОбОшибкахЗаполнения.Добавить("Не указан эмитент");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(КДСсылка.ДатаФиксации) Тогда
		МассивСообщенийОбОшибкахЗаполнения.Добавить("Не указана дата фиксации");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(КДСсылка.ДатаОкончанияПриемаИнструкцийВТБКБ) Тогда
		МассивСообщенийОбОшибкахЗаполнения.Добавить("Не указана дата окончания приема инструкций ВТБКБ");
	КонецЕсли;
	Если ЭтоВидКДВыкупа(КДСсылка.ВидКД) Тогда
		Если НЕ ЗначениеЗаполнено(КДСсылка.БанковскийСчет.ВалютаДенежныхСредств) Тогда
			МассивСообщенийОбОшибкахЗаполнения.Добавить("Не определена валюта выплаты");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(КДСсылка.ВыплатаНа1ЦБ) Тогда
			МассивСообщенийОбОшибкахЗаполнения.Добавить("Не указана цена выкупа");
		КонецЕсли;
	КонецЕсли;
	Если ЭтоВидКДСобрания(КДСсылка.ВидКД) Тогда
		Если НЕ ЗначениеЗаполнено(КДСсылка.ДатаПроведенияСобрания) Тогда
			МассивСообщенийОбОшибкахЗаполнения.Добавить("Не указана дата проведения собрания");
		КонецЕсли;
		Если КДСсылка.ВопросыКГолосованию.Количество() = 0 Тогда
			МассивСообщенийОбОшибкахЗаполнения.Добавить("Не задан список вопросов");
		КонецЕсли;
		Для каждого СтрокаВопроса из КДСсылка.ВопросыКГолосованию Цикл
			СтрокаНачалаСообщенияОбОшибке = "В строке ТЧ номер """+ СокрЛП(СтрокаВопроса.НомерСтроки) + """ вопросов к голосованию ";
			Если НЕ ЗначениеЗаполнено(СтрокаВопроса.НомерВопроса) Тогда
				МассивСообщенийОбОшибкахЗаполнения.Добавить(СтрокаНачалаСообщенияОбОшибке + "не определен номер вопроса");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаВопроса.ТекстВопроса) Тогда
				МассивСообщенийОбОшибкахЗаполнения.Добавить(СтрокаНачалаСообщенияОбОшибке + "не заполнен текст вопроса");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаВопроса.ВариантыГолосования) Тогда
				МассивСообщенийОбОшибкахЗаполнения.Добавить(СтрокаНачалаСообщенияОбОшибке + "не определены варианты голосования");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьКорректностьВводаРаскрытияСпискаВладельцев(КДСсылка, МассивСообщенийОбОшибкахЗаполнения) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РаскрытиеСпискаВладельцевСписокВладельцев.НомерСтроки КАК НомерСтроки,
	|	РаскрытиеСпискаВладельцевСписокВладельцев.ЦеннаяБумага КАК ЦеннаяБумага,
	|	РаскрытиеСпискаВладельцевСписокВладельцев.Количество КАК Unit,
	|	КодыЗагрузки.Код КАК SecCode,
	|	КодыЗагрузкиКлиента.Код КАК ClientId
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев.СписокВладельцев КАК РаскрытиеСпискаВладельцевСписокВладельцев
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО РаскрытиеСпискаВладельцевСписокВладельцев.ЦеннаяБумага = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = &НДЦ)
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > РаскрытиеСпискаВладельцевСписокВладельцев.Ссылка.Дата)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиКлиента
	|		ПО РаскрытиеСпискаВладельцевСписокВладельцев.Клиент = КодыЗагрузкиКлиента.Владелец
	|			И (КодыЗагрузкиКлиента.ПометкаУдаления = ЛОЖЬ)
	|			И (КодыЗагрузкиКлиента.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.Клиенты))
	|ГДЕ
	|	РаскрытиеСпискаВладельцевСписокВладельцев.Ссылка.Проведен
	|	И РаскрытиеСпискаВладельцевСписокВладельцев.Ссылка.КарточкаКД = &КарточкаКД");
	Запрос.УстановитьПараметр("КарточкаКД", 	КДСсылка);
	Запрос.УстановитьПараметр("НДЦ", 			Константы.КлассификаторЗагрузкиНДЦ.Получить());
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		МассивСообщенийОбОшибкахЗаполнения.Добавить("Не найдено данных по раскрытию списка");
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаНачалаСообщенияОбОшибке = "В строке ТЧ номер """+ СокрЛП(Выборка.НомерСтроки) + """ раскрытия списков ";
		Если НЕ ЗначениеЗаполнено(Выборка.ClientId) Тогда
			МассивСообщенийОбОшибкахЗаполнения.Добавить(СтрокаНачалаСообщенияОбОшибке + "не определен код депонента");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Выборка.Unit) Тогда
			МассивСообщенийОбОшибкахЗаполнения.Добавить(СтрокаНачалаСообщенияОбОшибке + "не заполнено количество ЦБ");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Выборка.SecCode) Тогда
			МассивСообщенийОбОшибкахЗаполнения.Добавить(СтрокаНачалаСообщенияОбОшибке + "не определен код ЦБ в НРД");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция НовыйДокументУведомлениеКлиента(ДокументОснование) Экспорт
	НовыйДокумент = Неопределено;
	Отказ = Ложь;
	
	РегистрыСведений.ДокументыДляФормированияУведомлений.УдалитьКорпоративноеДействие(ДокументОснование, Отказ);
	
	Если Отказ Тогда
		Возврат НовыйДокумент;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование,Новый Структура("Код","ВидКД.Код")).Код = "TREC" И WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкераДляДокумента(ДокументОснование) Тогда
		Возврат НовыйДокументУведомлениеКлиентаTrec(ДокументОснование);
	КонецЕсли;
		
	Если НЕ ДокументОснование.Этап.ФормироватьУведомление Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Для данного этапа формирование уведомления запрещено.");
		Возврат НовыйДокумент;
	КонецЕсли;
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	ПараметрыКД = РегистрыСведений.ЭтапыКД.ПоследниеВходящиеПараметрыКД(ДокументОснование);
	ФормаСообщенияКК = РегистрыСведений.ФормыСообщенийКабинетаКлиентаВТБКБ.ФормаСообщения(ДокументОснование.ВидКД,
		ПараметрыКД.Этап, ДокументОснование.ТипУведомления,
		НЕ Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(ДокументОснование.ЦеннаяБумага1));
	Если ЗначениеЗаполнено(ФормаСообщенияКК) Тогда
		
		ДокументУведомление = Документы.УведомлениеКлиентам.СоздатьДокумент();
		ДокументУведомление.УстановитьНовыйНомер();
		ДокументУведомление.УстановитьСсылкуНового(Документы.УведомлениеКлиентам.ПолучитьСсылку());
		
		ДокументУведомление.Дата = ТекущаяДата();
		ДокументУведомление.Заполнить(ДокументОснование);
		
		ДокументУведомление.Записать();
		НовыйДокумент = ДокументУведомление.Ссылка;
		
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Нет шаблона для данного типа уведомления.");
	КонецЕсли;
	Если ТранзакцияАктивна() Тогда 
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	Возврат НовыйДокумент;
КонецФункции    

Функция НовыйДокументУведомлениеКлиентаTrec(ДокументОснование) Экспорт
	НовыйДокумент = Неопределено;
	Отказ = Ложь;
	
	Если Не ДокументОснование.ВидКД.Код = "TREC" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);	
	ПараметрыКД = РегистрыСведений.ЭтапыКД.ПоследниеВходящиеПараметрыКД(ДокументОснование);
	ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалогаНДИНД;
	
	ДокументУведомление = Документы.УведомлениеКлиентам.СоздатьДокумент();
	ДокументУведомление.УстановитьНовыйНомер();
	ДокументУведомление.УстановитьСсылкуНового(Документы.УведомлениеКлиентам.ПолучитьСсылку());
	
	ДокументУведомление.Дата = ТекущаяДата();
	ДокументУведомление.ФормаСообщенияКК = ФормаСообщенияКК;
	ДокументУведомление.Заполнить(ДокументОснование);
	
	ДокументУведомление.Записать();
	НовыйДокумент = ДокументУведомление.Ссылка;

	Если ТранзакцияАктивна() Тогда 
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	Возврат НовыйДокумент;
КонецФункции

Функция WTRC_ДатаОкончанияПриемаФормыW8(КДСсылка) Экспорт
	Возврат Документы.УведомлениеКлиентам.ДобавитьРабочийДень(КДСсылка.ДатаОкончанияПриемаИнструкцийВТБКБ, -5);
КонецФункции

Функция WTRC_ДатаОкончанияПриемаПоручений1_5(КДСсылка) Экспорт
	Возврат Документы.УведомлениеКлиентам.ДобавитьРабочийДень(КДСсылка.ДатаФиксации, -2);
КонецФункции

Функция WTRC_ДатаОкончанияПриемаПоручений1_10(КДСсылка) Экспорт
	Возврат Документы.УведомлениеКлиентам.ДобавитьРабочийДень(КДСсылка.ДатаОкончанияПриемаИнструкцийНРД, -2);
КонецФункции

Функция TREC_ДатаОкончанияПриемаИнструкцийВТБКБ(КДСсылка) Экспорт
	Возврат Документы.УведомлениеКлиентам.ДобавитьРабочийДень(КДСсылка.ДатаОкончанияПриемаИнструкцийНРД, -2);
КонецФункции

Функция ТекстЗапросаИсточникаРаскрытияИзКД()
	
	Возврат "ВЫБРАТЬ
	        |	ОстаткиЦБОстатки.СчетДепо.Владелец КАК Клиент,
	        |	ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
	        |	ОстаткиЦБОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	        |	ОстаткиЦБОстатки.КоличествоОстаток КАК Количество,
	        |	ВЫБОР
	        |		КОГДА ОстаткиЦБОстатки.РазделСчетаДепо.РазделСубклиента
	        |			ТОГДА ОстаткиЦБОстатки.РазделСчетаДепо.Субклиент
	        |		ИНАЧЕ """"
	        |	КОНЕЦ КАК Выгодоприобретатель
	        |ПОМЕСТИТЬ втДанныеСпискаВладельцев
	        |ИЗ
	        |	РегистрНакопления.ОстаткиЦБ.Остатки(
	        |			&Период,
	        |			СчетДепоМХ = &СчетДепоМХ
	        |				И ЦБ В (&СписокЦенныхБумаг)) КАК ОстаткиЦБОстатки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	втДанныеСпискаВладельцев.Клиент КАК Субброкер,
	        |	втДанныеСпискаВладельцев.СчетДепо КАК СчетДепо,
	        |	втДанныеСпискаВладельцев.РазделСчетаДепо КАК РазделСчетаДепо,
	        |	КорпоративноеДействие.КДРеференс КАК КДРеференс,
	        |	КорпоративноеДействие.ВидКД.Наименование КАК ТипКД,
	        |	КорпоративноеДействие.ВидКД.Код КАК КодТипаКД,
	        |	ВЫБОР
	        |		КОГДА КорпоративноеДействие.ВидКД.ТипКорпоративныхДействий = &Доход
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ВидКДВыплатаДоходов,
	        |	КорпоративноеДействие.ВидКД.КодДохода КАК КодДоходовНДФЛ,
	        |	ИСТИНА КАК ЗаполнятьЗаявленнуюНалоговуюСтавку,
	        |	КорпоративноеДействие.ДатаФиксации КАК ДатаФиксации,
	        |	КорпоративноеДействие.ЦеннаяБумага1 КАК ЦеннаяБумага,
	        |	втДанныеСпискаВладельцев.Выгодоприобретатель КАК Субклиент,
	        |	ВЫБОР
	        |		КОГДА втДанныеСпискаВладельцев.СчетДепо В (&ТипыСчетовНД)
	        |			ТОГДА ""02""
	        |		КОГДА втДанныеСпискаВладельцев.СчетДепо В (&ТипыСчетовИНД)
	        |			ТОГДА ""20""
	        |		ИНАЧЕ ""01""
	        |	КОНЕЦ КАК ТипСчета,
	        |	втДанныеСпискаВладельцев.Количество КАК Количество,
	        |	КорпоративноеДействие.Дата КАК ДатаДокументаРаскрытия,
	        |	КорпоративноеДействие.Организация КАК Организация,
	        |	КорпоративноеДействие.Организация.Наименование КАК НаименованиеЮЛОрганизации,
	        |	КорпоративноеДействие.ЦеннаяБумага1.НаименованиеВыпуска КАК НаименованиеВыпуска,
	        |	КорпоративноеДействие.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	        |	ИСТИНА КАК ВыводитьСтрокиТаблицы,
	        |	КорпоративноеДействие.Дата КАК ДатаДокументаЗапроса
	        |ПОМЕСТИТЬ втИсточникДляРаскрытия
	        |ИЗ
	        |	Документ.КорпоративноеДействие_Новый КАК КорпоративноеДействие
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДанныеСпискаВладельцев КАК втДанныеСпискаВладельцев
	        |		ПО (ИСТИНА)
	        |ГДЕ
	        |	ВЫРАЗИТЬ(втДанныеСпискаВладельцев.Клиент КАК Справочник.Контрагенты).Субброкер
	        |	И КорпоративноеДействие.Ссылка = &КорпоративноеДействиеСсылка";
	
КонецФункции

// Процедура - Добавить источник для раскрытия из КД
// Добавляет в менеджер временных таблиц втИсточникДляРаскрытия с информацией необходимой для заполнения запроса субброкеру на раскрытие
// Параметры:
//  МВТ							 - МенеджерВременныхТаблиц
//  КорпоративноеДействиеСсылка	 - ДокументСсылка.КорпоративноеДействие_Новый
//  Клиенты						 - Массив	 - Не обязательно. Массив клиентов, по которым будет добавлена информация, если не указано то по всем клиентам.
//
Процедура ДобавитьИсточникДляРаскрытияИзКД(МВТ, КорпоративноеДействиеСсылка, Клиенты = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = ТекстЗапросаИсточникаРаскрытияИзКД();
	Запрос.УстановитьПараметр("КорпоративноеДействиеСсылка", КорпоративноеДействиеСсылка);
	Запрос.УстановитьПараметр("Доход", Перечисления.ТипыКорпоративныхДействий.Доход);
	
	РеквизитыКорпоративногоДействия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КорпоративноеДействиеСсылка,"ДатаФиксации, СчетДепо, ЦеннаяБумага1, ЦеннаяБумага2");
	Если КорпоративноеДействиеСсылка.ДатаФиксации >= ТекущаяДатаСеанса() Тогда 
		Период = ТекущаяДатаСеанса();
	Иначе 
		Период = РеквизитыКорпоративногоДействия.ДатаФиксации;
	КонецЕсли;

	СписокЦенныхБумаг = Новый Массив();
	Если ЗначениеЗаполнено(РеквизитыКорпоративногоДействия.ЦеннаяБумага1) Тогда 
		СписокЦенныхБумаг.Добавить(РеквизитыКорпоративногоДействия.ЦеннаяБумага1);
	КонецЕсли;
	Если ЗначениеЗаполнено(РеквизитыКорпоративногоДействия.ЦеннаяБумага2) Тогда 
		СписокЦенныхБумаг.Добавить(РеквизитыКорпоративногоДействия.ЦеннаяБумага2);
	КонецЕсли;

	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СчетДепоМХ", РеквизитыКорпоративногоДействия.СчетДепо);
	Запрос.УстановитьПараметр("СписокЦенныхБумаг", СписокЦенныхБумаг);
	Запрос.УстановитьПараметр("ТипыСчетовНД", БизнесПроцессы.ОбработкаWTRCСообщения.ТипыСчетовНД());
	Запрос.УстановитьПараметр("ТипыСчетовИНД", БизнесПроцессы.ОбработкаWTRCСообщения.ТипыСчетовИНД());
	
	Если ЗначениеЗаполнено(Клиенты) Тогда 
		
		Запрос.Текст = Запрос.Текст + "
		|И втДанныеСпискаВладельцев.Клиент В(&СписокКлиентов)";
		Запрос.УстановитьПараметр("СписокКлиентов", Клиенты);
		
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры
