
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборы();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СкорректироватьЭлементыФормы();
	ОбработатьИзменениеЮрФизЛица();
	ОбработатьИзменениеОпытаРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоОпытРаботыПриИзменении(Элемент)
	ОбработатьИзменениеОпытаРаботы();
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоОпытРаботы1ПриИзменении(Элемент)
	ОбработатьИзменениеОпытаРаботы();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбработатьИзменениеЮрФизЛица();
	ОбработатьИзменениеОпытаРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)
	ОбработатьИзменениеЮрФизЛица();
	УстановитьОтборы();
КонецПроцедуры

Процедура СкорректироватьЭлементыФормы()
	Элементы.ЮрЛицоСобственныйКапитал.Заголовок = "Имеет собственный капитал не менее 200 000 000 (двухста миллионов) рублей.";
	
	Элементы.ЮрЛицоСделки.Заголовок = "Совершало сделки с ценными бумагами и (или) заключало договоры, являющиеся" + Символы.ПС
										+ "производными финансовыми инструментами, за последние четыре квартала в среднем не" + Символы.ПС
										+ "реже пяти раз в квартал, но не реже одного раза в месяц. При этом совокупная цена таких" + Символы.ПС
										+ "сделок (договоров) должна составлять не менее 50 миллионов рублей.";
	
	Элементы.ЮрЛицоОборот.Заголовок = "Имеет оборот (выручку) от реализации товаров (работ, услуг) по данным бухгалтерской" + Символы.ПС 
										+ "отчетности (национальных стандартов или правил ведения учета и составления отчетности" + Символы.ПС
										+ "для иностранного юридического лица) за последний завершенный отчетный год не менее 2" + Символы.ПС
										+ "миллиардов рублей. Под завершенным отчетным годом следует понимать отчетный год, в" + Символы.ПС
										+ "отношении которого истек установленный срок представления годовой бухгалтерской" + Символы.ПС
										+ "(финансовой) отчетности или годовая бухгалтерская (финансовая) отчетность за который" + Символы.ПС
										+ "составлена до истечения установленного срока ее представления.";
	
	Элементы.ЮрЛицоАктивы.Заголовок = "Имеет сумму активов по данным бухгалтерского учета (национальных стандартов или правил" + Символы.ПС
										+ "ведения учета и составления отчетности для иностранного юридического лица) за последний" + Символы.ПС
										+ "завершенный отчетный год в размере не менее 2 миллиардов рублей.";
	
	Элементы.ИныеФинансовыеИнструменты.Заголовок = "иные финансовые инструменты (фьючерсы, опционы, клиринговый сертификат участия)";
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеЮрФизЛица()
	
	Если ТипЗнч(Объект.ЮрФизЛицо) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
		Элементы.СтраницаЮрЛицо.Видимость	= Истина;
		Элементы.СтраницаФизЛицо.Видимость	= Ложь;
		Элементы.Страница2017.Видимость	= Ложь;
	ИначеЕсли ТипЗнч(Объект.ЮрФизЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Элементы.СтраницаЮрЛицо.Видимость	= Ложь;
		Элементы.СтраницаФизЛицо.Видимость	= Ложь;
		Элементы.Страница2017.Видимость	= Истина;
		ДатаПереходаНа12млн = 
			ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("2370.ДатаПереходаНаРазмерИмуществаФизЛицаКвала_12млн", '00010101');
		ДатаПереходаНа24млн = 
			ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("2413.ДатаПереходаНаРазмерИмуществаФизЛицаКвала_24млн", '00010101');
		Если Объект.Дата <= ДатаПереходаНа12млн Тогда
			Элементы.ФизЛицоРазмерИмущества_6.Доступность = Истина;
			Элементы.ФизЛицоРазмерИмущества_12.Доступность = Ложь;
			Элементы.ФизЛицоРазмерИмущества_24.Доступность = Ложь;
		ИначеЕсли Объект.Дата >= ДатаПереходаНа24млн Тогда
			Элементы.ФизЛицоРазмерИмущества_6.Доступность = Ложь;
			Элементы.ФизЛицоРазмерИмущества_12.Доступность = Ложь;
			Элементы.ФизЛицоРазмерИмущества_24.Доступность = Истина;
		Иначе
			Элементы.ФизЛицоРазмерИмущества_6.Доступность = Ложь;
			Элементы.ФизЛицоРазмерИмущества_12.Доступность = Истина;
			Элементы.ФизЛицоРазмерИмущества_24.Доступность = Ложь;
		КонецЕсли;
	Иначе
		Элементы.СтраницаЮрЛицо.Видимость = Ложь;
		Элементы.СтраницаФизЛицо.Видимость = Ложь;
		Элементы.Страница2017.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеОпытаРаботы()
	
	Элементы.ФизЛицоВидОпытаРаботы.Доступность = Объект.ФизЛицоОпытРаботы;
	Элементы.ФизЛицоВидОпытаРаботы1.Доступность = Объект.ФизЛицоОпытРаботы;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборы()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДоговорыКлиента, "ТекущаяДата", ТекущаяДатаСеанса());
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДоговорыКлиента, "ЮрФизЛицо", Объект.ЮрФизЛицо);
КонецПроцедуры
