
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

//&НаКлиенте
//Процедура ПросмотрКалендаря(Команда)
//	//Календарь = Документы.ПериодыПребыванияВРФ.ПолучитьФорму("Документ.ПериодыПребыванияВРФ.Форма.ФормаПросмотраКалендаря");
//	ФормаДокумента = ПолучитьФорму("Документ.ПериодыПребыванияВРФ.Форма.ФормаКалендарь");
//	ФормаДокумента.Клиент = Объект.Клиент;
//	Календарь.Клиент = Объект.Клиент;
//	Календарь.Открыть();
//КонецПроцедуры

&НаКлиенте
Процедура СписокПериодовНачалоПериодаПриИзменении(Элемент)
	ТекущаяСтрока	= Элемент.Родитель.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.КонецПериода) И (ТекущаяСтрока.НачалоПериода >= ТекущаяСтрока.КонецПериода) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не верно указано начало периода!
										|
										|Установлена дата конца периода -1 день.");
		ТекущаяСтрока.НачалоПериода	= ТекущаяСтрока.КонецПериода-86400;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПериодовКонецПериодаПриИзменении(Элемент)
	ТекущаяСтрока	= Элемент.Родитель.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.НачалоПериода) И (ТекущаяСтрока.НачалоПериода >= ТекущаяСтрока.КонецПериода) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не верно указано окончание периода!
										|
										|Установлена дата начала периода +1 день.");
										
		ТекущаяСтрока.КонецПериода	= ТекущаяСтрока.НачалоПериода+86400;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПериодовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Местонахождение	= ПредопределенноеЗначение("Перечисление.ТипыМестонахожденияКлиента.НаТерриторииРФ");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПрисутствия(Команда)
	Календарь = ПолучитьФорму("Документ.ПериодыПребыванияВРФ.Форма.ФормаКалендарь");	
	Календарь.Клиент		= Объект.Клиент;
	Календарь.ДатаРасчета	= ТекущаяДата();
	Календарь.Открыть();
КонецПроцедуры

