

&НаКлиенте
Процедура Установить(Команда)
	
	Заголовок = "";
	ЗначенияПараметров = УстановитьПараметры(Заголовок);
	ОповеститьОВыборе(новый Структура("Значения,ЗаголовокНастроек", ЗначенияПараметров,Заголовок));
	
КонецПроцедуры

&НаСервере
Функция УстановитьПараметры(Заголовок)
	
	Значения = Новый Структура;
	значения.Вставить("ОбработкаЗагрузкиАктивов", 	Объект.ОбработкаЗагрузкиАктивов);
	Значения.Вставить("КомандаЗагрузкиАктивов",  	Объект.КомандаЗагрузкиАктивов);
	Значения.Вставить("ТестовыйРежим",				Объект.ТестовыйРежим);
	
	Значения.Вставить("БУ", Объект.БУ);
	Значения.Вставить("ВУ", Объект.ВУ);
	Значения.Вставить("УУ", Объект.УУ);
	
	Значения.Вставить("КомиссияБиржи",		Объект.КомиссияБиржи); 
	Значения.Вставить("КомиссияБрокера", 	Объект.КомиссияБрокера); 
	Значения.Вставить("КомиссияТС", 		Объект.КомиссияТС); 
	
	Значения.Вставить("ПочтовыйЛогин", Объект.ПочтовыйЛогин);
	Значения.Вставить("СписокРассылки", XMLСтрока(Новый ХранилищеЗначения(Объект.СписокРассылки.Выгрузить())));
	Значения.Вставить("ВнешняяИБ", Объект.ВнешняяИБ);
	
	ПредставлениеПочты = ?(Объект.СписокРассылки.Количество()>0, "Установлен список рассылки","");
	Заголовок =?(Объект.БУ,"БУ"," ") +?(Объект.ВУ," ВУ"," ")+  ?(Объект.УУ," УУ"," ")+ " Загрузка активов:"+ Объект.ОбработкаЗагрузкиАктивов + " ("+ Объект.КомандаЗагрузкиАктивов+")"+ ?(Объект.ТестовыйРежим," Тестовый режим; ", " ") + ПредставлениеПочты;
	Заголовок = СокрЛП(Заголовок);

	Возврат Значения;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.НастройкиАлгоритма)=Тип("Структура") тогда
		
		Настройки = Параметры.НастройкиАлгоритма;
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.УстановитьПользовательскиеНастройки(Настройки);
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
				
	КонецЕсли;
	
КонецПроцедуры
