&НаСервере
Процедура УправлениеРеквизитамиФормы()
	Элементы.ФормаПроверить.Доступность			= (Объект.ДанныеПерсон.Количество() > 0);
	Элементы.ФормаСформироватьОтвет.Доступность	= Объект.ПроверкаПройдена;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	
	ДиалогВыбора	= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбора.Заголовок				= "Выберите входящий файл ЦИК";
	ДиалогВыбора.ПолноеИмяФайла			= Объект.ПутьКФайлу;
	ДиалогВыбора.ПредварительныйПросмотр= Ложь;
	ДиалогВыбора.МножественныйВыбор		= Ложь;
	ДиалогВыбора.Фильтр					= "Файл данных (*.xml)|*.xml";
	
	Если ДиалогВыбора.Выбрать() Тогда
		Объект.ПутьКФайлу = СкорректированныйПутьКФайлу(ДиалогВыбора.ПолноеИмяФайла);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СкорректированныйПутьКФайлу(ИсходныйПутьКФайлу)
	НастройкиЗаменыСтрокой = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("9846.НастройкиЗаменыПутейКФайламНаСетевыхДисках");
	НастройкиЗамены = СтрРазделить(НастройкиЗаменыСтрокой, ",", Истина);
	НовыйПутьКФайлу = ВРег(ИсходныйПутьКФайлу);
	МаксимальныйИндекс = НастройкиЗамены.ВГраница();
	Если (МаксимальныйИндекс+1)%2 <> 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Некорректная настройка замен путей к файлам");
		Возврат НовыйПутьКФайлу;
	КонецЕсли;
	
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		НовыйПутьКФайлу = СтрЗаменить(НовыйПутьКФайлу, НастройкиЗамены[Индекс], НастройкиЗамены[Индекс+1]);
		Индекс = Индекс + 1;
	КонецЦикла;
	Возврат НовыйПутьКФайлу;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ПроверкаПройдена	= Ложь;
	Объект.ДатаОтвета		= ТекущаяДата();
	УправлениеРеквизитамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПерсонПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ	= Истина;
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСервер()
	Обработка	= РеквизитФормыВЗначение("Объект");
	Обработка.ЧтениеДанныхИзФайла();
	ЗначениеВРеквизитФормы(Обработка, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура Прочитать(Команда)
	ПрочитатьСервер();
	УправлениеРеквизитамиФормы();
КонецПроцедуры

&НаСервере
Процедура ПроверитьСервер()
	Обработка	= РеквизитФормыВЗначение("Объект");
	Обработка.ПроверитьСуществованиеКлиентов();
	ЗначениеВРеквизитФормы(Обработка, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	ПроверитьСервер();
	УправлениеРеквизитамиФормы();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтветСервер()
	Обработка	= РеквизитФормыВЗначение("Объект");
	Если Объект.ДанныеПерсон.Количество() = 0 Тогда
		Обработка.СозданиеФайлаКвитанции();
	Иначе
		Обработка.СозданиеФайлаПроверки();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтвет(Команда)
	СформироватьОтветСервер();
КонецПроцедуры
