
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ПериодНачало			= ТекущаяДата();
	Объект.ПериодКонец			= ТекущаяДата();
	Объект.СчетДЕПО_ПоУмолчанию	= Справочники.СчетаДепоМХ.НайтиПоКоду("HL1212112991");
	
	ПараметрыИсточника = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(
		ПланыВидовХарактеристик.ВнешниеИсточники.КаталогФайловРаскрытияСпискаВладельцевPartad);
	Если Не ЗначениеЗаполнено(Объект.ПутьККаталогу) Тогда
		Объект.ПутьККаталогу	= ПараметрыИсточника.Папка;
	КонецЕсли; 	
	
	ПараметрыИсточника = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(
		ПланыВидовХарактеристик.ВнешниеИсточники.КаталогФайловРаскрытияСпискаВладельцевISO);
	Если Не ЗначениеЗаполнено(Объект.ПутьККаталогуISO) Тогда
		Объект.ПутьККаталогуISO	= ПараметрыИсточника.Папка;
	КонецЕсли; 	
	
	ПараметрыИсточника = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(
		ПланыВидовХарактеристик.ВнешниеИсточники.КаталогФайловРаскрытияСпискаВладельцевISO);
	Если Не ЗначениеЗаполнено(Объект.ПутьКФайлуISO) Тогда
		Объект.ПутьКФайлуISO = ПараметрыИсточника.Папка;
		Объект.ПутьКФайлуISO = ?(ЗначениеЗаполнено(Объект.ПутьКФайлуISO), Объект.ПутьКФайлуISO + "\repxml.xml", "");
	КонецЕсли; 	
	
	Если Не ЗначениеЗаполнено(Объект.ТипЗагрузкиСписковРаскрытия) Тогда
		Объект.ТипЗагрузкиСписковРаскрытия	= Перечисления.ТипЗагрузкиСписковРаскрытия.PARTAD;
	КонецЕсли; 	
	
	УправлениеРеквизитамиФормыСервер();
КонецПроцедуры

&НаСервере
Процедура УправлениеРеквизитамиФормыСервер()
	Элементы.ГруппаКаталог.Видимость								
	= (Объект.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.PARTAD);
	Элементы.ГруппаКаталогISO.Видимость								= (Объект.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.ISO20022 И Не Объект.ЗагрузитьISOИзФайла);
	Элементы.ГруппаКаталогISOФайла.Видимость						= (Объект.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.ISO20022 И Объект.ЗагрузитьISOИзФайла);
	
	Элементы.ЗагрузитьISOИзФайла.Видимость							= (Объект.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.ISO20022);
	Элементы.ДекорацияЗагрузитьISOИзФайла.Видимость					= (Объект.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.ISO20022);
	Элементы.СоответствиеИдФайлам.Видимость							= Не (Объект.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.ISO20022 И Объект.ЗагрузитьISOИзФайла);
	
	Элементы.ДанныеРаскрытииСпискаВладельцевТипСписка.Видимость		= (Объект.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.PARTAD);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	Диалог	= Новый ДиалогРедактированияСтандартногоПериода();
	
	Диалог.Период.ДатаНачала	= Объект.ПериодНачало;
	Диалог.Период.ДатаОкончания	= ?(Объект.ПериодНачало='0001-01-01', Объект.ПериодКонец, НачалоДня(Объект.ПериодНачало));
	Диалог.Период.Вариант		= ВариантСтандартногоПериода.ПроизвольныйПериод;
	
	Если Диалог.Редактировать() Тогда
		Объект.ПериодНачало	= НачалоДня(Диалог.Период.ДатаНачала);
		Объект.ПериодКонец	= КонецДня(Диалог.Период.ДатаОкончания);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталога(Команда)
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияФайла.Заголовок= НСтр("ru = 'Выберите каталог'");
	
	Если ЗначениеЗаполнено(Объект.ПутьККаталогу) Тогда
		ДиалогОткрытияФайла.Каталог	= Объект.ПутьККаталогу;
	КонецЕсли;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ПутьККаталогу	= ДиалогОткрытияФайла.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПолучитьФайлыИзЛучСервер()
	Обработка	= ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.ФормированиеРаскрытияСпискаВладельцев"));
	Обработка.ПолучитьФайлыИзЛуча(Объект.ПутьККаталогу);
	Объект.СоответствиеИдФайлам.Загрузить(Обработка.СоответствиеИдФайлам.Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ОбработатьФайлыСервер()
	Обработка	= РеквизитФормыВЗначение("Объект");
	Если НЕ (Объект.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.ISO20022 И Объект.ЗагрузитьISOИзФайла) Тогда
		Обработка.ОбработатьZIPФайлы();
	Иначе
		Обработка.ОбработатьISOФайл(Объект.ПутьКФайлуISO);
	КонецЕсли;
	ЗначениеВРеквизитФормы(Обработка,"Объект");
КонецПроцедуры

&НаСервере
Процедура ПолучитьФайлыIsoИзЛучСервер()
	Обработка	= ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.ФормированиеРаскрытияСпискаВладельцев"));
	Обработка.ПолучитьФайлыIsoИзЛуча(Объект.ПутьККаталогуISO);
	Объект.СоответствиеИдФайлам.Загрузить(Обработка.СоответствиеИдФайлам.Выгрузить());
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыСервер()
	Обработка	= РеквизитФормыВЗначение("Объект");
	Обработка.СформироватьДокументы();
	ЗначениеВРеквизитФормы(Обработка,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	СформироватьДокументыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьФайлыИОбработать(Команда)
	Результат = РезультатОбработкиФайловНаСервере();
	Если ЗначениеЗаполнено(Результат) Тогда
		Предупреждение(Результат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РезультатОбработкиФайловНаСервере()
	Объект.ДанныеРаскрытияСпискаВладельцев.Очистить();
	Объект.СоответствиеИдФайлам.Очистить();
	Если Объект.ТипЗагрузкиСписковРаскрытия	= Перечисления.ТипЗагрузкиСписковРаскрытия.PARTAD Тогда
		ПолучитьФайлыИзЛучСервер();
		
	ИначеЕсли Объект.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.ISO20022
		И НЕ Объект.ЗагрузитьISOИзФайла Тогда
		ПолучитьФайлыIsoИзЛучСервер();
		
	ИначеЕсли НЕ Объект.ЗагрузитьISOИзФайла Тогда
		Возврат "Не определен тип исользуемой загрузки!";
	КонецЕсли;
	
	ОбработатьФайлыСервер();
	Возврат "";
КонецФункции

&НаКлиенте
Процедура ТипЗагрузкиСписковРаскрытияПриИзменении(Элемент)
	УправлениеРеквизитамиФормыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаISO(Команда)
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияФайла.Заголовок= НСтр("ru = 'Выберите каталог'");
	
	Если ЗначениеЗаполнено(Объект.ПутьККаталогуISO) Тогда
		ДиалогОткрытияФайла.Каталог	= Объект.ПутьККаталогуISO;
	КонецЕсли;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ПутьККаталогуISO	= ДиалогОткрытияФайла.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаISOФайла(Команда)
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Заголовок			= НСтр("ru = 'Выберите файл с данными в формате ISO'");
	ДиалогОткрытияФайла.МножественныйВыбор	= Ложь;
	ДиалогОткрытияФайла.Фильтр				= "Структура данных(*.xml)|*.xml";
	
	Если ЗначениеЗаполнено(Объект.ПутьКФайлуISO) Тогда
		ДиалогОткрытияФайла.ПолноеИмяФайла	= Объект.ПутьКФайлуISO;
	КонецЕсли;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ПутьКФайлуISO	= ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЗагрузитьISOИзФайла(Элемент)
	УправлениеРеквизитамиФормыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	Для каждого РаскрытиеСписка из Объект.ДанныеРаскрытияСпискаВладельцев Цикл
		РаскрытиеСписка.Обрабатывать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделение(Команда)
	Для каждого РаскрытиеСписка из Объект.ДанныеРаскрытияСпискаВладельцев Цикл
		РаскрытиеСписка.Обрабатывать = Ложь;
	КонецЦикла;
КонецПроцедуры

