&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ВариантМодифицирован = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыДанных();
	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	НастройкаПериода = Новый СтандартныйПериод(Отчет.ДатаКон, Отчет.ДатаКон);
	НастройкаПериода.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода(); 
	ДиалогРедактирования.Период = НастройкаПериода; 
	Если ДиалогРедактирования.Редактировать() Тогда 
		Отчет.ДатаНач = ДиалогРедактирования.Период.ДатаНачала;
		Отчет.ДатаКон = ДиалогРедактирования.Период.ДатаОкончания;
	КонецЕсли;
	УстановитьПараметрыДанных();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыДанных()
	Если Отчет.ДатаНач > Отчет.ДатаКон Тогда
		Если ЗначениеЗаполнено(Отчет.ДатаКон) Тогда
			Предупреждение("Установите правильный интервал!");
		КонецЕсли;
		Отчет.ДатаКон = Отчет.ДатаНач;
	КонецЕсли;
	
	ПараметрСтдПериод = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтдПериод");
	ПараметрСтдПериод.Использование = Истина;
	ПараметрСтдПериод.Значение = Новый СтандартныйПериод(НачалоДня(Отчет.ДатаНач), КонецДня(Отчет.ДатаКон));
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)
	УстановитьПараметрыДанных();
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)
	УстановитьПараметрыДанных();
КонецПроцедуры

&НаКлиенте
Процедура Отбор(Команда)
	Элементы.ФормаОтбор.Пометка = НЕ Элементы.ФормаОтбор.Пометка;
	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура Выбор(Команда)
	Элементы.ФормаВыбор.Пометка = НЕ Элементы.ФормаВыбор.Пометка;
	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	Элементы.ГруппаОтбор.Видимость = Элементы.ФормаОтбор.Пометка;
	Элементы.ГруппаВыбор.Видимость = Элементы.ФормаВыбор.Пометка;	
	
	// получим количество отборов с признаком "Использование"
	КоличествоАктивныхОтборов      	 = ПолучитьКоличествоАктивныхОтборов();
	Элементы.ФормаОтбор.Заголовок  	 = "Отбор" + ?(КоличествоАктивныхОтборов > 0, " ("+КоличествоАктивныхОтборов+")", "");
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКоличествоАктивныхОтборов()
	Возврат ПолучитьСтруктуруИспользуемыхОтборов().Количество();	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруИспользуемыхОтборов()
	СтруктураИспользуемыхОтборов = Новый Структура;
	ЭлементыОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Для Каждого Эл Из ЭлементыОтбора Цикл
		Если Эл.Использование Тогда
			СтруктураИспользуемыхОтборов.Вставить(СокрЛП(Эл.ЛевоеЗначение), Эл.ПравоеЗначение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураИспользуемыхОтборов;
КонецФункции

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.ТекущийЭлемент.Имя = "КомпоновщикНастроекНастройкиОтборЛевоеЗначение" Тогда
	    Отказ = Истина;
	КонецЕсли; 
КонецПроцедуры
