
&НаКлиенте
Процедура ВыборПериода(Команда)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		НастройкаПериода = Новый НастройкаПериода;
		НастройкаПериода.УстановитьПериод(Объект.ДатаНач, ?(Объект.ДатаКон=Дата("00010101"), Объект.ДатаКон, КонецДня(Объект.ДатаКон)));
		НастройкаПериода.РедактироватьКакПериод = Истина;
		НастройкаПериода.ВариантНастройки 		= ВариантНастройкиПериода.Период;
		
		Если НастройкаПериода.Редактировать() Тогда
			Объект.ДатаНач = НастройкаПериода.ПолучитьДатуНачала();
			Объект.ДатаКон = НастройкаПериода.ПолучитьДатуОкончания();
		КонецЕсли;
	#Иначе
		Диалог = Новый ДиалогРедактированияСтандартногоПериода();
		Период = Новый СтандартныйПериод(Объект.ДатаНач,  ?(Объект.ДатаКон=Дата("00010101"), Объект.ДатаКон, КонецДня(Объект.ДатаКон)));
		Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		Диалог.Период = Период;
		Если Диалог.Редактировать() Тогда 
			Объект.ДатаНач = Диалог.Период.ДатаНачала;
			Объект.ДатаКон = Диалог.Период.ДатаОкончания;
		КонецЕсли; 
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Если ЗначениеЗаполнено(Объект.ДатаНач) И ЗначениеЗаполнено(Объект.ДатаКон) И Объект.ДатаНач <= Объект.ДатаКон Тогда
		Если ЗагрузитьНаСервере() Тогда
			Предупреждение("Загрузка успешно завершена.");
		Иначе
			Предупреждение("Во время загрузки происходили ошибки. См. журнал регистрации.");
		КонецЕсли;
	Иначе
		Предупреждение("Укажите корректный период загрузки.");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗагрузитьНаСервере()
	мОбъект = РеквизитФормыВЗначение("Объект");
	РезультатЗагрузки = мОбъект.ВыполнитьЗагрузкуЗаПериод(Объект.ДатаНач, Объект.ДатаКон, Объект.КаталогДанныхИсточник, Объект.КаталогДанныхПриемник);
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
	Возврат РезультатЗагрузки;
КонецФункции
