
#Область СлужебныйПрограммныйИнтерфейс

// Выполняет расчет рыночных цен по указанной методике, за указанный период и с указанными опциями
//
// Параметры:
//  ПараметрыРасчета - Структура - должна содержать следующие элементы:
//  ----.*МетодикаРасчета					 - ПеречислениеСсылка.МетодикиРасчетаРыночныхЦен
//  ----.*ДатаРасчета						 - Дата	 - Дата на которую расчитываются рыночные цены ЦБ (для 481 отчета)
//  ----.*НачалоПериода						 - Дата	 - Начало периода за который расчитываются рыночные цены ЦБ (для 0409404 отчета)
//  ----.*ОкончаниеПериода					 - Дата	 - Окончание периода за который расчитываются рыночные цены ЦБ (для 0409404 отчета)
//  ----.*ПоОстаткам						 - Булево	 - Фильтр: Только по ценным бугам на остатке
//  ----.*ISINs								 - Строка	 - Фильтр: Только по ценным бумагам с указанными ISIN
//  ----.*ЗапросЦеныПоследнейСделкиПоISIN	 - Булево	 - Фильтр: Принудительно запросить цену последней сделки по указанными ISIN
//  ----.*БезЗапросаЦеныПоследнейСделки		 - Булево	 - Фильтр: Не запрашивать (в BQ) цену последней сделки
//  ОтчетРезультат	 - ТабличныйДокумент	 - Результат расчета
//
Процедура ВыполнитьРасчетРыночныхЦенЦенныхБумаг(ПараметрыРасчета, ОтчетРезультат = Неопределено) Экспорт
	// Расчет за рабочие дни
	Отказ					 = Ложь;
	ТекстОтказа				 = "";
	ОтправлятьУведомление	 = Ложь;
	
	Если ПараметрыРасчета.МетодикаРасчета = Перечисления.МетодикиРасчетаРыночныхЦен.Для0409404 Тогда
		ПараметрыРасчета.Удалить("ДатаРасчета");
		РезультатыРасчета = РасчетРыночныхЦенДля0409404.РассчитатьРыночныеЦены(ПараметрыРасчета, Отказ, ТекстОтказа, ОтправлятьУведомление);
		РасчетРыночныхЦенДля0409404.РассчитатьРыночныеЦеныЗаНерабочиеДниПериода(ПараметрыРасчета, РезультатыРасчета, Отказ, ТекстОтказа);
		Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Были ошибки: " + ТекстОтказа);
		КонецЕсли;
	ИначеЕсли ПараметрыРасчета.МетодикаРасчета = Перечисления.МетодикиРасчетаРыночныхЦен.Для481 Тогда
		ПараметрыРасчета.Удалить("НачалоПериода");
		ПараметрыРасчета.Удалить("ОкончаниеПериода");
		РезультатыРасчета = РасчетРыночныхЦенДля481.РассчитатьРыночныеЦены(ПараметрыРасчета, Отказ, ТекстОтказа, ОтправлятьУведомление);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрана методика расчета");
	КонецЕсли;
	
	ОтчетРезультат = ОбщегоНазначения.ДанныеТаблицыЗначенийВТабличныйДокументСКД(РезультатыРасчета);
КонецПроцедуры

#КонецОбласти
