
Функция ОтправитьУведомлениеДепозитарию(БизнесПроцесс) Экспорт
	// Подготовка данных письма
	ТемаПисьма = "Ожидает отправки документ Раскрытие списка владельцев";
	ТекстПисьма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"По КД референс %1 ожидает отправки документ Раскрытие списка владельцев", БизнесПроцесс.КДРеференс);
		
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(
		ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОНалоговомРСВ).Настройка;
	
	// Сформируем уведомление
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);				
КонецФункции

Функция РезультатСозданияОбновленияДокументаРаскрытиеСпискаВладельцев(КД) Экспорт
	ИмяСобытия = "Создание/обновление налогового списка раскрытия владельцев";
	ДепонентыСПоручениями1_10 = Документы.РаскрытиеСпискаВладельцев.ДепонентыСПоручениями1_10(КД);
	
	ДокСсылка = РаскрытиеСпискаВладельцев(КД);
	Если ЗначениеЗаполнено(ДокСсылка) Тогда
		ДокОбъект = ДокСсылка.ПолучитьОбъект();
	Иначе
		ДокОбъект = Документы.РаскрытиеСпискаВладельцев.СоздатьДокумент();
	КонецЕсли;
	
	ДокОбъект.Дата = ТекущаяДата();
	Если НЕ ЗначениеЗаполнено(ДокСсылка) Тогда
		ДокОбъект.Заполнить(КД);
	КонецЕсли;
	ДокОбъект.ЗаполнитьСписокВладельцевПоОстаткам_ЕстьФормаW8_НеНалогРаздел_ЕстьДлящеесяПоручение();
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			"Документ РСВ не записан: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	РегистрыСведений.Поручения1_10ПоРСВ.УстановитьСвязи(ДокОбъект.Ссылка, ДепонентыСПоручениями1_10.Поручения); //555 проверить корректность
	Возврат Истина;
КонецФункции

Функция РаскрытиеСпискаВладельцев(КД)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РСВ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев КАК РСВ
	|ГДЕ
	|	РСВ.КарточкаКД = &КарточкаКД
	|	И НЕ РСВ.ПометкаУдаления";
	Запрос.УстановитьПараметр("КарточкаКД", КД);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.РаскрытиеСпискаВладельцев.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
