
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.НастройкиАлгоритма) = Тип("Структура") тогда
		
		Настройки = Параметры.НастройкиАлгоритма;
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.УстановитьПользовательскиеНастройки(Настройки);
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
		
		СтатьиЗатратКомиссияБанка.ЗагрузитьЗначения(ЗначениеИзСтрокиВнутр(Настройки.Значения.КомиссияБанка));
		СтатьиЗатратДепозитарныеУслуги.ЗагрузитьЗначения(ЗначениеИзСтрокиВнутр(Настройки.Значения.ДепозитарныеУслуги));
		// VTB-Borisov  - 03.08.2016 { 
		СтатьиЗатратДивиденды.ЗагрузитьЗначения(ЗначениеИзСтрокиВнутр(Настройки.Значения.Дивиденды));
		// VTB-Borisov  - 03.08.2016 }
		СписокДоговоров.ЗагрузитьЗначения(ЗначениеИзСтрокиВнутр(Настройки.Значения.Договоры));   // IMAPPS-30616
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	
	Заголовок = "";
	ЗначенияПараметров = УстановитьПараметры(Заголовок);
	ОповеститьОВыборе(Новый Структура("Значения,ЗаголовокНастроек", ЗначенияПараметров,Заголовок));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоУмолчанию(Команда)
	
	НастройкиПоУмолчаниюНаСервере();
	
КонецПроцедуры // НастройкиПоУмолчанию()

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Функция УстановитьПараметры(Заголовок)
	
	Значения = Новый Структура;
	Значения.Вставить("УзелОбмена", 						Объект.УзелОбмена);
	Значения.Вставить("ВебСервис", 							Объект.ВебСервис);
	Значения.Вставить("ПользовательВебСервиса", 			Объект.ПользовательВебСервиса);
	Значения.Вставить("ПарольВебСервиса", 					Объект.ПарольВебСервиса);
	Значения.Вставить("УзелОбменаРГС", 						Объект.УзелОбменаРГС);    // IMAPPS-30616 
	Значения.Вставить("ВебСервисРГС",						Объект.ВебСервисРГС);
	Значения.Вставить("ПользовательВебСервисаРГС", 			Объект.ПользовательВебСервисаРГС);
	Значения.Вставить("ПарольВебСервисаРГС",				Объект.ПарольВебСервисаРГС);
	Значения.Вставить("КоличествоПотоков", 					Объект.КоличествоПотоков); 
	Значения.Вставить("Таймаут", 							Объект.Таймаут);  
	Значения.Вставить("СтартоватьСделкиПриЗагрузке", 		Объект.СтартоватьСделкиПриЗагрузке);  
	Значения.Вставить("ОчищатьСпискиДляОбработки", 			Объект.ОчищатьСпискиДляОбработки);
	Значения.Вставить("ИспользоватьТранзакции", 			Объект.ИспользоватьТранзакции);
	Значения.Вставить("КоличествоОбъектовНаТранзакцию", 	Объект.КоличествоОбъектовНаТранзакцию);
	Значения.Вставить("ПочтовыйЛогин", 						Объект.ПочтовыйЛогин);
	Значения.Вставить("СписокРассылки", 					XMLСтрока(Новый ХранилищеЗначения(Объект.СписокРассылки.Выгрузить())));
	
	КомиссияБанка = СтатьиЗатратКомиссияБанка.ВыгрузитьЗначения();
	Значения.Вставить("КомиссияБанка", ЗначениеВСтрокуВнутр(КомиссияБанка));
	
	ДепозитарныеУслуги = СтатьиЗатратДепозитарныеУслуги.ВыгрузитьЗначения();
	Значения.Вставить("ДепозитарныеУслуги", ЗначениеВСтрокуВнутр(ДепозитарныеУслуги));
	
	// VTB-Borisov  - 03.08.2016 }
	Дивиденды = СтатьиЗатратДивиденды.ВыгрузитьЗначения();
	Значения.Вставить("Дивиденды", ЗначениеВСтрокуВнутр(Дивиденды));
	// VTB-Borisov  - 03.08.2016 }
	
	// IMAPPS-30616 ++
	Договоры = СписокДоговоров.ВыгрузитьЗначения();
	Значения.Вставить("Договоры", ЗначениеВСтрокуВнутр(Договоры));
	// IMAPPS-30616 --
	
	// IMAPPS-35434++
	Значения.Вставить("ЗадержкаЗапускаФоновогоЗадания", 	Объект.ЗадержкаЗапускаФоновогоЗадания);
	// IMAPPS-35434--
	
	ПредставлениеПочты = ?(Объект.СписокРассылки.Количество()>0, "Установлен список рассылки","");
	Заголовок = СокрЛП(Заголовок);

	Возврат Значения;
	
КонецФункции

&НаСервере
Процедура НастройкиПоУмолчаниюНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.НастройкиПоУмолчанию(ОбработкаОбъект);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

#КонецОбласти
