
&НаСервере
Процедура ЗаполнитьВсёНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ЗаполнитьТаблицуНКД();
	ТекОбъект.ЗаполнитьТаблицуПогашение();
	ТекОбъект.ЗаполнитьТаблицуДивиденды();	
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсё(Команда)
	
	ЗаполнитьВсёНаСервере();
	
	Сообщить("Заполнение завершено");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьВсёНаСервере(МассивСообщений)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.СоздатьОперацииПоНКД(МассивСообщений);
	ТекОбъект.СоздатьОперацииПоПогашение(МассивСообщений); 
	ТекОбъект.СоздатьОперацииПоДивидендам(МассивСообщений);
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");

КонецПроцедуры

&НаКлиенте
Процедура СоздатьВсё(Команда) 
	
	МассивСообщений = Новый Массив;
	СоздатьВсёНаСервере(МассивСообщений); 
	
	Для Каждого Элемент из МассивСообщений Цикл
		Сообщить(Элемент, СтатусСообщения.Важное);
	КонецЦикла;
	
	Сообщить("Создание операций завершено");
	
КонецПроцедуры


#Область НКД

&НаСервере
Процедура ЗаполнитьНКДНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ЗаполнитьТаблицуНКД();
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНКД(Команда)
	ЗаполнитьНКДНаСервере();
	
	Сообщить("Заполнение НКД завершено");
КонецПроцедуры

&НаСервере
Процедура СоздатьНКДНаСервере(МассивСообщений)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.СоздатьОперацииПоНКД(МассивСообщений);
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНКД(Команда)
	
	МассивСообщений = Новый Массив;
	СоздатьНКДНаСервере(МассивСообщений);
	
	Для Каждого Элемент из МассивСообщений Цикл
		Сообщить(Элемент, СтатусСообщения.Важное);
	КонецЦикла;
	
	Сообщить("Создание операций по НКД завершено");
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьНКДНаСервере()
	
	Для Каждого Стр Из Объект.Купон Цикл 
		Стр.Отм = Истина;	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьНКД(Команда)
	ОтметитьНКДНаСервере();
КонецПроцедуры

&НаСервере
Процедура СнятьНКДНаСервере()
	
	Для Каждого Стр Из Объект.Купон Цикл 
		Стр.Отм = ЛОжь;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьНКД(Команда)
	СнятьНКДНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Погашение

&НаСервере
Процедура ЗаполнитьПогашениеНаСервере() 
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ЗаполнитьТаблицуПогашение();
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПогашение(Команда)
	ЗаполнитьПогашениеНаСервере();
	
	Сообщить("Заполнение Погашения завершено")
КонецПроцедуры

&НаСервере
Процедура СоздатьПогашениеНаСервере(МассивСообщений)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.СоздатьОперацииПоПогашение(МассивСообщений);
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");

КонецПроцедуры

&НаКлиенте
Процедура СоздатьПогашение(Команда)
	
	МассивСообщений = Новый Массив;	
	СоздатьПогашениеНаСервере(МассивСообщений);
	
	Для Каждого Элемент из МассивСообщений Цикл
		Сообщить(Элемент, СтатусСообщения.Важное);
	КонецЦикла;
	
	Сообщить("Создание операций по Погашению завершено");
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьПогашениеНаСервере() 
	
	Для Каждого Стр Из Объект.Погашение Цикл 
		Стр.Отм = Истина;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьПогашение(Команда)	
	ОтметитьПогашениеНаСервере(); 	
КонецПроцедуры

&НаСервере
Процедура СнятьПогашениеНаСервере()
	
	Для Каждого Стр Из Объект.Погашение Цикл 
		Стр.Отм = Ложь;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПогашение(Команда)
	СнятьПогашениеНаСервере();
КонецПроцедуры

#КонецОбласти   

#Область Погашение

&НаСервере
Процедура ЗаполнитьДивидендыНаСервере()

	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ЗаполнитьТаблицуДивиденды();
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДивиденды(Команда)
	ЗаполнитьДивидендыНаСервере();
	
	Сообщить("Заполнение Дивидендов завершено")
КонецПроцедуры

&НаСервере
Процедура СоздатьДивидендыНаСервере(МассивСообщений)  
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.СоздатьОперацииПоДивидендам(МассивСообщений);
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект")
	;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДивиденды(Команда)
	
	МассивСообщений = Новый Массив;	
	СоздатьДивидендыНаСервере(МассивСообщений);
	
	Для Каждого Элемент из МассивСообщений Цикл
		Сообщить(Элемент, СтатусСообщения.Важное);
	КонецЦикла;
	
	Сообщить("Создание операций по Дивидендам завершено");
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьДивидендыНаСервере()
	
	Для Каждого Стр Из Объект.Дивиденды Цикл 
		Стр.Отм = Истина;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьДивиденды(Команда)
	ОтметитьДивидендыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СнятьДивидендыНаСервере()
	
	Для Каждого Стр Из Объект.Дивиденды Цикл 
		Стр.Отм = Ложь;	
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура СнятьДивиденды(Команда)
	СнятьДивидендыНаСервере();
КонецПроцедуры  

#КонецОбласти 


