
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого Строка Из ВладелецФормы.Объект.СводноеРаскрытие Цикл
		Если ЗначениеЗаполнено(Строка.Договор) Тогда // выбираем только детальные записи
			ЗаполнитьЗначенияСвойств(ДеталиСводногоРаскрытия.Добавить(), Строка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда)
	Перем ИтогРаздела;
	ДеталиСводногоРаскрытия.Сортировать("РазделСчетаДепоМХ,НалоговаяСтавка,СтатусПоГлаве4,Клиент,Субклиент");
	СводноеРаскрытие = ВладелецФормы.Объект.СводноеРаскрытие;
	СводноеРаскрытие.Очистить();
	Для Каждого Элемент Из ДеталиСводногоРаскрытия Цикл
		Если ИтогРаздела = Неопределено Или ИтогРаздела.РазделСчетаДепоМХ <> Элемент.РазделСчетаДепоМХ Тогда
			ИтогРаздела = СводноеРаскрытие.Добавить();
			ИтогРаздела.РазделСчетаДепоМХ = Элемент.РазделСчетаДепоМХ;
			ИтогСтавки = Неопределено;
		КонецЕсли;
		Если ИтогСтавки = Неопределено Или ИтогСтавки.НалоговаяСтавка <> Элемент.НалоговаяСтавка Тогда
			ИтогСтавки = СводноеРаскрытие.Добавить();
			ИтогСтавки.РазделСчетаДепоМХ = Элемент.РазделСчетаДепоМХ;
			ИтогСтавки.НалоговаяСтавка = Элемент.НалоговаяСтавка;
			ИтогСтатуса = Неопределено;
		КонецЕсли;
		Если ИтогСтатуса = Неопределено Или ИтогСтатуса.СтатусПоГлаве4 <> Элемент.СтатусПоГлаве4 Тогда
			ИтогСтатуса = СводноеРаскрытие.Добавить();
			ИтогСтатуса.РазделСчетаДепоМХ = Элемент.РазделСчетаДепоМХ;
			ИтогСтатуса.НалоговаяСтавка = Элемент.НалоговаяСтавка;
			ИтогСтатуса.СтатусПоГлаве4 = Элемент.СтатусПоГлаве4;
		КонецЕсли;
		Строка = СводноеРаскрытие.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Элемент);
		Строка.Бенефициар = КонечныйБенефициар(Элемент.РазделСчетаДепо, Элемент.Клиент, Элемент.Субклиент, Элемент.W8BENE_W8NEN);
		Строка.КоличествоЦБ = Элемент.КоличествоЦБ;
		ИтогСтатуса.КоличествоЦБ = ИтогСтатуса.КоличествоЦБ + Элемент.КоличествоЦБ;
		ИтогСтавки.КоличествоЦБ = ИтогСтавки.КоличествоЦБ + Элемент.КоличествоЦБ;
		ИтогРаздела.КоличествоЦБ = ИтогРаздела.КоличествоЦБ + Элемент.КоличествоЦБ;
	КонецЦикла;
	Закрыть(КодВозвратаДиалога.ОК);
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонечныйБенефициар(РазделСчетаДепо, Клиент, Субклиент, W8BENE_W8NEN)
	Если Не Клиент.Субброкер Тогда
		Возврат Клиент;
	ИначеЕсли РазделСчетаДепо.РазделСубклиента Тогда
		Возврат ?(ЗначениеЗаполнено(Субклиент), Субклиент, Клиент);
	ИначеЕсли ЗначениеЗаполнено(W8BENE_W8NEN) И Не W8BENE_W8NEN.ПометкаУдаления Тогда
		Возврат Субклиент;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

