#Область ПрограммныйИнтерфейс

// Функция определяет следующий порядковый номер технической операции внутри дня
// Параметры:
//	Дата - Дата
// Возвращаемое значение:
//	- Число
Функция НовыйПорядковыйНомерВТечениеДня(Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(МАКСИМУМ(ТехническаяОперация.ПорядковыйНомерВнутриДня), 0) КАК ПорядковыйНомер
	               |ИЗ
	               |	Документ.ТехническаяОперация КАК ТехническаяОперация
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ТехническаяОперация.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПорядковыйНомер + 1;
	Иначе
		Возврат 1;
	КонецЕсли; 
КонецФункции // НовыйПорядковыйНомерВТечениеДня()

// Функция ищет техническую операцию по ее параметра
// Параметры:
//	Параметры - Структура
// Возвращаемое значение:
//	- ДокументСсылка.ИсходящийПакетВФайловыйШлюз
Функция НайтиДокумент(Параметры) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТехническаяОперация.Ссылка
	|ИЗ
	|	Документ.ТехническаяОперация КАК ТехническаяОперация
	|ГДЕ Истина";
	
	НомерПараметра = 0;
	Для каждого Параметр Из Параметры Цикл
		Если ТипЗнч(Параметр.Значение) = Тип("Строка") Тогда
			Запрос.Текст = Запрос.Текст + " И ВЫРАЗИТЬ(" + Параметр.Ключ + " КАК Строка(1000)) = &Параметр" + НомерПараметра;
		Иначе
			Запрос.Текст = Запрос.Текст + " И " + Параметр.Ключ + " = &Параметр" + НомерПараметра;
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("Параметр" + НомерПараметра, Параметр.Значение);
		
		НомерПараметра = НомерПараметра + 1;
	КонецЦикла; 
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.ТехническаяОперация.ПустаяСсылка();
	КонецЕсли;

КонецФункции // НайтиДокумент()

// Процедура отправляет уведомление об ошибке доставки выписки
// Параметры:
//	ТехническаяОперация	 - ДокументСсылка.ТехническаяОперация
//	ОписаниеОшибки		 - Строка
//	ИсходящийПакет		 - ДокументСсылка.ИсходящийПакетВФайловыйШлюз
Процедура ОтправитьУведомлениеОбОшибкеДоставкиВыписки(ТехническаяОперация, ОписаниеОшибки, ИсходящийПакет = Неопределено) Экспорт
	ПВХ = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОбОшибкахДоставкиВыписокОСостоянииСчета;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПВХ).Настройка;
	Если НастройкиОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Выписка = ТехническаяОперация.ДокументОснование;
	Если ИсходящийПакет = Неопределено Тогда
		ИсходящийПакет = Документы.ТехническаяОперация.ИсходящийПакетВФайловыйШлюз(ТехническаяОперация);
	КонецЕсли;
	
	ТемаПисьма = "Ошибка при доставке периодической выписки о состоянии счета ДЕПО " + Строка(Выписка.СчетДепо);
	ТекстПисьма = ТемаПисьма + Символы.ПС;
	ТекстПисьма = ТекстПисьма + "Депонент: " + Строка(Выписка.ВладелецСчета) + Символы.ПС;
	ТекстПисьма = ТекстПисьма + "Поручение: " + Строка(Выписка.ДокументОснование) + Символы.ПС;
	ТекстПисьма = ТекстПисьма + "Выписка: " + Строка(Выписка) + " о стоянии счета депо на " + Строка(Выписка.ДатаКонПериода) + Символы.ПС;
	ТекстПисьма = ТекстПисьма + "Техническая операция: " + Строка(ТехническаяОперация) + Символы.ПС;
	ТекстПисьма = ТекстПисьма + "Исходящий пакет в файловый шлюз: " + Строка(ИсходящийПакет) + Символы.ПС;
	ТекстПисьма = ТекстПисьма + "Относительный путь (подкаталог исходящего пакета): " + ИсходящийПакет.ОтносительныйПуть;
	ТекстПисьма = ТекстПисьма + "Ошибка: " + ОписаниеОшибки;

	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКОтправке(ПараметрыУведомления);
КонецПроцедуры

// Функция ищет исходящий пакет в файловый шлюз созданный на основании указанной технической операции
// Параметры:
//	ТехническаяОперация - ДокументСсылка.ТехническаяОперация
// Возвращаемое значение:
//	- ДокументСсылка.ИсходящийПакетВФайловыйШлюз
Функция ИсходящийПакетВФайловыйШлюз(ТехническаяОперация) Экспорт
	ИсходящийПакет = Документы.ИсходящийПакетВФайловыйШлюз.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИсходящийПакетВФайловыйШлюз.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИсходящийПакетВФайловыйШлюз КАК ИсходящийПакетВФайловыйШлюз
	|ГДЕ
	|	ИсходящийПакетВФайловыйШлюз.ДокументОснование = &ТехническаяОперация
	|	И НЕ ИсходящийПакетВФайловыйШлюз.ПометкаУдаления";
	Запрос.УстановитьПараметр("ТехническаяОперация", ТехническаяОперация);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ИсходящийПакет = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ИсходящийПакет;
КонецФункции

#КонецОбласти