
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Если ПустаяСтрока(НомерДокументаОснования) Тогда
		ВызватьИсключение "Тезническая операция без основания!";
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерОснования", СокрЛП(НомерДокументаОснования)+"%");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТехническаяОперация.Ссылка), 0) КАК Количество
	|ИЗ
	|	Документ.ТехническаяОперация КАК ТехническаяОперация
	|ГДЕ
	|	ТехническаяОперация.НомерДокументаОснования ПОДОБНО &НомерОснования";
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ТехническаяОперация.ДокументОснование = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Номер = СокрЛП(НомерДокументаОснования) + "-" + Строка(Выборка.Количество + 1);
	
КонецПроцедуры
