
&НаКлиенте
Процедура Установить(Команда)
	
	НеЗаполненыОбязательныеРеквизиты = Ложь;
	
	Если Не ЗначениеЗаполнено(Отчет.ПочтовыйЛогин) Тогда
		НеЗаполненыОбязательныеРеквизиты = Истина;
		Сообщить("Не заполнен реквизит ""Почтовый логин""");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Отчет.КаталогВыгрузкиНаСервере) Тогда
		НеЗаполненыОбязательныеРеквизиты = Истина;
		Сообщить("Не заполнен реквизит ""Каталог выгрузки на сервере""");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Отчет.КаталогВыгрузкиНаСервереКопия) Тогда
		НеЗаполненыОбязательныеРеквизиты = Истина;
		Сообщить("Не заполнен реквизит ""Каталог выгрузки на сервере (копия)""");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Отчет.КоличествоПотоков) Тогда
		НеЗаполненыОбязательныеРеквизиты = Истина;
		Сообщить("Не заполнен реквизит ""Количество потоков""");
	КонецЕсли;
	
	Если НеЗаполненыОбязательныеРеквизиты = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПараметры(Заголовок);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметры(Заголовок)
	
	Настройки = Новый Структура;
	Настройки.Вставить("ПочтовыйЛогин", Отчет.ПочтовыйЛогин);
	Настройки.Вставить("СписокРассылки", XMLСтрока(Новый ХранилищеЗначения(Отчет.СписокРассылки.Выгрузить())));
	
	Настройки.Вставить("КоличествоДнейПослеОкончанияКвартала", Отчет.КоличествоДнейПослеОкончанияКвартала);
	Настройки.Вставить("КоличествоДнейПослеРасторженияДоговораДУ", Отчет.КоличествоДнейПослеРасторженияДоговораДУ);
	
	Настройки.Вставить("ЗагружатьДанныеЕПС", Отчет.ЗагружатьДанныеЕПС);
	Настройки.Вставить("ВнешняяИБ", Отчет.ВнешняяИБ);
	Настройки.Вставить("КаталогВыгрузкиНаСервере", Отчет.КаталогВыгрузкиНаСервере);
	Настройки.Вставить("КаталогВыгрузкиНаСервереКопия", Отчет.КаталогВыгрузкиНаСервереКопия);
	Настройки.Вставить("ОтоброжатьФИО", Отчет.ОтоброжатьФИО);
	Настройки.Вставить("ВыгружатьВФорматеExcel", Отчет.ВыгружатьВФорматеExcel);
	Настройки.Вставить("ВыгружатьВФорматеPDF", Отчет.ВыгружатьВФорматеPDF);
	Настройки.Вставить("НеФормироватьПечать", Отчет.НеФормироватьПечать);
	Настройки.Вставить("РазбиватьОтчетыПоПризнакуЛК", Отчет.РазбиватьОтчетыПоПризнакуЛК);
	Настройки.Вставить("КаталогВыгрузкиПоПризнакуЛКНаСервере", Отчет.КаталогВыгрузкиПоПризнакуЛКНаСервере);
	Настройки.Вставить("ФлагНовоеНаименованиеУК", Отчет.ФлагНовоеНаименованиеУК);
	Настройки.Вставить("НаименованиеУК", Отчет.НаименованиеУК);
	Настройки.Вставить("Подписант", Отчет.Подписант);
	Настройки.Вставить("ПоставкаПротивПлатежа", Отчет.ПоставкаПротивПлатежа);
	Настройки.Вставить("СкрыватьБалансовуюСтоимость", Отчет.СкрыватьБалансовуюСтоимость);
	Настройки.Вставить("КоличествоПотоков", Отчет.КоличествоПотоков);
	Настройки.Вставить("ЗагружатьДанныеРСБУ", Отчет.ЗагружатьДанныеРСБУ);
	Настройки.Вставить("ПулРДУ", Отчет.ПулРДУ);
	Настройки.Вставить("ИсключатьСЗаполненойДатойОкончания", Отчет.ИсключатьСЗаполненойДатойОкончания);
	
	ОбработкаОбъект = ДопОбработка.ПолучитьОбъект();
	ОбработкаОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(Настройки);
	ОбработкаОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДополнительнаяОбработкаСсылка", ДопОбработка);
	
	Если Не ЗначениеЗаполнено(ДопОбработка) Тогда
		ДопОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Отчет управляющего ДУ, согласно 482П_новая версия отчёта, использовать с 01.10.2017 (ускор.)", Истина);
	КонецЕсли;
	
	Настройки = ДопОбработка.ХранилищеНастроек.Получить();
	Если Настройки <> Неопределено Тогда
		ТекОтчет = РеквизитФормыВЗначение("Отчет");
		ТекОтчет.УстановитьПользовательскиеНастройки(Настройки);
		ЗначениеВРеквизитФормы(ТекОтчет, "Отчет");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКаталогаЗавершение", ЭтотОбъект);
	
	РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораКаталога.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНаСервереКопияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКаталогаКопияЗавершение", ЭтотОбъект);
	
	РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораКаталога.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиПоПризнакуЛКНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКаталогаПоПризнакуЛКЗавершение", ЭтотОбъект);
	
	РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораКаталога.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЕстьСлэш = Прав(ВыбранныеФайлы[0], 1) = "\";
		
		Отчет.КаталогВыгрузкиНаСервере = ВыбранныеФайлы[0] + ?(ЕстьСлэш, "", "\");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаКопияЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЕстьСлэш = Прав(ВыбранныеФайлы[0], 1) = "\";
		
		Отчет.КаталогВыгрузкиНаСервереКопия = ВыбранныеФайлы[0] + ?(ЕстьСлэш, "", "\");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаПоПризнакуЛКЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЕстьСлэш = Прав(ВыбранныеФайлы[0], 1) = "\";
		
		Отчет.КаталогВыгрузкиПоПризнакуЛКНаСервере = ВыбранныеФайлы[0] + ?(ЕстьСлэш, "", "\");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПотоковПриИзменении(Элемент)
	Если Отчет.КоличествоПотоков > 10 Тогда
		Отчет.КоличествоПотоков = 10;
		Сообщить("Максимальное количество потоков - 10");
	КонецЕсли;
КонецПроцедуры

