
/////////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС

Перем ВыполнениеПорученийВQUIK Экспорт;

Процедура ИнициироватьСоединениеQUIK(Параметры = Неопределено)
	ВнешниеДанные.ИнициироватьСоединение(ВыполнениеПорученийВQUIK, "ВыполнениеПорученийВQUIK", Параметры);
КонецПроцедуры

Процедура ЗаполнитьПоДокументам() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДокументПоручение.Ссылка КАК Документ
	|ИЗ
	|	Документ.Поручение КАК ДокументПоручение
	|ГДЕ
	|	ДокументПоручение.Проведен
	|	И ДокументПоручение.ПринятьВОбработку
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументПоручение.МоментВремени");
	ДокументыКОбработке.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

Процедура ЗаполнитьИзМассива(Ссылки) Экспорт
	ДокументыКОбработке.Очистить();
	Для Каждого Ссылка Из Ссылки Цикл
		НоваяСтрока = ДокументыКОбработке.Добавить();
		НоваяСтрока.Документ = Ссылка;
	КонецЦикла;
КонецПроцедуры

Функция РезультатИсполненияЭтапаОбработки() Экспорт
	Ошибки = "";
	Выборка = ВыборкаДокументовКОбработке();
	МаршрутЧастичногоИсполнения = МаршрутЧастичноеИсполнениеДокумента();
	
	Пока Выборка.Следующий() Цикл
		Если Не ПроверкаПолнотыПула(Выборка, Ошибки) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.ПоручениеОтменено Тогда
			МаршрутОтменыПоручения = МаршрутОтменыПоручения(Выборка);
			Если МаршрутОтменыПоручения.Найти(Выборка.ТекущийЭтап) = Неопределено Тогда
				ЗавершитьТекущийЭтапБезИсполнения(Выборка, "Поручение отменено");
			КонецЕсли;
			ЭтапОбработки = ЭтапОбработкиОтменыПоручения(Выборка, МаршрутОтменыПоручения);
		ИначеЕсли ЗначениеЗаполнено(Выборка.ТекущийЭтап) И Не ЗначениеЗаполнено(Выборка.ДатаОкончания) Тогда
			ЭтапОбработки = Выборка.ТекущийЭтап;
		Иначе
			Если МаршрутЧастичногоИсполнения.Найти(Выборка.ТекущийЭтап) <> Неопределено
				И ЭтоТекущееЧастичноеИсполнение(Выборка.Документ) Тогда
				Маршрут = МаршрутЧастичногоИсполнения;
			Иначе
				Маршрут = МаршрутПолноеИсполнениеДокумента(Выборка);
			КонецЕсли;
			Результат = СледующийЭтапОбработки(Выборка.Документ, Выборка.ТекущийЭтап, Маршрут);
			Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
				Ошибки = Ошибки + ?(ЗначениеЗаполнено(Ошибки), Символы.ПС, "") + Результат.Ошибка;
				Продолжить;
			КонецЕсли;
			ЭтапОбработки = Результат.СледующийЭтап;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтапОбработки) Тогда
			ИсполнитьЭтапОбработкиПоручения(Выборка, ЭтапОбработки);
		Иначе
			ДокументОбъект = Выборка.Документ.ПолучитьОбъект();
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.ПринятьВОбработку = Ложь;
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				Ошибки = Ошибки + ?(ЗначениеЗаполнено(Ошибки), Символы.ПС, "") + "Не удалось записать "
					+ Выборка.Документ;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	Возврат Ошибки;
КонецФункции

Функция РезультатПереходаКСледующемуЭтапу() Экспорт
	Ошибки = "";
	Выборка = ВыборкаДокументовКОбработке();
	Пока Выборка.Следующий() Цикл
		Маршрут = МаршрутПолноеИсполнениеДокумента(Выборка);
		Результат = СледующийЭтапОбработки(Выборка.Документ, Выборка.ТекущийЭтап, Маршрут);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			Ошибки = Ошибки + ?(ЗначениеЗаполнено(Ошибки), Символы.ПС, "") + Результат.Ошибка;
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат.СледующийЭтап) Тогда
			РегистрыСведений.ЭтапыОбработкиПоручений.ОбновитьЭтап(Выборка.Документ, Результат.СледующийЭтап,
				ТекущаяДата(), '00010101', "Переведен принудительно");
		Иначе
			ДокументОбъект = Выборка.Документ.ПолучитьОбъект();
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.ПринятьВОбработку = Ложь;
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				Ошибки = Ошибки + ?(ЗначениеЗаполнено(Ошибки), Символы.ПС, "") + "Не удалось записать "
					+ Выборка.Документ;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	Возврат Ошибки;
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////
// РЕАЛИЗАЦИЯ ФУНКЦИОНАЛА ОБРАБОТКИ

Функция СледующийЭтапОбработки(Документ, ПредыдущийЭтап, Маршрут)
	Результат = Новый Структура("СледующийЭтап,Ошибка", Справочники.ЭтапыОбработкиПоручений.ПустаяСсылка(), "");
	
	Если ЗначениеЗаполнено(ПредыдущийЭтап) Тогда
		ИндексЭтапа = Маршрут.Найти(ПредыдущийЭтап);
		Если ИндексЭтапа = Неопределено Тогда
			Результат.Ошибка = "Этап '" + ПредыдущийЭтап + "' не найден в маршруте обработки документа " + Документ;
		Иначе				
			ИндексСледующегоЭтапа = ИндексЭтапа + 1;
			Если ИндексСледующегоЭтапа < Маршрут.Количество() Тогда
				Результат.СледующийЭтап = Маршрут[ИндексСледующегоЭтапа];
			КонецЕсли;
		КонецЕсли;
	Иначе
		Результат.СледующийЭтап = Маршрут[0];
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Возвращает этап обработки отмены поручения, который необходимо выполнить. Если текущий этап не входит в маршрут отмены
//  , то он должен быть отменен перед вызовом данной функции, а функция возвращает первый этап из маршрута отмены (если маршрут заполнен),
//  в остальных случаях логика такая же, как и при исполнении поручения, если этап не завершён, возвращается он,
//  если завершен, то следующий
//
// Параметры:
//  ДанныеПоручения			 - ВыборкаИзРезультатаЗапроса
//  МаршрутОтменыПоручения	 - Массив
// 
// Возвращаемое значение:
//  СправочникСсылка.ЭтапыОбработкиПоручений - этап обработки отмены поручения, который необходимо выполнить
//
Функция ЭтапОбработкиОтменыПоручения(ДанныеПоручения, МаршрутОтменыПоручения)
	ЭтапОбработки = Неопределено;
	
	Если МаршрутОтменыПоручения.Найти(ДанныеПоручения.ТекущийЭтап) = Неопределено Тогда
		Если МаршрутОтменыПоручения.Количество() > 0 Тогда
			ЭтапОбработки = МаршрутОтменыПоручения[0];
		КонецЕсли;
	ИначеЕсли Не ЗначениеЗаполнено(ДанныеПоручения.ДатаОкончания) Тогда
		ЭтапОбработки = ДанныеПоручения.ТекущийЭтап;
	Иначе
		СледующийЭтапОбработки = СледующийЭтапОбработки(ДанныеПоручения.Документ, ДанныеПоручения.ТекущийЭтап, МаршрутОтменыПоручения);
		ЭтапОбработки = СледующийЭтапОбработки.СледующийЭтап;
	КонецЕсли;
	
	Возврат ЭтапОбработки;
КонецФункции

Функция МаршрутПолноеИсполнениеДокумента(ДанныеДокумента)
	// В будущем предполагается получать данные из РС МаршрутыОбработкиПоручений
	
	Маршрут = Новый Массив;
	Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.ПроверкаРеквизитов);
	
	Если ДанныеДокумента.ВидОперацииД = Справочники.ВидыОпераций.Депонирование Тогда
		Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.КонтрольКвалификацииИнвестора);
	КонецЕсли;
	
	Если ДанныеДокумента.РасчетыНаDMA Тогда
		Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.СверкаСВнешнимБрокером);
	КонецЕсли;
	
	Если ЭтоСписаниеЦБ(ДанныеДокумента) Тогда
		Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.КонтрольДостаточности);
		Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.ОткрытиеБлокировочногоРаздела);
		Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.БлокировкаЦБ);
	КонецЕсли;
	
	Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.СозданиеИнвентарнойОперации);
	Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.ИсполнениеВНРД);
	
	Если ДанныеДокумента.ИсточникЗагрузки = Перечисления.ИсточникиЗагрузки.QUIK Тогда
		Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.ОтправкаСтатусаВQUIK);
		Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.ОжиданиеИсполненияВQUIK);
	ИначеЕсли ДанныеДокумента.ИсточникЗагрузки = Перечисления.ИсточникиЗагрузки.Панда Тогда
		Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.ОтправкаСтатусаВПанда);
	КонецЕсли;
	
	ОтключитьЭтапОтправкиВЭДО =
		ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("83.ФормированиеСводныхОтчетовОСовершенныхОперациях", Ложь);
	Если Не ОтключитьЭтапОтправкиВЭДО Тогда
		Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.ОтправкаВЭДО);
	КонецЕсли;
	
	Возврат Маршрут;
КонецФункции

Функция ЭтоСписаниеЦБ(ДанныеДокумента)
	Если ДанныеДокумента.ВидОперацииД <> Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
		Возврат Ложь;
	ИначеЕсли ДанныеДокумента.РасчетыНаDMA И ДанныеДокумента.Количество <> Null Тогда
		// пока нетто-поручение не сформировано, считаем что может быть списание
		Возврат ДанныеДокумента.ВидОперации = Справочники.ВидыОпераций.СнятиеСДепонирования И ДанныеДокумента.Количество > 0;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция МаршрутОтменыПоручения(ДанныеПоручения)
	Маршрут = Новый Массив;
	Если ДанныеПоручения.ИсточникЗагрузки = Перечисления.ИсточникиЗагрузки.QUIK Тогда
		Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.ОтправкаСтатусаВQUIK);
		Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.ОжиданиеОтменыВQUIK);
	ИначеЕсли ДанныеПоручения.ИсточникЗагрузки = Перечисления.ИсточникиЗагрузки.Панда Тогда
		Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.ОтправкаСтатусаВПанда);
	КонецЕсли;
	Возврат Маршрут;
КонецФункции

Функция МаршрутЧастичноеИсполнениеДокумента()
	
	ОтключитьЭтапОтправкиВЭДО =
		ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("83.ФормированиеСводныхОтчетовОСовершенныхОперациях", Ложь);
	
	Маршрут = Новый Массив;
	Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.ИсполнениеВНРД);
	Если Не ОтключитьЭтапОтправкиВЭДО Тогда
		Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.ОтправкаВЭДО);
	КонецЕсли;
	Маршрут.Добавить(Справочники.ЭтапыОбработкиПоручений.ИсполнениеВНРД);
	Возврат Маршрут;
	
КонецФункции

Функция ЭтоТекущееЧастичноеИсполнение(Поручение)
	
	ДатаВвода = Константы.ДатаВводаЧастичногоИсполненияИнвентарныхПоручений.Получить();
	Если НЕ ЗначениеЗаполнено(ДатаВвода) ИЛИ Поручение.Дата < ДатаВвода Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеИсполнения = Документы.ИсполнениеПоручения.ДанныеИсполненияПоручения(Поручение);
	
	Возврат ДанныеИсполнения.Статус = Перечисления.СтатусыПоручений.ИсполненоЧастично;
	
КонецФункции

Функция ВыборкаДокументовКОбработке()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДокументПоручение.Ссылка КАК Документ,
	|	Этапы.Этап КАК ТекущийЭтап,
	|	Этапы.ДатаОкончания КАК ДатаОкончания,
	|	ДокументПоручение.ИдентификаторЗагрузки КАК ИдентификаторЗагрузки,
	|	ДокументПоручение.РасчетыНаDMA КАК РасчетыНаDMA,
	|	ДокументПоручение.ВидОперацииД КАК ВидОперацииД,
	|	ДокументПоручение.ВидИсполненияDVP КАК ВидИсполненияDVP,
	|	ДокументПоручение.КоличествоВПулеDVP3 КАК КоличествоВПулеDVP3,
	|	ДокументПоручение.НомерПулаDVP3 КАК НомерПулаDVP3,
	|	ДокументПоручение.ИсточникЗагрузки КАК ИсточникЗагрузки,
	|	НеттоПоручение.ВидОперации КАК ВидОперации,
	|	НеттоПоручение.Количество КАК Количество,
	|	НеттоПоручение.Сумма КАК Сумма,
	|	НеттоПоручение.Проведен КАК Проведен,
	|	ВЫБОР
	|		КОГДА СтатусыПорученийСрезПоследних.СтатусПоручения = ЗНАЧЕНИЕ(Перечисление.СтатусыПоручений.Отменено)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПоручениеОтменено
	|ИЗ
	|	Документ.Поручение КАК ДокументПоручение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭтапыОбработкиПоручений.СрезПоследних(, Поручение В (&ДокументыКОбработке)) КАК Этапы
	|		ПО ДокументПоручение.Ссылка = Этапы.Поручение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НеттоПоручение КАК НеттоПоручение
	|		ПО ДокументПоручение.Ссылка = НеттоПоручение.Поручения.Поручение
	|			И (НЕ НеттоПоручение.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПоручений.СрезПоследних(, Поручение В (&ДокументыКОбработке)) КАК СтатусыПорученийСрезПоследних
	|		ПО ДокументПоручение.Ссылка = СтатусыПорученийСрезПоследних.Поручение
	|ГДЕ
	|	ДокументПоручение.Ссылка В(&ДокументыКОбработке)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументПоручение.МоментВремени");
	Запрос.УстановитьПараметр("ДокументыКОбработке", ДокументыКОбработке.Выгрузить().ВыгрузитьКолонку("Документ"));
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция ПроверкаПолнотыПула(ДанныеПоручения, Ошибки)
	
	Результат = Истина;
	
	Если Не(ДанныеПоручения.ВидИсполненияDVP = Перечисления.ВидыИсполненийDVP.DVP3
		И ЗначениеЗаполнено(ДанныеПоручения.НомерПулаDVP3)) Тогда
		
		Возврат Результат; // Проверка выполняется только для поручений объединенных в Пул DVP-3.
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ПорученияПула.Ссылка                   КАК ПоручениеПула,
		|	ПорученияПула.НомерПулаDVP3            КАК НомерПулаDVP3,
		|	ПорученияПула.КоличествоВПулеDVP3      КАК КоличествоВПулеDVP3,
		|	ПорученияПула.ПорядковыйНомерВПулеDVP3 КАК ПорядковыйНомерВПулеDVP3
		|ИЗ
		|	Документ.Поручение КАК Поручение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение КАК ПорученияПула
		|		ПО НАЧАЛОПЕРИОДА(Поручение.Дата, ГОД) = НАЧАЛОПЕРИОДА(ПорученияПула.Дата, ГОД)
		|			И Поручение.ВидИсполненияDVP = ПорученияПула.ВидИсполненияDVP
		|			И Поручение.НомерПулаDVP3 = ПорученияПула.НомерПулаDVP3
		|			И Поручение.ВидПулаDVP3 = ПорученияПула.ВидПулаDVP3
		|			И ПорученияПула.Проведен
		|			И НЕ ПорученияПула.ПометкаУдаления
		|ГДЕ
		|	Поручение.Ссылка = &Поручение
		|УПОРЯДОЧИТЬ ПО
		|	ПорядковыйНомерВПулеDVP3";
	Запрос.УстановитьПараметр("Поручение", ДанныеПоручения.Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Сначала проверим количество.
	Если Выборка.Количество() <> ДанныеПоручения.КоличествоВПулеDVP3 Тогда
		
		ШаблонОшибки = "В пуле номер %1 ожидается %2 документа, но в системе отражены %3.
		               |Проверьте корректность загрузки поручений в систему.";
		ТекстОшибки  = СтрШаблон(ШаблонОшибки,
		                         ДанныеПоручения.НомерПулаDVP3,
		                         ДанныеПоручения.КоличествоВПулеDVP3,
		                         Выборка.Количество());
		
		Ошибки = Ошибки + ?(ЗначениеЗаполнено(Ошибки), Символы.ПС, "") + ТекстОшибки;
		
		Результат = Ложь;
		
	КонецЕсли;
	
	// Теперь проверим нумерацию поручений в Пуле.
	н = 1;
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПорядковыйНомерВПулеDVP3 <> н Тогда
			
			ШаблонОшибки = "В пуле номер %1 некорректная нумерация поручений.
			               |Проверьте корректность загрузки поручений в систему.";
			ТекстОшибки  = СтрШаблон(ШаблонОшибки,
			                         ДанныеПоручения.НомерПулаDVP3);
			
			Ошибки = Ошибки + ?(ЗначениеЗаполнено(Ошибки), Символы.ПС, "") + ТекстОшибки;
			
			Результат = Ложь;
			
		КонецЕсли;
		
		н = н + 1;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция - Количество ЦБДля блокировки с учетом пула
//
// Параметры:
//  ДанныеПоручения - ВыборкаИзРезультатаЗапроса - 
// 
// Возвращаемое значение:
//  Число, Неопределно - 0 - если не требуется блокировка, Неопределено - если нет пула.
//
Функция КоличествоЦБДляБлокировкиСУчетомПула(ДанныеПоручения)
	
	Результат = Неопределено;
	
	Если Не(ДанныеПоручения.ВидИсполненияDVP = Перечисления.ВидыИсполненийDVP.DVP3
		И ЗначениеЗаполнено(ДанныеПоручения.НомерПулаDVP3)) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ПорученияПула.Ссылка                            КАК ПоручениеПула,
		|	ВЫБОР
		|		КОГДА ПорученияПула.ВидОперацииД = &ЗачислениеЦБ
		|			ТОГДА ПорученияПула.КоличествоЦБ
		|		ИНАЧЕ -1 * ПорученияПула.КоличествоЦБ
		|	КОНЕЦ                                           КАК КоличествоЦБ,
		|	ЕСТЬNULL(ПорученияБлокировкаЦБ.КоличествоЦБ, 0) КАК Блокировано
		|ПОМЕСТИТЬ ВТ_ПорученияПула
		|ИЗ
		|	Документ.Поручение КАК Поручение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение КАК ПорученияПула
		|		ПО (НАЧАЛОПЕРИОДА(Поручение.Дата, ГОД) = НАЧАЛОПЕРИОДА(ПорученияПула.Дата, ГОД))
		|			И Поручение.ВидИсполненияDVP = ПорученияПула.ВидИсполненияDVP
		|			И Поручение.НомерПулаDVP3 = ПорученияПула.НомерПулаDVP3
		|			И Поручение.ВидПулаDVP3 = ПорученияПула.ВидПулаDVP3
		|			И ПорученияПула.Проведен
		|			И НЕ ПорученияПула.ПометкаУдаления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК ПорученияБлокировкаЦБ
		|		ПО ПорученияПула.Ссылка = ПорученияБлокировкаЦБ.ДокументОснование
		|			И ПорученияБлокировкаЦБ.ВидОперацииД = &ПереводЦБ
		|			И ПорученияБлокировкаЦБ.РазделСчетаДепоКонтрагента.ТипРазделаСчетаДЕПО = &БлокировочныйРаздел
		|			И ПорученияБлокировкаЦБ.Проведен
		|			И НЕ ПорученияБлокировкаЦБ.ПометкаУдаления
		|ГДЕ
		|	Поручение.Ссылка = &Поручение
		|;
		|
		|//////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_ПорученияПула.КоличествоЦБ) + СУММА(ВТ_ПорученияПула.Блокировано) КАК КоличествоЦБ
		|ПОМЕСТИТЬ ВТ_ДоступноЦБ
		|ИЗ
		|	ВТ_ПорученияПула КАК ВТ_ПорученияПула
		|ГДЕ
		|	НЕ ВТ_ПорученияПула.ПоручениеПула = &Поручение
		|;
		|
		|//////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ПорученияПула.КоличествоЦБ + ЕСТЬNULL(ВТ_ДоступноЦБ.КоличествоЦБ, 0) > 0
		|			ТОГДА 0
		|		КОГДА ЕСТЬNULL(ВТ_ДоступноЦБ.КоличествоЦБ, 0) < 0
		|			ТОГДА -1 * ВТ_ПорученияПула.КоличествоЦБ
		|		ИНАЧЕ -1 * (ВТ_ПорученияПула.КоличествоЦБ + ЕСТЬNULL(ВТ_ДоступноЦБ.КоличествоЦБ, 0))
		|	КОНЕЦ КАК КолБлокировать
		|ИЗ
		|	ВТ_ПорученияПула КАК ВТ_ПорученияПула
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоступноЦБ КАК ВТ_ДоступноЦБ
		|		ПО ИСТИНА
		|ГДЕ
		|	ВТ_ПорученияПула.ПоручениеПула = &Поручение
		|";
	Запрос.УстановитьПараметр("Поручение"          , ДанныеПоручения.Документ);
	Запрос.УстановитьПараметр("ПереводЦБ"          , Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо);
	Запрос.УстановитьПараметр("ЗачислениеЦБ"       , Справочники.ВидыОпераций.Депонирование);
	Запрос.УстановитьПараметр("БлокировочныйРаздел", Перечисления.ТипыРазделовСчетовДЕПО.БлокированоРасчеты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.КолБлокировать;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КоличествоПоПоручениямВПуле(Поручение)
	
	Результат = 0;
	
	Если Не ТипЗнч(Поручение) = тип("ДокументСсылка.Поручение") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	Поручение.ВидИсполненияDVP         КАК ВидИсполненияDVP,
		|	Поручение.НомерПулаDVP3            КАК НомерПулаDVP3,
		|	Поручение.ВидПулаDVP3              КАК ВидПулаDVP3,
		|	НАЧАЛОПЕРИОДА(Поручение.Дата, ГОД) КАК ГодПоручения,
		|	Поручение.Ссылка                   КАК Поручение
		|ПОМЕСТИТЬ ВТ_ПараметрыПула
		|ИЗ
		|	Документ.Поручение КАК Поручение
		|ГДЕ
		|	Поручение.Ссылка = &ТекПоручение
		|	И Поручение.ВидИсполненияDVP = &DVP3
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ДокументПоручение.ВидОперацииД = &ЗачислениеЦБ
		|			ТОГДА ДокументПоручение.КоличествоЦБ
		|		ИНАЧЕ -1 * ДокументПоручение.КоличествоЦБ
		|	КОНЕЦ КАК КоличествоЦБ
		|ПОМЕСТИТЬ ВТ_Количества
		|ИЗ
		|	Документ.Поручение КАК ДокументПоручение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПараметрыПула КАК ВТ_ПараметрыПула
		|		ПО ДокументПоручение.ВидИсполненияDVP = ВТ_ПараметрыПула.ВидИсполненияDVP
		|			И ДокументПоручение.НомерПулаDVP3 = ВТ_ПараметрыПула.НомерПулаDVP3
		|			И ДокументПоручение.ВидПулаDVP3 = ВТ_ПараметрыПула.ВидПулаDVP3
		|			И НАЧАЛОПЕРИОДА(ДокументПоручение.Дата, ГОД) = ВТ_ПараметрыПула.ГодПоручения
		|			И ДокументПоручение.Ссылка <> ВТ_ПараметрыПула.Поручение
		|			И НЕ ДокументПоручение.ПометкаУдаления
		|			И ДокументПоручение.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВТ_Количества.КоличествоЦБ), 0) КАК КоличествоЦБ
		|ИЗ
		|	ВТ_Количества КАК ВТ_Количества";
	Запрос.УстановитьПараметр("ТекПоручение", Поручение);
	Запрос.УстановитьПараметр("DVP3"        , Перечисления.ВидыИсполненийDVP.DVP3);
	Запрос.УстановитьПараметр("ЗачислениеЦБ", Справочники.ВидыОпераций.Депонирование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.КоличествоЦБ;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ВЫПОЛНЕНИЯ ЭТАПОВ ОБРАБОТКИ ПОРУЧЕНИЯ

Процедура ИсполнитьЭтапОбработкиПоручения(ДанныеДокумента, Этап)
	ДатаНачала = ТекущаяДата();
	Документ = ДанныеДокумента.Документ;
	Если Этап = Справочники.ЭтапыОбработкиПоручений.ПроверкаРеквизитов Тогда
		Результат = РезультатИсполненияЭтапаПроверкаРеквизитов(Документ);
		
	ИначеЕсли Этап = Справочники.ЭтапыОбработкиПоручений.КонтрольКвалификацииИнвестора Тогда
		Результат = РезультатИсполненияЭтапаКонтрольКвалификацииИнвестора(Документ);
		
	ИначеЕсли Этап = Справочники.ЭтапыОбработкиПоручений.СверкаСВнешнимБрокером Тогда
		Результат = РезультатИсполненияЭтапаСверкаСВнешнимБрокером(ДанныеДокумента);
		
	ИначеЕсли Этап = Справочники.ЭтапыОбработкиПоручений.КонтрольДостаточности Тогда
		Результат = РезультатИсполненияЭтапаКонтрольДостаточности(ДанныеДокумента);
		
	ИначеЕсли Этап = Справочники.ЭтапыОбработкиПоручений.СозданиеИнвентарнойОперации Тогда
		Результат = РезультатИсполненияЭтапаСозданиеИнвентарнойОперации(Документ, ДатаНачала);
		
	ИначеЕсли Этап = Справочники.ЭтапыОбработкиПоручений.ОткрытиеБлокировочногоРаздела Тогда
		Результат = РезультатИсполненияЭтапаОткрытиеБлокировочногоРаздела(ДанныеДокумента);
		
	ИначеЕсли Этап = Справочники.ЭтапыОбработкиПоручений.БлокировкаЦБ Тогда
		Результат = РезультатИсполненияЭтапаБлокировкаЦБ(ДанныеДокумента);
				
	ИначеЕсли Этап = Справочники.ЭтапыОбработкиПоручений.ИсполнениеВНРД Тогда
		Результат = РезультатИсполненияЭтапаИсполнениеВНРД(ДанныеДокумента);
		
	ИначеЕсли Этап = Справочники.ЭтапыОбработкиПоручений.ОтправкаСтатусаВQUIK Тогда
		Результат = РезультатИсполненияЭтапаОтправкаСтатусаВQUIK(ДанныеДокумента);
		
	ИначеЕсли Этап = Справочники.ЭтапыОбработкиПоручений.ОжиданиеИсполненияВQUIK Тогда
		Результат = РезультатИсполненияЭтапаОжиданиеИсполненияВQUIK(ДанныеДокумента);
		
	ИначеЕсли Этап = Справочники.ЭтапыОбработкиПоручений.ОжиданиеОтменыВQUIK Тогда
		Результат = РезультатИсполненияЭтапаОжиданиеОтменыВQUIK(ДанныеДокумента);
		
	ИначеЕсли Этап = Справочники.ЭтапыОбработкиПоручений.ОтправкаСтатусаВПанда Тогда
		Результат = РезультатИсполненияЭтапаОтправкаСтатусаВПанда(ДанныеДокумента);
		
	ИначеЕсли Этап = Справочники.ЭтапыОбработкиПоручений.ОтправкаВЭДО Тогда
		Результат = РезультатИсполненияЭтапаОтправкаВЭДО(Документ);
		
	Иначе
		Результат = Новый Структура("ВыполненУспешно,Статус", Ложь, "Не предусмотрена обработка этапа: " + Этап);
	КонецЕсли;
	ДатаОкончания = ?(Результат.ВыполненУспешно, ТекущаяДата(), '00010101');
	РегистрыСведений.ЭтапыОбработкиПоручений.ОбновитьЭтап(Документ, Этап, ДатаНачала, ДатаОкончания, Результат.Статус);
КонецПроцедуры

Функция РезультатИсполненияЭтапаПроверкаРеквизитов(Документ)
	Результат = Новый Структура("ВыполненУспешно, Статус", Истина, "");
	
	// Поля документа из запроса ниже, которые проверяются на заполнение
	ОбщиеПоля = Новый СписокЗначений;
	ОбщиеПоля.Добавить("Инициатор",			"Инициатор");
	ОбщиеПоля.Добавить("Депонент",			"Депонент");
	ОбщиеПоля.Добавить("СчетДепо",			"Счет ДЕПО в группе 'Депонент'");
	ОбщиеПоля.Добавить("РазделСчетаДепо",	"Раздел счета ДЕПО в группе 'Депонент'");
	ОбщиеПоля.Добавить("МХДепонента",		"Место хранения в группе 'Депонент'");
	ОбщиеПоля.Добавить("СчетДепоМХ",		"Счет ДЕПО места хранения в группе 'Депонент'");
	ОбщиеПоля.Добавить("РазделСчетаДепоМХ",	"Раздел счета ДЕПО места хранения в группе 'Депонент'");
	ОбщиеПоля.Добавить("Контрагент",		"Контрагент");
	ОбщиеПоля.Добавить("СчетДепоКонтрагента", "Счет ДЕПО в группе 'Контрагент'");
	ОбщиеПоля.Добавить("МХКонтрагент",		"Место хранения в группе 'Контрагент'");
	ОбщиеПоляDVP = Новый СписокЗначений;
	ОбщиеПоляDVP.Добавить("ПланируемаяДатаРасчетов","Планируемая дата расчетов");
	ОбщиеПоляDVP.Добавить("ДатаСделки",				"Дата сделки");
	ОбщиеПоляDVP.Добавить("БанковскийСчет",			"Банковский счет");
	ПоляТабличнойЧасти = Новый СписокЗначений;
	ПоляТабличнойЧасти.Добавить("ЦеннаяБумага"		, "ЦеннаяБумага");
	ПоляТабличнойЧасти.Добавить("Количество"		, "Количество");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Поручение.Дата КАК Дата,
	|	Поручение.ВидОперацииД КАК ВидОперации,
	|	Поручение.Инициатор КАК Инициатор,
	|	Поручение.Депонент КАК Депонент,
	|	Поручение.СчетДепо КАК СчетДепо,
	|	Поручение.РазделСчетаДепо КАК РазделСчетаДепо,
	|	Поручение.МХДепонента КАК МХДепонента,
	|	Поручение.СчетДепоМХ КАК СчетДепоМХ,
	|	Поручение.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	Поручение.Контрагент КАК Контрагент,
	|	Поручение.СчетДепоКонтрагента КАК СчетДепоКонтрагента,
	|	Поручение.МХКонтрагент КАК МХКонтрагент,
	|	Поручение.ЦБ КАК ЦБ,
	|	Поручение.КоличествоЦБ КАК КоличествоЦБ,
	|	ВЫБОР
	|		КОГДА Поручение.СуммаСделки <> 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоDVP,
	|	Поручение.ПланируемаяДатаРасчетов КАК ПланируемаяДатаРасчетов,
	|	Поручение.ДатаСделки КАК ДатаСделки,
	|	Поручение.БанковскийСчет КАК БанковскийСчет,
	|	ВЫРАЗИТЬ(Поручение.Контрагент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).Страна КАК СтранаЮрлицаКонтрагента,
	|	Поручение.ЦенныеБумагиСписываемые.(
	|		ЦеннаяБумага КАК ЦеннаяБумага,
	|		Количество КАК Количество
	|	) КАК ЦенныеБумагиСписываемые
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.Ссылка = &ПоручениеДляПроверки");
	Запрос.УстановитьПараметр("ПоручениеДляПроверки", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЦенныеБумагиСписываемые = Выборка.ЦенныеБумагиСписываемые.Выбрать();
		Если ЦенныеБумагиСписываемые.Количество() = 0 Тогда
			Результат.ВыполненУспешно = Ложь;
			Результат.Статус = Результат.Статус + "Не указаны ЦБ в табличной части поручения; ";
		Иначе
			Пока ЦенныеБумагиСписываемые.Следующий() Цикл
				ПроверитьЗаполнениеРеквизитов(ЦенныеБумагиСписываемые, ПоляТабличнойЧасти, Результат);
			КонецЦикла;
		КонецЕсли;
		
		ПроверитьЗаполнениеРеквизитов(Выборка, ОбщиеПоля, Результат);
		
		Если Выборка.ЭтоDVP Тогда
			ПроверитьЗаполнениеРеквизитов(Выборка, ОбщиеПоляDVP, Результат);
			
			Если Выборка.МХКонтрагент <> Константы.МестоХраненияПоУмолчанию.Получить()
				И Не ЗначениеЗаполнено(Выборка.СтранаЮрлицаКонтрагента) Тогда
					Результат.ВыполненУспешно = Ложь;
					Результат.Статус = Результат.Статус
						+ ?(ЗначениеЗаполнено(Результат.Статус), ", ", "Не все реквизиты заполнены: ")
						+ "Страна юр.лица контрагента";
			КонецЕсли;
		КонецЕсли;
	Иначе
		Результат.ВыполненУспешно = Ложь;
		Результат.Статус = "Не найдено поручение " + Документ;
	КонецЕсли;
	Если Результат.ВыполненУспешно Тогда
		Результат.Статус = "Реквизиты корректны";
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция РезультатИсполненияЭтапаКонтрольКвалификацииИнвестора(Документ)
	
	Результат = Новый Структура("ВыполненУспешно, Статус", Истина, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоручениеЦБСписываемые.ЦеннаяБумага.ВидЦББанкаРоссии.ВидИнструмента КАК ВидИнструмента,
	|	ПоручениеЦБСписываемые.ЦеннаяБумага.ВидЦББанкаРоссии КАК ВидЦББанкаРоссии,
	|	ПоручениеЦБСписываемые.ЦеннаяБумага.ДляКвалифицированныхИнвесторов КАК ДляКвалифицированныхИнвесторов,
	|	ПоручениеЦБСписываемые.ЦеннаяБумага КАК ЦБ,
	|	ВЫРАЗИТЬ(ПоручениеЦБСписываемые.Ссылка.Депонент КАК Справочник.Контрагенты).ЮридическиеФизическиеЛица КАК ЮрФизЛицо
	|ИЗ
	|	Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦБСписываемые
	|ГДЕ
	|	ПоручениеЦБСписываемые.Ссылка = &Ссылка
	|ИТОГИ
	|	МАКСИМУМ(ДляКвалифицированныхИнвесторов),
	|	МАКСИМУМ(ЮрФизЛицо)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат.ВыполненУспешно = Ложь;
		Результат.Статус = "Не найдено поручение " + Документ;
		Возврат Результат;
	КонецЕсли;
	
	ВыборкаПроверкаКвалИнвестора = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПроверкаКвалИнвестора.Следующий();
	Если Не ВыборкаПроверкаКвалИнвестора.ДляКвалифицированныхИнвесторов Тогда
		Результат.Статус = "Для операций с ЦБ не требуется статус квал.инвестора";
		Возврат Результат;
	КонецЕсли;
	
	ЭтоКвалИнвестор = РегистрыСведений.РеестрКвалифицированныхИнвесторовПоЗакону.ЕстьКИПОЗакону(ВыборкаПроверкаКвалИнвестора.ЮрФизЛицо,
	ТекущаяДатаСеанса());
	Если ЭтоКвалИнвестор Тогда
		Результат.Статус = СтатусКвалифицированногоИнвестора(ЭтоКвалИнвестор);
		Возврат Результат;
	КонецЕсли;
	
	ВыборкаЦБ = ВыборкаПроверкаКвалИнвестора.Выбрать();
	Пока ВыборкаЦБ.Следующий() Цикл
		Если Не ВыборкаЦБ.ДляКвалифицированныхИнвесторов Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаЦБ.ВидИнструмента) Тогда
			Результат.ВыполненУспешно = Ложь;
			Результат.Статус = Результат.Статус + "Не заполнен вид инструмента у вида ЦБ Банка России '" + ВыборкаЦБ.ВидЦББанкаРоссии
			+ "' для ценной бумаги '" + ВыборкаЦБ.ЦБ + "'";
			Возврат Результат;
		КонецЕсли;
		
		ЕстьКвалификацияИнвестора = РегистрыСведений.РеестрКвалифицированныхИнвесторовРОФР.ЕстьКвалификацияИнвестора(
		ВыборкаЦБ.ЮрФизЛицо, ВыборкаЦБ.ВидИнструмента, ТекущаяДатаСеанса());
		Если Не ЕстьКвалификацияИнвестора Тогда
			Результат.ВыполненУспешно = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Статус = Результат.Статус + СтатусКвалифицированногоИнвестора(Результат.ВыполненУспешно);
	Возврат Результат;
	
КонецФункции

Функция РезультатИсполненияЭтапаСверкаСВнешнимБрокером(Данные)
	Результат = Новый Структура("ВыполненУспешно,Статус", Ложь, "");
	Если Данные.Проведен = Истина Тогда
		Результат.Статус = "Нетто-поручение сформировано и проведено.";
		Результат.ВыполненУспешно = Истина;
	ИначеЕсли Данные.Проведен = Null Тогда
		Результат.Статус = "Отсутствует нетто-поручение.";
	Иначе
		Результат.Статус = "Нетто-поручение не проведено.";
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция РезультатИсполненияЭтапаКонтрольДостаточности(ДанныеДокумента)
	
	Результат = Новый Структура("ВыполненУспешно, Статус", Истина, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Поручение.СчетДепо КАК СчетДепо,
	|	Поручение.РазделСчетаДепо КАК РазделСчетаДепо,
	|	Поручение.СчетДепоМХ КАК СчетДепоМХ,
	|	Поручение.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ПоручениеЦенныеБумагиСписываемые.Количество КАК Количество
	|ПОМЕСТИТЬ ДанныеПоручения
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦенныеБумагиСписываемые
	|		ПО (ПоручениеЦенныеБумагиСписываемые.Ссылка = Поручение.Ссылка)
	|ГДЕ
	|	Поручение.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОстатки.КоличествоОстаток КАК Остаток,
	|	ОстаткиЦБОстатки.ЦБ КАК ЦБ
	|ПОМЕСТИТЬ ОстаткиЦБ
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&Период,
	|			(СчетДепо, РазделСчетаДепо, СчетДепоМХ, РазделСчетаДепоМХ, ЦБ) В
	|				(ВЫБРАТЬ
	|					ДанныеПоручения.СчетДепо,
	|					ДанныеПоручения.РазделСчетаДепо,
	|					ДанныеПоручения.СчетДепоМХ,
	|					ДанныеПоручения.РазделСчетаДепоМХ,
	|					ДанныеПоручения.ЦеннаяБумага
	|				ИЗ
	|					ДанныеПоручения)) КАК ОстаткиЦБОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоручения.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ДанныеПоручения.Количество КАК Количество,
	|	ЕСТЬNULL(ОстаткиЦБ.Остаток, 0) КАК Остаток
	|ИЗ
	|	ДанныеПоручения КАК ДанныеПоручения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиЦБ КАК ОстаткиЦБ
	|		ПО ДанныеПоручения.ЦеннаяБумага = ОстаткиЦБ.ЦБ";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Ссылка", ДанныеДокумента.Документ);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат.ВыполненУспешно = Ложь;
		Результат.Статус = "Не найдено поручение " + ДанныеДокумента.Документ;
		Возврат Результат;
	КонецЕсли;
	
	КоличествоВПуле = КоличествоПоПоручениямВПуле(ДанныеДокумента.Документ);
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Количество = ?(ДанныеДокумента.РасчетыНаDMA, ДанныеДокумента.Количество, Выборка.Количество);
		Если Количество > Выборка.Остаток + КоличествоВПуле Тогда
			Результат.ВыполненУспешно = Ложь;
			Результат.Статус = Результат.Статус + СтрШаблон("Остаток по ЦБ %1 %2%3, количество в поручении %4; ",
			Выборка.ЦеннаяБумага, Выборка.Остаток + КоличествоВПуле, ?(КоличествоВПуле > 0, " (с учётом пула DVP3)", ""), Количество);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Статус = Результат.Статус + "Остатков ЦБ " + ?(Результат.ВыполненУспешно, "", "не ") + "достаточно для исполнения поручения";
	Возврат Результат;
КонецФункции

Функция РезультатИсполненияЭтапаСозданиеИнвентарнойОперации(Поручение, ДатаНачала)
	
	ВремяНачалаЗамераОперацииЦБ = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Результат = Новый Структура("ВыполненУспешно, Статус", Ложь, "");
	
	Если ЭтоПоручениеНаСписаниеНулевогоНеттоПоручения(Поручение)
		И НЕ ЕстьОперацияНаЗачислениеНулевогоНеттоПоручения(Поручение) Тогда
		Результат.Статус = "Не найдена встречная операция на зачисление для операции списания по нулевому нетто-поручению";
	Иначе
		Попытка
			ЭтоМультиПоручениеП35_2 = Документы.Поручение.ЭтоМультиПоручениеП35_2(Поручение);
			Если ЭтоМультиПоручениеП35_2 Тогда
				Результат.Статус = "Это поручение с видом инвентарной операции П35_2 и типом заявки MULTI_BUY";
			Иначе
				Документы.Поручение.СоздатьОбновитьОперацииЦБ(Поручение, РежимЗаписиДокумента.Запись, ДатаНачала, Результат.Статус);
			КонецЕсли;
			Результат.ВыполненУспешно = Истина;
		Исключение
			Результат.Статус = "Не удалось записать инвентарную операцию";
		КонецПопытки;
	КонецЕсли;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ЗаписьДокументаОперацииЦБ", ВремяНачалаЗамераОперацииЦБ,,, НЕ Результат.ВыполненУспешно);
	
	Возврат Результат;
	
КонецФункции

Функция РезультатИсполненияЭтапаОткрытиеБлокировочногоРаздела(ДанныеДокумента)
	
	Поручение = ДанныеДокумента.Документ;
	
	Результат = Новый Структура("ВыполненУспешно,Статус", Ложь, "");
	ТипРазделаБлокировки = Перечисления.ТипыРазделовСчетовДЕПО.БлокированоРасчеты;
	Если ЗначениеЗаполнено(Справочники.РазделыСчетаДепо.РазделСчетаДепо(Поручение.СчетДепо, ТипРазделаБлокировки)) Тогда
		Результат.ВыполненУспешно = Истина;
		Результат.Статус = "Блокировочный раздел уже открыт";
	ИначеЕсли ДанныеДокумента.ВидИсполненияDVP = Перечисления.ВидыИсполненийDVP.DVP3 И КоличествоЦБДляБлокировкиСУчетомПула(ДанныеДокумента) = 0 Тогда
		
		Результат.ВыполненУспешно = Истина;
		Результат.Статус = "С учетом поручений в пуле блокировка ЦБ не требуется";
		
	Иначе
		Результат.Статус = РезультатФормированияПорученияНаОткрытиеБлокировочногоРаздела(Поручение, ТипРазделаБлокировки);
		Если ЗначениеЗаполнено(Результат.Статус) Тогда
			Результат.ВыполненУспешно = Ложь;
		Иначе
			Результат.ВыполненУспешно = Истина;
			Результат.Статус = "Блокировочный раздел открыт";
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция РезультатФормированияПорученияНаОткрытиеБлокировочногоРаздела(Поручение, ТипРазделаБлокировки)
	
	ДокументОбъект = Документы.Поручение.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.ДатаИсполненияПоручения = ДокументОбъект.Дата + 1;
	ДокументОбъект.Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ДокументОбъект, "СА");
	ДокументОбъект.ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо;
	ДокументОбъект.ТипРазделаСчетаДЕПО = ТипРазделаБлокировки;
	ДокументОбъект.Инициатор = Константы.ОрганизацияПоУмолчанию.Получить();
	ДокументОбъект.ДокументОснование = Поручение;
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Поручение, "Депонент,СчетДепо");
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат "Не удалось провести поручение на открытие блокировочного раздела";
	КонецПопытки;
	Возврат "";
	
КонецФункции

Функция РезультатИсполненияЭтапаБлокировкаЦБ(ДанныеПоручения)
	
	Результат = Новый Структура("ВыполненУспешно,Статус", Ложь, "");
	
	КоличествоЦБДляБлокировкиСУчетомПула = КоличествоЦБДляБлокировкиСУчетомПула(ДанныеПоручения);
	
	Если ДанныеПоручения.ВидИсполненияDVP = Перечисления.ВидыИсполненийDVP.DVP3
		И КоличествоЦБДляБлокировкиСУчетомПула = 0 Тогда
		
		Результат.ВыполненУспешно = Истина;
		Результат.Статус = "С учетом поручений в пуле блокировка ЦБ не требуется";
		
		Возврат Результат;
		
	КонецЕсли;
	
	ДокументОбъект = Документы.Поручение.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.ДатаИсполненияПоручения = ДокументОбъект.Дата + 1;
	ДокументОбъект.ДатаИсполненияПорученияВДепозитарииМХ = ДокументОбъект.ДатаИсполненияПоручения;
	ДокументОбъект.ДатаИсполненияПорученияВМестеРасчетов = ДокументОбъект.ДатаИсполненияПоручения;
	ДокументОбъект.Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ДокументОбъект, "СД");
	ДокументОбъект.ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо;
	ДокументОбъект.Инициатор = Константы.ОрганизацияПоУмолчанию.Получить();
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ДанныеПоручения.Документ, "Депонент, СчетДепо, РазделСчетаДепо, МХДепонента, СчетДепоМХ,
		|РазделСчетаДепоМХ, ЦБ, КоличествоЦБ, ЦенаСделкиЦБ, СуммаСделки");
	
	Для Каждого Строка Из ДанныеПоручения.Документ.ЦенныеБумагиСписываемые Цикл
		НоваяСтрокаЦБ = ДокументОбъект.ЦенныеБумагиСписываемые.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаЦБ, Строка, , "ИдентификаторЗагрузки");
		Если ДанныеПоручения.РасчетыНаDMA Тогда
			НоваяСтрокаЦБ.Количество = ДанныеПоручения.Количество;
			НоваяСтрокаЦБ.Цена = 0;
			НоваяСтрокаЦБ.Сумма = ДанныеПоручения.Сумма;
		КонецЕсли;
		Если ЗначениеЗаполнено(КоличествоЦБДляБлокировкиСУчетомПула) Тогда
			НоваяСтрокаЦБ.Количество = КоличествоЦБДляБлокировкиСУчетомПула;
		КонецЕсли;
	КонецЦикла;
	
	ДокументОбъект.Контрагент = ДокументОбъект.Депонент;
	ДокументОбъект.СчетДепоКонтрагента = ДокументОбъект.СчетДепо;
	ДокументОбъект.РазделСчетаДепоКонтрагента = Справочники.РазделыСчетаДепо.РазделСчетаДепо(
		ДокументОбъект.СчетДепоКонтрагента, Перечисления.ТипыРазделовСчетовДЕПО.БлокированоРасчеты);
	ДокументОбъект.МХКонтрагент = ДокументОбъект.МХДепонента;
	ДокументОбъект.СчетДепоМХКонтрагента = ДокументОбъект.СчетДепоМХ;
	ДокументОбъект.РазделСчетаДепоМХКонтрагента = ДокументОбъект.РазделСчетаДепоМХ;
	ДокументОбъект.ДокументОснование = ДанныеПоручения.Документ;
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Результат.ВыполненУспешно = Истина;
		Результат.Статус = "ЦБ переведена на блокировочный раздел";
	Исключение
		Результат.Статус = "Не удалось провести поручение на перевод ЦБ на блокировочный раздел";
	КонецПопытки;
	Возврат Результат;
КонецФункции

Функция РезультатИсполненияЭтапаИсполнениеВНРД(ДанныеДокумента)
	Результат = Новый Структура("ВыполненУспешно, Статус");
	
	Документ = ДанныеДокумента.Документ;
	ДатаВвода = Константы.ДатаВводаЧастичногоИсполненияИнвентарныхПоручений.Получить();
	СтатусыИсполнения = Новый Массив;
	СтатусыИсполнения.Добавить(Перечисления.СтатусыПоручений.ИсполненоЧастично);
	СтатусыИсполнения.Добавить(Перечисления.СтатусыПоручений.Исполнено);
	
	Если Документ.РасчетыНаDMA И ЗначениеЗаполнено(ДатаВвода) И Документ.Дата >= ДатаВвода Тогда
		ДанныеИсполнения = Документы.ИсполнениеПоручения.ДанныеИсполненияПоручения(Документ);
		Результат.ВыполненУспешно = Документ.Проведен
			И СтатусыИсполнения.Найти(ДанныеИсполнения.Статус) <> Неопределено;
		ТипИсполнения = ?(ДанныеИсполнения.Статус = Перечисления.СтатусыПоручений.ИсполненоЧастично,
			"частично исполнено", "исполнено");
		Результат.Статус = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Поручение %1, отчет %2",
			ТипИсполнения, СокрЛП(ДанныеИсполнения.КодОтчетаВышестоящегоДепозитария));
	Иначе
		Результат.ВыполненУспешно = (Документ.Проведен И ЗначениеЗаполнено(Документ.ДатаИсполненияПоручения));
		Результат.Статус = "Поручение исполнено, отчет " + СокрЛП(Документ.КодОтчетаНРД);
	КонецЕсли;
	
	Если Не Результат.ВыполненУспешно Тогда
		Результат.Статус = "Поручение не исполнено";
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция РезультатИсполненияЭтапаОтправкаСтатусаВQUIK(ДанныеДокумента)
	
	Результат = Новый Структура("ВыполненУспешно, Статус");
	
	Если ВыполнениеПорученийВQUIK = Неопределено Тогда
		ИнициироватьСоединениеQUIK();
	КонецЕсли;
	
	ВыполнениеПорученийВQUIK.ДокументыКОбработке.Очистить();
	ВыполнениеПорученийВQUIK.ДокументыКОбработке.Добавить().Документ = ДанныеДокумента.Документ;
	Если ДанныеДокумента.ПоручениеОтменено Тогда
		ОшибкиПриОтправке = ВыполнениеПорученийВQUIK.ОтправитьЗапросыНаОтменуПоручений();
	Иначе
		ОшибкиПриОтправке = ВыполнениеПорученийВQUIK.РезультатПодписанияПоручений();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОшибкиПриОтправке) Тогда
		Результат.ВыполненУспешно = Ложь;
		Результат.Статус = ОписаниеСтатусаОтправкиВQUIK(Результат.ВыполненУспешно) + ". " + ОшибкиПриОтправке;
	Иначе
		Результат.ВыполненУспешно = Истина;
		Результат.Статус = ОписаниеСтатусаОтправкиВQUIK(Результат.ВыполненУспешно);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РезультатИсполненияЭтапаОжиданиеИсполненияВQUIK(ДанныеДокумента)
	
	Результат = Новый Структура("ВыполненУспешно, Статус");
	
	Если ВыполнениеПорученийВQUIK = Неопределено Тогда
		ИнициироватьСоединениеQUIK();
	КонецЕсли;
	
	ВыполнениеПорученийВQUIK.ДокументыКОбработке.Очистить();
	ВыполнениеПорученийВQUIK.ДокументыКОбработке.Добавить().Документ = ДанныеДокумента.Документ;
	РезультатИсполненияПоручений = ВыполнениеПорученийВQUIK.РезультатИсполненияПоручений();
	Результат.ВыполненУспешно = РезультатИсполненияПоручений.ВсеПорученияИсполнены;
	
	Если Результат.ВыполненУспешно Тогда
		Результат.Статус = "Исполнено в QUIK";
	ИначеЕсли ЗначениеЗаполнено(РезультатИсполненияПоручений.Описание) Тогда
		Результат.Статус = РезультатИсполненияПоручений.Описание;
	Иначе
		Результат.Статус = "Ожидает обработки в QUIK";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РезультатИсполненияЭтапаОжиданиеОтменыВQUIK(ДанныеДокумента)
	
	Результат = Новый Структура("ВыполненУспешно, Статус");
	
	Если ВыполнениеПорученийВQUIK = Неопределено Тогда
		ИнициироватьСоединениеQUIK();
	КонецЕсли;
	
	ВыполнениеПорученийВQUIK.ДокументыКОбработке.Очистить();
	ВыполнениеПорученийВQUIK.ДокументыКОбработке.Добавить().Документ = ДанныеДокумента.Документ;
	РезультатИсполненияПоручений = ВыполнениеПорученийВQUIK.РезультатОтменыПоручений();
	Результат.ВыполненУспешно = РезультатИсполненияПоручений.ВсеПорученияОтменены;
	
	Если Результат.ВыполненУспешно Тогда
		Результат.Статус = "Отменено в QUIK";
	ИначеЕсли ЗначениеЗаполнено(РезультатИсполненияПоручений.Описание) Тогда
		Результат.Статус = РезультатИсполненияПоручений.Описание;
	Иначе
		Результат.Статус = "Ожидает обработки в QUIK";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РезультатИсполненияЭтапаОтправкаВЭДО(Документ)
	
	ОтключитьЭтапОтправкиВЭДО =
		ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("83.ФормированиеСводныхОтчетовОСовершенныхОперациях", Ложь);
	Если ОтключитьЭтапОтправкиВЭДО Тогда
		Результат = Новый Структура("ВыполненУспешно, Статус",
			Истина,
			"Отправка в ЭДО производится через ""АРМ: Формирование и отправка отчетов о совершенных операциях""");
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура("ВыполненУспешно,Статус", Истина, "");
	ДатаВвода = Константы.ДатаВводаЧастичногоИсполненияИнвентарныхПоручений.Получить();
	
	Если Документ.РасчетыНаDMA И ЗначениеЗаполнено(ДатаВвода) И Документ.Дата >= ДатаВвода Тогда
		ДанныеИсполнения = Документы.ИсполнениеПоручения.ДанныеИсполненияПоручения(Документ);
		Выписка = ВыпискаПоручения(Документ, ДанныеИсполнения.Дата, ДанныеИсполнения.КоличествоОтчета);
		Если Не ЗначениеЗаполнено(Выписка) Тогда
			Результат.ВыполненУспешно = Ложь;
			Результат.Статус = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"Документ не помещен в ЭДО: у поручения нет выписки на %1 на количество %2",
				ДанныеИсполнения.Дата, ДанныеИсполнения.КоличествоОтчета);
			Возврат Результат;
		КонецЕсли;
		Выписки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Выписка);
	Иначе
		Выписки = ВыпискиПоручения(Документ);
		Если Не ЗначениеЗаполнено(Выписки) Тогда
			Результат.ВыполненУспешно = Ложь;
			Результат.Статус = "Документ не помещен в ЭДО: нет выписок у поручения";
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Выписка Из Выписки Цикл
		ОтправитьВыпискуВЭДО(Выписка, Результат);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Процедура ЗавершитьТекущийЭтапБезИсполнения(ДанныеПоручения, Комментарий)
	Если Не ЗначениеЗаполнено(ДанныеПоручения.ДатаОкончания) Тогда
		РегистрыСведений.ЭтапыОбработкиПоручений.ОбновитьЭтап(ДанныеПоручения.Документ,
		ДанныеПоручения.ТекущийЭтап, ТекущаяДатаСеанса(), ТекущаяДатаСеанса(), Комментарий);
	КонецЕсли;
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

Функция СтатусКвалифицированногоИнвестора(ЭтоКвалИнвестор)
	Возврат "Депонент " + ?(ЭтоКвалИнвестор, "", "не ") + "является квал.инвестором";
КонецФункции

Функция ОписаниеСтатусаОтправкиВQUIK(ОтправленУспешно)
	Возврат "Статус " + ?(ОтправленУспешно, "", "не ") + "отправлен в QUIK";
КонецФункции

Функция ВыпискиПоручения(Поручение)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Выписка.Ссылка КАК ДокументВыписка
	|ИЗ
	|	Документ.Выписка КАК Выписка
	|ГДЕ
	|	Выписка.ДокументОснование = &Поручение
	|	И НЕ Выписка.ПометкаУдаления");
	Запрос.УстановитьПараметр("Поручение", Поручение);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументВыписка");
КонецФункции

Функция ВыпискаПоручения(Поручение, ДатаИсполнения, КоличествоОтчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Выписка.Ссылка КАК Выписка
	|ИЗ
	|	Документ.Выписка КАК Выписка
	|ГДЕ
	|	Выписка.ДокументОснование = &Поручение
	|	И НЕ Выписка.ПометкаУдаления
	|	И ВЫРАЗИТЬ(Выписка.ОперацияЦБ КАК Документ.ОперацииЦБ).Дата = &ДатаИсполнения
	|	И ВЫРАЗИТЬ(Выписка.ОперацияЦБ КАК Документ.ОперацииЦБ).Количество = &КоличествоОтчета
	|	И ВЫРАЗИТЬ(Выписка.ОперацияЦБ КАК Документ.ОперацииЦБ).Проведен";
	Запрос.УстановитьПараметр("Поручение", Поручение);
	Запрос.УстановитьПараметр("ДатаИсполнения", ДатаИсполнения);
	Запрос.УстановитьПараметр("КоличествоОтчета", КоличествоОтчета);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Выписка;
		КонецЕсли;
	КонецЕсли;
	Возврат Документы.Выписка.ПустаяСсылка();
	
КонецФункции

Функция ЭтоПоручениеНаСписаниеНулевогоНеттоПоручения(Поручение)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НеттоПоручениеПоручения.Поручение КАК Поручение
	|ИЗ
	|	Документ.НеттоПоручение.Поручения КАК НеттоПоручениеПоручения
	|ГДЕ
	|	НеттоПоручениеПоручения.Ссылка.Количество = 0
	|	И (ВЫРАЗИТЬ(НеттоПоручениеПоручения.Поручение.ВидОперацииД КАК Справочник.ВидыОпераций)) = &Списание
	|	И НеттоПоручениеПоручения.Поручение = &Поручение";
	Запрос.УстановитьПараметр("Списание", Справочники.ВидыОпераций.СнятиеСДепонирования);
	Запрос.УстановитьПараметр("Поручение", Поручение);
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции

Функция ЕстьОперацияНаЗачислениеНулевогоНеттоПоручения(ПоручениеНаСписание)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОперацииЦБ.Ссылка КАК ОперацииЦБ
	|ИЗ
	|	Документ.ОперацииЦБ КАК ОперацииЦБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НеттоПоручение.Поручения КАК НеттоПоручениеПоручения
	|		ПО (НеттоПоручениеПоручения.Поручение = (ВЫРАЗИТЬ(ОперацииЦБ.ДокументОснование КАК Документ.Поручение)))
	|ГДЕ
	|	ОперацииЦБ.ВидОперацииД = &Зачисление
	|	И (ВЫРАЗИТЬ(ВЫРАЗИТЬ(ОперацииЦБ.ДокументОснование КАК Документ.Поручение).ВидОперацииД КАК Справочник.ВидыОпераций)) = &Зачисление
	|	И НеттоПоручениеПоручения.Ссылка В
	|			(ВЫБРАТЬ
	|				НеттоПоручениеПоручения.Ссылка КАК НеттоПоручение
	|			ИЗ
	|				Документ.НеттоПоручение.Поручения КАК НеттоПоручениеПоручения
	|			ГДЕ
	|				НеттоПоручениеПоручения.Поручение = &ПоручениеНаСписание)";
	Запрос.УстановитьПараметр("Зачисление", Справочники.ВидыОпераций.Депонирование);
	Запрос.УстановитьПараметр("ПоручениеНаСписание", ПоручениеНаСписание);
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции

Процедура ПроверитьЗаполнениеРеквизитов(ПроверяемыйОбъект, ПоляДляПроверки, Результат)
	Для Каждого ПолеДляПроверки Из ПоляДляПроверки Цикл
		Если Не ЗначениеЗаполнено(ПроверяемыйОбъект[ПолеДляПроверки.Значение]) Тогда
			Результат.ВыполненУспешно = Ложь;
			Результат.Статус = Результат.Статус
			+ ?(ЗначениеЗаполнено(Результат.Статус), ", ", "Не все реквизиты заполнены: ")
			+ ПолеДляПроверки.Представление;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОтправитьВыпискуВЭДО(Выписка, Результат)
	ДатаВыписки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выписка, "Дата");
	
	//проверка полной загрузки выгрузок по СПД для исключения дублей номеров в случае
	//появления выписки с более ранней датой
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Выписка.Дата, ДЕНЬ) КАК Дата,
	|	СУММА(ВЫБОР
	|			КОГДА РегистрацияДокументовВЭДО.Документ ЕСТЬ NULL
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеВыгружен
	|ИЗ
	|	Документ.Выписка КАК Выписка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияДокументовВЭДО
	|		ПО Выписка.Ссылка = РегистрацияДокументовВЭДО.Документ
	|ГДЕ
	|	Выписка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ТИПЗНАЧЕНИЯ(Выписка.ДокументОснование) = ТИП(Документ.иц_СводноеПоручение)
	|	И Выписка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Выписка.Дата, ДЕНЬ)
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА РегистрацияДокументовВЭДО.Документ ЕСТЬ NULL
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) > 0";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаВыписки));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаВыписки));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Результат.ВыполненУспешно = Ложь;
		Результат.Статус = Результат.Статус + "Не завершено помещение всех выписок по СПД в ЭДО за текущий день; ";
		Возврат;
	КонецЕсли;
	
	ДатаПоследнейВыгрузкиЭДО = РегистрыСведений.РегистрацияДокументовВЭДО.ПоследняяВыгруженнаяВыписка(ДатаВыписки);
	
	ВыпискаОбъект = Выписка.ПолучитьОбъект();
	ВыпискаОбъект.РучнойВвод = Ложь;
	ВыпискаОбъект.Дата = Мин(Макс(ДатаПоследнейВыгрузкиЭДО + 1, ДатаВыписки), КонецДня(ДатаВыписки));
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Попытка
		ВыпискаОбъект.ДополнительныеСвойства.Вставить("ИсключитьИзменениеВремениИсполнения",Истина);
		ВыпискаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОтменитьТранзакцию();
		Результат.ВыполненУспешно = Ложь;
		Результат.Статус = Результат.Статус + "Не удалось провести документ " + Строка(ВыпискаОбъект) + ": " + ОписаниеОшибки() + "; ";
		Возврат;
	КонецПопытки;
	
	Если РегистрыСведений.РегистрацияДокументовВЭДО.ДокументВыгруженВЭДО(Выписка) Тогда
		ОтменитьТранзакцию();
		Результат.Статус = Результат.Статус + "Документ уже был помещен в ЭДО ранее: " + Выписка + "; ";
	Иначе
		Отчет = Отчеты.ОтчетОВыполненнойОперации_Новый.Создать();
		Отчет.Основание					= Выписка;
		Отчет.ДатаВыписки				= ДатаВыписки;
		Отчет.ВыводитьФаксимилеВОтчетах	= Истина;
		Отчет.ПоместитьВЭДО				= Истина;
		Отчет.СформироватьОтчет(Новый ТабличныйДокумент);
		
		Если РегистрыСведений.РегистрацияДокументовВЭДО.ДокументВыгруженВЭДО(Выписка) Тогда
			ЗафиксироватьТранзакцию();
			Результат.Статус = Результат.Статус + "Документ помещен в ЭДО: " + Выписка + "; ";
		Иначе
			ОтменитьТранзакцию();
			Результат.ВыполненУспешно = Ложь;
			Результат.Статус = Результат.Статус + "Документ не помещен в ЭДО: " + Выписка + "; ";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция РезультатИсполненияЭтапаОтправкаСтатусаВПанда(ДанныеДокумента)
	
	Результат = Новый Структура("ВыполненУспешно, Статус");
	
	НазваниеСтатуса = ?(ДанныеДокумента.ПоручениеОтменено, "Снято", "Исполнено");
	СтатусПоручения = ОбработкаНеторговыхПорученийИзПандаВызовСервера.СтатусПоНаименованию(НазваниеСтатуса);
	Поручение = ДанныеДокумента.Документ;
	ОбработкаНеторговыхПорученийИзПандаВызовСервера.СоздатьСообщениеОбИзмененииСтатусаПорученияВПанда(Поручение, СтатусПоручения);
	
	Результат.ВыполненУспешно = Истина;
	Результат.Статус = "Статус отправлен в CRM Панда";
	
	Возврат Результат;
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
