#Область ОписаниеПеременных

Перем НужноОтправитьСообщениеВКабинетКлиента;	// Булево
Перем НужноСоздатьУведомлениеОПоявленииНовогоЗаявления;	// Булево

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = "";
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

// Процедура - При копировании
//
// Параметры:
//  ОбъектКопирования	 - ДокументОбъект.ИзменениеТарифногоПлана - Объект копирования
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Номер = "";
	Клиент = Неопределено;
	ДоговорКлиента = Неопределено;
	КоличествоЦБ = 0;
	Изменил = Справочники.Пользователи.ПустаяСсылка();
	Автор = Справочники.Пользователи.ПустаяСсылка();
	УведомитьОПриемеКлиента = Ложь;
	ЗаголовокСообщения = "";
	ТелоСообщения = "";
	ВходящийНомерСЭД = "";
	ДатаСозданияВКабинетеКлиента = Неопределено;
	
КонецПроцедуры

// Процедура - Перед записью
//
// Параметры:
//  Отказ			 - Булево - Признак записи документа
//  РежимЗаписи		 - РежимЗаписиДокумента - Текущий режим записи
//  РежимПроведения	 - РежимПроведенияДокумента - Текущий режим проведения
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КарточкаОферты) Тогда
		КарточкаОферты = Документы.КарточкаОферты.НайденнаяИлиНоваяКарточкаОферты(ЦеннаяБумага, ДатаОферты);
	КонецЕсли;
	
	Если Не ЭтоНовый() Тогда
		Изменил = ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	НужноОтправитьСообщениеВКабинетКлиента = УведомитьОПриемеКлиента И НЕ УведомлениеОтправлено();
	
	Если НужноОтправитьСообщениеВКабинетКлиента Тогда
		СформироватьТекстСообщенияВКабинетКлиента();
	КонецЕсли;
	
	НужноСоздатьУведомлениеОПоявленииНовогоЗаявления = ЭтоНовый();
	
	УстановитьНовыйНомер();		// Выполняется всегда перед записью, потому что даже если номер уже есть, но дата
								// изменилась - номер тоже должен поменяться
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НужноОтправитьСообщениеВКабинетКлиента Тогда
		ОтправитьСообщениеВКабинетКлиента(Отказ);
	КонецЕсли;
	
	Если НужноСоздатьУведомлениеОПоявленииНовогоЗаявления Тогда
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОПоявленииНовыхЗаявленийНаУчастиеВОферте;
		НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
		Если НастройкиОбмена = Неопределено Тогда
			ТекстОшибки = "Не заданы параметры внешнего источника """ + Строка(ВнешнийИсточник) + """";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			ИмяСобытия = "Уведомление о появлении нового заявления на участие в оферте не отправлено";
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		Иначе
			Документы.ЗаявлениеНаУчастиеВОферте.ОтправитьУведомлениеОПоявленииНовогоЗаявленияНаУчастиеВОферте(Ссылка, НастройкиОбмена);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция УведомлениеОтправлено()
	Если ЭтоНовый() Тогда
		Отправлено = Ложь;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Поле
		|ИЗ
		|	РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК УведомленияОтправленныеЧерезЛичныйКабинет
		|ГДЕ
		|	УведомленияОтправленныеЧерезЛичныйКабинет.КД = &Заявление";
		Запрос.УстановитьПараметр("Заявление", Ссылка);
		Отправлено = Не Запрос.Выполнить().Пустой();
	КонецЕсли;
	
	Возврат Отправлено;
КонецФункции

Процедура СформироватьТекстСообщенияВКабинетКлиента()
	ЗаголовокСообщения = "Принято заявление на участие в оферте";
	ШаблонСообщения = "Заявление на участие в оферте Эмитент %1, ISIN %2 дата выкупа %3 принято";
	ЭмитентСтрокой = Строка(ЦеннаяБумага.Эмитент);
	ISIN = Строка(ЦеннаяБумага.ISIN);
	ДатаСтрокой = Формат(ДатаОферты, "ДФ=""дд.ММ.гггг""");
	ТелоСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ЭмитентСтрокой, ISIN, ДатаСтрокой);
КонецПроцедуры

Процедура ОтправитьСообщениеВКабинетКлиента(Отказ)
	ОбработкаВебСервисы = Неопределено;
	Если ТестированиеVanessa.ЭтоТест() Тогда
		ОбработкаВебСервисы = Обработки.TEST_ВебСервисы.Создать();
	КонецЕсли;
	
	ClientId = Справочники.Контрагенты.ClientId(Клиент);
	Если ClientId <> Неопределено Тогда
		ИдентификаторыКлиентов = Новый Массив;
		ИдентификаторыКлиентов.Добавить(ClientId);
		Идентификатор = Строка(Ссылка.УникальныйИдентификатор());
		ОпубликованоУспешно = ВебСервисыСервер.РезультатОтправкиУведомленияИнформационного(ИдентификаторыКлиентов,
				ЗаголовокСообщения, ТелоСообщения, Идентификатор, ОбработкаВебСервисы);
		Если Не ОпубликованоУспешно Тогда
			Причина = "- подробности в журнале регистрации (обратитесь на поддержку).";
			Если ЗначениеЗаполнено(ДоговорКлиента.ДатаОкончанияДействия) И ДоговорКлиента.ДатаОкончанияДействия < ТекущаяДатаСеанса() Тогда
				Причина = Причина + " Возможно причина в том, что договор клиента закрыт.";
			КонецЕсли;
		КонецЕсли;
	Иначе
		Причина = "по той причине, что не найден ClientId (код загрузки клиента).";
		ОпубликованоУспешно = Ложь;
	КонецЕсли;
	
	Если Не ОпубликованоУспешно Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось отправить уведомление в кабинет клиента " + Причина);
	Иначе
		Запись = РегистрыСведений.УведомленияОтправленныеЧерезЛичныйКабинет.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДатаСеанса();
		Запись.КД = Ссылка;
		Запись.Клиент = Клиент;
		Запись.Договор = ДоговорКлиента;
		Запись.СчетДепо = ДоговорКлиента.СчетДепо;
		Запись.ЦеннаяБумага = ЦеннаяБумага;
		Запись.Количество = КоличествоЦБ;
		Запись.СтатусДоставкиУведомления = Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ВыгруженИз1С;
		Запись.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти