#Область ОбработчикиСобытий

Функция GetMetrics(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	ОписаниеВызова = ВнешнийПрограммныйИнтерфейс.ЗафиксироватьНачало("httpСервисы.prometheus.metricsget", Запрос);
	ТелоЗапроса = "";
	
	Попытка
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
		МетрикиСтрокой = МетрикиСервер.МетрикиПоЗапросу();
		
		Если Не ЗначениеЗаполнено(МетрикиСтрокой) Тогда
			ВнешнийПрограммныйИнтерфейс.ЗафиксироватьОкончание(ОписаниеВызова, ТелоЗапроса);
			Возврат Новый HTTPСервисОтвет(204);
		КонецЕсли;
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(МетрикиСтрокой, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
		ВнешнийПрограммныйИнтерфейс.ЗафиксироватьОкончание(ОписаниеВызова, ТелоЗапроса);
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Ответ = ВнешнийПрограммныйИнтерфейс.httpОтветВнутренняяОшибкаСервера(ОписаниеОшибки);
		ВнешнийПрограммныйИнтерфейс.ЗафиксироватьОшибку(ОписаниеВызова, ОписаниеОшибки, ТелоЗапроса);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти