
&НаКлиенте
Процедура ВыборПериода(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		НастройкаПериода = Новый НастройкаПериода;
		НастройкаПериода.УстановитьПериод(Объект.ПериодНачало, ?(Объект.ПериодНачало='0001-01-01', Объект.ПериодКонец, НачалоДня(Объект.ПериодНачало)));
		НастройкаПериода.РедактироватьКакИнтервал	= Истина;
		НастройкаПериода.РедактироватьКакПериод		= Истина;
		НастройкаПериода.ВариантНастройки			= ВариантНастройкиПериода.Период;
		НастройкаПериода.ВариантПериода				= ВариантПериода.Год;
		Если НастройкаПериода.Редактировать() Тогда
			Объект.ПериодНачало	= НастройкаПериода.ПолучитьДатуНачала();
			Объект.ПериодКонец	= НастройкаПериода.ПолучитьДатуОкончания();
		КонецЕсли;
	#Иначе
		Диалог	= Новый ДиалогРедактированияСтандартногоПериода();		
		Диалог.Период.ДатаНачала	= Объект.ПериодНачало;
		Диалог.Период.ДатаОкончания	= ?(Объект.ПериодНачало=Дата('0001-01-01'), Объект.ПериодКонец, НачалоДня(Объект.ПериодНачало));
		Диалог.Период.Вариант		= ВариантСтандартногоПериода.ПроизвольныйПериод;
		
		Если Диалог.Редактировать() Тогда
			Объект.ПериодНачало	= НачалоДня(Диалог.Период.ДатаНачала);
			Объект.ПериодКонец	= КонецДня(Диалог.Период.ДатаОкончания);
		КонецЕсли;		
	#КонецЕсли
	


КонецПроцедуры

&НаКлиенте
Процедура ОтобратьЦенныеБумаги(Команда)
	Если Объект.ПериодКонец >= Объект.ПериодНачало 
		И ЗначениеЗаполнено(Объект.ПериодНачало)
	Тогда
		ОтобратьЦенныеБумагиНаСервере();
	Иначе
		Предупреждение("Неверно указан диапазон дат для обработки!");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОтобратьЦенныеБумагиНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ОтобратьЦенныеБумаги(Операция = 0, Операция = 1);
	ЗначениеВРеквизитФормы(Обработка, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Строка Из Объект.ЦенныеБумаги Цикл
		Строка.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Строка Из Объект.ЦенныеБумаги Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоручения(Команда)
	Если Объект.ЦенныеБумаги.Количество() Тогда
		СоздатьПорученияНаСервере();
	Иначе
		Предупреждение("Нет данных для обработки! Попробуйте отобрать цнные бумаги ещё раз."); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьПорученияНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.СоздатьПоручения(Операция = 0, Операция = 1);
КонецПроцедуры

&НаКлиенте
Процедура ОперацияПриИзменении(Элемент)
	
	Объект.ЦенныеБумаги.Очистить();
	Элементы.ЦенныеБумагиКоличествоПриход.Видимость = Не Операция;
	Элементы.ЦенныеБумагиКоличествоРасход.Видимость = Не Операция;
	Элементы.ЦенныеБумагиКодЗагрузки.Видимость = Операция;
	Если Объект.ПериодКонец >= Объект.ПериодНачало 
		И ЗначениеЗаполнено(Объект.ПериодНачало)
	Тогда
		ОтобратьЦенныеБумагиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКонтроль(Команда)
	
	Если Объект.ПериодКонец >= Объект.ПериодНачало 
		И ЗначениеЗаполнено(Объект.ПериодНачало) Тогда
		ОткрытьФорму("Обработка.ОбработкаОперацийПоОбслуживаниюЦБ.Форма.ФормаКонтроля", Новый Структура("Данные", Объект));
		
	Иначе
		Предупреждение("Неверно указан диапазон дат для обработки!");
	КонецЕсли;
	
КонецПроцедуры


