
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ОшибкаОтправкиПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
	Элементы.ОписаниеОшибки.Видимость = Запись.ОшибкаОбработки;	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьJSON(Команда)
	ПараметрыОткрытия = Новый Структура("СтрокаJSON", Запись.Сообщение);
	ОткрытьФорму("Обработка.ПросмотрJSON.Форма.Форма",
		ПараметрыОткрытия, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
