
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	СтандартнаяОбработка = Ложь;
	Если РучнойВвод Тогда
		Возврат;
	КонецЕсли;
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс, ПометкаУдаления);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверки реквизитов
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если НЕ ЗначениеЗаполнено(СчетДепо) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не выбран 'Счет депо'", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
	Если ЭтоНовый() Тогда
		Если НЕ ЗначениеЗаполнено(Автор) Тогда
			Автор = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		Изменил	= Справочники.Пользователи.ПустаяСсылка();
	Иначе
		Изменил	= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание, СтандартнаяОбработка)
	Если Основание = Неопределено Тогда
		ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), , );
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение")
		И ТипЗнч(Основание.ВидОперацииД) = Тип("ПеречислениеСсылка.ВидыОтчетов") Тогда
		Дата				= ОбщегоНазначения.ДатаДокумента(Основание);
		Автор				= ПараметрыСеанса.ТекущийПользователь;
		ВидОтчета			= Основание.ВидОперацииД;
		Депонент			= Основание.СчетДепо.Владелец;
		ДокументОснование	= Основание.Ссылка;
		Инициатор			= Основание.Инициатор;
		Комментарий			= Основание.Комментарий;
		СчетДепо			= Основание.СчетДепо;
		Если Основание.ВидОперацииД = Перечисления.ВидыОтчетов.ОтчетОбОперацияхПоСчетуДЕПО Тогда
			ЦеннаяБумага = Основание.ЦБУведомление;
		Иначе
			ЦеннаяБумага = Основание.ЦБВыписка;
		КонецЕсли;
	Иначе
		ДокументОснование = Документы.Поручение.ПустаяСсылка();
		ОбщегоНазначения.СообщитьОбОшибке("На основании данного документа нельзя создать '"
			+ Метаданные.Документы.ФормированиеОтчетаВыписки.Синоним + "'.
			|Основание должно быть порученим с одним из видов отчетов.");
	КонецЕсли;
КонецПроцедуры
