
Функция зфПроверкаЗащиты() Экспорт
	Возврат Истина;
КонецФункции

Функция РасчетСуммыУслуги(ДатаДок, СуммаВВалюте, Валюта) Экспорт
	Перем СтруктураСуммы;
	Перем СуммаВсего;
	Перем СуммаНДС;
	Перем Сумма;
	Перем ДанныеВалюты;
	Перем СтавкаНДС;
	Если НЕ зфПроверкаЗащиты() Тогда
		Возврат Неопределено;
	КонецЕсли;
	СтруктураСуммы = Новый Структура("СуммаВсего,СуммаНДС,Сумма,СтавкаНДС");
	СуммаВсего = 0;
	СуммаНДС = 0;
	Сумма = 0;
	ДанныеВалюты = ОбщегоНазначения.ПолучитьКурсВалюты(Валюта,ДатаДок);
	СуммаВсего = СуммаВВалюте * ДанныеВалюты.Курс / ?(ДанныеВалюты.Кратность = 0, 1, ДанныеВалюты.Кратность);
	СтавкаНДС = Константы.ОсновнаяСтавкаНДС.Получить();
	Если (СтавкаНДС = Перечисления.СтавкиНДС.БезНДС ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС0) Тогда
		СуммаНДС = 0;
		Сумма = СуммаВсего;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		СуммаНДС = СуммаВсего / 118 * 18;
		Сумма = СуммаВсего - СуммаНДС;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		СуммаНДС = СуммаВсего / 118 * 18;
		Сумма = СуммаВсего;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		СуммаНДС = СуммаВсего / 110 * 10;
		Сумма = СуммаВсего - СуммаНДС;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		СуммаНДС = СуммаВсего / 110 * 10;
		Сумма = СуммаВсего;
	КонецЕсли;
	СтруктураСуммы.Вставить("СуммаВсего",СуммаВсего);
	СтруктураСуммы.Вставить("СуммаНДС",СуммаНДС);
	СтруктураСуммы.Вставить("Сумма",Сумма);
	СтруктураСуммы.Вставить("СтавкаНДС",СтавкаНДС);
	Возврат СтруктураСуммы;
КонецФункции

Процедура СоздатьДвиженияДокумента(ДатаДок, Движения, Инициатор, УслугаОткрытияСчета, Тариф, СуммаСделки=0, МестоХранения="", РасчетОборот=Ложь) Экспорт
	
	Перем Движение;
	Перем СтруктураСуммы;
	
	Если НЕ зфПроверкаЗащиты() Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.УслугиДепозитария.Добавить();
	Движение.Период = ДатаДок;
	Движение.Инициатор = Инициатор;
	Движение.МестоХранения = МестоХранения;
	Движение.Услуга = УслугаОткрытияСчета;
	
	Если Тариф.ТипТарифа = Перечисления.ТипыТарифов.ФиксированнаяСумма Тогда
	
		Движение.СуммаВВалюте = Тариф.Тариф;
		
	ИначеЕсли Тариф.ТипТарифа = Перечисления.ТипыТарифов.ПроцентОтНачисления Тогда
		
		Движение.СуммаВВалюте = СуммаСделки * Тариф.Тариф;
		
	ИначеЕсли РасчетОборот Тогда
		Движение.СуммаВВалюте = Тариф.Тариф;
	Иначе
		Движение.СуммаВВалюте = 0;
	КонецЕсли;
	
	СтруктураСуммы = РасчетСуммыУслуги(ДатаДок,Движение.СуммаВВалюте,Движение.Валюта);
	Движение.СуммаВсего = СтруктураСуммы.СуммаВсего;
	Движение.СуммаНДС = СтруктураСуммы.СуммаНДС;
	Движение.Сумма = СтруктураСуммы.Сумма;
	Движение.ТипТарифа = Тариф.ТипТарифа;
	Движение.Тариф = Тариф.Тариф;
	Движение.СтавкаНДС = СтруктураСуммы.СтавкаНДС;
	
КонецПроцедуры

Функция ФормированиеРезультатаПоЦБ(РезультатСверки) Экспорт
	Перем ДеревоЗначенийЦБ;
	Перем ЦБ_БО;
	Перем ЦБ_Д;
	Перем СтрокаТЗ;
	Перем СтрокаЦБ;
	Перем СтрокаКлиент;
	Если НЕ зфПроверкаЗащиты() Тогда
		Возврат Неопределено;
	КонецЕсли;
	ДеревоЗначенийЦБ = Новый ДеревоЗначений();
	ДеревоЗначенийЦБ.Колонки.Добавить("ЦБНаименование_БО");
	ДеревоЗначенийЦБ.Колонки.Добавить("КлиентНаименование_БО");
	ДеревоЗначенийЦБ.Колонки.Добавить("Количество_БО");
	ДеревоЗначенийЦБ.Колонки.Добавить("РАСХ");
	ДеревоЗначенийЦБ.Колонки.Добавить("ЦБНаименование_Д");
	ДеревоЗначенийЦБ.Колонки.Добавить("КлиентНаименование_Д");
	ДеревоЗначенийЦБ.Колонки.Добавить("Количество_Д");
	ЦБ_БО = "";
	ЦБ_Д = "";
	Для каждого СтрокаТЗ Из РезультатСверки Цикл
		Если (ЦБ_БО <> СтрокаТЗ.ЦБНаименование_БО ИЛИ ЦБ_Д <> СтрокаТЗ.ЦБНаименование_Д) Тогда
			СтрокаЦБ = ДеревоЗначенийЦБ.Строки.Добавить();
			СтрокаЦБ.ЦБНаименование_БО = СтрокаТЗ.ЦБНаименование_БО;
			СтрокаЦБ.ЦБНаименование_Д = СтрокаТЗ.ЦБНаименование_Д;
			СтрокаКлиент = СтрокаЦБ.Строки.Добавить();
			СтрокаКлиент.ЦБНаименование_БО = СтрокаТЗ.ЦБНаименование_БО;
			СтрокаКлиент.КлиентНаименование_БО = СтрокаТЗ.КлиентНаименование_БО;
			СтрокаКлиент.Количество_БО = СтрокаТЗ.Количество_БО;
			СтрокаКлиент.ЦБНаименование_Д = СтрокаТЗ.ЦБНаименование_Д;
			СтрокаКлиент.КлиентНаименование_Д = СтрокаТЗ.КлиентНаименование_Д;
			СтрокаКлиент.Количество_Д = СтрокаТЗ.Количество_Д;
			СтрокаКлиент.РАСХ = ?(СтрокаТЗ.Количество_БО - СтрокаТЗ.Количество_Д >= 0, СтрокаТЗ.Количество_БО - СтрокаТЗ.Количество_Д, (СтрокаТЗ.Количество_БО - СтрокаТЗ.Количество_Д) * (-1));
			ЦБ_БО = СтрокаТЗ.ЦБНаименование_БО;
			ЦБ_Д = СтрокаТЗ.ЦБНаименование_Д;
		Иначе
			СтрокаКлиент = СтрокаЦБ.Строки.Добавить();
			СтрокаКлиент.ЦБНаименование_БО = СтрокаТЗ.ЦБНаименование_БО;
			СтрокаКлиент.КлиентНаименование_БО = СтрокаТЗ.КлиентНаименование_БО;
			СтрокаКлиент.Количество_БО = СтрокаТЗ.Количество_БО;
			СтрокаКлиент.ЦБНаименование_Д = СтрокаТЗ.ЦБНаименование_Д;
			СтрокаКлиент.КлиентНаименование_Д = СтрокаТЗ.КлиентНаименование_Д;
			СтрокаКлиент.Количество_Д = СтрокаТЗ.Количество_Д;
			СтрокаКлиент.РАСХ = ?(СтрокаТЗ.Количество_БО - СтрокаТЗ.Количество_Д >= 0, СтрокаТЗ.Количество_БО - СтрокаТЗ.Количество_Д, (СтрокаТЗ.Количество_БО - СтрокаТЗ.Количество_Д) * (-1));
			ЦБ_БО = СтрокаТЗ.ЦБНаименование_БО;
			ЦБ_Д = СтрокаТЗ.ЦБНаименование_Д;
		КонецЕсли;
	КонецЦикла;
	Возврат ДеревоЗначенийЦБ;
КонецФункции

Функция ФормированиеРезультатаПоКлиентам(РезультатСверки) Экспорт
	Перем ДеревоЗначенийКлиент;
	Перем Клиент_БО;
	Перем Клиент_Д;
	Перем СтрокаТЗ;
	Перем СтрокаКлиент;
	Перем СтрокаЦБ;
	Если НЕ зфПроверкаЗащиты() Тогда
		Возврат Неопределено;
	КонецЕсли;
	ДеревоЗначенийКлиент = Новый ДеревоЗначений();
	ДеревоЗначенийКлиент.Колонки.Добавить("ЦБНаименование_БО");
	ДеревоЗначенийКлиент.Колонки.Добавить("КлиентНаименование_БО");
	ДеревоЗначенийКлиент.Колонки.Добавить("Количество_БО");
	ДеревоЗначенийКлиент.Колонки.Добавить("РАСХ");
	ДеревоЗначенийКлиент.Колонки.Добавить("ЦБНаименование_Д");
	ДеревоЗначенийКлиент.Колонки.Добавить("КлиентНаименование_Д");
	ДеревоЗначенийКлиент.Колонки.Добавить("Количество_Д");
	РезультатСверки.Сортировать("КлиентНаименование_БО Убыв,ЦБНаименование_Д Убыв");
	Клиент_БО = "";
	Клиент_Д = "";
	Для каждого СтрокаТЗ Из РезультатСверки Цикл
		Если (Клиент_БО <> СтрокаТЗ.КлиентНаименование_БО ИЛИ Клиент_Д <> СтрокаТЗ.ЦБНаименование_Д) Тогда
			СтрокаКлиент = ДеревоЗначенийКлиент.Строки.Добавить();
			СтрокаКлиент.КлиентНаименование_БО = СтрокаТЗ.КлиентНаименование_БО;
			СтрокаКлиент.КлиентНаименование_Д = СтрокаТЗ.КлиентНаименование_Д;
			СтрокаЦБ = СтрокаКлиент.Строки.Добавить();
			СтрокаЦБ.ЦБНаименование_БО = СтрокаТЗ.ЦБНаименование_БО;
			СтрокаЦБ.КлиентНаименование_БО = СтрокаТЗ.КлиентНаименование_БО;
			СтрокаЦБ.Количество_БО = СтрокаТЗ.Количество_БО;
			СтрокаЦБ.ЦБНаименование_Д = СтрокаТЗ.ЦБНаименование_Д;
			СтрокаЦБ.КлиентНаименование_Д = СтрокаТЗ.КлиентНаименование_Д;
			СтрокаЦБ.Количество_Д = СтрокаТЗ.Количество_Д;
			СтрокаЦБ.РАСХ = ?(СтрокаТЗ.Количество_БО - СтрокаТЗ.Количество_Д >= 0, СтрокаТЗ.Количество_БО - СтрокаТЗ.Количество_Д, (СтрокаТЗ.Количество_БО - СтрокаТЗ.Количество_Д) * (-1));
			Клиент_БО = СтрокаТЗ.КлиентНаименование_БО;
			Клиент_Д = СтрокаТЗ.КлиентНаименование_Д;
		Иначе
			СтрокаЦБ = СтрокаКлиент.Строки.Добавить();
			СтрокаЦБ.ЦБНаименование_БО = СтрокаТЗ.ЦБНаименование_БО;
			СтрокаЦБ.КлиентНаименование_БО = СтрокаТЗ.КлиентНаименование_БО;
			СтрокаЦБ.Количество_БО = СтрокаТЗ.Количество_БО;
			СтрокаЦБ.ЦБНаименование_Д = СтрокаТЗ.ЦБНаименование_Д;
			СтрокаЦБ.КлиентНаименование_Д = СтрокаТЗ.КлиентНаименование_Д;
			СтрокаЦБ.Количество_Д = СтрокаТЗ.Количество_Д;
			СтрокаЦБ.РАСХ = ?(СтрокаТЗ.Количество_БО - СтрокаТЗ.Количество_Д >= 0, СтрокаТЗ.Количество_БО - СтрокаТЗ.Количество_Д, (СтрокаТЗ.Количество_БО - СтрокаТЗ.Количество_Д) * (-1));
			Клиент_БО = СтрокаТЗ.КлиентНаименование_БО;
			Клиент_Д = СтрокаТЗ.КлиентНаименование_Д;
		КонецЕсли;
	КонецЦикла;
	Возврат ДеревоЗначенийКлиент;
КонецФункции

Процедура ПриУстановкеНовогоНомераДокументовПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Источник.Номер = НумераторыОбъектов.ПолучитьНомерДокументаВРазрезеДня(Источник.Ссылка, Формат(Источник.Дата, "ДФ=yyMMdd-"), Источник.Дата);
	
КонецПроцедуры
