
Процедура УдалитьЗаписиЗаПериод(НачалоПериода, КонецПериода) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЖурналОпераций.Период
	|ИЗ
	|	РегистрСведений.ЖурналОпераций КАК ЖурналОпераций
	|ГДЕ
	|	ЖурналОпераций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналОпераций.Период");
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ЖурналОпераций.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры
