#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначения.ПриСозданииНаСервере(ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(Элементы.Список, Параметры, "РежимВыбора");
	УстановитьУсловноеОформление();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИзДепозитария(Команда)
	ОткрытьФорму("Обработка.ЗагрузкаКДИзДепозитария.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОтправленныеУведомления(Команда)
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		Отбор = Новый Структура("КД", Элементы.Список.ТекущаяСтрока);
		Парам = Новый Структура("Отбор", Отбор);
		ОткрытьФорму("РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет.ФормаСписка", Парам);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СброситьФильтры(Команда)
	Выкуп 		= Ложь;
	Собрание 	= Ложь;
	Создано 	= Ложь;
	Просмотрено = Ложь;
	ОтправленоУведомление 		= Ложь;
	ТребуетсяУточнение 			= Ложь;
	ТребуетсяРаскрытиеСписка 	= Ложь;
	ОжидаетОтправкуУведомления 	= Ложь;
	ИзменитьФильтрПоСостоянию();
	ИзменитьФильтрПоСтатусу();
	ИзменитьФильтрПоВидуКД();
КонецПроцедуры

&НаКлиенте
Процедура УведомленияКлиентам(Команда)
	ЗначениеОтбора = Новый Структура("ДокументОснование", Элементы.Список.ТекущаяСтрока);
	ПараметрыОтбора = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("Документ.УведомлениеКлиентам.ФормаСписка", ПараметрыОтбора);
КонецПроцедуры

&НаКлиенте
Процедура Этапы(Команда)
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		Отбор = Новый Структура("КД", Элементы.Список.ТекущаяСтрока);
		Парам = Новый Структура("Отбор", Отбор);
		ОткрытьФорму("РегистрСведений.ЭтапыКД.ФормаСписка", Парам);
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТребуетсяУточнениеПриИзменении(Элемент)
	ИзменитьФильтрПоСостоянию();
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяРаскрытиеСпискаПриИзменении(Элемент)
	ИзменитьФильтрПоСостоянию();
КонецПроцедуры

&НаКлиенте
Процедура ОжидаетОтправкуУведомленияПриИзменении(Элемент)
	ИзменитьФильтрПоСостоянию();
КонецПроцедуры

&НаКлиенте
Процедура СозданоПриИзменении(Элемент)
	ИзменитьФильтрПоСтатусу();
КонецПроцедуры

&НаКлиенте
Процедура ПросмотреноПриИзменении(Элемент)
	ИзменитьФильтрПоСтатусу();
КонецПроцедуры

&НаКлиенте
Процедура ОтправленоУведомлениеПриИзменении(Элемент)
	ИзменитьФильтрПоСтатусу();
КонецПроцедуры

&НаКлиенте
Процедура ВыкупПриИзменении(Элемент)
	ИзменитьФильтрПоВидуКД();
КонецПроцедуры

&НаКлиенте
Процедура СобраниеПриИзменении(Элемент)
	ИзменитьФильтрПоВидуКД();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ЭлементОтбораДляФильтра(ПолеОтбора)
	НайденныйЭлементОтбора = Неопределено;
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеОтбора И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
			НайденныйЭлементОтбора = ЭлементОтбора;
		КонецЕсли;
	КонецЦикла;
	Если НайденныйЭлементОтбора = Неопределено Тогда
		НайденныйЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		НайденныйЭлементОтбора.ЛевоеЗначение = ПолеОтбора; 
		НайденныйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	КонецЕсли;
	Возврат НайденныйЭлементОтбора;
КонецФункции

&НаКлиенте
Процедура ИзменитьФильтрПоСостоянию()
		
	СписокСостояний = Новый СписокЗначений;
	Если ТребуетсяУточнение Тогда
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКорпоративныхДействий.ТребуетсяУточнение"));
	КонецЕсли;
	Если ТребуетсяРаскрытиеСписка Тогда
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКорпоративныхДействий.ТребуетсяРаскрытиеСписка"));
	КонецЕсли;
	Если ОжидаетОтправкуУведомления Тогда
		СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКорпоративныхДействий.ОжидаетОтправкуУведомления"));
	КонецЕсли;
	
	НайденныйЭлементОтбора = ЭлементОтбораДляФильтра(Новый ПолеКомпоновкиДанных("Состояние"));
	НайденныйЭлементОтбора.Использование = СписокСостояний.Количество() > 0; 
	НайденныйЭлементОтбора.ПравоеЗначение = СписокСостояний; 

КонецПроцедуры
  
&НаКлиенте
Процедура ИзменитьФильтрПоВидуКД()
	
	СписокВидовКД = Новый СписокЗначений;
	Если Выкуп Тогда
		ДобавитьВидыКДПоВыкупу(СписокВидовКД);
	КонецЕсли;
	Если Собрание Тогда
		ДобавитьВидыКДПоСобранию(СписокВидовКД);
	КонецЕсли;
	НайденныйЭлементОтбора = ЭлементОтбораДляФильтра(Новый ПолеКомпоновкиДанных("ВидКД"));
	НайденныйЭлементОтбора.Использование = СписокВидовКД.Количество() > 0; 
	НайденныйЭлементОтбора.ПравоеЗначение = СписокВидовКД; 

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФильтрПоСтатусу()

	СписокСтатусов = Новый СписокЗначений;
	Если Создано Тогда
		СписокСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКД.Создано"));
	КонецЕсли;
	Если Просмотрено Тогда
		СписокСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКД.Просмотрено"));
	КонецЕсли;
	Если ОтправленоУведомление Тогда
		СписокСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКД.ОтправленоУведомление"));
	КонецЕсли;
	
	НайденныйЭлементОтбора = ЭлементОтбораДляФильтра(Новый ПолеКомпоновкиДанных("Статус"));
	НайденныйЭлементОтбора.Использование = СписокСтатусов.Количество() > 0; 
	НайденныйЭлементОтбора.ПравоеЗначение = СписокСтатусов; 

КонецПроцедуры

&НаСервере
Процедура ДобавитьВидыКДПоВыкупу(СписокВидовКД)
	СписокВидовКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("BIDS"));
	СписокВидовКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("TEND"));
КонецПроцедуры

&НаСервере
Процедура ДобавитьВидыКДПоСобранию(СписокВидовКД)
	СписокВидовКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("XMET"));
	СписокВидовКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("MEET"));
	СписокВидовКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("BMET"));
	СписокВидовКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("OMET"));
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	ОбщегоНазначения.СписокПередЗагрузкойПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	Список.УсловноеОформление.Элементы.Очистить();
	ЭлементУсловногоОформления = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловия = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДополнительнаяИнформация");
	ЭлементУсловия.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение 	= "Экономически значимая организация";
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 0, 0));
	ЭлементУсловногоОформления.Использование = Истина;
КонецПроцедуры

#КонецОбласти
