
#Область ОсновныеПроцедурыИФункции

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");   
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();

	ПараметрыРегистрации.Наименование = НСтр("ru = 'Загрузка депозитов из внешних источников'");
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Версия = "1.18";
	ПараметрыРегистрации.Информация = НСтр("ru = 'Загрузка депозитов из внешних источников'");
	
	ПараметрыРегистрации.Разрешения.Добавить(РаботаВБезопасномРежиме.РазрешениеНаСозданиеCOMКласса("v83.COMConnector", "181E893D-73A4-4722-B61D-D604B3D67D47"));	
	ПараметрыРегистрации.Разрешения.Добавить(РаботаВБезопасномРежиме.РазрешениеНаСозданиеCOMКласса("ADODB.Connection", "181E893D-73A4-4722-B61D-D604B3D67D48"));
	ПараметрыРегистрации.Разрешения.Добавить(РаботаВБезопасномРежиме.РазрешениеНаСозданиеCOMКласса("ADODB.Command", "181E893D-73A4-4722-B61D-D604B3D67D49"));
	
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеКаталогаВременныхФайлов(Истина, Истина);
	ПараметрыРегистрации.Разрешения.Добавить(Разрешение);
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Идентификатор = "ФоновоеВыполнение";
	Команда.Представление = "Загрузка депозитов из внешних источников (фон.)";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Идентификатор = "ОткрытиеФормыОбработки";
	Команда.Представление = "Загрузка депозитов из внешних источников";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
		
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	// Создадим пустую таблицу команд и колонки в ней
	Команды = Новый ТаблицаЗначений;
	
	// Как будет выглядеть описание печатной формы для пользователя
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
	
	// Имя нашего макета, что бы могли отличить вызванную команду в обработке печати
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	
	// Тут задается, как должна вызваться команда обработки
	// Возможные варианты:
	// - ОткрытиеФормы - в этом случае в колонке идентификатор должно быть указано имя формы, которое должна будет открыть система
	// - ВызовКлиентскогоМетода - вызвать клиентскую экспортную процедуру из модуля формы обработки
	// - ВызовСерверногоМетода - вызвать серверную экспортную процедуру из модуля объекта обработки
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	
	// Следующий параметр указывает, необходимо ли показывать оповещение при начале и завершению работы обработки. Не имеет смысла при открытии формы
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	
	// Для печатной формы должен содержать строку ПечатьMXL 
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	// Добавляем команду в таблицу команд по переданному описанию.
	// Параметры и их значения можно посмотреть в функции ПолучитьТаблицуКоманд
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	Если ИдентификаторКоманды = "ФоновоеВыполнение" Тогда 
		
		// Настройки
		ДополнительнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ЭтотОбъект.Метаданные().Имя);
		Настройки = ДополнительнаяОбработка.ХранилищеНастроек.Получить();
		Если ТипЗнч(Настройки) = Тип("Структура") Тогда
			УстановитьПользовательскиеНастройки(Настройки);
		КонецЕсли;
		
		// фоновое задание
		РассылкаГотова = Ложь;
		ДатаЗапроса = ТекущаяДата();
		
		Лог_Заполнение = Неопределено;
		ЗаполнитьДепозиты(Лог_Заполнение);
		
		Лог = Неопределено;
		ОбновитьФактическуюПозицию(Лог);
		
		ЛогОбновления = новый ТекстовыйДокумент;
		
		ЛогОбновления.ДобавитьСтроку("Not Found:");
		для Каждого Элемент из Лог.НеОбновлено Цикл
			ЛогОбновления.ДобавитьСтроку(Элемент);
		КонецЦикла;
		
		ЛогОбновления.ДобавитьСтроку(Символы.ПС);
		
		ЛогОбновления.ДобавитьСтроку("Updated:");
		для Каждого Элемент из Лог.Обновлено Цикл
			ЛогОбновления.ДобавитьСтроку(Элемент);
		КонецЦикла;
		
		Если Лог.НеОбновлено.Количество() или Лог.Обновлено.Количество() Тогда
			РассылкаГотова = Истина;
		КонецЕсли;
		
		Если РассылкаГотова Тогда
			
			ЗапуститьРассылкуПисьма(ЛогОбновления);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УстановитьНастройки(ПараметрыВыполненияКоманды)
	
	НастройкиВыполнения = ПараметрыВыполненияКоманды.ПараметрыДополнительнойОбработки;
	Если ТипЗнч(НастройкиВыполнения) <> Тип("Структура") Тогда 
		Возврат "<Настройки не установлены>"; 
	КонецЕсли;
	
	ЗначенияНастроек = НастройкиВыполнения;
	ПредставлениеНастроек = "";
	
	УстановитьПользовательскиеНастройки(ЗначенияНастроек, ПредставлениеНастроек);
	
	Возврат ПредставлениеНастроек;
КонецФункции

Процедура УстановитьПользовательскиеНастройки(Настройки, ПредставлениеНастроек="") Экспорт
	
	Почта = Неопределено;
	Если Настройки.Свойство("ПочтовыйЛогин", Почта) Тогда
		ПочтовыйЛогин = Почта;
		Ящики = XMLЗначение(Тип("ХранилищеЗначения"),Настройки.СписокРассылки);
		СписокРассылки.Загрузить(Ящики.Получить());
	КонецЕсли;
	
	Настройка = Неопределено;
	Если Настройки.Свойство("ОчищатьДепозитыПередЗагрузкой", Настройка) Тогда
		ОчищатьДепозитыПередЗагрузкой = Настройка;	
	КонецЕсли;
	
	Настройка = Неопределено;
	Если Настройки.Свойство("ВебСервисДУ", Настройка) Тогда
		ВебСервисДУ = Настройка;
	КонецЕсли;
	
	Настройка = Неопределено;
	Если Настройки.Свойство("ВебСервисПИФ", Настройка) Тогда
		ВебСервисПИФ = Настройка;
	КонецЕсли;
	
	Настройка = Неопределено;
	Если Настройки.Свойство("Логин", Настройка) Тогда
		Логин = Настройка;
	КонецЕсли;
	
	Настройка = Неопределено;
	Если Настройки.Свойство("Пароль", Настройка) Тогда
		Пароль = Настройка;
	КонецЕсли;
	
	Настройка = Неопределено;
	Если Настройки.Свойство("ОбработкаПерерасчетаСтоимости", Настройка) Тогда
		ОбработкаПерерасчетаСтоимости = Настройка;
	КонецЕсли;
	
	ПредставлениеНастроек = "";
	
КонецПроцедуры

Процедура НастройкиПоУмолчанию() Экспорт
	
	ОчищатьДепозитыПередЗагрузкой = Истина;
	ВебСервисДУ = "http://ammgavancore:8082/AvancoreDU/ws/DU.1cws?wsdl";
	ВебСервисПИФ = "http://ammgavancore:8083/AvancorePIF/ws/PIF.1cws?wsdl";
	Логин = "svc_avancore";
	Пароль = "адм232882";
	
	ПочтовыйЛогин = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	СписокРассылки.Очистить();
	
	СтрокаТЧ = СписокРассылки.Добавить();
	СтрокаТЧ.ПочтовыйЯщик = "VTBAMMiddleoffice@vtbcapital.ru";
	строкаТЧ.Представление = "VTBAMMiddleoffice@vtbcapital.ru";
	
	СтрокаТЧ = СписокРассылки.Добавить();
	СтрокаТЧ.ПочтовыйЯщик = "IMAppSupport@vtbcapital.ru";
	строкаТЧ.Представление = "IMAppSupport@vtbcapital.ru";
	
КонецПроцедуры

Функция ДополнительнаяОбработкаСсылка() Экспорт
	
	ДопОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ЭтотОбъект.Метаданные().Имя);
	
	Возврат ДопОбработкаСсылка;
	
КонецФункции

#КонецОБласти

#Область Заполнение

Процедура ЗаполнитьДепозиты(Лог) Экспорт
	
	СопоставлениеИД.Очистить();
	
	Лог = новый Массив;
	
	Если ЗначениеЗаполнено(ВебСервисДУ) Тогда
		
		ЗаполнитьДепозитыДУ(Лог);
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ВебСервисПИФ) Тогда
		
		ЗаполнитьДепозитыПИФ(Лог);
		
	КонецЕсли;
	
	ЗаполнитьДепозитыКалипсо(Лог);
	
	
КонецПроцедуры

Процедура ЗаполнитьДепозитыАванкор(Лог) Экспорт
	
	СопоставлениеИД.Очистить();
	
	Лог = новый Массив;
	
	Если ЗначениеЗаполнено(ВебСервисДУ) Тогда
		
		ЗаполнитьДепозитыДУ(Лог);
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ВебСервисПИФ) Тогда
		
		ЗаполнитьДепозитыПИФ(Лог);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьДепозитыКалипсоМодуль(Лог) Экспорт
	
	ЗаполнитьДепозитыКалипсо(Лог);
		
КонецПроцедуры

Процедура ЗаполнитьДепозитыДУ(Лог) 
	
	ЕстьОшибки = Ложь;
	ОписаниеОшибки = "";
	СписокДепозитовДУ.Очистить();
	
	Попытка
		ОпределениеWS = Новый WSОпределения(ВебСервисДУ, Логин, Пароль);
	Исключение
		ЕстьОшибки = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Если ЕстьОшибки Тогда
		Лог.Добавить(ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ФабрикаСервиса = ОпределениеWS.ФабрикаXDTO;
	
	Прокси = Новый WSПрокси(ОпределениеWS, ОпределениеWS.Сервисы[0].URIПространстваИмен, ОпределениеWS.Сервисы[0].Имя, ОпределениеWS.Сервисы[0].ТочкиПодключения[0].Имя);
	Ответ = Прокси.getDeposits(ДатаЗапроса);
	
	Если ТипЗнч(Ответ) <> Тип("ОбъектXDTO") Тогда
		Лог.Добавить("Ошибка получения данных!");
		Возврат;
	КонецЕсли;	
	
	Если НЕ ПроверитьНаличиеБлока(Ответ, "deposit") Тогда
		Лог.Добавить("Нет блока с депозитами!");
		Возврат;		
	КонецЕсли;
	
	ОбработатьОтвет("ДУ", Ответ);

	Лог.Добавить("Заполненые депозиты из АванкорДУ");
	
КонецПроцедуры

Процедура ЗаполнитьДепозитыПИФ(Лог) 
	
	ЕстьОшибки = Ложь;
	ОписаниеОшибки = "";
	СписокДепозитовПИФ.Очистить();
	
	Попытка
		ОпределениеWS = Новый WSОпределения(ВебСервисПИФ, Логин, Пароль);
	Исключение
		ЕстьОшибки = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Если ЕстьОшибки Тогда
		Лог.Добавить(ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ФабрикаСервиса = ОпределениеWS.ФабрикаXDTO;
	
	Прокси = Новый WSПрокси(ОпределениеWS, ОпределениеWS.Сервисы[0].URIПространстваИмен, ОпределениеWS.Сервисы[0].Имя, ОпределениеWS.Сервисы[0].ТочкиПодключения[0].Имя);
	
	Ответ = Прокси.getDeposits(ДатаЗапроса);
	
	ОбработатьОтвет("ПИФ", Ответ);
	
	Лог.Добавить("Заполненые депозиты из АванкорПИФ");
	
КонецПроцедуры

Процедура ЗаполнитьДепозитыКалипсо(Лог)
	
	СписокДепозитовCalipso.Очистить();
	
	ЗапросКалипсо = "
	|SELECT abs([Pricer_CURRENT_NOTIONAL]+[Pricer_ACCRUAL_BO]*(-1)) as MV
    |  ,[TradeId] as MX_Code
    |  ,'CALIPSO' as [Source]
    |  ,case when [ProductDescription] like 'Deposit%' then [ProcessingOrg_ShortName] else [CounterParty_ShortName] end as ContrPartyName
    |  ,[Currency] as Fund
    |  ,case when [ProductDescription] like 'Deposit%' then [CounterParty_ShortName] else [ProcessingOrg_ShortName] end as BenefitID
    |  ,case when [ProductDescription] like 'Deposit%' then [CounterParty_FullName] else [ProcessingOrg_FullName] end as BenefitName
    |  ,abs([Pricer_CURRENT_NOTIONAL]) as Qty
    |  ,[FixedRate] as InterestRate
    |  ,[TradeDate] as OpenDate
    |  ,[MaturityDate] as MaturityDate
	|  
	|  --,[Pricer_CURRENT_NOTIONAL]
	|  --,[Pricer_ACCRUAL_BO]
	|  --,*
	|  --, TradeId
	|  --, MirrorTradeId
	|  FROM [dbo].[t_Calipso_LoanDeposit] cld
	|  where 1=1
	|  --and [Pricer_CURRENT_NOTIONAL]>0
	|  and [CounterParty_ShortName] <> [ProcessingOrg_ShortName]
	|  and [DatePosition] = (select MAX([DatePosition]) from [dbo].[t_Calipso_LoanDeposit])
	|  and not exists(select 1 FROM [dbo].[t_Calipso_LoanDeposit]
	|					where 1=1
	|						and [CounterParty_ShortName] <> [ProcessingOrg_ShortName]
	|						and [DatePosition] = (select MAX([DatePosition]) from [dbo].[t_Calipso_LoanDeposit])
	|						and cld.[MirrorTradeId] = [TradeId]
	|						and ProductDescription like 'Loan%'
	|						)";	
	
	Попытка
		
		ConnectionSQL = Новый COMОбъект("ADODB.Connection");
		
		ServerName = "AMDBRATES\DBMVTBAM01";
		DSN = "MasterData";
		UID = "svc_ratesuploader"; 
		PWD = "5E-20-5A-2D-5C-B9";
	
		ConnectString = "Provider=SQLOLEDB;" + "Data Source=" +ServerName + ";Initial Catalog=" + DSN + ";UID=" + UID + ";PWD=" + PWD;
					
		ConnectionSQL.ConnectionString = ConnectString;
		ConnectionSQL.ConnectionTimeOut = 15;
		ConnectionSQL.CommandTimeout = 30;
		ConnectionSQL.Open();
		
	Исключение
		
		Сообщить("Ошибка подключения к серверу ["+ServerName+"]: "+ОписаниеОшибки());
		Возврат ;
		
	КонецПопытки;
	
	CommandSQL = Новый COMОбъект("ADODB.Command");
	CommandSQL.ActiveConnection = ConnectionSQL;
	CommandSQL.CommandText = ЗапросКалипсо;
	CommandSQL.CommandType = 1;
	
	Успешно = Истина;
	Попытка
		НаборЗаписей = CommandSQL.Execute();
	Исключение
		Сообщить("Ошибка выполнения команды: "+ОписаниеОшибки());
		Сообщить("Текст команды:");
		Сообщить(ЗапросКалипсо);
		Успешно = Ложь;
	КонецПопытки;
	
	Если НЕ Успешно Тогда
		Возврат;
	КонецЕсли;
	
	Пока НаборЗаписей.EOF() = 0 Цикл
		
		MV = НаборЗаписей.Fields("MV").Value;
		MX_Code = НаборЗаписей.Fields("MX_Code").Value;
		Валюта = НаборЗаписей.Fields("Fund").Value;
		
		Строка = СписокДепозитовCalipso.Добавить();
		Строка.КодМестаХранения = Формат(MX_Code, "ЧГ=");
		Строка.BenefitID = НаборЗаписей.Fields("BenefitID").Value;
		Строка.BenefitName = НаборЗаписей.Fields("BenefitName").Value;
		Строка.СтрокаBase36 = КонвертацияBase36(MX_Code);
		Строка.МаскаПоиска = "-D" + СокрЛП(Строка.СтрокаBase36) + "-";
		Строка.СубПортфель = НайтиСубПортфельПоМаске(Строка.МаскаПоиска);
		Попытка
			Строка.РыночнаяСтоимость = Число(MV);;
		Исключение	
		КонецПопытки;
		Попытка
			Строка.Qty = Число(НаборЗаписей.Fields("Qty").Value);
		Исключение	
		КонецПопытки;
		Строка.ContrPartyName = НаборЗаписей.Fields("ContrPartyName").Value;
		Строка.Валюта = Справочники.Валюты.НайтиПоНаименованию(Валюта);
		
		Строка.СуммаНачисленныхПроцентов = Строка.РыночнаяСтоимость  - Строка.Qty;
		
		НаборЗаписей.MoveNext();
		
	КонецЦикла;
		
	ConnectionSQL = Неопределено;
	
КонецПроцедуры

Процедура ОбработатьОтвет(ВидИсточника, Ответ)
	
	Если ТипЗнч(Ответ.deposit) = Тип("ОбъектXDTO") Тогда
		ПрочитатьДепозит(ВидИсточника, Ответ.deposit);
	Иначе
		Для Каждого ЭлементОтвета из Ответ.deposit Цикл
			ПрочитатьДепозит(ВидИсточника, ЭлементОтвета);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьДепозит(ВидИсточника, Данные)
	
	Если ВидИсточника = "ДУ" Тогда
		
		СтрокаТЧ = СписокДепозитовДУ.Добавить();
		СтрокаТЧ.ИД = Данные.id; 
		СтрокаТЧ.Имя = Данные.name;
		СтрокаТЧ.РыночнаяСтоимость = Данные.marketvalue;
		СтрокаТЧ.ПроцентыДень = Данные.day_interest;
		СтрокаТЧ.Тело = Данные.initialvalue;
		СтрокаТЧ.ТекущаяСтоимость = Данные.currentvalue;
		СтрокаТЧ.Валюта = Справочники.Валюты.НайтиПоНаименованию(Данные.currency);
		СтрокаТЧ.ДатаНачала = Данные.datestart;
		СтрокаТЧ.ДатаОкончания = Данные.datematurity;
		СтрокаТЧ.Ставка = Данные.interest;
		Портфель = НайтиПортфель(Данные.agreements_prefix);
		СтрокаТЧ.МестоХранения = НайтиМестоХранения(СтрокаТЧ.ИД, Портфель);
		Если ЗначениеЗаполнено(СтрокаТЧ.МестоХранения) Тогда
			СтрокаТЧ.СубПортфель = НайтиСубПортфель(СтрокаТЧ.МестоХранения);
		Иначе
			ДОбавитьВСопоставление(Данные, "ДУ");
		КонецЕсли;
		СтрокаТЧ.СуммаНачисленныхПроцентов = СтрокаТЧ.РыночнаяСтоимость - СтрокаТЧ.Тело;
		
	ИначеЕсли ВидИсточника = "ПИФ" Тогда
		
		СтрокаТЧ = СписокДепозитовПИФ.Добавить();
		СтрокаТЧ.ИД = Данные.id; 
		СтрокаТЧ.Имя = Данные.name;
		СтрокаТЧ.РыночнаяСтоимость = Данные.marketvalue;
		СтрокаТЧ.ПроцентыДень = Данные.day_interest;
		СтрокаТЧ.Тело = Данные.initialvalue;
		СтрокаТЧ.ТекущаяСтоимость = Данные.currentvalue;
		СтрокаТЧ.Валюта = Справочники.Валюты.НайтиПоНаименованию(Данные.currency);
		СтрокаТЧ.ДатаНачала = Данные.datestart;
		СтрокаТЧ.ДатаОкончания = Данные.datematurity;
		СтрокаТЧ.Ставка = Данные.interest;
		СтрокаТЧ.МестоХранения = НайтиМестоХранения(СтрокаТЧ.ИД); 
		
		Если ЗначениеЗаполнено(СтрокаТЧ.МестоХранения) Тогда
			СтрокаТЧ.СубПортфель = НайтиСубПортфель(СтрокаТЧ.МестоХранения);
		Иначе
			ДОбавитьВСопоставление(Данные, "ПИФ");
		КонецЕсли;
		СтрокаТЧ.СуммаНачисленныхПроцентов = СтрокаТЧ.РыночнаяСтоимость - СтрокаТЧ.Тело;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеПозиции

Процедура ЗаписатьСтавкуДепозита(МестоХранения, Ставка)
	
	Если ТипЗнч(МестоХранения.Объект)=Тип("СправочникСсылка.БанковскиеСчета") И ЗначениеЗаполнено(МестоХранения.Объект) Тогда
		БСОбъект = МестоХранения.Объект.ПолучитьОбъект();
		БСОбъект.ПроцентнаяСтавка = Ставка;
		БСОбъект.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура ОчиститьДепозиты() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанковскиеСчета.Ссылка КАК БанковскийСчет,
		|	МестаХранения.Ссылка КАК МестоХранения
		|ПОМЕСТИТЬ ВТ_Депозиты
		|ИЗ
		|	Справочник.МестаХранения КАК МестаХранения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ПО МестаХранения.Объект = БанковскиеСчета.Ссылка
		|ГДЕ
		|	БанковскиеСчета.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Депозитный)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФактическаяПозиция.МестоХранения КАК МестоХранения
		|ИЗ
		|	РегистрСведений.ФактическаяПозиция КАК ФактическаяПозиция
		|ГДЕ
		|	ФактическаяПозиция.Дата = &Дата
		|	И ФактическаяПозиция.МестоХранения В
		|			(ВЫБРАТЬ
		|				Депозиты.МестоХранения КАК МестоХранения
		|			ИЗ
		|				ВТ_Депозиты КАК Депозиты)";
	
	Запрос.УстановитьПараметр("Дата", ДатаЗапроса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Набор = РегистрыСведений.ФактическаяПозиция.СоздатьНаборЗаписей();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Набор.Отбор.Дата.Установить(ДатаЗапроса);
		Набор.Отбор.МестоХранения.Установить(ВыборкаДетальныеЗаписи.МестоХранения);
		Набор.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьФактическуюПозицию(ЛогОбновления) Экспорт
	
	ЛогОбновления = новый Структура;
	
	МассивОк = Новый Массив;
	МассивНеОК = Новый Массив;
	ТаблицаПортфелей = Новый ТаблицаЗначений;
	ТаблицаПортфелей.Колонки.Добавить("Портфель"); 
	
	ДЛя каждого СтрокаТЧ из СписокДепозитовДУ Цикл
		
		Актив = ВернутьАктив(СтрокаТЧ.Валюта);
		
		Если Актив.Пустая() Тогда
			Сообщить("Не найден актив " + СтрокаТЧ.Валюта.Наименование);
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.МестоХранения) ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.СубПортфель) Тогда
			
			Сообщение = "AVAN_DU " + СокрЛП(СтрокаТЧ.ИД) + " " + СокрП(СтрокаТЧ.Имя) + " - " + формат(СтрокаТЧ.РыночнаяСтоимость, "ЧРД=.; ЧГ=") + " (" + формат(СтрокаТЧ.Тело, "ЧРД=.; ЧГ=") + ") " + СтрокаТЧ.Валюта.Наименование;
			МассивНеОК.Добавить(Сообщение);
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПортфелей.Добавить();
		НоваяСтрока.Портфель = СтрокаТЧ.СубПортфель.Портфель;
		
		//IMDEV-4575
		ЗаписатьСтавкуДепозита(СтрокаТЧ.МестоХранения, СтрокаТЧ.Ставка);
		
		Набор = РегистрыСведений.ВТБ_ФактическаяПозицияДепозитов.СоздатьНаборЗаписей();
		Набор.Отбор.Дата.Установить(ДатаЗапроса);
		Набор.Отбор.МестоХранения.Установить(СтрокаТЧ.МестоХранения);
		Набор.Прочитать();
		
		Если Набор.Количество() = 0 Тогда
			
			Запись = Набор.Добавить();
			Запись.Дата = ДатаЗапроса;
			Запись.МестоХранения = СтрокаТЧ.МестоХранения;
			Запись.Актив = Актив;
			Запись.Субпортфель = СтрокаТЧ.СубПортфель;
			запись.Портфель = СтрокаТЧ.СубПортфель.Портфель;
			Запись.Количество = СтрокаТЧ.Тело;
			Запись.Стоимость = СтрокаТЧ.Тело;
			Запись.Задолженность = 0;
			ЗАпись.НКД = СтрокаТЧ.СуммаНачисленныхПроцентов;
			Запись.СуммаДенежныхСредствСЗадолженностью = СтрокаТЧ.РыночнаяСтоимость;
			
			Набор.Записать(Истина);
			
			Сообщение = "AVAN_DU " + СокрЛП(СтрокаТЧ.ИД) + " " + СокрП(СтрокаТЧ.Имя) + " - " + формат(СтрокаТЧ.РыночнаяСтоимость, "ЧРД=.; ЧГ=") + " (" + формат(СтрокаТЧ.Тело, "ЧРД=.; ЧГ=") + ") " + СтрокаТЧ.Валюта.Наименование;
			Если СтрокаТЧ.СуммаНачисленныхПроцентов <= 0 Тогда
				Сообщение = "!!! Отрицательный или нулевой процент " + Сообщение;
			КонецЕсли;
			МассивОК.Добавить(Сообщение);
			
		ИначеЕсли Набор.Количество() = 1 ТОгда
			
			Запись = Набор.Получить(0);
			Запись.Количество = СтрокаТЧ.Тело;
			Запись.Стоимость = СтрокаТЧ.Тело;
			Запись.Задолженность = 0;
			ЗАпись.НКД = СтрокаТЧ.СуммаНачисленныхПроцентов;
			Запись.СуммаДенежныхСредствСЗадолженностью = СтрокаТЧ.РыночнаяСтоимость;
			
			Набор.Записать(Истина);
			
			Сообщение = "AVAN_DU " + СокрЛП(СтрокаТЧ.ИД) + " " + СокрП(СтрокаТЧ.Имя) + " - " + формат(СтрокаТЧ.РыночнаяСтоимость, "ЧРД=.; ЧГ=") + " (" + формат(СтрокаТЧ.Тело, "ЧРД=.; ЧГ=") + ") " + СтрокаТЧ.Валюта.Наименование;
			Если СтрокаТЧ.СуммаНачисленныхПроцентов <= 0 Тогда
				Сообщение = "!!! Отрицательный или нулевой процент " + Сообщение;
			КонецЕсли;
			МассивОК.Добавить(Сообщение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДЛя каждого СтрокаТЧ из СписокДепозитовПИФ Цикл
		
		Актив = ВернутьАктив(СтрокаТЧ.Валюта);
		
		Если Актив.Пустая() Тогда
			Сообщить("Не найден актив " + СтрокаТЧ.Валюта.Наименование);
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.МестоХранения) ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.СубПортфель) Тогда
			
			Сообщение = "AVAN_PIF " + СокрЛП(СтрокаТЧ.ИД) + " " + СокрП(СтрокаТЧ.Имя) + " - " + формат(СтрокаТЧ.РыночнаяСтоимость, "ЧРД=.; ЧГ=") + " (" + формат(СтрокаТЧ.Тело, "ЧРД=.; ЧГ=") + ") " + СтрокаТЧ.Валюта.Наименование;
			МассивНеОК.Добавить(Сообщение);
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПортфелей.Добавить();
		НоваяСтрока.Портфель = СтрокаТЧ.СубПортфель.Портфель;
		
		//IMDEV-4575
		ЗаписатьСтавкуДепозита(СтрокаТЧ.МестоХранения, СтрокаТЧ.Ставка);
		
		Набор = РегистрыСведений.ВТБ_ФактическаяПозицияДепозитов.СоздатьНаборЗаписей();
		Набор.Отбор.Дата.Установить(ДатаЗапроса);
		Набор.Отбор.МестоХранения.Установить(СтрокаТЧ.МестоХранения);
		Набор.Прочитать();
		
		Если Набор.Количество() = 0 Тогда
			
			Запись = Набор.Добавить();
			Запись.Дата = ДатаЗапроса;
			Запись.МестоХранения = СтрокаТЧ.МестоХранения;
			Запись.Актив = Актив;
			Запись.Субпортфель = СтрокаТЧ.СубПортфель;
			запись.Портфель = СтрокаТЧ.СубПортфель.Портфель;
			Запись.Количество = СтрокаТЧ.Тело;
			Запись.Стоимость = СтрокаТЧ.Тело;
			Запись.Задолженность = 0;
			ЗАпись.НКД = СтрокаТЧ.СуммаНачисленныхПроцентов;
			Запись.СуммаДенежныхСредствСЗадолженностью = СтрокаТЧ.РыночнаяСтоимость;
			
			Набор.Записать(Истина);
			
			Сообщение = "AVAN_PIF " + СокрЛП(СтрокаТЧ.ИД) + " " + СокрП(СтрокаТЧ.Имя) + " - " + формат(СтрокаТЧ.РыночнаяСтоимость, "ЧРД=.; ЧГ=")
				+ " (" + формат(СтрокаТЧ.Тело, "ЧРД=.; ЧГ=") + ") " + СтрокаТЧ.Валюта.Наименование;
			Если СтрокаТЧ.СуммаНачисленныхПроцентов <= 0 Тогда
				Сообщение = "!!! Отрицательный или нулевой процент " + Сообщение;
			КонецЕсли;
			МассивОК.Добавить(Сообщение);
			
		ИначеЕсли Набор.Количество() = 1 ТОгда
			
			Запись = Набор.Получить(0);
			Запись.Количество = СтрокаТЧ.Тело;
			Запись.Стоимость = СтрокаТЧ.Тело;
			Запись.Задолженность = 0;
			ЗАпись.НКД = СтрокаТЧ.СуммаНачисленныхПроцентов;
			Запись.СуммаДенежныхСредствСЗадолженностью = СтрокаТЧ.РыночнаяСтоимость;
			
			Набор.Записать(Истина);
			
			Сообщение = "AVAN_PIF " + СокрЛП(СтрокаТЧ.ИД) + " " + СокрП(СтрокаТЧ.Имя) + " - " + формат(СтрокаТЧ.РыночнаяСтоимость, "ЧРД=.; ЧГ=")
				+ " (" + формат(СтрокаТЧ.Тело, "ЧРД=.; ЧГ=") + ") " + СтрокаТЧ.Валюта.Наименование;
			Если СтрокаТЧ.СуммаНачисленныхПроцентов <= 0 Тогда
				Сообщение = "!!! Отрицательный или нулевой процент " + Сообщение;
			КонецЕсли;
			МассивОК.Добавить(Сообщение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Calypso
	ДЛя каждого СтрокаТЧ из СписокДепозитовCalipso Цикл
		
		Актив = ВернутьАктив(СтрокаТЧ.Валюта);
		
		Если Актив.Пустая() Тогда
			Сообщить("Не найден актив " + СтрокаТЧ.Валюта.Наименование);
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Субпортфель) ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.СубПортфель) Тогда
			
			Сообщение = "CALIPSO - " + СокрЛП(СтрокаТЧ.BenefitID) + " " + СокрП(СтрокаТЧ.BenefitName) + " - " + СокрЛП(СтрокаТЧ.КодМестаХранения) + "/" + СокрЛП(СтрокаТЧ.СтрокаBase36)
				+  " - " + СокрЛП(СтрокаТЧ.ContrPartyName) + " - " + формат(СтрокаТЧ.РыночнаяСтоимость, "ЧРД=.; ЧГ=") + " " + СтрокаТЧ.Валюта.Наименование;
			Если СтрокаТЧ.СуммаНачисленныхПроцентов <= 0 Тогда
				Сообщение = "!!! Отрицательный или нулевой процент " + Сообщение;
			КонецЕсли;
			МассивНеОК.Добавить(Сообщение);
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПортфелей.Добавить();
		НоваяСтрока.Портфель = СтрокаТЧ.СубПортфель.Портфель;
		
		Набор = РегистрыСведений.ВТБ_ФактическаяПозицияДепозитов.СоздатьНаборЗаписей();
		Набор.Отбор.Дата.Установить(ДатаЗапроса);
		Набор.Отбор.Субпортфель.Установить(СтрокаТЧ.Субпортфель);
		Набор.Прочитать();
		
		Если Набор.Количество() = 0 Тогда
			
			Запись = Набор.Добавить();
			Запись.Дата = ДатаЗапроса;
			Запись.МестоХранения = Справочники.МестаХранения.ПустаяСсылка();
			Запись.Актив = Актив;
			Запись.Субпортфель = СтрокаТЧ.СубПортфель;
			запись.Портфель = СтрокаТЧ.СубПортфель.Портфель;
			Запись.Количество = СтрокаТЧ.Qty;
			Запись.Стоимость = СтрокаТЧ.Qty;
			Запись.Задолженность = 0;
			ЗАпись.НКД = СтрокаТЧ.СуммаНачисленныхПроцентов;
			Запись.СуммаДенежныхСредствСЗадолженностью = СтрокаТЧ.РыночнаяСтоимость;
			
			Набор.Записать(Истина);
			
			Сообщение = "CALIPSO - " + СокрЛП(СтрокаТЧ.BenefitID) + " " + СокрП(СтрокаТЧ.BenefitName) + " - " + СокрЛП(СтрокаТЧ.КодМестаХранения)
				+ "/" + СокрЛП(СтрокаТЧ.СтрокаBase36) +  " - " + СокрЛП(СтрокаТЧ.ContrPartyName) +  " - " + формат(СтрокаТЧ.РыночнаяСтоимость, "ЧРД=.; ЧГ=")
				+ " (" + Формат(СтрокаТЧ.Qty, "ЧРД=.; ЧГ=") + ") " + СтрокаТЧ.Валюта.Наименование;
			Если СтрокаТЧ.СуммаНачисленныхПроцентов <= 0 Тогда
				Сообщение = "!!! Отрицательный или нулевой процент " + Сообщение;
			КонецЕсли;
			МассивОК.Добавить(Сообщение);
		
		ИначеЕсли Набор.Количество() = 1 ТОгда
			
			Запись = Набор.Получить(0);
			Запись.Количество = СтрокаТЧ.Qty;
			Запись.Стоимость = СтрокаТЧ.Qty;
			Запись.Задолженность = 0;
			ЗАпись.НКД = СтрокаТЧ.СуммаНачисленныхПроцентов;
			Запись.СуммаДенежныхСредствСЗадолженностью = СтрокаТЧ.РыночнаяСтоимость;
			
			Набор.Записать(Истина);
			
			Сообщение = "CALIPSO - " + СокрЛП(СтрокаТЧ.BenefitID) + " " + СокрП(СтрокаТЧ.BenefitName) + " - " + СокрЛП(СтрокаТЧ.КодМестаХранения)
				+ "/" + СокрЛП(СтрокаТЧ.СтрокаBase36) +  " - " + СокрЛП(СтрокаТЧ.ContrPartyName) +  " - " + формат(СтрокаТЧ.РыночнаяСтоимость, "ЧРД=.; ЧГ=")
				+ " (" + Формат(СтрокаТЧ.Qty, "ЧРД=.; ЧГ=") + ") " + СтрокаТЧ.Валюта.Наименование;
			Если СтрокаТЧ.СуммаНачисленныхПроцентов <= 0 Тогда
				Сообщение = "!!! Отрицательный или нулевой процент " + Сообщение;
			КонецЕсли;
			МассивОК.Добавить(Сообщение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	//IMAPPS-17897
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(МассивОк);
	Список.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	МассивОк = Список.ВыгрузитьЗначения();
	//IMAPPS-17897 
	
	//IMAPPS-35483++
	СписокТекущихДепозитовФО = ПолучитьДепозитыФО_КУдалению(ДатаЗапроса, СписокДепозитовДУ, СписокДепозитовПИФ, СписокДепозитовCalipso); 
	
	Пока СписокТекущихДепозитовФО.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ВТБ_ФактическаяПозицияДепозитов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Субпортфель.Установить(СписокТекущихДепозитовФО.Субпортфель);  
		НаборЗаписей.Отбор.Дата.Установить(ДатаЗапроса);
		НаборЗаписей.Отбор.МестоХранения.Установить(СписокТекущихДепозитовФО.МестоХранения);

		НаборЗаписей.Прочитать();
		НаборЗаписей.Удалить(0);
		НаборЗаписей.Записать();
		
		Сообщение = "Удален депозит по субпортфелю "+СписокТекущихДепозитовФО.Субпортфель + " на сумму " + СписокТекущихДепозитовФО.Стоимость; 
		Сообщить(Сообщение);
		МассивНеОК.Добавить(Сообщение);

	КонецЦикла;
	
	//IMAPPS-35483--
	
	Если ЗначениеЗаполнено(ОбработкаПерерасчетаСтоимости) Тогда
		ТаблицаПортфелей.Свернуть("Портфель");
		МассивПортфелей = ТаблицаПортфелей.ВыгрузитьКолонку("Портфель");
		ДатаНачала = ТекущаяДатаСеанса();
		ИдентификаторСеанса = Новый УникальныйИдентификатор;
		ПоВсемПортфелям = Ложь;
		ВыполнитьПерерасчетРСА(ИдентификаторСеанса, ДатаЗапроса, МассивПортфелей, ПоВсемПортфелям);
		
		АванкорВыполнениеРегламентныхЗаданий.Пауза(10);
		
		ДатаОкончания = ТекущаяДатаСеанса();
		ВыполнитьРассылкуПоПерерасчетуРСА(ИдентификаторСеанса, ДатаНачала, ДатаОкончания);
	Иначе
		Сообщение = "В настройках не указана обработка Пересчета стоимости фактической позиции и РСА. Пересчет не был запущен.";
		МассивНеОК.Добавить(Сообщение);
	КонецЕсли;
	
	ЛогОбновления.Вставить("НеОбновлено", МассивНеОК);
	ЛогОбновления.Вставить("Обновлено", МассивОк);
	
КонецПроцедуры

Функция ВернутьАктив(Валюта)
	
	Актив = Справочники.Активы.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Активы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Активы КАК Активы
	               |ГДЕ
	               |	Активы.Объект = &Объект
	               |	И НЕ Активы.ПометкаУдаления";
	Запрос.УстановитьПараметр("Объект", Валюта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Актив = Выборка.Ссылка;		
	КонецЕсли;
	
	Возврат Актив;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьНаличиеБлока(Данные, Элемент);
	
	ВсеОК = Истина;
	
	Попытка
		х = Данные[Элемент];
	Исключение
		ВсеОК = Ложь;
	КонецПопытки;
	
	Возврат ВсеОК;
	
КонецФункции

Процедура ДОбавитьВСопоставление(СтрокаДанных, ВидИсточника)
	
	СтрокаТЧ = СопоставлениеИД.Добавить();
	СтрокаТЧ.ИД = СтрокаДанных.id; 
	СтрокаТЧ.Имя = СтрокаДанных.name;
	СтрокаТЧ.ВмдИсточника = ВидИсточника;
	
КонецПроцедуры

Функция НайтиМестоХранения(ИДДепозита, Портфель = Неопределено)
	
	МестоХранения = Справочники.МестаХранения.ПустаяСсылка();
	
	Запрос = Новый Запрос; 
	
	// IMAPPS-26353 ++
	//Если  Портфель = Неопределено Тогда
	Если НЕ ЗначениеЗаполнено(Портфель) Тогда
	// IMAPPS-26353 --
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДополнительныеСведения.Объект КАК Объект,
		               |	ДополнительныеСведения.Свойство КАК Свойство,
		               |	ДополнительныеСведения.Значение КАК Значение
		               |ИЗ
		               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		               |ГДЕ
		               |	ДополнительныеСведения.Объект ССЫЛКА Справочник.МестаХранения
		               |	И ДополнительныеСведения.Свойство = &Свойство
		               |	И ДополнительныеСведения.Значение = &Значение";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДополнительныеСведения.Объект КАК Объект,
		               |	ДополнительныеСведения.Свойство КАК Свойство,
		               |	ДополнительныеСведения.Значение КАК Значение
		               |ПОМЕСТИТЬ ВТ_МХпоДопСвойству
		               |ИЗ
		               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		               |ГДЕ
		               |	ДополнительныеСведения.Объект ССЫЛКА Справочник.МестаХранения
		               |	И ДополнительныеСведения.Свойство = &Свойство
		               |	И ДополнительныеСведения.Значение = &Значение
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_МХпоДопСвойству.Объект КАК Объект
		               |ИЗ
		               |	ВТ_МХпоДопСвойству КАК ВТ_МХпоДопСвойству
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Субпортфели КАК Субпортфели
		               |		ПО ВТ_МХпоДопСвойству.Объект = Субпортфели.МестоХранения
		               |ГДЕ
		               |	Субпортфели.Портфель = &Портфель";
		Запрос.УстановитьПараметр("Портфель", Портфель);
	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ИдентификаторДепозита"));
	Запрос.УстановитьПараметр("Значение", ИДДепозита);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		МестоХранения = Выборка.Объект;
	КонецЕсли;
	
	Возврат МестоХранения;	
	
КонецФункции

Функция НайтиПортфель(agreements_prefix)
	
	ДлиннаКода = СтрДлина(agreements_prefix);
	Если ДлиннаКода<4 Тогда
		КолДобавить = 4 - ДлиннаКода;
		Для Сч=1 По КолДобавить Цикл
			agreements_prefix = "0" + agreements_prefix
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Портфели.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Портфели КАК Портфели
		|ГДЕ
		|	Портфели.КодПортфеля ПОДОБНО ""%"" + &КодПортфеля + ""%""";
	
	Запрос.УстановитьПараметр("КодПортфеля", agreements_prefix);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Портфели.ПустаяСсылка();
	
КонецФункции

Функция НайтиСубПортфель(МестоХранения)
	
	Субпортфель = Справочники.Субпортфели.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	         |	Субпортфели.Ссылка КАК Ссылка
	         |ИЗ
	         |	Справочник.Субпортфели КАК Субпортфели
	         |ГДЕ
	         |	Субпортфели.МестоХранения = &МестоХранения
	         |	И НЕ Субпортфели.ПометкаУдаления";
	Запрос.УстановитьПараметр("МестоХранения", МестоХранения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Субпортфель = Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат Субпортфель;
	
КонецФункции

Функция НайтиСубПортфельПоМаске(МаскаПоиска)
	
	СубПортфель = Справочники.Субпортфели.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Субпортфели.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Субпортфели КАК Субпортфели
	               |ГДЕ
	               |	НЕ Субпортфели.ПометкаУдаления
	               |	И Субпортфели.КодСчета ПОДОБНО ""%"" + &КодСчета + ""%""";
	Запрос.УстановитьПараметр("КодСчета", МаскаПоиска);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СубПортфель = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат СубПортфель;
	
КонецФункции

Функция ПолучитьДепозитыФО_КУдалению(Дата, ДепозитыДУ, ДепозитыПИФ, ДепозитыКалипсо) //IMAPPS-35483
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
|	ДепозитыДУ.МестоХранения КАК МестоХранения,
|	ДепозитыДУ.СубПортфель КАК СубПортфель,
|	ДепозитыДУ.Тело КАК Стоимость
|ПОМЕСТИТЬ ВТ_ДепозитыДУ
|ИЗ
|	&ДепозитыДУ КАК ДепозитыДУ
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ДепозитыПИФ.МестоХранения КАК МестоХранения,
|	ДепозитыПИФ.СубПортфель КАК СубПортфель,
|	ДепозитыПИФ.Тело КАК Стоимость
|ПОМЕСТИТЬ ВТ_ДепозитыПИФ
|ИЗ
|	&ДепозитыПИФ КАК ДепозитыПИФ
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ДепозитыКалипсо.СубПортфель КАК СубПортфель,
|	ДепозитыКалипсо.РыночнаяСтоимость КАК Стоимость
|ПОМЕСТИТЬ ВТ_ДепозитыКалипсо
|ИЗ
|	&ДепозитыКалипсо КАК ДепозитыКалипсо
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ_ДепозитыДУ.МестоХранения КАК МестоХранения,
|	ВТ_ДепозитыДУ.СубПортфель КАК СубПортфель,
|	ВТ_ДепозитыДУ.Стоимость КАК Стоимость
|ПОМЕСТИТЬ ВТ_ДепозитыСтороннихСистем
|ИЗ
|	ВТ_ДепозитыДУ КАК ВТ_ДепозитыДУ
|ГДЕ
|	ВТ_ДепозитыДУ.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка)
|	И ВТ_ДепозитыДУ.СубПортфель <> ЗНАЧЕНИЕ(Справочник.Субпортфели.ПустаяСсылка)
|
|ОБЪЕДИНИТЬ
|
|ВЫБРАТЬ
|	ВТ_ДепозитыПИФ.МестоХранения,
|	ВТ_ДепозитыПИФ.СубПортфель,
|	ВТ_ДепозитыПИФ.Стоимость
|ИЗ
|	ВТ_ДепозитыПИФ КАК ВТ_ДепозитыПИФ
|ГДЕ
|	ВТ_ДепозитыПИФ.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка)
|	И ВТ_ДепозитыПИФ.СубПортфель <> ЗНАЧЕНИЕ(Справочник.Субпортфели.ПустаяСсылка)
|
|ОБЪЕДИНИТЬ
|
|ВЫБРАТЬ
|	"""",
|	ВТ_ДепозитыКалипсо.СубПортфель,
|	ВТ_ДепозитыКалипсо.Стоимость
|ИЗ
|	ВТ_ДепозитыКалипсо КАК ВТ_ДепозитыКалипсо
|ГДЕ
|	ВТ_ДепозитыКалипсо.СубПортфель <> ЗНАЧЕНИЕ(Справочник.Субпортфели.ПустаяСсылка)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ЕСТЬNULL(ВТБ_ФактическаяПозицияДепозитов.МестоХранения, ВТ_ДепозитыСтороннихСистем.МестоХранения) КАК МестоХранения,
|	ЕСТЬNULL(ВТБ_ФактическаяПозицияДепозитов.Субпортфель, ВТ_ДепозитыСтороннихСистем.СубПортфель) КАК Субпортфель,
|	ЕСТЬNULL(ВТБ_ФактическаяПозицияДепозитов.Стоимость, ВТ_ДепозитыСтороннихСистем.Стоимость) КАК Стоимость,
|	ВЫБОР
|		КОГДА ВТ_ДепозитыСтороннихСистем.СубПортфель ЕСТЬ NULL
|			ТОГДА 0
|		ИНАЧЕ 1
|	КОНЕЦ КАК ЕстьВ_Бэке,
|	ВЫБОР
|		КОГДА ВТБ_ФактическаяПозицияДепозитов.Субпортфель ЕСТЬ NULL
|			ТОГДА 0
|		ИНАЧЕ 1
|	КОНЕЦ КАК ЕстьВ_ФО,
|	ВТБ_ФактическаяПозицияДепозитов.Портфель КАК Портфель,
|	ВТБ_ФактическаяПозицияДепозитов.Актив КАК Актив,
|	ВТБ_ФактическаяПозицияДепозитов.ДатаПартии КАК ДатаПартии,
|	ВТБ_ФактическаяПозицияДепозитов.ТипПортфеля КАК ТипПортфеля
|ПОМЕСТИТЬ ВТ_ДепозитыИтог
|ИЗ
|	РегистрСведений.ВТБ_ФактическаяПозицияДепозитов КАК ВТБ_ФактическаяПозицияДепозитов
|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДепозитыСтороннихСистем КАК ВТ_ДепозитыСтороннихСистем
|		ПО ВТБ_ФактическаяПозицияДепозитов.Субпортфель = ВТ_ДепозитыСтороннихСистем.СубПортфель
|			И ВТБ_ФактическаяПозицияДепозитов.Стоимость = ВТ_ДепозитыСтороннихСистем.Стоимость
|ГДЕ
|	ВТБ_ФактическаяПозицияДепозитов.Дата = &Дата
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ_ДепозитыИтог.МестоХранения КАК МестоХранения,
|	ВТ_ДепозитыИтог.Субпортфель КАК Субпортфель,
|	ВТ_ДепозитыИтог.Стоимость КАК Стоимость,
|	ВТ_ДепозитыИтог.Портфель КАК Портфель,
|	ВТ_ДепозитыИтог.ДатаПартии КАК ДатаПартии,
|	ВТ_ДепозитыИтог.ТипПортфеля КАК ТипПортфеля
|ИЗ
|	ВТ_ДепозитыИтог КАК ВТ_ДепозитыИтог
|ГДЕ
|	ВТ_ДепозитыИтог.ЕстьВ_Бэке = 0
|	И ВТ_ДепозитыИтог.ЕстьВ_ФО = 1
|";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДепозитыДУ", ДепозитыДУ);
	Запрос.УстановитьПараметр("ДепозитыКалипсо", ДепозитыКалипсо);
	Запрос.УстановитьПараметр("ДепозитыПИФ", ДепозитыПИФ);
	
	ДепозитыФО = Запрос.Выполнить().Выбрать();

	Возврат ДепозитыФО
КонецФункции

Процедура ЗаполнитьСопоставление() Экспорт
	
	Для Каждого СтрокаТЧ из СопоставлениеИД Цикл
		
		НомерРС = Прав(СтрокаТЧ.Имя, 20);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	МестаХранения.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.МестаХранения КАК МестаХранения
		               |ГДЕ
		               |	МестаХранения.Объект ССЫЛКА Справочник.БанковскиеСчета
		               |	И МестаХранения.Объект.НомерСчета = &НомерСчета
		               |	И НЕ МестаХранения.ПометкаУдаления";
		Запрос.УстановитьПараметр("НомерСчета", НомерРС);
		
		СписокМестХранений = Запрос.Выполнить().Выгрузить();
		Если СписокМестХранений.Количество() > 1 Тогда
			Сообщить("Для счета " + НомерРС + " найдено более одного места хранения");
			Продолжить;
		КонецЕсли;
		
		Если СписокМестХранений.Количество() ТОгда
			СтрокаТЧ.МестоХранения = СписокМестХранений.Получить(0).Ссылка;
		КонецЕсли;
			
	КонецЦикла;
		
КонецПроцедуры

Процедура УстановитьИДДепозита() Экспорт
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ИдентификаторДепозита");
	
	Для каждого СтрокаТЧ из СопоставлениеИД Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.МестоХранения) Тогда
			Продолжить;
		КонецЕсли;
		
		Набор = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
		Набор.Отбор.Свойство.Установить(Свойство);
		Набор.Отбор.Объект.Установить(СтрокаТЧ.МестоХранения);
		Набор.Прочитать();
		Набор.Очистить();
		
		Запись = Набор.Добавить();
		Запись.Объект = строкаТЧ.МестоХранения;
		Запись.Свойство = Свойство;
		Запись.Значение = СтрокаТЧ.ИД;
		
		Набор.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Функция КонвертацияBase36(ВхСтрока)
	
	Значение = Число(ВхСтрока);
	
	Результат = "";
	ВременноеЧисло = Значение;
	
	КодоваяСтрока = "0-1-2-3-4-5-6-7-8-9-A-B-C-D-E-F-G-H-I-J-K-L-M-N-O-P-Q-R-S-T-U-V-W-X-Y-Z";	
	МассивКодирования = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КодоваяСтрока, "-");
	
		
	Пока ВременноеЧисло <> 0 Цикл
		
		Число = Цел(ВременноеЧисло % 36);
		Результат =  МассивКодирования.Получить(Число) + Результат;
		ВременноеЧисло = Цел(ВременноеЧисло / 36);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьПерерасчетРСА(ИдентификаторСеанса, Дата, МассивПортфелей, ПоВсемПортфелям)
	
	ПараметрыВыполненияОбработки = Новый Структура;
	ПараметрыВыполненияОбработки.Вставить("ИдентификаторСеанса", ИдентификаторСеанса);
	ПараметрыВыполненияОбработки.Вставить("Дата", Дата);
	ПараметрыВыполненияОбработки.Вставить("МассивПортфелей", МассивПортфелей);
	ПараметрыВыполненияОбработки.Вставить("ПоВсемПортфелям", ПоВсемПортфелям);
	ПараметрыВыполненияОбработки.Вставить("ОбработкаПерерасчетаСтоимости", ОбработкаПерерасчетаСтоимости);
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка", 			Истина);
	ПараметрыЗадания.Вставить("ПараметрыВыполнения", 			ПараметрыВыполненияОбработки);
	ПараметрыЗадания.Вставить("ИмяМетода", 						"ВыполнитьПерерасчетВФоне");
	ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка", 	ОбработкаПерерасчетаСтоимости);
	
	Идентификатор = Новый УникальныйИдентификатор;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Идентификатор);
	Если ПоВсемПортфелям Тогда
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = Нстр("ru = 'Пересчет фактической позиции и РСА по всем портфелям'");
	Иначе
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = Нстр("ru = 'Пересчет фактической позиции и РСА'");
	КонецЕсли;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", Идентификатор);
	
	ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
	ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);
	
КонецПроцедуры

Процедура ВыполнитьРассылкуПоПерерасчетуРСА(ИдентификаторСеанса, ДатаНачала, ДатаОкончания)
	
	ПараметрыВыполненияОбработки = Новый Структура;
	ПараметрыВыполненияОбработки.Вставить("ИдентификаторСеанса", ИдентификаторСеанса);
	ПараметрыВыполненияОбработки.Вставить("ДатаНачала", ДатаНачала);
	ПараметрыВыполненияОбработки.Вставить("ДатаОкончания", ДатаОкончания);
	ПараметрыВыполненияОбработки.Вставить("ОбработкаПерерасчетаСтоимости", ОбработкаПерерасчетаСтоимости);
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка", 			Истина);
	ПараметрыЗадания.Вставить("ПараметрыВыполнения", 			ПараметрыВыполненияОбработки);
	ПараметрыЗадания.Вставить("ИмяМетода", 						"СформироватьЛогИВыполнитьРассылку");
	ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка", 	ОбработкаПерерасчетаСтоимости);
	
	Идентификатор = Новый УникальныйИдентификатор;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Идентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = Нстр("ru = 'Рассылка после пересчета фактической позиции и РСА'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", Идентификатор);
	
	ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
	ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);
	
КонецПроцедуры

#КонецОбласти

#Область Рассылка

Процедура ЗапуститьРассылкуПисьма(ЛогОбновления) Экспорт
	
	Если ПочтовыйЛогин.Пустая() или СписокРассылки.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	ТекстСообщения = "";
	КолвоСтрок = ЛогОбновления.КоличествоСтрок();
	Для Сч = 1 по КолвоСтрок цикл
		ТекущаяСтрока = ЛогОбновления.ПолучитьСтроку(Сч);
		ТекстСообщения = ТекстСообщения + ТекущаяСтрока + "<br>";	
	КонецЦикла;	
	
	Префикс = "{OK}";
	Если СписокДепозитовДУ.Количество() = 0 И СписокДепозитовПИФ.Количество() = 0 И СписокДепозитовCalipso.Количество() = 0 Тогда
		Префикс = "{FAIL}";
	ИначеЕсли СписокДепозитовДУ.Количество() = 0 или СписокДепозитовПИФ.Количество() = 0 ИЛИ СписокДепозитовCalipso.Количество() = 0 Тогда
		Префикс = "{WARN}";
	КонецЕсли;
		
	ТемаСообщения = Префикс + " Аванкор ФО: Обновление депозитов (" + Формат(ДатаЗапроса, "ДФ=yyyy-MM-dd; ДП=") + ")";
	ТелоПисьма = "";
	
	ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста, Вложения, Важность");
	Кому = Новый Массив;
	Для каждого ТекЯщик из СписокРассылки Цикл
		Кому.Добавить(Новый Структура("Адрес,Представление", ТекЯщик.ПочтовыйЯщик, ТекЯщик.ПочтовыйЯщик));
	КонецЦикла;		
		
	ПараметрыПисьма.Кому = Кому;
	ПараметрыПисьма.Тело = ТекстСообщения;
	ПараметрыПисьма.ТипТекста = "HTML";
	//ПараметрыПисьма.ТипТекста = "ТекстСообщения";
			
	ПараметрыПисьма.Тема = ТемаСообщения + ПропискаРассылки("r142");
	Если Префикс = "{OK}" Тогда
		ПараметрыПисьма.Важность = ВажностьИнтернетПочтовогоСообщения.Обычная;
	Иначе
		ПараметрыПисьма.Важность = ВажностьИнтернетПочтовогоСообщения.Высокая;	
	КонецЕсли;
	
	Попытка
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(ПочтовыйЛогин, ПараметрыПисьма);
		текстРассылки = "Рассылка завершена";
	Исключение
		
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
		
		текстРассылки = "Рассылка не удалась: "+ПочтовыйЛогин;
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПропискаРассылки(Знач НомерРассылки)
	Перем ПараметрыПодключения, ИмяИБ;
	
	Попытка
		ПараметрыПодключения = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПодключенияИзСтрокиСоединенияИнформационнойБазы(СтрокаСоединенияИнформационнойБазы());
		ИмяИБ = ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия;
	Исключение
	КонецПопытки;
	
	Прописка = " {" + НомерРассылки + ", ib: " + ?(ЗначениеЗаполнено(ИмяИБ), ИмяИБ, "< .. >") + "}";
	
	Возврат Прописка;
КонецФункции // ПропискаРассылки()


#КонецОбласти





