
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ВНУТРЕННЕГО ИСПОЛЬЗОВАНИЯ
// Общего назначения
//

// Процедура ВызватьИсключениеЕслиНетПраваАдминистрирования вызывает исключение,
// если у пользователя нет права администрирования.
//
Процедура ВызватьИсключениеЕслиНетПраваАдминистрирования()

	ВыполняетсяПроцедураВыполнитьРегламентныеЗадания = ХранилищеОбщихНастроек.Загрузить("ВыполняетсяПроцедураВыполнитьРегламентныеЗадания", , , "");
	Если ТипЗнч(ВыполняетсяПроцедураВыполнитьРегламентныеЗадания) <> Тип("Булево") Тогда
		ВыполняетсяПроцедураВыполнитьРегламентныеЗадания = Ложь;
	КонецЕсли;
	
	Если НЕ ВыполняетсяПроцедураВыполнитьРегламентныеЗадания И
		 НЕ ПравоДоступа("Администрирование", Метаданные, ПользователиИнформационнойБазы.ТекущийПользователь()) Тогда
		ВызватьИсключение(НСтр("ru = 'У пользователя нет права администрирования!'"));
	КонецЕсли;
	
КонецПроцедуры

// Функция ТекущийСеансВыполняетРегламентныеЗадания определяет,
// что текущий сеанс выполняет регламентные задания,
// если это не так и указано установить текущий сеанс в этом качестве,
// то производится попытка установки.
//
// Параметры:
//  ЗаданияВыполняютсяНормально - Булево - Истина, если нет отклонений в выполнении заданий.
//  УстановитьТекущийСеансКакСеансВыполняющийРегламентныеЗадания - Булево - Истина,
//                 если требуется установить текущий сеанс,
//                 как сеанс в котором будет происходить выполнение регламентных заданий,
//                 если не удалось установить,  тогда функция вернет Ложь.
//  ОписаниеОшибки - Строка - Если НЕ ЗаданияВыполняютсяНормально, тогда описание отклонения:
//                 либо выполнение долго не начинается, либо выполнение слишком затянулось.
//
// Возвращаемое значение:
//  Булево.
//
Функция ТекущийСеансВыполняетРегламентныеЗадания(ЗаданияВыполняютсяНормально = Неопределено,
                                                 Знач УстановитьТекущийСеансКакСеансВыполняющийРегламентныеЗадания = Ложь,
                                                 ОписаниеОшибки = "") Экспорт
	
	Если НЕ ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		ЗаданияВыполняютсяНормально = Истина;
		ОписаниеОшибки = НСтр("ru = 'Задания выполняются на сервере!'");
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Состояние = ПолучитьСостояниеВыполненияРегламентныхЗаданий();
	
	Сеансы = ПолучитьСеансыИнформационнойБазы();
	НайденСеансВыполняющийЗадания             = Ложь;
	ТекущийСеансВыполняетРегламентныеЗадания  = Ложь;
	ЗаданияВыполняютсяНормально               = Истина;
	
	// Поиск сеанса выполняющего регламентные задания,
	// установленного в структуре СостояниеВыполненияРегламентныхЗаданий,
	// среди активных сеансов
	// Поиск текущего сеанса (начало текущего сеанса может понадобится
	// для инициализации Структуры).
	Для каждого Сеанс Из Сеансы Цикл
		Если Сеанс.НомерСеанса = НомерСеансаИнформационнойБазы() Тогда
			ТекущийСеанс = Сеанс;
		КонецЕсли;
		Если Сеанс.НомерСеанса  = Состояние.НомерСеанса
		   И Сеанс.НачалоСеанса = Состояние.НачалоСеанса Тогда
			//
			НайденныйСеанс = Сеанс;
			НайденСеансВыполняющийЗадания = Истина;
			ТекущийСеансВыполняетРегламентныеЗадания  = (Сеанс.НомерСеанса = НомерСеансаИнформационнойБазы());
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ НайденСеансВыполняющийЗадания И УстановитьТекущийСеансКакСеансВыполняющийРегламентныеЗадания Тогда
		МоментТекущегоВремени                           = ТекущаяДата();
		Состояние.НомерСеанса                           = ТекущийСеанс.НомерСеанса;
		Состояние.НачалоСеанса                          = ТекущийСеанс.НачалоСеанса;
		Состояние.ИмяКомпьютера                         = ИмяКомпьютера();
		Состояние.ИмяПриложения                         = ТекущийСеанс.ИмяПриложения;
		Состояние.ИмяПользователя                       = ИмяПользователя();
		Состояние.ИдентификаторОчередногоЗадания        = Неопределено;
		Состояние.НачалоВыполненияОчередногоЗадания     = МоментТекущегоВремени;
		Состояние.ОкончаниеВыполненияОчередногоЗадания  = МоментТекущегоВремени;
		СохранитьСостояниеВыполненияРегламентныхЗаданий(Состояние);
		НайденСеансВыполняющийЗадания = Истина;
		ТекущийСеансВыполняетРегламентныеЗадания  = Истина;
	КонецЕсли;
	
	Если НЕ НайденСеансВыполняющийЗадания Тогда
		ОписаниеОшибки = НСтр("ru = 'Нет сеанса, выполняющего регламентные задания!'");
		ЗаданияВыполняютсяНормально = Ложь;
		//
	ИначеЕсли НЕ ЗначениеЗаполнено(Состояние.ОкончаниеВыполненияОчередногоЗадания) Тогда
		// Если после завершения очередного задания прошло более часа, значит задержка запуска.
		Если ТекущаяДата() - 360 > Состояние.ОкончаниеВыполненияОчередногоЗадания Тогда
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Выполнение регламентных заданий не начинается уже более 1 часа!
					           |Возможно требуется проверка и перезапуск сеанса. Выполнение ожидается
					           |    на компьютере:         %1,
					           |    в приложении:          %2,
					           |    от имени пользователя: %3,
					           |    в сеансе номер:        %4.'"),
					Строка(Состояние.ИмяКомпьютера),
					Строка(Состояние.ИмяПриложения),
					Строка(Состояние.ИмяПользователя),
					Строка(Состояние.НомерСеанса) );
			ЗаданияВыполняютсяНормально = Ложь;
		КонецЕсли;
	Иначе
		// Если выполнение продолжается более 1 часа, значить она слишком затянулось.
		Если ТекущаяДата() - 360 > Состояние.НачалоВыполненияОчередногоЗадания Тогда
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Выполнение регламентного задания происходит непрерывно более 1 часа!
					           |Возможно требуется проверка и перезапуск сеанса. Выполнение происходит
					           |    на компьютере:         %1,
					           |    в приложении:          %2,
					           |    от имени пользователя: %3,
					           |    в сеансе номер:        %4.'"),
					Строка(Состояние.ИмяКомпьютера),
					Строка(Состояние.ИмяПриложения),
					Строка(Состояние.ИмяПользователя),
					Строка(Состояние.НомерСеанса));
			ЗаданияВыполняютсяНормально = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекущийСеансВыполняетРегламентныеЗадания;
	
КонецФункции

// Функция РодительскийСеансЗаданИЗавершен проверяет,
// что сеанс открывший этот дополнительный сеанс для выполнения
// регламентных заданий завершен, если задан.
//
// Параметры:
//  ПараметрЗапуска - Строка - значение глобального свойства ПараметрЗапуска,
//                 требуется указывать, т.к. свойство недоступно на сервере.
//  РодительскийСеансЗадан - Булево - возвращает Истина, если родительский сеанс задан,
//                 иначе возвращает Ложь.
//
// Возвращаемое значение:
//  Булево.
//
Функция РодительскийСеансЗаданИЗавершен(Знач ПараметрЗапуска) Экспорт

	РодительскийСеансЗадан = Ложь;
	Если Найти(ПараметрЗапуска, "DoScheduledJobs") <> 0 Тогда
		ИндексНомераСеанса = Найти(ПараметрЗапуска, "SessionNumber=");
		ИндексНачалаСеанса = Найти(ПараметрЗапуска, "SessionStarted=");
		Если ИндексНомераСеанса <> 0 И
		     ИндексНачалаСеанса <> 0 И
		     ИндексНомераСеанса < ИндексНачалаСеанса Тогда
			РодительскийСеансЗадан = Истина;
		    Сеансы = ПолучитьСеансыИнформационнойБазы();
			Для каждого Сеанс Из Сеансы Цикл
				Если Найти(ПараметрЗапуска, "SessionNumber="  + Сеанс.НомерСеанса)  <> 0 И
				     Найти(ПараметрЗапуска, "SessionStarted=" + Сеанс.НачалоСеанса) <> 0 Тогда
					Возврат Ложь;
				КонецЕсли;
			КонецЦикла;
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ВНУТРЕННЕГО ИСПОЛЬЗОВАНИЯ
// Для работы с регламентными заданиями
//

// Процедура ВыполнитьРегламентныеЗадания() эмулирует в тонком клиенте
// системную процедуру ВыполнитьОбработкуЗаданий(), но может применяться и
// в толстом клиенте.
//
//  Место хранения экземпляров фоновых заданий - ВременноеХранилище.
// Время хранения экземпляров - до закрытия сеанса клиента, выполняющего регламентные задания.
// Максимальное количество одновременно хранимых фоновых заданий: 1000.
//
//  Идентификатор сеанса, выполняющего регламентные задания находится в структуре
// СостояниеВыполненияРегламентныхЗаданий (ХранилищеЗначения), содержащее структуру
// со свойствами: 
// НомерСеанса, НачалоСеанса, ИдентификаторОчередногоЗадания,
// НачалоВыполненияОчередногоЗадания, ОкончаниеВыполненияОчередногоЗадания и др.
//  Логика проверки выполнения регламентных заданий в текущем сеансе:
// Если <НомерСеанса> и  <НачалоСеанса> совпадают с текущим,
// тогда выполнение в текущем сеансе, если нет,
// тогда проверяется существует ли сеанс в списке сеансов,
// если не существует, тогда выполнение в текущем сеансе,
// если существует тогда нет выполнения в текущем сеансе, а вместо этого
// проверятся период выполнения/простоя. Если "выполняется"/"простаивает" дольше
// 1 час происходит уведомление пользователя (ошибка с соответствующим описанием).
//  Логика порядка выполнения заданий. Задания выполняются последовательно,
// регистрируется последнее начатое задание. При новой проверке, проверятся
// задание, следующее за заданием, начатым в прошлый раз,
// чтобы получился эффект параллельности выполнения.
//  Логика проверки расписания. Если произошла ошибка тогда используется аварийное
// расписание, иначе - основное.
// 
// Параметры:
//  ВремяВыполнения - Число(10.0) - время (в секундах) выполнения очередной
//                 порции регламентных заданий. Если время не задано, будет выполнен
//                 только один цикл выполнения (до завершения одного фонового
//                 задания или выполнения всех регламентных заданий без фоновых,
//                 т.е. только проверка расписания).
//
Процедура ВыполнитьРегламентныеЗадания(ВремяВыполнения = 0) Экспорт
	
	Если НЕ ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ТекущийСеансВыполняетРегламентныеЗадания() Тогда
		Возврат;
	КонецЕсли;
	
	Состояние = ПолучитьСостояниеВыполненияРегламентныхЗаданий();
	
	// Разрешение вызова привилегированных функций на время выполнения регламентных заданий.
	ХранилищеОбщихНастроек.Сохранить("ВыполняетсяПроцедураВыполнитьРегламентныеЗадания", , Истина, , "");
	
	ВремяВыполнения = ?(ТипЗнч(ВремяВыполнения) = Тип("Число"), ВремяВыполнения, 0);

	Задания                        = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	ВыполнениеЗавершено            = Ложь; // Определяет, что ВремяВыполнения закончилось, или
	                                       // все возможные регламентные задания выполнены.
	НачалоВыполнения               = ТекущаяДата();
	КоличествоВыполненныхЗаданий   = 0;
	ФоновоеЗаданиеВыполнялось      = Ложь;
	ИдентификаторПоследнегоЗадания = Состояние.ИдентификаторОчередногоЗадания;

	// Количество заданий проверяется каждый раз при начале выполнения,
	// т.к. задания могут быть удалены в другом сеансе, а тогда будет зацикливание.
	Пока НЕ ВыполнениеЗавершено И Задания.Количество() > 0 Цикл
		ПервоеЗаданиеНайдено           = (ИдентификаторПоследнегоЗадания = Неопределено);
		ОчередноеЗаданиеНайдено        = Ложь;
		Для каждого Задание ИЗ Задания Цикл
			// Завершение выполнения, если:
			// а) время задано и вышло;
			// б) время не задано и хоть одно фоновое задание выполнено;
			// в) время не задано и все регламентные задания выполнены по количеству.
			Если ( ВремяВыполнения = 0 И
			       ( ФоновоеЗаданиеВыполнялось ИЛИ
			         КоличествоВыполненныхЗаданий >= Задания.Количество() ) ) ИЛИ
			     ( ВремяВыполнения <> 0 И
			       НачалоВыполнения + ВремяВыполнения <= ТекущаяДата() ) Тогда
				ВыполнениеЗавершено = Истина;
				Прервать;
			КонецЕсли;
			Если НЕ ПервоеЗаданиеНайдено Тогда
				Если Строка(Задание.УникальныйИдентификатор) = ИдентификаторПоследнегоЗадания Тогда
				   // Найдено последнее выполненное регламентное задание, значит следующее
				   // регламентное задание нужно проверять на необходимость выполнения фонового задания.
				   ПервоеЗаданиеНайдено = Истина;
				КонецЕсли;
				// Если первое регламентное задание, которое нужно проверить на необходимость
				// выполнения фонового задания ещё не найдено, тогда текущее задание пропускается.
				Продолжить;
			КонецЕсли;
			ОчередноеЗаданиеНайдено = Истина;
			КоличествоВыполненныхЗаданий = КоличествоВыполненныхЗаданий + 1;
			Состояние.ИдентификаторОчередногоЗадания       = Строка(Задание.УникальныйИдентификатор);
			Состояние.НачалоВыполненияОчередногоЗадания    = ТекущаяДата();
			Состояние.ОкончаниеВыполненияОчередногоЗадания = '00010101';
			СохранитьСостояниеВыполненияРегламентныхЗаданий(Состояние,
			                                               "ИдентификаторОчередногоЗадания,
			                                               |НачалоВыполненияОчередногоЗадания,
			                                               |ОкончаниеВыполненияОчередногоЗадания");
			Если Задание.Использование Тогда
				ВыполнитьРегламентноеЗадание = Ложь;
				СвойстваПоследнегоФоновогоЗадания = ПолучитьСвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(Задание);
				
				Если СвойстваПоследнегоФоновогоЗадания <> Неопределено И
				     СвойстваПоследнегоФоновогоЗадания.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
					// Проверка аварийного расписания.
					Если СвойстваПоследнегоФоновогоЗадания.ПопыткаЗапуска <= Задание.КоличествоПовторовПриАварийномЗавершении Тогда
						Если СвойстваПоследнегоФоновогоЗадания.Конец + Задание.ИнтервалПовтораПриАварийномЗавершении <= ТекущаяДата() Тогда
						    // Повторный запуск фонового задания по регламентному заданию.
						    ВыполнитьРегламентноеЗадание = Истина;
						КонецЕсли;
					КонецЕсли;
				Иначе
					// Проверяем стандартное расписание.
					ВыполнитьРегламентноеЗадание = Задание.Расписание.ТребуетсяВыполнение(
						ТекущаяДата(),
						?(СвойстваПоследнегоФоновогоЗадания = Неопределено, '00010101', СвойстваПоследнегоФоновогоЗадания.Начало),
						?(СвойстваПоследнегоФоновогоЗадания = Неопределено, '00010101', СвойстваПоследнегоФоновогоЗадания.Конец ));
				КонецЕсли;
				Если ВыполнитьРегламентноеЗадание Тогда
					ФоновоеЗаданиеВыполнялось = ВыполнитьРегламентноеЗадание(Задание);
				КонецЕсли;
			КонецЕсли;
			Состояние.ОкончаниеВыполненияОчередногоЗадания = ТекущаяДата();
			СохранитьСостояниеВыполненияРегламентныхЗаданий(Состояние, "ОкончаниеВыполненияОчередногоЗадания");
		КонецЦикла;
		// Если последнее выполненное задание найти не удалось, тогда
		// его Идентификатор сбрасывается,
		// чтобы начать проверку регламентных заданий, начиная с первого.
		ИдентификаторПоследнегоЗадания = Неопределено;
	КонецЦикла;
	
	// Запрет вызова привилегированных функций после выполнения регламентных заданий.
	ХранилищеОбщихНастроек.Сохранить("ВыполняетсяПроцедураВыполнитьРегламентныеЗадания", , Ложь, , "");
	
КонецПроцедуры

// Процедура УстановитьНастройкиВыполненияРегламентныхЗаданий устанавливает
// настройки выполнения регламентных заданий для файлового режима.
// 
// Параметры:
//  Настройки - Структура.
//
Процедура УстановитьНастройкиВыполненияРегламентныхЗаданий(Настройки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = ПроверитьНастройки(Настройки);
	
	ХранилищеОбщихНастроек.Сохранить("НастройкиВыполненияРегламентныхЗаданий", , Новый ХранилищеЗначения(Настройки), , "");
	
КонецПроцедуры

// Процедура ПолучитьНастройкиВыполненияРегламентныхЗаданий получает настройки
// настройки выполнения регламентных заданий для файлового режима.
// 
// Возвращаемое значение:
//  Настройки - Структура.
//
Функция ПолучитьНастройкиВыполненияРегламентныхЗаданий() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = ХранилищеОбщихНастроек.Загрузить("НастройкиВыполненияРегламентныхЗаданий", , , "");
	Настройки = ?(ТипЗнч(Настройки) = Тип("ХранилищеЗначения"), Настройки.Получить(), Неопределено);
	
	Возврат ПроверитьНастройки(Настройки);
	
КонецФункции

// Функция возвращает представление регламентного задания,
// это по порядку исключения незаполненных реквизитов:
// Наименование, Метаданные.Синоним, Метаданные.Имя.
//
// Параметры:
//  Задание      - РегламентноеЗадание, Строка - если строка, тогда УникальныйИдентификатор строкой.
//
// Возвращаемое значение:
//  Строка.
//
Функция ПредставлениеРегламентногоЗадания(Знач Задание) Экспорт
	
	ВызватьИсключениеЕслиНетПраваАдминистрирования();
	
	Если ТипЗнч(Задание) = Тип("РегламентноеЗадание") Тогда
		РегламентноеЗадание = Задание;
	Иначе
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Задание));
	КонецЕсли;
	
	Если РегламентноеЗадание <> Неопределено Тогда
		Представление = РегламентноеЗадание.Наименование;
		Если ПустаяСтрока(РегламентноеЗадание.Наименование) Тогда
			// Применим синоним вместо наименования
			Представление = РегламентноеЗадание.Метаданные.Синоним;
			Если ПустаяСтрока(Представление) Тогда
				// Применим имя вместо синонима
				Представление = РегламентноеЗадание.Метаданные.Имя;
			КонецЕсли
		КонецЕсли;
	Иначе
		Представление = ТекстНеОпределено();
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

// Служебная функция, возвращающая текст "<не определено>" с локализацией.
// Используется для целей локализации
//
Функция ТекстНеОпределено() Экспорт
	
	Возврат НСтр("ru = '<не определено>'");
	
КонецФункции

// Процедура ВыполнитьРегламентноеЗаданиеВручную предназначена для
// "ручного" немедленного выполнения процедуры регламентного задания
// либо в сеансе клиента (в файловой ИБ), либо в фоновом задании на сервере (в серверной ИБ)
// Применяется в любом режиме соединения
// "Ручной" режим запуска не влияет на выполнение регламентного задания по аварийному
// и основному расписаниям, т.к. не указывается ссылка на регламентное задание у фонового задания
// Тип ФоновоеЗадание не допускает установки такой ссылки, поэтому для файлового режима применяется
// тоже правило
// 
// Параметры:
//  Задание       -   РегламентноеЗадание, Строка - уникального идентификатора РегламентногоЗадания
//  МоментЗапуска -   Неопределено, Дата
//                    Для файловой ИБ устанавливает переданный момент, как момент запуска
//                    метода регламентного задания
//                    Для серверной ИБ - возвращает момент запуска фонового задания по факту
//  ИдентификаторФоновогоЗадания - Строка
//                    Для серверной ИБ возвращает идентификатор запущенного фонового задания
//  МоментОкончания - Неопределено, Дата
//                    Для файловой ИБ возвращает момент завершения метода регламентного задания
//
Функция ВыполнитьРегламентноеЗаданиеВручную(Знач Задание,
                                            МоментЗапуска = Неопределено,
                                            ИдентификаторФоновогоЗадания = "",
                                            МоментОкончания = Неопределено,
                                            НомерСеанса = Неопределено,
                                            НачалоСеанса = Неопределено,
                                            ПредставлениеФоновогоЗадания = "",
                                            ПроцедураУжеВыполняется = Неопределено) Экспорт
	
	ВызватьИсключениеЕслиНетПраваАдминистрирования();
	
	ПроцедураУжеВыполняется = Ложь;
	Задание = ?(ТипЗнч(Задание) = Тип("РегламентноеЗадание"), Задание, ПолучитьРегламентноеЗадание(Задание));
	Если НЕ Задание.Использование Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запуск = Ложь;
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Запуск = ВыполнитьРегламентноеЗадание(Задание, Истина, МоментЗапуска, МоментОкончания, НомерСеанса, НачалоСеанса);
	Иначе
		СвойстваПоследнегоФоновогоЗадания = ПолучитьСвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(Задание);
		Если СвойстваПоследнегоФоновогоЗадания <> Неопределено
		   И СвойстваПоследнегоФоновогоЗадания.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			//
			МоментЗапуска  = СвойстваПоследнегоФоновогоЗадания.Начало;
			Если ЗначениеЗаполнено(СвойстваПоследнегоФоновогоЗадания.Наименование) Тогда
				ПредставлениеФоновогоЗадания = СвойстваПоследнегоФоновогоЗадания.Наименование;
			Иначе
				ПредставлениеФоновогоЗадания = ПредставлениеРегламентногоЗадания(Задание);
			КонецЕсли;
		Иначе
			НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Запуск вручную: %1'"), ПредставлениеРегламентногоЗадания(Задание));
			ФоновоеЗадание = ФоновыеЗадания.Выполнить(Задание.Метаданные.ИмяМетода, Задание.Параметры, Строка(Задание.УникальныйИдентификатор), НаименованиеФоновогоЗадания);
			ИдентификаторФоновогоЗадания = Строка(ФоновоеЗадание.УникальныйИдентификатор);
			МоментЗапуска = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ФоновоеЗадание.УникальныйИдентификатор).Начало;
			Запуск = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ПроцедураУжеВыполняется = НЕ Запуск;
	
	Возврат Запуск;
	
КонецФункции

// Функция НужноУведомлятьОНекорректномВыполненииРегламентныхЗаданий возвращает
// значение флажка настройки выполнения регламентных заданий.
//
// Возвращаемое значение:
//  Булево.
//
Функция НужноУведомлятьОНекорректномВыполненииРегламентныхЗаданий(ПериодУведомления) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	УведомлятьОНекорректномСостоянии = Ложь;
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Настройки = ПолучитьНастройкиВыполненияРегламентныхЗаданий();
		ПериодУведомления = Настройки.ПериодУведомленияОНекорректномВыполненииРегламентныхЗаданий;
		ПериодУведомления = ?(ПериодУведомления <= 0, 1, ПериодУведомления);
		УведомлятьОНекорректномСостоянии = Настройки.УведомлятьОНекорректномВыполненииРегламентныхЗаданий;
	Иначе
		ПериодУведомления = 1;
	КонецЕсли;
	
	Возврат УведомлятьОНекорректномСостоянии;
	
КонецФункции

// Функция СообщенияИОписанияОшибокРегламентногоЗадания возвращает
// многострочную Строку содержащую Сообщения и ОписаниеИнформацииОбОшибке,
// последнее фоновое задание найдено по идентификатору регламентного задания
// и сообщения/ошибки есть.
//
// Параметры:
//  Задание      - РегламентноеЗадание, Строка - УникальныйИдентификатор
//                 РегламентногоЗадания строкой.
//
// Возвращаемое значение:
//  Строка.
//
Функция СообщенияИОписанияОшибокРегламентногоЗадания(Знач Задание) Экспорт
	
	ВызватьИсключениеЕслиНетПраваАдминистрирования();

	ИдентификаторРегламентногоЗадания = ?(ТипЗнч(Задание) = Тип("РегламентноеЗадание"), Строка(Задание.УникальныйИдентификатор), Задание);
	СвойстваПоследнегоФоновогоЗадания = ПолучитьСвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(ИдентификаторРегламентногоЗадания);
	Возврат ?(СвойстваПоследнегоФоновогоЗадания = Неопределено,
	          "",
	          СообщенияИОписанияОшибокФоновогоЗадания(СвойстваПоследнегоФоновогоЗадания.Идентификатор) );
	
КонецФункции

// Возвращает параметры запуска отдельного сеанса выполнения регламентных заданий.
//
// Параметры:
//  ПоНастройкеАвтоОткрытия - Булево - открывать сеанс, если настроен
//                 автоматический запуск отдельного сеанса и не серверная ИБ и не Веб-клиент и
//                 сеанс уже не открыт. В других случаях устанавливается Отказ.
//
// Возвращаемое значение:
//  Структура -    ТребуетсяОткрытьОтдельныйСеанс             - Булево - Истина.
//                 ДополнительныеПараметрыКоманднойСтроки     - Строка - дополнительные параметры командной строки для
//                                                              запуска сеанса выполнения регламентных заданий.
//                 ВыполненаПопыткаОткрытия                   - Булево - Ложь, для использования в вызывающей процедуре.
//                 УведомлятьОНекорректномВыполнении          - Булево.
//                 ПериодУведомления                          - Число.
//                 Отказ                                      - Булево.
//                 ОписаниеОшибки                             - Строка.
//
Функция ПараметрыЗапускаОтдельногоСеансаВыполненияРегламентныхЗаданий(Знач ПоНастройкеАвтоОткрытия = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура;
	Результат.Вставить("ТребуетсяОткрытьОтдельныйСеанс", Ложь);
	Результат.Вставить("ВыполненаПопыткаОткрытия", Ложь);
	Результат.Вставить("ДополнительныеПараметрыКоманднойСтроки", "");
	Результат.Вставить("УведомлятьОНекорректномВыполнении", Ложь);
	Результат.Вставить("ПериодУведомления", Неопределено);
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("ОписаниеОшибки", "");
	
	Если ПоНастройкеАвтоОткрытия Тогда
		Результат.Вставить("ТекущийПользовательАдминистратор", ПравоДоступа("Администрирование", Метаданные, ПользователиИнформационнойБазы.ТекущийПользователь()));
	КонецЕсли;
	
	Результат.УведомлятьОНекорректномВыполнении = НужноУведомлятьОНекорректномВыполненииРегламентныхЗаданий(Результат.ПериодУведомления);
	
	Настройки = ПолучитьНастройкиВыполненияРегламентныхЗаданий();
	Если ПоНастройкеАвтоОткрытия И НЕ Настройки.АвтоматическиЗапускатьОтдельныйСеансДляВыполненияРегламентныхЗаданий Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Если ПоНастройкеАвтоОткрытия Тогда
			Возврат Результат;
		Иначе
			Результат.Отказ = Истина;
			Результат.ОписаниеОшибки = НСтр("ru = 'Регламентные задания выполняются на сервере!'");
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;

	ЗаданияВыполняютсяНормально = Неопределено;
	ТекущийСеансВыполняетРегламентныеЗадания(ЗаданияВыполняютсяНормально);
	Если ЗаданияВыполняютсяНормально Тогда
		Если ПоНастройкеАвтоОткрытия Тогда
			Возврат Результат;
		Иначе
			Результат.Отказ = Истина;
			Результат.ОписаниеОшибки = НСтр("ru = 'Сеанс, выполняющий регламентные задания, уже открыт!'");
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	НомерТекущегоСеанса = НомерСеансаИнформационнойБазы();
	// Определение начала текущего сеанса.
	НачалоТекущегоСеанса = '00010101';
	Сеансы = ПолучитьСеансыИнформационнойБазы();
	Для каждого Сеанс Из Сеансы Цикл
		Если Сеанс.НомерСеанса = НомерТекущегоСеанса Тогда
			НачалоТекущегоСеанса = Сеанс.НачалоСеанса;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Результат.ДополнительныеПараметрыКоманднойСтроки = """"
		+ " /C""DoScheduledJobs SkipMessageBox AloneIBSession "
		+ "SessionNumber=" + НомерТекущегоСеанса + " SessionStarted=" + НачалоТекущегоСеанса + """";
	
	Результат.ТребуетсяОткрытьОтдельныйСеанс = Истина;
	
	Возврат Результат;
	
КонецФункции

// Процедура предназначена для внутреннего использования
Функция ПолучитьРасписаниеРегламентногоЗаданияВСтруктуре(Знач Идентификатор) Экспорт
	
	ВызватьИсключениеЕслиНетПраваАдминистрирования();
	
	Возврат ОбщегоНазначенияКлиентСервер.РасписаниеВСтруктуру(ПолучитьРегламентноеЗадание(Идентификатор).Расписание);
	
КонецФункции

// Процедура предназначена для внутреннего использования
Процедура УстановитьРасписаниеРегламентногоЗаданияИзСтруктуры(Знач Идентификатор, Знач РасписаниеВСтруктуре) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = ПолучитьРегламентноеЗадание(Идентификатор);
	Задание.Расписание = ОбщегоНазначенияКлиентСервер.СтруктураВРасписание(РасписаниеВСтруктуре);
	Задание.Записать();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции без поддержки модели сервиса.

// Возвращает использование регламентного задания.
// Перед вызовом требуется иметь право Администрирования или УстановитьПривилегированныйРежим.
// Не предназначена для использования в модели сервиса.
//
// Параметры:
//  Идентификатор - ОбъектМетаданных - объект метаданных регламентного задания для поиска
//                  предопределенного регламентного задания.
//                - УникальныйИдентификатор - идентификатор регламентного задания.
//                - Строка - строка уникального идентификатора регламентного задания.
//                - РегламентноеЗадание - регламентное задание.
//
// Возвращаемое значение:
//  Булево - если Истина, регламентное задание используется.
// 
Функция РегламентноеЗаданиеИспользуется(Знач Идентификатор) Экспорт
	
	ВызватьИсключениеЕслиНетПраваАдминистрирования();
	
	Задание = ПолучитьРегламентноеЗадание(Идентификатор);
	
	Возврат Задание.Использование;
	
КонецФункции

// Возвращает расписание регламентного задания.
// Перед вызовом требуется иметь право Администрирования или УстановитьПривилегированныйРежим.
// Не предназначена для использования в модели сервиса.
//
// Параметры:
//  Идентификатор - ОбъектМетаданных - объект метаданных регламентного задания для поиска
//                  предопределенного регламентного задания.
//                - УникальныйИдентификатор - идентификатор регламентного задания.
//                - Строка - строка уникального идентификатора регламентного задания.
//                - РегламентноеЗадание - регламентное задание.
//
//  ВСтруктуре    - Булево - если Истина, тогда расписание будет преобразовано
//                  в структуру, которую можно передать на клиент.
// 
// Возвращаемое значение:
//  РасписаниеРегламентногоЗадания, Структура - структура содержит те же свойства, что и расписание.
// 
Функция РасписаниеРегламентногоЗадания(Знач Идентификатор, Знач ВСтруктуре = Ложь) Экспорт
	
	ВызватьИсключениеЕслиНетПраваАдминистрирования();
	
	Задание = ПолучитьРегламентноеЗадание(Идентификатор);
	
	Если ВСтруктуре Тогда
		Возврат ОбщегоНазначенияКлиентСервер.РасписаниеВСтруктуру(Задание.Расписание);
	КонецЕсли;
	
	Возврат Задание.Расписание;
	
КонецФункции

// Устанавливает использование регламентного задания.
// Перед вызовом требуется иметь право Администрирования или УстановитьПривилегированныйРежим.
// Не предназначена для использования в модели сервиса.
//
// Параметры:
//  Идентификатор - ОбъектМетаданных        - объект метаданных регламентного задания для поиска
//                                            предопределенного регламентного задания.
//                - УникальныйИдентификатор - идентификатор регламентного задания.
//                - Строка                  - строка уникального идентификатора регламентного задания.
//                - РегламентноеЗадание     - регламентное задание.
//  Использование - Булево                  - значение использования которое нужно установить.
//
Процедура УстановитьИспользованиеРегламентногоЗадания(Знач Идентификатор, Знач Использование) Экспорт
	
	ВызватьИсключениеЕслиНетПраваАдминистрирования();
	
	Задание = ПолучитьРегламентноеЗадание(Идентификатор);
	
	Если Задание.Использование <> Использование Тогда
		Задание.Использование = Использование;
	КонецЕсли;
	
	Задание.Записать();
	
КонецПроцедуры

// Устанавливает расписание регламентного задания.
// Перед вызовом требуется иметь право Администрирования или УстановитьПривилегированныйРежим.
// Не предназначена для использования в модели сервиса.
//
// Параметры:
//  Идентификатор - ОбъектМетаданных - объект метаданных регламентного задания для поиска
//                  предопределенного регламентного задания.
//                - УникальныйИдентификатор - идентификатор регламентного задания.
//                - Строка - строка уникального идентификатора регламентного задания.
//                - РегламентноеЗадание - регламентное задание.
//
//  Расписание    - РасписаниеРегламентногоЗадания - расписание.
//                - Структура - значение возвращаемое функцией РасписаниеВСтруктуру
//                  общего модуля ОбщегоНазначенияКлиентСервер.
// 
Процедура УстановитьРасписаниеРегламентногоЗадания(Знач Идентификатор, Знач Расписание) Экспорт
	
	ВызватьИсключениеЕслиНетПраваАдминистрирования();
	
	Задание = ПолучитьРегламентноеЗадание(Идентификатор);
	
	Если ТипЗнч(Расписание) = Тип("РасписаниеРегламентногоЗадания") Тогда
		Задание.Расписание = Расписание;
	Иначе
		Задание.Расписание = ОбщегоНазначенияКлиентСервер.СтруктураВРасписание(Расписание);
	КонецЕсли;
	
	Задание.Записать();
	
КонецПроцедуры

// Возвращает РегламентноеЗадание из информационной базы.
// Не предназначена для использования в модели сервиса.
//
// Параметры:
//  Идентификатор - ОбъектМетаданных - объект метаданных регламентного задания для поиска
//                  предопределенного регламентного задания.
//                - УникальныйИдентификатор - идентификатор регламентного задания.
//                - Строка - строка уникального идентификатора регламентного задания.
//                - РегламентноеЗадание - регламентное задание из которого нужно получить
//                  уникальный идентификатор для получения свежей копии регламентного задания.
// 
// Возвращаемое значение:
//  РегламентноеЗадание - прочитано из базы данных.
//
Функция ПолучитьРегламентноеЗадание(Знач Идентификатор) Экспорт
	
	ВызватьИсключениеЕслиНетПраваАдминистрирования();
	
	Если ТипЗнч(Идентификатор) = Тип("РегламентноеЗадание") Тогда
		Идентификатор = Идентификатор.УникальныйИдентификатор;
	КонецЕсли;
	
	Если ТипЗнч(Идентификатор) = Тип("Строка") Тогда
		Идентификатор = Новый УникальныйИдентификатор(Идентификатор);
	КонецЕсли;
	
	Если ТипЗнч(Идентификатор) = Тип("ОбъектМетаданных") Тогда
		РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Идентификатор);
	Иначе
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	КонецЕсли;
	
	Если РегламентноеЗадание = Неопределено Тогда
		ВызватьИсключение( НСтр("ru = 'Регламентное задание не найдено.
		                              |Возможно, оно удалено другим пользователем.'") );
	КонецЕсли;
	
	Возврат РегламентноеЗадание;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ВНУТРЕННЕГО ИСПОЛЬЗОВАНИЯ
// Для работы с фоновыми заданиями
//

// Функция ПолучитьТаблицуСвойствФоновыхЗаданий() "эмулирует" функцию
// ФоновыеЗадания.ПолучитьФоновыеЗадания() для серверной и файловой ИБ.
//  Структуру таблицы  смотри в функции ПустаяТаблицаСвойствФоновыхЗаданий().
// 
// Параметры:
//  Отбор        - Структура - допустимые поля:
//                 УникальныйИдентификатор, Ключ, Состояние, Начало, Конец,
//                 Наименование, ИмяМетода, РегламентноеЗадание. 
//  ВсегоЗаданий - Число - возвращает общее количество заданий без учета отбора.
//  ПрочитанноеСостояние - Неопределено, только для внутреннего использования.
//
// Возвращаемое значение:
//  ТаблицаЗначений  - возвращается таблица после отбора.
//
Функция ПолучитьТаблицуСвойствФоновыхЗаданий(Отбор = Неопределено, ВсегоЗаданий = 0) Экспорт
	
	ВызватьИсключениеЕслиНетПраваАдминистрирования();
	
	Таблица = ПустаяТаблицаСвойствФоновыхЗаданий();
	
	Если Отбор <> Неопределено И Отбор.Свойство("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания") Тогда
		Отбор.Удалить("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания");
		ПолучитьПоследнее = Истина;
	Иначе
		ПолучитьПоследнее = Ложь;
	КонецЕсли;
	
	// Добавление истории фоновых заданий, полученных с сервера.
	Если НЕ ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Если Отбор <> Неопределено
		   И Отбор.Свойство("ИдентификаторРегламентногоЗадания")
		   И ЗначениеЗаполнено(Отбор.ИдентификаторРегламентногоЗадания) Тогда
			//
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Отбор.ИдентификаторРегламентногоЗадания));
			Если РегламентноеЗадание <> Неопределено Тогда
				ПоследнееФоновоеЗадание = РегламентноеЗадание.ПоследнееЗадание;
				Если ПолучитьПоследнее И ПоследнееФоновоеЗадание <> Неопределено Тогда
					МассивФоновыхЗаданий = Новый Массив;
					МассивФоновыхЗаданий.Добавить(ПоследнееФоновоеЗадание);
					ДобавитьСвойстваФоновыхЗаданий(МассивФоновыхЗаданий, Таблица);
				Иначе
					ПервыйОтбор = Новый Структура("РегламентноеЗадание", РегламентноеЗадание);
					ДобавитьСвойстваФоновыхЗаданий(ФоновыеЗадания.ПолучитьФоновыеЗадания(ПервыйОтбор), Таблица);
				КонецЕсли;
			КонецЕсли;
			ВторойОтбор = Новый Структура("Ключ", Отбор.ИдентификаторРегламентногоЗадания);
			ДобавитьСвойстваФоновыхЗаданий(ФоновыеЗадания.ПолучитьФоновыеЗадания(ВторойОтбор), Таблица);
		Иначе
			ДобавитьСвойстваФоновыхЗаданий(ФоновыеЗадания.ПолучитьФоновыеЗадания(), Таблица);
		КонецЕсли;
	КонецЕсли;
	
	// Добавление состояний регламентных заданий
	Для каждого РегламентноеЗадание Из РегламентныеЗадания.ПолучитьРегламентныеЗадания() Цикл
		ИдентификаторРегламентногоЗадания = Строка(РегламентноеЗадание.УникальныйИдентификатор);
		Свойства = ХранилищеОбщихНастроек.Загрузить("СостояниеРегламентногоЗадания_" + ИдентификаторРегламентногоЗадания, , , "");
		Свойства = ?(ТипЗнч(Свойства) = Тип("ХранилищеЗначения"), Свойства.Получить(), Неопределено);
		//
		Если ТипЗнч(Свойства) = Тип("Структура")
		   И Свойства.ИдентификаторРегламентногоЗадания = ИдентификаторРегламентногоЗадания
		   И Таблица.НайтиСтроки(Новый Структура("Идентификатор, НаСервере", Свойства.Идентификатор, Свойства.НаСервере)).Количество() = 0 Тогда
			//
			Если Свойства.НаСервере Тогда
				ХранилищеОбщихНастроек.Сохранить("СостояниеРегламентногоЗадания_" + ИдентификаторРегламентногоЗадания, , Неопределено, , "");
			Иначе
				Если Свойства.Состояние = СостояниеФоновогоЗадания.Активно Тогда
					НайденСеансВыполняющийЗадания = Ложь;
					Для каждого Сеанс Из ПолучитьСеансыИнформационнойБазы() Цикл
						Если Сеанс.НомерСеанса  = Свойства.НомерСеанса
						   И Сеанс.НачалоСеанса = Свойства.НачалоСеанса Тогда
							//
							НайденСеансВыполняющийЗадания = НомерСеансаИнформационнойБазы() <> Сеанс.НомерСеанса;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если НЕ НайденСеансВыполняющийЗадания Тогда
						Свойства.Конец = ТекущаяДата();
						Свойства.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно;
						Свойства.ОписаниеИнформацииОбОшибке = НСтр("ru = 'Не найден сеанс, выполняющий процедуру регламентного задания.'");
					КонецЕсли;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Свойства);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Таблица.Сортировать("Начало Убыв, Конец Убыв");
	
	ВсегоЗаданий = Таблица.Количество();
	
	// Отбор фоновых заданий.
	Если Отбор <> Неопределено Тогда
		Начало    = Неопределено;
		Конец     = Неопределено;
		Состояние = Неопределено;
		Если Отбор.Свойство("Начало") Тогда
			Начало = ?(ЗначениеЗаполнено(Отбор.Начало), Отбор.Начало, Неопределено);
			Отбор.Удалить("Начало");
		КонецЕсли;
		Если Отбор.Свойство("Конец") Тогда
			Конец = ?(ЗначениеЗаполнено(Отбор.Конец), Отбор.Конец, Неопределено);
			Отбор.Удалить("Конец");
		КонецЕсли;
		Если Отбор.Свойство("Состояние") Тогда
			Если ТипЗнч(Отбор.Состояние) = Тип("Массив") Тогда
				Состояние = Отбор.Состояние;
				Отбор.Удалить("Состояние");
			КонецЕсли;
		КонецЕсли;
		
		Если Отбор.Количество() <> 0 Тогда
			Строки = Таблица.НайтиСтроки(Отбор);
		Иначе
			Строки = Таблица;
		КонецЕсли;
		// Выполнение дополнительной фильтрации по периоду и состоянию (если отбор определен).
		НомерЭлемента = Строки.Количество() - 1;
		Пока НомерЭлемента >= 0 Цикл
			Если Начало    <> Неопределено И Начало > Строки[НомерЭлемента].Начало ИЛИ
				 Конец     <> Неопределено И Конец  < ?(ЗначениеЗаполнено(Строки[НомерЭлемента].Конец), Строки[НомерЭлемента].Конец, ТекущаяДата()) ИЛИ
				 Состояние <> Неопределено И Состояние.Найти(Строки[НомерЭлемента].Состояние) = Неопределено Тогда
				Строки.Удалить(НомерЭлемента);
			КонецЕсли;
			НомерЭлемента = НомерЭлемента - 1;
		КонецЦикла;
		// Удаление лишних строк из таблицы.
		Если ТипЗнч(Строки) = Тип("Массив") Тогда
			НомерСтроки = ВсегоЗаданий - 1;
			Пока НомерСтроки >= 0 Цикл
				Если Строки.Найти(Таблица[НомерСтроки]) = Неопределено Тогда
					Таблица.Удалить(Таблица[НомерСтроки]);
				КонецЕсли;
				НомерСтроки = НомерСтроки - 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

// Функция возвращает свойства ФоновогоЗадания по строке уникального идентификатора.
//
// Параметры:
//  Идентификатор - Строка - уникального идентификатора ФоновогоЗадания.
//  ИменаСвойств  - Строка, если заполнено, возвращается структура с указанными свойствами.
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Структура - свойства ФоновогоЗадания.
//
Функция ПолучитьСвойстваФоновогоЗадания(Идентификатор, ИменаСвойств = "") Экспорт
	
	ВызватьИсключениеЕслиНетПраваАдминистрирования();
	
	Отбор = Новый Структура("Идентификатор", Идентификатор);
	ТаблицаСвойствФоновыхЗаданий = ПолучитьТаблицуСвойствФоновыхЗаданий(Отбор);
	
	Если ТаблицаСвойствФоновыхЗаданий.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(ИменаСвойств) Тогда
			Результат = Новый Структура(ИменаСвойств);
			ЗаполнитьЗначенияСвойств(Результат, ТаблицаСвойствФоновыхЗаданий[0]);
		Иначе
			Результат = ТаблицаСвойствФоновыхЗаданий[0];
		КонецЕсли;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция ПолучитьСвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания возвращает
// свойства последнего фонового задания выполненного при выполнении регламентного задания, если оно есть.
// Процедура работает, как в файл-серверном, так и в клиент-серверном режимах.
//
// Параметры:
//  РегламентноеЗадание - РегламентноеЗадание, Строка - строка уникального идентификатора РегламентногоЗадания.
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено.
//
Функция ПолучитьСвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(РегламентноеЗадание) Экспорт
	
	ВызватьИсключениеЕслиНетПраваАдминистрирования();
	
	ИдентификаторРегламентногоЗадания = ?(ТипЗнч(РегламентноеЗадание) = Тип("РегламентноеЗадание"), Строка(РегламентноеЗадание.УникальныйИдентификатор), РегламентноеЗадание);
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторРегламентногоЗадания", ИдентификаторРегламентногоЗадания);
	Отбор.Вставить("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания");
	ТаблицаСвойствФоновыхЗаданий = ПолучитьТаблицуСвойствФоновыхЗаданий(Отбор);
	ТаблицаСвойствФоновыхЗаданий.Сортировать("Конец Возр");
	
	Если ТаблицаСвойствФоновыхЗаданий.Количество() = 0 Тогда
		СвойстваФоновогоЗадания = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(ТаблицаСвойствФоновыхЗаданий[0].Конец) Тогда
		СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[0];
	Иначе
		СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[ТаблицаСвойствФоновыхЗаданий.Количество()-1];
	КонецЕсли;
	
	СохраняемоеЗначение = Новый ХранилищеЗначения(?(СвойстваФоновогоЗадания = Неопределено, Неопределено, ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СвойстваФоновогоЗадания)));
	ХранилищеОбщихНастроек.Сохранить("СостояниеРегламентногоЗадания_" + ИдентификаторРегламентногоЗадания, , СохраняемоеЗначение, , "");
	
	Возврат СвойстваФоновогоЗадания;
	
КонецФункции

// Процедура ОтменитьФоновоеЗадание отменяет фоновое задание, если
// это возможно, а именно, если оно выполняется на сервере, и активно.
//
// Параметры:
//  Идентификатор  - Строка уникального идентификатора ФоновогоЗадания.
// 
// Возвращаемое значение:
//  Булево       - НЕ Отказ.
//
Процедура ОтменитьФоновоеЗадание(Идентификатор) Экспорт
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		ВызватьИсключение( НСтр("ru ='Фоновые задания не используются
		                             |в файловой информационной базе.'"));
	КонецЕсли;
	
	ВызватьИсключениеЕслиНетПраваАдминистрирования();
	
	Отбор = Новый Структура("УникальныйИдентификатор", Новый УникальныйИдентификатор(Идентификатор));
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если МассивФоновыхЗаданий.Количество() = 1 Тогда
		ФоновоеЗадание = МассивФоновыхЗаданий[0];
	Иначе
		ВызватьИсключение( НСтр("ru = 'Фоновое задание не найдено на сервере!'") );
	КонецЕсли;
	
	Если ФоновоеЗадание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда
		ВызватьИсключение( НСтр("ru = 'Задание не выполняется, его нельзя отменить!'") );
	КонецЕсли;
	
	ФоновоеЗадание.Отменить();
	
КонецПроцедуры

// Функция СообщенияИОписанияОшибокФоновогоЗадания возвращает
// многострочную Строку содержащую Сообщения и ОписаниеИнформацииОбОшибке,
// если фоновое задание найдено по идентификатору и сообщения/ошибки есть.
//
// Параметры:
//  Задание      - Строка - УникальныйИдентификатор ФоновогоЗадания строкой.
//
// Возвращаемое значение:
//  Строка.
//
Функция СообщенияИОписанияОшибокФоновогоЗадания(Идентификатор, СвойстваФоновогоЗадания = Неопределено) Экспорт
	
	ВызватьИсключениеЕслиНетПраваАдминистрирования();
	
	Если СвойстваФоновогоЗадания = Неопределено Тогда
		СвойстваФоновогоЗадания = ПолучитьСвойстваФоновогоЗадания(Идентификатор);
	КонецЕсли;
	
	Строка = "";
	Если СвойстваФоновогоЗадания <> Неопределено Тогда
		Для каждого Сообщение Из СвойстваФоновогоЗадания.СообщенияПользователю Цикл
			Строка = Строка + ?(Строка = "",
			                    Сообщение,
			                    "
			                    |
			                    |" + Сообщение);
		КонецЦикла;
		Если ЗначениеЗаполнено(СвойстваФоновогоЗадания.ОписаниеИнформацииОбОшибке) Тогда
			Строка = Строка + ?(Строка = "",
			                    СвойстваФоновогоЗадания.ОписаниеИнформацииОбОшибке,
			                    "
			                    |
			                    |" + СвойстваФоновогоЗадания.ОписаниеИнформацииОбОшибке);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Строка;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ МОДУЛЯ
//

// Функция ПустаяТаблицаСвойствФоновыхЗаданий.
//
// Возвращаемое значение:
//  ТаблицаЗначений.
//
Функция ПустаяТаблицаСвойствФоновыхЗаданий()
	
	НоваяТаблица = Новый ТаблицаЗначений;
	НоваяТаблица.Колонки.Добавить("НаСервере",                         Новый ОписаниеТипов("Булево"));
	НоваяТаблица.Колонки.Добавить("Идентификатор",                     Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Наименование",                      Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Ключ",                              Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Начало",                            Новый ОписаниеТипов("Дата"));
	НоваяТаблица.Колонки.Добавить("Конец",                             Новый ОписаниеТипов("Дата"));
	НоваяТаблица.Колонки.Добавить("ИдентификаторРегламентногоЗадания", Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Состояние",                         Новый ОписаниеТипов("СостояниеФоновогоЗадания"));
	НоваяТаблица.Колонки.Добавить("ИмяМетода",                         Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Расположение",                      Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("ОписаниеИнформацииОбОшибке",        Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("ПопыткаЗапуска",                    Новый ОписаниеТипов("Число"));
	НоваяТаблица.Колонки.Добавить("СообщенияПользователю",             Новый ОписаниеТипов("Массив"));
	НоваяТаблица.Колонки.Добавить("НомерСеанса",                       Новый ОписаниеТипов("Число"));
	НоваяТаблица.Колонки.Добавить("НачалоСеанса",                      Новый ОписаниеТипов("Дата"));
	НоваяТаблица.Индексы.Добавить("Идентификатор, Начало");
	
	Возврат НоваяТаблица;
	
КонецФункции

// Функция ПроверитьНастройки служит для заполнения/восстановления структуры свойств
// настроек, хранимых в структуре "Состояние" свойства Настройки.
//
// Параметры:
//  Настройки - Неопределено, Структура.
//
// Возвращаемое значение:
//  Структура - обновленные настройки.
//
Функция ПроверитьНастройки(Знач Настройки = Неопределено)
	
	НоваяСтруктураНастроек = Новый Структура();
	// Если нужно и можно, то при запуске клиентского приложения автоматически открывать сеанс выполнения регламентных заданий.
	НоваяСтруктураНастроек.Вставить("АвтоматическиЗапускатьОтдельныйСеансДляВыполненияРегламентныхЗаданий", Ложь);
	// Если задания не выполняются или выполнение "висит", уведомлять пользователя.
	НоваяСтруктураНастроек.Вставить("УведомлятьОНекорректномВыполненииРегламентныхЗаданий",                 Ложь);
	//  Период, минут.
	НоваяСтруктураНастроек.Вставить("ПериодУведомленияОНекорректномВыполненииРегламентныхЗаданий",          15);
	
	// Копирование существующих свойств.
	Если ТипЗнч(Настройки) = Тип("Структура") Тогда
		Для каждого КлючИзначение Из НоваяСтруктураНастроек Цикл
			Если Настройки.Свойство(КлючИзначение.Ключ) Тогда
				Если ТипЗнч(НоваяСтруктураНастроек[КлючИзначение.Ключ]) = ТипЗнч(Настройки[КлючИзначение.Ключ]) Тогда
					НоваяСтруктураНастроек[КлючИзначение.Ключ] = Настройки[КлючИзначение.Ключ];
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ (НоваяСтруктураНастроек.ПериодУведомленияОНекорректномВыполненииРегламентныхЗаданий >= 1 И
	         НоваяСтруктураНастроек.ПериодУведомленияОНекорректномВыполненииРегламентныхЗаданий <= 99 ) Тогда
	
		НоваяСтруктураНастроек.ПериодУведомленияОНекорректномВыполненииРегламентныхЗаданий = 15;
	КонецЕсли;
	
	Возврат НоваяСтруктураНастроек;
	
КонецФункции

// Функция ПолучитьСостояниеВыполненияРегламентныхЗаданий возвращает
// структуру, описывающую состояние выполнения регламентных заданий.
//
Функция ПолучитьСостояниеВыполненияРегламентныхЗаданий(Заблокировать = Ложь)
	
	// Подготовка данных для проверки или начальной установки свойств прочитанного состояния.
	НоваяСтруктура = Новый Структура();
	// Хранение истории выполнения фоновых заданий.
	НоваяСтруктура.Вставить("НомерСеанса",                          0);
	НоваяСтруктура.Вставить("НачалоСеанса",                         '00010101');
	НоваяСтруктура.Вставить("ИмяКомпьютера",                        "");
	НоваяСтруктура.Вставить("ИмяПриложения",                        "");
	НоваяСтруктура.Вставить("ИмяПользователя",                      "");
	НоваяСтруктура.Вставить("ИдентификаторОчередногоЗадания",       "");
	НоваяСтруктура.Вставить("НачалоВыполненияОчередногоЗадания",    '00010101');
	НоваяСтруктура.Вставить("ОкончаниеВыполненияОчередногоЗадания", '00010101');
	
	Состояние = ХранилищеОбщихНастроек.Загрузить("СостояниеВыполненияРегламентныхЗаданий", , , "");
	Состояние = ?(ТипЗнч(Состояние) = Тип("ХранилищеЗначения"), Состояние.Получить(), Неопределено);
	
	// Копирование существующих свойств.
	Если ТипЗнч(Состояние) = Тип(НоваяСтруктура) Тогда
		Для каждого КлючИзначение Из НоваяСтруктура Цикл
			Если Состояние.Свойство(КлючИзначение.Ключ) Тогда
				Если ТипЗнч(НоваяСтруктура[КлючИзначение.Ключ]) = ТипЗнч(Состояние[КлючИзначение.Ключ]) Тогда
					НоваяСтруктура[КлючИзначение.Ключ] = Состояние[КлючИзначение.Ключ];
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат НоваяСтруктура;
	
КонецФункции

// Процедура СохранитьСостояниеВыполненияРегламентныхЗаданий() сохраняет
// в структуре СостояниеВыполненияРегламентныхЗаданий переданное состояние.
//
// Параметры:
//  Состояние - Структура - изменённое значение функции
//                 ПолучитьСостояниеВыполненияРегламентныхЗаданий().
//  ИзмененныеСвойства - Неопределено, Строка;
//                       Неопределено - требуется записать состояние, иначе сохранить только указанные свойства
//                       Строка       - список имен свойств, разделенный запятыми,
//                                      которые необходимо сохранить
//
Процедура СохранитьСостояниеВыполненияРегламентныхЗаданий(Состояние, Знач ИзмененныеСвойства = Неопределено)
	
	Если ИзмененныеСвойства <> Неопределено Тогда
		ТекущееСостояние = ПолучитьСостояниеВыполненияРегламентныхЗаданий();
		ЗаполнитьЗначенияСвойств(ТекущееСостояние, Состояние, ИзмененныеСвойства);
		Состояние = ТекущееСостояние;
	КонецЕсли;
	
	ХранилищеОбщихНастроек.Сохранить("СостояниеВыполненияРегламентныхЗаданий", , Новый ХранилищеЗначения(Состояние), , "");
	
КонецПроцедуры

// Функция ВыполнитьРегламентноеЗадание предназначена
// только для режима "файл-сервер", используется в процедуре
// ВыполнитьРегламентныеЗадания()
// 
// Параметры:
//  Состояние       - Структура.
//  Задание         - РегламентноеЗадание.
//  ЗапускВручную   - Булево.
//  МоментЗапуска   - Неопределено, Дата - Устанавливает момент запуска или возвращает момент запуска
//  МоментОкончания - Неопределено, Дата - Возвращает момент окончание
//
// Возвращаемое значение
//  Булево. Если Ложь, значит процедура регламентного задания уже выполняется
//
Функция ВыполнитьРегламентноеЗадание(Знач Задание,
                                     Знач ЗапускВручную = Ложь,
                                     МоментЗапуска = Неопределено,
                                     МоментОкончания = Неопределено,
                                     НомерСеанса = Неопределено,
                                     НачалоСеанса = Неопределено)
	
	СвойстваПоследнегоФоновогоЗадания = ПолучитьСвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(Задание);
	
	Если СвойстваПоследнегоФоновогоЗадания <> Неопределено
	   И СвойстваПоследнегоФоновогоЗадания.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		//
		НомерСеанса  = СвойстваПоследнегоФоновогоЗадания.НомерСеанса;
		НачалоСеанса = СвойстваПоследнегоФоновогоЗадания.НачалоСеанса;
		Возврат Ложь;
	КонецЕсли;
	
	ИмяМетода = Задание.Метаданные.ИмяМетода;
	НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		?(ЗапускВручную,
		  НСтр("ru = 'Запуск вручную: %1'"),
		  НСтр("ru = 'Автозапуск: %1'")),
		ПредставлениеРегламентногоЗадания(Задание));
	
	МоментЗапуска = ?(ТипЗнч(МоментЗапуска) <> Тип("Дата") ИЛИ НЕ ЗначениеЗаполнено(МоментЗапуска), ТекущаяДата(), МоментЗапуска);
	
	// Создание свойств нового фонового псевдо задания
	СвойстваФоновогоЗадания = ПустаяТаблицаСвойствФоновыхЗаданий().Добавить();
	СвойстваФоновогоЗадания.Идентификатор  = Строка(Новый УникальныйИдентификатор());
	СвойстваФоновогоЗадания.ПопыткаЗапуска = ?(СвойстваПоследнегоФоновогоЗадания <> Неопределено И
											   СвойстваПоследнегоФоновогоЗадания.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно,
											   СвойстваПоследнегоФоновогоЗадания.ПопыткаЗапуска + 1,
											   1);
	СвойстваФоновогоЗадания.Наименование                      = НаименованиеФоновогоЗадания;
	СвойстваФоновогоЗадания.ИдентификаторРегламентногоЗадания = Строка(Задание.УникальныйИдентификатор);
	СвойстваФоновогоЗадания.Расположение                      = "\\" + ИмяКомпьютера();
	СвойстваФоновогоЗадания.ИмяМетода                         = ИмяМетода;
	СвойстваФоновогоЗадания.Состояние                         = СостояниеФоновогоЗадания.Активно;
	СвойстваФоновогоЗадания.Начало                            = МоментЗапуска;
	СвойстваФоновогоЗадания.НомерСеанса                       = НомерСеансаИнформационнойБазы();
	Для каждого Сеанс Из ПолучитьСеансыИнформационнойБазы() Цикл
		Если Сеанс.НомерСеанса = СвойстваФоновогоЗадания.НомерСеанса Тогда
			СвойстваФоновогоЗадания.НачалоСеанса = Сеанс.НачалоСеанса;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	// Подготовка команды для выполнения метода вместо фонового задания.
	СтрокаПараметров = "";
	Индекс = 0;
	Пока Индекс < Задание.Параметры.Количество() Цикл
		СтрокаПараметров = СтрокаПараметров + "Задание.Параметры[" + Индекс + "]";
		Если Индекс < (Задание.Параметры.Количество()-1) Тогда
			СтрокаПараметров = СтрокаПараметров + ",";
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	// Сохранение информации о запуске
	СохраняемоеЗначение = Новый ХранилищеЗначения(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СвойстваФоновогоЗадания));
	ХранилищеОбщихНастроек.Сохранить("СостояниеРегламентногоЗадания_" + Строка(Задание.УникальныйИдентификатор), , СохраняемоеЗначение, , "");
	
	ПолучитьСообщенияПользователю(Истина);
	Попытка
		Выполнить("" + ИмяМетода + "(" + СтрокаПараметров + ");");
		СвойстваФоновогоЗадания.Состояние = СостояниеФоновогоЗадания.Завершено;
	Исключение
		СвойстваФоновогоЗадания.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно;
		СвойстваФоновогоЗадания.ОписаниеИнформацииОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	// Фиксация окончания выполнения метода.
	МоментОкончания = ТекущаяДата();
	СвойстваФоновогоЗадания.Конец = МоментОкончания;
	СвойстваФоновогоЗадания.СообщенияПользователю = ПолучитьСообщенияПользователю(Истина);
	
	Свойства = ХранилищеОбщихНастроек.Загрузить("СостояниеРегламентногоЗадания_" + Строка(Задание.УникальныйИдентификатор), , , "");
	Свойства = ?(ТипЗнч(Свойства) = Тип("ХранилищеЗначения"), Свойства.Получить(), Неопределено);
	
	Если Свойства.НомерСеанса = СвойстваФоновогоЗадания.НомерСеанса
	   И Свойства.НачалоСеанса = СвойстваФоновогоЗадания.НачалоСеанса Тогда
		// Маловероятной перезаписи из-за отсутствия блокировки не произошло, поэтому можно записать свойства
		СохраняемоеЗначение = Новый ХранилищеЗначения(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СвойстваФоновогоЗадания));
		ХранилищеОбщихНастроек.Сохранить("СостояниеРегламентногоЗадания_" + Строка(Задание.УникальныйИдентификатор), , СохраняемоеЗначение, , "");
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ДобавитьСвойстваФоновыхЗаданий(Знач МассивФоновыхЗаданий, Знач ТаблицаСвойствФоновыхЗаданий)
	
	Индекс = МассивФоновыхЗаданий.Количество() - 1;
	Пока Индекс >= 0 Цикл
		ФоновоеЗадание = МассивФоновыхЗаданий[Индекс];
		Строка = ТаблицаСвойствФоновыхЗаданий.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, ФоновоеЗадание);
		Строка.НаСервере = Истина;
		Строка.Идентификатор = ФоновоеЗадание.УникальныйИдентификатор;
		РегламентноеЗадание = ФоновоеЗадание.РегламентноеЗадание;
		Если РегламентноеЗадание = Неопределено
		   И СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ФоновоеЗадание.Ключ) Тогда
			//
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ФоновоеЗадание.Ключ));
		КонецЕсли;
		Строка.ИдентификаторРегламентногоЗадания = ?(РегламентноеЗадание = Неопределено, "", РегламентноеЗадание.УникальныйИдентификатор);
		Строка.ОписаниеИнформацииОбОшибке = ?(ФоновоеЗадание.ИнформацияОбОшибке = Неопределено, "", ПодробноеПредставлениеОшибки(ФоновоеЗадание.ИнформацияОбОшибке));
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры

// Обработчик регзадания ОтчетПоОшибкамВЖурналеРегистрации
//
// Параметры:
//  ДатаОтчета	 - Дата - дата и время получения данных ЖР
//  Интервал	 - Число - время в секундах, за которое необходимо сформировать отчет
//
Процедура СформироватьОтчетПоОшибкамИзЖР(ДатаОтчета = Неопределено, Интервал = 610) Экспорт
	
	Если ДатаОтчета = Неопределено Тогда
		ДатаОтчета = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ДатаНачала		= ДатаОтчета - Интервал;
	ДатаОкончания	= ДатаОтчета;
	
	УровеньДляОтбора = Новый СписокЗначений;
	УровеньДляОтбора.Добавить("Ошибка", "Ошибка");
	
	Отбор = Новый Структура;
	Отбор.Вставить("Уровень"		, УровеньДляОтбора);
	Отбор.Вставить("ДатаНачала"		, ДатаНачала);
	Отбор.Вставить("ДатаОкончания"	, ДатаОкончания);
	
	ОтчетПоЖурналуРегистрации = Отчеты.ОтчетПоЖурналуРегистрации.Создать();
	
	ОтчетЖР = ОтчетПоЖурналуРегистрации.СформироватьОтчет(Отбор);
	ОтчетЖРВ = РегистрыСведений.ЖурналРегистрацииВызовов.ОтчетЖРВ(ДатаНачала, ДатаОкончания);
	
	Если ОтчетЖР = Неопределено И ОтчетЖРВ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПостфиксНаименованияФайла = СтрШаблон("-%1_%2_%3_%4.xlsx",
		Метаданные.Имя,
		Формат(ДатаОтчета, "ДФ=""ддММгггг"""),
		Формат(ДатаОтчета, "ДФ=""ЧЧ-мм"""),
		Формат(Интервал, "ЧГ=0"));
	
	ТекстПисьма = "";
	СписокВложений = Новый Соответствие;
	ИмяВременногоКаталога = КаталогВременныхФайлов();
	
	Если ОтчетЖРВ <> Неопределено Тогда
		ИмяФайлаОтчетЖРВ = "ОтчетПоЖРВ" + ПостфиксНаименованияФайла;
		ПутьКФайлуОтчетЖРВ = ИмяВременногоКаталога + ИмяФайлаОтчетЖРВ;
		
		ОтчетЖРВ.Записать(ПутьКФайлуОтчетЖРВ, ТипФайлаТабличногоДокумента.XLSX);
		СписокВложений.Вставить(ИмяФайлаОтчетЖРВ, Новый ДвоичныеДанные(ПутьКФайлуОтчетЖРВ));
		УдалитьФайлы(ПутьКФайлуОтчетЖРВ);
		
		ТекстПисьма = ТекстПисьма +
		"<HTML>
		|<BODY STYLE=""font-size: 12pt; "">
		|<P>Обнаружены ошибки в журнале регистрации вызовов. Подробности во вложении.</P>
		|</BODY>
		|</HTML>";
	КонецЕсли;
	
	Если ОтчетЖР <> Неопределено Тогда
		ИмяФайлаОтчетЖР = "ОтчетПоЖР" + ПостфиксНаименованияФайла;
		ПутьКФайлуОтчетЖР = ИмяВременногоКаталога + ИмяФайлаОтчетЖР;
		
		ОтчетЖР.Записать(ПутьКФайлуОтчетЖР, ТипФайлаТабличногоДокумента.XLSX);
		СписокВложений.Вставить(ИмяФайлаОтчетЖР, Новый ДвоичныеДанные(ПутьКФайлуОтчетЖР));
		УдалитьФайлы(ПутьКФайлуОтчетЖР);
		
		ПутьКФайлуHTML = ПутьКФайлуОтчетЖР + ".html";
		ОтчетЖР.Записать(ПутьКФайлуHTML, ТипФайлаТабличногоДокумента.HTML);
		ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлуHTML);
		ТекстПисьма = ТекстПисьма + ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();
		УдалитьФайлы(ПутьКФайлуHTML);
	КонецЕсли;
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("ТекстПисьма"		, ТекстПисьма);
	ПараметрыУведомления.Вставить("Вложения"		, СписокВложений);
	ПараметрыУведомления.Вставить("Важность"		, ВажностьИнтернетПочтовогоСообщения.Обычная);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма"	, ТипТекстаПочтовогоСообщения.HTML);
	ПараметрыУведомления.Вставить("Кодировка"		, "UTF-8");
	
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(
		ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаОтчетовОшибкиЖР).Настройка;
	ПараметрыУведомления.Вставить("НастройкиОбмена", НастройкиОбмена);
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
	
КонецПроцедуры

Функция ИнтернетПисьмоУведомленияКОтправке(ПараметрыУведомления, ЭтоТестоваяБаза) Экспорт
	Перем Профиль, ИнтернетПочта;
	
	НастройкаОбмена	= ПараметрыУведомления["НастройкиОбмена"];
	АктуальнаяУчетнаяЗапись = Справочники.НастройкиОбменаДанными.АктуальнаяУчетнаяЗаписьПриемаОтправкиСообщений(НастройкаОбмена);
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(АктуальнаяУчетнаяЗапись);
	
	АдресОтправителя = АктуальнаяУчетнаяЗапись.АдресЭлектроннойПочты;
	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	
	// Установим кодировки письма
	Письмо.Кодировка						= ПараметрыУведомления["Кодировка"];
	Письмо.СпособКодированияНеASCIIСимволов = СпособКодированияНеASCIIСимволовИнтернетПочтовогоСообщения.MIME;
	// Установим параметры отправителя
	Письмо.Отправитель.Адрес				= АдресОтправителя;
	Письмо.Отправитель.ОтображаемоеИмя		= Письмо.ИмяОтправителя;
	ПозицияСимвола							= Найти(АдресОтправителя, "@");
	Письмо.ИмяОтправителя					= ?(ПозицияСимвола > 0, Лев(АдресОтправителя,ПозицияСимвола-1), АдресОтправителя);
	Если ПозицияСимвола > 0 Тогда
		Письмо.Отправитель.Сервер		= Прав(АдресОтправителя, СтрДлина(АдресОтправителя) - ПозицияСимвола);
		Письмо.Отправитель.Пользователь = Письмо.ИмяОтправителя;
	КонецЕсли;
	// Установим тему письма исходя из настроек параметров
	ТемаПоПараметрам = НастройкаОбмена.Параметры.Найти("Тема письма", "Наименование");
	Если ТемаПоПараметрам <> Неопределено Тогда
		Письмо.Тема = ТемаПоПараметрам.Значение;
		УведомлениеUAT = "(Отправлено с UAT)";
		Если ЭтоТестоваяБаза И Найти(Письмо.Тема, УведомлениеUAT) = 0 Тогда
			Письмо.Тема = Письмо.Тема + " " + УведомлениеUAT;	
		КонецЕсли;
	Иначе
		Если ПараметрыУведомления.Получить("ТемаПисьма") = Неопределено Тогда
			Письмо.Тема = "Письмо из базы: "+Метаданные.Имя+" - от: "+ТекущаяДата();
		Иначе
			Письмо.Тема = ПараметрыУведомления["ТемаПисьма"];
		КонецЕсли;
	КонецЕсли;
    // Установим получателей и адреса скрытых копий
	ПолучателиСтрока	= НастройкаОбмена.АдресПолучателя;
	КопииСтрокой		= НастройкаОбмена.АдресПолучателяКопии;
	//---
	Если ЗначениеЗаполнено(ПолучателиСтрока) Тогда
		МассивАдресовПолучателей = ПроцедурыУправленияПерсоналом.РазложитьСтрокуВМассивПодстрок(ПолучателиСтрока, ";");
		Для Каждого АдресПолучателя Из МассивАдресовПолучателей Цикл
			Письмо.Получатели.Добавить(СокрЛП(АдресПолучателя));
		КонецЦикла;
	КонецЕсли;
	//---
	Если ЗначениеЗаполнено(КопииСтрокой) Тогда
		МассивАдресовПолучателей = ПроцедурыУправленияПерсоналом.РазложитьСтрокуВМассивПодстрок(КопииСтрокой, ";");
		Для Каждого АдресПолучателя Из МассивАдресовПолучателей Цикл
			Письмо.СлепыеКопии.Добавить(СокрЛП(АдресПолучателя));
		КонецЦикла;
	КонецЕсли;
	// Установим текст письма
	Если Не ПараметрыУведомления["ТекстПисьма"]=Неопределено Тогда
		Письмо.Тексты.Добавить(ПараметрыУведомления["ТекстПисьма"], ПараметрыУведомления["ТипТекстаПисьма"]);
	КонецЕсли;
	// Установим прочие параметры письма
	Если Не ПараметрыУведомления["Важность"]=Неопределено Тогда
		Письмо.Важность	= ПараметрыУведомления["Важность"];
	КонецЕсли;	
	// Добавим вложения	
	Если Не ПараметрыУведомления["Вложения"]=Неопределено Тогда
		Если ТипЗнч(ПараметрыУведомления["Вложения"]) = Тип("Соответствие") Тогда
			Для Каждого Вложение Из ПараметрыУведомления["Вложения"] Цикл
				Письмо.Вложения.Добавить(Вложение.Значение, Вложение.Ключ);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
    //---
	Письмо.ОбработатьТексты();
	//---
	ИнтернетПочта = Новый ИнтернетПочта;
	//---
	Попытка
		ИнтернетПочта.Подключиться(Профиль);
		ИнтернетПочта.Послать(Письмо);
		ИнтернетПочта.Отключиться();
	Исключение
		ЗаписьЖурналаРегистрации(ОписаниеОшибки(), УровеньЖурналаРегистрации.Ошибка);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

Процедура РассылкаУведомленийКОтправке(ОтправляемыеУведомления = Неопределено) Экспорт
	
	ОграничениеПопытокОтправки = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("2400.ОграничениеПопытокОтправкиПочтовыхСообщений");
	
	Если Не ЗначениеЗаполнено(ОтправляемыеУведомления) Тогда
		// Читаем записи к отправке
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УведомленияКОтправке.ИДУведомления КАК ИДУведомления
		|ИЗ
		|	РегистрСведений.УведомленияКОтправке КАК УведомленияКОтправке
		|ГДЕ
		|	УведомленияКОтправке.ПопытокОтправки < &ОграничениеПопытокОтправки
		|	И НЕ УведомленияКОтправке.ОшибкаПриОтправке";
		
		Запрос.УстановитьПараметр("ОграничениеПопытокОтправки", ОграничениеПопытокОтправки);
		ОтправляемыеУведомления = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	ЗаписьУведомления = РегистрыСведений.УведомленияКОтправке.СоздатьМенеджерЗаписи();
	ЭтоТестоваяБаза = Привилегированный.ЭтоТестоваяБаза();
	ОтправлятьУведомленияЧерезKafka = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("2400.ОтправлятьУведомленияКОтправкеЧерезKafka");
	MailTemplateTitle = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("2400.MailTemlateTitleДляОтправкиУведомленийЧерезKafka");
	
	ПараметрыОтправкиУведомлений = Новый Структура;
	ПараметрыОтправкиУведомлений.Вставить("ЭтоТестоваяБаза", ЭтоТестоваяБаза);
	ПараметрыОтправкиУведомлений.Вставить("ОтправлятьУведомленияЧерезKafka", ОтправлятьУведомленияЧерезKafka);
	ПараметрыОтправкиУведомлений.Вставить("MailTemplateTitle", MailTemplateTitle);
	
	Для Каждого ОтправляемоеУведомление Из ОтправляемыеУведомления Цикл
		ЗаписьУведомления.ИДУведомления = ОтправляемоеУведомление.ИДУведомления;
		ЗаписьУведомления.Прочитать();
		ПараметрыУведомления	= ЗаписьУведомления.ПараметрыУведомления.Получить();
		
		// Проверяем допустима ли данная запись к отправке
		Если ЗначениеЗаполнено(ПараметрыУведомления["НастройкиОбмена"]) Тогда
			Если Не ПараметрыУведомления["НастройкиОбмена"].СпособОбмена = Перечисления.СпособыОбменаДанными.ОбменЧерезПочту Тогда
				УвеличитьСчетчикПопытокОтправкиУведомления(ЗаписьУведомления, ОграничениеПопытокОтправки);
				Продолжить;
			КонецЕсли;
		Иначе
			УвеличитьСчетчикПопытокОтправкиУведомления(ЗаписьУведомления, ОграничениеПопытокОтправки);
			Продолжить;
		КонецЕсли;
		
		// Проверка прошла, обрабатываем отправку
		Результат = ОбработатьУведомленияКОтправке(ЗаписьУведомления, ПараметрыУведомления, ПараметрыОтправкиУведомлений);
		
		//Если результат ок, то надо удалить строку рассылки
		Если Результат Тогда
			ЗаписьУведомления.Удалить();
		Иначе
			УвеличитьСчетчикПопытокОтправкиУведомления(ЗаписьУведомления, ОграничениеПопытокОтправки);
		КонецЕсли;
		
	КонецЦикла;
	//---
КонецПроцедуры

Процедура УвеличитьСчетчикПопытокОтправкиУведомления(ЗаписьУведомления, ОграничениеПопытокОтправки)
	ЗаписьУведомления.ПопытокОтправки = ЗаписьУведомления.ПопытокОтправки + 1;
	Если ЗаписьУведомления.ПопытокОтправки >= ОграничениеПопытокОтправки Тогда
		ЗаписьУведомления.ОшибкаПриОтправке = Истина;
	КонецЕсли;
	ЗаписьУведомления.Записать();
КонецПроцедуры

Функция ОбработатьУведомленияКОтправке(ЗаписьУведомления, ПараметрыУведомления, ПараметрыОтправкиУведомлений)
	
	Если ПараметрыОтправкиУведомлений.ОтправлятьУведомленияЧерезKafka Тогда
		НастройкаОбмена = ПараметрыУведомления["НастройкиОбмена"];
		ПолучателиСтрока = НастройкаОбмена.АдресПолучателя;
		Если НЕ ПустаяСтрока(НастройкаОбмена.АдресПолучателяКопии) Тогда
			ПолучателиСтрока = ПолучателиСтрока + "," + НастройкаОбмена.АдресПолучателяКопии;
		КонецЕсли;
		EmailПолучателей = СтрЗаменить(ПолучателиСтрока, ";", ",");
		ТемаПисьма = ПараметрыУведомления["ТемаПисьма"];
		ТекстСообщения = ПараметрыУведомления["ТекстПисьма"];
		ReplaceFields = Новый Структура;
		ReplaceFields.Вставить("ТемаПисьма", ТемаПисьма);
		ReplaceFields.Вставить("ТекстСообщения", ТекстСообщения);
		MailTemplateTitle = ПараметрыОтправкиУведомлений.MailTemplateTitle;
		Вложения = Новый Массив;
		Если ПараметрыУведомления["Вложения"] <> Неопределено Тогда
			Для Каждого Вложение Из ПараметрыУведомления["Вложения"] Цикл
				FileExt = ОбщегоНазначения.ПолучитьРасширениеФайла(Вложение.Ключ);
				FileBody = Base64Строка(Вложение.Значение);
				File = Новый Структура();
				File.Вставить("FileName", Вложение.Ключ);
				File.Вставить("FileExt", FileExt);
				File.Вставить("FileBody", FileBody);
				Вложения.Добавить(Новый Структура("File", File));
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			ОбменДаннымиКафка.ОтправитьПочтовоеУведомление(EmailПолучателей, MailTemplateTitle, ReplaceFields, Вложения);
			Результат = Истина;
		Исключение
			ТекстОшибки = "Уведомление " + ЗаписьУведомления.ИДУведомления + " не удалось записать в журнал исходящих сообщений Kafka."
				+ " Описание ошибки: " + ОписаниеОшибки();
			ИмяСобытия = "Рассылка уведомлений к отправке";
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.УведомленияКОтправке, , ТекстОшибки);
			Результат = Ложь;
		КонецПопытки;
	Иначе
		Результат = ИнтернетПисьмоУведомленияКОтправке(ПараметрыУведомления, ПараметрыОтправкиУведомлений.ЭтоТестоваяБаза);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Работа с регламентами по объектам
Функция ПолучитьФорматСохранения(ФорматИзПеречисления)
	//---
	УведомлениеФорматВложения	= Неопределено;
	//---
	СоответствиеФорматовДляЗаполнения	= Новый Соответствие;
	// Распознаем формат сохранения вложения
	Если ФорматИзПеречисления = Перечисления.ФорматыСохраненияОтчетов.ANSITXT Тогда
		СоответствиеФорматовДляЗаполнения.Вставить(".ANSITXT", ТипФайлаТабличногоДокумента.ANSITXT);
		УведомлениеФорматВложения	= СоответствиеФорматовДляЗаполнения;
	ИначеЕсли ФорматИзПеречисления = Перечисления.ФорматыСохраненияОтчетов.DOCX Тогда
		СоответствиеФорматовДляЗаполнения.Вставить(".DOCX", ТипФайлаТабличногоДокумента.DOCX);
		УведомлениеФорматВложения	= СоответствиеФорматовДляЗаполнения;
	ИначеЕсли ФорматИзПеречисления = Перечисления.ФорматыСохраненияОтчетов.HTML Тогда
		СоответствиеФорматовДляЗаполнения.Вставить(".HTML", ТипФайлаТабличногоДокумента.HTML);
		УведомлениеФорматВложения	= СоответствиеФорматовДляЗаполнения;
	ИначеЕсли ФорматИзПеречисления = Перечисления.ФорматыСохраненияОтчетов.HTML4 Тогда
		СоответствиеФорматовДляЗаполнения.Вставить(".HTML4", ТипФайлаТабличногоДокумента.HTML4);
		УведомлениеФорматВложения	= СоответствиеФорматовДляЗаполнения;
	ИначеЕсли ФорматИзПеречисления = Перечисления.ФорматыСохраненияОтчетов.MXL Тогда
		СоответствиеФорматовДляЗаполнения.Вставить(".MXL", ТипФайлаТабличногоДокумента.MXL);
		УведомлениеФорматВложения	= СоответствиеФорматовДляЗаполнения;
	ИначеЕсли ФорматИзПеречисления = Перечисления.ФорматыСохраненияОтчетов.ODS Тогда
		СоответствиеФорматовДляЗаполнения.Вставить(".ODS", ТипФайлаТабличногоДокумента.ODS);
		УведомлениеФорматВложения	= СоответствиеФорматовДляЗаполнения;
	ИначеЕсли ФорматИзПеречисления = Перечисления.ФорматыСохраненияОтчетов.PDF Тогда
		СоответствиеФорматовДляЗаполнения.Вставить(".PDF", ТипФайлаТабличногоДокумента.PDF);
		УведомлениеФорматВложения	= СоответствиеФорматовДляЗаполнения;
	ИначеЕсли ФорматИзПеречисления = Перечисления.ФорматыСохраненияОтчетов.TXT Тогда
		СоответствиеФорматовДляЗаполнения.Вставить(".TXT", ТипФайлаТабличногоДокумента.TXT);
		УведомлениеФорматВложения	= СоответствиеФорматовДляЗаполнения;
	ИначеЕсли ФорматИзПеречисления = Перечисления.ФорматыСохраненияОтчетов.XLS Тогда
		СоответствиеФорматовДляЗаполнения.Вставить(".XLS", ТипФайлаТабличногоДокумента.XLS);
		УведомлениеФорматВложения	= СоответствиеФорматовДляЗаполнения;
	ИначеЕсли ФорматИзПеречисления = Перечисления.ФорматыСохраненияОтчетов.XLSX Тогда
		СоответствиеФорматовДляЗаполнения.Вставить(".XLSX", ТипФайлаТабличногоДокумента.XLSX);
		УведомлениеФорматВложения	= СоответствиеФорматовДляЗаполнения;
	КонецЕсли;
	//---
	Возврат УведомлениеФорматВложения;	
КонецФункции

// Проверяет права текущего пользователя на вывод информации, 
//   если прав нет - производится запись в журнал регистрации
//
Функция ПравоВывода(ПараметрыЖурнала)
	ПравоВывода = ПравоДоступа("Вывод", Метаданные);
	Если НЕ ПравоВывода Тогда
		ЗаписьЖурнала(ПараметрыЖурнала, УровеньЖурналаРегистрации.Ошибка,
			НСтр("ru = 'У пользователя %1 недостаточно прав на вывод информации'"), ,
			"'"+ Строка(Пользователи.ТекущийПользователь()) +"'");
	КонецЕсли;
	Возврат ПравоВывода;
КонецФункции

// Выполняет регламент
//
////////////////////////////////////////////////////////////////////////////////
// Параметры:
//
//   Параметры (*) Используется как объект-инициатор для отображения ошибок и в шаблонах темы и сообщения
//
//   ПараметрыЖурнала (Структура) Необязательный. Параметры записи в журнал регистрации
//       |- ИмяСобытия (Строка)           Имя события (или группы событий)
//       |- Метаданные (ОбъектМетаданных) Метаданные для привязки события журнала регистрации
//       |- Данные     (*)                Данные для привязки события журнала регистрации
//
////////////////////////////////////////////////////////////////////////////////
// Возвращаемое значение:
//   Истина - Рассылка выполнена
//   Ложь   - Рассылка не выполнена
//
Функция ВыполнитьРегламент(Параметры, ПараметрыЖурнала = Неопределено, ПараметрыЗапуска) Экспорт
	// Переменные для HTML тестов писем
	Перем HTML, КартинкиHTML;
	// Установим флаг что регламент не выполнен
	РегламентВыполнен	= Ложь;
	Если НЕ ПараметрыЗапуска.Свойство("ЗапускЗафиксирован") ИЛИ НЕ ПараметрыЗапуска.ЗапускЗафиксирован Тогда
		РегистрыСведений.СостоянияРегламентныеЗаданияПоОбъектам.ЗафиксироватьЗапускРегламента(Параметры);
	КонецЕсли;
	// Запишем в ЖР информацию о запуске регламента и кем или где запущен	
	ЗаписьЖурнала(ПараметрыЖурнала, ,
		НСтр("ru = 'Инициализирована выполнение регламента %1, автор: %2'"), , 
		"'"+ Строка(Параметры) +"'", 
		"'"+ Строка(?(Не ЗначениеЗаполнено(ИмяПользователя()), "Выполнено сервером", ПараметрыСеанса.ТекущийПользователь)) +"'");
	// Выполняем задание
	Попытка
		//---
		// Регламент вызывается только в пределах текущей базы если ее параметры заполнены в настройках
		Если ЗначениеЗаполнено(Параметры.КластерСерверов) ИЛИ ЗначениеЗаполнено(Параметры.ИнформационнаяБаза) Тогда
			// Определим параметры сервера и базы
			ИмяСервера	= ОбщегоНазначения.ПолучитьПараметрСтрокиСоединения("Srvr", СтрокаСоединенияИнформационнойБазы());
			// Если имя сервера не определено, тогда, возможно, это файловый вариант
			Если ИмяСервера = "" Тогда
				ИмяСервера	= ОбщегоНазначения.ПолучитьПараметрСтрокиСоединения("File", СтрокаСоединенияИнформационнойБазы());
			КонецЕсли;
			ИмяИБ		= ОбщегоНазначения.ПолучитьПараметрСтрокиСоединения("Ref", СтрокаСоединенияИнформационнойБазы());
			//---
			Если Найти(Врег(Параметры.КластерСерверов),Врег(ИмяСервера)) = 0 ИЛИ Врег(Параметры.ИнформационнаяБаза) <> Врег(ИмяИБ) Тогда
				ВызватьИсключение "База не соответствует параметрам настройки регламента:
									|
									|Исходные данные (сервер / имя): "+Параметры.КластерСерверов+" / "+Параметры.ИнформационнаяБаза+"
									|Данные базы (сервер / имя): "+ИмяСервера+" / "+ИмяИБ;
			КонецЕсли;			
		КонецЕсли;
		// Получаем текстовый путь обрабатываемого объекта из ьпереданного параметра и парсим его
		ПутьОбъектаОбработки	= Параметры.ВызываемыйОтчетОбработка;
		//---
		ОО					= Неопределено;
		ПочтовоеСообщение	= Неопределено;
		//---
		Если Найти(ПутьОбъектаОбработки, "Обработка.")>0 Тогда
			ОО	= Обработки[СтрЗаменить(ПутьОбъектаОбработки, "Обработка.", "")].Создать();
		ИначеЕсли Найти(ПутьОбъектаОбработки, "Отчет.")>0 Тогда
			ОО	= Отчеты[СтрЗаменить(ПутьОбъектаОбработки, "Отчет.", "")].Создать();
		КонецЕсли;
		// Если стоит признак уведомления, то создадим объект для почтовое сообщение для уведомления
		Если Параметры.Уведомлять И ЗначениеЗаполнено(Параметры.НастройкаОтправки) Тогда
			УведомлениеНастройка		= Параметры.НастройкаОтправки;
			АктуальнаяУчетнаяЗаписьОтправки = Справочники.НастройкиОбменаДанными.АктуальнаяУчетнаяЗаписьПриемаОтправкиСообщений(УведомлениеНастройка);
			// Распознаем формат сохранения вложения
			УведомлениеФорматВложения	= ПолучитьФорматСохранения(Параметры.ОтчетФормат);
			// Инициализируем профиль почты
			Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(АктуальнаяУчетнаяЗаписьОтправки);
			// Создадим объект почты
			Почта = Новый ИнтернетПочта;
			Попытка
				Почта.Подключиться(Профиль);
			Исключение
				ЗаписьЖурналаРегистрации("Отправка уведомления по регламенту", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка подключения к учетной записи e-mail для отправки уведомления по регламенту - "+ Параметры + ":" + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				Почта	= Неопределено;
				Профиль	= Неопределено;
			КонецПопытки;
			// Если подключились к почте выполняем дальнейшую обработку (создаем почтовое сообщение и заполняем его настройки)
			Если Не Почта = Неопределено Тогда
				ПочтовоеСообщение = Новый ИнтернетПочтовоеСообщение;
				ПочтовоеСообщение.Кодировка = "windows-1251";
	            // Установим список получателей
				МассивАдресовПолучателей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(УведомлениеНастройка.АдресПолучателя, ";");
				Для Каждого АдресПолучателя Из МассивАдресовПолучателей Цикл
					ПочтовоеСообщение.Получатели.Добавить(АдресПолучателя);
				КонецЦикла;
				// Установим список получателей копий
				Если ЗначениеЗаполнено(УведомлениеНастройка.АдресПолучателяКопии) Тогда
					МассивАдресовПолучателейКопий = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(УведомлениеНастройка.АдресПолучателяКопии, ";");
					Для Каждого АдресПолучателя Из МассивАдресовПолучателейКопий Цикл
						ПочтовоеСообщение.СлепыеКопии.Добавить(АдресПолучателя);
					КонецЦикла;
				КонецЕсли;
				// Установим адрес отправителя
				ПочтовоеСообщение.Отправитель.Адрес = АктуальнаяУчетнаяЗаписьОтправки.АдресЭлектроннойПочты;
				// Установим тему письма
				ПочтовоеСообщение.Тема = Параметры.ПочтовоеСообщениеТема;
				// Установим текст письма
				Если Параметры.ПочтовоеСообщениеТипТекста = Перечисления.ТипТекстаПочтовогоСообщения.HTML Тогда
					ФорматированныйДокументТекст	= Параметры.ПочтовоеСообщенияФорматированныйТекст.Получить();
	                //---
					ФорматированныйДокументТекст.ПолучитьHTML(HTML, КартинкиHTML);
					Для Каждого Картинка ИЗ КартинкиHTML Цикл
						Вложение				= ПочтовоеСообщение.Вложения.Добавить(Картинка.Значение.ПолучитьДвоичныеДанные());
						Вложение.Идентификатор	= Картинка.Ключ;
						
						HTML	= СтрЗаменить(HTML, Картинка.Ключ, "cid:"+Вложение.Идентификатор);
					КонецЦикла;
					//---
					ПочтовоеСообщение.Тексты.Добавить(HTML, ТипТекстаПочтовогоСообщения.HTML);
					//---
				ИначеЕсли Параметры.ПочтовоеСообщениеТипТекста = Перечисления.ТипТекстаПочтовогоСообщения.ПростойТекст Тогда
					ПочтовоеСообщение.Тексты.Добавить(Параметры.ПочтовоеСообщенияТекст, ТипТекстаПочтовогоСообщения.ПростойТекст);
				ИначеЕсли Параметры.ПочтовоеСообщениеТипТекста = Перечисления.ТипТекстаПочтовогоСообщения.РазмеченныйТекст Тогда
					ПочтовоеСообщение.Тексты.Добавить(Параметры.ПочтовоеСообщенияТекст, ТипТекстаПочтовогоСообщения.РазмеченныйТекст);
				КонецЕсли;
				// Установим прочие настройки письма
				ПочтовоеСообщение.УведомитьОДоставке	= Параметры.ПочтовоеСообщениеУведомитьОДоставке;
				ПочтовоеСообщение.УведомитьОПрочтении	= Параметры.ПочтовоеСообщениеУведомитьОПрочтении;
				// Важность письма
				Если Параметры.ПочтовоеСообщениеВажность = Перечисления.ВажностьПочтовогоСообщения.Наивысшая Тогда
					ПочтовоеСообщение.Важность	= ВажностьИнтернетПочтовогоСообщения.Наивысшая;
				ИначеЕсли Параметры.ПочтовоеСообщениеВажность = Перечисления.ВажностьПочтовогоСообщения.Высокая Тогда
					ПочтовоеСообщение.Важность	= ВажностьИнтернетПочтовогоСообщения.Высокая;
				ИначеЕсли Параметры.ПочтовоеСообщениеВажность = Перечисления.ВажностьПочтовогоСообщения.Обычная Тогда
					ПочтовоеСообщение.Важность	= ВажностьИнтернетПочтовогоСообщения.Обычная;
				ИначеЕсли Параметры.ПочтовоеСообщениеВажность = Перечисления.ВажностьПочтовогоСообщения.Низкая Тогда
					ПочтовоеСообщение.Важность	= ВажностьИнтернетПочтовогоСообщения.Низкая;
				ИначеЕсли Параметры.ПочтовоеСообщениеВажность = Перечисления.ВажностьПочтовогоСообщения.Обычная Тогда
					ПочтовоеСообщение.Важность	= ВажностьИнтернетПочтовогоСообщения.Обычная;
				КонецЕсли;
				// Установим категории письма
				ПочтовоеСообщение.Категории	= Параметры.ПочтовоеСообщениеКатегории;
			КонецЕсли;
		КонецЕсли;	
		// Обработаем сохраненные настроки отчета/обработки перед вызовом кода
		Если Не ОО = Неопределено Тогда
			РеквизитыОО		= Параметры.РеквизитыОбъекта.Получить();
			РеквизитыООТЧ	= Параметры.РеквизитыОбъектаТабличные.Получить();
			// Установим значения простых реквизитов если заполнены
			Если Не РеквизитыОО = Неопределено Тогда
				Для каждого Строка Из РеквизитыОО Цикл
				    ОО[Строка.ИД] = Строка.Значение;
				КонецЦикла; 
			КонецЕсли;		
			// Установим реквизиты в табличные части если были
			Если Не РеквизитыООТЧ = Неопределено Тогда
				Для каждого ЭлементСоответствия Из РеквизитыООТЧ Цикл
					ИмяТЧ	= ЭлементСоответствия.Ключ;
					ТЧ		= ЭлементСоответствия.Значение;
					// Цикл по строка ТЧ параметров
					Для каждого СтрокаТЧ Из ТЧ Цикл
						НоваяСтрокаТЧОО	= ОО[ИмяТЧ].Добавить();
						// Цикл по колонкам чтобы получить ИД и заполнить значения строки
						Для Каждого КолонкаТЧ ИЗ ТЧ.Колонки Цикл
							НоваяСтрокаТЧОО[КолонкаТЧ.Имя]	= СтрокаТЧ[КолонкаТЧ.Имя];
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
			//---
		КонецЕсли;	
		//---
		Выполнить(Параметры.ИсполняемыйКод1С);
		// Если необходимо уведомление, то отправим
		Если Не ПочтовоеСообщение = Неопределено Тогда
			// Обработаем тексты перед отправкой
			ПочтовоеСообщение.ОбработатьТексты();
			//---
			Почта.Послать(ПочтовоеСообщение, ОбработкаТекстаИнтернетПочтовогоСообщения.НеОбрабатывать);
			Почта.Отключиться();
		КонецЕсли;
		//---
		ОО	= Неопределено;
		//---
		ПараметрыЖурнала.Вставить("БылиОшибки", Ложь);
		РегламентВыполнен			=	 Истина;
		ОшибкаВХодеВыполнения			= "";
		ПараметрыЗапуска.Выполнен		= РегламентВыполнен;
	Исключение
		ПараметрыЖурнала.Вставить("БылиОшибки", Истина);
		РегламентВыполнен				= Ложь;
		ОшибкаВХодеВыполнения			= ИнформацияОбОшибке();
		ПараметрыЗапуска.БылиОшибки		= ПараметрыЖурнала.БылиОшибки;
		ПараметрыЗапуска.ТекстОшибки	= ПодробноеПредставлениеОшибки(ОшибкаВХодеВыполнения);
	КонецПопытки;
   	// Проверим выполнена ли рассылка и зафиксируем результат в ЖР
	Если РегламентВыполнен Тогда
		ЗаписьЖурнала(ПараметрыЖурнала, , НСтр("ru = 'Регламент выполнен'"));
	Иначе
		ЗаписьЖурнала(ПараметрыЖурнала, УровеньЖурналаРегистрации.Ошибка , НСтр("ru = 'Регламент не выполнен'"), ОшибкаВХодеВыполнения);
	КонецЕсли;
	// Фиксируем результат выполнения в регистре
	РегистрыСведений.СостоянияРегламентныеЗаданияПоОбъектам.ЗафиксироватьРезультатВыполненияРегламента(Параметры, ПараметрыЗапуска);
	//---
	Возврат РегламентВыполнен;
КонецФункции	
	
// Подготавливает параметры для Регламента и выполняет его.
//
// Параметры:
//   Параметры (СправочникСсылка.РегламентныеЗаданияПоОбъектам)   Регламент, параметры которого будут подготовлены
//   ПараметрыЖурнала  (Структура)        Необязательный. Параметры записи в журнал регистрации
//       |- ИмяСобытия (Строка)           Имя события (или группы событий)
//       |- Метаданные (ОбъектМетаданных) Метаданные для привязки события журнала регистрации
//       |- Данные     (*)                Данные для привязки события журнала регистрации
// Возвращаемое значение:
//   Истина - Рассылка выполнена
//   Ложь   - Рассылка не выполнена
//
Функция ПодготовитьПараметрыИВыполнитьЗадание(Параметры, ПараметрыЖурнала = Неопределено) Экспорт
	// Параметры записи в журнал регистрации
	Если ПараметрыЖурнала = Неопределено Тогда
		ПараметрыЖурнала = Новый Структура;
	КонецЕсли;
	
	Если НЕ ПараметрыЖурнала.Свойство("ИмяСобытия") Тогда
		ПараметрыЖурнала.Вставить("ИмяСобытия", НСтр("ru = 'Регламентное задание по объектам. Запуск по расписанию'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()));
	КонецЕсли;
	
	Если НЕ ПараметрыЖурнала.Свойство("Данные") Тогда
		ПараметрыЖурнала.Вставить("Данные", Параметры);
	КонецЕсли;
	
	Если НЕ ПараметрыЖурнала.Свойство("Метаданные") Тогда
		ПараметрыЖурнала.Вставить("Метаданные", ПараметрыЖурнала.Данные.Метаданные());
	КонецЕсли;
	// Проверка прав доступа
	Если НЕ ПравоВывода(ПараметрыЖурнала) Тогда
		Возврат Ложь;
	КонецЕсли;
	// Регистрация запуска (запущена, но не выполнена)
	РегистрыСведений.СостоянияРегламентныеЗаданияПоОбъектам.ЗафиксироватьЗапускРегламента(Параметры);
	// Зафиксируем что был запуск
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("ЗапускЗафиксирован",	Истина);
	ПараметрыЗапуска.Вставить("Рассылка",			СокрЛП(Строка(Параметры)));
	ПараметрыЗапуска.Вставить("ДатаВыполнения", 	ТекущаяДатаСеанса());
	ПараметрыЗапуска.Вставить("Выполнен",			Ложь);
	ПараметрыЗапуска.Вставить("БылиОшибки",			Ложь);
	ПараметрыЗапуска.Вставить("ТекстОшибки",		"");
	//---
	Возврат ВыполнитьРегламент(Параметры, ПараметрыЖурнала, ПараметрыЗапуска);
КонецФункции

// Запуск регламента и контроль параметров и результатов
Процедура ВыполнитьРегламентноеЗаданиеПоОбъекту(Параметры=Неопределено) Экспорт
	// Проверка как запускается задание в фоне или из клиента, если не из клиента, то привелигированно
	Если Не ЗначениеЗаполнено(ИмяПользователя()) Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	// Иногде пытается стартануть сразу если задано расписание и не может получить параметры
	Если Параметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// Параметры записи в журнал регистрации
	ПараметрыЖурнала = Новый Структура("ИмяСобытия, Метаданные, Данные");
	ПараметрыЖурнала.ИмяСобытия = НСтр("ru = 'Регламентное задание по объектам. Запуск по расписанию'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	ПараметрыЖурнала.Метаданные = Параметры.Метаданные();
	ПараметрыЖурнала.Данные     = Параметры;
	//
	ПодготовитьПараметрыИВыполнитьЗадание(Параметры, ПараметрыЖурнала);
КонецПроцедуры

// Создает запись в журнале регистрации и сообщениях пользователю;
//   Поддерживает до 4х параметров в комментарии при помощи функции
//   СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку.
//   Поддерживает передачу информации об ошибке, подробное представление
//   ошибки добавляется в комментарий записи в журнал регистрации.
// 
// Параметры:
//   ПараметрыЖурнала (Структура) Параметры записи в журнал регистрации
//       |- ИмяСобытия (Строка)           Имя события (или группы событий)
//       |- Метаданные (ОбъектМетаданных) Метаданные для привязки события журнала регистрации
//       |- Данные     (*)                Данные для привязки события журнала регистрации
//   УровеньЖурнала          (УровеньЖурналаРегистрации) Важность сообщения для администратора.
//   КомментарийСПараметрами (Строка) Комментарий, который может содержать параметры %1, %2, %3 и %4.
//   ИнформацияОбОшибке      (...)    Информация об ошибке, которая будет размещена после комментария.
//       |- (ИнформацияОбОшибке)
//       |- (Строка)
//   Параметр1 (Строка) Для подстановки в КомментарийСПараметрами вместо %1.
//   Параметр2 (Строка) Для подстановки в КомментарийСПараметрами вместо %2.
//   Параметр3 (Строка) Для подстановки в КомментарийСПараметрами вместо %3.
//   Параметр4 (Строка) Для подстановки в КомментарийСПараметрами вместо %4.
//
Процедура ЗаписьЖурнала(ПараметрыЖурнала, УровеньЖурнала = Неопределено, КомментарийСПараметрами = "", 
	ИнформацияОбОшибке = Неопределено, 
	Параметр1 = Неопределено, 
	Параметр2 = Неопределено, 
	Параметр3 = Неопределено, 
	Параметр4 = Неопределено) Экспорт
	
	// Определение уровня журнала регистрации на основе типа переданного сообщения об ошибке
	Если ТипЗнч(УровеньЖурнала) <> Тип("УровеньЖурналаРегистрации") Тогда
		Если ТипЗнч(ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке") Тогда
			УровеньЖурнала = УровеньЖурналаРегистрации.Ошибка;
		ИначеЕсли ТипЗнч(ИнформацияОбОшибке) = Тип("Строка") Тогда
			УровеньЖурнала = УровеньЖурналаРегистрации.Предупреждение;
		Иначе
			УровеньЖурнала = УровеньЖурналаРегистрации.Информация;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписатьВЖурнал = ЗначениеЗаполнено(ПараметрыЖурнала.Данные);
	
	// Комментарий для журнала регистрации и пользователя
	Если Параметр1 <> Неопределено Тогда
		КомментарийСПараметрами = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(КомментарийСПараметрами, Параметр1, Параметр2, Параметр3, Параметр4);
	КонецЕсли;
	
	ТекстДляЖурнала      = КомментарийСПараметрами;
	Если ТипЗнч(ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке") Тогда
		ТекстДляЖурнала      = ТекстДляЖурнала      + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	ИначеЕсли ТипЗнч(ИнформацияОбОшибке) = Тип("Строка") Тогда
		ТекстДляЖурнала      = ТекстДляЖурнала      + Символы.ПС + ИнформацияОбОшибке;
	КонецЕсли;
	ТекстДляЖурнала      = СокрЛП(ТекстДляЖурнала);
	
	// Журнал регистрации 
	Если ЗаписатьВЖурнал Тогда
		УстановитьПривилегированныйРежим(Истина);
		//---
		ЗаписьЖурналаРегистрации(
			ПараметрыЖурнала.ИмяСобытия, 
			УровеньЖурнала, 
			ПараметрыЖурнала.Метаданные, 
			ПараметрыЖурнала.Данные, 
			ТекстДляЖурнала);
		//---
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры

// Добавляет в регистр сведений ЭтапыКД записи с этапом УведомлениеКлиентов на 22:00 текущего дня.
Процедура УведомленияПоКД() Экспорт
	мОбработка = Обработки.ФиксацияКорпоративныхДействийВСообщенияхКД.Создать();
	Д = ТекущаяДата();
	мОбработка.ПолучитьДанные(Д, Д);
	ВремяЗаписи = Дата(1, 1, 1, 22, 00, 00);
	мОбработка.ЗафиксироватьСообщенияКД(Д, Д, ВремяЗаписи);
КонецПроцедуры

// Заполняет все журналы ДЕПО за предыдущий день.
// Вызывается из регламентного задания ЗаполнениеЖурналовДЕПО.
Процедура ЗаполнениеЖурналовДЕПО() Экспорт
	мОбработка = Обработки.ЗаполнениеЖурналов.Создать();
	Д = НачалоДня(ТекущаяДата()) - 24*3600;
	мОбработка.ЗаполнитьЖурналВходящихДокументов(Д, Д);
	мОбработка.ЗаполнитьЖурналИсходящихДокументов(Д, Д);
	мОбработка.ЗаполнитьЖурналОпераций(Д, Д);
КонецПроцедуры

// Загружает курсы валют.
// Вызывается из регламентного задания ЗагрузкаКурсовВалют
Процедура ЗагрузкаКурсовВалют() Экспорт
	ТекущаяДата = ТекущаяДатаСеанса();
	ЗагрузкаДанныхССайтаЦБРФ = Обработки.ЗагрузкаДанныхССайтаЦБ.Создать();
	ЗагрузкаДанныхССайтаЦБРФ.НачДата = ТекущаяДата;
	ЗагрузкаДанныхССайтаЦБРФ.КонДата = ТекущаяДата;
	ЗагрузкаДанныхССайтаЦБРФ.ПроверитьИАктуализироватьКурсы();
	ЗаписьЖурналаРегистрации("Регламентное задание. Загрузка курсов валют",
		УровеньЖурналаРегистрации.Примечание, , , ЗагрузкаДанныхССайтаЦБРФ.СообщениеПоРезультатуВыполнения);
КонецПроцедуры

Процедура КонтрольКурсовВалют() Экспорт
	РаботаСКурсамиВалют.ПроверитьОповеститьОбАктуальностиКурсовВалют();
КонецПроцедуры

Процедура ПроверкаПередачиВЭДО() Экспорт
	
	 РегистрыСведений.ПодтвержденныеДокументыЭДО.ПроверитьВыгруженныеПлатежиВЭДО(ТекущаяДата());
	 
КонецПроцедуры

Процедура ЭтапыОбработкиПоручений() Экспорт
	ИмяСобытия = "Этапы обработки поручений";
	ОбработкаОбъект = Обработки.ЭтапыОбработкиПоручений.Создать();
	ОбработкаОбъект.ЗаполнитьПоДокументам();
	Если ОбработкаОбъект.ДокументыКОбработке.Количество() > 0 Тогда
		Ошибка = ОбработкаОбъект.РезультатИсполненияЭтапаОбработки();
		Если ЗначениеЗаполнено(Ошибка) Тогда
			Уровень = УровеньЖурналаРегистрации.Ошибка;
			Комментарий = Ошибка;
		Иначе
			Уровень = УровеньЖурналаРегистрации.Информация;
			Комментарий = "Обработано поручений: " + ОбработкаОбъект.ДокументыКОбработке.Количество();
		КонецЕсли;	
	Иначе
		Уровень = УровеньЖурналаРегистрации.Предупреждение;
		Комментарий = "Поручений для обработки не обнаружено.";
	КонецЕсли;
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень,,, Комментарий);
КонецПроцедуры

Процедура ИсполнениеПорученийСНулевымНеттингом() Экспорт
	
	Обработки.ИсполнениеПорученийСНулевымНеттингом.ИсполнитьПорученияСНулевымНеттингом(ТекущаяДата());
	
КонецПроцедуры

Процедура ПолучениеСтатусовДокументовВЭДО() Экспорт
	РегистрыСведений.СтатусыПорученийВСЭД.ОбновитьСтатусыОжидающихПодписания();
КонецПроцедуры

Процедура ЗагрузкаВходящихДокументовПоОтчетамНКЦ() Экспорт
	
	ОбрабатываемаяДата = ТекущаяДата();

	Если ОбрабатываемаяДата < НачалоДня(ОбрабатываемаяДата)+12*3600 Тогда
		ОбрабатываемаяДата = ОбщегоНазначения.ПредыдущийРабочийДень(ОбрабатываемаяДата);
	КонецЕсли;
	Если Не ОбщегоНазначения.РабочийДень(ОбрабатываемаяДата) Тогда
		Возврат;
	КонецЕсли;
	
	мОбработка					= Обработки.ЗагрузкаВходящихДокументовПоОтчетамНКЦ.Создать();
	мОбработка.ДатаЗагрузки		= ОбрабатываемаяДата;
	мОбработка.КаталогОтчетов	= мОбработка.ПолучитьТекущуюПапкуОтчетовНКЦ();
	мОбработка.ПрочитатьДанныеОтчетовНКЦ();
	мОбработка.СформироватьДокументы();
	
КонецПроцедуры

Процедура ОтправкаСообщенийПоЗапросуНаРаскрытиеСпискаВладельцевЦБ() Экспорт
	ОбработкаОбъект = Обработки.ОтправкаСообщенийПоЗапросуНаРаскрытиеСпискаВладельцевЦБ.Создать();
	ОбработкаОбъект.ЗаполнитьСообщенияКлиентам();
	ОбработкаОбъект.РезультатОтправкиСообщений();
КонецПроцедуры

Процедура ДоотправкаУведомленийКлиентамСубброкерам() Экспорт
	ОбработкаОбъект = Обработки.ДоотправкаУведомленийКлиентамСубброкерам.Создать();
	ОбработкаОбъект.Заполнить();
	ОбработкаОбъект.Отправить();
КонецПроцедуры

Процедура ОтправкаЗапросаНаРаскрытиеПоСубклиентам() Экспорт
	
	Если НЕ ОбщегоНазначения.РабочийДень() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РСВ.Ссылка КАК ДокументРаскрытия
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев КАК РСВ
	|ГДЕ
	|	РСВ.ДатаФиксации = &ПредыдущийДень
	|	И НЕ РСВ.Статус В (&СтатусыЗапросовНД)
	|	И НЕ РСВ.ПометкаУдаления
	|	И РСВ.ТребуетсяРаскрытиеПоСубклиентам = ИСТИНА
	|	И РСВ.СвязанныйВидКД1.Код В (&ВидыКД)");
	СтатусыЗапросовНД = Новый Массив;
	СтатусыЗапросовНД.Добавить(Перечисления.СтатусыРаскрытияСписковВладельцев.ОтправленЗапросНаРаскрытиеНД);
	СтатусыЗапросовНД.Добавить(Перечисления.СтатусыРаскрытияСписковВладельцев.ПолученОтветНДПоРаскрытию);
	
	Запрос.УстановитьПараметр("ПредыдущийДень",		ОбщегоНазначения.ПредыдущийРабочийДень(НачалоДня(ТекущаяДата())));
	Запрос.УстановитьПараметр("СтатусыЗапросовНД",	СтатусыЗапросовНД);
	ВидыКД = Новый Массив;
	ВидыКД.Добавить("DVCA");
	ВидыКД.Добавить("INTR");
	Запрос.УстановитьПараметр("ВидыКД",	ВидыКД);
	ДокументыРаскрытия = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументРаскрытия");
	Если ДокументыРаскрытия.Количество() > 0 Тогда
		Документы.РаскрытиеСпискаВладельцев.ОтправитьЗапросНаРаскрытиеПоСубклиентам(ДокументыРаскрытия);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправкаЕжедневныхВыписокПоСчетуДепо() Экспорт
	ОбработкаОбъект = Обработки.ОтправкаПериодическихВыписокПоСчетуДЕПО.Создать();
	ОбработкаОбъект.СозданиеИОтправкаВыписок();
КонецПроцедуры

Процедура ПроверкаДоставкиУведомленийВКабинетКлиента() Экспорт
	ОбработкаОбъект = Обработки.ПроверкаДоставкиУведомленийВКабинетКлиента.Создать();
	Минут = 5;
	СекундВМинуте = 60;
	ОбработкаОбъект.ЗаполнитьУведомленияВыгруженныеИз1СИСбойОтправки(НачалоДня(ТекущаяДатаСеанса()),
		ТекущаяДатаСеанса() - Минут * СекундВМинуте);
	ОбработкаОбъект.ЗаписатьВЖурналРегистрацииОшибкиДоставкиУведомлений();
КонецПроцедуры

Процедура ПроверкаСоответствияУведомленийВ1С_КабинетеКлиента() Экспорт
	ОбработкаОбъект = Обработки.ПроверкаДоставкиУведомленийВКабинетКлиента.Создать();
	ОбработкаОбъект.ЗаполнитьУведомленияВыгруженныеИз1СИСбойОтправки(НачалоДня(ТекущаяДатаСеанса()), ТекущаяДатаСеанса());
	ОбработкаОбъект.ЗаписатьВЖурналРегистрацииОшибкиДоставкиУведомлений();
	ОбработкаОбъект.ОтправитьСообщениеОНедоставленныхУведомлениях();
КонецПроцедуры

Процедура ОбработкаВходящихПакетовФайловогоШлюза() Экспорт
	Обработки.ЭкспортПорученийВЛуч.ОбработатьВходящиеПакетыФайловогоШлюза();
КонецПроцедуры

Процедура ОтправкаУведомленийОРаскрытииСпискаВладельцевЦБ() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РСВ.Ссылка КАК ДокументРаскрытия
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев КАК РСВ
	|ГДЕ
	|	НЕ РСВ.УведомлениеОтправлено
	|	И НЕ РСВ.ПометкаУдаления
	|	И РСВ.ДатаИсполнения <> ДАТАВРЕМЯ(1, 1, 1)
	|	И РСВ.ДатаКДПлан <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ВЫРАЗИТЬ(РСВ.ЗаголовокСообщения КАК СТРОКА(100)) <> """"
	|	И ВЫРАЗИТЬ(РСВ.ТелоСообщения КАК СТРОКА(100)) <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	РСВ.Дата");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Документы.РаскрытиеСпискаВладельцев.ОтправитьУведомлениеОРаскрытииСпискаВладельцевЦБ(Выборка.ДокументРаскрытия);
	КонецЦикла;
КонецПроцедуры

Процедура КонтрольНепринятыхНеснятыхЦБ() Экспорт
	
	ПредыдущийМесяц = ДобавитьМесяц(ТекущаяДата(), -1);
	
	ОбработкаОперацииПоОбслуживаниюЦБ = Обработки.ОбработкаОперацийПоОбслуживаниюЦБ.Создать();
	ОбработкаОперацииПоОбслуживаниюЦБ.ПериодНачало = НачалоМесяца(ПредыдущийМесяц);
	ОбработкаОперацииПоОбслуживаниюЦБ.ПериодКонец = КонецМесяца(ПредыдущийМесяц);
	
	ОбработкаОперацииПоОбслуживаниюЦБ.ВыполнитьКонтроль();
	
КонецПроцедуры	

Процедура АвтоматическаяПриемкаЦБНаОбслуживание() Экспорт
	
	ПредыдущийРабочийДень = ОбщегоНазначения.ПредыдущийРабочийДень(ТекущаяДата());
	
	ОбработкаОперацииПоОбслуживаниюЦБ = Обработки.ОбработкаОперацийПоОбслуживаниюЦБ.Создать();
	ОбработкаОперацииПоОбслуживаниюЦБ.ПериодНачало = НачалоДня(ПредыдущийРабочийДень);
	ОбработкаОперацииПоОбслуживаниюЦБ.ПериодКонец = КонецДня(ПредыдущийРабочийДень);
	
	ОбработкаОперацииПоОбслуживаниюЦБ.ОтобратьЦенныеБумаги(Истина, Ложь);
	ОбработкаОперацииПоОбслуживаниюЦБ.СоздатьПоручения(Истина, Ложь);
 	
КонецПроцедуры

Процедура АвтоматическоеСнятиеЦБСОбслуживания() Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ДатаНачала = ДобавитьМесяц(ТекущаяДата, -1);
	
	Обработки.ОбработкаОперацийПоОбслуживаниюЦБ.ВыполнитьСнятиеЗаПериод(ДатаНачала, ТекущаяДата);
	

КонецПроцедуры

Процедура ФормированиеУведомленийОИсполненийОперацийСЦБ() Экспорт
	
	
	Если Час(ТекущаяДата()) = 8 Тогда
		ПредыдущийДень = Истина;
	Иначе
		ПредыдущийДень = Ложь;
	КонецЕсли;
	Обработки.ФормированиеУведомленийООперацияхЦБ.ЗапуститьФормированиеУведомленийОИсполненииОперацииЦБ(ПредыдущийДень);
	
КонецПроцедуры

Процедура ПроверитьЗаписиВСЭДПоИсполненнымИнвентарнымПоручениям() Экспорт
	
	ДатаЗапуска = ТекущаяДатаСеанса();
	
	Если Не ОбщегоНазначения.РабочийДень(ДатаЗапуска) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =   
	"ВЫБРАТЬ
	|	ДокументПоручение.Ссылка КАК Ссылка,
	|	ДокументПоручение.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ДокументПоручение.ЦБ КАК ЦБ,
	|	ДокументПоручение.ЦБ.ISIN КАК ISIN,
	|	ДокументПоручение.ВидОперацииД КАК ВидОперации
	|ИЗ
	|	Документ.Поручение КАК ДокументПоручение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПорученийВСЭД КАК СтатусыПорученийВСЭД
	|		ПО ДокументПоручение.Ссылка = СтатусыПорученийВСЭД.Поручение
	|			И (СтатусыПорученийВСЭД.Статус = &Статус)
	|ГДЕ
	|	ДокументПоручение.ДатаИсполненияПоручения МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ДокументПоручение.ВидОперацииД В(&ВидыОперацииД)
	|	И ДокументПоручение.Проведен
	|	И СтатусыПорученийВСЭД.Поручение ЕСТЬ NULL 
	|	И НЕ ДокументПоручение.НомерПорученияВБО = """""; 					
					
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаЗапуска));
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаЗапуска - 600);	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДокументовВСЭД.Загружено); 					
	
	Запрос.УстановитьПараметр("ВидыОперацииД", РегистрыСведений.ЭтапыОбработкиПоручений.ВидыОперацийИнвентарныхПоручений());
	
	Результат = Запрос.Выполнить();
	
	ТемаПисьма = "1С Депозитарий. Инвентарные поручения. Контроль выгрузки в СЭД.";
	
	Если Результат.Пустой() Тогда		
		ТекстПисьма = "<p>За "+Формат(ДатаЗапуска, "ДФ=dd.MM.yyyy")+" все исполненные инвентарные поручения отправлены в СЭД</p>";
        ВажностьСообщения = ВажностьИнтернетПочтовогоСообщения.Обычная;
	Иначе		
		ТекстПисьма = Документы.Поручение.ТекстУведомленияОбОтсутствииВыгрузкиВСЭДдляИнвентарныхПоручений(Результат, НачалоДня(ДатаЗапуска));		
		ВажностьСообщения = ВажностьИнтернетПочтовогоСообщения.Высокая;
	КонецЕсли;	
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОНаличииВыгрузкиВСЭДДляИнвентарныхПоручений;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	
	Если НастройкиОбмена = Неопределено Тогда
		ТекстОшибки = "Не заданы параметры внешнего источника " + ВнешнийИсточник;
		#Если Клиент Тогда
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки);
		#КонецЕсли
		ИмяСобытия = "Уведомления о проверке выгрузки в СЭД по исполненным инвентарным поручениям";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, ВнешнийИсточник, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.HTML);
	ПараметрыУведомления.Вставить("Важность",			ВажностьСообщения);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
	
КонецПроцедуры

Процедура УведомленияОСкоромОкончанииПриемаИнструкцийПоWTRC() Экспорт
	
	УведомленияОСкоромОкончанииПриемаИнструкцийПоWTRCНаДату(ТекущаяДатаСеанса());
	
КонецПроцедуры

Процедура УведомленияОСкоромОкончанииПриемаИнструкцийПоWTRCНаДату(ДатаВыполнения) Экспорт
	
	ДатаВвода = Константы.ДатаВводаУведомленийОСкоромОкончанииПриемаИнструкцийПоWTRC.Получить();
	Если ЗначениеЗаполнено(ДатаВвода) И ДатаВвода <= НачалоДня(ДатаВыполнения) Тогда
		Обработчик = Обработки.УведомленияОСкоромОкончанииПриемаИнструкцийПоWTRC.Создать();
		Обработчик.ДатаУведомления = ДатаВыполнения;
		
		Если НЕ Обработчик.УведомлениеОтправлено() Тогда
			Обработчик.СформироватьСписокДепонентов();
			Обработчик.ОтправитьУведомление();
			Обработчик.ЗафиксироватьОтправленноеУведомлениеВРегистре();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбменПередачаПакетовФайловогоШлюза() Экспорт
	
	УзелОбмена = ПланыОбмена.ВыпискиПоЦеннымБумагам.НайтиПоКоду("000");
	
	НастройкаОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.CustodyExchange).Настройка;
	
	Определение = Новый WSОпределения(НастройкаОбмена.ВебСервисАдрес,НастройкаОбмена.ВебСервисПользователь, НастройкаОбмена.ВебСервисПароль);
	Прокси = Новый WSПрокси(Определение, НастройкаОбмена.ВебСервисПространствоИмен, НастройкаОбмена.ВебСервисИмяСервиса, НастройкаОбмена.ВебСервисИмяТочкиПодключения);
	Прокси.Пользователь = НастройкаОбмена.ВебСервисПользователь;
	Прокси.Пароль = НастройкаОбмена.ВебСервисПароль;
	
	StatementOfSecuritiesType = Прокси.ФабрикаXDTO.Тип("StatementOfSecurities", "StatementOfSecurities");
	StatementOfSecurities = Прокси.ФабрикаXDTO.Создать(StatementOfSecuritiesType);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Узел", УзелОбмена);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 100
	|	ВходящийПакетИзФайловогоШлюзаИзменения.Ссылка КАК Ссылка,
	|	ДокументСсылка.ПолныйПуть КАК Source,
	|	ДокументСсылка.КодОперации КАК КодОперации,
	|	ДокументСсылка.Дата КАК Дата
	|ПОМЕСТИТЬ ИзмененныеДокументы
	|ИЗ
	|	Документ.ВходящийПакетИзФайловогоШлюза.Изменения КАК ВходящийПакетИзФайловогоШлюзаИзменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза КАК ДокументСсылка
	|		ПО ВходящийПакетИзФайловогоШлюзаИзменения.Ссылка = ДокументСсылка.Ссылка
	|ГДЕ
	|	ВходящийПакетИзФайловогоШлюзаИзменения.Узел = &Узел
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументСсылка.МоментВремени УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзмененныеДокументы.Ссылка КАК Ссылка,
	|	ИзмененныеДокументы.Source КАК Source,
	|	_ReportID.Значение КАК REPORT_ID,
	|	_RepForm.Значение КАК ВидЗапроса,
	|	_RegDate.Значение КАК RegDate,
	|	_TRegDate.Значение КАК TRegDate,
	|	ЕСТЬNULL(_StartDate.Значение, """") КАК StartDate,
	|	ЕСТЬNULL(_EndDate.Значение, """") КАК EndDate,
	|	_OrderType.Значение КАК ORD_TYPE_I,
	|	_DepoCode.Значение КАК DepoCode,
	|	_DepoAccount.Значение КАК DepoAccount,
	|	ИзмененныеДокументы.Дата КАК Дата
	|ПОМЕСТИТЬ РеквизитыШапки
	|ИЗ
	|	ИзмененныеДокументы КАК ИзмененныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _ReportID
	|		ПО ИзмененныеДокументы.Ссылка = _ReportID.Ссылка
	|			И (_ReportID.НомерСтрокиФайла = 1)
	|			И (_ReportID.ИмяФайла = ""reporth.dbf"")
	|			И (_ReportID.Элемент = ""IN_REG_NO"")
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _RepForm
	|		ПО ИзмененныеДокументы.Ссылка = _RepForm.Ссылка
	|			И (_RepForm.НомерСтрокиФайла = 1)
	|			И (_RepForm.ИмяФайла = ""hdsttds.dbf"")
	|			И (_RepForm.Элемент = ""REP_FORM"")
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _RegDate
	|		ПО ИзмененныеДокументы.Ссылка = _RegDate.Ссылка
	|			И (_RegDate.НомерСтрокиФайла = 1)
	|			И (_RegDate.ИмяФайла = ""reporth.dbf"")
	|			И (_RegDate.Элемент = ""REG_DATE"")
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _TRegDate
	|		ПО ИзмененныеДокументы.Ссылка = _TRegDate.Ссылка
	|			И (_TRegDate.НомерСтрокиФайла = 1)
	|			И (_TRegDate.ИмяФайла = ""reporth.dbf"")
	|			И (_TRegDate.Элемент = ""TREG_DATE"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _StartDate
	|		ПО ИзмененныеДокументы.Ссылка = _StartDate.Ссылка
	|			И (_StartDate.НомерСтрокиФайла = 1)
	|			И (_StartDate.ИмяФайла = ""hdsttds.dbf"")
	|			И (_StartDate.Элемент = ""START_DATE"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _EndDate
	|		ПО ИзмененныеДокументы.Ссылка = _EndDate.Ссылка
	|			И (_EndDate.НомерСтрокиФайла = 1)
	|			И (_EndDate.ИмяФайла = ""hdsttds.dbf"")
	|			И (_EndDate.Элемент = ""END_DATE"")
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _OrderType
	|		ПО ИзмененныеДокументы.Ссылка = _OrderType.Ссылка
	|			И (_OrderType.НомерСтрокиФайла = 1)
	|			И (_OrderType.ИмяФайла = ""reporth.dbf"")
	|			И (_OrderType.Элемент = ""ORD_TYPE_I"")
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _DepoCode
	|		ПО ИзмененныеДокументы.Ссылка = _DepoCode.Ссылка
	|			И (_DepoCode.НомерСтрокиФайла = 1)
	|			И (_DepoCode.ИмяФайла = ""hdsttds.dbf"")
	|			И (_DepoCode.Элемент = ""DEPO_CODE"")
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _DepoAccount
	|		ПО ИзмененныеДокументы.Ссылка = _DepoAccount.Ссылка
	|			И (_DepoAccount.НомерСтрокиФайла = 1)
	|			И (_DepoAccount.ИмяФайла = ""hdsttds.dbf"")
	|			И (_DepoAccount.Элемент = ""DEPO_ACC_C"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеквизитыШапки.Ссылка КАК Ссылка,
	|	РеквизитыШапки.Source КАК Source,
	|	РеквизитыШапки.REPORT_ID КАК REPORT_ID,
	|	РеквизитыШапки.ВидЗапроса КАК ВидЗапроса,
	|	РеквизитыШапки.RegDate КАК RegDate,
	|	РеквизитыШапки.TRegDate КАК TRegDate,
	|	РеквизитыШапки.StartDate КАК StartDate,
	|	РеквизитыШапки.EndDate КАК EndDate,
	|	РеквизитыШапки.ORD_TYPE_I КАК ORD_TYPE_I,
	|	РеквизитыШапки.DepoCode КАК DepoCode,
	|	РеквизитыШапки.DepoAccount КАК DepoAccount,
	|	РеквизитыШапки.Дата КАК Дата
	|ИЗ
	|	РеквизитыШапки КАК РеквизитыШапки
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитыШапки.RegDate УБЫВ,
	|	РеквизитыШапки.TRegDate УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеквизитыШапки.Ссылка КАК Ссылка,
	|	_OperDate.НомерСтрокиФайла КАК НомерСтроки,
	|	_OperDate.Значение КАК OperDate,
	|	_ToOperDate.Значение КАК ToOperDate,
	|	_DepoAccount.Значение КАК DepoAccount,
	|	_DepoSection.Значение КАК DepoSection,
	|	_SecurityCode.Значение КАК SecurityCode,
	|	_RegNo.Значение КАК RegNo,
	|	_Amount.Значение КАК Amount,
	|	_OrdersType.Значение КАК OrdersType,
	|	_OrdersNumber.Значение КАК OrdersNumber
	|ИЗ
	|	РеквизитыШапки КАК РеквизитыШапки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _OperDate
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _ToOperDate
	|			ПО _OperDate.Ссылка = _ToOperDate.Ссылка
	|				И _OperDate.НомерСтрокиФайла = _ToOperDate.НомерСтрокиФайла
	|				И (_ToOperDate.ИмяФайла = ""oprp.dbf"")
	|				И (_ToOperDate.Элемент = ""TOPERDAY"")
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _DepoAccount
	|			ПО _OperDate.Ссылка = _DepoAccount.Ссылка
	|				И _OperDate.НомерСтрокиФайла = _DepoAccount.НомерСтрокиФайла
	|				И (_DepoAccount.ИмяФайла = ""oprp.dbf"")
	|				И (_DepoAccount.Элемент = ""DEPO_ACC_C"")
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _DepoSection
	|			ПО _OperDate.Ссылка = _DepoSection.Ссылка
	|				И _OperDate.НомерСтрокиФайла = _DepoSection.НомерСтрокиФайла
	|				И (_DepoSection.ИмяФайла = ""oprp.dbf"")
	|				И (_DepoSection.Элемент = ""SECTION_CO"")
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _SecurityCode
	|			ПО _OperDate.Ссылка = _SecurityCode.Ссылка
	|				И _OperDate.НомерСтрокиФайла = _SecurityCode.НомерСтрокиФайла
	|				И (_SecurityCode.ИмяФайла = ""oprp.dbf"")
	|				И (_SecurityCode.Элемент = ""SECURITY_C"")
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _RegNo
	|			ПО _OperDate.Ссылка = _RegNo.Ссылка
	|				И _OperDate.НомерСтрокиФайла = _RegNo.НомерСтрокиФайла
	|				И (_RegNo.ИмяФайла = ""oprp.dbf"")
	|				И (_RegNo.Элемент = ""STATE_REGI"")
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _Amount
	|			ПО _OperDate.Ссылка = _Amount.Ссылка
	|				И _OperDate.НомерСтрокиФайла = _Amount.НомерСтрокиФайла
	|				И (_Amount.ИмяФайла = ""oprp.dbf"")
	|				И (_Amount.Элемент = ""BALANCE_TU"")
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _OrdersNumber
	|			ПО _OperDate.Ссылка = _OrdersNumber.Ссылка
	|				И _OperDate.НомерСтрокиФайла = _OrdersNumber.НомерСтрокиФайла
	|				И (_OrdersNumber.ИмяФайла = ""oprp.dbf"")
	|				И (_OrdersNumber.Элемент = ""DEPO_OPER_"")
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _OrdersType
	|			ПО _OperDate.Ссылка = _OrdersType.Ссылка
	|				И _OperDate.НомерСтрокиФайла = _OrdersType.НомерСтрокиФайла
	|				И (_OrdersType.ИмяФайла = ""oprp.dbf"")
	|				И (_OrdersType.Элемент = ""ORDERS_TYP"")
	|		ПО РеквизитыШапки.Ссылка = _OperDate.Ссылка
	|			И (_OperDate.ИмяФайла = ""oprp.dbf"")
	|			И (_OperDate.Элемент = ""OPERDAY"")
	|			И (_OperDate.Значение <> ДАТАВРЕМЯ(1, 1, 1))
	|ГДЕ
	|	РеквизитыШапки.ORD_TYPE_I = ""41""
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РеквизитыШапки.Ссылка,
	|	_SecurityCode.НомерСтрокиФайла,
	|	РеквизитыШапки.RegDate,
	|	РеквизитыШапки.TRegDate,
	|	РеквизитыШапки.DepoAccount,
	|	_DepoSection.Значение,
	|	_SecurityCode.Значение,
	|	_RegNo.Значение,
	|	_Amount.Значение,
	|	"""",
	|	""""
	|ИЗ
	|	РеквизитыШапки КАК РеквизитыШапки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _SecurityCode
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _RegNo
	|			ПО _SecurityCode.Ссылка = _RegNo.Ссылка
	|				И _SecurityCode.НомерСтрокиФайла = _RegNo.НомерСтрокиФайла
	|				И (_RegNo.ИмяФайла = ""sttds.dbf"")
	|				И (_RegNo.Элемент = ""STATE_REGI"")
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _Amount
	|			ПО _SecurityCode.Ссылка = _Amount.Ссылка
	|				И _SecurityCode.НомерСтрокиФайла = _Amount.НомерСтрокиФайла
	|				И (_Amount.ИмяФайла = ""sttds.dbf"")
	|				И (_Amount.Элемент = ""SEQ_AMO"")
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК _DepoSection
	|			ПО _SecurityCode.Ссылка = _DepoSection.Ссылка
	|				И _SecurityCode.НомерСтрокиФайла = _DepoSection.НомерСтрокиФайла
	|				И (_DepoSection.ИмяФайла = ""sttds.dbf"")
	|				И (_DepoSection.Элемент = ""SECTION_CO"")
	|		ПО РеквизитыШапки.Ссылка = _SecurityCode.Ссылка
	|			И (_SecurityCode.ИмяФайла = ""sttds.dbf"")
	|			И (_SecurityCode.Элемент = ""SECURITY_C"")
	|ГДЕ
	|	РеквизитыШапки.ORD_TYPE_I = ""40""";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаРеквизитыШапки = РезультатЗапроса[2].Выбрать(); 
	ДанныеТабличнойЧасти = РезультатЗапроса[3].Выгрузить();
	
	Пока ВыборкаРеквизитыШапки.Следующий() Цикл
		
		StatementOfSecuritiesType = Прокси.ФабрикаXDTO.Тип("StatementOfSecurities", "StatementOfSecurities");
		StatementOfSecurities = Прокси.ФабрикаXDTO.Создать(StatementOfSecuritiesType);
		StatementOfSecurities.IdDoc 		= ВыборкаРеквизитыШапки.DepoCode + "_" + ВыборкаРеквизитыШапки.DepoAccount + "_" + СокрЛП(ВыборкаРеквизитыШапки.ORD_TYPE_I);
		StatementOfSecurities.RegDate 		= ВыборкаРеквизитыШапки.RegDate + Лев(ВыборкаРеквизитыШапки.TRegDate, 2) * 60 * 60 +Сред(ВыборкаРеквизитыШапки.TRegDate, 4,2) * 60 + Прав(ВыборкаРеквизитыШапки.TRegDate, 2);
		StatementOfSecurities.StartDate 	= ВыборкаРеквизитыШапки.StartDate;
		StatementOfSecurities.EndDate 		= ВыборкаРеквизитыШапки.EndDate;
		StatementOfSecurities.OrderType 	= СокрЛП(ВыборкаРеквизитыШапки.ORD_TYPE_I);
		StatementOfSecurities.Source	 	= СокрЛП(ВыборкаРеквизитыШапки.Source);
		StatementOfSecurities.DepoCode 		= СокрЛП(ВыборкаРеквизитыШапки.DepoCode);
		
		ТабличнаяЧастьДокумента = ДанныеТабличнойЧасти.НайтиСтроки(Новый Структура("Ссылка", ВыборкаРеквизитыШапки.Ссылка));
		Для каждого СтрокаДокумента из ТабличнаяЧастьДокумента Цикл
			КоличествоФормат = СтрЗаменить(СтрокаДокумента.Amount, Символ(32),"");
			
			Если СокрЛП(СтрокаДокумента.SecurityCode) = "" ИЛИ СокрЛП(СтрокаДокумента.SecurityCode) = "-" Тогда
				ЗаписьЖурналаРегистрации(
					"ВходящийПакетФайловогоШлюза.ОбменДанными", 
					УровеньЖурналаРегистрации.Информация,
					, 
					ВыборкаРеквизитыШапки.Ссылка, 
					"Не требуется выгрузка по ценной бумаге с кодом '" + СтрокаДокумента.SecurityCode + "'");
			Иначе
				SecurityType = Прокси.ФабрикаXDTO.Тип("StatementOfSecurities","Security");
				Security = Прокси.ФабрикаXDTO.Создать(SecurityType);
				Security.OperDate 		= СтрокаДокумента.OperDate + Лев(СтрокаДокумента.ToOperDate, 2) * 60 * 60 +Сред(СтрокаДокумента.ToOperDate, 4,2) * 60 + Прав(СтрокаДокумента.ToOperDate, 2);
				Security.DepoAccount 	= СокрЛП(СтрокаДокумента.DepoAccount);
				Security.DepoSection 	= СокрЛП(СтрокаДокумента.DepoSection);
				Security.SecurityCode 	= СокрЛП(СтрокаДокумента.SecurityCode);
				Security.RegNo 			= СокрЛП(СтрокаДокумента.RegNo);
				Security.Amount 		= ?(КоличествоФормат = "", 0, Число(КоличествоФормат));
				Security.OrdersNumber 	= СокрЛП(СтрокаДокумента.OrdersNumber);
				Security.OrdersType 	= СокрЛП(СтрокаДокумента.OrdersType);
				StatementOfSecurities.Securities.Добавить(Security);
			КонецЕсли;
		КонецЦикла;
		
		Если StatementOfSecurities.Securities.Количество() = 0 Тогда
			ЗаписьЖурналаРегистрации(
				"ВходящийПакетФайловогоШлюза.ОбменДанными", 
				УровеньЖурналаРегистрации.Информация,
				, 
				ВыборкаРеквизитыШапки.Ссылка, 
				"Не требуется выгрузка документа с пустой табличной частью");
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ВыборкаРеквизитыШапки.Ссылка); 			
		Иначе			
			РезультатЗапроса = Прокси.StatementOfSecurities(StatementOfSecurities);
			Если РезультатЗапроса.Error = Истина Тогда
				ЗаписьЖурналаРегистрации("ВходящийПакетФайловогоШлюза.ОбменДанными", УровеньЖурналаРегистрации.Ошибка,, ВыборкаРеквизитыШапки.Ссылка, РезультатЗапроса.Message);
			ИначеЕсли РезультатЗапроса.EventLogLevel = 2 Тогда
				ЗаписьЖурналаРегистрации("ВходящийПакетФайловогоШлюза.ОбменДанными", УровеньЖурналаРегистрации.Предупреждение,, ВыборкаРеквизитыШапки.Ссылка, РезультатЗапроса.Message);
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ВыборкаРеквизитыШапки.Ссылка);
			Иначе
				ЗаписьЖурналаРегистрации("ВходящийПакетФайловогоШлюза.ОбменДанными", УровеньЖурналаРегистрации.Информация,, ВыборкаРеквизитыШапки.Ссылка, "Документ загружен в 1С ИЦ");
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ВыборкаРеквизитыШапки.Ссылка);
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

// ОбновитьИсториюДанных
//
Процедура ОбновитьИсториюДанных() Экспорт

	ИсторияДанных.ОбновитьИсторию();

КонецПроцедуры // ОбновитьИсториюДанных

// Обработчик одноименного регламентного задания
Процедура ЗагрузкаАгрегированныхРаскрытийНРД() Экспорт
	Обработки.ЗагрузкаАгрегированныхРаскрытийНРД.ЗагрузитьДанныеАгрегированныхРаскрытий();
КонецПроцедуры

// Обработчик регламентного задания ОчисткаВспомогательныхРегистров
Процедура ОчисткаВспомогательныхРегистров() Экспорт
	Обработка = Обработки.ОчисткаВспомогательныхРегистров.Создать();
	Обработка.ИнициализироватьНастройки();
	Обработка.Очистить();
КонецПроцедуры

Процедура СписаниеЦБПолученныхОтПринудительнойКонвертации(ДатаРегламента = Неопределено) Экспорт
	
	Если Не ОбщегоНазначения.РабочийДень() Тогда
		Возврат;
	КонецЕсли;
	
	Если ДатаРегламента = Неопределено Тогда
		ДатаРегламента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбособленныйРаздел", Перечисления.ТипыРазделовСчетовДЕПО.БлокированоОбособленный);
	Запрос.УстановитьПараметр("Основной", Перечисления.ТипыРазделовСчетовДЕПО.Основной);
	Запрос.УстановитьПараметр("Период", ДатаРегламента);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ДатаРегламента));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ДатаРегламента));
	Запрос.УстановитьПараметр("Акция", Перечисления.ТипыЦБ.Акция);
	Запрос.УстановитьПараметр("ВидОперацииПеревод", Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо);
	Запрос.УстановитьПараметр("ВидПорученияПереводВРамкахСчета", Справочники.ВидыИнвентарныхПоручений.П20);
	Запрос.УстановитьПараметр("SHS1", "SHS1");
	Запрос.УстановитьПараметр("SHS2", "SHS2");
	Запрос.УстановитьПараметр("SHS3", "SHS3");
	Запрос.УстановитьПараметр("SHS4", "SHS4");
	Запрос.Текст = ТекстЗапросаСписаниеЦБПолученныхОтПринудительнойКонвертации();
	
	ДанныеДляПоручений = Запрос.Выполнить().Выбрать();
	Организация = ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию();
	Пока ДанныеДляПоручений.Следующий() Цикл
		
		ПоручениеСуществует = ЗначениеЗаполнено(ДанныеДляПоручений.Поручение);
		Если ПоручениеСуществует Тогда
			Поручение = ДанныеДляПоручений.Поручение.ПолучитьОбъект();
			Поручение.Заблокировать();
		Иначе
			Поручение = Документы.Поручение.СоздатьДокумент();
			Поручение.Заполнить(Неопределено);
		КонецЕсли;
		ДвенадцатьЧасов = 12 * 60 * 60;
		Поручение.Дата = НачалоДня(ДатаРегламента) + ДвенадцатьЧасов;
		Поручение.УстановитьНовыйНомер();
		Поручение.ДатаИсполненияПоручения = НачалоДня(ДатаРегламента) + ДвенадцатьЧасов + 1;
		Поручение.ДатаИсполненияПорученияВДепозитарииМХ = Поручение.ДатаИсполненияПоручения;
		Поручение.ДатаИсполненияПорученияВМестеРасчетов = Поручение.ДатаИсполненияПоручения;
		Поручение.ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо;
		Поручение.ВидПоручения = Справочники.ВидыИнвентарныхПоручений.П20;
		Поручение.Инициатор = Организация;
		Поручение.Депонент = ДанныеДляПоручений.Клиент;
		Поручение.СчетДепо = ДанныеДляПоручений.СчетДепо;
		Поручение.РазделСчетаДепо = ДанныеДляПоручений.РазделСчетаДепо;
		Поручение.МХДепонента = ДанныеДляПоручений.МХДепонента;
		Поручение.СчетДепоМХ = ДанныеДляПоручений.СчетДепоМХ;
		Поручение.РазделСчетаДепоМХ = ДанныеДляПоручений.РазделСчетаДепоМХ;
		Поручение.Контрагент = ДанныеДляПоручений.Клиент;
		Поручение.СчетДепоКонтрагента = ДанныеДляПоручений.СчетДепо;
		Поручение.РазделСчетаДепоКонтрагента = ДанныеДляПоручений.РазделСчетаДепоКонтрагента;
		Поручение.МХКонтрагент = ДанныеДляПоручений.МХКонтрагент;
		Поручение.СчетДепоМХКонтрагента = ДанныеДляПоручений.СчетДепоМХКонтрагента;
		Поручение.РазделСчетаДепоМХКонтрагента = ДанныеДляПоручений.РазделСчетаДепоМХКонтрагента;
		Поручение.Комментарий = "Уменьшение количества обособленных акций согласно п. 6 Предписания Банка России  № 018-34/12822 от 28.12.2022 г.";
		Если Документы.Поручение.ЭтоНеторговоеПоручениеСоСпискомЦБ(Поручение) Тогда
			НоваяСтрокаЦБ = Поручение.ЦенныеБумагиСписываемые.Добавить();
			НоваяСтрокаЦБ.ЦеннаяБумага = ДанныеДляПоручений.ЦБ;
			НоваяСтрокаЦБ.Количество = ДанныеДляПоручений.КоличествоКПереводу;
		Иначе
			Поручение.ЦБ = ДанныеДляПоручений.ЦБ;
			Поручение.КоличествоЦБ = ДанныеДляПоручений.КоличествоКПереводу;
		КонецЕсли;
		
		Попытка
			Поручение.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Если ПоручениеСуществует Тогда
				ОписаниеОшибки = "Не удалось обновить поручение %1 на перевод между разделами счета.";
				ОписаниеОшибки = СтрШаблон(ОписаниеОшибки, ДанныеДляПоручений.Поручение);
			Иначе
				ОписаниеОшибки = "Не удалось записать поручение на перевод между разделами счета. Раздел счета ДЕПО %1, ЦБ %2";
				ОписаниеОшибки = СтрШаблон(ОписаниеОшибки, ДанныеДляПоручений.РазделСчетаДепо, ДанныеДляПоручений.ЦБ);
			КонецЕсли;
			ОписаниеОшибки = ОписаниеОшибки + " По причине: " + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации("Снятие обособления по Предписанию БР", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаСписаниеЦБПолученныхОтПринудительнойКонвертации()
	
	Возврат
	"ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ АкцииРФ
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦББанкаРоссии КАК ВидыЦБАкцийРФ
	|		ПО ЦенныеБумаги.ВидЦББанкаРоссии = ВидыЦБАкцийРФ.Ссылка
	|			И (ЦенныеБумаги.ТипЦБ = &Акция)
	|			И (ВидыЦБАкцийРФ.Код В (&SHS1, &SHS2, &SHS3, &SHS4))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБОстатки.ЦБ КАК ЦБ,
	|	ОстаткиЦБОстатки.СчетДепоМХ КАК СчетДепоМХ,
	|	ОстаткиЦБОстатки.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ОстаткиЦБОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиЦБНаТекущуюДату
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&Период,
	|			РазделСчетаДепо.ТипРазделаСчетаДЕПО = &ОбособленныйРаздел
	|				И ЦБ В
	|					(ВЫБРАТЬ
	|						АкцииРФ.Ссылка КАК Ссылка
	|					ИЗ
	|						АкцииРФ КАК АкцииРФ)) КАК ОстаткиЦБОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ОстаткиЦБ.Период) КАК Период,
	|	ОстаткиЦБ.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБ.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБ.ЦБ КАК ЦБ,
	|	ОстаткиЦБ.СчетДепоМХ КАК СчетДепоМХ,
	|	ОстаткиЦБ.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ
	|ПОМЕСТИТЬ ДатыВводаЦБ
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ КАК ОстаткиЦБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиЦБНаТекущуюДату КАК ОстаткиЦБНаТекущуюДату
	|		ПО ОстаткиЦБ.ЦБ = ОстаткиЦБНаТекущуюДату.ЦБ
	|			И ОстаткиЦБ.СчетДепо = ОстаткиЦБНаТекущуюДату.СчетДепо
	|			И ОстаткиЦБ.РазделСчетаДепо = ОстаткиЦБНаТекущуюДату.РазделСчетаДепо
	|			И ОстаткиЦБ.СчетДепоМХ = ОстаткиЦБНаТекущуюДату.СчетДепоМХ
	|			И ОстаткиЦБ.РазделСчетаДепоМХ = ОстаткиЦБНаТекущуюДату.РазделСчетаДепоМХ
	|ГДЕ
	|	ОстаткиЦБ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиЦБ.СчетДепо,
	|	ОстаткиЦБ.РазделСчетаДепо,
	|	ОстаткиЦБ.ЦБ,
	|	ОстаткиЦБ.СчетДепоМХ,
	|	ОстаткиЦБ.РазделСчетаДепоМХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБ.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБ.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБ.ЦБ КАК ЦБ,
	|	ОстаткиЦБ.СчетДепоМХ КАК СчетДепоМХ,
	|	ОстаткиЦБ.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	СУММА(ОстаткиЦБ.Количество) КАК Количество
	|ПОМЕСТИТЬ ОстаткиЦБНачальные
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ КАК ОстаткиЦБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыВводаЦБ КАК ДатыВводаЦБ
	|		ПО ОстаткиЦБ.Период = ДатыВводаЦБ.Период
	|			И ОстаткиЦБ.СчетДепо = ДатыВводаЦБ.СчетДепо
	|			И ОстаткиЦБ.РазделСчетаДепо = ДатыВводаЦБ.РазделСчетаДепо
	|			И ОстаткиЦБ.ЦБ = ДатыВводаЦБ.ЦБ
	|			И ОстаткиЦБ.СчетДепоМХ = ДатыВводаЦБ.СчетДепоМХ
	|			И ОстаткиЦБ.РазделСчетаДепоМХ = ДатыВводаЦБ.РазделСчетаДепоМХ
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиЦБ.РазделСчетаДепо,
	|	ОстаткиЦБ.РазделСчетаДепоМХ,
	|	ОстаткиЦБ.СчетДепо,
	|	ОстаткиЦБ.ЦБ,
	|	ОстаткиЦБ.СчетДепоМХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазделыСчетаДепо.Владелец КАК Владелец,
	|	РазделыСчетаДепо.Ссылка КАК РазделСчетаДепоКонтрагента,
	|	РазделыСчетаДепо.РазделСчетаДепоМХ.Владелец.Владелец КАК МХКонтрагент,
	|	РазделыСчетаДепо.РазделСчетаДепоМХ.Владелец КАК СчетДепоМХКонтрагента,
	|	РазделыСчетаДепо.РазделСчетаДепоМХ КАК РазделСчетаДепоМХКонтрагента
	|ПОМЕСТИТЬ ОсновныеРазделыСчетовДепо
	|ИЗ
	|	Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
	|ГДЕ
	|	РазделыСчетаДепо.ТипРазделаСчетаДЕПО = &Основной
	|	И НЕ РазделыСчетаДепо.Наименование ПОДОБНО ""%обособл%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБНачальные.ЦБ КАК ЦБ,
	|	ВЫБОР
	|		КОГДА ОстаткиЦБНачальные.Количество * ПроцентыСписанияЦБСОбособленногоРазделаСрезПоследних.ПроцентСписания / 100 < 0.5
	|			ТОГДА 1
	|		ИНАЧЕ ВЫРАЗИТЬ(ОстаткиЦБНачальные.Количество * ПроцентыСписанияЦБСОбособленногоРазделаСрезПоследних.ПроцентСписания / 100 КАК ЧИСЛО(20, 0))
	|	КОНЕЦ КАК РасчетноеКоличествоКПереводу,
	|	ОстаткиЦБНачальные.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБНачальные.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБНачальные.СчетДепоМХ КАК СчетДепоМХ,
	|	ОстаткиЦБНачальные.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ
	|ПОМЕСТИТЬ ЦенныеБумагиКПереводу
	|ИЗ
	|	ОстаткиЦБНачальные КАК ОстаткиЦБНачальные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентыСписанияЦБСОбособленногоРаздела.СрезПоследних(&Период, РазделСчетаДЕПО.ТипРазделаСчетаДЕПО = &ОбособленныйРаздел) КАК ПроцентыСписанияЦБСОбособленногоРазделаСрезПоследних
	|		ПО ОстаткиЦБНачальные.РазделСчетаДепо = ПроцентыСписанияЦБСОбособленногоРазделаСрезПоследних.РазделСчетаДЕПО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумагиКПереводу.ЦБ КАК ЦБ,
	|	ВЫБОР
	|		КОГДА ЦенныеБумагиКПереводу.РасчетноеКоличествоКПереводу > ОстаткиЦБНаТекущуюДату.КоличествоОстаток
	|			ТОГДА ОстаткиЦБНаТекущуюДату.КоличествоОстаток
	|		ИНАЧЕ ЦенныеБумагиКПереводу.РасчетноеКоличествоКПереводу
	|	КОНЕЦ КАК КоличествоКПереводу,
	|	ОстаткиЦБНаТекущуюДату.СчетДепо.Владелец КАК Клиент,
	|	ОстаткиЦБНаТекущуюДату.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБНаТекущуюДату.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБНаТекущуюДату.СчетДепоМХ.Владелец КАК МХДепонента,
	|	ОстаткиЦБНаТекущуюДату.СчетДепоМХ КАК СчетДепоМХ,
	|	ОстаткиЦБНаТекущуюДату.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	РазделыСчетаДепо.РазделСчетаДепоКонтрагента КАК РазделСчетаДепоКонтрагента,
	|	РазделыСчетаДепо.МХКонтрагент КАК МХКонтрагент,
	|	РазделыСчетаДепо.СчетДепоМХКонтрагента КАК СчетДепоМХКонтрагента,
	|	РазделыСчетаДепо.РазделСчетаДепоМХКонтрагента КАК РазделСчетаДепоМХКонтрагента,
	|	Поручение.Ссылка КАК Поручение
	|ИЗ
	|	ЦенныеБумагиКПереводу КАК ЦенныеБумагиКПереводу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиЦБНаТекущуюДату КАК ОстаткиЦБНаТекущуюДату
	|		ПО ЦенныеБумагиКПереводу.ЦБ = ОстаткиЦБНаТекущуюДату.ЦБ
	|			И ЦенныеБумагиКПереводу.СчетДепо = ОстаткиЦБНаТекущуюДату.СчетДепо
	|			И ЦенныеБумагиКПереводу.РазделСчетаДепо = ОстаткиЦБНаТекущуюДату.РазделСчетаДепо
	|			И ЦенныеБумагиКПереводу.СчетДепоМХ = ОстаткиЦБНаТекущуюДату.СчетДепоМХ
	|			И ЦенныеБумагиКПереводу.РазделСчетаДепоМХ = ОстаткиЦБНаТекущуюДату.РазделСчетаДепоМХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручение
	|		ПО ЦенныеБумагиКПереводу.СчетДепо = Поручение.СчетДепо
	|			И ЦенныеБумагиКПереводу.РазделСчетаДепо = Поручение.РазделСчетаДепо
	|			И ЦенныеБумагиКПереводу.ЦБ = Поручение.ЦБ
	|			И ЦенныеБумагиКПереводу.СчетДепоМХ = Поручение.СчетДепоМХ
	|			И ЦенныеБумагиКПереводу.РазделСчетаДепоМХ = Поручение.РазделСчетаДепоМХ
	|			И (Поручение.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
	|			И (НЕ Поручение.ПометкаУдаления)
	|			И (Поручение.ВидОперацииД = &ВидОперацииПеревод)
	|			И (Поручение.ВидПоручения = &ВидПорученияПереводВРамкахСчета)
	|			И (Поручение.РазделСчетаДепо.ТипРазделаСчетаДЕПО = &ОбособленныйРаздел)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОсновныеРазделыСчетовДепо КАК РазделыСчетаДепо
	|		ПО ЦенныеБумагиКПереводу.СчетДепо = РазделыСчетаДепо.Владелец";
	
КонецФункции

// Обработчик регламентного задания ОтправкаПредупрежденийОПриближенииОкончанияПриемаУведомленийПоОфертам
Процедура ОтправкаПредупрежденийОСкоромОкончанииСрокаУчастияВОферте() Экспорт
	ТекДата = НачалоДня(ТекущаяДатаСеанса());
	Если Не ОбщегоНазначения.РабочийДень(ТекДата) Тогда
		Возврат;
	КонецЕсли;
	
	СледующийРабочийДень = ОбщегоНазначения.ДобавитьРабочийДень(ТекДата, 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КарточкаОферты.Ссылка КАК Ссылка,
	|	КарточкаОферты.ДатаОферты КАК ДатаОферты,
	|	КарточкаОферты.ЦеннаяБумага КАК ЦеннаяБумага,
	|	КарточкаОферты.ЦеннаяБумага.ISIN КАК ISIN,
	|	КарточкаОферты.ДатаОкончанияПриемаУведомлений КАК ДатаОкончанияПриемаУведомлений
	|ИЗ
	|	Документ.КарточкаОферты КАК КарточкаОферты
	|ГДЕ
	|	НЕ КарточкаОферты.ПометкаУдаления
	|	И КарточкаОферты.ДатаОкончанияПриемаУведомлений МЕЖДУ &НачалоСледующегоКалендарногоДня И &КонецСледующегоРабочегоДня
	|";
	Запрос.УстановитьПараметр("НачалоСледующегоКалендарногоДня", КонецДня(ТекДата) + 1);
	Запрос.УстановитьПараметр("КонецСледующегоРабочегоДня", КонецДня(СледующийРабочийДень));
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаПредупрежденийОПриближенииОкончанияПриемаУведомленийПоОфертам;
		НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
		Если НастройкиОбмена = Неопределено Тогда
			ТекстОшибки = "Не заданы параметры внешнего источника """ + Строка(ВнешнийИсточник) + """";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			ИмяСобытия = "Предупреждения о приближении окончания приема уведомлений по офертам не отправлены";
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
			Возврат;
		КонецЕсли;

		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОтправитьПредупреждениеОПриближенииОкончанияПриемаУведомленийПоОферте(Выборка, НастройкиОбмена);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьПредупреждениеОПриближенииОкончанияПриемаУведомленийПоОферте(Выборка, НастройкиОбмена)
	
	ТемаПисьма = "Заканчивается срок приема уведомлений агентом по оферте";
	ШаблонТекста = "Подходит срок приема уведомлений агентом по оферте ISIN %1. Дата оферты = %2";
	ДатаОфертыСтрокой = Формат(Выборка.ДатаОферты, "ДФ=""дд.ММ.гггг""");
	ТекстПисьма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекста, Выборка.ISIN, ДатаОфертыСтрокой);
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("Вложения",			Неопределено);
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
	
КонецПроцедуры

Процедура ОтправкаУведомленийОПоступленииЗаявленияНаОферту() Экспорт
	ТриЧаса = 10800; // Три часа в секундах
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявлениеНаУчастиеВОферте.Ссылка КАК Заявление
	|ИЗ
	|	Документ.ЗаявлениеНаУчастиеВОферте КАК ЗаявлениеНаУчастиеВОферте
	|ГДЕ
	|	НЕ ЗаявлениеНаУчастиеВОферте.ПометкаУдаления
	|	И НЕ ЗаявлениеНаУчастиеВОферте.УведомитьОПриемеКлиента";
	ТекДата = ТекущаяДатаСеанса();
	Запрос.УстановитьПараметр("ТекущаяДата", ТекДата);
	Запрос.УстановитьПараметр("Вчера", НачалоДня(НачалоДня(ТекДата) - 1) );
	Запрос.УстановитьПараметр("ТриЧаса", ТриЧаса);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОПоявленииНовыхЗаявленийНаУчастиеВОферте;
		НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
		Если НастройкиОбмена = Неопределено Тогда
			ТекстОшибки = "Не заданы параметры внешнего источника """ + Строка(ВнешнийИсточник) + """";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			ИмяСобытия = "Уведомления о появлении новых заявлений на участие в оферте не отправлены";
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Документы.ЗаявлениеНаУчастиеВОферте.ОтправитьУведомлениеОПоявленииНовогоЗаявленияНаУчастиеВОферте(Выборка.Заявление, НастройкиОбмена);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет отправку сообщений из РС ЖурналИсходящихСообщенийKafka
// Параметры:
// КоличествоСообщенийКОтправке - Число - количество сообщений которые могут быть отправлены пр изапуске рег. задания
// УсловиеОтбораСообщений - Текст - Произвольное условие для отбора сообщений
Процедура ОтправкаСообщенийKafka(КоличествоСообщенийКОтправке = Неопределено, УсловиеОтбораСообщений = "") Экспорт
	РегистрыСведений.ЖурналИсходящихСообщенийKafka.ОтправитьСообщениеИсходящее(КоличествоСообщенийКОтправке, УсловиеОтбораСообщений);
КонецПроцедуры

// Выполняет регистрацию клиента
// Параметры:
//  КлючиСообщений - Строка - имена ключей сообщений строкой
Процедура РегистрацияКлиентов(КлючиСообщений) Экспорт
	
	МассивКлючей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючиСообщений);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЖурналВходящихСообщенийKafka.Ключ КАК Ключ,
	|	ЖурналВходящихСообщенийKafka.Сообщение КАК Сообщение,
	|	ЖурналВходящихСообщенийKafka.Идентификатор КАК Идентификатор,
	|	ЖурналВходящихСообщенийKafka.ВнешнийИсточник КАК ВнешнийИсточник
	|ИЗ
	|	РегистрСведений.ЖурналВходящихСообщенийKafka КАК ЖурналВходящихСообщенийKafka
	|ГДЕ
	|	НЕ ЖурналВходящихСообщенийKafka.Обработан
	|	И НЕ ЖурналВходящихСообщенийKafka.ОшибкаОбработки
	|	И ЖурналВходящихСообщенийKafka.Ключ В(&КлючиСообщений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЖурналВходящихСообщенийKafka.Ключ,
	|	ЖурналВходящихСообщенийKafka.ПериодСообщения");
	Запрос.УстановитьПараметр("КлючиСообщений", МассивКлючей);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КлючСообщения = СокрЛП(НРег(Выборка.Ключ));
		Если КлючСообщения = "client" Тогда
			Обработки.РегистрацияКлиентаЧерезKafka.ВыполнитьРегистрациюКлиента(Выборка);
		ИначеЕсли КлючСообщения = "contract" Тогда
			Обработки.РегистрацияКлиентаЧерезKafka.ВыполнитьРегистрациюДоговора(Выборка);
		Иначе
			ЗаписьЖурналаРегистрации("Регистрация клиента",
				УровеньЖурналаРегистрации.Ошибка, , ,
				"Тип сообщения не определен: " + КлючСообщения);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Читает сообщения из топика кафка и записывает в РС ЖурналВходящихСообщенийKafka
// Параметры:
//  ВнешнийИсточник - ПланВидовХарактеристикСсылка.ВнешниеИсточники - топик, для которого определена настройка
Процедура ЧтениеТопикаKafka(ВнешнийИсточник) Экспорт
	Если ЗначениеЗаполнено(ВнешнийИсточник)
		И ТипЗнч(ВнешнийИсточник) = Тип("ПланВидовХарактеристикСсылка.ВнешниеИсточники") Тогда
		ПорцияСообщений = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("28.ПорцияСообщенийKafka", 1);
		Для Итератор = 1 По ПорцияСообщений Цикл
			Кафка.ОбработкаВходящегоСообщения(ВнешнийИсточник);
		КонецЦикла;
	Иначе
		РегЗадание = Метаданные.РегламентныеЗадания.ЧтениеТопикаKafka;
		ОписаниеОшибки = "Не определен внешний источника для топика Kafka";
		ЗаписьЖурналаРегистрации(ОписаниеОшибки, УровеньЖурналаРегистрации.Ошибка,
			РегЗадание,
			РегЗадание.Наименование);
	КонецЕсли;
КонецПроцедуры

// Обработчик регламентного задания
Процедура СозданиеСводныхПоручений() Экспорт
	
	Ключ = "TransactionSpd";
	ОбработкаРегламентногоЗадания = Обработки.СозданиеСводныхПорученийПоДаннымKafka.Создать();
	ВыполнитьДействиеПоВходящемуСообщениюKafka(Ключ, ОбработкаРегламентногоЗадания);
	Обработки.СозданиеПорученийНаПереводЦБПоДаннымKafka.ИсполнитьПорученияНаПереводЦБЗаПредыдущийДень();
	
КонецПроцедуры

// Обработчик регламентного задания
Процедура СозданиеСчетов306() Экспорт
	
	Ключ = "Account";
	ОбработкаРегламентногоЗадания = Обработки.СозданиеСчетов306ПоДаннымКафка.Создать();
	ВыполнитьДействиеПоВходящемуСообщениюKafka(Ключ, ОбработкаРегламентногоЗадания);
	
КонецПроцедуры

// Обработчик регламентного задания ЗагрузкаСтатикиЦБизAPIRuData
//
// Параметры:
//  ДатаВремяОбновленияДанных	 - Дата - Дата время с которой выбираются обновления
//  ISIN						 - Массив - Массив номеров ISIN или строка с одним ISIN, Неопределено - по всем ISIN
//
Функция ЗагрузкаСтатикиЦБизAPIRuData(Знач ДатаВремяОбновленияДанных = Неопределено, ISIN = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаВремяОбновленияДанных) И Не ЗначениеЗаполнено(ISIN) Тогда
		ДатаВремяПоследнегоОбновленияДанных = ТекущаяДатаСеанса();
	Иначе
		ДатаВремяПоследнегоОбновленияДанных = Неопределено;
	КонецЕсли;
	
	Если ДатаВремяОбновленияДанных = Неопределено Тогда
		ДатаВремяОбновленияДанных =
			ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("101.RuData_ДатаВремяПоследнегоОбновленияДанных", Дата(1, 1, 1));
	КонецЕсли;
	
	ISINs = Новый Массив;
	Если ЗначениеЗаполнено(ISIN) Тогда
		Если ТипЗнч(ISIN) = Тип("Массив") Тогда
			ISINs = ISIN;
		ИначеЕсли ТипЗнч(ISIN) = Тип("Строка") Тогда
			ISINs = СтрРазделить(ISIN, ",", Ложь);
		Иначе
			ТекстОшибки = "Ошибка: ISIN должен быть массивом или строкой равной ISIN или строкой с ISIN через запятую.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
	ВходныеПараметры = Новый Структура;
	ВходныеПараметры.Вставить("ДатаВремяОбновленияДанных", ДатаВремяОбновленияДанных);
	ВходныеПараметры.Вставить("ISINs", ISINs);
	ВходныеПараметры.Вставить("ОбновитьБумагиВНеактуальномСтатусе", Истина);
	ВходныеПараметры.Вставить("ОбновитьЭмитентовВсехЗагружаемыхЦБ", Истина);
	
	УспешноеСозданиеОбновлениеЦенныхБумагИЭмитентов = RuDataAPI.СозданиеОбновлениеЦенныхБумагИЭмитентов(ВходныеПараметры);
	
	Если ЗначениеЗаполнено(ДатаВремяПоследнегоОбновленияДанных) И УспешноеСозданиеОбновлениеЦенныхБумагИЭмитентов Тогда
		РегистрыСведений.ПараметрыГлобальные.УстановитьЗначениеПараметра("101.RuData_ДатаВремяПоследнегоОбновленияДанных",
			ДатаВремяПоследнегоОбновленияДанных + 1);
	КонецЕсли;
	
	Возврат УспешноеСозданиеОбновлениеЦенныхБумагИЭмитентов;
	
КонецФункции

// Обработчик регламентного задания
Процедура ПолучениеСтатусовУведомленийКлиентам() Экспорт
	Обработки.ЧтениеИОбработкаСообщенийТопикаNotification.ВыполнитьОбработкуСообщенийNotification();
КонецПроцедуры

// Обработчик регламентного задания ЗагрузкаСтатикиПогашенныхЦБНаОстатках
Процедура ЗагрузкаСтатикиПогашенныхЦБНаОстатках() Экспорт
	RuDataAPI.ВыполнитьОбновлениеПогашенныхЦБ();
КонецПроцедуры

// Обработчик регламентного задания ОтчетПоОшибкамKafka
Процедура ОтчетПоОшибкамKafka() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СУММА(ВложенныйЗапрос.КоличествоИдентификаторов) КАК КоличествоОшибок
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЖурналИсходящихСообщенийKafka.Идентификатор) КАК КоличествоИдентификаторов
	|	ИЗ
	|		РегистрСведений.ЖурналИсходящихСообщенийKafka КАК ЖурналИсходящихСообщенийKafka
	|	ГДЕ
	|		ЖурналИсходящихСообщенийKafka.ОшибкаОтправки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЖурналВходящихСообщенийKafka.Идентификатор)
	|	ИЗ
	|		РегистрСведений.ЖурналВходящихСообщенийKafka КАК ЖурналВходящихСообщенийKafka
	|	ГДЕ
	|		ЖурналВходящихСообщенийKafka.ОшибкаОбработки) КАК ВложенныйЗапрос
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.КоличествоИдентификаторов) > 0");
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Отчеты.ОтчетПоОшибкаKafka.СформироватьИОтправить();
	КонецЕсли;
КонецПроцедуры

// Обработчик регламентного задания
Процедура ПолучениеПлатежныхОпераций() Экспорт
	
	Ключ = "PaymentCA";
	ОбработкаРегламентногоЗадания = Документы.ПлатежнаяОперация;
	ВыполнитьДействиеПоВходящемуСообщениюKafka(Ключ, ОбработкаРегламентногоЗадания,
		ПланыВидовХарактеристик.ВнешниеИсточники.KafkaDiasCorporateEventsOut1655);
	
КонецПроцедуры

// Процедура - Выполнить действие по входящему сообщению kafka
//
// Параметры:
//  Ключ							 - Строка						 - ресурс "Ключ"
//  ОбработкаРегламентногоЗадания	 - ЛюбаяСсылка					 - Ссылка на объект конфигурации,
//  					у которого, через "точку", можно вызвать процедуру ВыполнитьСоздание, для обработки записи регистра
//  ВнешнийИсточник					 - ПланВидовХарактеристикСсылка.ВнешниеИсточники - Измерение "ВнешнийИсточник" (по-умолчанию по всем источникам)
//
Процедура ВыполнитьДействиеПоВходящемуСообщениюKafka(Ключ, ОбработкаРегламентногоЗадания, ВнешнийИсточник = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ключ"			, Ключ);
	Запрос.УстановитьПараметр("ПоВсемИсточникам", Не ЗначениеЗаполнено(ВнешнийИсточник));
	Запрос.УстановитьПараметр("ВнешнийИсточник"	, ВнешнийИсточник);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЖурналВходящихСообщенийKafka.Сообщение КАК Сообщение,
	|	ЖурналВходящихСообщенийKafka.Идентификатор КАК Идентификатор,
	|	ЖурналВходящихСообщенийKafka.ВнешнийИсточник КАК ВнешнийИсточник
	|ИЗ
	|	РегистрСведений.ЖурналВходящихСообщенийKafka КАК ЖурналВходящихСообщенийKafka
	|ГДЕ
	|	ЖурналВходящихСообщенийKafka.Обработан = ЛОЖЬ
	|	И ЖурналВходящихСообщенийKafka.ОшибкаОбработки = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &ПоВсемИсточникам
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЖурналВходящихСообщенийKafka.ВнешнийИсточник = &ВнешнийИсточник
	|		КОНЕЦ
	|	И ЖурналВходящихСообщенийKafka.Ключ = &Ключ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЖурналВходящихСообщенийKafka.ПериодСообщения";
	Если ТипЗнч(ВнешнийИсточник) = Тип("Массив") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВнешнийИсточник = &ВнешнийИсточник", "ВнешнийИсточник В (&ВнешнийИсточник)");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВремяНачалаФормирования = ОценкаПроизводительности.НачатьЗамерВремени();
		ВесЗамера = ВыборкаДетальныеЗаписи.Количество();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбработкаРегламентногоЗадания.ВыполнитьСоздание(ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
		ОценкаПроизводительности.ЗакончитьЗамерВремени("ДействиеПоВходящемуСообщениюKafka" + Ключ, ВремяНачалаФормирования, ВесЗамера);
	КонецЕсли;
	
КонецПроцедуры

Процедура УведомленияПоВыплатамКД() Экспорт
	Обработчик = Обработки.УведомленияПоВыплатамКД.Создать();
	Обработчик.ЗаполнитьДанные();
	Обработчик.ПодготовитьУведомления();
КонецПроцедуры

// Обработчик регламентного задания СервисыИнтерфакса
//
// Параметры:
//  Действие					 - Строка						 - ЗагрузитьКурсыВалютИнтерфакс,
//  						ЗагрузитьКотировкиСПБИнтерфакс, ЗагрузитьКотировкиПрочихТорговыхПлощадокИнтерфакс
//  ТипПериодаЗагрузкиКотировок	 - ПеречислениеСсылка.ПериодыДней	 - ПредыдущийДень, ПредыдущийРабочийДень, ТекущийДень
//  ISINs						 - Строка							 - Фильтр по ISIN через запятую
//
Процедура СервисыИнтерфакса(Действие = Неопределено, ТипПериодаЗагрузкиКотировок = Неопределено, ISINs = "") Экспорт
	
	ИмяНастроекСервиса = "НастройкиИнтерфакс";
	
	MarketData.ВнешниеСервисыВыполнитьДействие(ИмяНастроекСервиса, Действие, ТипПериодаЗагрузкиКотировок, ISINs);
	
КонецПроцедуры

// Обработчик регламентного задания ЗапросДанныхВDiasoft.
// Параметры:
//	НомерРабочегоДняВМесяцеКогдаВыполнять - Число - номер рабочего дня в месяце когда должен выполнять запрос данных из Диасофт.
//		Если вызов процедуры произошел не в указанный порядковый рабочий день текущего месяца, дальнешее выполнение прерывается.
//		Если не указан или равен нулю - проверка не выполняется.
Процедура ЗапросДанныхВDiasoft(НомерРабочегоДняВМесяцеКогдаВыполнять = 0) Экспорт
	ДатаЗапроса = НачалоДня(ТекущаяДатаСеанса());
	Если ЗначениеЗаполнено(НомерРабочегоДняВМесяцеКогдаВыполнять) Тогда
		ДеньНачалаОтсчета = НачалоДня(НачалоМесяца(ДатаЗапроса) - 1);	// Последний день предыдущего месяца
		ДатаКогдаВыполнять = ОбщегоНазначения.ДобавитьРабочийКалендарныйДень(ДеньНачалаОтсчета, НомерРабочегоДняВМесяцеКогдаВыполнять);
		Если ДатаЗапроса <> ДатаКогдаВыполнять Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПолучениеДанныхДиасофтВызовСервера.СоздатьЗапросДанных(ДатаЗапроса);
КонецПроцедуры

// Обработчик регламентного задания ОбработкаОтветовОтDiasoft
Процедура ОбработкаОтветовОтDiasoft() Экспорт
	ПолучениеДанныхДиасофтВызовСервера.ОбработатьОтветы();
КонецПроцедуры

// Обработчик регламентного задания СервисыНРД
//
// Параметры:
//  Действие					 - Строка						 - ЗагрузкаИтоговТорговЧерезNSDAPI
//  ТипПериодаЗагрузкиКотировок	 - ПеречислениеСсылка.ПериодыДней	 - ПредыдущийДень, ПредыдущийРабочийДень, ТекущийДень
//  ISINs						 - Строка							 - Фильтр по ISIN через запятую
//
Процедура СервисыНРД(Действие = Неопределено, ТипПериодаЗагрузкиКотировок = Неопределено, ISINs = "") Экспорт
	
	ИмяНастроекСервиса = "НастройкиНРД";
	
	MarketData.ВнешниеСервисыВыполнитьДействие(ИмяНастроекСервиса, Действие, ТипПериодаЗагрузкиКотировок, ISINs);
	
	Если ЗначениеЗаполнено(ТипПериодаЗагрузкиКотировок) Тогда
		ДатаКотировокКВыгрузке = Перечисления.ПериодыДней.ДатаПоТипуПериода(ТипПериодаЗагрузкиКотировок, ТекущаяДатаСеанса());
		НРД = Справочники.ИнформационноАналитическиеСистемы.НРД;
		Обработки.ВыгрузкаКотировокВBackQort.СохранитьНастройкуВыгрузки(НРД, , ДатаКотировокКВыгрузке);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик регламентного задания СервисыCBonds
//
// Параметры:
//  Действие					 - Строка						 - ЗагрузкаИтоговТорговЧерезCBondsAPI
//  ТипПериодаЗагрузкиКотировок	 - ПеречислениеСсылка.ПериодыДней	 - ПредыдущийДень, ПредыдущийРабочийДень, ТекущийДень
//  ISINs						 - Строка							 - Фильтр по ISIN через запятую
//
Процедура СервисыCBonds(Действие = Неопределено, ТипПериодаЗагрузкиКотировок = Неопределено, ISINs = "") Экспорт
	
	ИмяНастроекСервиса = "НастройкиCBonds";
	
	MarketData.ВнешниеСервисыВыполнитьДействие(ИмяНастроекСервиса, Действие, ТипПериодаЗагрузкиКотировок, ISINs);
	
	ВыполненаЗагрузкаКотировок = ЗначениеЗаполнено(ТипПериодаЗагрузкиКотировок)
		И ЗначениеЗаполнено(Действие) И СтрНайти(Действие, "Котировки") > 0;
	ВыполненаЗагрузкаКупонов = ЗначениеЗаполнено(ТипПериодаЗагрузкиКотировок)
		И ЗначениеЗаполнено(Действие) И СтрНайти(Действие, "Купоны") > 0;
	
	Если ВыполненаЗагрузкаКотировок Тогда
		ДатаКотировокКВыгрузке = Перечисления.ПериодыДней.ДатаПоТипуПериода(ТипПериодаЗагрузкиКотировок, ТекущаяДатаСеанса());
		CBonds = Справочники.ИнформационноАналитическиеСистемы.CBonds;
		Обработки.ВыгрузкаКотировокВBackQort.СохранитьНастройкуВыгрузки(CBonds, , ДатаКотировокКВыгрузке);
	КонецЕсли;
	Если ВыполненаЗагрузкаКупонов Тогда
		ДатаНКДКВыгрузке = Перечисления.ПериодыДней.ДатаПоТипуПериода(ТипПериодаЗагрузкиКотировок, ТекущаяДатаСеанса());
		CBonds = Справочники.ИнформационноАналитическиеСистемы.CBonds;
		Обработки.ВыгрузкаНКДВBackQort.СохранитьНастройкуВыгрузки(CBonds, , ДатаНКДКВыгрузке);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик регламентного задания ФормированиеСпискаИностранныхЦенныхБумагДляЗапросаКотировок
//
// Параметры:
//  Период	 - Дата	 - Дата запроса остатков по ценным бумагам (на начало дня)
//
Процедура ФормированиеСпискаИностранныхЦенныхБумагДляЗапросаКотировок(Знач Период = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Период) Тогда
		Период = НачалоДня(Период);
	Иначе
		Период = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	ЦенныеБумагиДляДобавленияВЗапросКотировок =
		РегистрыСведений.ЦенныеБумагиВЗапросеКотировок.ИностранныеЦенныеБумагиДляДобавленияВЗапросКотировок(Период);
	РегистрыСведений.ЦенныеБумагиВЗапросеКотировок.ДобавитьЗаписи(ЦенныеБумагиДляДобавленияВЗапросКотировок);
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОНовыхЦенныхБумагахВЗапросКотировок;
	ДатаВнесенияВСписок = НачалоДня(Период - 1);
	ТипыЦенныхБумаг = Новый Массив;
	ТипыЦенныхБумаг.Добавить(Перечисления.ТипыЦБ.Акция);
	ТипыЦенныхБумаг.Добавить(Перечисления.ТипыЦБ.ДепозитарнаяРасписка);
	ТипыЦенныхБумаг.Добавить(Перечисления.ТипыЦБ.Пай);
	ТипыЦенныхБумаг.Добавить(Перечисления.ТипыЦБ.КлиринговыйСертификатУчастия);
	РегистрыСведений.ЦенныеБумагиВЗапросеКотировок.РассылкаОтчетаОЦенныхБумагахВнесенныхВЗапросКотировокЗаДату(ВнешнийИсточник,
		ДатаВнесенияВСписок, ТипыЦенныхБумаг);
	
КонецПроцедуры

// Обработчик регламентного задания ВыгрузкаКотировокВBackQort
//
// Параметры:
//  Действие - ПеречислениеСсылка.ВидыДействийВыгрузкиКотировокВBackQort - ВыгрузитьЗагруженныеКотировки, ВыгрузитьКотировки
//  ТипПериодаВыгрузкиКотировок - ПеречислениеСсылка.ПериодыДней	 - ПредыдущийДень, ПредыдущийРабочийДень, ТекущийДень
//
Процедура ВыгрузкаКотировокВBackQort(Действие = Неопределено, ТипПериодаВыгрузкиКотировок = Неопределено) Экспорт
	
	Обработки.ВыгрузкаКотировокВBackQort.ВыгрузитьКотировкиРегламентно(Действие, ТипПериодаВыгрузкиКотировок);
	
КонецПроцедуры

// Обработчик регламентного задания ВыгрузкаНКДВBackQort
//
// Параметры:
//  Действие				 - ПеречислениеСсылка.ВидыДействийВыгрузкиКотировокВBackQort - ВыгрузитьЗагруженныеКотировки, ВыгрузитьКотировки
//  ТипПериодаВыгрузкиНКД	 - ПеречислениеСсылка.ПериодыДней							 - ПредыдущийДень, ПредыдущийРабочийДень, ТекущийДень
//
Процедура ВыгрузкаНКДВBackQort(Действие = Неопределено, ТипПериодаВыгрузкиНКД = Неопределено) Экспорт
	
	Обработки.ВыгрузкаНКДВBackQort.ВыгрузитьНКДРегламентно(Действие, ТипПериодаВыгрузкиНКД);
	
КонецПроцедуры

// Обработчик регламентного задания ВыгрузкаОбращаемостиЦБВBackQort
//
Процедура ВыгрузкаОбращаемостиЦБВBackQort() Экспорт
	Обработки.ВыгрузкаОбращаемостиЦБВBackQort.ВыгрузитьОбращаемостьЦБРегламентно();
КонецПроцедуры

// Обработчик регламентного задания ОбработкаВнешнихЗапросовRequest
//
Процедура ОбработкаВнешнихЗапросовRequest() Экспорт
	Ключ = "Request";
	ОбработкаРегламентногоЗадания = Обработки.ОбработкаВнешнихЗапросовRequest.Создать();
	ВыполнитьДействиеПоВходящемуСообщениюKafka(Ключ, ОбработкаРегламентногоЗадания);
КонецПроцедуры

// BSLLS:NumberOfOptionalParams-on

// Обработчик регламентного задания ПолучениеЦеныПоследнейСделкиИзBQ
//
Процедура ПолучитьЦенуПоследнейСделки() Экспорт
	
	Ключ = "LastTradePrice";
	ОбработкаРегламентногоЗадания = ПолучениеЦеныПоследнейСделки;	// ЭтоОбщийМодуль
	ВнешниеИсточники = Новый Массив;
	ВнешниеИсточники.Добавить(ПланыВидовХарактеристик.ВнешниеИсточники.KafkaBqToDepoLastTradePrice1643);
	ВнешниеИсточники.Добавить(ПланыВидовХарактеристик.ВнешниеИсточники.KafkaDiasToDepoLastTradePrice1655);
	ВыполнитьДействиеПоВходящемуСообщениюKafka(Ключ, ОбработкаРегламентногоЗадания, ВнешниеИсточники);
	
КонецПроцедуры

// Рассылка сверки с BQ/NRD
Процедура РассылкаСверкиДепо() Экспорт

	Если ОбщегоНазначения.РабочийДень() Тогда
		ДатаСверки = ОбщегоНазначения.ПредыдущийРабочийДень(ТекущаяДатаСеанса());
		
		Отчет = Отчеты.СверкаЦБсНРДДепозитарий.Создать();
		Отчет.ВыполнитьРассылку(ДатаСверки);
	КонецЕсли;

КонецПроцедуры

// Обработчик регламентного задания ФормированиеОтложенныхПлатежейИНалогов
//
// Параметры:
//  Период	 - Дата	 - Текущая дата
//
Процедура СформироватьОтложенныеПлатежиИНалоги(Знач Период = Неопределено) Экспорт
	
	ВремяНачалаФормирования = ОценкаПроизводительности.НачатьЗамерВремени();
	ВесЗамера = 0;
	Если ЗначениеЗаполнено(Период) Тогда
		ТекущаяДата = НачалоДня(Период);
	Иначе
		ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	Документы.Поручение.НайтиИПровестиПорученияСОтложеннымиПлатежамиИНалогами(ТекущаяДата, ВесЗамера);
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ФормированиеОтложенныхПлатежейИНалогов", ВремяНачалаФормирования, ВесЗамера);
	
КонецПроцедуры

// Обработчик регламентного задания СозданиеРСВПоСобраниям
Процедура СозданиеРСВПоСобраниям() Экспорт
	Попытка
		ОбработкаСозданияРСВ = Обработки.СозданиеРСВПоСобраниям.Создать();
		Сутки = ОбщегоНазначенияПовтИсп.СекундВСутках();
		ГлубинаПроверки = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("2257.ГлубинаПроверкиДокументовВДняхДляСозданияРСВПоСобраниям");
		ОбработкаСозданияРСВ.Период.ДатаОкончания = ТекущаяДатаСеанса() - Сутки;
		ОбработкаСозданияРСВ.Период.ДатаНачала = ОбработкаСозданияРСВ.Период.ДатаОкончания - ГлубинаПроверки * Сутки;
		ОбработкаСозданияРСВ.Заполнить();
		ОбработкаСозданияРСВ.СоздатьРСВ();
	Исключение
		ЗаписьЖурналаРегистрации(ОписаниеОшибки(), УровеньЖурналаРегистрации.Ошибка);
	КонецПопытки;
КонецПроцедуры

// Выполняет загрузку данных о ЦБ входящих в в перечень бумаг высокотехнологичного (инновационного)
// сектора экономики с сайта МММВБ
Процедура ЗагрузкаПеречняБумагИнновационногоСектораЭкономики() Экспорт
	Обработка = Обработки.ЗагрузкаПеречняБумагИнновационногоСектораЭкономики.Создать();
	Обработка.ЗагрузитьИнформациюССайтаММВБ();
	Обработка.ОбновитьИнформациюВСправочникеЦБ();
	Обработка.ОтправитьУведомлениеОбИзменениях();
	Обработка = Неопределено;
КонецПроцедуры

Процедура ОтправкаСпискаКДвДепозитарииКлиентскиеЦБ() Экспорт
	ТекущаяДата = ТекущаяДатаСеанса();
	Если Не ОбщегоНазначения.РабочийДень(ТекущаяДата) Тогда
		Возврат;
	КонецЕсли;
	
	Обработки.ОтправкаСпискаКДвДепозитарииКлиентскиеЦБ.ВыполнитьОтправкуРегламентно();
КонецПроцедуры

// Выполняет сверку статики ЦБ с backQORT
Процедура СверкаСтатикиЦБ_ДЕПО_BQ() Экспорт
	ОбработкаОбъект = Обработки.СверкаПоСтатикеЦБв1СиBQ.Создать();
	ОбработкаОбъект.ЗаполнитьСписокЦБ();
	ТабДокРезультат = ОбработкаОбъект.РезультатСверкиДанных();
	
	Если ОбработкаОбъект.НайденыРасхождения() Тогда
		ОтправитьУведомлениеОРасхожденияхВСтатике(ТабДокРезультат);
	КонецЕсли;
	
	ОбработкаОбъект = Неопределено;
КонецПроцедуры

Процедура ОтправитьУведомлениеОРасхожденияхВСтатике(ТабДокРезультат)
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОРасхожденияхПриСверкеСтатикиЦБМежду1СДепоИBQ;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	Если НастройкиОбмена = Неопределено Тогда
		ТекстОшибки = "Не заданы параметры внешнего источника """ + Строка(ВнешнийИсточник) + """";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ИмяСобытия = "Уведомление о расхождениях в статике ЦБ с backQORT не отправлено";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Предупреждение, , , ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	// Нам нужно получить из табличного документа HTML в виде текстовой строки. Можно писать НТML в файл на диск,
	// а можно в поток в память и из потока уже получить в виде текста (это конечно красивей, правильней и безопасней
	// чем временный файл создавать). Но у платформы 1С текущей версии 8.3.21.1674 оказывается есть не отраженное 
	// в справке ограничение: другие типы файлов, напрмер таблицы Excel в поток в памяти писать можно, а HTML почему-то
	// нет - только на диск. Поэтому делаем через временный файл.
	ИмяФайла = ПолучитьИмяВременногоФайла("html");
	ТабДокРезультат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.HTML);
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ИмяФайла);
	ТекстПисьма = ТекстДок.ПолучитьТекст();
	УдалитьФайлы(ИмяФайла);
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			"Обнаружены расхождения в статике ЦБ между 1С ДЕПО и backQORT");
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.HTML);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКОтправке(ПараметрыУведомления);
КонецПроцедуры

// BSLLS:NumberOfOptionalParams-off

// Обработчик регламентного задания РасчетРыночныхЦенЦенныхБумаг
//
// Параметры:
//  НачалоПериода					 - Дата	 - Начало периода расчета
//  ОкончаниеПериода				 - Дата	 - Окончание периода расчета
//  ISINs							 - Строка	 - Фильтр по ISIN через запятую
//  ЗапросЦеныПоследнейСделкиПоISIN	 - Булево	 - Принудительно полученить цену последней цены сделки
//
Процедура ВыполнитьРасчетРыночныхЦенЦенныхБумагДля0409404(Знач НачалоПериода = Неопределено, 
				Знач ОкончаниеПериода = Неопределено, ISINs = "", ЗапросЦеныПоследнейСделкиПоISIN = Ложь) Экспорт
	Отказ					 = Ложь;
	ТекстОтказа				 = "";
	ПоОстаткам				 = Истина;
	ОтправлятьУведомление	 = Истина;
	
	Если Не ЗначениеЗаполнено(НачалоПериода) Или Не ЗначениеЗаполнено(ОкончаниеПериода) Тогда
		НачалоПериода = НачалоДня(НачалоДня(ТекущаяДатаСеанса()) - 1);
		ОкончаниеПериода = КонецДня(НачалоПериода);
	КонецЕсли;
	
	Если ОбщегоНазначения.РабочийДень(НачалоПериода) Тогда
		ВходящиеПараметры = Новый Структура;
		ВходящиеПараметры.Вставить("МетодикаРасчета", Перечисления.МетодикиРасчетаРыночныхЦен.Для0409404);
		ВходящиеПараметры.Вставить("ПоОстаткам", ПоОстаткам);
		ВходящиеПараметры.Вставить("ISINs", ISINs);
		ВходящиеПараметры.Вставить("ЗапросЦеныПоследнейСделкиПоISIN", ЗапросЦеныПоследнейСделкиПоISIN);
		ВходящиеПараметры.Вставить("БезЗапросаЦеныПоследнейСделки", Ложь);
		ВходящиеПараметры.Вставить("НачалоПериода", НачалоПериода);
		ВходящиеПараметры.Вставить("ОкончаниеПериода", ОкончаниеПериода);
		
		РасчетРыночныхЦенДля0409404.РассчитатьРыночныеЦены(ВходящиеПараметры, Отказ, ТекстОтказа, ОтправлятьУведомление);
	Иначе
		ПоОстаткам = Истина;
		РасчетРыночныхЦенДля0409404.РассчитатьРыночныеЦеныЗаНерабочийДень(НачалоПериода, ПоОстаткам, ISINs, Отказ, ТекстОтказа);
	КонецЕсли;
	
	Если Отказ Тогда
		ВызватьИсключение ТекстОтказа;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьРасчетРыночныхЦенЦенныхБумагДля481(Знач ДатаРасчета = Неопределено,
				ISINs = "", ЗапросЦеныПоследнейСделкиПоISIN = Ложь) Экспорт
	Отказ					 = Ложь;
	ТекстОтказа				 = "";
	ПоОстаткам				 = Истина;
	ОтправлятьУведомление	 = Истина;
		
	Если Не ЗначениеЗаполнено(ДатаРасчета) Тогда
		ДатаРасчета = НачалоДня(НачалоКвартала(ТекущаяДатаСеанса()) - 1);
	КонецЕсли;
	
	ВходящиеПараметры = Новый Структура;
	ВходящиеПараметры.Вставить("МетодикаРасчета", Перечисления.МетодикиРасчетаРыночныхЦен.Для481);
	ВходящиеПараметры.Вставить("ПоОстаткам", ПоОстаткам);
	ВходящиеПараметры.Вставить("ISINs", ISINs);
	ВходящиеПараметры.Вставить("ЗапросЦеныПоследнейСделкиПоISIN", ЗапросЦеныПоследнейСделкиПоISIN);
	ВходящиеПараметры.Вставить("БезЗапросаЦеныПоследнейСделки", Ложь);
	ВходящиеПараметры.Вставить("ДатаРасчета", ДатаРасчета);
		
	РасчетРыночныхЦенДля481.РассчитатьРыночныеЦены(ВходящиеПараметры, Отказ, ТекстОтказа, ОтправлятьУведомление);
	
	Если Отказ Тогда
		ВызватьИсключение ТекстОтказа;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик регламентного задания СозданиеПорученийНаПереводЦБ
//
Процедура СозданиеПорученийНаПереводЦБ() Экспорт
	Ключ = "TransactionTransf";
	ОбработкаРегламентногоЗадания = Обработки.СозданиеПорученийНаПереводЦБПоДаннымKafka.Создать();
	ВыполнитьДействиеПоВходящемуСообщениюKafka(Ключ, ОбработкаРегламентногоЗадания);
КонецПроцедуры

// Обработчик регламентного задания КонтрольОперацийСОбособленнымиЦБ
Процедура КонтрольОперацийСОбособленнымиЦБ() Экспорт
	Отчет = Отчеты.КонтрольОперацийСОбособленнымиЦБ.Создать();
	ПредыдущийКалендарныйДень = НачалоДня(НачалоДня(ТекущаяДатаСеанса()) - 1);
	Отчет.ПериодНачало = ПредыдущийКалендарныйДень;
	Отчет.ПериодКонец = ПредыдущийКалендарныйДень;
	Ошибки = "";
	ДанныеДляЗаполнения = Отчет.ДанныеДляЗаполнения(Ошибки);
	Если ДанныеДляЗаполнения.Количество() > 0 Тогда
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОбОперацияхСОбособленнымиЦБ;
		НастройкаОтправки = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
		Если Не НастройкаОтправки = Неопределено Тогда
			Результат = Новый ТабличныйДокумент;
			Отчет.ЗаполнитьОтчет(Результат, ДанныеДляЗаполнения);
			Расширение = "xlsx";
			ВременныйФайл = ПолучитьИмяВременногоФайла(Расширение);
			ПредыдущийКалендарныйДеньСтрокой = Формат(ПредыдущийКалендарныйДень, "ДФ=dd_MM_yyyy");
			ИмяВременногоФайла = "ИнформацияОЦенныхБумагахВОтношенииКоторыхОбеспеченОбособленныйУчетЗа_" + ПредыдущийКалендарныйДеньСтрокой;
			Результат.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента.XLSX);
			Вложения = Новый Соответствие;
			ПараметрыУведомления = Новый Соответствие;
			ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкаОтправки);
			ПараметрыУведомления.Вставить("ТемаПисьма",			"Контроль за операциями с обособленными цб за дату " + ПредыдущийКалендарныйДеньСтрокой);
			ТекстПисьма = "За дату " + ПредыдущийКалендарныйДеньСтрокой
							+ " найдены операции с обособленными ценными бумагами. Информация в приложенном файле";
			Если Не ПустаяСтрока(Ошибки) Тогда
				ТекстПисьма = ТекстПисьма + Символы.ВК + Символы.ВК 
								+ "В процессе построения отчета выявлены следующие ошибки:" + Символы.ВК + Ошибки;
			КонецЕсли;
			ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
			ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.HTML);
			ПараметрыУведомления.Вставить("Кодировка",			"windows-1251");
			ДанныеФайла = Новый ДвоичныеДанные(ВременныйФайл);
			Вложения.Вставить(ИмяВременногоФайла + "." + Расширение, ДанныеФайла);
			ПараметрыУведомления.Вставить("Вложения", Вложения);
			РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
			УдалитьФайлы(ВременныйФайл);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Выполняет выгрузку измененных объектов, а именно ЦБ и юридических лиц - эмитентов в очередь Kafka для экспорта
// в другие системы (в момент написания этого комментария - только backQORT). Под объектами понимаются не только
// сами справочники, но и ряд регистров, содержащих связанную c основным объектом информацию (например, РС НоминалЦБ).
// С другой стороны, выгружается только часть реквизитов и именно эта часть реквизитов проверяется на наличие
// реальных изменений по сравнению с прошлой выгрузкой.
// Параметры:
//	ТолькоОбновлениеХэшей - Булево - необязательный параметр, при его наличии со значением Истина, не происходит реальной
//									выгрузки изменений в Kafka, но происходит перерасчет и обновление хэшей измененных
//									объектов в РС СтатусыОбъектовКОтправке, причем они получают статус обработанных.
Процедура ВыгрузкаОбъектовВKafka(ТолькоОбновлениеХэшей = Ложь) Экспорт
	Если Не ОбщегоНазначенияПовтИсп.ВыгрузкаИзмененныхОбъектовВКафкаВключена() И Не ТолькоОбновлениеХэшей Тогда
		Возврат;
	КонецЕсли;
	
	Задержка = 1;	// Задержка в секундах - нужно, чтобы в одну и ту же секунду не произошло три события:
					// изменение объекта, считывание измененных записей и еще одно изменение этого же объекта
					// в ту же секунду. В таком случае мы бы не поняли, что еще одно необработанное изменение
					// произошло, так как время последнего изменения осталось прежним.
	
	ДатаОтбора = ТекущаяДатаСеанса() - Задержка;
	ИзмененныеОбъекты = ВыгрузкаИзмененныхОбъектов.ИзмененныеОбъекты(ДатаОтбора);
	
	// Выгрузим все ценные бумаги, у которых есть реальные изменения и вместе с ними их эмитентов, если у них есть реальные изменения
	ВыгрузкаИзмененныхОбъектов.ВыгрузитьЦенныеБумаги(ИзмененныеОбъекты.ЦенныеБумаги, ИзмененныеОбъекты.Эмитенты, ТолькоОбновлениеХэшей);
	
	// Выгрузим остаток эмитентов у которых есть реальные изменения (по которым не было реальных изменений у ЦБ этих эмитентов и которые,
	// соответственно не были выгружены ранее вместе с ЦБ)
	ВыгрузкаИзмененныхОбъектов.ВыгрузитьЭмитентов(ИзмененныеОбъекты.Эмитенты, ТолькоОбновлениеХэшей);
КонецПроцедуры




