//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Остатки.Количество() = 0 Тогда
		
		Сообщить("Не введено ни одной строки");  
		Отказ = Истина;			
		
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ (ВРегистрОстаткиЦБ ИЛИ ВРегистрОстаткиЦБДепозитарийМХ ИЛИ ВРегистрОстаткиЦБМестоРасчетов) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Необходимо выбрать хотя бы один регистр для ввода остатков.", Отказ);
		Возврат;
	КонецЕсли;
	
	Если ВРегистрОстаткиЦБ Тогда
		ДобавитьПриходПоРегистру(Движения.ОстаткиЦБ);
	КонецЕсли;
	
	Если ВРегистрОстаткиЦБДепозитарийМХ Тогда
		ДобавитьПриходПоРегистру(Движения.ОстаткиЦБДепозитарийМХ);
	КонецЕсли;
	
	Если ВРегистрОстаткиЦБМестоРасчетов Тогда
		ДобавитьПриходПоРегистру(Движения.ОстаткиЦБМестоРасчетов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПриходПоРегистру(НаборЗаписей)
	
	Для Каждого ТекСтрокаОстатки Из Остатки Цикл
		
		Движение = НаборЗаписей.ДобавитьПриход();
		Движение.Период				= Дата;
		Движение.СчетДепо			= ТекСтрокаОстатки.СчетДепо;
		Движение.РазделСчетаДепо	= ТекСтрокаОстатки.РазделСчетаДепо;
		Движение.ЦБ					= ТекСтрокаОстатки.ЦБ;
		Движение.СчетДепоМХ			= ТекСтрокаОстатки.СчетДепоМХ;
		Движение.РазделСчетаДепоМХ	= ТекСтрокаОстатки.РазделСчетаДепоМХ;
		Движение.СтатусЦБ			= ТекСтрокаОстатки.СтатусЦБ;
		Движение.Количество			= ТекСтрокаОстатки.Количество;
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//процедуры печати
//
// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	СтруктураПечатныхФорм = Новый Структура;
	Возврат СтруктураПечатныхФорм;
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

