
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем МестоРожденияСтрокой;
	
	Если НЕ Параметры.Свойство("МестоРожденияСтрокой", МестоРожденияСтрокой) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;	
	КонецЕсли; 
	
	СтруктураМестоРождения = РегламентированнаяОтчетность.РазложитьМестоРождения(МестоРожденияСтрокой, Истина);
	Особое  = СтруктураМестоРождения.Особое;
	Город   = СтруктураМестоРождения.НаселенныйПункт;
	Район   = СтруктураМестоРождения.Район;
	Область = СтруктураМестоРождения.Область;
	Страна  = СтруктураМестоРождения.Страна;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда
		Ответ = Вопрос("Данные были изменены. Сохранить изменения перед выходом?", РежимДиалогаВопрос.ДаНетОтмена);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			СохранитьИЗакрытьНаКлиенте();
			
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда 
			Отказ = Истина;
			
		КонецЕсли; 		
	КонецЕсли; 

КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	СохранитьИЗакрытьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда) 
	Модифицированность = Ложь;
	Закрыть();
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СохранитьИЗакрытьНаКлиенте()
	
	Модифицированность = Ложь;
	МестоРожденияСтрокой = ""+СокрЛП(ОсобоеМестоРождения)+","+СокрЛП(Город)+","+СокрЛП(Район)+","+СокрЛП(Область)+","+СокрЛП(Страна);
	Закрыть(МестоРожденияСтрокой);
	
КонецПроцедуры
 
//#КонецОбласти

