&НаСервере
Перем мТекущийОбъектНаСервере;

&НаКлиенте
Перем мФормаВводаМестаРождения;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КонтактнаяИнформацияСервер.ПриСозданииНаСервере(ЭтаФорма);
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	ПрочитатьПреобразуемыеДанные();
	
	ОбновитьЗаголовокФормы(ЭтаФорма);
	УстановитьДоступностьКомандыКодыЗагрузки();
	СписокW8УстановитьОтборы();
	КвалифицированныйИнвесторУстановитьОтборы();
	КлиентыДоговорыУстановитьОтборы();
	КлиентскиеМенеджерыУстановитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовФормы()
	Элементы.СтраницаКвалифицированныйИнвестор.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.СтраницаКлиентыДоговоры.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ВыполнитьОбработкуОповещения = ИмяСобытия = "ОбновитьФорму" И (Источник = Объект.Ссылка
		Или (ТипЗнч(Источник) = Тип("СправочникСсылка.ФизическиеЛица") И Источник.Пустая()));
		
	Если ВыполнитьОбработкуОповещения Тогда
			
		ИмяОбновляемогоЭлемента = Параметр.ИмяЭлемента;

		Если ИмяОбновляемогоЭлемента = "Гражданство" Тогда
			ПрочитатьГражданствоНаСервере();
			
		ИначеЕсли ИмяОбновляемогоЭлемента = "УдостоверениеЛичности" Тогда
			ПрочитатьУдостоверениеНаСервере();
			
		ИначеЕсли ИмяОбновляемогоЭлемента = "ФИО" Тогда
			ПрочитатьФИОНаСервере();

		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	УстановитьДоступностьКомандыКодыЗагрузки();
	// Запись в регистр контактной информации
	КонтактнаяИнформацияСервер.ПриЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, Отказ);
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СписокW8УстановитьОтборы();
	КвалифицированныйИнвесторУстановитьОтборы();
	КлиентыДоговорыУстановитьОтборы();
	КлиентскиеМенеджерыУстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ФИО = Объект.Наименование;

	Если ПустаяСтрока(Фамилия) ИЛИ ЭтоНовый(ЭтаФорма) Тогда
		Фамилия  = ВыделитьСлово(ФИО);
		Имя      = ВыделитьСлово(ФИО);
		Отчество = ВыделитьСлово(ФИО);
		
		ОбновитьСписокВыбораНаименования(ЭтаФорма);
	КонецЕсли;

	ОбновитьЗаголовокФормы(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КодИМНСПриИзменении(Элемент)
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Объект.ИНН) Тогда
		Объект.ИНН = Объект.КодИМНС;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Объект.КодИМНС) Тогда
		Объект.КодИМНС = Лев(Объект.ИНН, 4);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдостоверениеЛичностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекстВопроса = "Перед вводом паспортных данных необходимо записать элемент. Записать?";
	Если НЕ РазрешеноОткрытьФормуВспомогательногоРегистра(ТекстВопроса) Тогда
		Возврат;		
	КонецЕсли; 
	
	ОткрытьФорму("РегистрСведений.ПаспортныеДанныеФизЛиц.Форма.ФормаЗаписиДополнительная"
		, ОтборПоСсылке(ЭтаФорма)
		, ЭтаФорма
		,
		,
		,
		, 
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекстВопроса = "Перед вводом данных о гражданстве необходимо записать элемент. Записать?";
	Если НЕ РазрешеноОткрытьФормуВспомогательногоРегистра(ТекстВопроса) Тогда
		Возврат;		
	КонецЕсли; 
	
	ОткрытьФорму("РегистрСведений.ГражданствоФизЛиц.Форма.ФормаЗаписиДополнительная"
		, ОтборПоСсылке(ЭтаФорма)
		, ЭтаФорма
		,
		,
		,
		, 
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	КонецПроцедуры
	
&НаКлиенте
Процедура НаборW8ПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.НаборW8.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ПредоставленнаяФорма) Тогда
		ФормаW8 = ТекущиеДанные.ПредоставленнаяФорма;
	Иначе
		ФормаW8 = ПредопределенноеЗначение("Справочник.ФормыW8.ПустаяСсылка");
	КонецЕсли;
	Элементы.Группа1.Доступность = НЕ ФормаW8.Пустая();
КонецПроцедуры

&НаКлиенте
Процедура НаборКонтактнаяИнформацияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	КонтактнаяИнформацияКлиент.НачалоВыбораПредставления(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КлиентыДоговорыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанныеТаблицыКлиентыДоговоры = Элементы.КлиентыДоговоры.ТекущиеДанные;
	Если ТекДанныеТаблицыКлиентыДоговоры <> Неопределено Тогда
		Если Элементы.КлиентыДоговоры.ТекущийЭлемент = Элементы.КлиентыДоговорыКлиент Тогда
			ПоказатьЗначение(,ТекДанныеТаблицыКлиентыДоговоры.Клиент);
		ИначеЕсли Элементы.КлиентыДоговоры.ТекущийЭлемент = Элементы.КлиентыДоговорыДоговор Тогда
			ПоказатьЗначение(,ТекДанныеТаблицыКлиентыДоговоры.Договор);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КодыЗагрузки(Команда)
	ФормаСписка = ПолучитьФорму("Справочник.КодыЗагрузки.ФормаСписка", , ЭтаФорма);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаСписка.Список
		, "Владелец"
		, Объект.Ссылка);
		
	ФормаСписка.Открыть();		
КонецПроцедуры

&НаКлиенте
Процедура ВызовДанныхФИО(Команда)

	ЭтоНовый = ЭтоНовый(ЭтаФорма);
	ТекстВопроса = "Перед переходом к дополнительным данным о физ. лице необходимо записать элемент. Записать?";
	Если НЕ РазрешеноОткрытьФормуВспомогательногоРегистра(ТекстВопроса) Тогда
		Возврат;		
	КонецЕсли; 
	
	Если ЭтоНовый Тогда
		ЗаписатьДанныеФИОНовогоЭлемента();		
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.ФИОФизЛиц.Форма.ФормаЗаписиДополнительная"
		, ОтборПоСсылке(ЭтаФорма)
		, ЭтаФорма
		,
		,
		,
		, 
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	КонецПроцедуры
	
&НаКлиенте
Процедура Печать(Команда)
	ТабличныйДокумент = ПечатьНаСервере();
	ТабличныйДокумент.Показать("Данные по: " + Объект.Наименование);
КонецПроцедуры

&НаСервере
Процедура СписокW8УстановитьОтборы() 
	
	РегистрыСведений.ПредоставленныеДокументы.УстановитьОтборыW8(Объект.Ссылка,НаборW8);
	Элементы.СтраницаФормыW8.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура КвалифицированныйИнвесторУстановитьОтборы()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КвалифицированныйИнвестор,
		"ЮрФизЛицо", Объект.Ссылка, , , ЗначениеЗаполнено(Объект.Ссылка));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КвалифицированныйИнвестор,
		"Организация", Константы.ОрганизацияПоУмолчанию.Получить(), , , ЗначениеЗаполнено(Объект.Ссылка));
КонецПроцедуры

&НаСервере
Процедура КлиентыДоговорыУстановитьОтборы()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КлиентыДоговоры, "ЮрФизЛицо",
		Объект.Ссылка, , , ЗначениеЗаполнено(Объект.Ссылка));
КонецПроцедуры

&НаСервере
Процедура КлиентскиеМенеджерыУстановитьОтборы()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КлиентскиеМенеджеры, "ЮрФизЛицо",
		Объект.Ссылка, , , ЗначениеЗаполнено(Объект.Ссылка));
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	
	Возврат РеквизитФормыВЗначение("Объект").Печать();
	
КонецФункции // Печать

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоНовый(Форма)
	Возврат НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка);	
КонецФункции 

&НаКлиенте
Процедура ПослеВводаМестаРождения(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;		
	КонецЕсли; 
	
	Объект.МестоРождения = Результат;
	
КонецПроцедуры

&НаКлиенте
Функция РазрешеноОткрытьФормуВспомогательногоРегистра(ТекстВопроса)
	Если ЭтоНовый(ЭтаФорма) Тогда
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат Ложь;
		КонецЕсли;		
		Если Не Записать() Тогда
			Возврат Ложь;			
		КонецЕсли;				
	КонецЕсли;
	
	Возврат Истина;
		
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСписокВыбораНаименования(Форма)
	
	СписокВыбора = Форма.Элементы.Наименование.СписокВыбора;	
	СписокВыбора.Очистить();
	
	Фамилия = Форма.Фамилия;
	Имя = Форма.Имя;
	Отчество = Форма.Отчество;
	
	Если Не ОбщегоНазначения.ЗначениеНеЗаполнено(Фамилия) Тогда
		СписокВыбора.Добавить(Фамилия);
		Если Не ОбщегоНазначения.ЗначениеНеЗаполнено(Имя) Тогда
			СписокВыбора.Добавить(СокрЛП(Фамилия) + " " + СокрЛП(Имя));
			СписокВыбора.Добавить(СокрЛП(Фамилия) + " " + Лев(Имя, 1) + ".");
			Если Не ОбщегоНазначения.ЗначениеНеЗаполнено(Отчество) Тогда
				СписокВыбора.Добавить(СокрЛП(Фамилия) + " " + СокрЛП(Имя) + " " + СокрЛП(Отчество));
				СписокВыбора.Добавить(СокрЛП(Фамилия) + " " + Лев(Имя, 1) + ". " + Лев(Отчество, 1)+ ".");
 			КонецЕсли;
		 КонецЕсли;
	Иначе
		Если Не ОбщегоНазначения.ЗначениеНеЗаполнено(Имя) Тогда
			СписокВыбора.Добавить(Имя);
			Если Не ОбщегоНазначения.ЗначениеНеЗаполнено(Отчество) Тогда
				СписокВыбора.Добавить(СокрЛП(Имя) + " " + СокрЛП(Отчество));
				СписокВыбора.Добавить(СокрЛП(Имя) + ". " + Лев(Отчество, 1)+ ".");
			КонецЕсли;
		Иначе
			Если Не ОбщегоНазначения.ЗначениеНеЗаполнено(Отчество) Тогда
				СписокВыбора.Добавить(Отчество);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьДоступностьКомандыКодыЗагрузки()
	Элементы.ФормаКодыЗагрузки.Доступность = Не ЭтоНовый(ЭтаФорма);

КонецПроцедуры // УстановитьДоступность(

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗаголовокФормы(Форма)
	Форма.Заголовок = "Личные данные физического лица: " + Форма.Объект.Наименование;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПреобразуемыеДанные()
	
	Если ЭтоНовый(ЭтаФорма) Тогда
		Возврат;		
	КонецЕсли; 
	
	ПрочитатьФИОНаСервере();
	ПрочитатьГражданствоНаСервере();
	ПрочитатьУдостоверениеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФИОНаСервере()

	ФИОСрез = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(,ОтборПоСсылке(ЭтаФорма));
	
	Фамилия  = ФИОСрез.Фамилия;
	Имя      = ФИОСрез.Имя;
	Отчество = ФИОСрез.Отчество;
	
	ОбновитьСписокВыбораНаименования(ЭтаФорма);
	
КонецПроцедуры // ПрочитатьМестоРождения

&НаСервере
Процедура ПрочитатьГражданствоНаСервере()
	Гражданство = РегистрыСведений.ГражданствоФизЛиц.ПолучитьПоследнее(,ОтборПоСсылке(ЭтаФорма)).Страна;	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьУдостоверениеНаСервере()
	Паспорт = РегистрыСведений.ПаспортныеДанныеФизЛиц.ПолучитьПоследнее(, ОтборПоСсылке(ЭтаФорма));
	
	УдостоверениеЛичности = "" + Паспорт.ДокументВид + ", серия: " + Паспорт.ДокументСерия + ", № " + Паспорт.ДокументНомер 
	                        + ", выдан: " + Формат(Паспорт.ДокументДатаВыдачи, "ДФ='дд ММММ гггг'; ДП='Не указано'") + " года, " 
	                        + Паспорт.ДокументКемВыдан + ", № подр. " + Паспорт.ДокументКодПодразделения;
	Если УдостоверениеЛичности = ", серия: , № , выдан: Не указано года, , № подр. " Тогда
		УдостоверениеЛичности = "";
	Иначе
		УдостоверениеЛичности = СтрЗаменить(УдостоверениеЛичности,"Не указано","...");
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОтборПоСсылке(Форма)
	Возврат Новый Структура("ФизЛицо", Форма.Объект.Ссылка);	
	
КонецФункции 

&НаСервере
Процедура ЗаписатьДанныеФИОНовогоЭлемента()
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Возврат;		
	КонецЕсли; 
	
	МенеджерЗаписи = РегистрыСведений.ФИОФизЛиц.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();	
	МенеджерЗаписи.ФизЛицо  = Объект.Ссылка;
	МенеджерЗаписи.Фамилия = Фамилия;
	МенеджерЗаписи.Имя = Имя;
	МенеджерЗаписи.Отчество = Отчество;	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаКлиенте
Функция ВыделитьСлово(ИсходнаяСтрока)
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = СтрНайти(Буфер, " ");

	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции