
Процедура ВыполнитьСоздание(Выборка) Экспорт
	
	ИмяСобытия = "СозданиеСводныхПорученийПоДаннымKafka";
	Сообщение = РаботаСJSON.РезультатЧтенияJSON(Выборка.Сообщение);
	ТекстОшибки = "";
	Попытка
		MessageInfo = ОбменДаннымиКафка.ДанныеMessageInfo();
		ОбменДаннымиКафка.ПодготовитьMessageInfo(Сообщение.MessageInfo, MessageInfo, ИмяСобытия, ТекстОшибки);
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		MessageInfo.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		Возврат;
	КонецЕсли;
	
	Попытка
		ПроверитьData(Сообщение, ТекстОшибки);
		
		Data = Сообщение.Data;
		ИдентификаторСообщения = MessageInfo.MessageId;
		МастерИдентификатор = MessageInfo.MasterMessageId;
		
		СчетДЕПО = Справочники.СчетаДепо.НайтиПоКоду(Data.AccountDepoCode);
		РазделСчетаДЕПО = Справочники.РазделыСчетаДепо.НайтиПоКоду(Data.AccountDivisionCode);
		СчетДЕПОМХ = Справочники.СчетаДепоМХ.НайтиПоКоду(Data.DepoMxFactCode);
		РазделСчетаДЕПОМХ = Справочники.РазделыСчетаДепоМХ.НайтиПоКоду(Data.DepoMxDivisionCode);
		Клиент = СчетДЕПО.Владелец;
		
		РеквизитыДокумента = Новый Структура();
		РеквизитыДокумента.Вставить("СчетДЕПО", СчетДЕПО);
		РеквизитыДокумента.Вставить("РазделСчетаДЕПО", РазделСчетаДЕПО);
		РеквизитыДокумента.Вставить("СчетДЕПОМХ", СчетДЕПОМХ);
		РеквизитыДокумента.Вставить("РазделСчетаДЕПОМХ", РазделСчетаДЕПОМХ);
		РеквизитыДокумента.Вставить("Клиент", Клиент);
		
		ПроверитьРеквизитыДокумента(Data, РеквизитыДокумента, ТекстОшибки);
		
		ИсходнаяДатаДокумента = ПрочитатьДатуJSON(Data.Date, ФорматДатыJSON.ISO);
		КоличествоСекундЗаДесятьМинутДоКонцаДня = 86340;
		ДатаДокумента = НачалоДня(ИсходнаяДатаДокумента) + КоличествоСекундЗаДесятьМинутДоКонцаДня;
		
		СоставПоручения.Очистить();
		
		Для Каждого СтрокаОпераций Из Data.Transactions Цикл
			СтрокаТЧ = СоставПоручения.Добавить();
			ПодготовитьСтрокуТЧ(СтрокаТЧ, СтрокаОпераций, РеквизитыДокумента, ИмяСобытия, ТекстОшибки, MessageInfo);
		КонецЦикла;
	Исключение
		ТекстОшибки = ТекстОшибки + Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		MessageInfo.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		Возврат;
	КонецЕсли;
	
	ПроверенныйJSON = Новый Структура("MessageInfo, Data", MessageInfo, Data);
	ПодготовленныеДанные = ДанныеДляСозданиеСПД(РазделСчетаДепо, СчетДепо, СчетДЕПОМХ, РазделСчетаДЕПОМХ, Клиент,
		ИсходнаяДатаДокумента, ДатаДокумента);
	
	НачатьТранзакцию();
	Попытка
		СоздатьСПД(ПроверенныйJSON, ПодготовленныеДанные, ТекстОшибки);
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗавершитьОбработку(Выборка.ВнешнийИсточник, Выборка.Идентификатор);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		СообщенияПользователю = ПолучитьСообщенияПользователю();
		СообщенияПользователюСтрока = "";
		
		Если СообщенияПользователю.Количество() Тогда
			Для Каждого СообщениеПользователю Из СообщенияПользователю Цикл
				СообщенияПользователюСтрока = СообщенияПользователюСтрока + Символы.ПС + СообщениеПользователю.Текст;
			КонецЦикла;
		КонецЕсли;
		ТекстОшибки = ?(ЗначениеЗаполнено(СообщенияПользователюСтрока), СообщенияПользователюСтрока, ТекстОшибки);
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		MessageInfo.Вставить("ОписаниеОшибки", ОписаниеОшибки);
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
	КонецПопытки;
	
КонецПроцедуры

Процедура ПроверитьData(ДанныеИзJSON, ТекстОшибки)
	
	ОбязательныеПоля = ТаблицаОбязательныхПолей();
	Для Каждого СвойствоДокумента Из ДанныеИзJSON.Data Цикл
		ОбязательноеПоле = ОбязательныеПоля.Найти(СвойствоДокумента.Ключ);
		Если ОбязательноеПоле <> Неопределено Тогда
			ОбязательноеПоле.Найдена = Истина;
			Если Не ЗначениеЗаполнено(СвойствоДокумента.Значение) Тогда
				ТекстОшибки = ?(ЗначениеЗаполнено(ТекстОшибки), ТекстОшибки + Символы.ПС, "")
					+ СтрШаблон("Поле %1 не заполнено в JSON.", СвойствоДокумента.Ключ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	РезультатПоискаОбязательныхПолей = ОбязательныеПоля.НайтиСтроки(Новый Структура("Найдена", Ложь));
	Для Каждого Поле Из РезультатПоискаОбязательныхПолей Цикл
		ТекстОшибки = ?(ЗначениеЗаполнено(ТекстОшибки), ТекстОшибки + Символы.ПС, "")
			+ СтрШаблон("Поле %1 не найдено в JSON.", Поле.ИмяКолонки);
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеДляСозданиеСПД(РазделСчетаДепо, СчетДепо, СчетДЕПОМХ, РазделСчетаДЕПОМХ, Клиент,
		ИсходнаяДатаДокумента, ДатаДокумента)
		
	ДатаНачала = НачалоДня(ИсходнаяДатаДокумента);
	
	ПодготовленныеДанные = Новый Структура;
	ПодготовленныеДанные.Вставить("Клиент", Клиент);
	ПодготовленныеДанные.Вставить("СчетДепо", СчетДепо);
	ПодготовленныеДанные.Вставить("СчетДЕПОМХ", СчетДЕПОМХ);
	ПодготовленныеДанные.Вставить("РазделСчетаДепо", РазделСчетаДепо);
	ПодготовленныеДанные.Вставить("РазделСчетаДЕПОМХ", РазделСчетаДЕПОМХ);
	ПодготовленныеДанные.Вставить("ИсходнаяДатаДокумента", ИсходнаяДатаДокумента);
	ПодготовленныеДанные.Вставить("ДатаДокумента", ДатаДокумента);
	ПодготовленныеДанные.Вставить("ДатаНачала", ДатаНачала);
	Возврат ПодготовленныеДанные;

КонецФункции

Процедура СоздатьСПД(ДанныеИзJSON, ПодготовленныеДанные, ТекстОшибки)
	
	ИмяСобытия = "СоздатьДокументСПД";
	MessageInfo = ДанныеИзJSON.MessageInfo;
	Data = ДанныеИзJSON.Data;
	
	ДатаДокумента = ПодготовленныеДанные.ДатаДокумента;
	ИсходнаяДатаДокумента = ПодготовленныеДанные.ИсходнаяДатаДокумента;
	ДатаНачала = ПодготовленныеДанные.ДатаНачала;
	
	ДокОбъект = ДокументСПД(ДатаДокумента, ПодготовленныеДанные.РазделСчетаДЕПО);
	Если ЗначениеЗаполнено(ДокОбъект.Комментарий) Тогда
		ДокОбъект.Комментарий = СтрШаблон("Изменено автоматически %1", ИсходнаяДатаДокумента)
	Иначе
		ДокОбъект.Комментарий = СтрШаблон("Загружено автоматически %1", ИсходнаяДатаДокумента);
	КонецЕсли;
	ДокОбъект.Инициатор = Константы.ОрганизацияПоУмолчанию.Получить();
	ДокОбъект.Дата = ДатаДокумента;
	Если НЕ ДатаДокумента = КонецДня(ДатаДокумента) Тогда
		ДатаИсполнения = ДатаДокумента + 1;
	Иначе
		ДатаИсполнения = ДатаДокумента
	КонецЕсли;
	ДокОбъект.ДатаИсполнения = ДатаИсполнения;
	ДокОбъект.НачалоПериода = ДатаНачала;
	ДокОбъект.ОкончаниеПериода = КонецДня(ДатаНачала);
	Часов = 9;
	СекундВЧасе = 3600;
	ДокОбъект.ДатаФормированияОтчетов = ОбщегоНазначения.ДобавитьРабочийДень(НачалоДня(ДатаДокумента), 1) + Часов * СекундВЧасе;
	ДокОбъект.СчетДЕПО = ПодготовленныеДанные.СчетДЕПО;
	
	ДокОбъект.СоставПоручения.Очистить();
	
	Для Каждого СтрокаОпераций Из СоставПоручения Цикл
		СтрокаТЧ = ДокОбъект.СоставПоручения.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаОпераций);
	КонецЦикла;
	
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстОшибки = ТекстОшибки + Символы.ПС
			+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ДокументСПД(ДатаДокумента, РазделСчетаДЕПО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	иц_СводноеПоручениеСоставПоручения.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.иц_СводноеПоручение.СоставПоручения КАК иц_СводноеПоручениеСоставПоручения
	|ГДЕ
	|	иц_СводноеПоручениеСоставПоручения.Ссылка.Дата = &Дата
	|	И иц_СводноеПоручениеСоставПоручения.РазделСчетаДЕПО = &РазделСчетаДЕПО
	|	И НЕ иц_СводноеПоручениеСоставПоручения.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	иц_СводноеПоручениеСоставПоручения.Ссылка";
	
	Запрос.УстановитьПараметр("Дата", ДатаДокумента);
	Запрос.УстановитьПараметр("РазделСчетаДЕПО", РазделСчетаДЕПО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Иначе
		ДокОбъект = Документы.иц_СводноеПоручение.СоздатьДокумент();
	КонецЕсли;
	Возврат ДокОбъект;

КонецФункции

Процедура ПроверитьРеквизитыДокумента(ДанныеДокумента, РеквизитыДокумента, ТекстОшибки)
	
	Если Не ЗначениеЗаполнено(РеквизитыДокумента.СчетДЕПО) Тогда
		ЗаполнитьТекстОшибки(ДанныеДокумента.AccountDepoCode, "Счет депо", ТекстОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитыДокумента.РазделСчетаДЕПО) Тогда
		ЗаполнитьТекстОшибки(ДанныеДокумента.AccountDivisionCode, "Раздел Счета Депо", ТекстОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитыДокумента.СчетДЕПОМХ) Тогда
		ЗаполнитьТекстОшибки(ДанныеДокумента.DepoMxFactCode, "Счет МХ", ТекстОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитыДокумента.РазделСчетаДЕПОМХ) Тогда
		ЗаполнитьТекстОшибки(ДанныеДокумента.DepoMxDivisionCode, "Раздел Счета МХ", ТекстОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитыДокумента.Клиент) Тогда
		ЗаполнитьТекстОшибки(ДанныеДокумента.AccountDepoCode, "Клиент по Счету Депо", ТекстОшибки);
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьТекстОшибки(ЗначениеПоляJSON, ИмяРеквизита, ТекстОшибки)
	
	ТекстОшибки = ?(ЗначениеЗаполнено(ТекстОшибки), ТекстОшибки + Символы.ПС, "")
		+ СтрШаблон("%1 с кодом %2 не найден.", ИмяРеквизита, ЗначениеПоляJSON);
		
КонецПроцедуры

Процедура ПодготовитьСтрокуТЧ(СтрокаТЧ, СтрокаОпераций, РеквизитыДокумента, ИмяСобытия, ТекстОшибки, СлужебныеДанные)
	
	Если НРег(СтрокаОпераций.TransactionType) = "get" Тогда
		СтрокаТЧ.ВидОперацииД = Справочники.ВидыОпераций.Депонирование;
	ИначеЕсли НРег(СтрокаОпераций.TransactionType) = "wr_off" Тогда
		СтрокаТЧ.ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования;
	Иначе
		ЗаполнитьТекстОшибки(СтрокаОпераций.TransactionType, "Вид операции", ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	СтрокаТЧ.Депонент = РеквизитыДокумента.Клиент;
	
	ЦеннаяБумага = Справочники.ЦенныеБумаги.ЦеннаяБумагаПоРегНомеруИISIN(СтрокаОпераций.Asset.Isin,
		СтрокаОпераций.Asset.RegNum);
 
	Если Не ЗначениеЗаполнено(ЦеннаяБумага) Тогда
		ДанныеЦБИзJSON = СтрШаблон("ISIN: %1, RegNum: %2",
			СтрокаОпераций.Asset.Isin, СтрокаОпераций.Asset.RegNum);
		ЗаполнитьТекстОшибки(ДанныеЦБИзJSON, "Ценная бумага", ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Количество = СтрокаОпераций.Qty;
	Если Не ЗначениеЗаполнено(Количество) Тогда
		ТекстОшибки = ?(ЗначениеЗаполнено(ТекстОшибки), ТекстОшибки + Символы.ПС, "")
			+ "Количество (Qty) не может быть равно 0";
		Возврат;
	КонецЕсли;
	
	СтрокаТЧ.ЦеннаяБумага = ЦеннаяБумага;
	СтрокаТЧ.Количество = Количество;
	СтрокаТЧ.СчетДЕПО = РеквизитыДокумента.СчетДЕПО;
	СтрокаТЧ.СчетДЕПОМХ = РеквизитыДокумента.СчетДЕПОМХ;
	СтрокаТЧ.РазделСчетаДЕПО = РеквизитыДокумента.РазделСчетаДЕПО;
	СтрокаТЧ.РазделСчетаДЕПОМХ = РеквизитыДокумента.РазделСчетаДЕПОМХ;
	Если СтрокаТЧ.ВидОперацииД <> Справочники.ВидыОпераций.СнятиеЦБсОбслуживания
		И СтрокаТЧ.ВидОперацииД <> Справочники.ВидыОпераций.ПриемЦБНаОбслуживание Тогда
		СтрокаТЧ.МестоХранения = СтрокаТЧ.СчетДЕПОМХ.Владелец;
	КонецЕсли;
	СтрокаТЧ.СпособХранения = Перечисления.СпособыХранения.Открытый;

КонецПроцедуры

Процедура ДанныеСПД(Data) Экспорт
	
	ЦБ = Новый Структура;
	ЦБ.Вставить("Isin", "");
	ЦБ.Вставить("RegNum", "");
	ЦБ.Вставить("NrdCode", "");
	
	Операция = Новый Структура;
	Операция.Вставить("TransactionType", "");
	Операция.Вставить("Asset", ЦБ);
	Операция.Вставить("Qty", 0);
	Операция.Вставить("Volume", 0);
	
	ДанныеПоКлиенту = Новый Структура;
	ДанныеПоКлиенту.Вставить("ObjectVersion", "");
	ДанныеПоКлиенту.Вставить("DepoMxFactCode", "");
	ДанныеПоКлиенту.Вставить("DepoMxDivisionCode", "");
	ДанныеПоКлиенту.Вставить("AccountDepoCode", "");
	ДанныеПоКлиенту.Вставить("AccountDivisionCode", "");
	ДанныеПоКлиенту.Вставить("Date", "");
	ДанныеПоКлиенту.Вставить("Transactions", Новый Массив);
	
	ЗаполнитьData(Data, ДанныеПоКлиенту, Операция);

КонецПроцедуры

Процедура ЗаполнитьData(Data, ДанныеПоКлиенту, Операция)
	
	Транзакции = "Transactions";
	
	Если НЕ Data.Свойство(Транзакции) Тогда
		Data.Вставить("Transactions", Новый Массив);
	Иначе
		Для Каждого СвойствоОперации Из Операция Цикл
			ДополнитьДанныеДокумента(Data, СвойствоОперации);
		КонецЦикла;
	КонецЕсли;
	Для Каждого Свойство Из ДанныеПоКлиенту Цикл
		Если Свойство.Ключ <> Транзакции И Не Data.Свойство(Свойство.Ключ) Тогда
			Data.Вставить(Свойство.Ключ, Свойство.Значение);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ДополнитьДанныеДокумента(Data, СвойствоОперации)
	
	Если Data.Transactions.Количество() Тогда
		Для Каждого Transaction Из Data.Transactions Цикл
			Если Не Transaction.Свойство(СвойствоОперации.Ключ) Тогда
				Transaction.Вставить(СвойствоОперации.Ключ, СвойствоОперации.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Функция ТаблицаОбязательныхПолей()
	
	ОбязательныеПоля = Новый ТаблицаЗначений;
	ОбязательныеПоля.Колонки.Добавить("ИмяКолонки", Новый ОписаниеТипов("Строка"));
	ОбязательныеПоля.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Булево"));
	ДобавитьНовоеОбязательноеПоле(ОбязательныеПоля, "DepoMxFactCode");
	ДобавитьНовоеОбязательноеПоле(ОбязательныеПоля, "DepoMxDivisionCode");
	ДобавитьНовоеОбязательноеПоле(ОбязательныеПоля, "AccountDepoCode");
	ДобавитьНовоеОбязательноеПоле(ОбязательныеПоля, "AccountDivisionCode");
	ДобавитьНовоеОбязательноеПоле(ОбязательныеПоля, "Date");
	ДобавитьНовоеОбязательноеПоле(ОбязательныеПоля, "Transactions");
	Возврат ОбязательныеПоля;
	
КонецФункции

Процедура ДобавитьНовоеОбязательноеПоле(ТЗ, ИмяКолонки)
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.ИмяКолонки = ИмяКолонки;
КонецПроцедуры
