
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыПлатежныхОпераций.ВыплатаДохода Тогда
		Если Ссылка.Пустая() Тогда
			НоваяСсылка = Документы[Ссылка.Метаданные().Имя].ПолучитьСсылку(Новый УникальныйИдентификатор);
			GUIDПлатежа = XMLСтрока(НоваяСсылка);
			УстановитьСсылкуНового(НоваяСсылка);
		Иначе
			GUIDПлатежа = XMLСтрока(Ссылка);
		КонецЕсли;
	Иначе
		GUIDПлатежа = "";
	КонецЕсли;
	
	Поля = Новый СписокЗначений;
	Поля.Добавить(Основание, "Основание");
	Поля.Добавить(ВидОперации, "Вид операции");
	Поля.Добавить(Получатель, "Получатель");
	Поля.Добавить(СчетДепо, "Счет Депо");
	Поля.Добавить(РазделСчетаДепо, "Раздел счета Депо");
	ПроверитьЗаполнениеПолей(Поля, Отказ);
КонецПроцедуры

Процедура ПроверитьЗаполнениеПолей(Поля, Отказ)
	Для Каждого Элемент Из Поля Цикл
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не заполнено поле """ + Элемент.Представление + """", Отказ);
		КонецЕсли;		
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Не Документы.НачисленныйНалог.ИспользоватьРасчетНДФЛПоПрогрессивнойШкале(Основание.Дата) Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьГлобальнуюОперацию = Ложь;
	
	ЭтоВыплатаДохода = (ВидОперации = Перечисления.ВидыПлатежныхОпераций.ВыплатаДохода);
	ЭтоОплатаНалога = (ВидОперации = Перечисления.ВидыПлатежныхОпераций.ОплатаНалога);
	Если ЭтоВыплатаДохода Или ЭтоОплатаНалога Тогда
		// BSLLS:Typo-off
		ЕстьНепроведенныеПлатежныеОперации = Документы.ПлатежнаяОперация.ЕстьНепроведенныеПлатежныеОперации(Ссылка, ВидОперации);
		// BSLLS:Typo-on
	КонецЕсли;
	
	Если ЭтоВыплатаДохода Тогда 
		НачислятьНалог = Документы.Поручение.ЦБСписываемыеНачислитьНалог(Основание, СчетДепо, РазделСчетаДепо);
		ПроведенИВыплаченНачисленныйНалог = ПроведенИВыплаченНачисленныйНалог();
		// BSLLS:Typo-off
		Если Не НачислятьНалог Или ПроведенИВыплаченНачисленныйНалог И Не ЕстьНепроведенныеПлатежныеОперации Тогда
			СоздатьГлобальнуюОперацию = Истина;
		КонецЕсли;
		// BSLLS:Typo-on
	КонецЕсли;
	
	Если ЭтоОплатаНалога Тогда
		ПроведенИВыплаченДоход = ПроведенИВыплаченДоход();
		// BSLLS:Typo-off
		Если ПроведенИВыплаченДоход И Не ЕстьНепроведенныеПлатежныеОперации Тогда
			СоздатьГлобальнуюОперацию = Истина;
		КонецЕсли;
		// BSLLS:Typo-on
	КонецЕсли;
		
	Если СоздатьГлобальнуюОперацию Тогда
		Отбор = Новый Структура("Депонент", Получатель);
		Документы.Поручение.СоздатьОбновитьДокументыГО(Основание, Отказ, Дата, Отбор);
		ДанныеКлиента = ДанныеКлиентаДляУведомления();
		Документы.Поручение.ЗаписатьУведомлениеДляКабинетаКлиента(Основание, Дата, ДанныеКлиента,
			Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.КОтправке);
	КонецЕсли;
	
	Если Константы.ДатаДвиженийПоДС.Получить() < Дата Тогда
		РезультатЗапроса = ПолучитьРезультатЗапросаПоДвижениям();
		Записи			 = РезультатЗапроса.Выгрузить();
		Движения.ДенежныеСредства.Загрузить(Записи);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если Не Документы.НачисленныйНалог.ИспользоватьРасчетНДФЛПоПрогрессивнойШкале(Основание.Дата) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыПлатежныхОпераций.ВыплатаДохода Тогда
		УдалятьПодчиненныеПоручения = Ложь;
		Отбор = Новый Структура("Депонент", Получатель);
		Документы.Поручение.УдалитьДокументыНаОснованииПоручения(Основание, УдалятьПодчиненныеПоручения, Отбор);
	КонецЕсли;
КонецПроцедуры

Функция ПроведенИВыплаченНачисленныйНалог()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДокументНачисленныйНалог.Ставка КАК Ставка,
	|	ДокументНачисленныйНалог.СуммаНалога + ДокументНачисленныйНалог.СуммаНалогаПоСтавке15СПревышения КАК СуммаНалога,
	|	ПлатежнаяОперация.Ссылка КАК ПлатежнаяОперацияСсылка
	|ИЗ
	|	Документ.НачисленныйНалог КАК ДокументНачисленныйНалог
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежнаяОперация КАК ПлатежнаяОперация
	|		ПО (ПлатежнаяОперация.НачисленныйНалог = ДокументНачисленныйНалог.Ссылка)
	|			И (ПлатежнаяОперация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежныхОпераций.ОплатаНалога))
	|			И (ПлатежнаяОперация.Проведен)
	|			И (ПлатежнаяОперация.СчетДепо = &СчетДепо)
	|			И (ПлатежнаяОперация.РазделСчетаДепо = &РазделСчетаДепо)
	|ГДЕ
	|	ДокументНачисленныйНалог.Основание = &Основание
	|	И ДокументНачисленныйНалог.СчетДепо = &СчетДепо
	|	И ДокументНачисленныйНалог.Подтвержден
	|	И ДокументНачисленныйНалог.РазделСчетаДепо = &РазделСчетаДепо
	|	И ДокументНачисленныйНалог.Проведен
	|";
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("СчетДепо", СчетДепо);
	Запрос.УстановитьПараметр("РазделСчетаДепо", РазделСчетаДепо);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ПлатежнаяОперацияСсылка) Или (Выборка.Ставка = 0 И Выборка.СуммаНалога = 0) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПроведенИВыплаченДоход()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК ПроведенВыплачен
	|ИЗ
	|	Документ.ПлатежнаяОперация КАК ПлатежнаяОперация
	|ГДЕ
	|	ПлатежнаяОперация.Основание = &Основание
	|	И ПлатежнаяОперация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежныхОпераций.ВыплатаДохода)
	|	И ПлатежнаяОперация.Проведен
	|	И ПлатежнаяОперация.СчетДепо = &СчетДепо
	|	И ПлатежнаяОперация.РазделСчетаДепо = &РазделСчетаДепо
	|";
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("СчетДепо", СчетДепо);
	Запрос.УстановитьПараметр("РазделСчетаДепо", РазделСчетаДепо);
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
КонецФункции

Функция ПолучитьРезультатЗапросаПоДвижениям()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДенежныеСредстваОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
	|	ДенежныеСредстваОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ДенежныеСредстваОстатки.БанковскийСчет КАК БанковскийСчет,
	|	ДенежныеСредстваОстатки.Депонент КАК Депонент,
	|	ДенежныеСредстваОстатки.Валюта КАК Валюта
	|ПОМЕСТИТЬ ОстаткиДС
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(&Период, Выплата = &Поручение) КАК ДенежныеСредстваОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлатежнаяОперация.Основание.БанковскийСчет КАК БанковскийСчет,
	|	ПлатежнаяОперация.СчетДепо.Владелец КАК Депонент,
	|	ПлатежнаяОперация.Основание.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|	ВЫБОР
	|		КОГДА ПлатежнаяОперация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежныхОпераций.ВыплатаДохода)
	|			ТОГДА ПлатежнаяОперация.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ПлатежнаяОперация.Сумма / (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ВалютнаяСумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиДС.ВалютнаяСуммаОстаток, 0) = ВЫБОР
	|				КОГДА ПлатежнаяОперация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежныхОпераций.ВыплатаДохода)
	|					ТОГДА ПлатежнаяОперация.Сумма
	|				ИНАЧЕ ВЫРАЗИТЬ(ПлатежнаяОперация.Сумма / (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) КАК ЧИСЛО(15, 2))
	|			КОНЕЦ
	|			ТОГДА ЕСТЬNULL(ОстаткиДС.СуммаОстаток, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПлатежнаяОперация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежныхОпераций.ОплатаНалога)
	|					ТОГДА ПлатежнаяОперация.Сумма
	|				ИНАЧЕ ВЫРАЗИТЬ(ПлатежнаяОперация.Сумма * (КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) КАК ЧИСЛО(15, 2))
	|			КОНЕЦ
	|	КОНЕЦ КАК Сумма,
	|	ПлатежнаяОперация.Дата КАК Период,
	|	&ВидДвижения КАК ВидДвижения,
	|	ПлатежнаяОперация.Основание КАК Выплата
	|ИЗ
	|	Документ.ПлатежнаяОперация КАК ПлатежнаяОперация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
	|		ПО ПлатежнаяОперация.Основание.БанковскийСчет.ВалютаДенежныхСредств = КурсыВалютСрезПоследних.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиДС КАК ОстаткиДС
	|		ПО ПлатежнаяОперация.Основание.БанковскийСчет = ОстаткиДС.БанковскийСчет
	|			И ПлатежнаяОперация.СчетДепо.Владелец = ОстаткиДС.Депонент
	|			И ПлатежнаяОперация.Основание.БанковскийСчет.ВалютаДенежныхСредств = ОстаткиДС.Валюта
	|ГДЕ
	|	ПлатежнаяОперация.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", МоментВремени());
	Запрос.УстановитьПараметр("ВидДвижения" , ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Поручение", Основание);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	
	GUIDПлатежа = "";
	НачисленныйНалог = Документы.НачисленныйНалог.ПустаяСсылка();
	ВыплатаДохода = Документы.ПлатежнаяОперация.ПустаяСсылка();
	ДокументВнешнегоИсточника = "";
	НомерПлатежногоПоручения = "";
	
КонецПроцедуры

Функция ДанныеКлиентаДляУведомления()
	
	ДанныеКлиента = Новый Структура("Клиент, СчетДепо, ЦеннаяБумага, Количество");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоручениеЦенныеБумагиСписываемые.СчетДепо КАК СчетДепо,
	|	ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ПоручениеЦенныеБумагиСписываемые.Количество КАК Количество,
	|	ПлатежнаяОперация.Получатель КАК Клиент
	|ИЗ
	|	Документ.ПлатежнаяОперация КАК ПлатежнаяОперация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦенныеБумагиСписываемые
	|		ПО ПлатежнаяОперация.Основание = ПоручениеЦенныеБумагиСписываемые.Ссылка
	|			И ПлатежнаяОперация.СчетДепо = ПоручениеЦенныеБумагиСписываемые.СчетДепо
	|			И ПлатежнаяОперация.РазделСчетаДепо = ПоручениеЦенныеБумагиСписываемые.РазделСчетаДепо
	|			И ПлатежнаяОперация.Получатель = ПоручениеЦенныеБумагиСписываемые.СчетДепо.Владелец
	|ГДЕ
	|	ПлатежнаяОперация.Ссылка = &ПлатежнаяОперация";
	
	Запрос.УстановитьПараметр("ПлатежнаяОперация", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		ЗаполнитьЗначенияСвойств(ДанныеКлиента, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат ДанныеКлиента;

КонецФункции
