#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ПроверкаИОтправка

&ИзменениеИКонтроль("ПроверкаИОтправка_ОбработкаПроверки")
Функция FO_PortionIndex_ПроверкаИОтправка_ОбработкаПроверки(Параметры, АдресРезультата = Неопределено)

	УстановитьПривилегированныйРежим(Истина);

	#Область Переменные
	Результат = ИсполнителиСлужебный.СтруктураРезультатаИсполнителей();
	ЗавершитьЗамер(Параметры.ЗамерИнициализацияИсполнителя, Результат.Таблицы.Замеры);

	Результат.Таблицы.Вставить("Замеры", ИсполнителиСлужебный.ШаблонТаблицыЗамеров());
	Результат.Таблицы.Вставить("КэшВмКраткоПоручения", РаботаСЛимитами.КэшВмКраткоПоручения());
	Результат.Соответствия.Вставить("Базисы", Новый Соответствие());

	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Менеджер = Запрос.МенеджерВременныхТаблиц;

	Распорядитель = ФактРаспорядитель(Параметры.Распорядитель);
	Вместилище = Распорядитель.Идентификатор;
	Исполнитель = Новый УникальныйИдентификатор();
	Кэш = Распорядитель.Кэш;
	ДатаПроверки = Кэш.Параметры.ДатаПроверки;
	Шапка = РаботаСЛимитами.ШапкаИсполнителяПроверки(Вместилище, Исполнитель, Кэш.Параметры);
	РеквизитыПоручений = Кэш.Соответствия.РеквизитыПоручений;
	НекорректныеЛимиты = Кэш.Соответствия.НекорректныеЛимиты;
	СтоимостиАктивовПортфелей = Кэш.Соответствия.СтоимостиАктивовПортфелей;
	ПортфелиГрупп = Кэш.Соответствия.ПортфелиГрупп;
	НастройкиЛимитов = Кэш.Соответствия.НастройкиЛимитов;
	ДанныеПолейУсловийОтбора = Кэш.Соответствия.ДанныеПолейУсловийОтбора;
	ДанныеДеноминаций = Новый Соответствие();
	ОбъемыОблигаций = Новый Соответствие();
	ДанныеКапитализаций = Новый Соответствие();
	ПоляУсловийОтбора = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("#Т.Портфель");
	НаборДанныхТекущий = Неопределено;
	Толкования = РаботаСЛимитами.Толкования();
	ПланСырой = РегистрыСведений.КэшВмПланПроверки.ПланПроверкиИсполнителя(Вместилище, Параметры.Данные[0]);
	#КонецОбласти

	#Область ПроектВместилище
	ЗеленаяЗона = Перечисления.ЗоныПроверкиЛимитов.ПустаяСсылка();
	ЖелтаяЗона = Перечисления.ЗоныПроверкиЛимитов.Желтая;
	КраснаяЗона = Перечисления.ЗоныПроверкиЛимитов.Красная;

	Зоны = Новый Соответствие();
	Зоны.Вставить(0, ЗеленаяЗона); Зоны.Вставить(1, ЖелтаяЗона); Зоны.Вставить(2, КраснаяЗона);

	ЗоныЧислом = Новый Соответствие();
	ЗоныЧислом.Вставить(ЗеленаяЗона, 0); ЗоныЧислом.Вставить(ЖелтаяЗона, 1); ЗоныЧислом.Вставить(КраснаяЗона, 2);

	Кэш.Вставить("ЖелтаяЗона", ЖелтаяЗона);
	Кэш.Вставить("КраснаяЗона", КраснаяЗона);
	Кэш.Вставить("Зоны", Зоны);
	Кэш.Вставить("ЗоныЧислом", ЗоныЧислом);

	КэшВмДетальноШаблон = КэшВмДетальноШаблон();
	КэшВмКраткоШаблон = КэшВмКраткоШаблон();
	КэшВмКраткоЭмитентыШаблон = КэшВмКраткоЭмитентыШаблон();

	КэшВм = Новый Структура();
	КэшВм.Вставить("Кратко", КэшВмКраткоШаблон(Истина));
	КэшВм.Вставить("КраткоЭмитенты", КэшВмКраткоЭмитентыШаблон.Скопировать());
	КэшВм.Вставить("Детально", КэшВмДетальноШаблон.Скопировать());
	КэшВм.Вставить("Счетчик", РаботаСЛимитами.СчетчикВм(Шапка, Распорядитель.Вес));
	КэшВм.Вставить("Шапка", Шапка);
	КэшВм.Вставить("Замеры");

	Окружение = РаботаСЛимитами.Окружение(Менеджер, Вместилище);
	Окружение.ОписанияНаборов = Кэш.Соответствия.ОписанияНаборов;
	Окружение.РеквизитыНаборов = Кэш.Соответствия.РеквизитыНаборовДанных;
	Окружение.ДанныеНаборов = Кэш.Соответствия.ДанныеНаборовДанных;
	#КонецОбласти

	#Область _
	Лимиты = Новый Массив();
	Необходимое = Новый Структура("РеквизитыПоручений, НекорректныеЛимиты", РеквизитыПоручений, НекорректныеЛимиты);
	ПланВнутренниеВнешние = РаботаСЛимитами.ОбработатьПланПредварительно(ПланСырой, КэшВм, Необходимое);
	ПланВнутренние = РаботаСЛимитами.ОбработатьПланПоВнешнимЛимитам(ПланВнутренниеВнешние, КэшВм, Кэш, Ложь);
	ПланВнутренниеПоЛимитам = РаботаСЛимитами.ПланВнутренниеПоЛимитам(ПланВнутренние, Лимиты);

	ВидыБазисовЛимитов = ИсполнителиПолныеПрава.ВидыБазисовЛимитов(Лимиты);
	ВеличиныОттока = ИсполнителиПолныеПрава.ВеличиныОттокаПаев(Кэш.Массивы.Портфели, Шапка.ДатаФактПозиции);
	ГарантийныеОбеспечения = ИсполнителиПолныеПрава.ГарантийныеОбеспечения(Кэш.Массивы.Портфели, Шапка.ДатаФактПозиции);
	#КонецОбласти

	#Область ПоляУсловийОтбора
	Для Каждого Лимит Из Лимиты Цикл
		Если ДанныеПолейУсловийОтбора[Лимит] <> Неопределено Тогда
			ДополнитьМассив(ПоляУсловийОтбора, ДанныеПолейУсловийОтбора[Лимит].ПоляУсловийОтбора);
		КонецЕсли;
	КонецЦикла;
	ПоляУсловийОтбора = СвернутьМассив(ПоляУсловийОтбора);
	#КонецОбласти

	Для Каждого Лимит Из Лимиты Цикл
		ПараметрыИсх = НастройкиЛимитов[Лимит];
		Если ПараметрыИсх = Неопределено Тогда
			// Для внешних лимитов настройки могут отсутствовать в кэше
			// Пропускаем такие лимиты, так как они обрабатываются отдельно
			Продолжить;
		КонецЕсли;
		НаборДанных = ПараметрыИсх.НаборДанныхДляПроверкиЛимитов;

		ПараметрыИсх.Вставить("СведенияОПорогах", Неопределено);
		Если ПараметрыИсх.ВидЛимита = Перечисления.ВидыЛимитов.Структура Тогда
			Вариант = ПараметрыИсх.ВариантПроверкиПорога;
			ПараметрыИсх.ВариантПроверкиПорога = ПроверкаЛимитовПовтИсп.ПараметрыВариантаПроверкиПорога(Вариант, ДатаПроверки);
			ПараметрыИсх.ВариантПроверкиПорога.Вставить("ИспользоватьПорогиПоручения", Кэш.Параметры.ЭтоПретрейд);
			ПараметрыИсх.СведенияОПорогах = РегистрыСведений.КэшВмПороги.СведенияОПорогах(Лимит, Вместилище);
		КонецЕсли;

		РеквизитыНабора = Окружение.РеквизитыНаборов[НаборДанных];
		ОписаниеНабора = РаботаСЛимитами.ОписаниеНабораОкружения(Окружение, НаборДанных);
		ИсточникПоручение = РеквизитыНабора.ВидИсточникаДанных = Перечисления.ВидыОсновныхИсточниковДанных.Поручение;

		ПараметрыИсх.Вставить("РеквизитыНабораДанных", РеквизитыНабора);
		ПараметрыИсх.Вставить("Лимит", Лимит);
		ПараметрыИсх.Вставить("Вместилище", Шапка.Вместилище);
		ПараметрыИсх.Вставить("ДатаПроверки", Шапка.ДатаПроверки);
		ПараметрыИсх.Вставить("ДатаФактПозиции", Шапка.ДатаФактПозиции);
		ПараметрыИсх.Вставить("ИспользоватьДатуАктуальности", Шапка.ИспользоватьДатуАктуальности);
		ПараметрыИсх.Вставить("ВремяВыполнения", ТекущаяДатаСеанса());
		ПараметрыИсх.Вставить("ЗамерЗатраты_а83", ТекущаяУниверсальнаяДатаВМиллисекундах());
		ПараметрыИсх.Вставить("ДатаОграниченияПлановойПозиции", Кэш.Параметры.ДатаОграниченияПлановойПозиции);
		ПараметрыИсх.Вставить("ВыводитьПредупрежденияПриПретрейде", Кэш.Параметры.ВыводитьПредупрежденияПриПретрейде);
		ПараметрыИсх.Вставить("ИспользоватьПорогиПоручения", Кэш.Параметры.ЭтоПретрейд);
		ПараметрыИсх.Вставить("ЭтоПретрейд", Кэш.Параметры.ЭтоПретрейд);
		ПараметрыИсх.Вставить("ВидЛимитаБенефициара", ПараметрыИсх.ВидЛимита);
		ПараметрыИсх.Вставить("ВидыБазисовЛимита", ВидыБазисовЛимитов[Лимит]);
		ПараметрыИсх.Вставить("ОбъектыПроверкиПоручения", Неопределено);
		ПараметрыИсх.Вставить("Базисы", Результат.Соответствия.Базисы);
		ПараметрыИсх.Вставить("Кэш", Кэш);

		#Область ТекущийНабор
		Если НаборДанных <> НаборДанныхТекущий Тогда
			Если НаборДанныхТекущий <> Неопределено Тогда
				РаботаСЛимитами.УдалитьВременныеТаблицы(Запрос, Толкования.ОсновныеТаблицы);
			КонецЕсли;

			ДанныеНабора = Окружение.ДанныеНаборов[НаборДанных];
			Если ТипЗнч(ДанныеНабора) = Тип("ХранилищеЗначения") Тогда
				ДанныеНабора = ДанныеНабора.Получить();
				Окружение.ДанныеНаборов.Вставить(НаборДанных, ДанныеНабора);
			КонецЕсли;

			ТаблицаОшибокРепрайсинга = ДанныеНабора.ТаблицаОшибокРепрайсинга;
			Если Не ЗначениеЗаполнено(ТаблицаОшибокРепрайсинга) Тогда
				ТаблицаОшибокРепрайсинга = Новый ТаблицаЗначений();
				ТаблицаОшибокРепрайсинга.Колонки.Добавить("Актив", Новый ОписаниеТипов("СправочникСсылка.Активы"));
			КонецЕсли;
			ЕстьОшибкиРепрайсинга = ТаблицаОшибокРепрайсинга.Количество() > 0;

			Если ИсточникПоручение Тогда
				УсловияОтбораКонтекста = "#Т.Поручение В (&Поручение_b481) И #Т.Портфель В (&Портфели_b481)";

				КэшТаблицаНабора = ДанныеНабора.ОбъединеннаяТаблицаЗначений;
				МассивПолейВыборки = ИсполнителиСлужебный.МассивПолейВыборки(КэшТаблицаНабора.Колонки);
				ВыборкаПолей = ИсполнителиСлужебный.ВыборкаПолей(МассивПолейВыборки);
				ВыборкаПолейТекущая = ИсполнителиСлужебный.ЗадатьИмяИсточника(ВыборкаПолей, "Т");
				ВыборкаИндексов = ВыборкаИндексов(ПоляУсловийОтбора, КэшТаблицаНабора.Колонки);
				ВыборкаИндексовТекущая = ИсполнителиСлужебный.ЗадатьИмяИсточника(ВыборкаИндексов, "Т");

				Запрос.Текст = ТекстЗапросаПомещенияДанныхНаборов();
				Запрос.УстановитьПараметр("ОбъединеннаяТаблицаЗначений", КэшТаблицаНабора);
				Запрос.УстановитьПараметр("ТаблицаОшибокРепрайсинга", ТаблицаОшибокРепрайсинга);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВыборкаПолей", ВыборкаПолейТекущая);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВыборкаИндексов", ВыборкаИндексовТекущая);
				Запрос.Выполнить(); //@skip-check query-in-loop

			Иначе
				УсловияОтбораКонтекста = "#Т.Портфель В (&Портфели_b481)";

				Секрет = ДанныеНабора.Секрет;
				Секрет = РаботаСЛимитами.Секрет(Секрет.Дата, Секрет.РеквизитыНабора, Секрет.БиржиКотировок, Вместилище);
				Если Менеджер.Таблицы.Найти("ВТ_ТаблицаНабораДанных" + ОписаниеНабора.КлючНабора) = Неопределено Тогда
					КэшТаблицаНабора = РегистрыСведений.КэшВмПозиция.СоздатьНаборЗаписей().Выгрузить();
					ВыборкаИндексов = ВыборкаИндексов(ПоляУсловийОтбора, КэшТаблицаНабора.Колонки);
					ВыборкаИндексовТекущая = ИсполнителиСлужебный.ЗадатьИмяИсточника(ВыборкаИндексов, "Т");
					РаботаСЛимитами.ДобавитьВТ_ТаблицаНабораДанных(Секрет, Менеджер, ВыборкаИндексовТекущая);
				КонецЕсли;

				Запрос.Текст =
				"ВЫБРАТЬ
				|	Т.Актив КАК Актив,
				|	ИСТИНА КАК Отказ
				|ПОМЕСТИТЬ ВТ_ТаблицаОшибокРепрайсинга
				|ИЗ
				|	&ТаблицаОшибокРепрайсинга КАК Т
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Т.Актив";
				Запрос.УстановитьПараметр("ТаблицаОшибокРепрайсинга", ТаблицаОшибокРепрайсинга);
				Запрос.Выполнить(); //@skip-check query-in-loop

				ДанныеДеноминаций.Вставить(НаборДанных, РаботаСЛимитами.ДанныеДеноминации(Секрет, Менеджер));
				ДанныеКапитализаций.Вставить(НаборДанных, РаботаСЛимитами.ДанныеКапитализации(Секрет));
				ОбъемыОблигаций.Вставить(НаборДанных, РаботаСЛимитами.ОбъемыОблигаций(Секрет));
			КонецЕсли;

			ИмяВТНабора = "ВТ_ТаблицаНабораДанных" + ?(ИсточникПоручение, "", ОписаниеНабора.КлючНабора);
			Кэш.Соответствия.Вставить("ВхожденияВРаскрытие",
				ПроверкаЛимитов.ВхожденияВРаскрытие(Запрос, ИмяВТНабора, ДанныеНабора.ЕстьРаскрытие));

			НаборДанныхТекущий = НаборДанных;
		КонецЕсли;
		#КонецОбласти

		Для Каждого ПоГруппеПортфелей Из ПланВнутренниеПоЛимитам[Лимит] Цикл
			ПорцияДанных = ПоГруппеПортфелей.Значение;

			#Область УсловияОтбора
			УсловияОтбораПоМодификатору = УсловияОтбораПоМодификатору(ПараметрыИсх);
			УсловияОтбора = ?(УсловияОтбораПоМодификатору <> "", УсловияОтбораПоМодификатору, ПараметрыИсх.УсловияОтбораОсновные);
			УсловияОтбора = УсловияОтбораКонтекста + ?(ЗначениеЗаполнено(УсловияОтбора), " И ", "") + УсловияОтбора;
			#КонецОбласти

			ПараметрыИсх.Вставить("Исполнитель", Новый УникальныйИдентификатор());
			ПараметрыИсх.Вставить("УсловияОтбора", УсловияОтбора);
			ПараметрыИсх.Вставить("ВыборкаПолей", ВыборкаПолей);
			ПараметрыИсх.Вставить("УсловияОтбораКонтекста", УсловияОтбораКонтекста);
			ПараметрыИсх.Вставить("ИмяОсновнойТаблицы", "ВТ_ТаблицаНабораДанных" + ?(ИсточникПоручение, "", ОписаниеНабора.КлючНабора));

			ПортфелиПорции = Новый Массив();
			ПорученияПорции = Новый Массив();
			БазисыПорции = Новый Соответствие();
			ПорученияПортфелиПорции = ПорученияПортфелиПорцииШаблон();

			Для Каждого Строка Из ПорцияДанных Цикл
				#Область ПортфелиИГруппы
				Фокус = Строка.Фокус;
				ПортфелиГруппы = ЗначениеВМассиве(Фокус);
				Если Строка.ПоГруппе Тогда
					ПортфелиГруппы = ПортфелиГрупп[Фокус];
				КонецЕсли;
				ДополнитьМассив(ПортфелиПорции, ПортфелиГруппы, Истина);

				ПорученияПорции.Добавить(Строка.Поручение);
				Для Каждого ПортфельГруппы Из ПортфелиГруппы Цикл
					СтрокаВсп = ПорученияПортфелиПорции.Добавить();
					СтрокаВсп.Поручение = Строка.Поручение;
					СтрокаВсп.ГруппаПортфелей = Фокус;
					СтрокаВсп.Портфель = ПортфельГруппы;
					СтрокаВсп.Фокус = Фокус;
				КонецЦикла;
				#КонецОбласти

				#Область Базисы
				Запрос.УстановитьПараметр("Портфели_b481", ПортфелиГруппы);
				Базис = СтоимостиАктивовПортфелей[НаборДанныхТекущий][Фокус];
				Если ПараметрыИсх.ВидЛимита = Перечисления.ВидыЛимитов.Структура Тогда
					ВидыБазисов = Перечисления.ВидыБазисовДляПроверкиЛимитов;
					Базис = ?(Базис <> Неопределено, Базис, ИсполнителиСлужебный.ПустаяОсноваБазисов());
					Для Каждого КлючЗначение Из ПараметрыИсх.ВидыБазисовЛимита Цикл
						Базис.Вставить(КлючЗначение.Ключ, 0);
					КонецЦикла;

					Добавляемые = ПроверкаЛимитовСлужебный.БазисыОтАктивов(Запрос, ПараметрыИсх);
					Если ЗначениеЗаполнено(Добавляемые) Тогда
						ЗаполнитьЗначенияСвойств(Базис, Добавляемые);
					КонецЕсли;

					Если ПараметрыИсх.ВидыБазисовЛимита.Свойство(XMLСтрока(ВидыБазисов.РыночнаяСтоимость)) Тогда
						РыночнаяСтоимость = РаботаСЛимитами.РыночнаяСтоимость(Запрос, ПараметрыИсх);
						ЗаполнитьЗначенияСвойств(Базис, РыночнаяСтоимость);
					КонецЕсли;

					Если ПараметрыИсх.ВидыБазисовЛимита.Свойство(XMLСтрока(ВидыБазисов.ОбъемОблигацийЭмитентаВОбращении)) Тогда
						Добавляемые = ОбъемыОблигаций[НаборДанныхТекущий];
						Если ЗначениеЗаполнено(Добавляемые) Тогда
							ЗаполнитьЗначенияСвойств(Базис, Добавляемые);
						КонецЕсли;
					КонецЕсли;

					Если ПараметрыИсх.ВидыБазисовЛимита.Свойство(XMLСтрока(ВидыБазисов.УниверсальныйДеноминатор)) Тогда
						Добавляемые = ДанныеДеноминаций[НаборДанныхТекущий][Фокус];
						Если ЗначениеЗаполнено(Добавляемые) Тогда
							ЗаполнитьЗначенияСвойств(Базис, Добавляемые);
						КонецЕсли;
					КонецЕсли;

					Если ПараметрыИсх.ВидыБазисовЛимита.Свойство(XMLСтрока(ВидыБазисов.КапитализацияЭмитентов)) Тогда
						Добавляемые = ДанныеКапитализаций[НаборДанныхТекущий];
						Если ЗначениеЗаполнено(Добавляемые) Тогда
							ЗаполнитьЗначенияСвойств(Базис, Добавляемые);
						КонецЕсли;
					КонецЕсли;

					Если ПараметрыИсх.ВидыБазисовЛимита.Свойство(XMLСтрока(ВидыБазисов.ВеличинаОттока)) Тогда
						Добавляемые = ВеличиныОттока[Фокус];
						Если ЗначениеЗаполнено(Добавляемые) Тогда
							ЗаполнитьЗначенияСвойств(Базис, Добавляемые);
						КонецЕсли;
					КонецЕсли;

					Если ПараметрыИсх.ВидыБазисовЛимита.Свойство(XMLСтрока(ВидыБазисов.ГарантийноеОбеспечение)) Тогда
						ТаблицаЗначений = ГарантийныеОбеспечения.СкопироватьКолонки();
						Для Каждого СтрокаИзОбщихДанных Из ГарантийныеОбеспечения Цикл
							Если ПортфелиГруппы.Найти(СтрокаИзОбщихДанных.Портфель) <> Неопределено Тогда
								СтрокаНовая = ТаблицаЗначений.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаНовая, СтрокаИзОбщихДанных);
							КонецЕсли;
						КонецЦикла;
						Добавляемые = Новый Структура(XMLСтрока(ВидыБазисов.ГарантийноеОбеспечение), ТаблицаЗначений);
						ЗаполнитьЗначенияСвойств(Базис, Добавляемые);
					КонецЕсли;
				КонецЕсли;
				БазисыПорции.Вставить(Фокус, Базис);
				#КонецОбласти
			КонецЦикла;

			//@skip-check query-in-loop
			Если ПараметрыИсх.ИспользоватьПулДанныхИзМодификатора И ЗначениеЗаполнено(ПараметрыИсх.Модификатор) Тогда
				ПараметрыЗапросаМодификатора = СобратьПараметрыЗапросаСМодификатора(ПараметрыИсх.Модификатор);
				ЗаполнитьПараметрыЗапроса(Запрос, ПараметрыЗапросаМодификатора, КлючЗапроса().Основного);
				ЗаполнитьПараметрыЗапроса(Запрос, ПараметрыИсх.ПараметрыЗапросов, КлючЗапроса().Квалификатора);

			Иначе
				ЗаполнитьПараметрыЗапроса(Запрос, ПараметрыИсх.ПараметрыЗапросов);

			КонецЕсли;

			Запрос.УстановитьПараметр("Портфели_b481", ПортфелиПорции);
			Запрос.УстановитьПараметр("Поручение_b481", ПорученияПорции);
			Запрос.УстановитьПараметр("ПустаяСтрока", "");
			Запрос.УстановитьПараметр("ПоручениеПустаяСсылка", Документы.Поручение.ПустаяСсылка());
			Запрос.УстановитьПараметр("Вместилище", Вместилище);
			Запрос.УстановитьПараметр("Исполнитель", ПараметрыИсх.Исполнитель);
			Запрос.УстановитьПараметр("ПорученияПортфелиПорции", ПорученияПортфелиПорции);
			Запрос.УстановитьПараметр("ЗеленаяЗона", ЗеленаяЗона);
			Запрос.УстановитьПараметр("ЖелтаяЗона", ЖелтаяЗона);
			Запрос.УстановитьПараметр("КраснаяЗона", КраснаяЗона);

			ПараметрыИсх.Вставить("ИмяОсновнойТаблицы", "ВТ_ТаблицаНабораДанных" + ?(ИсточникПоручение, "", ОписаниеНабора.КлючНабора));
			ПараметрыИсх.Вставить("ЕстьОшибкиРепрайсинга", ЕстьОшибкиРепрайсинга);
			ПараметрыИсх.Вставить("СписокПортфелей", ПортфелиПорции);
			ПараметрыИсх.Вставить("НаборДанныхТекущий", НаборДанныхТекущий);
			ПараметрыИсх.Вставить("КэшВмКратко", КэшВмКраткоШаблон.Скопировать());
			ПараметрыИсх.Вставить("КэшВмКраткоЭмитенты", КэшВмКраткоЭмитентыШаблон.Скопировать());
			ПараметрыИсх.Вставить("КэшВмДетально", КэшВмДетальноШаблон.Скопировать());
			ПараметрыИсх.Вставить("БазисыПорции", БазисыПорции);
			ПараметрыИсх.Вставить("ЗамерНачало_а83", ТекущаяУниверсальнаяДатаВМиллисекундах());

			Попытка
				ЗамерПроверкиЛимита = ЗамерИсполнителя(Перечисления.ВидыКлючейЗамеров.ПроверкаЛимита, Лимит);
				Окружение.ТекущийУровеньВложенности = 0;
				ПроверкаЛимитов.Проверить(Запрос, ПараметрыИсх, Окружение);

			Исключение
				Описание = ОписаниеОшибки();
				ПараметрыИсх.КэшВмКратко.Очистить();
				ПараметрыИсх.КэшВмКраткоЭмитенты.Очистить();
				ПараметрыИсх.КэшВмДетально.Очистить();

				Для Каждого Строка Из ПорцияДанных Цикл
					СтрокаКратко = РаботаСЛимитами.ДополнитьОтказом(ПараметрыИсх.КэшВмКратко, Вместилище, Описание);
					СтрокаКратко.Исполнитель = ПараметрыИсх.Исполнитель;
					ЗаполнитьЗначенияСвойств(СтрокаКратко, Строка);
				КонецЦикла;

			КонецПопытки;

			Если Шапка.ПроверкаПоручений Тогда
				Колонки = "Поручение, Лимит, Зона, Отказ";
				ТаблицаЗначений = ПараметрыИсх.КэшВмКратко.Скопировать(, Колонки); ТаблицаЗначений.Свернуть(Колонки);
				ДополнитьТаблицу(Результат.Таблицы.КэшВмКраткоПоручения, ТаблицаЗначений);
			КонецЕсли;

			РаботаСЛимитами.ЗаписатьПорциюРезультатов(ПараметрыИсх);
			РаботаСЛимитами.УдалитьВременныеТаблицыСлужебные(Менеджер);
			РаботаСЛимитами.ОбработатьСчетчик(КэшВм.Счетчик, ПорцияДанных.Количество());
			ЗавершитьЗамер(ЗамерПроверкиЛимита, Результат.Таблицы.Замеры);
		КонецЦикла;

		НастройкиЛимитов[Лимит] = Неопределено;
	КонецЦикла;

	ВыполнитьЗаписьРезультатовПроверки(КэшВм, Результат, Шапка, Вместилище, Исполнитель);
	ПодготовитьЗавершение(Результат);

	Возврат Результат(Результат, АдресРезультата);

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
