&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	
	ДатаПроверки	= ?(Объект.Ссылка.Пустая(), ТекущаяДата(), Объект.Дата);
	
	ЦенныеБумагиКлиент.ЦеннаяБумагаПроверкаВыборка(ВыбранноеЗначение, ДатаПроверки, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Если Не ВыбранноеЗначение.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.ПогашениеНКД") Тогда
			СтандартнаяОбработка	= Ложь;
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры
