
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Параметры.Свойство("РезультатСверки") Тогда
		Возврат;
	КонецЕсли;
	СтрокаРаскрытия = Неопределено; РаскрытиеПодтверждено = Ложь;
	ЭлементыДерева = РезультатСверки.ПолучитьЭлементы();
	Для Каждого СтрокаРезультата Из Параметры.РезультатСверки Цикл
		Если СтрокаРезультата.РаскрытиеСпискаВладельцев.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаРаскрытия = Неопределено Или СтрокаРезультата.РаскрытиеСпискаВладельцев <> СтрокаРаскрытия.РаскрытиеСпискаВладельцев Тогда
			ВыбратьНовыйСтатусРаскрытия(СтрокаРаскрытия);
			
			СтрокаРаскрытия = ЭлементыДерева.Добавить();
			СтрокаРаскрытия.РаскрытиеСпискаВладельцев = СтрокаРезультата.РаскрытиеСпискаВладельцев;
			СтрокаРаскрытия.ТекущийСтатус = СтрокаРезультата.ТекущийСтатус;
		КонецЕсли;
		ЭлементыСтроки = СтрокаРаскрытия.ПолучитьЭлементы();
		СтрокаРаздела = ЭлементыСтроки.Добавить();
		СтрокаРаздела.РазделСчетаДепоМХ = СтрокаРезультата.Раздел;
		СтрокаРаздела.КоличествоРаскрыто = СтрокаРезультата.КоличествоРаскрыто;
		СтрокаРаздела.КоличествоПодтверждено = СтрокаРезультата.КоличествоПодтверждено;
		Если СтрокаРезультата.КоличествоРаскрыто <> СтрокаРезультата.КоличествоПодтверждено Тогда
			ДобавитьРасхождение(СтрокаРаскрытия, "Количество ЦБ");
		КонецЕсли;
		Если СтрокаРезультата.ОстатокЦБ <> СтрокаРезультата.ОстатокЦБ_НРД Тогда
			ДобавитьРасхождение(СтрокаРаскрытия, "Остаток ЦБ");
		КонецЕсли;
		Если СтрокаРезультата.ДатаФиксации <> СтрокаРезультата.ДатаФиксации_НРД Тогда
			ДобавитьРасхождение(СтрокаРаскрытия, "Дата фиксации");
		КонецЕсли;
		Если СтрокаРезультата.ТипКД <> СтрокаРезультата.ТипКД_НРД Тогда
			ДобавитьРасхождение(СтрокаРаскрытия, "Количество ЦБ");
		КонецЕсли;
	КонецЦикла;
	ВыбратьНовыйСтатусРаскрытия(СтрокаРаскрытия);
КонецПроцедуры

Процедура ВыбратьНовыйСтатусРаскрытия(СтрокаРаскрытия)
	Если СтрокаРаскрытия <> Неопределено Тогда
		СтатусыРСВ = Перечисления.СтатусыРаскрытияСписковВладельцев;
		СтрокаРаскрытия.НовыйСтатус = ?(ПустаяСтрока(СтрокаРаскрытия.Расхождения), СтатусыРСВ.ОбработкаЗавершена, СтатусыРСВ.НеОбработано);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусы(Команда)
	УстановитьСтатусыНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусыНаСервере()
	ЭлементыДерева = РезультатСверки.ПолучитьЭлементы();
	Для Каждого Строка Из ЭлементыДерева Цикл
		Если Строка.НовыйСтатус <> Строка.ТекущийСтатус Тогда
			Попытка
				Раскрытие = Строка.РаскрытиеСпискаВладельцев.ПолучитьОбъект();
				Раскрытие.Заблокировать(); // многострадальный РСВ может переаписываться регламентными заданиями и прочими бизнес-процессами
				Раскрытие.Статус = Строка.НовыйСтатус;
				Раскрытие.Записать();
				Сообщить("" + Строка.РаскрытиеСпискаВладельцев + " установлен статус " + Строка.НовыйСтатус);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьРасхождение(СтрокаРаскрытия, Расхождение)
	Если Найти(СтрокаРаскрытия.Расхождения, Расхождение) = 0 Тогда
		Если Не ПустаяСтрока(СтрокаРаскрытия.Расхождения) Тогда
			СтрокаРаскрытия.Расхождения = СтрокаРаскрытия.Расхождения + ", ";
		КонецЕсли;
		СтрокаРаскрытия.Расхождения = СтрокаРаскрытия.Расхождения + Расхождение;
	КонецЕсли;
КонецПроцедуры

