Перем QUIK Экспорт;

Процедура ИнициироватьСоединение(Параметры = Неопределено) Экспорт
	ВнешниеДанные.ИнициироватьСоединение(QUIK, "QUIK", Параметры);
КонецПроцедуры

Функция РезультатПодписанияПоручений() Экспорт
	Ошибки = "";
	ИдентификаторыДействияИзменены = Ложь;
	
	Для Каждого ПоручениеКОбработке Из ДокументыКОбработке Цикл
		ПоручениеОбъект = ПоручениеКОбработке.Документ.ПолучитьОбъект();
		
		Для Каждого СтрокаЦБ Из ПоручениеОбъект.ЦенныеБумагиСписываемые Цикл
			Если ЗначениеЗаполнено(СтрокаЦБ.ИдентификаторДействияВQUIK) Тогда
				Продолжить;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаЦБ.ИдентификаторЗагрузки) Тогда
				Ошибки = Ошибки + ?(ЗначениеЗаполнено(Ошибки), Символы.ПС, "") + "Не заполнен идентификатор загрузки из QUIK в строке";
				Продолжить;
			КонецЕсли;
			
			Результат = QUIK.РезультатПодписанияПоручения(СтрокаЦБ.ИдентификаторЗагрузки, ПоручениеОбъект.ВидОперацииД);
			Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
				Ошибки = Ошибки + ?(ЗначениеЗаполнено(Ошибки), Символы.ПС, "") + Результат.Ошибка;
			Иначе
				СтрокаЦБ.ИдентификаторДействияВQUIK = Результат.ActionID;
				ИдентификаторыДействияИзменены = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ИдентификаторыДействияИзменены Тогда
			ПоручениеОбъект.ОбменДанными.Загрузка = Истина;
			ПоручениеОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ошибки;
КонецФункции

Функция РезультатИсполненияПоручений() Экспорт
	Результат = Новый Структура("ВсеПорученияИсполнены, Описание", Истина, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ПоручениеЦенныеБумагиСписываемые.Ссылка) КАК Представление,
	|	ПоручениеЦенныеБумагиСписываемые.ИдентификаторДействияВQUIK КАК ИдентификаторДействияВQUIK
	|ИЗ
	|	Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦенныеБумагиСписываемые
	|ГДЕ
	|	ПоручениеЦенныеБумагиСписываемые.Ссылка В(&Поручения)";
	
	Запрос.УстановитьПараметр("Поручения", ДокументыКОбработке.ВыгрузитьКолонку("Документ"));
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат.ВсеПорученияИсполнены = Ложь;
		Результат.Описание = "Отсутствуют данные для получения статуса";
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.ИдентификаторДействияВQUIK) Тогда
			Результат.ВсеПорученияИсполнены = Ложь;
			Результат.Описание = Результат.Описание + СтрШаблон("%1 не подписывалось в QUIK; ", Выборка.Представление);
			Продолжить;
		КонецЕсли;
		
		СтатусИсполнения = QUIK.СтатусИсполненияПоручения(Выборка.ИдентификаторДействияВQUIK);
		Если СтатусИсполнения.Статус = 1 Тогда
			Результат.ВсеПорученияИсполнены = Ложь;
		ИначеЕсли СтатусИсполнения.Статус <> 2 Тогда
			Результат.ВсеПорученияИсполнены = Ложь;
			Результат.Описание = Результат.Описание + СтрШаблон("%1. Ошибка при исполнении в QUIK: %2; ",
			Выборка.Представление, СтатусИсполнения.Описание);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ОтправитьЗапросыНаОтменуПоручений() Экспорт
	Ошибки = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ПоручениеЦенныеБумагиСписываемые.Ссылка) КАК Представление,
	|	ПоручениеЦенныеБумагиСписываемые.ИдентификаторЗагрузки КАК ИдентификаторЗагрузки,
	|	ПоручениеНаОтмену.ПричинаОтмены КАК ПричинаОтмены
	|ИЗ
	|	Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦенныеБумагиСписываемые
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение КАК ПоручениеНаОтмену
	|		ПО ПоручениеЦенныеБумагиСписываемые.Ссылка = ПоручениеНаОтмену.ОтменяемоеПоручение
	|			И (ПоручениеНаОтмену.Проведен)
	|			И (ПоручениеНаОтмену.ДатаИсполненияПоручения <> ДАТАВРЕМЯ(1, 1, 1))
	|ГДЕ
	|	ПоручениеЦенныеБумагиСписываемые.Ссылка В(&Поручения)";
	Запрос.УстановитьПараметр("Поручения", ДокументыКОбработке.ВыгрузитьКолонку("Документ"));
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Ошибки = "Отсутствует поручение на отмену";
		Возврат Ошибки;
	КонецЕсли;
	
	ОтменяемыеПоручения = РезультатЗапроса.Выбрать();
	Пока ОтменяемыеПоручения.Следующий() Цикл
		ЗапросОтправлен = QUIK.ОтменитьПоручение(ОтменяемыеПоручения.ИдентификаторЗагрузки, ОтменяемыеПоручения.ПричинаОтмены);
		Если Не ЗапросОтправлен Тогда
			Ошибки = Ошибки + СтрШаблон("Не удалось отправить запрос на отмену %1;", ОтменяемыеПоручения.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ошибки;
КонецФункции

Функция РезультатОтменыПоручений() Экспорт
	Результат = Новый Структура("ВсеПорученияОтменены, Описание", Истина, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ПоручениеЦенныеБумагиСписываемые.Ссылка) КАК Представление,
	|	ПоручениеЦенныеБумагиСписываемые.ИдентификаторЗагрузки КАК ИдентификаторЗагрузки
	|ИЗ
	|	Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦенныеБумагиСписываемые
	|ГДЕ
	|	ПоручениеЦенныеБумагиСписываемые.Ссылка В(&Поручения)";
	
	Запрос.УстановитьПараметр("Поручения", ДокументыКОбработке.ВыгрузитьКолонку("Документ"));
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат.ВсеПорученияОтменены = Ложь;
		Результат.Описание = "Отсутствуют данные для получения статуса";
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.ИдентификаторЗагрузки) Тогда
			Результат.ВсеПорученияОтменены = Ложь;
			Результат.Описание = Результат.Описание + СтрШаблон("%1 отсутствует идентификатор QUIK; ", Выборка.Представление);
			Продолжить;
		КонецЕсли;
		
		СтатусИсполнения = QUIK.СтатусОтменыПоручения(Выборка.ИдентификаторЗагрузки);
		Если СтатусИсполнения.Статус = 1 Тогда
			Результат.ВсеПорученияОтменены = Ложь;
		ИначеЕсли СтатусИсполнения.Статус <> 2 Тогда
			Результат.ВсеПорученияОтменены = Ложь;
			Результат.Описание = Результат.Описание + СтрШаблон("%1. Ошибка при отмене в QUIK: %2; ",
			Выборка.Представление, СтатусИсполнения.Описание);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
