&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Для Каждого ПараметрКоманды Из ПараметрКоманды Цикл
		Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Отправка уведомления возможна только для записанного документа.");
			Продолжить;
		КонецЕсли;
		
		ОтправитьУведомлениеНаСервере(ПараметрКоманды);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОтправитьУведомлениеНаСервере(ДокументУведомления)
	Если ДокументУведомления.ПометкаУдаления Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Документ " + ДокументУведомления + " помечен на удаление. Отправка не возможна.");
		Возврат;
	КонецЕсли;
	
	Документы.УведомлениеКлиентам.ПодготовитьУведомление(ДокументУведомления);
КонецПроцедуры
