#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура УдалитьИнформациюОбАвтореВерсии(Знач АвторВерсии) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВерсииОбъектов.Объект,
	|	ВерсииОбъектов.НомерВерсии,
	|	ВерсииОбъектов.ВерсияОбъекта,
	|	НЕОПРЕДЕЛЕНО КАК АвторВерсии,
	|	ВерсииОбъектов.ДатаВерсии,
	|	ВерсииОбъектов.Комментарий,
	|	ВерсииОбъектов.ТипВерсииОбъекта,
	|	ВерсииОбъектов.ВерсияПроигнорирована
	|ИЗ
	|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	|ГДЕ
	|	ВерсииОбъектов.АвторВерсии = &АвторВерсии";
	
	Запрос.УстановитьПараметр("АвторВерсии", АвторВерсии);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ВерсииОбъектов.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор["Объект"].Установить(Выборка["Объект"]);
		НаборЗаписей.Отбор["НомерВерсии"].Установить(Выборка["НомерВерсии"]);
		
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьНачальноеЗаполнениеИстории(ПараметрыВызова) Экспорт 
	Если ТипЗнч(ПараметрыВызова) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "";
	Для Каждого ОбъектВерсионирования Из ПараметрыВызова.ТаблицаОбъектов Цикл
		Если Найти(ОбъектВерсионирования.ТипОбъекта, "Справочник.") <> 0 Тогда
			Текст = "ВЫБРАТЬ
			|	Справочник.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Справочник
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
			|		ПО Справочник.Ссылка = ВерсииОбъектов.Объект
			|ГДЕ
			|	ВерсииОбъектов.Объект ЕСТЬ NULL";
			Текст = СтрЗаменить(Текст,"Справочник.Контрагенты", ОбъектВерсионирования.ТипОбъекта);
			Если НЕ ПустаяСтрока(Запрос.Текст) Тогда
				Запрос.Текст = Запрос.Текст + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
			КонецЕсли;
			Запрос.Текст = Запрос.Текст + Символы.ПС + Текст;
		ИначеЕсли Найти(ОбъектВерсионирования.ТипОбъекта, "Документ.") <> 0 Тогда
			Текст = 
			"ВЫБРАТЬ
			|	Документ.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.Поручение КАК Документ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
			|		ПО Документ.Ссылка = ВерсииОбъектов.Объект
			|ГДЕ
			|	Документ.Дата >= &ДатаС
			|	И Документ.Проведен
			|	И ВерсииОбъектов.Объект ЕСТЬ NULL ";
			Текст = СтрЗаменить(Текст,"Документ.Поручение", ОбъектВерсионирования.ТипОбъекта);
			Если ОбъектВерсионирования.ВариантВерсионирования = Перечисления.ВариантыВерсионированияОбъектов.ВерсионироватьПриЗаписи Тогда
				Текст = СтрЗаменить(Текст,"И Документ.Проведен", "");
			КонецЕсли;
			Если НЕ ПустаяСтрока(Запрос.Текст) Тогда
				Запрос.Текст = Запрос.Текст + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
			КонецЕсли;
			Запрос.Текст = Запрос.Текст + Символы.ПС + Текст;
			Запрос.УстановитьПараметр("ДатаС",ОбъектВерсионирования.ДатаС);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(Запрос.Текст) Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС +
		" 
		|
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрСведений.ВерсииОбъектов
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Запрос.Текст) Тогда
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		Выборка = Запрос.Выполнить().Выбрать();
		ВсегоОбъектов = Выборка.Количество();
		НомерОбъекта = 0;
		Пока Выборка.Следующий() Цикл 
			НомерОбъекта = НомерОбъекта + 1;
			ПроцентВыполнения = Формат(100 * НомерОбъекта / ВсегоОбъектов,"ЧДЦ=3");
			Статус = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Создание начальных версий: %1& (%2 из %3): [%4: %5] ", ПроцентВыполнения, НомерОбъекта, ВсегоОбъектов, Строка(ТипЗнч(Выборка.Ссылка)), Строка(Выборка.Ссылка));
			// Функция ПодставитьПараметрыВСтроку не умеет ни обрабатывать одиночный символ %, ни обрабатывать его экранирование, пришлось подставить временный символ &
			Статус = СтрЗаменить(Статус, "&", "%");
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				Состояние(Статус);
				ОбработкаПрерыванияПользователя();
			#Иначе	
				Сообщить(Статус);
			#КонецЕсли
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.ДополнительныеСвойства.Вставить("ВерсионированиеОбъектовКомментарийКВерсии","Начальная версия на "+Формат(ТекущаяДата(),"ДЛФ=DT"));
			ВерсионированиеОбъектов.ПриСозданииВерсииОбъекта(Объект);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры

#КонецЕсли