////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С СОХРАНЕННЫМИ НАСТРОЙКАМИ

Процедура СохранитьНастройку(ИмяНастройки, ЗначениеНастройки, ОбщаяНастройка = Ложь) Экспорт

	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ОбщаяНастройка ИЛИ ТекущийПользователь = Неопределено Тогда
		НаименованиеНастройки = "Основная";
	Иначе
		// сохраняем индивидуальные настройки
		НаименованиеНастройки = ТекущийПользователь.Имя;
	КонецЕсли;

    НаборЗаписей = РегистрыСведений.СохраненныеНастройки.СоздатьНаборЗаписей();

    //Установка отборов
    НаборЗаписей.Отбор.ИмяОбъекта.Установить(ИмяНастройки);
    НаборЗаписей.Отбор.НаименованиеНастройки.Установить(НаименованиеНастройки);

    //Добавление записи настройки в регистр
    НоваяЗапись = НаборЗаписей.Добавить();
    НоваяЗапись.ИмяОбъекта = ИмяНастройки;
    НоваяЗапись.НаименованиеНастройки = НаименованиеНастройки;
    НоваяЗапись.СохраненнаяНастройка = Новый ХранилищеЗначения(ЗначениеНастройки);
    НаборЗаписей.Записать();

КонецПроцедуры // СохранитьНастройку()

Функция ВосстановитьНастройку(ИмяНастройки, ОбщаяНастройка = Ложь) Экспорт

	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ОбщаяНастройка ИЛИ ТекущийПользователь = Неопределено Тогда
		НаименованиеНастройки = "Основная";
	Иначе
		// восстановить настройку для конкретного пользователя
		НаименованиеНастройки = ТекущийПользователь.Имя;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|   СохраненныеНастройки.СохраненнаяНастройка
	|ИЗ
	|   РегистрСведений.СохраненныеНастройки КАК СохраненныеНастройки
	|ГДЕ
	|   СохраненныеНастройки.ИмяОбъекта = &ИмяОбъекта
	|   И СохраненныеНастройки.НаименованиеНастройки = &НаименованиеНастройки");
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяНастройки);
	Запрос.УстановитьПараметр("НаименованиеНастройки", НаименованиеНастройки);
	Результат = Запрос.Выполнить();

	// При неудаче - восстанавливаем общую настройку
	Если НаименованиеНастройки <> "Основная" И Результат.Пустой() Тогда
		НаименованиеНастройки = "Основная";
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|   СохраненныеНастройки.СохраненнаяНастройка
		|ИЗ
		|   РегистрСведений.СохраненныеНастройки КАК СохраненныеНастройки
		|ГДЕ
		|   СохраненныеНастройки.ИмяОбъекта = &ИмяОбъекта
		|   И СохраненныеНастройки.НаименованиеНастройки = &НаименованиеНастройки");
		Запрос.УстановитьПараметр("ИмяОбъекта", ИмяНастройки);
		Запрос.УстановитьПараметр("НаименованиеНастройки", НаименованиеНастройки);
		Результат = Запрос.Выполнить();
	КонецЕсли;
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		СохраненноеЗначениеХранилище = Результат.Выгрузить()[0].СохраненнаяНастройка;
		Возврат СохраненноеЗначениеХранилище.Получить();
	КонецЕсли;

КонецФункции // ВосстановитьНастройку()
