
// Процедура - Вывести расшифровку настройки на сервере
//
// Параметры:
//  Настройка					 - Структура с записью РС СохраненныеНастройки, содержащая:
//   ИмяОбъекта            - Строка - Измерение РС
//   НаименованиеНастройки - Строка - Измерение РС
//  ТабличныйДокументРезультат	 - ТабличныйДокумент - Табличный документ - для вывода результата расшифровки
//  Оформление					 - ТабличныйДокумент - Табличный документ содержащий макет оформления
//
&НаСервере
Процедура ВывестиРасшифровкуНастройкиНаСервере(Настройка, ТабличныйДокументРезультат, Оформление = Неопределено)
	ТабличныйДокументРезультат.Очистить();
	Если Настройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СохраненныеНастройки.СохраненнаяНастройка КАК СохраненнаяНастройка
	|ИЗ
	|	РегистрСведений.СохраненныеНастройки КАК СохраненныеНастройки
	|ГДЕ
	|	СохраненныеНастройки.ИмяОбъекта = &ИмяОбъекта
	|	И СохраненныеНастройки.НаименованиеНастройки = &НаименованиеНастройки";
	
	Запрос.УстановитьПараметр("ИмяОбъекта", Настройка.ИмяОбъекта);
	Запрос.УстановитьПараметр("НаименованиеНастройки", Настройка.НаименованиеНастройки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Хранилище = ВыборкаДетальныеЗаписи.СохраненнаяНастройка;
	Иначе
		Возврат;
	КонецЕсли;
	
	Данные = Хранилище.Получить();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Попытка
		Если ТипЗнч(Данные) = Тип("ТаблицаЗначений") Тогда
			Таблица = Данные;
		ИначеЕсли ТипЗнч(Данные) = Тип("Структура") Тогда
			Таблица = РегистрыСведений.СохраненныеНастройки.СтруктураВТаблицуЗначений(Данные);
		Иначе
			Таблица = Данные;
		КонецЕсли;
		
		Построитель = Новый ПостроительОтчета;
		Построитель.ТекстЗаголовка = Настройка.ИмяОбъекта + " [" + Настройка.НаименованиеНастройки + "]";
		Если Не Оформление = Неопределено Тогда
			Построитель.МакетОформления = Неопределено;
			Построитель.МакетОформления = Оформление;
			Построитель.ОформитьМакет();
		КонецЕсли;
		
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Таблица);
		Построитель.Вывести(ТабличныйДокумент);
		
		РегистрыСведений.СохраненныеНастройки.РасчетШириныКолонок(ТабличныйДокумент, 4, 4);
		
		ТабличныйДокументРезультат.Вывести(ТабличныйДокумент);
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Процедура - Список при активизации строки
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Оформление = ПолучитьМакетОформления(СтандартноеОформление.Серебро);
	#Иначе
		Оформление = Неопределено;
	#КонецЕсли
	
	ВывестиРасшифровкуНастройкиНаСервере(Элементы.Список.ТекущаяСтрока, Результат, Оформление);
КонецПроцедуры
