Функция СтатусПорученияПоФормеОтчета(ИмяФормы, КодОперации) Экспорт
	Макет = Справочники.ВидыИнвентарныхПоручений.ПолучитьМакет("ФормыОтчетов");
	Для Сч = 2 По Макет.ВысотаТаблицы Цикл
		Если Макет.Область("R"+Сч+"C2").Текст = ИмяФормы И (Макет.Область("R"+Сч+"C1").Текст = КодОперации ИЛИ Макет.Область("R"+Сч+"C1").Текст = "*") Тогда
			Статус = Макет.Область("R"+Сч+"C3").Текст;
			Попытка
				Возврат Перечисления.СтатусыДокументовФайловыйШлюз[Статус];
			Исключение
				Возврат Перечисления.СтатусыДокументовФайловыйШлюз.ПустаяСсылка();
			КонецПопытки;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Перечисления.СтатусыДокументовФайловыйШлюз.ПустаяСсылка();
КонецФункции // СтатусПорученияПоФормеОтчета()

Процедура УстановитьНастройкиПоУмолчанию(Ссылка) Экспорт
	Объект = Ссылка.ПолучитьОбъект();
	Макет = ИндивидуальныйМакетВидаПоручения(Ссылка);
	Если Макет = Неопределено Тогда
		Макет = МакетПоФорматуПоручения(Объект.ФорматПоручения);
	КонецЕсли;
	Объект.НастройкиОтображения = Новый ХранилищеЗначения(Макет);
	Объект.СхемаКомпоновкиДанных = Неопределено; // будет использоваться схема из конфигурации
	Объект.Записать();
КонецПроцедуры

Функция ИндивидуальныйМакетВидаПоручения(Ссылка) Экспорт
	Наименование = Справочники.ВидыИнвентарныхПоручений.ПолучитьИмяПредопределенного(Ссылка);
	Если Метаданные.Справочники.ВидыИнвентарныхПоручений.Макеты.Найти(Наименование) = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Справочники.ВидыИнвентарныхПоручений.ПолучитьМакет(Наименование);
	КонецЕсли;
КонецФункции

Функция МакетПоФорматуПоручения(ФорматПоручения) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ИмяСекции = Строка(ФорматПоручения);
	
	Макет = Справочники.ВидыИнвентарныхПоручений.ПолучитьМакет("НастройкиОтображенияПоУмолчанию");
	
	ШиринаТаблицы = Макет.ШиринаТаблицы;
	
	ОбластьШапка = Макет.ПолучитьОбласть(1, 2, 1, ШиринаТаблицы);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ОбластьНастройки = Макет.Области.Настройки;
	Для НомерСтроки = ОбластьНастройки.Верх По ОбластьНастройки.Низ Цикл
		ОбластьФормата = Макет.ПолучитьОбласть(НомерСтроки, 1, НомерСтроки, 1);
		Если СокрЛП(ОбластьФормата.ТекущаяОбласть.Текст) = ИмяСекции Тогда
			ОбластьСтрока = Макет.ПолучитьОбласть(НомерСтроки, 2, НомерСтроки, ШиринаТаблицы);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЕсли;
	КонецЦикла;
	
	ТабличныйДокумент.Макет = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция возвращает данные по удостоверяющим документам переданного юридического/физического лица
//
// Параметры:
//  ЮрФизЛицо	 - СправочникСсылка.ЮридическиеЛица или СправочникСсылка.ФизическиеЛица - Ссылка на лицо
// 
// Возвращаемое значение:
//  Структура - Данные по удостоверяющим документам
//
Функция ДанныеУдостоверяющихДокументовЮрФизЛица(ЮрФизЛицо) Экспорт
	
	Результат = Новый Структура("ТипДокумента, НомерДокумента, СерияДокумента, ДатаДокумента, ОрганРегистрации");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид.КодИМНС КАК ТипДокумента,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК НомерДокумента,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК СерияДокумента,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ДатаДокумента,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ОрганРегистрации
		|ИЗ
		|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(, ФизЛицо = &Лицо) КАК ПаспортныеДанныеФизЛицСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЮридическиеЛица.НеРезидент
		|			ТОГДА ""INCR""
		|		ИНАЧЕ ""OGRN""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЮридическиеЛица.НеРезидент
		|			ТОГДА ЮридическиеЛица.РегНомер
		|		ИНАЧЕ ЮридическиеЛица.ОГРН
		|	КОНЕЦ,
		|	"""",
		|	ЮридическиеЛица.ДатаГосРегистрации,
		|	ЮридическиеЛица.РегистрирующийОрган
		|ИЗ
		|	Справочник.ЮридическиеЛица КАК ЮридическиеЛица
		|ГДЕ
		|	ЮридическиеЛица.Ссылка = &Лицо";
	
	Запрос.УстановитьПараметр("Лицо", ЮрФизЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.ТипДокумента = Выборка.ТипДокумента;
		Результат.НомерДокумента = Выборка.НомерДокумента;
		Результат.СерияДокумента = Выборка.СерияДокумента;
		Результат.ДатаДокумента = Выборка.ДатаДокумента;
		Результат.ОрганРегистрации = Выборка.ОрганРегистрации;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции