
Процедура ОбработатьВходящиеПакетыФайловогоШлюза() Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьФайловыйШлюзДляОтправкиПоручений") Тогда
		Возврат;
	КонецЕсли;
	
	ВремяНачалаОбработатьВходящиеПакетыФайловогоШлюза = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ОбработатьОтправленныеПакеты();
	
	ОбработатьПакетыСОшибками();
	
	ОбработатьВыпискиЗадерживающиесяСОтправкой();
	
	ОбработатьВходящиеПакеты();
	
	ОбработатьРаскрытияСписковВладельцев();
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ЭкспортПорученийВЛуч_ОбработатьВходящиеПакетыФайловогоШлюза",
													ВремяНачалаОбработатьВходящиеПакетыФайловогоШлюза);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////

Процедура ОбработатьОтправленныеПакеты()
	// Отправленные пакеты
	ВнешнийИсточникФайловыйШлюзКаталогОтправленных = ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзКаталогОтправленных;
	ПутьДляЗагрузки = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточникФайловыйШлюзКаталогОтправленных).Папка;
	Если ЗначениеЗаполнено(ПутьДляЗагрузки) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДокументовФайловыйШлюз.ВыгруженоФайловыйШлюз);
		Запрос.Текст = "ВЫБРАТЬ
		|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Документ,
		|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Пакет,
		|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Пакет.ОтносительныйПуть КАК ОтносительныйПуть
		|ИЗ
		|	РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних КАК СостоянияДокументовВФайловомШлюзеСрезПоследних
		|ГДЕ
		|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус = &Статус";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Каталог = Новый Файл(ПутьДляЗагрузки + "\" + Выборка.ОтносительныйПуть);
			Если Каталог.Существует() И Каталог.ЭтоКаталог() Тогда
				ПакетОбъект = Выборка.Пакет.ПолучитьОбъект();
				ПакетОбъект.Статус = Перечисления.СтатусыДокументовФайловыйШлюз.ВыгруженоВебКабинет;
				ПакетОбъект.Записать();
				
				РегистрыСведений.СостоянияДокументовВФайловомШлюзе.ДобавитьЗапись(ТекущаяДатаСеанса(),
					Выборка.Документ, Перечисления.СтатусыДокументовФайловыйШлюз.ВыгруженоВебКабинет, Выборка.Пакет);
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
 
Процедура ОбработатьПакетыСОшибками()
	// Пакеты с ошибками
	ВнешнийИсточникФайловыйШлюзКаталогОшибок = ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзКаталогОшибок;
	ПутьДляЗагрузки = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточникФайловыйШлюзКаталогОшибок).Папка;
	Если ЗначениеЗаполнено(ПутьДляЗагрузки) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДокументовФайловыйШлюз.ВыгруженоФайловыйШлюз);
		Запрос.Текст = "ВЫБРАТЬ
		               |	СостоянияДокументовВФайловомШлюзеСрезПоследних.Документ КАК Документ,
		               |	СостоянияДокументовВФайловомШлюзеСрезПоследних.Пакет КАК Пакет,
		               |	СостоянияДокументовВФайловомШлюзеСрезПоследних.Пакет.ОтносительныйПуть КАК ОтносительныйПуть
		               |ИЗ
		               |	РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних(, 1 = 1) КАК СостоянияДокументовВФайловомШлюзеСрезПоследних
		               |ГДЕ
		               |	СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус = &Статус";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Каталог = Новый Файл(ПутьДляЗагрузки + "\" + Выборка.ОтносительныйПуть);
			Если Каталог.Существует() И Каталог.ЭтоКаталог() Тогда
				ОбработатьОдинПакетСОшибками(Выборка, ПутьДляЗагрузки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьОдинПакетСОшибками(Выборка, ПутьДляЗагрузки)
	ПакетОбъект = Выборка.Пакет.ПолучитьОбъект();
	ПакетОбъект.Статус = Перечисления.СтатусыДокументовФайловыйШлюз.ОшибкаФайловыйШлюз;
	ПакетОбъект.Записать();
	
	ДатаОшибки = Дата(1, 1, 1);
	ОписаниеОшибки = "";
	
	СтруктураФайла = Новый Структура;
	Попытка
		ФайлОшибки = Новый Файл(ПутьДляЗагрузки + "\" + Выборка.ОтносительныйПуть + "\" + "error.xml");
		Если ФайлОшибки.Существует() Тогда
			ПрочитатьФайлСОписаниемОшибки(ФайлОшибки, СтруктураФайла);
		КонецЕсли;
		СтруктураФайла.Свойство("time", ДатаОшибки);
		СтруктураФайла.Свойство("description", ОписаниеОшибки);
	Исключение
		
	КонецПопытки;
	
	ПериодЗаписи = ?(ЗначениеЗаполнено(ДатаОшибки), ДатаОшибки, ТекущаяДатаСеанса());
	РегистрыСведений.СостоянияДокументовВФайловомШлюзе.ДобавитьЗапись(ПериодЗаписи, Выборка.Документ,
			Перечисления.СтатусыДокументовФайловыйШлюз.ОшибкаФайловыйШлюз, Выборка.Пакет, ОписаниеОшибки);
			
	ДокументОснование = Выборка.Документ.ДокументОснование;
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Выписка") Тогда
		Документы.ТехническаяОперация.ОтправитьУведомлениеОбОшибкеДоставкиВыписки(Выборка.Документ, ОписаниеОшибки, Выборка.Пакет);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьВыпискиЗадерживающиесяСОтправкой()
	КомментарийОЗадержкеОтправки  = "Уведомление отправлено о задержке пакета создано";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних(, Документ.ДокументОснование ССЫЛКА Документ.Выписка) КАК СостоянияДокументовВФайловомШлюзеСрезПоследних
	|ГДЕ
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовФайловыйШлюз.ВыгруженоФайловыйШлюз)
	|	И СостоянияДокументовВФайловомШлюзеСрезПоследних.Комментарий <> &КомментарийОЗадержкеОтправки
	|	И СостоянияДокументовВФайловомШлюзеСрезПоследних.Период МЕЖДУ &ЧасНазад И &ДеньНазад";
	ТекущаяДата = ТекущаяДатаСеанса();
	Запрос.УстановитьПараметр("ЧасНазад", ТекущаяДата - ОбщегоНазначенияПовтИсп.СекундВЧасе());
	Запрос.УстановитьПараметр("ДеньНазад", ТекущаяДата - ОбщегоНазначенияПовтИсп.СекундВСутках());
	Запрос.УстановитьПараметр("КомментарийОЗадержкеОтправки", КомментарийОЗадержкеОтправки);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		ОписаниеОшибки = "Не происходит отправка пакета из шлюза. Возможно шлюз не работает";
		Пока Выборка.Следующий() Цикл
			Документы.ТехническаяОперация.ОтправитьУведомлениеОбОшибкеДоставкиВыписки(Выборка.Документ, ОписаниеОшибки, Выборка.Пакет);
			РегистрыСведений.СостоянияДокументовВФайловомШлюзе.ДобавитьЗапись(ТекущаяДата, Выборка.Документ,
						Перечисления.СтатусыДокументовФайловыйШлюз.ВыгруженоФайловыйШлюз, Выборка.Пакет, КомментарийОЗадержкеОтправки);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьФайлСОписаниемОшибки(ФайлОшибки, СтруктураФайла)
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ФайлОшибки.ПолноеИмя);
	Пока ЧтениеXML.Прочитать() Цикл
		Пока ЧтениеXML.Прочитать() Цикл
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				ИмяУзла = ЧтениеXML.Имя;
			Иначе
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст И ИмяУзла <> "" Тогда
					СтруктураФайла.Вставить(ИмяУзла, ЧтениеXML.Значение);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off
// BSLLS:NestedStatements-off

Процедура ОбработатьВходящиеПакеты()
	//Входящие пакеты
	ВнешнийИсточникФайловыйШлюзКаталогВходящие = ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзКаталогВходящие;
	ПутьДляЗагрузки = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточникФайловыйШлюзКаталогВходящие).Папка;
	
	ВнешнийИсточникФайловыйШлюзКаталоАрхив = ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзКаталогАрхив;
	ПутьАрхив = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточникФайловыйШлюзКаталоАрхив).Папка;
	
	ДокументыКПеренумерации = Новый Массив;
	
	Если ЗначениеЗаполнено(ПутьАрхив) Тогда
		// каталог архива на текущую дату
		ПутьАрхиваНаТекущуюДатуПоСистеме = ОбщийКаталогПеремещаемогоФайлаВАрхив(ПутьАрхив);
		Файл = Новый Файл(ПутьАрхиваНаТекущуюДатуПоСистеме);
		Если Не Файл.Существует() Тогда
			СоздатьКаталог(ПутьАрхиваНаТекущуюДатуПоСистеме);
		КонецЕсли;
	Иначе
		ПутьАрхиваНаТекущуюДатуПоСистеме = "";
	КонецЕсли;
	
	
	
	Если ЗначениеЗаполнено(ПутьДляЗагрузки) Тогда
		МассивКаталоговZ = НайтиФайлы(ПутьДляЗагрузки, "Z???????*");
		// Уведомления о принятии(непринятии) поручений/распоряжений (К)
		МассивКаталоговK = НайтиФайлы(ПутьДляЗагрузки, "K???????*"); 
		Для Каждого Каталог Из МассивКаталоговK Цикл
			МассивФайлов = НайтиФайлы(Каталог.ПолноеИмя, "*.xml");
			Для Каждого Файл Из МассивФайлов Цикл
				
				СквознойИдентификаторВызова = Новый УникальныйИдентификатор;
				
				СтруктураФайла = Новый Структура();
				
				СтатусПакета = Перечисления.СтатусыДокументовФайловыйШлюз.ПринятоКИсполнению;
				
				ЧтениеXML = Новый ЧтениеXML;
				ЧтениеXML.ОткрытьФайл(Файл.ПолноеИмя);   
				
				// проверка формата файла обмена
				Если Не ЧтениеXML.Прочитать() Тогда
					
					ЗаписьЖурналаРегистрации("Загрузка уведомлений о принятии(непринятии) поручений/распоряжений", 
					УровеньЖурналаРегистрации.Предупреждение,,, 
					"Ошибка при чтении файла: " + Файл.ПолноеИмя);
					
					Продолжить;
				КонецЕсли;
				
				Если ЧтениеXML.ЛокальноеИмя = "information" Тогда	// депозитарная система не смогла идентифицировать
																	// полученный документ как поручение/инструкцию
					ТекстОшибкиИсходный = "";
					ТекстОшибкиПолный = "";
					
					Пока ЧтениеXML.Прочитать() Цикл
						Если Не ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
							Продолжить;
						КонецЕсли;
						Если ЧтениеXML.ЛокальноеИмя = "line" Тогда
							Если ЧтениеXML.ЗначениеАтрибута("severity") = "ERROR" Тогда
								ЧтениеXML.Прочитать();
								Если ТекстОшибкиИсходный = "" Тогда
									ТекстОшибкиИсходный = ЧтениеXML.Значение;	  
								КонецЕсли; 
								
								ТекстОшибкиПолный = ТекстОшибкиПолный + " " + ЧтениеXML.Значение;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					Если ТекстОшибкиИсходный <> "" Тогда
						ТекстОшибки = ТекстОшибкиИсходный;
						Поз = СтрНайти(ТекстОшибки, " ");
						Пока Поз > 0 Цикл
							ТекстОшибки = Сред(ТекстОшибки, Поз + 1);					
							Поз = СтрНайти(ТекстОшибки, " ");
						КонецЦикла; 
						ИмяФайла = Лев(ТекстОшибки, СтрДлина(ТекстОшибки) - 1);
					КонецЕсли; 	
					
					ИмяФайла = СтрЗаменить(ВРЕГ(ИмяФайла), ".XML", "");
					
					Запрос = Новый Запрос;
					Запрос.УстановитьПараметр("Имяфайла", ИмяФайла);
					Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
					|	ИсходящийПакетВФайловыйШлюз.ДокументОснование КАК ТехническаяОперация
					|ИЗ
					|	Документ.ИсходящийПакетВФайловыйШлюз КАК ИсходящийПакетВФайловыйШлюз
					|ГДЕ
					|	НЕ ИсходящийПакетВФайловыйШлюз.ПометкаУдаления И ОтносительныйПуть = &Имяфайла";
					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда	// По входящему пакету из файлового шлюза сопоставлен документ ""Техническая операция"
						ПараметрыПоиска = Новый Структура("ПолныйПуть, ДокументОснование, Обработан",
															Файл.Путь, Выборка.ТехническаяОперация, Ложь);
						ВходящийПакет = Документы.ВходящийПакетИзФайловогоШлюза.НайтиДокумент(ПараметрыПоиска);
						Если НЕ ЗначениеЗаполнено(ВходящийПакет) Тогда
							НовыйВходящийПакет = Документы.ВходящийПакетИзФайловогоШлюза.СоздатьДокумент();
							НовыйВходящийПакет.Дата = ТекущаяДатаСеанса();
							НовыйВходящийПакет.ДокументОснование = Выборка.ТехническаяОперация;
							НовыйВходящийПакет.Комментарий = "Создан автоматически в " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");  
						Иначе
							НовыйВходящийПакет = ВходящийПакет.ПолучитьОбъект();
							НовыйВходящийПакет.СодержимоеФайла.Очистить();
						КонецЕсли; 
						НовыйВходящийПакет.ОтносительныйПуть = ИмяФайла;
						НовыйВходящийПакет.ПолныйПуть = Файл.Путь;
						НовыйВходящийПакет.Статус = Перечисления.СтатусыДокументовФайловыйШлюз.ОшибкаФайловыйШлюз;
						
						Если ЗначениеЗаполнено(ПутьАрхиваНаТекущуюДатуПоСистеме) Тогда
							
							ПутьАрхиваВОбщихКаталогах = ОбщийКаталогПеремещаемогоФайлаВАрхив(ПутьАрхиваНаТекущуюДатуПоСистеме, "K");
							НовыйВходящийПакет.ПутьАрхив = ПутьАрхиваВОбщихКаталогах + "\" + Каталог.Имя;
						КонецЕсли; 
						
						НовыйВходящийПакет.Записать();
						
						РегистрыСведений.СостоянияДокументовВФайловомШлюзе.ДобавитьЗапись(ТекущаяДатаСеанса(), Выборка.ТехническаяОперация, 
								Перечисления.СтатусыДокументовФайловыйШлюз.ОшибкаФайловыйШлюз, НовыйВходящийПакет.Ссылка, ТекстОшибкиПолный);
						
						НовыйВходящийПакет.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
					
				ИначеЕсли ЧтениеXML.ЛокальноеИмя = "Batch" Тогда
					ИмяУзла = "";
					
					Пока ЧтениеXML.Прочитать() Цикл
						
						Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
							ИмяУзла = ЧтениеXML.Имя;
						ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст И ИмяУзла <> "" Тогда	
							СтруктураФайла.Вставить(ИмяУзла, ЧтениеXML.Значение);				
						КонецЕсли;
						
					КонецЦикла;
					
					КодОшибки = "";
					ОписаниеОшибки = "";
					
					Если СтруктураФайла.Свойство("abort_code") Тогда
						КодОшибки = СтруктураФайла.abort_code;
					КонецЕсли; 
					Если СтруктураФайла.Свойство("abort_cause") Тогда
						ОписаниеОшибки = СтруктураФайла.abort_cause;
					КонецЕсли; 
					
					Если КодОшибки <> "" Тогда
						СтатусПакета = Перечисления.СтатусыДокументовФайловыйШлюз.НеПринятоКИсполнению;
					КонецЕсли; 
					
					Если СтруктураФайла.contragent_doc_id <> "" И СтруктураФайла.create_date <> "" Тогда
						
						contragent_doc_id = СтруктураФайла.contragent_doc_id;
						Если КодОшибки = "" Тогда
							reg_no      = СтруктураФайла.reg_no;
							ДеньРегистрации = Дата(Лев(СтруктураФайла.reg_date, 4), Сред(СтруктураФайла.reg_date, 6, 2), Сред(СтруктураФайла.reg_date, 9, 2));
							ДатаВремяРегистрации = ДатаВремя(ДеньРегистрации, Сред(СтруктураФайла.reg_date, 12));
							reg_date    = XMLЗначение(Тип("Дата"), СтруктураФайла.reg_date);
						Иначе
							reg_no      = "";
							reg_date    = "";
						КонецЕсли; 
						
						create_date = XMLЗначение(Тип("Дата"), СтруктураФайла.create_date);
						
						Выборка = ВыборкаТехническаяОперацияПоНомеруИДате(contragent_doc_id, create_date);
						Если Выборка.Следующий() Тогда
							ТехническаяОперация = Выборка.Документ;
						Иначе
							ТехническаяОперация = Документы.ТехническаяОперация.ПустаяСсылка();
						КонецЕсли; 
						Если ЗначениеЗаполнено(ТехническаяОперация) Тогда
							// По входящему пакету из файлового шлюза сопоставлен документ ""Техническая операция"
							
							Если КодОшибки = "" Тогда
								ОбъектТО = ТехническаяОперация.ПолучитьОбъект();
								ОбъектТО.РегистрационныйНомер = reg_no;
								ОбъектТО.РегистрационнаяДата = reg_date;
								ОбъектТО.КодОтчетаНРД = reg_no;
								ОбъектТО.ДатаИсполнения = ДатаВремяРегистрации;
								ОбъектТО.Записать();
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ТехническаяОперация.ДокументОснование) Тогда
								РеквизитыПоручения = РегистрыСведений.ДокументыВыгруженныеВЛуч.РеквизитыВыгрузки(
									ТехническаяОперация.ДокументОснование);
								РегистрыСведений.ДокументыВыгруженныеВЛуч.ДобавитьДокумент(
									ТехническаяОперация.ДокументОснование, РеквизитыПоручения.ДатаВыгрузки,
									РеквизитыПоручения.ИсходящийНомер, reg_no, ПараметрыСеанса.ТекущийПользователь);
							КонецЕсли; 
							
							ВходящийПакет = Документы.ВходящийПакетИзФайловогоШлюза.НайтиДокумент(
								Новый Структура("ПолныйПуть, Обработан", Файл.Путь, Ложь));
							Если НЕ ЗначениеЗаполнено(ВходящийПакет) Тогда
								НовыйВходящийПакет = Документы.ВходящийПакетИзФайловогоШлюза.СоздатьДокумент();
								НовыйВходящийПакет.Дата = ТекущаяДатаСеанса();
								НовыйВходящийПакет.Комментарий = "Создан автоматически в " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");  
							Иначе
								НовыйВходящийПакет = ВходящийПакет.ПолучитьОбъект();
								НовыйВходящийПакет.СодержимоеФайла.Очистить();
							КонецЕсли; 
							НовыйВходящийПакет.ДокументОснование = ТехническаяОперация.Ссылка;
							НовыйВходящийПакет.ОтносительныйПуть = Каталог.Имя;
							НовыйВходящийПакет.ПолныйПуть = Файл.Путь;
							НовыйВходящийПакет.Статус = СтатусПакета;
							
							Если ЗначениеЗаполнено(ПутьАрхиваНаТекущуюДатуПоСистеме) Тогда
								ПутьАрхиваВОбщихКаталогах = ОбщийКаталогПеремещаемогоФайлаВАрхив(ПутьАрхиваНаТекущуюДатуПоСистеме, "K");
								НовыйВходящийПакет.ПутьАрхив = ПутьАрхиваВОбщихКаталогах + "\" + Каталог.Имя;								
							КонецЕсли; 
							
							Для каждого КлючИЗначение Из СтруктураФайла Цикл
								НовСтр = НовыйВходящийПакет.СодержимоеФайла.Добавить();
								НовСтр.Элемент = КлючИЗначение.Ключ;
								НовСтр.Значение = КлючИЗначение.Значение;
							КонецЦикла; 
							
							НовыйВходящийПакет.Обработан = Истина;
							
							НовыйВходящийПакет.Записать();
							
							ПериодЗаписи = ТекущаяДатаСеанса();
							РегистрыСведений.СостоянияДокументовВФайловомШлюзе.ДобавитьЗапись(ПериодЗаписи,
								ТехническаяОперация.Ссылка, СтатусПакета, НовыйВходящийПакет.Ссылка,
								?(КодОшибки = "", "", "Код причины отказа: " + КодОшибки + ". Причина отказа: "
									+ ОписаниеОшибки));
									
							НовыйВходящийПакет.Записать(РежимЗаписиДокумента.Проведение);
							
							ПроверитьИЗаписатьОшибкуЗагрузкиПоРСВ(Выборка.ДокументОснование, ОписаниеОшибки);
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли ЧтениеXML.ЛокальноеИмя = "MeetingInstructionStatus" Тогда
					ПутьАрхив = "";
					Если ЗначениеЗаполнено(ПутьАрхиваНаТекущуюДатуПоСистеме) Тогда
						ПутьАрхиваВОбщихКаталогах = ОбщийКаталогПеремещаемогоФайлаВАрхив(ПутьАрхиваНаТекущуюДатуПоСистеме, "K");
						ПутьАрхив = ПутьАрхиваВОбщихКаталогах + "\" + Каталог.Имя;
					КонецЕсли;
					ОбработатьMeetingInstructionStatus(ЧтениеXML, ПутьАрхив);
				КонецЕсли;
				
				ЧтениеXML.Закрыть();
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ПутьАрхиваВОбщихКаталогах) Тогда
				СтарыйПутьКаталога = Каталог.ПолноеИмя;
				РаботаСФайлами.ПереместитьКаталог(СтарыйПутьКаталога, ПутьАрхиваВОбщихКаталогах + "\" + Каталог.Имя);
				ЗаписьЖурналаРегистрации("Архивация файлов входящих пакетов (К)", УровеньЖурналаРегистрации.Информация,
							Метаданные.Обработки.ЭкспортПорученийВЛуч,, 
							"Каталог " + Каталог.Имя + " перемещен: " + СтарыйПутьКаталога + " => " + ПутьАрхиваВОбщихКаталогах + "\" + Каталог.Имя);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ДатаПереходаНаНовыйМеханизмБлокировокЦБ =
			РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("5577.ДатаПереходаНаНовыйМеханизмБлокировокЦБ");
		
		// Отчет по поручению (Z)
		РазрешенныеКодыОпераций = РазрешенныеКодыОперацийДляЭкспорта();
		ИмяСобытияЖР_ЗагрузкаОтчетовПоПоручению = "Загрузка отчетов по поручению (Z)";
		
		Если ЗначениеЗаполнено(ПутьАрхиваНаТекущуюДатуПоСистеме) Тогда
			ПутьАрхиваВОбщихКаталогах = ОбщийКаталогПеремещаемогоФайлаВАрхив(ПутьАрхиваНаТекущуюДатуПоСистеме, "Z");
		КонецЕсли;
		
		Для Каждого Каталог Из МассивКаталоговZ Цикл
			МассивФайлов = НайтиФайлы(Каталог.ПолноеИмя, "*.zip", Истина);
			
			ПомещатьВАрхив = Истина;
			
			Для Каждого Файл Из МассивФайлов Цикл
				ДанныеФайлов = ДанныеФайловОтчетаПоПоручению(Файл);
				ТипОтчета = ДанныеФайлов.ТипОтчета;
				
				Если Не ДанныеФайлов.ОбрабатыватьФайл Тогда
					ТекстОшибки = "Не удалось обработать файл с идентификатором кода отчета: " + ДанныеФайлов.ИдентификаторКодаОтчета;
					ЗаписьЖурналаРегистрации(ИмяСобытияЖР_ЗагрузкаОтчетовПоПоручению, УровеньЖурналаРегистрации.Информация,
						Метаданные.Обработки.ЭкспортПорученийВЛуч, , ТекстОшибки);
					Продолжить;
				КонецЕсли;
				
				Если РазрешенныеКодыОпераций.Найти(ТипОтчета) = Неопределено Тогда
					ЗаписьЖурналаРегистрации(ИмяСобытияЖР_ЗагрузкаОтчетовПоПоручению, УровеньЖурналаРегистрации.Информация,
						Метаданные.Обработки.ЭкспортПорученийВЛуч, ,
						"Тип отчета каталога " + Каталог.ПолноеИмя + " не включен в список разрешенных кодов операций: " + ТипОтчета);
					Продолжить;
				КонецЕсли;
				
				ФормаОтчета = ДанныеФайлов.ФормаОтчета;
				НомерОтчета = ДанныеФайлов.НомерОтчета;
				ДатаОтчета = ДанныеФайлов.ДатаОтчета;
				ДатаИсполненияВДепозитарииМХ = ДанныеФайлов.ДатаИсполненияВДепозитарииМХ;
				ИдентификаторОтчета = ДанныеФайлов.ИдентификаторОтчета;
				РегистрационныйНомер = ДанныеФайлов.РегистрационныйНомер;
				ДатаРегистрации = ДанныеФайлов.ДатаРегистрации;
				НомерПоручения = ДанныеФайлов.НомерПоручения;
				ДатаПоручения = ДанныеФайлов.ДатаПоручения;
				КодКонтрагентаНРД = ДанныеФайлов.КодКонтрагентаНРД;
				НаименованиеКонтрагентаНРД = ДанныеФайлов.НаименованиеКонтрагентаНРД;
				
				ДатаИсполненияВМестеРасчетов = ДанныеФайлов.ДатаИсполненияВМестеРасчетов;
				Если Не ЗначениеЗаполнено(ДатаИсполненияВМестеРасчетов) Тогда
					ДатаИсполненияВМестеРасчетов = НачалоДня(ДатаОтчета);
				КонецЕсли;
				
				Если ТипОтчета = "10/50" ИЛИ ТипОтчета = "10/CA" ИЛИ ТипОтчета = "10/CA2" Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					|	Поручение.Ссылка
					|ИЗ
					|	Документ.Поручение КАК Поручение
					|ГДЕ
					|	НАЧАЛОПЕРИОДА(Поручение.ДатаИсполненияПоручения, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаИсполненияПоручения, ДЕНЬ)
					|	И Поручение.КодОтчетаНРД = &КодОтчетаНРД
					|	И Поручение.ВидОперацииД = &Погашение";
					
					Запрос.УстановитьПараметр("ДатаИсполненияПоручения", ДатаОтчета);
					Запрос.УстановитьПараметр("КодОтчетаНРД", НомерОтчета);
					Запрос.УстановитьПараметр("Погашение", Справочники.ВидыОпераций.Погашение);
					
					Результат = Запрос.Выполнить();
					
					Если Результат.Пустой() Тогда
						
						НовоеПоручение = Документы.Поручение.СоздатьДокумент();
						НовоеПоручение.Дата = ДатаОтчета;
						НовоеПоручение.ДатаИсполненияПоручения = НовоеПоручение.Дата + 1;
						НовоеПоручение.ДатаИсполненияПорученияВДепозитарииМХ = НовоеПоручение.ДатаИсполненияПоручения;
						НовоеПоручение.ДатаИсполненияПорученияВМестеРасчетов = НовоеПоручение.ДатаИсполненияПоручения;
						НовоеПоручение.КодОтчетаНРД = НомерОтчета;
						НовоеПоручение.ВидОперацииД = Справочники.ВидыОпераций.Погашение;
						НовоеПоручение.Инициатор = Константы.МестоХраненияПоУмолчанию.Получить(); 
						НовоеПоручение.Автор = ПараметрыСеанса.ТекущийПользователь;
						
						ОстаткиСовпадают = Истина;
						ТекстОшибки = "";
						
						Если ЗначениеЗаполнено(ДанныеФайлов.ДанныеПоВсемЦБ) Тогда
							Для Каждого ДанныеПоЦБ Из ДанныеФайлов.ДанныеПоВсемЦБ Цикл
								
								ЦБ = Справочники.ЦенныеБумаги.ЦеннаяБумагаПоКодуЗагрузкиНДЦ(ДанныеПоЦБ.КодВНРД, ДатаОтчета);
								Если ЦБ.Пустая() Тогда
									Продолжить;
								КонецЕсли;
								
								РазделСчетаДепоМХ = Справочники.РазделыСчетаДепоМХ.НайтиПоКоду(ДанныеПоЦБ.КодРаздела);
								СчетДепоМХ = РазделСчетаДепоМХ.Владелец;
								
								ОстаткиЦБ = ОстаткиПоЦБ(КонецДня(ДатаОтчета), ЦБ, СчетДепоМХ, РазделСчетаДепоМХ);
								
								Если ОстаткиЦБ.Количество() > 0 Тогда
									Для каждого СтрокаОстаток Из ОстаткиЦБ Цикл
										
										НовСтрока = НовоеПоручение.ЦенныеБумагиСписываемые.Добавить();
										НовСтрока.ЦеннаяБумага = ЦБ;
										
										НовСтрока.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
										НовСтрока.СчетДепоМХ = СчетДепоМХ;
										НовСтрока.СчетДепо = СтрокаОстаток.СчетДепо;
										НовСтрока.РазделСчетаДепо = СтрокаОстаток.РазделСчетаДепо;
										НовСтрока.Количество = СтрокаОстаток.Количество;
										
									КонецЦикла; 
									
									КоличествоЦБ = ОстаткиЦБ.Итог("Количество");
								Иначе
									НовСтрока = НовоеПоручение.ЦенныеБумагиСписываемые.Добавить();
									НовСтрока.ЦеннаяБумага = ЦБ;
									
									НовСтрока.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
									НовСтрока.СчетДепоМХ = СчетДепоМХ;
									НовСтрока.Количество = -ДанныеПоЦБ.Количество;
									
									КоличествоЦБ = 0;
								КонецЕсли;
								
								Если КоличествоЦБ <> -Число(ДанныеПоЦБ.Количество) Тогда
									ОстаткиСовпадают = Ложь;
									ТекстОшибки = ТекстОшибки + Символы.ПС + "ЦБ """ + ДанныеПоЦБ.КодВНРД + """ на счете """ + РазделСчетаДепоМХ.Код;
								КонецЕсли;
							КонецЦикла;
							
						КонецЕсли;
						
						Если НовоеПоручение.ЦенныеБумагиСписываемые.Количество() > 0 Тогда
							НовоеПоручение.ЦБ = НовоеПоручение.ЦенныеБумагиСписываемые[0].ЦеннаяБумага;
						КонецЕсли;
						
						НовоеПоручение.КоличествоЦБ = НовоеПоручение.ЦенныеБумагиСписываемые.Итог("Количество");
						
						Если ОстаткиСовпадают Тогда
							НовоеПоручение.Записать(РежимЗаписиДокумента.Проведение);
						Иначе
							НовоеПоручение.Записать(РежимЗаписиДокумента.Запись);
							
							ЗаписьЖурналаРегистрации("Загрузка отчета о погашении ЦБ",
							УровеньЖурналаРегистрации.Предупреждение,
							Метаданные.Документы.Поручение,
							НовоеПоручение.Ссылка,
							"Не совпадает количество ЦБ по отчету НРД : " + ТекстОшибки);
						КонецЕсли;
						
					КонецЕсли;
					
				ИначеЕсли ТипОтчета = "14" Тогда
					
					ТехническаяОперация = Документы.ТехническаяОперация.НайтиДокумент(
					Новый Структура("РегистрационныйНомер, КодОперации", РегистрационныйНомер, ТипОтчета));
					Если ЗначениеЗаполнено(ТехническаяОперация) Тогда
						ТехническаяОперацияОбъект = ТехническаяОперация.ПолучитьОбъект();
					Иначе
						ТехническаяОперацияОбъект = Документы.ТехническаяОперация.СоздатьДокумент();
					КонецЕсли;
					ТехническаяОперацияОбъект.Номер						= Формат(ИдентификаторОтчета, "ЧГ=0");
					ТехническаяОперацияОбъект.Дата						= ТекущаяДатаСеанса();
					ТехническаяОперацияОбъект.РегистрационныйНомер		= РегистрационныйНомер;
					ТехническаяОперацияОбъект.РегистрационнаяДата		= ДатаРегистрации;
					ТехническаяОперацияОбъект.НомерДокументаОснования	= НомерПоручения;
					ТехническаяОперацияОбъект.ДатаДокументаОснования	= ДатаПоручения;
					ТехническаяОперацияОбъект.КодОтчетаНРД				= НомерОтчета;
					ТехническаяОперацияОбъект.ДатаИсполнения			= ДатаОтчета;
					ТехническаяОперацияОбъект.ТипОперации				= ФормаОтчета;
					ТехническаяОперацияОбъект.КодОперации				= ТипОтчета;
					ТехническаяОперацияОбъект.ПорядковыйНомерВнутриДня	= 1;
					ТехническаяОперацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
					ВходящийПакет = Документы.ВходящийПакетИзФайловогоШлюза.НайтиДокумент(
					Новый Структура("НомерВходящегоДокумента, ДатаВходящегоДокумента", НомерОтчета, ДатаОтчета));
					Если ЗначениеЗаполнено(ВходящийПакет) Тогда
						ВходящийПакетОбъект = ВходящийПакет.ПолучитьОбъект();
					Иначе
						ВходящийПакетОбъект = Документы.ВходящийПакетИзФайловогоШлюза.СоздатьДокумент();
					КонецЕсли;
					ВходящийПакетОбъект.Дата						= ТекущаяДатаСеанса();
					ВходящийПакетОбъект.Комментарий				= "Создан автоматически в " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
					ВходящийПакетОбъект.ДокументОснование		= ТехническаяОперацияОбъект.Ссылка;
					ВходящийПакетОбъект.ОтносительныйПуть		= Каталог.Имя;
					ВходящийПакетОбъект.ПолныйПуть				= Файл.Путь;
					ВходящийПакетОбъект.Статус					= Перечисления.СтатусыДокументовФайловыйШлюз.Исполнено;
					ВходящийПакетОбъект.КодОперации				= ТипОтчета;
					ВходящийПакетОбъект.НомерВходящегоДокумента	= НомерОтчета;
					ВходящийПакетОбъект.ДатаВходящегоДокумента	= ДатаОтчета;
					ВходящийПакетОбъект.Обработан				= Истина;
					Если ЗначениеЗаполнено(ПутьАрхиваНаТекущуюДатуПоСистеме) Тогда
						ПутьАрхиваВОбщихКаталогах = ОбщийКаталогПеремещаемогоФайлаВАрхив(ПутьАрхиваНаТекущуюДатуПоСистеме, "Z");
						ВходящийПакетОбъект.ПутьАрхив = ПутьАрхиваВОбщихКаталогах + "\" + Каталог.Имя;
					КонецЕсли;
					ВходящийПакетОбъект.СодержимоеФайла.Загрузить(ДанныеФайлов.ВсеФайлы);
					ВходящийПакетОбъект.Записать();
					ВходящийПакетОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
				Иначе
					СтатусПоручения = Справочники.ВидыИнвентарныхПоручений.СтатусПорученияПоФормеОтчета(ФормаОтчета, ТипОтчета);
					ТехническаяОперация = Документы.ТехническаяОперация.НайтиДокумент(
						Новый Структура("РегистрационныйНомер, КодОперации", РегистрационныйНомер, ТипОтчета));
					Если ЗначениеЗаполнено(ТехническаяОперация) Тогда
						НеобработанныйВходящийПакет = Документы.ВходящийПакетИзФайловогоШлюза.НайтиДокумент(
							Новый Структура("НомерВходящегоДокумента, ДатаВходящегоДокумента, Обработан", НомерОтчета, ДатаОтчета, Ложь));
						Если ЗначениеЗаполнено(НеобработанныйВходящийПакет) Тогда
							НовыйВходящийПакет = НеобработанныйВходящийПакет.ПолучитьОбъект();
						Иначе	
							НовыйВходящийПакет = Документы.ВходящийПакетИзФайловогоШлюза.СоздатьДокумент();
							НовыйВходящийПакет.Дата = ТекущаяДатаСеанса();
							НовыйВходящийПакет.Комментарий = "Создан автоматически в " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
							НовыйВходящийПакет.Обработан = Ложь;
							НовыйВходящийПакет.КодОперации = ТипОтчета;
							НовыйВходящийПакет.НомерВходящегоДокумента = НомерОтчета;
							НовыйВходящийПакет.ДатаВходящегоДокумента = ДатаОтчета;
							
							ВходящийПакетПоТекущемуОтчету = Документы.ВходящийПакетИзФайловогоШлюза.НайтиДокумент(
								Новый Структура("НомерВходящегоДокумента, ДатаВходящегоДокумента", НомерОтчета, ДатаОтчета));
							НовыйВходящийПакет.ПовторныйОтчет = ЗначениеЗаполнено(ВходящийПакетПоТекущемуОтчету);
						КонецЕсли;
						
						Если НовыйВходящийПакет.ПовторныйОтчет Тогда
							НовыйВходящийПакет.Обработан = Истина;
						КонецЕсли;
						
						НовыйВходящийПакет.ДокументОснование = ТехническаяОперация;
						НовыйВходящийПакет.ОтносительныйПуть = Каталог.Имя;
						НовыйВходящийПакет.ПолныйПуть = Файл.Путь;
						
						Если ЗначениеЗаполнено(ПутьАрхиваНаТекущуюДатуПоСистеме) Тогда
							НовыйВходящийПакет.ПутьАрхив = ПутьАрхиваВОбщихКаталогах + "\" + Каталог.Имя;
						КонецЕсли;
						
						Если ТипЗнч(ДанныеФайлов.КоличествоИсполненноеВНРД) = Тип("Число") Тогда
							ИсполненноеКоличествоЦБ = ДанныеФайлов.КоличествоИсполненноеВНРД;
						Иначе
							ИсполненноеКоличествоЦБ = 0;
							ЗаписьЖурналаРегистрации(ИмяСобытияЖР_ЗагрузкаОтчетовПоПоручению, УровеньЖурналаРегистрации.Ошибка,
								Метаданные.Обработки.ЭкспортПорученийВЛуч, НовыйВходящийПакет.Ссылка,
								"КоличествоИсполненноеВНРД не удалось привести к числу");
						КонецЕсли;
						НовыйВходящийПакет.СодержимоеФайла.Загрузить(ДанныеФайлов.ВсеФайлы);
						
						СтатусПоручения = СкорректированныйСтатусПоручения(ТехническаяОперация, СтатусПоручения,
							?(НовыйВходящийПакет.ПовторныйОтчет, 0, ИсполненноеКоличествоЦБ));
						НовыйВходящийПакет.Статус = СтатусПоручения;
						
						Попытка
							НовыйВходящийПакет.Записать();
						Исключение
							ПомещатьВАрхив = Ложь;
							Продолжить;
						КонецПопытки;
						
						Попытка
							НовыйВходящийПакет.Записать(РежимЗаписиДокумента.Проведение);
						Исключение
							Продолжить;
						КонецПопытки;
						
						Если НовыйВходящийПакет.Статус = Перечисления.СтатусыДокументовФайловыйШлюз.НеИсполнено
							И ДанныеФайлов.ТребуетсяСоздатьПоручениеНаОтмену Тогда
							СоздатьОтменуПоручения(ТехническаяОперация.ДокументОснование, НомерОтчета, ДатаОтчета);
						КонецЕсли;
						
						Если ЗначениеЗаполнено(ДатаПереходаНаНовыйМеханизмБлокировокЦБ) Тогда
							ОбработатьБлокировкуЦБ(НовыйВходящийПакет, ДатаПереходаНаНовыйМеханизмБлокировокЦБ, ДанныеФайлов);
						КонецЕсли;
						
						ЭтоТехническаяОперацияПоПоручению = ЗначениеЗаполнено(ТехническаяОперация.ДокументОснование)
							И ТипЗнч(ТехническаяОперация.ДокументОснование) = Тип("ДокументСсылка.Поручение");
						Если ЭтоТехническаяОперацияПоПоручению Тогда
							Поручение = ТехническаяОперация.ДокументОснование;
							ЭтоМультиПоручениеП35_2 = Документы.Поручение.ЭтоМультиПоручениеП35_2(Поручение);
							Is352FormGS036 = ЭтоМультиПоручениеП35_2 И ВРЕГ(ФормаОтчета) = "GS036";
							Is352FormMS035 = ЭтоМультиПоручениеП35_2 И ВРЕГ(ФормаОтчета) = "MS035";
						Иначе
							ЭтоМультиПоручениеП35_2 = Ложь;
							Is352FormGS036 = Ложь;
							Is352FormMS035 = Ложь;
						КонецЕсли;
						Если Is352FormGS036 Тогда
							ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.УведомлениеОРегистрацииЗаявкиВУКПаи;
							Документы.УведомлениеКлиентам.СоздатьИОтправитьУведомление(Поручение, ФормаСообщенияКК, НовыйВходящийПакет.Ссылка);
						КонецЕсли;
						
						Если ЗначениеЗаполнено(СтатусПоручения) И ЗначениеЗаполнено(ТехническаяОперация)
							И Не НовыйВходящийПакет.ПовторныйОтчет Тогда
							
							НачатьТранзакцию();
							ЗаписатьСтатусПоручения = Истина;
							
							Если СтатусПоручения = Перечисления.СтатусыДокументовФайловыйШлюз.Исполнено
								Или СтатусПоручения = Перечисления.СтатусыДокументовФайловыйШлюз.ИсполненоЧастично Тогда
								ДокументОснования = ТехническаяОперация.ДокументОснование;
								Если ЗначениеЗаполнено(ДокументОснования) Тогда
									Если НачалоДня(ДатаОтчета) = НачалоДня(ТекущаяДата()) Тогда
										ДатаПоследнейВыгрузкиЭДО = РегистрыСведений.РегистрацияДокументовВЭДО.ПоследнееВремяРегистрации(ДатаОтчета);
										Если ДатаОтчета < ДатаПоследнейВыгрузкиЭДО Тогда
											ДатаОтчета = ДатаПоследнейВыгрузкиЭДО + 1;
										КонецЕсли;
									КонецЕсли;
									Комментарий = "Отчет/выписка №" + ?(ЭтоМультиПоручениеП35_2, НомерОтчета, РегистрационныйНомер)
										+ " от " + Формат(ДатаОтчета, "ДФ=dd.MM.yyyy");
									Если ЭтоМультиПоручениеП35_2 И ЗначениеЗаполнено(Поручение.ДатаИсполненияПоручения) Тогда
										ТекстОшибки = "";
									Иначе
										ТекстОшибки = РезультатЗаполненияПоручения(ДокументОснования,
											РегистрационныйНомер, ДатаОтчета, ДатаИсполненияВМестеРасчетов, НомерОтчета, Комментарий);
									КонецЕсли;
									Если ТекстОшибки = "" И Is352FormMS035 Тогда
										ЗначенияПараметровОперацииЦБ = Новый Структура;
										КодЦБвНРД = ДанныеФайлов.КодЦБвНРД;
										ЦБ = Справочники.ЦенныеБумаги.ЦеннаяБумагаПоКодуЗагрузкиНДЦ(КодЦБвНРД, ДатаОтчета);
										ЗначенияПараметровОперацииЦБ.Вставить("ЦБ", ?(ЗначениеЗаполнено(КодЦБвНРД), ЦБ, Неопределено));
										ЗначенияПараметровОперацииЦБ.Вставить("КоличествоЦБ", ИсполненноеКоличествоЦБ);
										ЗначенияПараметровОперацииЦБ.Вставить("ДатаИсполненияВДепозитарииМХ", ДатаОтчета);
										ЗначенияПараметровОперацииЦБ.Вставить("ДатаИсполненияВМестеРасчетов", ДатаИсполненияВМестеРасчетов);
										КомментарийОперацииЦБ = СокрЛП(ТехническаяОперация.Комментарий)
											+ ?(ЗначениеЗаполнено(ТехническаяОперация.Комментарий), " | ", "") + Комментарий;
										ЗначенияПараметровОперацииЦБ.Вставить("КомментарийОперацииЦБ", КомментарийОперацииЦБ);
										Документы.Поручение.СоздатьОбновитьОперацииЦБ(Поручение, РежимЗаписиДокумента.Проведение, ДатаОтчета, ,
											НомерОтчета, ЗначенияПараметровОперацииЦБ);
									КонецЕсли;
									Если ТекстОшибки = "" И (ТипЗнч(ДокументОснования) = Тип("ДокументСсылка.Поручение")
											Или ТипЗнч(ДокументОснования) = Тип("ДокументСсылка.НеттоПоручение")) Тогда
										ДокументыКПеренумерации.Добавить(ДокументОснования);
										
									ИначеЕсли Не СокрЛП(ТекстОшибки) = "" Тогда
										ПомещатьВАрхив = Ложь;
										ЗаписьЖурналаРегистрации("Заполнение поручений по данным Луча", 
											УровеньЖурналаРегистрации.Предупреждение, ДокументОснования.Метаданные(), 
											ДокументОснования, ТекстОшибки);
									КонецЕсли;
									
									ТекстОшибки = РезультатЗаполненияДанныхДепонента(ДокументОснования, КодКонтрагентаНРД, НаименованиеКонтрагентаНРД);
									
									Если Не СокрЛП(ТекстОшибки) = "" Тогда
										ПомещатьВАрхив = Ложь;
										ЗаписьЖурналаРегистрации("Заполнение поручений по данным Луча", 
											УровеньЖурналаРегистрации.Предупреждение, ДокументОснования.Метаданные(), 
											ДокументОснования, ТекстОшибки);
									КонецЕсли;
									
									Если ТипЗнч(ДокументОснования) = Тип("ДокументСсылка.НеттоПоручение")
										И ИсполненноеКоличествоЦБ > 0 Тогда
										
										ВидОперацииНетто = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснования, "ВидОперации");
										ТекстОшибки = Документы.ИсполнениеПоручения.РезультатФормированияИсполненияПоручения(ДокументОснования,
											ВидОперацииНетто, НомерОтчета, ИсполненноеКоличествоЦБ, ДатаОтчета,
											ДатаИсполненияВДепозитарииМХ, ДатаИсполненияВМестеРасчетов);
										
										Если ЗначениеЗаполнено(ТекстОшибки) Тогда
											ОтменитьТранзакцию();
											ЗаписатьСтатусПоручения = Ложь;
											
											Если НовыйВходящийПакет.Обработан Тогда
												УстановитьФлажокОбработан(НовыйВходящийПакет.Ссылка, Ложь);
											КонецЕсли;
											
											ПомещатьВАрхив = Ложь;
											ЗаписьЖурналаРегистрации("Формирование исполнения поручения",
												УровеньЖурналаРегистрации.Ошибка, ДокументОснования.Метаданные(),
												ДокументОснования, ТекстОшибки);
										КонецЕсли;
									КонецЕсли;
									
								Иначе
									ОбъектТО = ТехническаяОперация.ПолучитьОбъект();
									ОбъектТО.КодОтчетаНРД = НомерОтчета;
									ОбъектТО.ДатаИсполнения = ДатаОтчета;
									ОбъектТО.Записать();
								КонецЕсли;
							КонецЕсли;
							
							Если ЗаписатьСтатусПоручения Тогда
								Если Не НовыйВходящийПакет.Обработан Тогда
									УстановитьФлажокОбработан(НовыйВходящийПакет.Ссылка, Истина);
								КонецЕсли;
								
								КомментарийОтчета = ДанныеФайлов.ПричинаОтмены;
								РегистрыСведений.СостоянияДокументовВФайловомШлюзе.ДобавитьЗапись(ТекущаяДатаСеанса(), ТехническаяОперация,
									СтатусПоручения, НовыйВходящийПакет.Ссылка, КомментарийОтчета, ИсполненноеКоличествоЦБ);
								ЭтоОтказПоПричинеОкончанияКлиринга = СтрНайти(КомментарийОтчета, "INSTRUCTION UNSETTLED - END OF RECYCLING")> 0;
								Если ЭтоОтказПоПричинеОкончанияКлиринга Тогда
									ДокументОснования = ТехническаяОперация.ДокументОснование;
									Если ЗначениеЗаполнено(ДокументОснования) Тогда
										ВыгрузитьПоручениеПовторно(ДокументОснования);
									КонецЕсли;
								КонецЕсли;
								ЗафиксироватьТранзакцию();
							КонецЕсли;
							
						ИначеЕсли Не ЗначениеЗаполнено(СтатусПоручения) И ЗначениеЗаполнено(ТехническаяОперация) Тогда
							Если ЗначениеЗаполнено(ДанныеФайлов.СообщениеОтНРД) Тогда
								СообщениеОтНРД = ДанныеФайлов.СообщениеОтНРД;
							ИначеЕсли ЗначениеЗаполнено(ДанныеФайлов.ПричинаПриостановки) Тогда
								СообщениеОтНРД = ДанныеФайлов.ПричинаПриостановки;
							Иначе
								СообщениеОтНРД = "";
							КонецЕсли;
							
							Если ЗначениеЗаполнено(СообщениеОтНРД) Тогда
								ПоследнийЗаполненныйСтатус = ПоследнийЗаполненныйСтатусТехническойОперации(ТехническаяОперация);
								РегистрыСведений.СостоянияДокументовВФайловомШлюзе.ДобавитьЗапись(ТекущаяДатаСеанса(), ТехническаяОперация,
									ПоследнийЗаполненныйСтатус, НовыйВходящийПакет.Ссылка, СообщениеОтНРД);
							КонецЕсли;
						КонецЕсли;
						
					Иначе
						
						Запрос = Новый Запрос;
						Запрос.Текст =
						"ВЫБРАТЬ ПЕРВЫЕ 1
						|	ТехническаяОперация.Ссылка КАК Ссылка
						|ИЗ
						|	Документ.ТехническаяОперация КАК ТехническаяОперация
						|ГДЕ
						|	ТехническаяОперация.Проведен
						|	И ТехническаяОперация.Номер = &Номер
						|	И НАЧАЛОПЕРИОДА(ТехническаяОперация.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";
						Запрос.УстановитьПараметр("Номер", НомерПоручения);
						Запрос.УстановитьПараметр("Дата", ДатаПоручения);
						Если Не Запрос.Выполнить().Пустой() Тогда
							ПомещатьВАрхив = Ложь;
							Продолжить;
						КонецЕсли;
						
						ТехническаяОперацияТранзит = Документы.ТехническаяОперация.СоздатьДокумент();
						ТехническаяОперацияТранзит.Номер = Формат(ИдентификаторОтчета, "ЧГ=0");
						ТехническаяОперацияТранзит.Дата = ТекущаяДатаСеанса();
						ТехническаяОперацияТранзит.РегистрационныйНомер = РегистрационныйНомер;
						ТехническаяОперацияТранзит.РегистрационнаяДата = ДатаРегистрации;
						ТехническаяОперацияТранзит.НомерДокументаОснования = НомерПоручения;
						ТехническаяОперацияТранзит.ДатаДокументаОснования = ДатаПоручения;
						ТехническаяОперацияТранзит.КодОтчетаНРД = НомерОтчета;
						ТехническаяОперацияТранзит.ДатаИсполнения = ДатаОтчета;
						ТехническаяОперацияТранзит.ТипОперации = ФормаОтчета;
						ТехническаяОперацияТранзит.КодОперации = ТипОтчета;
						ТехническаяОперацияТранзит.ПорядковыйНомерВнутриДня = 1;
						ТехническаяОперацияТранзит.Записать(РежимЗаписиДокумента.Проведение);
						
						ВходящийПакетТранзит = Документы.ВходящийПакетИзФайловогоШлюза.СоздатьДокумент();
						ВходящийПакетТранзит.Дата = ТекущаяДатаСеанса();
						ВходящийПакетТранзит.Комментарий = "Создан автоматически в " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");  
						ВходящийПакетТранзит.ДокументОснование = ТехническаяОперацияТранзит.Ссылка;
						ВходящийПакетТранзит.ОтносительныйПуть = Каталог.Имя;
						ВходящийПакетТранзит.ПолныйПуть = Файл.Путь;
						ВходящийПакетТранзит.Статус = Перечисления.СтатусыДокументовФайловыйШлюз.Исполнено;
						
						Если ЗначениеЗаполнено(ПутьАрхиваНаТекущуюДатуПоСистеме) Тогда
							ВходящийПакетТранзит.ПутьАрхив = ПутьАрхиваВОбщихКаталогах + "\" + Каталог.Имя;
						КонецЕсли;
						
						ВходящийПакетТранзит.СодержимоеФайла.Загрузить(ДанныеФайлов.ВсеФайлы);
						ВходящийПакетТранзит.Записать();
						ВходящийПакетТранзит.Записать(РежимЗаписиДокумента.Проведение);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ПутьАрхиваВОбщихКаталогах) И ПомещатьВАрхив Тогда
				
				СтарыйПутьКаталога = Каталог.ПолноеИмя;
				РаботаСФайлами.ПереместитьКаталог(СтарыйПутьКаталога, ПутьАрхиваВОбщихКаталогах + "\" + Каталог.Имя);
				ЗаписьЖурналаРегистрации("Архивация файлов входящих пакетов (Z)", УровеньЖурналаРегистрации.Информация,
							Метаданные.Обработки.ЭкспортПорученийВЛуч,, 
							"Каталог " + Каталог.Имя + " перемещен: " + СтарыйПутьКаталога + " => " + ПутьАрхиваВОбщихКаталогах + "\" + Каталог.Имя);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Перенумеровать(ДокументыКПеренумерации);
		
	КонецЕсли;
КонецПроцедуры

Функция ДанныеФайловОтчетаПоПоручению(Файл)
	ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("zip");
	ДвоичныеДанные = Новый ДвоичныеДанные(Файл.ПолноеИмя);
	ДвоичныеДанные.Записать(ИмяПромежуточногоФайла);
	
	ВременныйКаталог = СтрЗаменить(ИмяПромежуточногоФайла, ".zip", "");
	ЧтениеАрхива = Новый ЧтениеZipФайла(ИмяПромежуточногоФайла);
	ЧтениеАрхива.ИзвлечьВсе(ВременныйКаталог);
	
	ОбрабатыватьДепозитарнуюОтчетностьXML =
		РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("1123.ОбрабатыватьДепозитарнуюОтчетностьВxml", Ложь);
		
	// NOTE: Временный функционал - отчеты видов 40 и 41 пока что всегда обрабатывать в формате dbf
	Если ОбрабатыватьДепозитарнуюОтчетностьXML Тогда
		ФайлыВидаОтчета40 = НайтиФайлы(ВременныйКаталог, "is40?.rpt", Истина);
		ФайлыВидаОтчета41 = НайтиФайлы(ВременныйКаталог, "is41k.rpt", Истина);
		ЭтоОтчетВида40Или41 = ЗначениеЗаполнено(ФайлыВидаОтчета40) Или ЗначениеЗаполнено(ФайлыВидаОтчета41);
		ОбрабатыватьДепозитарнуюОтчетностьXML = Не ЭтоОтчетВида40Или41;
	КонецЕсли;
	
	Если ОбрабатыватьДепозитарнуюОтчетностьXML Тогда
		ДанныеФайлов = ДанныеФайловОтчетаПоПоручениюXML(ВременныйКаталог);
		Если ДанныеФайлов.НайденоФайлов = 0 И ДанныеФайлов.ОбрабатыватьФайл Тогда
			ОбрабатыватьДепозитарнуюОтчетностьXML = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ОбрабатыватьДепозитарнуюОтчетностьXML Тогда
		ДанныеФайлов = ДанныеФайловОтчетаПоПоручениюDBF(ВременныйКаталог);
	КонецЕсли;
	
	УдалитьФайлы(ВременныйКаталог);
	УдалитьФайлы(ИмяПромежуточногоФайла);
	
	Возврат ДанныеФайлов;
КонецФункции

Функция НовыеДанныеФайлов()
	ДанныеФайлов = Новый Структура("ВсеФайлы, ТипОтчета, ФормаОтчета, НомерОтчета, ДатаОтчета, ДатаИсполненияВДепозитарииМХ,
		|ИдентификаторОтчета, РегистрационныйНомер, ДатаРегистрации, НомерПоручения, ДатаПоручения,
		|КодКонтрагентаНРД, НаименованиеКонтрагентаНРД, ДатаИсполненияВМестеРасчетов, ДанныеПоВсемЦБ,
		|РазделМХЗачисления, РазделМХСписания, РазделМХБлокировка, БлокировкаКоличествоЦБ, КоличествоИсполненноеВНРД, ТребуетсяСоздатьПоручениеНаОтмену,
		|ПричинаОтмены, КодЦБвНРД, СообщениеОтНРД, ПричинаПриостановки, ИдентификаторКодаОтчета, ОбрабатыватьФайл, НайденоФайлов");
	ДанныеФайлов.ОбрабатыватьФайл = Истина;
	ДанныеФайлов.КоличествоИсполненноеВНРД = 0;
	Возврат ДанныеФайлов;
КонецФункции

Функция ДанныеФайловОтчетаПоПоручениюDBF(ВременныйКаталог)
	ВсеФайлы = ВсеФайлыDBF(ВременныйКаталог);
	ИменаФайлов = Новый Массив;
	ОбщегоНазначения.ЗаполнитьМассивУникальнымиЗначениями(ИменаФайлов, ВсеФайлы.ВыгрузитьКолонку("ИмяФайла"));
	ДанныеФайлов = НовыеДанныеФайлов();
	ДанныеФайлов.ВсеФайлы = ВсеФайлы;
	ДанныеФайлов.НайденоФайлов = ИменаФайлов.Количество();
	
	reporth = "reporth.dbf";
	ДанныеФайлов.ТипОтчета = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "ORD_TYPE_I", reporth);
	ДанныеФайлов.ФормаОтчета = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "OUT_FORM", reporth);
	ДанныеФайлов.НомерОтчета = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "REG_NO", reporth);
	ДанныеФайлов.ДатаОтчета = ДатаВремя(ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "REG_DATE", reporth),
		ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "TREG_DATE", reporth));
	ДанныеФайлов.ДатаИсполненияВДепозитарииМХ = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "OPERDAY", reporth);
	ДанныеФайлов.ИдентификаторОтчета = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "REPORT_ID", reporth);
	ДанныеФайлов.РегистрационныйНомер = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "IN_REG_NO", reporth);
	ДанныеФайлов.ДатаРегистрации = ДатаВремя(ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "IN_REG_DAT", reporth),
		ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "TIN_REG_DA", reporth));
	ДанныеФайлов.НомерПоручения = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "REPL_TO_NO", reporth);
	ДанныеФайлов.ДатаПоручения = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "REPL_TO_DA", reporth);
	ДанныеФайлов.КодКонтрагентаНРД = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "PERSON_COD", reporth);
	ДанныеФайлов.НаименованиеКонтрагентаНРД = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "PERSON_NAM", reporth);
	
	hbltrans = "hbltrans.dbf";
	ДанныеФайлов.ДатаИсполненияВМестеРасчетов = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "OPER_DATE", hbltrans);
	ДанныеФайлов.РазделМХБлокировка = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "TLORO_SEC", hbltrans);
	
	ДанныеФайлов.ДанныеПоВсемЦБ = ДанныеПоВсемЦБ_DBF(ВсеФайлы);
	
	tranblsc = "tranblsc.dbf";
	ДанныеФайлов.КодЦБвНРД = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "SECURITY_C", tranblsc);
	ДанныеФайлов.КоличествоИсполненноеВНРД = КоличествоИсполненноеВНРД_DBF(ВсеФайлы, tranblsc);
	
	htrans = "htrans.dbf";
	ДанныеФайлов.РазделМХЗачисления = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "TSEC_CODE", htrans);
	ДанныеФайлов.РазделМХСписания = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "FSEC_CODE", htrans);
	
	ДанныеФайлов.БлокировкаКоличествоЦБ = БлокировкаКоличествоЦБ_DBF(ВсеФайлы, "transs.dbf");
	Если Не ЗначениеЗаполнено(ДанныеФайлов.БлокировкаКоличествоЦБ) Тогда
		ДанныеФайлов.БлокировкаКоличествоЦБ = БлокировкаКоличествоЦБ_DBF(ВсеФайлы, tranblsc);
	КонецЕсли;
	
	ДанныеФайлов.ТребуетсяСоздатьПоручениеНаОтмену = ТребуетсяСоздатьПоручениеНаОтмену(ВсеФайлы);
	ДанныеФайлов.ПричинаОтмены = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "ABORT_CAUS", "abort.dbf");
	ДанныеФайлов.СообщениеОтНРД = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "MESSAGE", "messages.dbf");
	
	Возврат ДанныеФайлов;
КонецФункции

Функция БлокировкаКоличествоЦБ_DBF(ВсеФайлы, ИмяФайла)
	БлокировкаКоличествоЦБ = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "SEQ_AMO", ИмяФайла);
	Если ЗначениеЗаполнено(БлокировкаКоличествоЦБ) Тогда
		БлокировкаКоличествоЦБ = СтрЗаменить(БлокировкаКоличествоЦБ, " ", "");
		БлокировкаКоличествоЦБ = СтрЗаменить(БлокировкаКоличествоЦБ, Символы.НПП, "");
		БлокировкаКоличествоЦБ = СтроковыеФункцииКлиентСервер.ЧислоИзСтроки(БлокировкаКоличествоЦБ);
	Иначе
		БлокировкаКоличествоЦБ = 0;
	КонецЕсли;
	Возврат БлокировкаКоличествоЦБ;
КонецФункции

Функция ДанныеПоВсемЦБ_DBF(ВсеФайлы)
	anysecur = "anysecur.dbf";
	КоличествоСтрок = КоличествоСтрокВТаблицеВсеФайлы(ВсеФайлы, anysecur);
	ДанныеПоВсемЦБ = Новый Массив;
	Для НомерСтрокиФайла = 1 По КоличествоСтрок Цикл
		ДанныеПоЦБ = Новый Структура("КодВНРД, КодРаздела, Количество");
		ДанныеПоЦБ.КодВНРД = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "SECURITY_C", anysecur, НомерСтрокиФайла);
		ДанныеПоЦБ.КодРаздела = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "SECTION_CO", anysecur, НомерСтрокиФайла);
		ДанныеПоЦБ.Количество = ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, "SEQ_AMO", anysecur, НомерСтрокиФайла);
		ДанныеПоВсемЦБ.Добавить(ДанныеПоЦБ);
	КонецЦикла;
	Возврат ДанныеПоВсемЦБ;
КонецФункции

Функция КоличествоСтрокВТаблицеВсеФайлы(ВсеФайлы, ИмяФайла)
	КоличествоСтрок = 0;
	Отбор = Новый Структура("ИмяФайла", ИмяФайла);
	НайденныеСтроки = ВсеФайлы.НайтиСтроки(Отбор);
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		ТекущийНомерСтроки = СтроковыеФункцииКлиентСервер.ЧислоИзСтроки(СтрокаТаблицы.НомерСтрокиФайла);
		Если ТекущийНомерСтроки > КоличествоСтрок Тогда
			КоличествоСтрок = ТекущийНомерСтроки;
		КонецЕсли;
	КонецЦикла;
	Возврат КоличествоСтрок;
КонецФункции

Функция ИменаУзловXML(ПрочитанныйОбъект)
	ИменаУзлов = Новый Структура;
	ИменаУзлов.Вставить("ИдентификаторКодаОтчета", "AppHdr.MsgDefIdr");
	ИменаУзлов.Вставить("ФормаОтчета", "AppHdr.BizSvc");
	ИменаУзлов.Вставить("НомерОтчета", "AppHdr.BizMsgIdr");
	ИменаУзлов.Вставить("ДатаОтчета", "AppHdr.CreDt");
	
	ИдентификаторКодаОтчета = ЗначениеУзлаПоПолномуПути(ПрочитанныйОбъект, ИменаУзлов.ИдентификаторКодаОтчета);
	ИмяОсновногоУзла = ИмяОсновногоУзлаПоКодуОтчета(ИдентификаторКодаОтчета);
	ФормаОтчета = ЗначениеУзлаПоПолномуПути(ПрочитанныйОбъект, ИменаУзлов.ФормаОтчета);
	
	ШаблонТипОтчета = "Document.%1.SplmtryData.Envlp.XtnsnDt.TxPrcrDtls.PrcrTxDtls.PrcrTxCd";
	ШаблонДатаИсполненияВДепозитарииМХ = "Document.%1.SplmtryData.Envlp.XtnsnDt.TxPrcrDtls.PrcrTxDtls.OprExctnDt.Dt";
	ШаблонРегистрационныйНомер = "Document.%1.SplmtryData.Envlp.XtnsnDt.TxPrcrDtls.TxId.AcctSvcrTxId";
	ШаблонДатаРегистрации = "Document.%1.SplmtryData.Envlp.XtnsnDt.TxPrcrDtls.TxDt.RegnDtTm.Dt";
	ШаблонНомерПоручения = "Document.%1.SplmtryData.Envlp.XtnsnDt.TxPrcrDtls.TxId.AcctOwnrTxId";
	ШаблонДатаПоручения = "Document.%1.SplmtryData.Envlp.XtnsnDt.TxPrcrDtls.TxDt.InstrCreDt.Dt";
	ШаблонКодКонтрагентаНРД = "Document.%1.SplmtryData.Envlp.XtnsnDt.TxPrcrDtls.Orgtr.Id.OrgId.Othr.Id";
	ШаблонНаименованиеКонтрагентаНРД = "Document.%1.SplmtryData.Envlp.XtnsnDt.TxPrcrDtls.Orgtr.Nm";
	ШаблонРазделМХЗачисления = "Document.%1.RcvgSttlmPties.Pty1.SfkpgAcct.Id";
	ШаблонРазделМХСписания = "Document.%1.QtyAndAcctDtls.SfkpgAcct.Id";
	ШаблонРазделМХБлокировка = "Document.%1.SplmtryData.Envlp.XtnsnDt.Xtnsn%2.PrBlckSc.ScTpPrBlck";
	ШаблонДатаИсполненияВМестеРасчетов = "Document.%1.TradDtls.FctvSttlmDt.Dt.Dt";
	ШаблонСообщениеОтНРД = "Document.%1.Ntfctns.NtfctnTxt";
	ШаблонКоличествоВНРД1 = "Document.%1.QtyAndAcctDtls.SttldQty.Qty.Unit";
	ШаблонКоличествоВНРД2 = "Document.%1.SplmtryData.Envlp.XtnsnDt.Xtnsn%2.FinInstrmId.RprtdSttlmQty";
	ШаблонПричинаОтменыПоУмолчанию = "Document.%1.SplmtryData.Envlp.XtnsnDt.Xtnsn%2.RjctdRsn.RsnInf";
	ШаблонПричинаОтмены024 = "Document.%1.PrcgSts.Rjctd.Rsn.AddtlRsnInf";
	ШаблонПричинаОтмены034 = "Document.%1.InstrPrcgSts.Rjctd.Rsn.AddtlRsnInf";
	ШаблонПроводкиПоОперациям = "Document.%1.SctiesSttlmTxDtls";
	ШаблонКодыЦБвНРД = "Document.%1.FinInstrmId.OthrId";
	ШаблонКодЦБвНРД = "Document.%1.FinInstrmId.OthrId.Id";
	ШаблонПричинаПриостановкиПоУмолчанию = "Document.%1.SplmtryData.Envlp.XtnsnDt.Xtnsn%2.AddtlRsnInf";
	ШаблонПричинаПриостановки = "Document.%1.SttlmSts.Pdg.Rsn.AddtlRsnInf";
	
	ИменаУзлов.Вставить("ИмяОсновногоУзла", ИмяОсновногоУзла);
	ИменаУзлов.Вставить("ТипОтчета", СтрШаблон(ШаблонТипОтчета, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("ДатаИсполненияВДепозитарииМХ", СтрШаблон(ШаблонДатаИсполненияВДепозитарииМХ, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("РегистрационныйНомер", СтрШаблон(ШаблонРегистрационныйНомер, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("ДатаРегистрации", СтрШаблон(ШаблонДатаРегистрации, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("НомерПоручения", СтрШаблон(ШаблонНомерПоручения, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("ДатаПоручения", СтрШаблон(ШаблонДатаПоручения, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("КодКонтрагентаНРД", СтрШаблон(ШаблонКодКонтрагентаНРД, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("НаименованиеКонтрагентаНРД", СтрШаблон(ШаблонНаименованиеКонтрагентаНРД, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("РазделМХЗачисления", СтрШаблон(ШаблонРазделМХЗачисления, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("РазделМХСписания", СтрШаблон(ШаблонРазделМХСписания, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("РазделМХБлокировка", СтрШаблон(ШаблонРазделМХБлокировка, ИмяОсновногоУзла, ФормаОтчета));
	ИменаУзлов.Вставить("ДатаИсполненияВМестеРасчетов", СтрШаблон(ШаблонДатаИсполненияВМестеРасчетов, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("СообщениеОтНРД", СтрШаблон(ШаблонСообщениеОтНРД, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("КоличествоВНРД1", СтрШаблон(ШаблонКоличествоВНРД1, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("КоличествоВНРД2", СтрШаблон(ШаблонКоличествоВНРД2, ИмяОсновногоУзла, ФормаОтчета));
	ИменаУзлов.Вставить("КоличествоВНРД", "");
	ИменаУзлов.Вставить("КоличествоИсполненноеВНРД", "");
	ИменаУзлов.Вставить("ПричинаОтменыПоУмолчанию", СтрШаблон(ШаблонПричинаОтменыПоУмолчанию, ИмяОсновногоУзла, ФормаОтчета));
	ИменаУзлов.Вставить("ПричинаОтмены024", СтрШаблон(ШаблонПричинаОтмены024, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("ПричинаОтмены034", СтрШаблон(ШаблонПричинаОтмены034, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("ПричинаОтмены", "");
	ИменаУзлов.Вставить("ПроводкиПоОперациям", СтрШаблон(ШаблонПроводкиПоОперациям, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("КодыЦБвНРД", СтрШаблон(ШаблонКодыЦБвНРД, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("КодЦБвНРД", СтрШаблон(ШаблонКодЦБвНРД, ИмяОсновногоУзла));
	ИменаУзлов.Вставить("БлокировкаКоличествоЦБ", "");
	ИменаУзлов.Вставить("ПричинаПриостановкиПоУмолчанию", СтрШаблон(ШаблонПричинаПриостановкиПоУмолчанию, ИмяОсновногоУзла, ФормаОтчета));
	ИменаУзлов.Вставить("ПричинаПриостановки", СтрШаблон(ШаблонПричинаПриостановки, ИмяОсновногоУзла));
	Возврат ИменаУзлов;
КонецФункции

Функция ДанныеФайловОтчетаПоПоручениюXML(КаталогФайлов)
	ДанныеФайлов = НовыеДанныеФайлов();
	
	МассивФайлов = НайтиФайлы(КаталогФайлов, "*.xml", Истина);
	ДанныеФайлов.НайденоФайлов = МассивФайлов.Количество();
	Если ДанныеФайлов.НайденоФайлов = 0 Тогда
		Возврат ДанныеФайлов;
	КонецЕсли;
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(МассивФайлов[0].ПолноеИмя);
	ПрочитанныйОбъект = ФабрикаXDTO.ПрочитатьXML(Чтение);
	Чтение.Закрыть();
	
	ИменаУзлов = ИменаУзловXML(ПрочитанныйОбъект);
	ИдентификаторКодаОтчета = ЗначениеУзлаПоПолномуПути(ПрочитанныйОбъект, ИменаУзлов.ИдентификаторКодаОтчета);
	ФормаОтчета = ЗначениеУзлаПоПолномуПути(ПрочитанныйОбъект, ИменаУзлов.ФормаОтчета);
	ДанныеФайлов.ФормаОтчета = ФормаОтчета;
	ДанныеФайлов.ИдентификаторКодаОтчета = ИдентификаторКодаОтчета;
	
	Если Не ЗначениеЗаполнено(ИменаУзлов.ИмяОсновногоУзла) Тогда
		ДанныеФайлов.ОбрабатыватьФайл = Ложь;
		Возврат ДанныеФайлов;
	КонецЕсли;
	
	SplmtryData = SplmtryData(ПрочитанныйОбъект, ИменаУзлов, ФормаОтчета);
	
	ИмяУзлаТипОтчета = ПолноеИмяУзлаСправаОтSplmtryData(ИменаУзлов.ТипОтчета);
	ИмяУзлаДатаИсполненияВДепозитарииМХ = ПолноеИмяУзлаСправаОтSplmtryData(ИменаУзлов.ДатаИсполненияВДепозитарииМХ);
	ИмяУзлаРегистрационныйНомер = ПолноеИмяУзлаСправаОтSplmtryData(ИменаУзлов.РегистрационныйНомер);
	ИмяУзлаДатаРегистрации = ПолноеИмяУзлаСправаОтSplmtryData(ИменаУзлов.ДатаРегистрации);
	ИмяУзлаНомерПоручения = ПолноеИмяУзлаСправаОтSplmtryData(ИменаУзлов.НомерПоручения);
	ИмяУзлаДатаПоручения = ПолноеИмяУзлаСправаОтSplmtryData(ИменаУзлов.ДатаПоручения);
	ИмяУзлаКодКонтрагентаНРД = ПолноеИмяУзлаСправаОтSplmtryData(ИменаУзлов.КодКонтрагентаНРД);
	ИмяУзлаНаименованиеКонтрагентаНРД = ПолноеИмяУзлаСправаОтSplmtryData(ИменаУзлов.НаименованиеКонтрагентаНРД);
	
	ДанныеФайлов.ТипОтчета = ЗначениеУзлаПоПолномуПути(SplmtryData.ОбщиеДанные, ИмяУзлаТипОтчета);
	ДанныеФайлов.НомерОтчета = ЗначениеУзлаПоПолномуПути(ПрочитанныйОбъект, ИменаУзлов.НомерОтчета);
	ДатаОтчетаСтрока = ЗначениеУзлаПоПолномуПути(ПрочитанныйОбъект, ИменаУзлов.ДатаОтчета);
	ДатаОтчета = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаОтчетаСтрока);
	ДанныеФайлов.ДатаОтчета = ДатаОтчета + СмещениеСтандартногоВремени(ЧасовойПояс());
	ДатаИсполненияВДепозитарииМХСтрока = ЗначениеУзлаПоПолномуПути(SplmtryData.ОбщиеДанные, ИмяУзлаДатаИсполненияВДепозитарииМХ);
	ДанныеФайлов.ДатаИсполненияВДепозитарииМХ =
		СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаИсполненияВДепозитарииМХСтрока);
	ДанныеФайлов.ИдентификаторОтчета = ДанныеФайлов.НомерОтчета;
	ДанныеФайлов.РегистрационныйНомер = ЗначениеУзлаПоПолномуПути(SplmtryData.ОбщиеДанные, ИмяУзлаРегистрационныйНомер);
	ДатаРегистрацииСтрока = ЗначениеУзлаПоПолномуПути(SplmtryData.ОбщиеДанные, ИмяУзлаДатаРегистрации);
	ДанныеФайлов.ДатаРегистрации = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаРегистрацииСтрока);
	ДанныеФайлов.НомерПоручения = ЗначениеУзлаПоПолномуПути(SplmtryData.ОбщиеДанные, ИмяУзлаНомерПоручения);
	ДатаПорученияСтрока = ЗначениеУзлаПоПолномуПути(SplmtryData.ОбщиеДанные, ИмяУзлаДатаПоручения);
	ДанныеФайлов.ДатаПоручения = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаПорученияСтрока);
	ДанныеФайлов.КодКонтрагентаНРД = ЗначениеУзлаПоПолномуПути(SplmtryData.ОбщиеДанные, ИмяУзлаКодКонтрагентаНРД);
	ДанныеФайлов.НаименованиеКонтрагентаНРД = ЗначениеУзлаПоПолномуПути(SplmtryData.ОбщиеДанные, ИмяУзлаНаименованиеКонтрагентаНРД);
	
	Если ФормаОтчета = "MS101" Тогда
		ДанныеФайлов.ДанныеПоВсемЦБ = ДанныеПоВсемЦБ_XML(ПрочитанныйОбъект, ИменаУзлов);
	КонецЕсли;
	
	MS036 = "MS036";
	Если ФормаОтчета = "MS035" Или ФормаОтчета = MS036 Тогда
		ДанныеФайлов.КоличествоИсполненноеВНРД = КоличествоВНРД_XML(ПрочитанныйОбъект, ИменаУзлов, ФормаОтчета);
		ИменаУзлов.КоличествоИсполненноеВНРД = ИменаУзлов.КоличествоВНРД;
	КонецЕсли;
	
	Если ФормаОтчета = "MS020" Тогда
		ДанныеФайлов.РазделМХЗачисления = НайденныйИдентификаторРаздела(ПрочитанныйОбъект, ИменаУзлов.РазделМХЗачисления);
		ДанныеФайлов.РазделМХСписания = НайденныйИдентификаторРаздела(ПрочитанныйОбъект, ИменаУзлов.РазделМХСписания);
	КонецЕсли;
	
	Если ФормаОтчета = "MS035" Тогда
		ДанныеПоКодамЦБ = МассивОбъектовXDTO(ЗначениеУзлаПоПолномуПути(ПрочитанныйОбъект, ИменаУзлов.КодыЦБвНРД));
		ДанныеФайлов.КодЦБвНРД = КодВНРД(ДанныеПоКодамЦБ);
	КонецЕсли;
	
	Если ФормаОтчета = MS036 Тогда
		ИмяУзлаРазделМХБлокировка = ПолноеИмяУзлаСправаОтSplmtryData(ИменаУзлов.РазделМХБлокировка);
		ДанныеФайлов.РазделМХБлокировка = ЗначениеУзлаПоПолномуПути(SplmtryData.Расширение, ИмяУзлаРазделМХБлокировка);
		ДанныеФайлов.РазделМХСписания = НайденныйИдентификаторРаздела(ПрочитанныйОбъект, ИменаУзлов.РазделМХСписания);
		ДатаИсполненияВМестеРасчетовСтрока = ЗначениеУзлаПоПолномуПути(ПрочитанныйОбъект, ИменаУзлов.ДатаИсполненияВМестеРасчетов);
		ДанныеФайлов.ДатаИсполненияВМестеРасчетов =
			СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаИсполненияВМестеРасчетовСтрока);
	КонецЕсли;
	
	ЗаполнитьБлокировкаКоличествоЦБ =
		ФормаОтчета = "MS010" Или ФормаОтчета = "MS020" Или ФормаОтчета = MS036;
	Если ЗаполнитьБлокировкаКоличествоЦБ Тогда
		ДанныеФайлов.БлокировкаКоличествоЦБ = КоличествоВНРД_XML(ПрочитанныйОбъект, ИменаУзлов, ФормаОтчета);
		ИменаУзлов.БлокировкаКоличествоЦБ = ИменаУзлов.КоличествоВНРД;
	КонецЕсли;
	
	Если ФормаОтчета = "GS001" Тогда
		ПричинаОтмены = ПричинаОтменыXML(ПрочитанныйОбъект, ИдентификаторКодаОтчета, ИменаУзлов, ФормаОтчета);
		ДанныеФайлов.ТребуетсяСоздатьПоручениеНаОтмену = ТребуетсяСоздатьПоручениеНаОтменуXML(ПричинаОтмены);
		ДанныеФайлов.ПричинаОтмены = ПричинаОтмены;
	КонецЕсли;
	
	Если ФормаОтчета = "GS036" Тогда
		ДанныеФайлов.СообщениеОтНРД = ПервоеЗначениеУзлаПоПолномуПутиСоСписками(ПрочитанныйОбъект, ИменаУзлов.СообщениеОтНРД);
	КонецЕсли;
	
	Если ФормаОтчета = "GS101" Тогда
		ДанныеФайлов.ПричинаПриостановки = ПричинаОтказаПоИмениУзла(ПрочитанныйОбъект, ИменаУзлов, ФормаОтчета,
			"ПричинаПриостановки", "ПричинаПриостановкиПоУмолчанию");
	КонецЕсли;
	
	ЗаполнитьТаблицуВсеФайлыПоФайлуXML(ДанныеФайлов, ИменаУзлов, МассивФайлов[0].Имя);
	
	Возврат ДанныеФайлов;
КонецФункции

Функция ЗначениеУзлаПоПолномуПути(ПрочитанныйОбъект, ПолныйПутьУзла)
	Попытка
		Возврат Вычислить("ПрочитанныйОбъект." + ПолныйПутьУзла);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция ПервоеЗначениеУзлаПоПолномуПутиСоСписками(ПрочитанныйОбъект, ПолноеИмяУзла)
	ИменаУзлов = СтрРазделить(ПолноеИмяУзла, ".");
	Значение = ПрочитанныйОбъект;
	Для Каждого ТекущееИмяУзла Из ИменаУзлов Цикл
		Значение = ЗначениеУзлаПоПолномуПути(Значение, ТекущееИмяУзла);
		Если Значение = Неопределено Тогда
			Прервать;
		КонецЕсли;
		Если ТипЗнч(Значение) = Тип("СписокXDTO") Тогда
			Значение = Значение[0];
		КонецЕсли;
	КонецЦикла;
	Возврат Значение;
КонецФункции

Функция МассивОбъектовXDTO(XDTO)
	МассивОбъектов = Новый Массив;
	Если ТипЗнч(XDTO) = Тип("СписокXDTO") Тогда
		Для Каждого ЭлементСписка Из XDTO Цикл
			МассивОбъектов.Добавить(ЭлементСписка);
		КонецЦикла;
	Иначе
		МассивОбъектов.Добавить(XDTO);
	КонецЕсли;
	Возврат МассивОбъектов;
КонецФункции

Функция SplmtryData(ПрочитанныйОбъект, ИменаУзлов, ФормаОтчета)
	SplmtryData = Новый Структура("ОбщиеДанные, Расширение");
	УзелSplmtryData = ПрочитанныйОбъект.Document[ИменаУзлов.ИмяОсновногоУзла].SplmtryData;
	Массив = МассивОбъектовXDTO(УзелSplmtryData);
	Для Каждого Элемент Из Массив Цикл
		Если ЗначениеУзлаПоПолномуПути(Элемент, "Envlp.XtnsnDt.TxPrcrDtls") <> Неопределено Тогда
			SplmtryData.ОбщиеДанные = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Для Каждого Элемент Из Массив Цикл
		ИмяУзлаРасширение = СтрШаблон("Envlp.XtnsnDt.Xtnsn%1", ФормаОтчета);
		Если ЗначениеУзлаПоПолномуПути(Элемент, ИмяУзлаРасширение) <> Неопределено Тогда
			SplmtryData.Расширение = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат SplmtryData;
КонецФункции

Функция ПолноеИмяУзлаСправаОтSplmtryData(ПолныйПутьУзла)
	Результат = "";
	МассивИменУзлов = СтрРазделить(ПолныйПутьУзла, ".");
	ИндексSplmtryData = МассивИменУзлов.Найти("SplmtryData");
	Если ИндексSplmtryData <> Неопределено Тогда
		МассивИменУзловСправаОтSplmtryData = Новый Массив;
		Для Индекс = ИндексSplmtryData + 1 По МассивИменУзлов.ВГраница() Цикл
			МассивИменУзловСправаОтSplmtryData.Добавить(МассивИменУзлов[Индекс]);
		КонецЦикла;
		Результат = СтрСоединить(МассивИменУзловСправаОтSplmtryData, ".");
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьТаблицуВсеФайлыПоФайлуXML(ДанныеФайлов, ИменаУзлов, ИмяФайла)
	ВсеФайлы = Новый ТаблицаЗначений;
	ВсеФайлы.Колонки.Добавить("Элемент");
	ВсеФайлы.Колонки.Добавить("Значение");
	ВсеФайлы.Колонки.Добавить("ИмяФайла");
	Для Каждого Элемент Из ДанныеФайлов Цикл
		Если Не ИменаУзлов.Свойство(Элемент.Ключ) Или Не ЗначениеЗаполнено(Элемент.Значение) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ВсеФайлы.Добавить();
		НоваяСтрока.Элемент = ИменаУзлов[Элемент.Ключ];
		НоваяСтрока.Значение = Элемент.Значение;
		НоваяСтрока.ИмяФайла = ИмяФайла;
	КонецЦикла;
	Если ЗначениеЗаполнено(ДанныеФайлов.ДанныеПоВсемЦБ) Тогда
		ЗаполнитьТаблицуВсеФайлыДаннымиПоВсемЦБ(ВсеФайлы, ДанныеФайлов.ДанныеПоВсемЦБ, ИмяФайла);
	КонецЕсли;
	ВсеФайлы.Свернуть("Элемент, Значение, ИмяФайла");
	ВсеФайлы.Сортировать("Элемент");
	ДанныеФайлов.ВсеФайлы = ВсеФайлы;
КонецПроцедуры

Процедура ЗаполнитьТаблицуВсеФайлыДаннымиПоВсемЦБ(ВсеФайлы, ДанныеПоВсемЦБ, ИмяФайла)
	ШаблонКодВНРД = "Document.MS101.SctiesSttlmTxDtls.AcctSctiesSttlmTxDtls.SctnSctiesSttlmTxDtls[%1].FinInstrmId.OthrId.Id";
	ШаблонКодРаздела = "Document.MS101.SctiesSttlmTxDtls.AcctSctiesSttlmTxDtls.SctnSctiesSttlmTxDtls[%1].Sctn.Id";
	ШаблонКоличество = "Document.MS101.SctiesSttlmTxDtls.AcctSctiesSttlmTxDtls.SctnSctiesSttlmTxDtls[%1].SttldQty.Qty.Unit";
	ШаблонНаправлениеДвижения = "Document.MS101.SctiesSttlmTxDtls.AcctSctiesSttlmTxDtls.SctnSctiesSttlmTxDtls[%1].SctiesMvmntTp";
	КоличествоДанныхПоВсемЦБ = ДанныеПоВсемЦБ.Количество();
	Для Индекс = 0 По КоличествоДанныхПоВсемЦБ - 1 Цикл
		ДанныеПоЦБ = ДанныеПоВсемЦБ[Индекс];
		ИндексСтрокой = Формат(Индекс , "ЧН=0; ЧГ=");
		ИменаУзловДанныеПоВсемЦБ = Новый Структура;
		ИменаУзловДанныеПоВсемЦБ.Вставить("КодВНРД", СтрШаблон(ШаблонКодВНРД, ИндексСтрокой));
		ИменаУзловДанныеПоВсемЦБ.Вставить("КодРаздела", СтрШаблон(ШаблонКодРаздела, ИндексСтрокой));
		ИменаУзловДанныеПоВсемЦБ.Вставить("Количество", СтрШаблон(ШаблонКоличество, ИндексСтрокой));
		ИменаУзловДанныеПоВсемЦБ.Вставить("НаправлениеДвижения", СтрШаблон(ШаблонНаправлениеДвижения, ИндексСтрокой));
		Для Каждого Элемент Из ДанныеПоЦБ Цикл
			НоваяСтрока = ВсеФайлы.Добавить();
			НоваяСтрока.Элемент = ИменаУзловДанныеПоВсемЦБ[Элемент.Ключ];
			НоваяСтрока.Значение = ДанныеПоЦБ[Элемент.Ключ];
			НоваяСтрока.ИмяФайла = ИмяФайла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция ИмяОсновногоУзлаПоКодуОтчета(ИдентификаторКодаОтчета)
	ОсновныеУзлы = Новый Соответствие;
	ОсновныеУзлы.Вставить("seev.034.001.11", "CorpActnInstrStsAdvc");
	ОсновныеУзлы.Вставить("sese.024.001.10", "SctiesSttlmTxStsAdvc");
	ОсновныеУзлы.Вставить("rprt.gs036.001.01", "GS036");
	ОсновныеУзлы.Вставить("gs036.001.01", "GS036");
	ОсновныеУзлы.Вставить("sese.027.001.06", "SctiesTxCxlReqStsAdvc");
	ОсновныеУзлы.Вставить("sese.025.001.10", "SctiesSttlmTxConf");
	ОсновныеУзлы.Вставить("ms101.001.01", "MS101");
	ОсновныеУзлы.Вставить("gs116.001.01", "SctiesTxPdgAllgmtRpt");
	ОсновныеУзлы.Вставить("ms007.001.01", "SctiesTxPdgRpt");
	ОсновныеУзлы.Вставить("ms009.001.01", "MS009");
	ОсновныеУзлы.Вставить("ms140.001.01", "MS140");
	Возврат ОсновныеУзлы[ИдентификаторКодаОтчета];
КонецФункции

Функция КоличествоВНРД_XML(ПрочитанныйОбъект, ИменаУзлов, ФормаОтчета)
	КоличествоВНРД = ЗначениеУзлаПоПолномуПути(ПрочитанныйОбъект, ИменаУзлов.КоличествоВНРД1);
	Если КоличествоВНРД = "-00.00" Тогда
		ИмяУзлаКоличествоВНРД2 = ПолноеИмяУзлаСправаОтSplmtryData(ИменаУзлов.КоличествоВНРД2);
		SplmtryData = SplmtryData(ПрочитанныйОбъект, ИменаУзлов, ФормаОтчета);
		КоличествоВНРД = ЗначениеУзлаПоПолномуПути(SplmtryData.Расширение, ИмяУзлаКоличествоВНРД2);
		ИменаУзлов.КоличествоВНРД = ИменаУзлов.КоличествоВНРД2;
	Иначе
		ИменаУзлов.КоличествоВНРД = ИменаУзлов.КоличествоВНРД1;
	КонецЕсли;
	Возврат СтроковыеФункцииКлиентСервер.ЧислоИзСтроки(КоличествоВНРД);
КонецФункции

Функция ТребуетсяСоздатьПоручениеНаОтменуXML(ПричинаОтмены)
	Если Лев(ПричинаОтмены, 32) = "Истек срок исполнения поручения." Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ПричинаОтменыXML(ПрочитанныйОбъект, ИдентификаторКодаОтчета, ИменаУзлов, ФормаОтчета)
	Если НРег(ИдентификаторКодаОтчета) = "sese.024.001.10" Тогда
		ИменаУзлов.ПричинаОтмены = ИменаУзлов.ПричинаОтмены024;
	КонецЕсли;
	Если НРег(ИдентификаторКодаОтчета) = "seev.034.001.11" Тогда
		ИменаУзлов.ПричинаОтмены = ИменаУзлов.ПричинаОтмены034;
	КонецЕсли;
	ПричинаОтмены = ПричинаОтказаПоИмениУзла(ПрочитанныйОбъект, ИменаУзлов, ФормаОтчета, "ПричинаОтмены", "ПричинаОтменыПоУмолчанию");
	Возврат ПричинаОтмены;
КонецФункции

Функция ПричинаОтказаПоИмениУзла(ПрочитанныйОбъект, ИменаУзлов, ФормаОтчета, ОсновнаяПричинаОтказа, ПричинаОтказаПоУмолчанию)
	ПричинаОтказа = ПервоеЗначениеУзлаПоПолномуПутиСоСписками(ПрочитанныйОбъект, ИменаУзлов[ОсновнаяПричинаОтказа]);
	Если ПричинаОтказа = Неопределено Или ТипЗнч(ПричинаОтказа) = Тип("ОбъектXDTO") Тогда
		ИмяУзлаПричинаПоУмолчанию = ПолноеИмяУзлаСправаОтSplmtryData(ИменаУзлов[ПричинаОтказаПоУмолчанию]);
		SplmtryData = SplmtryData(ПрочитанныйОбъект, ИменаУзлов, ФормаОтчета);
		ПричинаОтказа = ПервоеЗначениеУзлаПоПолномуПутиСоСписками(SplmtryData.Расширение, ИмяУзлаПричинаПоУмолчанию);
		ИменаУзлов[ОсновнаяПричинаОтказа] = ИменаУзлов[ПричинаОтказаПоУмолчанию];
	КонецЕсли;
	Возврат ПричинаОтказа;
КонецФункции

Функция НайденныйИдентификаторРаздела(ПрочитанныйОбъект, ИмяУзлаРазделаМХ)
	ИдентификаторРазделаПолный = ЗначениеУзлаПоПолномуПути(ПрочитанныйОбъект, ИмяУзлаРазделаМХ);
	ПоследняяПозиция = СтрНайти(ИдентификаторРазделаПолный, "/", НаправлениеПоиска.СКонца);
	ИдентификаторРаздела = Сред(ИдентификаторРазделаПолный, ПоследняяПозиция + 1);
	Возврат ИдентификаторРаздела;
КонецФункции

Функция ДанныеПоВсемЦБ_XML(ПрочитанныйОбъект, ИменаУзлов)
	ДанныеПоВсемЦБ = Новый Массив;
	ПроводкиПоОперациям = ЗначениеУзлаПоПолномуПути(ПрочитанныйОбъект, ИменаУзлов.ПроводкиПоОперациям);
	ПроводкиПоОперациям = МассивОбъектовXDTO(ПроводкиПоОперациям);
	Для Каждого ПроводкаПоОперации Из ПроводкиПоОперациям Цикл
		ПроводкиПоСчетамДепо = МассивОбъектовXDTO(ПроводкаПоОперации.AcctSctiesSttlmTxDtls);
		Для Каждого ПроводкаПоСчетуДепо Из ПроводкиПоСчетамДепо Цикл
			ПроводкиПоРазделамСчетаДепо = МассивОбъектовXDTO(ПроводкаПоСчетуДепо.SctnSctiesSttlmTxDtls);
			Для Каждого ПроводкаПоРазделуСчетаДепо Из ПроводкиПоРазделамСчетаДепо Цикл
				ДанныеПоЦБ = Новый Структура("КодВНРД, КодРаздела, Количество");
				ДанныеПоКодамЦБ = МассивОбъектовXDTO(ПроводкаПоРазделуСчетаДепо.FinInstrmId.OthrId);
				ДанныеПоЦБ.КодВНРД = КодВНРД(ДанныеПоКодамЦБ);
				ДанныеПоЦБ.КодРаздела = ПроводкаПоРазделуСчетаДепо.Sctn.Id;
				НаправлениеДвижения = ПроводкаПоРазделуСчетаДепо.SctiesMvmntTp;
				Знак = ?(НаправлениеДвижения = "DELI", "-", "");
				ДанныеПоЦБ.Количество = Знак + ПроводкаПоРазделуСчетаДепо.SttldQty.Qty.Unit;
				ДанныеПоВсемЦБ.Добавить(ДанныеПоЦБ);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	Возврат ДанныеПоВсемЦБ;
КонецФункции

Функция КодВНРД(ДанныеПоКодамЦБ)
	КодВНРД = "";
	Для Каждого ДанныеПоКодуЦБ Из ДанныеПоКодамЦБ Цикл
		Если ДанныеПоКодуЦБ.Tp.Prtry = "NSDR" Тогда
			КодВНРД = ДанныеПоКодуЦБ.Id;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат КодВНРД;
КонецФункции

//////////////////////////////////////////////////////////////////////////
Процедура ВыгрузитьПоручениеПовторно(ДокументОснования)
	
	Обработка = Обработки.ЭкспортПорученийВЛуч.Создать();
	Обработка.ДатаВыгрузки = ДокументОснования.Дата;
	Обработка.ЗаполнитьПоручения(ДокументОснования);
	Результат = Обработка.РезультатВыгрузкиПоручений();
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗаписьЖурналаРегистрации("Не удалась повторная выгрузка "+ДокументОснования,
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		Результат.СообщениеВЖурнал);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьФлажокОбработан(ВходящийПакет, Обработан)
	
	ВходящийПакетОбъект = ВходящийПакет.ПолучитьОбъект();
	ВходящийПакетОбъект.Обработан = Обработан;
	ВходящийПакетОбъект.Записать();
	
КонецПроцедуры

Функция ОстаткиПоЦБ(Дата, ЦБ, СчетДепоМХ, РазделСчетаДепоМХ)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБОстатки.ЦБ КАК ЦеннаяБумага,
	|	ОстаткиЦБОстатки.КоличествоОстаток КАК Количество,
	|	ОстаткиЦБОстатки.СчетДепоМХ,
	|	ОстаткиЦБОстатки.РазделСчетаДепоМХ
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&Период,
	|			ЦБ = &ЦеннаяБумага
	|				И СчетДепоМХ = &СчетДепоМХ
	|				И РазделСчетаДепоМХ = &РазделСчетаДепоМХ) КАК ОстаткиЦБОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиЦБОстатки.СчетДепо.Владелец.Наименование,
	|	ОстаткиЦБОстатки.СчетДепо,
	|	ОстаткиЦБОстатки.РазделСчетаДепо");
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦБ);
	Запрос.УстановитьПараметр("СчетДепоМХ", СчетДепоМХ);
	Запрос.УстановитьПараметр("РазделСчетаДепоМХ", РазделСчетаДепоМХ);
	
	Результат = Запрос.Выполнить();
	//Если Результат.Пустой() Тогда
	//	Возврат;
	//КонецЕсли;
	
	Возврат Результат.Выгрузить();
КонецФункции // ()
 
Функция СформироватьИсходящийПакетВФайловыйШлюз(Номер, Дата, ТипОперации, КодОперации, ДокументОснование, ТекстСообщения,
	НомерТехническойОперации = Неопределено) Экспорт
	
	РасширениеXML = ".xml";
	
	ВнешнийИсточникФайловыйШлюзКаталогКОтправке = ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзКаталогКОтправке;
	Ошибка = ВнешниеДанные.НовоеОписаниеОшибкиДляРегистрацииИОповещения();
	ПутьДляВыгрузки = ВнешниеДанные.ПутьКВнешнемуИсточникуКаталогу(ВнешнийИсточникФайловыйШлюзКаталогКОтправке, Ошибка);
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	НовыйПорядковыйНомер = Документы.ТехническаяОперация.НовыйПорядковыйНомерВТечениеДня(ТекущаяДата);
	Если НовыйПорядковыйНомер = 0 Тогда
		Ошибка.СообщениеВЖурнал = "Не удалось получить новый порядковый номер за " + Формат(ТекущаяДата, "ДЛФ=Д");
		Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал;
		Возврат Ошибка;
	КонецЕсли;
	
	ЭтоТранзит = Документы.РаскрытиеСпискаВладельцев.ЭтоТранзитЧерезСЭДНРД(ДокументОснование);
	Если ЭтоТранзит Тогда
		Префикс = "W";
	Иначе
		Префикс = "K";
	КонецЕсли;
	
	НомерДня = Формат(ТекущаяДата, "ДФ=dd");
	НомерМесяца = СтроковыеФункцииКлиентСервер.МесяцВШестнадцатеричнойСистеме(Месяц(ТекущаяДата));
	
	ИмяФайлаXML = Префикс + НомерДня + НомерМесяца + Формат(НовыйПорядковыйНомер, "ЧЦ=4; ЧВН=; ЧГ=0");
	ИмяКаталогДляФайла = ПутьДляВыгрузки + "\" + ИмяФайлаXML;
	
	КаталогДляФайла = Новый Файл(ИмяКаталогДляФайла);
	Пока КаталогДляФайла.Существует() Цикл
		НовыйПорядковыйНомер = НовыйПорядковыйНомер + 1;
		ИмяФайлаXML = Префикс + НомерДня + НомерМесяца + Формат(НовыйПорядковыйНомер, "ЧЦ=4; ЧВН=; ЧГ=0");
		
		ИмяКаталогДляФайла = ПутьДляВыгрузки + "\" + ИмяФайлаXML;
		КаталогДляФайла = Новый Файл(ИмяКаталогДляФайла);
	КонецЦикла; 
	СоздатьКаталог(ИмяКаталогДляФайла);
	
	ПолноеИмяФайлаXML = ИмяКаталогДляФайла + "\" + ИмяФайлаXML + РасширениеXML;

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(РасширениеXML);
	
	ЗаписьXML = Новый ЗаписьXML;
	Попытка
		ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла, "windows-1251");
	Исключение
		Ошибка.СообщениеВЖурнал = "Не удалось открыть файл " + ИмяФайлаXML + РасширениеXML;
		Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал;
		Возврат Ошибка;
	КонецПопытки;	
	
	НоваяТехническаяОперация = Документы.ТехническаяОперация.СоздатьДокумент();
	НоваяТехническаяОперация.Дата = ТекущаяДатаСеанса();
	НоваяТехническаяОперация.НомерДокументаОснования = СокрЛП(Номер);
	НоваяТехническаяОперация.ДатаДокументаОснования = Дата;
	НоваяТехническаяОперация.ТипОперации = ТипОперации;
	НоваяТехническаяОперация.КодОперации = КодОперации;
	НоваяТехническаяОперация.ДокументОснование = ДокументОснование;
	НоваяТехническаяОперация.ПорядковыйНомерВнутриДня = НовыйПорядковыйНомер;
	НоваяТехническаяОперация.УстановитьНовыйНомер();
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Поручение") И Документы.Поручение.ЭтоМультиПоручениеП35_2(ДокументОснование) Тогда
		НоваяТехническаяОперация.Комментарий = ДокументОснование.Комментарий;
	КонецЕсли;
	НоваяТехническаяОперация.Записать(РежимЗаписиДокумента.Проведение);
	НомерТехническойОперации = НоваяТехническаяОперация.Номер;
	
	РегистрыСведений.СостоянияДокументовВФайловомШлюзе.ДобавитьЗапись(ТекущаяДата,
		НоваяТехническаяОперация.Ссылка, Перечисления.СтатусыДокументовФайловыйШлюз.ВыгрузитьФайловыйШлюз);
	
	НовыйИсходящийПакет = Документы.ИсходящийПакетВФайловыйШлюз.СоздатьДокумент();
	НовыйИсходящийПакет.Дата = ТекущаяДатаСеанса();
	НовыйИсходящийПакет.ДокументОснование = НоваяТехническаяОперация.Ссылка;
	НовыйИсходящийПакет.ОтносительныйПуть = ИмяФайлаXML;
	НовыйИсходящийПакет.ПолныйПуть = ИмяКаталогДляФайла;
	НовыйИсходящийПакет.Статус = Перечисления.СтатусыДокументовФайловыйШлюз.ВыгруженоФайловыйШлюз;
	НовыйИсходящийПакет.Комментарий = "Создан автоматически в " + Формат(ТекущаяДата, "ДЛФ=DT");
	НовыйИсходящийПакет.Записать(РежимЗаписиДокумента.Запись);

	РегистрыСведений.СостоянияДокументовВФайловомШлюзе.ДобавитьЗапись(ТекущаяДатаСеанса(),
		НоваяТехническаяОперация.Ссылка, Перечисления.СтатусыДокументовФайловыйШлюз.ВыгруженоФайловыйШлюз, НовыйИсходящийПакет.Ссылка);
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		РегистрыСведений.ДокументыВыгруженныеВЛуч.ДобавитьДокумент(ДокументОснование,
			ТекущаяДата, НомерТехническойОперации, "", ПараметрыСеанса.ТекущийПользователь);
	КонецЕсли;
	
	ТекстСообщения = ТекстСообщенияXML(Ложь, ТекстСообщения, Номер, ДокументОснование, НоваяТехническаяОперация.Ссылка, "", "");
	
	ЗаписьXML.ЗаписатьБезОбработки(ТекстСообщения);
	ЗаписьXML.Закрыть();
	
	ПереместитьФайл(ИмяВременногоФайла, ПолноеИмяФайлаXML);
	
	Если ЭтоТранзит Тогда
		ПолноеИмяФайлаWINF = ИмяКаталогДляФайла + "\" + "winf" + РасширениеXML;
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(РасширениеXML);
		ЗаписьXML = Новый ЗаписьXML;
		Попытка
			ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла, "windows-1251");
		Исключение
			Ошибка.СообщениеВЖурнал = "Не удалось открыть файл " + ИмяФайлаXML + РасширениеXML;
			Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал;
			Возврат Ошибка;
		КонецПопытки;
		ТекстСообщенияWINF = ТекстСообщенияXML(Истина, "", "",
			ДокументОснование, НоваяТехническаяОперация.Ссылка, ИмяКаталогДляФайла, ИмяФайлаXML);
		ЗаписьXML.ЗаписатьБезОбработки(ТекстСообщенияWINF);
		ЗаписьXML.Закрыть();
		ПереместитьФайл(ИмяВременногоФайла, ПолноеИмяФайлаWINF);
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on
// BSLLS:NestedStatements-on

Функция ВыгрузитьПоСхеме(Поручение) Экспорт
	Ошибка = Новый Структура("СообщениеПользователю,СообщениеВЖурнал,Данные");
	
	МакетОтображения = Поручение.ВидПоручения.НастройкиОтображения.Получить();
	Если МакетОтображения = Неопределено Тогда
		Ошибка.СообщениеВЖурнал = "Не найден шаблон для выгрузки поручения.";
		Ошибка.Данные = Поручение;
		Ошибка.СообщениеПользователю = Строка(Поручение.Ссылка) + ": " + Ошибка.СообщениеВЖурнал;// + " " + ВнешнийИсточникФайловыйШлюзКаталогКОтправке;
		Возврат Ошибка;
	КонецЕсли; 
	
	СквознойИдентификаторВызова = Строка(Новый УникальныйИдентификатор);
	
	ВебСервисПространствоИмен = "http://www.vtbcapital-broker.com/depo/FunctionalElectronicDocuments";
	
	DocumentsRequestType = ФабрикаXDTO.Тип(ВебСервисПространствоИмен, "SendFunctionalElectronicDocumentsRequestType");
	DocumentMessageType  = ФабрикаXDTO.Тип(ВебСервисПространствоИмен, "FunctionalElectronicDocumentMessageType");
	
	DocumentsRequest  = ФабрикаXDTO.Создать(DocumentsRequestType);
	DocumentMessage   = ФабрикаXDTO.Создать(DocumentMessageType);

	//чтение макета
	ТаблицаРеквизитов = Новый ТаблицаЗначений;
	ТаблицаРеквизитов.Колонки.Добавить("ИмяБлока");
	ТаблицаРеквизитов.Колонки.Добавить("ИмяПоля");
	ТаблицаРеквизитов.Колонки.Добавить("ИмяТаблицы");
	ТаблицаРеквизитов.Колонки.Добавить("ИмяСтрокиТаблицы");
	ТаблицаРеквизитов.Колонки.Добавить("ИмяРеквизита");
	ТаблицаРеквизитов.Колонки.Добавить("ФорматнаяСтрока");
	ТаблицаРеквизитов.Колонки.Добавить("ЭтоТаблица");
	ТаблицаРеквизитов.Колонки.Добавить("Обязательное");
	
	НомераКолонок = Новый Соответствие;
	НомераКолонок.Вставить("Значение", 5);
	НомераКолонок.Вставить("Блок", 1);
	НомераКолонок.Вставить("ПолеБлока", 4);
	НомераКолонок.Вставить("Таблица", 2);
	НомераКолонок.Вставить("ПолеТаблицы", 3);
	НомераКолонок.Вставить("Обязательное", 11);
	
	Для НомерСтроки = 2 По МакетОтображения.ВысотаТаблицы Цикл
		ИмяБлока = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["Блок"]).Текст;
		ИмяПоля = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["ПолеБлока"]).Текст;
		ИмяТаблицы = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["Таблица"]).Текст;
		ИмяСтрокиТаблицы = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["ПолеТаблицы"]).Текст;
		ИмяРеквизита = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["Значение"]).Текст;
		ФорматнаяСтрока = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["Значение"]).Формат;
		Обязательное = МакетОтображения.Область("R" + НомерСтроки + "C" + НомераКолонок["Обязательное"]).Текст;
		
		НовСтрока = ТаблицаРеквизитов.Добавить();
		НовСтрока.ИмяБлока = ИмяБлока;
		НовСтрока.ИмяПоля = ИмяПоля;
		НовСтрока.ИмяТаблицы = ИмяТаблицы;
		НовСтрока.ИмяСтрокиТаблицы = ИмяСтрокиТаблицы;
		НовСтрока.ИмяРеквизита = ИмяРеквизита;
		НовСтрока.ФорматнаяСтрока = ФорматнаяСтрока;
		НовСтрока.ЭтоТаблица = ЗначениеЗаполнено(ИмяСтрокиТаблицы);
		НовСтрока.Обязательное = ВРЕГ(Обязательное) = "ДА";

	КонецЦикла;	
	
	СКД = Поручение.ВидПоручения.СхемаКомпоновкиДанных.Получить();
	Если СКД = Неопределено Тогда
		СКД = Справочники.ВидыИнвентарныхПоручений.ПолучитьМакет("РеквизитыПоручения");
	КонецЕсли; 
	
	Для каждого НаборДанных Из СКД.НаборыДанных Цикл
		
		Если Найти(НаборДанных.Имя, "ТЧ_") > 0 Тогда
			ТекстОшибки = ЗаполнитьТаблицуБлока(Поручение, СКД, DocumentMessage, ТаблицаРеквизитов, НаборДанных.Имя);
		Иначе
			ТекстОшибки = ЗаполнитьБлок(Поручение, СКД, DocumentMessage, ТаблицаРеквизитов, НаборДанных.Имя);
		КонецЕсли;	
		
		Если ТекстОшибки <> "" Тогда
			Ошибка.СообщениеВЖурнал = ТекстОшибки;
			Ошибка.Данные = Поручение;
			Ошибка.СообщениеПользователю = Строка(Поручение.Ссылка) + ": " + ТекстОшибки;// + " " + ВнешнийИсточникФайловыйШлюзКаталогКОтправке;
			Возврат Ошибка;	
		КонецЕсли; 
	КонецЦикла; 
	
	//СтруктураВозврата = Новый Структура("ТекстДокумента, Ошибка");
	
	СоответствиеРеквизитовОбъекта = ОбщегоНазначения.ПолучитьСоответствиеРеквизитовОбъектаПоУмолчанию("Обработка.ЭкспортПорученийВЛуч", "Номера версий", , Поручение.Дата);
	НомераВерсий = СоответствиеРеквизитовОбъекта["НомераВерсий"];
	
	Если НомераВерсий <> Неопределено Тогда
		НайденныеСтроки = НомераВерсий.НайтиСтроки(Новый Структура("КодОперации", Поручение.ВидПоручения.Код));
		Если НайденныеСтроки.Количество() = 1 Тогда
			НомерВерсии = СокрЛП(НайденныеСтроки[0].НомерВерсии);
		Иначе
			Ошибка.СообщениеВЖурнал = "Не удалось определить номер версии для кода операции " + Поручение.ВидПоручения.Код;
			Ошибка.Данные = Поручение;
			Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал;// + " " + ВнешнийИсточникФайловыйШлюзКаталогКОтправке;
			Возврат Ошибка;
			//СтруктураВозврата.Ошибка = "Не удалось определить номер версии для кода операции " + Поручение.ВидПоручения.Код;
			//СтруктураВозврата.ТекстДокумента = "";
			//Возврат;
		КонецЕсли;
	Иначе
		Ошибка.СообщениеВЖурнал = "Не найдены номера версий для эскпорта поручений в Луч";
		Ошибка.Данные = Поручение;
		Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал;// + " " + ВнешнийИсточникФайловыйШлюзКаталогКОтправке;
		Возврат Ошибка;
		//СтруктураВозврата.Ошибка = "Не найдены номера версий для эскпорта поручений в Луч";
		//СтруктураВозврата.ТекстДокумента = "";
		//Возврат;
	КонецЕсли; 
	
	//Ошибка = Новый Структура("СообщениеПользователю,СообщениеВЖурнал,Данные");
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку("Windows-1251");
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("Batch");
	ЗаписатьЭлементXML(Запись, "Documents_amount", "1");
	
	Запись.ЗаписатьНачалоЭлемента("Document");
	Запись.ЗаписатьАтрибут("DOC_ID"		, "1");
	Запись.ЗаписатьАтрибут("version"	, НомерВерсии);
	
	ВсеИменаБлоков = Новый Массив;
	ИмяБлокаORDER_HEADER = "ORDER_HEADER";
	МассивФорматов = Новый Структура;
	Для каждого СтрокаРеквизит Из ТаблицаРеквизитов Цикл
		Если СтрокаРеквизит.ФорматнаяСтрока <> "" Тогда
			МассивФорматов.Вставить(СтрокаРеквизит.ИмяПоля, СтрокаРеквизит.ФорматнаяСтрока);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(СтрокаРеквизит.ИмяБлока)
			И ВсеИменаБлоков.Найти(СтрокаРеквизит.ИмяБлока) = Неопределено Тогда
			ВсеИменаБлоков.Добавить(СтрокаРеквизит.ИмяБлока);
		КонецЕсли;
		
	КонецЦикла; 
	
	ЗаписатьБлокXML(Запись, DocumentMessage.Order_Header, ИмяБлокаORDER_HEADER, МассивФорматов);
	
	OrderType = Строка(Поручение.ВидПоручения.ФорматПоручения);
	ЗаписатьБлокXML(Запись, DocumentMessage[OrderType], OrderType, МассивФорматов);
	
	Для Каждого ИмяБлока Из ВсеИменаБлоков Цикл
		Если ИмяБлока = ИмяБлокаORDER_HEADER Или ИмяБлока = OrderType Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписатьБлокXML(Запись, DocumentMessage[ИмяБлока], ИмяБлока, МассивФорматов);
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента(); //Document
	Запись.ЗаписатьКонецЭлемента(); //Batch
	
	ТекстДокумента = Запись.Закрыть();
	
	РегистрыСведений.СообщенияОбменаСоСмежнымиСистемами.ДобавитьЗапись(СквознойИдентификаторВызова, "FunctionalElectronicDocuments", "SendFunctionalElectronicDocuments", "Исходящее", ТекстДокумента);
	
	//ИсходящийНомер = "D"+СокрЛП(Сред(Поручение.Номер, 2));
	ИсходящийНомер = ФорматИсходящегоНомера(СокрЛП(Поручение.Номер), ?(Поручение.Метаданные() = Метаданные.Документы.НеттоПоручение, "N", "D"));
	Ошибка = Обработки.ЭкспортПорученийВЛуч.СформироватьИсходящийПакетВФайловыйШлюз(ИсходящийНомер, Поручение.Дата, Строка(Поручение.ВидПоручения.ФорматПоручения), Поручение.ВидПоручения.Код, Поручение, ТекстДокумента);
	
	Если ЗначениеЗаполнено(Ошибка) Тогда
		Возврат Ошибка;
	КонецЕсли;

КонецФункции
 
Функция ЗаполнитьБлок(Поручение, СКД, DocumentMessage, ТаблицаРеквизитов, ИмяНабораДанных)
	
	ТаблицаБлоков = ТаблицаРеквизитов.Скопировать(, "ИмяБлока");
	ТаблицаБлоков.Свернуть("ИмяБлока");
	
	НаборДанных = СКД.НаборыДанных[ИмяНабораДанных];
	
	Запрос = Новый Запрос(НаборДанных.Запрос);
	Запрос.УстановитьПараметр("Сделка", Поручение);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Для каждого СтрокаБлок Из ТаблицаБлоков Цикл
			ИмяБлока = СтрокаБлок.ИмяБлока;
			
			СвойствоБлок = DocumentMessage.Свойства().Получить(ИмяБлока);
			Если СвойствоБлок = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
			
			ТекущийБлок = ФабрикаXDTO.Создать(СвойствоБлок.Тип);	
			
			МассивРеквизитов = ТаблицаРеквизитов.НайтиСтроки(Новый Структура("ИмяБлока, ЭтоТаблица", ИмяБлока, Ложь));
			Для каждого СтрокаРеквизит Из МассивРеквизитов Цикл
				ИмяРеквизита = СтрокаРеквизит.ИмяРеквизита;
				
				Если ИмяРеквизита = "" Тогда
					Продолжить;
				КонецЕсли;
				
				Если Найти(ИмяРеквизита, "[") > 0 И Найти(ИмяРеквизита, "]") > 0 Тогда
					ТекстВыражения = СтрЗаменить(ИмяРеквизита, "[", "Выборка[""");
					ТекстВыражения = СтрЗаменить(ТекстВыражения, "]", """]");
					Попытка
						Значение = Вычислить(ТекстВыражения);
					Исключение
						Значение = "";
						//Сообщить("Ошибка при вычислении поля """ + ИмяРеквизита + """ для заполнения реквизита """ + СтрокаРеквизит.ИмяПоля + """");
						Возврат "Ошибка при вычислении поля """ + ИмяРеквизита + """ для заполнения реквизита """ + СтрокаРеквизит.ИмяПоля + """";
					КонецПопытки;
					
					Если ЗначениеЗаполнено(Значение) Тогда
						ТекущийБлок[СтрокаРеквизит.ИмяПоля] = Значение;
					Иначе 
						Если СтрокаРеквизит.Обязательное Тогда
							Возврат "Не заполнено обязательное поле """ + СтрокаРеквизит.ИмяПоля + """. Выгрузка отменена.";
						КонецЕсли; 
					КонецЕсли;
				Иначе
					ТекущийБлок[СтрокаРеквизит.ИмяПоля] = ИмяРеквизита;
				КонецЕсли;
				
			КонецЦикла; 
			
			DocumentMessage[СтрокаБлок.ИмяБлока] = ТекущийБлок;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Возврат "";
КонецФункции
 
Функция ЗаполнитьТаблицуБлока(Поручение, СКД, DocumentMessage, ТаблицаРеквизитов, ИмяНабораДанных)
	ТаблицаБлоков = ТаблицаРеквизитов.Скопировать(, "ИмяБлока");
	ТаблицаБлоков.Свернуть("ИмяБлока");
	
	НаборДанных = СКД.НаборыДанных[ИмяНабораДанных];
	
	ПапкиНабораДанных = Новый массив;
	Для каждого Поле Из НаборДанных.Поля Цикл
		Если ТипЗнч(Поле) = Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных") Тогда
			ПапкиНабораДанных.Добавить(Поле.Заголовок);
		КонецЕсли; 
	КонецЦикла;
	
	Запрос = Новый Запрос(НаборДанных.Запрос);
	Запрос.УстановитьПараметр("Сделка", Поручение);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("ЭтоНеторговоеПоручениеСоСпискомЦБ", Документы.Поручение.ЭтоНеторговоеПоручениеСоСпискомЦБ(Поручение));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаДобавлена = Ложь;
		
		Для каждого СтрокаБлок Из ТаблицаБлоков Цикл
			ИмяБлока = СтрокаБлок.ИмяБлока;
			
			СвойствоБлок = DocumentMessage.Свойства().Получить(ИмяБлока);
			Если СвойствоБлок = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
			
			Если DocumentMessage[ИмяБлока] = Неопределено Тогда
				ТекущийБлок = ФабрикаXDTO.Создать(СвойствоБлок.Тип);	
			Иначе
				ТекущийБлок = DocumentMessage[ИмяБлока];	
			КонецЕсли; 
			
			МассивРеквизитов = ТаблицаРеквизитов.НайтиСтроки(Новый Структура("ИмяБлока, ЭтоТаблица", ИмяБлока, Истина));
			Для каждого СтрокаРеквизит Из МассивРеквизитов Цикл
				ИмяРеквизита = СтрокаРеквизит.ИмяРеквизита;
				
				Если ИмяРеквизита = "" Тогда
					Продолжить;
				КонецЕсли;
				
				Если ПапкиНабораДанных.Найти(СтрокаРеквизит.ИмяТаблицы) = Неопределено Тогда
					Продолжить;
				КонецЕсли; 
				
				ИмяПоля = ИмяРеквизита;
				ИмяПоля = СтрЗаменить(ИмяПоля, "[", "");
				ИмяПоля = СтрЗаменить(ИмяПоля, "]", "");
				
				//ПолеНабораДанных = НаборДанных.Поля.Найти(ИмяПоля);
				//Если ПолеНабораДанных = Неопределено Тогда
				//	//Сообщить("Не найдено поле компоновки данных """ + ИмяРеквизита + """ для заполнения реквизита """ + СтрокаРеквизит.ИмяПоля + """");					
				//	Продолжить;
				//КонецЕсли; 
				
				ИмяТаблицы = СтрокаРеквизит.ИмяТаблицы;
				СвойствоТаблица = ТекущийБлок.Свойства().Получить(ИмяТаблицы);
				Если СвойствоТаблица = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если ТекущийБлок[ИмяТаблицы] = Неопределено Тогда
					ТекущаяТаблица = ФабрикаXDTO.Создать(СвойствоТаблица.Тип);	
				Иначе
					ТекущаяТаблица = ТекущийБлок[ИмяТаблицы];	
				КонецЕсли;	
				
				ИмяСтрокиТаблицы = СтрокаРеквизит.ИмяСтрокиТаблицы; 
				СвойствоСтрокаТаблицы = ТекущаяТаблица.Свойства().Получить(ИмяСтрокиТаблицы);
				Если СвойствоСтрокаТаблицы = Неопределено Тогда
					Продолжить;
				КонецЕсли; 
				
				Если НЕ СтрокаДобавлена Тогда
					ТекущаяСтрокаТаблицы = ФабрикаXDTO.Создать(СвойствоСтрокаТаблицы.Тип);	
				Иначе
					КоличествоСтрок = ТекущаяТаблица[ИмяСтрокиТаблицы].Количество();
					ТекущаяСтрокаТаблицы = ТекущаяТаблица[ИмяСтрокиТаблицы][КоличествоСтрок - 1];
				КонецЕсли; 
				
				ИмяРеквизита = СтрЗаменить(ИмяРеквизита, ИмяНабораДанных + ".", "");
				
				Если Найти(ИмяРеквизита, "[") > 0 И Найти(ИмяРеквизита, "]") > 0 Тогда
					ТекстВыражения = СтрЗаменить(ИмяРеквизита, "[", "Выборка[""");
					ТекстВыражения = СтрЗаменить(ТекстВыражения, "]", """]");
					Попытка
						Значение = Вычислить(ТекстВыражения);
					Исключение
						Значение = "";
						//Сообщить("Ошибка при вычислении поля """ + ИмяРеквизита + """ для заполнения реквизита """ + СтрокаРеквизит.Заголовок + """");
						Возврат "Ошибка при вычислении поля """ + ИмяРеквизита + """ для заполнения реквизита """ + СтрокаРеквизит.Заголовок + """";
					КонецПопытки;
					
					Если ЗначениеЗаполнено(Значение) Тогда
						Если Найти(Значение, "[") > 0 Тогда
							ТекстВыражения = Значение;
							ТекстВыражения = СтрЗаменить(ТекстВыражения, "[", "Выборка.Поручение[");
							Попытка
								Значение = Вычислить(ТекстВыражения);
							Исключение
								Значение = "";
							КонецПопытки;
						КонецЕсли;
						
						Если ТипЗнч(Значение) = Тип("Строка") Тогда
							Значение = СтрЗаменить(Значение, """", "");
						КонецЕсли;
						
						ТекущаяСтрокаТаблицы[СтрокаРеквизит.ИмяПоля] = Значение;
					Иначе
						Если СтрокаРеквизит.Обязательное Тогда
							Возврат "Не заполнено обязательное поле таблицы """ + ИмяТаблицы + """: " + СтрокаРеквизит.ИмяПоля + """. Выгрузка отменена.";
						КонецЕсли;
					КонецЕсли; 
					
				Иначе
					ТекущаяСтрокаТаблицы[СтрокаРеквизит.ИмяПоля] = ИмяРеквизита;
				КонецЕсли;
				
				Если НЕ СтрокаДобавлена Тогда
					ТекущаяТаблица[ИмяСтрокиТаблицы].Добавить(ТекущаяСтрокаТаблицы);
				КонецЕсли; 
				
				ТекущийБлок[ИмяТаблицы] = ТекущаяТаблица;	
				
				СтрокаДобавлена = Истина;
			КонецЦикла; 
			
			DocumentMessage[СтрокаБлок.ИмяБлока] = ТекущийБлок;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	Возврат "";
КонецФункции

Процедура ЗаписатьБлокXML(Запись, Источник, Имя, МассивФорматов)
	Запись.ЗаписатьНачалоЭлемента(Имя);
	Для каждого Свойство Из Источник.Свойства() Цикл
		Если Источник[Свойство.Имя] = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ТипЗнч(Источник[Свойство.Имя]) = Тип("ОбъектXDTO") Тогда
			ЗаписатьБлокXML(Запись, Источник[Свойство.Имя], Свойство.Имя, МассивФорматов);
			
		ИначеЕсли ТипЗнч(Источник[Свойство.Имя]) = Тип("СписокXDTO") Тогда
			
			Для каждого ЭлементСписка Из Источник[Свойство.Имя] Цикл
				Запись.ЗаписатьНачалоЭлемента(Свойство.Имя);
				Для каждого СвойствоСписка Из ЭлементСписка.Свойства() Цикл
					Если ЭлементСписка[СвойствоСписка.Имя] = Неопределено Тогда
						Продолжить;
					КонецЕсли; 
					
					ЗаписатьЭлементXML(Запись, СвойствоСписка.Имя,  ЭлементСписка[СвойствоСписка.Имя], МассивФорматов);
					
				КонецЦикла; 
				Запись.ЗаписатьКонецЭлемента();
			КонецЦикла; 
			
		Иначе
			Если Источник[Свойство.Имя] <> Неопределено Тогда
				ЗаписатьЭлементXML(Запись, Свойство.Имя, Источник[Свойство.Имя], МассивФорматов);
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
	Запись.ЗаписатьКонецЭлемента(); //Имя
КонецПроцедуры

Процедура ЗаписатьЭлементXML(ЗаписьXML, Тег, Значение, МассивФорматов = Неопределено)
	ФорматнаяСтрока = "";
	Если МассивФорматов <> Неопределено Тогда
		Если МассивФорматов.Свойство(Тег) Тогда
			ФорматнаяСтрока = МассивФорматов[Тег];
		КонецЕсли;	
	КонецЕсли; 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(Строка(Тег));						// Начало элемента
	//ЗаписьXML.ЗаписатьТекст(СтрЗаменить(Строка(Значение), " ", ""));	// Значение элемента
	Если ФорматнаяСтрока = "" Тогда
		ЗаписьXML.ЗаписатьТекст(СокрЛП(Строка(Значение)));					// Значение элемента
	Иначе
		ЗаписьXML.ЗаписатьТекст(Формат(Значение, ФорматнаяСтрока));					// Значение элемента
	КонецЕсли; 
	
	ЗаписьXML.ЗаписатьКонецЭлемента();									// Конец элемента
КонецПроцедуры

Функция ФорматИсходящегоНомера(Знач Номер, Префикс = "D") Экспорт
	Поз = Найти("0123456789-", Лев(Номер, 1));
	Пока Поз = 0 Цикл
		Номер = Сред(Номер, 2);
		Поз = Найти("0123456789-", Лев(Номер, 1));
	КонецЦикла; 
		
	Возврат Префикс + Номер;
КонецФункции // ФорматИсходящегоНомера()

Функция НовыйДокументыКПеренумерации()
	
	ДокументыКПеренумерации = Новый ТаблицаЗначений;
	ДокументыКПеренумерации.Колонки.Добавить("Ссылка");
	ДокументыКПеренумерации.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка"));
	ДокументыКПеренумерации.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	
	Возврат ДокументыКПеренумерации;
	
КонецФункции

Функция СозданныеДокументыПоТипам(СозданныеДокументы)
	
	ПодчиненныеДокументы = НовыйДокументыКПеренумерации();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(ПодчиненныеДокументы, СозданныеДокументы, "Ссылка");
	
	Для Каждого СозданныйДокумент из СозданныеДокументы Цикл
		
		Если ТипЗнч(СозданныйДокумент) = Тип("ДокументСсылка.НеттоПоручение") Тогда
			
			Для каждого ВходящийДокумент из СозданныйДокумент.Поручения Цикл
				ПодчиненныеДокументы.Добавить().Ссылка = ВходящийДокумент.Поручение;
				Подчиненные = КритерииОтбора.СтруктураПодчиненности.Найти(ВходящийДокумент.Поручение);
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(ПодчиненныеДокументы, Подчиненные, "Ссылка");
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(СозданныйДокумент) = Тип("ДокументСсылка.Поручение") Тогда
			Подчиненные = КритерииОтбора.СтруктураПодчиненности.Найти(СозданныйДокумент);
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(ПодчиненныеДокументы, Подчиненные, "Ссылка");
		КонецЕсли;
				
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ПодчиненныеДокументы Цикл
	
		СтрокаТаблицы.Тип = СтрокаТаблицы.Ссылка.Метаданные().Имя;
		СтрокаТаблицы.Дата = СтрокаТаблицы.Ссылка.Дата;
	
	КонецЦикла;
	
	ПодчиненныеДокументы.Свернуть("Тип,Дата");
	
	//исключем ТехническуюОперацию из перенумерации
	Для Каждого СтрокаНаУдаление Из ПодчиненныеДокументы.НайтиСтроки(Новый Структура("Тип", "ТехническаяОперация")) Цикл
		ПодчиненныеДокументы.Удалить(СтрокаНаУдаление);	
	КонецЦикла;
	
	Возврат ПодчиненныеДокументы;

	
КонецФункции

Процедура ПеренумероватьДокументы(ДокументыПоТипам)
		
	Если Не ЗначениеЗаполнено(ДокументыПоТипам) Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	ДатыДокументов = ДокументыПоТипам.Скопировать();
	ДатыДокументов.Свернуть("Дата");
	
	Перенумератор = Обработки.ПеренумерацияДокументов.Создать();
	
	Для каждого СтрокаТаблицыДат Из ДатыДокументов Цикл
	
		ДокументыЗаДату = ДокументыПоТипам.Скопировать(ДокументыПоТипам.НайтиСтроки(Новый Структура("Дата", СтрокаТаблицыДат.Дата)));
		
		Для каждого ВидДокументаЗаДату Из ДокументыЗаДату Цикл
		
			РегистрыСведений.РегистрацияДокументовКПеренумерации.ЗарегистрироватьДокументыКПеренумерации(ВидДокументаЗаДату.Тип, ВидДокументаЗаДату.Дата);	
						
		КонецЦикла; 
		
		Выборка = РегистрыСведений.РегистрацияДокументовКПеренумерации.Выбрать(СтрокаТаблицыДат.Дата, СтрокаТаблицыДат.Дата);
		
		Пока Выборка.Следующий() цикл
			
			СтруктураПоиска = Новый Структура("Тип,Дата", Выборка.ИмяДокумента, Выборка.Период);
			Если ЗначениеЗаполнено(ДокументыЗаДату.НайтиСтроки(СтруктураПоиска)) Тогда 
				
				Попытка
					Перенумератор.ПеренумероватьДокументы(Выборка, Истина);
				Исключение
				КонецПопытки;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла; 

	
КонецПроцедуры

ПРоцедура Перенумеровать(СозданныеДокументы)

	ДокументыПоТипам = СозданныеДокументыПоТипам(СозданныеДокументы);
	
	ПеренумероватьДокументы(ДокументыПоТипам);
	
КонецПроцедуры

Функция РазрешенныеКодыОперацийДляЭкспорта()
	
	КодыОпераций_ = Новый Массив;
	
	Выборка = Справочники.ВидыИнвентарныхПоручений.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.ПометкаУдаления Тогда
			КодыОпераций_.Добавить(Выборка.Код);
		КонецЕсли;		
	КонецЦикла;
	
	//добавить статичные
	КодыОпераций_.Добавить("10/50");
	КодыОпераций_.Добавить("10/CA");
	КодыОпераций_.Добавить("10/CA2");
	КодыОпераций_.Добавить("14");
	
	КодыОпераций = Новый Массив;
	ОбщегоНазначения.ЗаполнитьМассивУникальнымиЗначениями(КодыОпераций, КодыОпераций_);
	
	Возврат КодыОпераций;
	
КонецФункции

Процедура ОбработатьРаскрытияСписковВладельцев()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Выгружено", Перечисления.СтатусыРаскрытияСписковВладельцев.Выгружено);
	Запрос.УстановитьПараметр("Загружено", Перечисления.СтатусыДокументовФайловыйШлюз.ВыгруженоВебКабинет);
	Запрос.УстановитьПараметр("Ошибка", Перечисления.СтатусыДокументовФайловыйШлюз.ОшибкаФайловыйШлюз);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыгрузкаРазделаРСВвВышестоящийДепозитарий.РаскрытиеСпискаВладельцев КАК Раскрытие,
	|	ВыгрузкаРазделаРСВвВышестоящийДепозитарий.Ссылка КАК Выгрузка,
	|	ТехническаяОперация.Ссылка КАК ТехническаяОперация,
	|	ТехническаяОперация.Дата КАК ДатаВыгрузки
	|ПОМЕСТИТЬ втВыгрузки
	|ИЗ
	|	Документ.ВыгрузкаРазделаРСВвВышестоящийДепозитарий КАК ВыгрузкаРазделаРСВвВышестоящийДепозитарий
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТехническаяОперация КАК ТехническаяОперация
	|		ПО ВыгрузкаРазделаРСВвВышестоящийДепозитарий.Ссылка = ТехническаяОперация.ДокументОснование
	|ГДЕ
	|	ВыгрузкаРазделаРСВвВышестоящийДепозитарий.РаскрытиеСпискаВладельцев.Статус = &Выгружено
	|	И ВыгрузкаРазделаРСВвВышестоящийДепозитарий.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыгрузкаРазделаРСВвВышестоящийДепозитарий.Раскрытие КАК РаскрытиеСпискаВладельцев,
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус КАК Статус,
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Пакет КАК Пакет,
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Пакет.ОтносительныйПуть КАК ПакетОтносительныйПуть,
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Комментарий КАК Комментарий,
	|	ВЫБОР
	|		КОГДА СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус = &Ошибка
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Отменено,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус, &Ошибка) = &Загружено
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Принято
	|ИЗ
	|	втВыгрузки КАК ВыгрузкаРазделаРСВвВышестоящийДепозитарий
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних КАК СостоянияДокументовВФайловомШлюзеСрезПоследних
	|		ПО ВыгрузкаРазделаРСВвВышестоящийДепозитарий.ТехническаяОперация = СостоянияДокументовВФайловомШлюзеСрезПоследних.Документ
	|ГДЕ
	|	ВыгрузкаРазделаРСВвВышестоящийДепозитарий.ТехническаяОперация В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				втВыгрузки.ТехническаяОперация
	|			ИЗ
	|				втВыгрузки КАК втВыгрузки
	|			ГДЕ
	|				втВыгрузки.Выгрузка = ВыгрузкаРазделаРСВвВышестоящийДепозитарий.Выгрузка
	|			УПОРЯДОЧИТЬ ПО
	|				втВыгрузки.ДатаВыгрузки УБЫВ)
	|ИТОГИ
	|	МАКСИМУМ(Отменено),
	|	МИНИМУМ(Принято)
	|ПО
	|	РаскрытиеСпискаВладельцев";
	Результат = Запрос.Выполнить();
	ВыборкаРаскрытий = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРаскрытий.Следующий() Цикл
		Если ВыборкаРаскрытий.Отменено Или ВыборкаРаскрытий.Принято Тогда
			Попытка
				Раскрытие = ВыборкаРаскрытий.РаскрытиеСпискаВладельцев.ПолучитьОбъект();
				Раскрытие.Заблокировать();
				Если ВыборкаРаскрытий.Отменено Тогда
					Раскрытие.Статус = Перечисления.СтатусыРаскрытияСписковВладельцев.Отменено;
				ИначеЕсли ВыборкаРаскрытий.Принято Тогда
					Раскрытие.Статус = Перечисления.СтатусыРаскрытияСписковВладельцев.Принято;
				КонецЕсли;
				Раскрытие.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				Ссылка = ВыборкаРаскрытий.РаскрытиеСпискаВладельцев;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(Ссылка)+" не обработано:"+Символы.ПС+ОписаниеОшибки);
				ЗаписьЖурналаРегистрации("Актуализация статусов РСВ", УровеньЖурналаРегистрации.Информация, Ссылка.Метаданные(), Ссылка, ОписаниеОшибки);
			КонецПопытки;
			Раскрытие = Неопределено;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////

// Читает DBF-файлы из указанного каталога в таблицу значений.
//
// Параметры:
//  КаталогФайлов	 - Строка
// 
// Возвращаемое значение:
//   ТаблицаЗначений
//
Функция ВсеФайлыDBF(КаталогФайлов)
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("ИмяФайла");
	Данные.Колонки.Добавить("НомерСтрокиФайла");
	Данные.Колонки.Добавить("Элемент");
	Данные.Колонки.Добавить("Тип");
	Данные.Колонки.Добавить("Длина");
	Данные.Колонки.Добавить("Значение");
	
	МассивФайлов = НайтиФайлы(КаталогФайлов, "*.dbf", Истина);
	Для каждого Файл Из МассивФайлов Цикл
		Если СтрДлина(Файл.ИмяБезРасширения) > 8 Тогда
			ПолноеИмяФайла = Файл.Путь + Лев(Файл.ИмяБезРасширения, 8) + Файл.Расширение;
			ПереместитьФайл(Файл.ПолноеИмя, ПолноеИмяФайла);
		Иначе
			ПолноеИмяФайла = Файл.ПолноеИмя;
		КонецЕсли;
		
		База_XBase = Новый XBase;
		База_XBase.ОткрытьФайл(ПолноеИмяФайла, , Истина);
		База_XBase.Кодировка = КодировкаXBase.OEM;
		
		Если База_XBase.Открыта() Тогда
			
			Для НомерСтроки = 1 По База_XBase.КоличествоЗаписей() Цикл
				База_XBase.Перейти(НомерСтроки);
				Для каждого Поле Из База_XBase.Поля Цикл
					НоваяСтрока = Данные.Добавить();
					НоваяСтрока.ИмяФайла = Файл.Имя;
					НоваяСтрока.НомерСтрокиФайла = НомерСтроки;
					НоваяСтрока.Элемент = Поле.Имя;
					НоваяСтрока.Тип = Поле.Тип;
					НоваяСтрока.Длина = Поле.Длина;
					ЗначениеПоля = База_XBase[Поле.Имя];
					Если Поле.Тип = "S" Тогда
						НоваяСтрока.Значение = СтроковыеФункцииКлиентСервер.ИзменитьКодировкуСтроки(
							ЗначениеПоля, КодировкаТекста.OEM);
					Иначе
						НоваяСтрока.Значение = ЗначениеПоля;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			База_XBase.ЗакрытьФайл();
		КонецЕсли;
	КонецЦикла;
	Возврат Данные;
	
КонецФункции

Функция ДатаВремя(Дата, ВремяСтрокой)
	
	Результат = Дата;
	ОбщегоНазначения.СкопироватьВремя(Результат, СтроковыеФункцииКлиентСерверПереопределяемый.ВремяИзСтроки(ВремяСтрокой));
	Возврат Результат;
	
КонецФункции

Функция КоличествоИсполненияПоТехОперации(ТехническаяОперация)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ЗапросКоличества.КоличествоИсполнения), 0) КАК КоличествоИсполнения
	|ИЗ
	|	(ВЫБРАТЬ
	|		СостоянияДокументовВФайловомШлюзе.КоличествоИсполнения КАК КоличествоИсполнения
	|	ИЗ
	|		РегистрСведений.СостоянияДокументовВФайловомШлюзе КАК СостоянияДокументовВФайловомШлюзе
	|	ГДЕ
	|		СостоянияДокументовВФайловомШлюзе.Документ = &ТехническаяОперация) КАК ЗапросКоличества";
	Запрос.УстановитьПараметр("ТехническаяОперация", ТехническаяОперация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоИсполнения;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Ищет первую строку таблицы ВсеФайлы, содержащую количество, и возвращает его.
//
// Параметры:
//  ВсеФайлы	- ТаблицаЗначений:
//    * ИмяФайла	- Строка
//    * Элемент		- Строка
//    * Тип			- Строка
//    * Значение	- Строка, Число
//  ИмяФайла	 - Строка	 - Имя файла, в записях которого нужно найти данные по количеству
// 
// Возвращаемое значение:
//  Число - количество, исполненное в НРД. 0, если искомых строк не найдено.
//
Функция КоличествоИсполненноеВНРД_DBF(ВсеФайлы, ИмяФайла)
	
	Отбор = Новый Структура("ИмяФайла, Элемент", ИмяФайла, "SEQ_AMO");
	НайденныеСтроки = ВсеФайлы.НайтиСтроки(Отбор);
	Количество = 0;
	Если НайденныеСтроки.Количество() > 0 Тогда
		Если НайденныеСтроки[0].Тип = "S" Тогда
			Данные = СтрЗаменить(НайденныеСтроки[0].Значение, " ", "");
			Если Данные = "" Тогда
				Данные = "0";
			КонецЕсли;
			Количество = СтроковыеФункцииКлиентСервер.ЧислоИзСтроки(Данные);
		ИначеЕсли НайденныеСтроки[0].Тип = "N" Тогда
			Количество = НайденныеСтроки[0].Значение;
		КонецЕсли;
	КонецЕсли;
	Возврат Количество;
	
КонецФункции

Функция СкорректированныйСтатусПоручения(ТехническаяОперация, СтатусПоручения, КоличествоИсполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИСТИНА
	|ИЗ
	|	Документ.ТехническаяОперация КАК ТехническаяОперация
	|ГДЕ
	|	ТехническаяОперация.Ссылка = &ТехническаяОперация
	|	И ТехническаяОперация.ДокументОснование ССЫЛКА Документ.НеттоПоручение
	|	И ТехническаяОперация.ДокументОснование <> ЗНАЧЕНИЕ(Документ.НеттоПоручение.ПустаяСсылка)
	|	И &ДатаВвода <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ТехническаяОперация.ДокументОснование.Дата >= &ДатаВвода
	|	И ТехническаяОперация.ДокументОснование.Количество > &ИтогоКоличествоИсполнения
	|	И &СтатусПоручения = &Исполнено
	|";
	Запрос.УстановитьПараметр("ТехническаяОперация", ТехническаяОперация);
	Запрос.УстановитьПараметр("ДатаВвода", Константы.ДатаВводаЧастичногоИсполненияИнвентарныхПоручений.Получить());
	ИтогоКоличествоИсполнения = КоличествоИсполненияПоТехОперации(ТехническаяОперация) + КоличествоИсполнения;
	Запрос.УстановитьПараметр("ИтогоКоличествоИсполнения", ИтогоКоличествоИсполнения);
	Запрос.УстановитьПараметр("СтатусПоручения", СтатусПоручения);
	Запрос.УстановитьПараметр("Исполнено", Перечисления.СтатусыДокументовФайловыйШлюз.Исполнено);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат СтатусПоручения;
	Иначе
		Возврат Перечисления.СтатусыДокументовФайловыйШлюз.ИсполненоЧастично;
	КонецЕсли;
	
КонецФункции

Функция ОбщийКаталогПеремещаемогоФайлаВАрхив(КаталогАрхива, ВидОтчета = "")
		
	Если Не ЗначениеЗаполнено(ВидОтчета) Тогда
		
		//1. каталоги даты  (Год\Месяц\День)
		ТекущаяДата 	= ТекущаяДатаСеанса();
		
		ТекущийГод 		= Формат(Год(ТекущаяДата),		"ЧГ=0");
		ТекущийМесяц 	= Формат(Месяц(ТекущаяДата),	"ЧЦ=2; ЧВН=; ЧГ=0");
		ТекущийДень 	= Формат(День(ТекущаяДата),		"ЧЦ=2; ЧВН=; ЧГ=0");
		
		ТекущийКаталогПоДате = ТекущийГод + "\" + ТекущийМесяц + "\" + ТекущийДень;
		ПроверитьНаличиеКаталоговВСтруктуре(КаталогАрхива, ТекущийКаталогПоДате);
		ТекущийКаталогАрхиваНаДату = КаталогАрхива + "\" + ТекущийКаталогПоДате; 
		
		//2. Система = Депо
		ТекущийКаталогПоСистеме = "Депо";
		ПроверитьНаличиеКаталоговВСтруктуре(ТекущийКаталогАрхиваНаДату, ТекущийКаталогПоСистеме);
		ТекущийКаталогАрхиваНаДатуПоСистеме = ТекущийКаталогАрхиваНаДату + "\" + ТекущийКаталогПоСистеме;
		
		Возврат ТекущийКаталогАрхиваНаДатуПоСистеме;		
				
	Иначе
		
		//3. Вид отчета 		
		ТекущийКаталогПоВидуОтчета = ВидОтчета;
		ПроверитьНаличиеКаталоговВСтруктуре(КаталогАрхива, ТекущийКаталогПоВидуОтчета);
		ТекущийКаталогАрхиваНаДатуПоСистемеПоВидуОтчета = КаталогАрхива + "\" + ТекущийКаталогПоВидуОтчета;
		
		Возврат ТекущийКаталогАрхиваНаДатуПоСистемеПоВидуОтчета;		
			
	КонецЕсли;	
	
КонецФункции

Процедура ПроверитьНаличиеКаталоговВСтруктуре(ИмяКорневогоКаталога, ИмяТекущегоКаталога)
	
	ТекущийКаталогНайден = Ложь;
	
	ФайлыКаталога = НайтиФайлы(ИмяКорневогоКаталога, ИмяТекущегоКаталога);
	
	Для Каждого НайденныйФайл Из ФайлыКаталога Цикл
		Если НайденныйФайл.ЭтоКаталог() Тогда
			ТекущийКаталогНайден = Истина;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Если ТекущийКаталогНайден Тогда
	Иначе
		СоздатьКаталог(ИмяКорневогоКаталога + "\" + ИмяТекущегоКаталога);
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначениеЭлементаИзДанныхФайлов(ВсеФайлы, Элемент, ИмяФайла = Неопределено, НомерСтрокиФайла = Неопределено) Экспорт
	
	Значение = Неопределено;
	
	Отбор = Новый Структура("Элемент", Элемент);
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		Отбор.Вставить("ИмяФайла", ИмяФайла);
	КонецЕсли;
	Если ЗначениеЗаполнено(НомерСтрокиФайла) Тогда
		Отбор.Вставить("НомерСтрокиФайла", НомерСтрокиФайла);
	КонецЕсли;
	
	НайденныеСтроки = ВсеФайлы.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Значение = НайденныеСтроки[0].Значение;
		Значение = ?(ТипЗнч(Значение) = Тип("Строка"), СокрЛП(Значение), Значение);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция БлокировкаЦБПоОтчетуСуществует(НомерОтчета, ДатаОтчета, ТехническаяОперация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИСТИНА КАК ДокументБлокировкиЦБСуществует
	|ИЗ
	|	Документ.ВходящийПакетИзФайловогоШлюза КАК ВходящийПакетИзФайловогоШлюза
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.БлокировкаЦБвВышестоящемДепозитарии КАК БлокировкаЦБвВышестоящемДепозитарии
	|		ПО ВходящийПакетИзФайловогоШлюза.Ссылка = БлокировкаЦБвВышестоящемДепозитарии.ДокументОснование
	|			И (НЕ ВходящийПакетИзФайловогоШлюза.ПометкаУдаления)
	|ГДЕ
	|	ВходящийПакетИзФайловогоШлюза.ДокументОснование = &ДокументОснование
	|	И ВходящийПакетИзФайловогоШлюза.НомерВходящегоДокумента = &НомерВходящегоДокумента
	|	И ВходящийПакетИзФайловогоШлюза.ДатаВходящегоДокумента = &ДатаВходящегоДокумента";
	
	Запрос.УстановитьПараметр("НомерВходящегоДокумента", НомерОтчета);
	Запрос.УстановитьПараметр("ДатаВходящегоДокумента", ДатаОтчета);
	Запрос.УстановитьПараметр("ДокументОснование", ТехническаяОперация);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ИсходноеПоручениеТехническойОперации(ТехническаяОперация)
	
	Поручение = Документы.Поручение.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА ТехническаяОперация.ДокументОснование ССЫЛКА Документ.Поручение
	|			ТОГДА ТехническаяОперация.ДокументОснование
	|		КОГДА ТехническаяОперация.ДокументОснование ССЫЛКА Документ.НеттоПоручение
	|			ТОГДА НеттоПоручениеПоручения.Поручение
	|	КОНЕЦ КАК Поручение
	|ИЗ
	|	Документ.ТехническаяОперация КАК ТехническаяОперация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НеттоПоручение.Поручения КАК НеттоПоручениеПоручения
	|		ПО ТехническаяОперация.ДокументОснование = НеттоПоручениеПоручения.Ссылка
	|			И (НеттоПоручениеПоручения.Поручение.ВидОперацииД = &СнятиеСДепонирования)
	|ГДЕ
	|	ТехническаяОперация.Ссылка = &ТехническаяОперация";
	
	Запрос.УстановитьПараметр("ТехническаяОперация", ТехническаяОперация);
	Запрос.УстановитьПараметр("СнятиеСДепонирования", Справочники.ВидыОпераций.СнятиеСДепонирования);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Поручение = Выборка.Поручение;
	КонецЕсли;
	
	Возврат Поручение;
	
КонецФункции

Процедура ОбработатьБлокировкуЦБ(ВходящийПакет, ДатаПереходаНаНовыйМеханизмБлокировокЦБ, ДанныеФайлов) Экспорт
	
	ТехническаяОперация = ВходящийПакет.ДокументОснование;
	НомерОтчета = ВходящийПакет.НомерВходящегоДокумента;
	ДатаОтчета = ВходящийПакет.ДатаВходящегоДокумента;
	
	ЭтоОтчетПоОперацииСнятияЦБсДепонирования = ДанныеФайлов.ТипОтчета = "36" Или ДанныеФайлов.ТипОтчета = "36/2";
	
	Если Не ЭтоОтчетПоОперацииСнятияЦБсДепонирования Тогда
		Возврат;
	КонецЕсли;
	
	Поручение = ИсходноеПоручениеТехническойОперации(ТехническаяОперация);
		
	Если Не ЗначениеЗаполнено(Поручение) Тогда
		ТекстОшибки = "Не удалось найти исходное поручение по документу: " + Строка(ТехническаяОперация);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ЗаписьЖурналаРегистрации("Загрузка отчетов по поручению (Z)", УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Обработки.ЭкспортПорученийВЛуч, ВходящийПакет.Ссылка, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	РеквизитыПоручения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Поручение,
		"Дата, ДатаИсполненияПоручения, ЦБ, СчетДепо, МХКонтрагент, МХДепонента, СчетДепоМХ, РазделСчетаДепоМХ");
		
	Если РеквизитыПоручения.Дата < ДатаПереходаНаНовыйМеханизмБлокировокЦБ
		Или БлокировкаЦБПоОтчетуСуществует(НомерОтчета, ДатаОтчета, ТехническаяОперация) Тогда
		Возврат;
	КонецЕсли;
	
	КодБлокировочногоРаздела = "27000000000000000";
	ЭтоБлокированиеЦБ = ДанныеФайлов.ФормаОтчета = "MS020" И ДанныеФайлов.РазделМХЗачисления = КодБлокировочногоРаздела;
	ЭтоРазблокированиеЦБ = ДанныеФайлов.ФормаОтчета = "MS020" И ДанныеФайлов.РазделМХСписания = КодБлокировочногоРаздела
		Или ДанныеФайлов.ФормаОтчета = "MS036" И ДанныеФайлов.РазделМХБлокировка = КодБлокировочногоРаздела;
	Если ЭтоБлокированиеЦБ Тогда
		
		ВидОперацииБлокировки = Перечисления.ВидыОперацийЦБ.Блокирование;
		
	ИначеЕсли ЭтоРазблокированиеЦБ Тогда
		
		ВидОперацииБлокировки = Перечисления.ВидыОперацийЦБ.Разблокирование;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидОперацииБлокировки) И ЗначениеЗаполнено(ДанныеФайлов.БлокировкаКоличествоЦБ) Тогда
		СформироватьДокументБлокировкиЦБ(ВходящийПакет, ВидОперацииБлокировки, РеквизитыПоручения,
			ДанныеФайлов.БлокировкаКоличествоЦБ);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДокументБлокировкиЦБ(ВходящийПакет, ВидОперацииБлокировки, РеквизитыПоручения, КоличествоЦБ)
	
	БлокировочныйРазделСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыПоручения.СчетДепоМХ,
		"БлокировочныйРазделСчета");
	
	БлокировкаЦБОбъект = Документы.БлокировкаЦБвВышестоящемДепозитарии.СоздатьДокумент();
	БлокировкаЦБОбъект.Дата = ВходящийПакет.ДатаВходящегоДокумента;
	БлокировкаЦБОбъект.ДокументОснование = ВходящийПакет.Ссылка;
	БлокировкаЦБОбъект.ВидОперации = ВидОперацииБлокировки;
	БлокировкаЦБОбъект.ЦеннаяБумага = РеквизитыПоручения.ЦБ;
	БлокировкаЦБОбъект.СчетДепо = РеквизитыПоручения.СчетДепо;
	БлокировкаЦБОбъект.МестоХранения = РеквизитыПоручения.МХДепонента;
	БлокировкаЦБОбъект.СчетДепоМХ = РеквизитыПоручения.СчетДепоМХ;
	БлокировкаЦБОбъект.РазделСчетаДепоМХ = РеквизитыПоручения.РазделСчетаДепоМХ;
	БлокировкаЦБОбъект.БлокировочныйРазделСчетаДепоМХ = БлокировочныйРазделСчета;
	БлокировкаЦБОбъект.Количество = КоличествоЦБ;
	БлокировкаЦБОбъект.ДополнительныеСвойства.Вставить("МХКонтрагент", РеквизитыПоручения.МХКонтрагент);
	БлокировкаЦБОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Функция ПоследнийЗаполненныйСтатусТехническойОперации(ТехническаяОперация)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних(&ТекущаяДатаСеанса, Документ = &ТехническаяОперация) КАК СостоянияДокументовВФайловомШлюзеСрезПоследних
	|ГДЕ
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовФайловыйШлюз.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ТехническаяОперация", ТехническаяОперация);
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Статус;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ТребуетсяСоздатьПоручениеНаОтмену(ВсеФайлы)
	
	Отбор = Новый Структура("Элемент", "ABORT_CAUS");
	НайденныеСтроки = ВсеФайлы.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 И Лев(НайденныеСтроки[0].Значение, 32) = "Истек срок исполнения поручения." Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

	
КонецФункции

Процедура СоздатьОтменуПоручения(Поручение, НомерОтчета, ДатаОтчета)
	
	ПоручениеОтмены = Документы.Поручение.СоздатьДокумент();
	ПоручениеОтмены.ВидОперацииД = Справочники.ВидыОпераций.ОтменаПоручения;
	ПоручениеОтмены.ОтменяемоеПоручение = Поручение;
	ПоручениеОтмены.ВидИнициатора = 0;
	ПоручениеОтмены.КодОтчетаНРД = НомерОтчета;
	ПоручениеОтмены.Инициатор = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ОрганизацияПоУмолчанию");
	ПоручениеОтмены.КодОтмены = Справочники.КодыОтменыПоручений.НайтиПоКоду("14");
	ПоручениеОтмены.ПричинаОтмены = ПоручениеОтмены.КодОтмены.Наименование;
	ПоручениеОтмены.Дата = ДатаОтчета;
	ПоручениеОтмены.ДатаИсполненияПоручения = ДатаОтчета + 60;
	ПоручениеОтмены.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Функция РезультатЗаполненияПоручения(Знач Поручение, РегистрационныйНомер, ДатаИсполнения, ДатаИсполненияВМестеРасчетов, КодОтчета, Комментарий)
	
	Документ = Поручение.ПолучитьОбъект();
	Если ТипЗнч(Поручение) = Тип("ДокументСсылка.Поручение") Тогда
		Документ.ДатаИсполненияПоручения = ДатаИсполнения;
		ВидОперацииД = Документ.ВидОперацииД;
		Если ЗначениеЗаполнено(ВидОперацииД) И ТипЗнч(ВидОперацииД) = Тип("СправочникСсылка.ВидыОпераций") И ВидОперацииД.ДвижениеПоЦБ Тогда
			Документ.ДатаИсполненияПорученияВДепозитарииМХ = ДатаИсполнения;
			Документ.ДатаИсполненияПорученияВМестеРасчетов = ДатаИсполненияВМестеРасчетов;
		КонецЕсли;
		Документ.КодОтчетаНРД = КодОтчета;
	ИначеЕсли ТипЗнч(Поручение) = Тип("ДокументСсылка.РаскрытиеСпискаВладельцев") Тогда
		Документ.ДатаИсполнения = ДатаИсполнения;
		Документ.REPORT_ID = КодОтчета;
	Иначе
		// Поручение в вышестоящий депозитарий
		Если ПустаяСтрока(Документ.РегистрационныйНомер) Тогда
			Документ.РегистрационныйНомер = РегистрационныйНомер;
		КонецЕсли;
		Документ.ДатаИсполнения = ДатаИсполнения;
		Документ.КодОтчетаВышестоящегоДепозитария = КодОтчета;
		Документ.ДополнительныеСвойства.Вставить("Комментарий", Комментарий);
	КонецЕсли;
	Документ.Комментарий = Документ.Комментарий + ?(ЗначениеЗаполнено(Документ.Комментарий), " | ", "") + Комментарий;
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		Возврат "";
	Исключение
		Возврат "Не удалось провести " + Документ + " " + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецФункции

Функция РезультатЗаполненияДанныхДепонента(Поручение, КодЗагрузкиДепонентаНДЦ, НаименованиеДепонентаВНРД)
	Депонент = Справочники.Контрагенты.ПустаяСсылка();
	
	Если ТипЗнч(Поручение) = Тип("ДокументСсылка.Поручение")
		И ЗначениеЗаполнено(Поручение.ДокументОснование)
		И ТипЗнч(Поручение.ДокументОснование) = Тип("ДокументСсылка.Поручение")
		И Поручение.ДокументОснование.ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо
		И ЗначениеЗаполнено(Поручение.ДокументОснование.Депонент)
		И ТипЗнч(Поручение.ДокументОснование.Депонент) = Тип("СправочникСсылка.Контрагенты") Тогда

		Депонент = Поручение.ДокументОснование.Депонент;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Депонент) И ЗначениеЗаполнено(КодЗагрузкиДепонентаНДЦ)
		И ЗначениеЗаполнено(НаименованиеДепонентаВНРД) Тогда
		
		НДЦ = Константы.КлассификаторЗагрузкиНДЦ.Получить();
		Если НДЦ.Пустая() Тогда
			Возврат "Не заполнена константа ""Классификатор загрузки НДЦ""!";
		КонецЕсли;
				
		Если Депонент.Субброкер Тогда
			
			Субклиент = Поручение.ДокументОснование.Субклиент;
			Если Не ЗначениеЗаполнено(Субклиент) Тогда
				Возврат "В поручении № " + СокрЛП(Поручение.ДокументОснование.Номер) + " не заполнен Субклиент";
			КонецЕсли;

			СубклиентОбъект = Субклиент.ПолучитьОбъект();
			СубклиентОбъект.НаименованиеБенефициара = НаименованиеДепонентаВНРД;
			СубклиентОбъект.КодНРД = КодЗагрузкиДепонентаНДЦ;
			
			НачатьТранзакцию();
			Попытка
				СубклиентОбъект.Записать();
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				Возврат "Не удалось записать Субклиента " + СубклиентОбъект + " " + Символы.ПС
				+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
			
		Иначе
			
			ДепонентОбъект = Депонент.ПолучитьОбъект();
			ДепонентОбъект.НаименованиеБенефициараВНРД = НаименованиеДепонентаВНРД;
			НачатьТранзакцию();
			Попытка
				ДепонентОбъект.Записать();
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				Возврат "Не удалось записать депонента " + ДепонентОбъект + " " + Символы.ПС
				+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
			
			КодЗагрузки = Справочники.КодыЗагрузки.НайтиПоВладельцуИБирже(Депонент, НДЦ);
			Если ЗначениеЗаполнено(КодЗагрузки) Тогда
				КодЗагрузкиОбъект = КодЗагрузки.ПолучитьОбъект();
			Иначе
				КодЗагрузкиОбъект = Справочники.КодыЗагрузки.СоздатьЭлемент();
				КодЗагрузкиОбъект.Владелец	= Депонент;
				КодЗагрузкиОбъект.Биржа		= НДЦ;
				КодЗагрузкиОбъект.ДополнительныеСвойства.Вставить("КомментарийДляИсторииДанных", "ЭкспортПорученийВДКУ");
			КонецЕсли;		
			КодЗагрузкиОбъект.Код = КодЗагрузкиДепонентаНДЦ;
			
			НачатьТранзакцию();	
			Попытка
				КодЗагрузкиОбъект.Записать();
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				Возврат "Не удалось записать код загрузки " + КодЗагрузкиОбъект + " " + Символы.ПС
				+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "";
КонецФункции

Функция ВыборкаТехническаяОперацияПоНомеруИДате(Номер, Дата)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТехническаяОперация.Ссылка КАК Документ,
	|	ТехническаяОперация.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.ТехническаяОперация КАК ТехническаяОперация
	|ГДЕ
	|	ТехническаяОперация.Проведен
	|	И ТехническаяОперация.Номер = &Номер
	|	И НАЧАЛОПЕРИОДА(ТехническаяОперация.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка;
КонецФункции

Процедура ПроверитьИЗаписатьОшибкуЗагрузкиПоРСВ(ДокументОснование, ОписаниеОшибки)
	ЭтоОшибкаПоРСВ = ЗначениеЗаполнено(ОписаниеОшибки)
		И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РаскрытиеСпискаВладельцев")
		И ЗначениеЗаполнено(ДокументОснование);
		
	Если Не ЭтоОшибкаПоРСВ Тогда
		Возврат;
	КонецЕсли;
	
	ДокументРаскрытияОбъект = ДокументОснование.ПолучитьОбъект();
	ДокументРаскрытияОбъект.Статус = Перечисления.СтатусыРаскрытияСписковВладельцев.Ошибка;
	Если СтрНайти(ДокументРаскрытияОбъект.Комментарий, ОписаниеОшибки) = 0 Тогда
		ДокументРаскрытияОбъект.Комментарий = ДокументРаскрытияОбъект.Комментарий
			+ ?(ЗначениеЗаполнено(ДокументРаскрытияОбъект.Комментарий), Символы.ПС, "") + ОписаниеОшибки;
	КонецЕсли;
	ДокументРаскрытияОбъект.Записать();
КонецПроцедуры

Процедура ОбработатьMeetingInstructionStatus(ЧтениеXML, ПутьАрхив)
	
	СодержимоеФайла = СодержимоеФайлаПоMeetingInstructionStatus(ЧтениеXML);
	
	НомерДокумента = СодержимоеФайла["AppHdr.Rltd.BizMsgIdr"];
	ДатаДокументаСтрока = СодержимоеФайла["AppHdr.Rltd.CreDt"];
	ОписаниеОшибки_GblInstrSts = СодержимоеФайла["Document.MtgInstrSts.InstrTpSts.InstrSts.GblInstrSts.RjctnSts.AddtlInf"];
	ОписаниеОшибки_DtldInstrSts = СодержимоеФайла["Document.MtgInstrSts.InstrTpSts.InstrSts.DtldInstrSts.InstrSts.RjctnSts.AddtlInf"];
	ОписаниеОшибки = "" + ОписаниеОшибки_GblInstrSts + ?(ЗначениеЗаполнено(ОписаниеОшибки_GblInstrSts)
		И ЗначениеЗаполнено(ОписаниеОшибки_DtldInstrSts), Символы.ПС, "") + ОписаниеОшибки_DtldInstrSts;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) И ЗначениеЗаполнено(НомерДокумента) И ЗначениеЗаполнено(ДатаДокументаСтрока) Тогда
		ДатаДокумента = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ДатаДокументаСтрока);
		ДатаДокумента = ДатаДокумента + СмещениеСтандартногоВремени(ЧасовойПояс());
		Выборка = ВыборкаТехническаяОперацияПоНомеруИДате(НомерДокумента, ДатаДокумента);
		Если Выборка.Следующий() Тогда	// По входящему пакету из файлового шлюза сопоставлен документ ""Техническая операция"
			ВходящийПакет = Документы.ВходящийПакетИзФайловогоШлюза.СоздатьДокумент();
			ВходящийПакет.ДокументОснование = Выборка.Документ;
			ВходящийПакет.Дата = ТекущаяДатаСеанса();
			Для Каждого Элемент Из СодержимоеФайла Цикл
				ПолныйПутьТега = СтрЗаменить(Элемент.Ключ, "_", ".");
				НоваяСтрока = ВходящийПакет.СодержимоеФайла.Добавить();
				НоваяСтрока.Элемент = ПолныйПутьТега;
				НоваяСтрока.Значение = Элемент.Значение;
			КонецЦикла;
			ВходящийПакет.СодержимоеФайла.Сортировать("Элемент");
			ВходящийПакет.ПутьАрхив = ПутьАрхив;
			ВходящийПакет.Записать();
			ПроверитьИЗаписатьОшибкуЗагрузкиПоРСВ(Выборка.ДокументОснование, ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция СодержимоеФайлаПоMeetingInstructionStatus(ЧтениеXML)
	ИмяУзла = "";
	ПолноеИмяУзла = "";
	СодержимоеФайла = Новый Соответствие;
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ИмяУзла = ЧтениеXML.Имя;
			ПолноеИмяУзла = ПолноеИмяУзла + ?(ЗначениеЗаполнено(ПолноеИмяУзла), ".", "") + ИмяУзла;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			ПозицияНачалаУзлаВПолномПути = СтрНайти(ПолноеИмяУзла, "." + ЧтениеXML.Имя, НаправлениеПоиска.СКонца);
			ПолноеИмяУзла = Лев(ПолноеИмяУзла, ПозицияНачалаУзлаВПолномПути - 1);
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст И ИмяУзла <> "" Тогда
			СодержимоеФайла.Вставить(ПолноеИмяУзла, ЧтениеXML.Значение);
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	Возврат СодержимоеФайла;
КонецФункции

Функция ТекстСообщенияXML(ЭтоТранзит, ТекстСообщенияВходящий, Номер,
	ДокументОснование, НоваяТехническаяОперация, ИмяКаталогДляФайла, ИмяФайлаXML)
	
	Если ЭтоТранзит Тогда
		ТекстСообщения = Документы.РаскрытиеСпискаВладельцев.ТекстСообщенияТранзитаWINF(ДокументОснование,
			НоваяТехническаяОперация, ИмяКаталогДляФайла, ИмяФайлаXML);
	Иначе
		Если ЗначениеЗаполнено(ДокументОснование) И СтрНайти(ТекстСообщенияВходящий, СокрЛП(ДокументОснование.Номер)) > 0 Тогда
			ТекстСообщения = СтрЗаменить(ТекстСообщенияВходящий, СокрЛП(ДокументОснование.Номер), НоваяТехническаяОперация.Номер);
		ИначеЕсли СтрНайти(ТекстСообщенияВходящий, СокрЛП(Номер)) > 0 Тогда
			ТекстСообщения = СтрЗаменить(ТекстСообщенияВходящий, Номер, НоваяТехническаяОперация.Номер);
		Иначе
			ТекстСообщения = ТекстСообщенияВходящий;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции
