
#Область ОписаниеПеременных

&НаСервере
Перем мТекущийОбъектНаСервере;

#КонецОбласти 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокРегистров = УправлениеОтчетами.ПолучитьСписокРегистровОстатков();
	Для каждого ЭлемСписка Из СписокРегистров Цикл
		Элементы.Раздел.СписокВыбора.Добавить(ЭлемСписка.Значение, ЭлемСписка.Представление);
	КонецЦикла; 
	
	Если Параметры.Свойство("РежимРасшифровки") Тогда 
		Отчет.РежимРасшифровки = Параметры.РежимРасшифровки;
		ЭтаФорма.ПараметрыРасшифровки = Параметры.ПараметрыРасшифровки;
	Иначе 
		Отчет.РежимРасшифровки = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресСхемыКомпоновкиДанных) Тогда 
		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(ТекущийОбъект().СхемаКомпоновкиДанных, УникальныйИдентификатор);
	КонецЕсли;
	
	УстановитьУсловноеОформлениеТипГруппировки();	
	КлючТекущихПользовательскихНастроек = Новый УникальныйИдентификатор;
	
	Отчет.РаскрашиватьИзмерения = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КлючУникальности = Новый УникальныйИдентификатор;
	
	Если Отчет.РежимРасшифровки Тогда 
		
		ИнициализацияРасшифровкиПоНастройкам();
		Сформировать("");
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(Элементы.Раздел.СписокВыбора) Тогда
			ПоказатьПредупреждение(, "Не обнаружены регистры, для анализа");
			Отказ = Истина;
			Возврат;		
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(Отчет.Раздел) Тогда
			Отчет.Раздел = Элементы.Раздел.СписокВыбора[0].Значение;				
		КонецЕсли; 
		
		ИнициализироватьКомпоновщик();		
		ПредыдущийРаздел = Отчет.Раздел;
		
		Отчет.ДатаНачала = ТекущаяДата();
		Отчет.ДатаОкончания = ТекущаяДата();
		
		УстановитьПериодНаСервере();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не ЗавершениеРаботы Тогда
		СохранитьНастройкиРазделаНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	УстановитьПериодНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	УстановитьПериодНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РазделПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Отчет.Раздел) Тогда
		Отчет.Раздел = ПредыдущийРаздел;
		
	КонецЕсли; 
	
	Если Отчет.Раздел <> ПредыдущийРаздел Тогда
		ИнициализироватьКомпоновщик();
		ПредыдущийРаздел = Отчет.Раздел;
		
		УстановитьЗаголовокФормы();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РазделОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)		
	СохранитьНастройкиРазделаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Расшифровка = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)

	СтандартнаяОбработка = Ложь;	
	
	Если ОсновноеДействиеОбработкиРасшифровкиОткрытьЗначение(ДанныеРасшифровки, Расшифровка) Тогда
		
		ЗначениеПоля = ЗначениеПоляНаСервере(Расшифровка);
		Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
			ПоказатьЗначение(, ЗначениеПоля);
		КонецЕсли;
		
	Иначе 		
		
		ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
		ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, ИсточникДоступныхНастроек);
		ВозможныеРасшифровки = ВозможныеРасшифровки(Расшифровка);
		ДоступныеДействия = Новый Массив;
		ВыполненноеДействие = Неопределено;
		ПараметрыВыполненногоДействия = Неопределено;
		ОбработкаРасшифровки.ВыбратьДействие(Расшифровка, ВыполненноеДействие, ПараметрыВыполненногоДействия, ДоступныеДействия, ВозможныеРасшифровки);
		
		Если ВыполненноеДействие <> ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда 

			Отборы = Новый Соответствие;
			ДобавитьОтборы(Расшифровка, Неопределено, Отборы);
			
			ПараметрыРасшифровки = Новый Структура;
			ПараметрыРасшифровки.Вставить("АдресРасшифровки", ДанныеРасшифровки);
			ПараметрыРасшифровки.Вставить("Раздел", Отчет.Раздел);
			ПараметрыРасшифровки.Вставить("ДатаНачала", Отчет.ДатаНачала);
			ПараметрыРасшифровки.Вставить("ДатаОкончания", Отчет.ДатаОкончания);
			ПараметрыРасшифровки.Вставить("ПолеРасшифровки", ВыполненноеДействие);
			ПараметрыРасшифровки.Вставить("Отборы", Отборы);
			
			ПараметрыФормы = Новый Структура;		
			ПараметрыФормы.Вставить("РежимРасшифровки", Истина);			
			ПараметрыФормы.Вставить("ПараметрыРасшифровки", ПараметрыРасшифровки);			
			
			ОткрытьФорму("Отчет.ОстаткиИОбороты.ФормаОбъекта", ПараметрыФормы, , Истина);
			
		КонецЕсли;
		
	КонецЕсли; 		
	
КонецПроцедуры

&НаСервере
Функция ВозможныеРасшифровки(Расшифровка)

	КомпоновщикНастроек = КомпоновщикНастроек();	
	ВозможныеРасшифровки = СписокПолейРасшифровки(Расшифровка, КомпоновщикНастроек);

	Возврат ВозможныеРасшифровки;
	
КонецФункции

&НаСервере
Функция КомпоновщикНастроек()

	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиРасшифровки(ДанныеРасшифровки));
	КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);	

	Возврат КомпоновщикНастроек;
	
КонецФункции

&НаСервереБезКонтекста
Функция НастройкиРасшифровки(ДанныеРасшифровки)

	Возврат ПолучитьИзВременногоХранилища(ДанныеРасшифровки).Настройки;	

КонецФункции

&НаСервере
Функция СписокПолейРасшифровки(Расшифровка, КомпоновщикНастроек)
	
	СписокПолейРасшифровки = Новый СписокЗначений;
	
	Если ТипЗнч(Расшифровка) <> Тип("ИдентификаторРасшифровкиКомпоновкиДанных")
		И ТипЗнч(Расшифровка) <> Тип("ДанныеРасшифровкиКомпоновкиДанных") Тогда 
		Возврат СписокПолейРасшифровки;
	КонецЕсли;
	
	Для Каждого ПолеВыбора Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл 
		Если ТипЗнч(ПолеВыбора) = Тип("ДоступноеПолеКомпоновкиДанных") Тогда
			Если ПолеВыбора.Ресурс Или ПолеВыбора.Папка Тогда 
				Продолжить;
			КонецЕсли;
			
			Если Строка(ПолеВыбора.Поле) = "Период" Тогда 
				Продолжить;
			КонецЕсли;
			
			Отбор = Новый Структура("Использование, Поле", Истина, Строка(ПолеВыбора.Поле));
			Если Отчет.Группировка.НайтиСтроки(Отбор).Количество() = 0 Тогда 
				Если Строка(ПолеВыбора.Поле) = "Регистратор" Тогда
					СписокПолейРасшифровки.Добавить(ПолеВыбора.Поле, "По документам движения");
				Иначе 
					СписокПолейРасшифровки.Добавить(ПолеВыбора.Поле, ПолеВыбора.Заголовок);
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	
	СписокПолейРасшифровки.Добавить("По годам");
	СписокПолейРасшифровки.Добавить("По полугодиям");
	СписокПолейРасшифровки.Добавить("По кварталам");
	СписокПолейРасшифровки.Добавить("По месяцам");
	СписокПолейРасшифровки.Добавить("По декадам");
	СписокПолейРасшифровки.Добавить("По неделям");
	СписокПолейРасшифровки.Добавить("По дням");
	
	Возврат СписокПолейРасшифровки;
	
КонецФункции

&НаСервере
Процедура ДобавитьОтборы(Расшифровка, КомпоновщикНастроек, Отборы)
	
	Если КомпоновщикНастроек = Неопределено Тогда
		КомпоновщикНастроек = КомпоновщикНастроек();
	КонецЕсли; 	
	
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
		ДанныеРасшифровкиОтчета = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);	
		ЭлементРасшифровки = ДанныеРасшифровкиОтчета.Элементы.Получить(Расшифровка);		
	Иначе
		ЭлементРасшифровки = Расшифровка;
	КонецЕсли;	
	
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда 
		Для Каждого Поле Из ЭлементРасшифровки.ПолучитьПоля() Цикл 
			ДоступноеПоле = ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(Новый ПолеКомпоновкиДанных(Поле.Поле), КомпоновщикНастроек);
			Если ДоступноеПоле = Неопределено Или ДоступноеПоле.Ресурс Тогда 
				Продолжить;
			КонецЕсли;
			Отборы.Вставить(Поле.Поле, Поле.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Родитель Из ЭлементРасшифровки.ПолучитьРодителей() Цикл 
		ДобавитьОтборы(Родитель, КомпоновщикНастроек, Отборы);		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(ПолеКомпоновкиДанных, ОбластьПоиска)
	
	Если ТипЗнч(ПолеКомпоновкиДанных) = тип("Строка") Тогда 
		ПолеПоиска = Новый ПолеКомпоновкиДанных(ПолеКомпоновкиДанных);
	Иначе 
		ПолеПоиска = ПолеКомпоновкиДанных;
	КонецЕсли;
	
	Если ТипЗнч(ОбластьПоиска) = Тип("КомпоновщикНастроекКомпоновкиДанных")
		Или ТипЗнч(ОбластьПоиска) = Тип("ДанныеРасшифровкиКомпоновкиДанных")
		Или ТипЗнч(ОбластьПоиска) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда 
		Возврат ОбластьПоиска.Настройки.ДоступныеПоляВыбора.НайтиПоле(ПолеПоиска);
	Иначе 
		Возврат ОбластьПоиска.НайтиПоле(ПолеПоиска);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборПериода(Команда)
	ДиалогВыбораПериода = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогВыбораПериода.Период.ДатаНачала = Отчет.ДатаНачала;
	ДиалогВыбораПериода.Период.ДатаОкончания = Отчет.ДатаОкончания;
	ДиалогВыбораПериода.Период.Вариант = ВариантСтандартногоПериода.СНачалаЭтогоГода;
	Если ДиалогВыбораПериода.Редактировать() Тогда
		Отчет.ДатаНачала = ДиалогВыбораПериода.Период.ДатаНачала;
		Отчет.ДатаОкончания = ДиалогВыбораПериода.Период.ДатаОкончания;
	КонецЕсли; 

	УстановитьПериодНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СохранитьНастройкиРазделаНаСервере();
	СкомпоноватьРезультат();	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	Оповещение = Новый ОписаниеОповещения("ПриЗакрытииФормыНастройкиВарианта", ЭтаФорма);
	
	СохранитьПромежуточныеНастройки();
	ПараметрыОткрытия = Новый Структура("АдресПромежуточныхНастроек", АдресПромежуточныхНастроек);
	ПараметрыОткрытия.Вставить("Раздел", Отчет.Раздел);
	
	Если ЭтоВнешнийОтчет() Тогда
		ИмяФормыНастроек = "ВнешнийОтчет.ОстаткиИОбороты.ФормаВарианта";
	Иначе
		ИмяФормыНастроек = "Отчет.ОстаткиИОбороты.ФормаВарианта";		
	КонецЕсли; 
	
	ОткрытьФорму(ИмяФормыНастроек, ПараметрыОткрытия, ЭтаФорма, , , , Оповещение);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Сервис

&НаСервере
Функция ЗначениеПоляНаСервере(Расшифровка)
	Перем Результат;
	
	Если НЕ ЭтоАдресВременногоХранилища(ДанныеРасшифровки) Тогда
		Возврат Результат;		
	КонецЕсли; 
	
	ЗначенияРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Если ЗначенияРасшифровки = Неопределено Тогда
		Возврат Результат;		
	КонецЕсли; 
	
	ЭлемРасшифровки = ЗначенияРасшифровки.Элементы.Получить(Расшифровка);
	Если ЭлемРасшифровки = Неопределено Тогда
		Возврат Результат;		
	КонецЕсли; 
	ЗначенияПолей = ЭлемРасшифровки.ПолучитьПоля();
	Если НЕ ЗначениеЗаполнено(ЗначенияПолей) Тогда
		Возврат Результат;		
	КонецЕсли; 
	
	ЗначениеПоля = ЗначенияПолей[0].Значение;	
	Если НЕ ЗначениеЗаполнено(ЗначениеПоля) Тогда
		Возврат Результат;		
	КонецЕсли; 
	
	ТипЗначения = ТипЗнч(ЗначениеПоля);
	ЭтоПростойТип = ТипЗначения = Тип("Строка")
		ИЛИ ТипЗначения = Тип("Булево")
		ИЛИ ТипЗначения = Тип("Число")
		ИЛИ ТипЗначения = Тип("Дата");
	Если ЭтоПростойТип Тогда
		Возврат Результат;		
	КонецЕсли; 
	ЭтоТипПеречисления = Перечисления.ТипВсеСсылки().СодержитТип(ТипЗначения);
	Если ЭтоТипПеречисления Тогда
		Возврат Результат;		
	КонецЕсли; 
	
	Результат = ЗначениеПоля;
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЭтоВнешнийОтчет()	
	Возврат ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущийОбъект(), "ИспользуемоеИмяФайла");
	
КонецФункции 

&НаСервере
Функция ТекущийОбъект()
	
	Если мТекущийОбъектНаСервере = Неопределено Тогда
		мТекущийОбъектНаСервере = РеквизитФормыВЗначение("Отчет");
		
	КонецЕсли; 
	
	Возврат мТекущийОбъектНаСервере;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ОсновноеДействиеОбработкиРасшифровкиОткрытьЗначение(ДанныеРасшифровки, Расшифровка)

	ДанныеРасшифровкиОтчета = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	
	ТекущийЭлементРасшифровки = ДанныеРасшифровкиОтчета.Элементы.Получить(Расшифровка);	
	ПоляТекущейРасшифровки = ТекущийЭлементРасшифровки.ПолучитьПоля();	

	Возврат ПоляТекущейРасшифровки.Количество() = 1
		И ТекущийЭлементРасшифровки.ОсновноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение;
	
КонецФункции

#КонецОбласти 

#Область Диалог

&НаКлиенте
Процедура ПриЗакрытииФормыНастройкиВарианта(Результат, ДопПараметры) Экспорт
	
	Если Результат = Истина Тогда
		НастройкиКомпоновщика = ПолучитьИзВременногоХранилища(АдресПромежуточныхНастроек);
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновщика);	
		ВывестиПериодКомпоновщика(ЭтаФорма);
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	СинонимРаздела = "";
	Если ЗначениеЗаполнено(Отчет.Раздел) Тогда
		МетаРегистр = Метаданные.РегистрыНакопления.Найти(Отчет.Раздел);
		СинонимРаздела = МетаРегистр.Синоним;		
	КонецЕсли; 
	
	Заголовок = УправлениеОтчетами.СформироватьЗаголовокОсновнойФормы(Отчет.ДатаНачала
		, Отчет.ДатаОкончания
		, СинонимРаздела
		, 0);	
КонецПроцедуры

#КонецОбласти 

#Область ВызовСервера

&НаСервере
Процедура СохранитьПромежуточныеНастройки()
	
	АдресПромежуточныхНастроек = ПоместитьВоВременноеХранилище(Отчет.КомпоновщикНастроек.ПолучитьНастройки()
		, УникальныйИдентификатор);	
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиПериодКомпоновщика(Форма)
	ПараметрыДаных = Форма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	ПериодОтчета = ПараметрыДаных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	
	Форма.Отчет.ДатаНачала = ПериодОтчета.ДатаНачала;
	Форма.Отчет.ДатаОкончания = ПериодОтчета.ДатаОкончания;
КонецПроцедуры
 
&НаСервере
Процедура УстановитьПериодНаСервере()	
	ТекущийОбъект().УстановитьПериод(Отчет.КомпоновщикНастроек);
	СохранитьНастройкиРазделаНаСервере();
	УстановитьЗаголовокФормы();
КонецПроцедуры 

&НаСервере
Процедура СохранитьНастройкиРазделаНаСервере()
	ТекущийОбъект().СохранитьНастройкиРаздела(Отчет.КомпоновщикНастроек);
	
КонецПроцедуры 

&НаСервере
Процедура ИнициализироватьКомпоновщик()	
	ТекущийОбъект().ИнициализироватьКомпоновщик(Отчет.КомпоновщикНастроек, УникальныйИдентификатор);	
	
	ЗначениеВРеквизитФормы(ТекущийОбъект(), "Отчет");
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(ТекущийОбъект().СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияРасшифровкиПоНастройкам()
	
	ТекущийОбъект().ИнициализацияРасшифровкиПоНастройкам(ЭтаФорма.ПараметрыРасшифровки, УникальныйИдентификатор);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект(), "Отчет");
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(ТекущийОбъект().СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти

&НаКлиенте
Функция ИсключенныеПоля(Режим = "")
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	
	Если Режим = "Группировка" Тогда 
		СписокПолей.Добавить("Регистратор");
	КонецЕсли;
	
	Если Режим = "Отбор" Тогда 
		СписокПолей.Добавить("Периоды");
	КонецЕсли;
	
	Если Режим = "Порядок" Тогда 
		СписокПолей.Добавить("Периоды");
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеТипГруппировки()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='Без групп'"));
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ГруппировкаТипГруппировки");
	
	Элемент = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.Группировка.ТипГруппировки");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = 0;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='С группами'"));
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ГруппировкаТипГруппировки");
	
	Элемент = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.Группировка.ТипГруппировки");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = 1;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='Только группы'"));
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ГруппировкаТипГруппировки");
	
	Элемент = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.Группировка.ТипГруппировки");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = 2;
	
КонецПроцедуры

#Область Группировка

&НаКлиенте
Процедура ГруппировкаУстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Отчет.Группировка Цикл 
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаСнятьФлажки(Команда)

	Для Каждого СтрокаТаблицы Из Отчет.Группировка Цикл 
		СтрокаТаблицы.Использование = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
	ПараметрыФормы.Вставить("Режим", "Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ИсключенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока", Неопределено);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ГруппировкаПередНачаломДобавленияЗавершение", ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораДоступногоПоля", ПараметрыФормы, , , , , ОповещениеОЗакрытии);
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПередНачаломДобавленияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда 
		
		НоваяСтрока = Отчет.Группировка.Добавить();
		НоваяСтрока.Использование = Истина;
		НоваяСтрока.Поле = ПараметрыВыбранногоПоля.Поле;
		НоваяСтрока.Представление = ПараметрыВыбранногоПоля.Заголовок;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущийЭлемент = Элементы.ГруппировкаПредставление Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
		ПараметрыФормы.Вставить("Режим", "Группировка");
		ПараметрыФормы.Вставить("ИсключенныеПоля", ИсключенныеПоля("Группировка"));
		ПараметрыФормы.Вставить("ТекущаяСтрока", Элемент.ТекущиеДанные.Поле);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Элемент", Элемент);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ГруппировкаПередНачаломИзмененияЗавершение", ЭтаФорма, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.ФормаВыбораДоступногоПоля", ПараметрыФормы, , , , , ОповещениеОЗакрытии);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПередНачаломИзмененияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда 
		
		НоваяСтрока = Элемент.ТекущиеДанные;
		НоваяСтрока.Использование = Истина;
		НоваяСтрока.Поле = ПараметрыВыбранногоПоля.Поле;
		НоваяСтрока.Представление = ПараметрыВыбранногоПоля.Заголовок;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПоля

&НаКлиенте
Процедура ДополнительныеПоляУстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Отчет.ДополнительныеПоля Цикл 
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПоляСнятьФлажки(Команда)

	Для Каждого СтрокаТаблицы Из Отчет.ДополнительныеПоля Цикл 
		СтрокаТаблицы.Использование = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПоляПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
	ПараметрыФормы.Вставить("Режим", "Выбор");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ИсключенныеПоля("Выбор"));
	ПараметрыФормы.Вставить("ТекущаяСтрока", Неопределено);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДополнительныеПоляПередНачаломДобавленияЗавершение", ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораДоступногоПоля", ПараметрыФормы, , , , , ОповещениеОЗакрытии);
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПоляПередНачаломДобавленияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда 
		
		НоваяСтрока = Отчет.ДополнительныеПоля.Добавить();
		НоваяСтрока.Использование = Истина;
		НоваяСтрока.Поле = ПараметрыВыбранногоПоля.Поле;
		НоваяСтрока.Представление = ПараметрыВыбранногоПоля.Заголовок;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПоляПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущийЭлемент = Элементы.ДополнительныеПоляПредставление Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
		ПараметрыФормы.Вставить("Режим", "Выбор");
		ПараметрыФормы.Вставить("ИсключенныеПоля", ИсключенныеПоля("Выбор"));
		ПараметрыФормы.Вставить("ТекущаяСтрока", Элемент.ТекущиеДанные.Поле);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Элемент", Элемент);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДополнительныеПоляПередНачаломИзмененияЗавершение", ЭтаФорма, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.ФормаВыбораДоступногоПоля", ПараметрыФормы, , , , , ОповещениеОЗакрытии);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПоляПередНачаломИзмененияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда 
		
		НоваяСтрока = Элемент.ТекущиеДанные;
		НоваяСтрока.Использование = Истина;
		НоваяСтрока.Поле = ПараметрыВыбранногоПоля.Поле;
		НоваяСтрока.Представление = ПараметрыВыбранногоПоля.Заголовок;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Отбор

&НаКлиенте
Процедура ОтборыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
	ПараметрыФормы.Вставить("Режим", "Отбор");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ИсключенныеПоля("Отбор"));
	ПараметрыФормы.Вставить("ТекущаяСтрока", Неопределено);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОтборыПередНачаломДобавленияЗавершение", ЭтаФорма, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораДоступногоПоля", ПараметрыФормы, , , , , ОповещениеОЗакрытии);
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПередНачаломДобавленияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда 
		
		Если Элемент.ТекущаяСтрока = Неопределено Тогда 
			ТекущаяСтрока = Неопределено;
		Иначе 
			ТекущаяСтрока = Отчет.КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(Элемент.ТекущаяСтрока);
		КонецЕсли;
		
		Если ТипЗнч(ТекущаяСтрока) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда 
			ЭлементОтбора = ТекущаяСтрока.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ИначеЕсли ТипЗнч(ТекущаяСтрока) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда 
			Если ТекущаяСтрока.Родитель <> Неопределено Тогда 
				ЭлементОтбора = ТекущаяСтрока.Родитель.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Иначе 
				ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			КонецЕсли;
		Иначе 
			ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		КонецЕсли;
		
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПараметрыВыбранногоПоля.Поле);
		ЭлементОтбора.ВидСравнения = ПараметрыВыбранногоПоля.ВидСравнения;
		
		Элемент.ТекущаяСтрока = Отчет.КомпоновщикНастроек.Настройки.Отбор.ПолучитьИдентификаторПоОбъекту(ЭлементОтбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПередНачаломИзменения(Элемент, Отказ)
	
	Если (Найти(Элемент.ТекущийЭлемент.Имя, "ОтборыЛевоеЗначение") > 0 И ТипЗнч(Элемент.ТекущиеДанные.ЛевоеЗначение) = Тип("ПолеКомпоновкиДанных")) Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
		ПараметрыФормы.Вставить("Режим", "Отбор");
		ПараметрыФормы.Вставить("ИсключенныеПоля", ИсключенныеПоля("Отбор"));
		ПараметрыФормы.Вставить("ТекущаяСтрока", Элемент.ТекущиеДанные.ЛевоеЗначение);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Элемент", Элемент);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОтборыПередНачаломИзмененияЗавершение", ЭтаФорма, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.ФормаВыбораДоступногоПоля", ПараметрыФормы, , , , , ОповещениеОЗакрытии);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПередНачаломИзмененияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда 
		
		ТекущаяСтрока = Отчет.КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(Элемент.ТекущаяСтрока);
		
		Если Найти(Элемент.ТекущийЭлемент.Имя, "ОтборыЛевоеЗначение") > 0 Тогда 
			ТекущаяСтрока.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПараметрыВыбранногоПоля.Поле);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Сортировка

&НаКлиенте
Процедура СортировкаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
	ПараметрыФормы.Вставить("Режим", "Порядок");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ИсключенныеПоля("Порядок"));
	ПараметрыФормы.Вставить("ТекущаяСтрока", Неопределено);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("СортировкаПередНачаломДобавленияЗавершение", ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораДоступногоПоля", ПараметрыФормы, , , , , ОповещениеОЗакрытии);
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПередНачаломДобавленияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда 
		
		НоваяСтрока = Отчет.КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		НоваяСтрока.Использование = Истина;
		НоваяСтрока.Поле = Новый ПолеКомпоновкиДанных(ПараметрыВыбранногоПоля.Поле);
		НоваяСтрока.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПередНачаломИзменения(Элемент, Отказ)
	
	Если Найти(Элемент.ТекущийЭлемент.Имя, "СортировкаПоле") = 1 Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
		ПараметрыФормы.Вставить("Режим", "Порядок");
		ПараметрыФормы.Вставить("ИсключенныеПоля", ИсключенныеПоля("Порядок"));
		ПараметрыФормы.Вставить("ТекущаяСтрока", Элемент.ТекущиеДанные.Поле);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Элемент", Элемент);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("СортировкаПередНачаломИзмененияЗавершение", ЭтаФорма, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.ФормаВыбораДоступногоПоля", ПараметрыФормы, , , , , ОповещениеОЗакрытии);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПередНачаломИзмененияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда 
		
		РедактируемаяСтрока = Отчет.КомпоновщикНастроек.Настройки.Порядок.ПолучитьОбъектПоИдентификатору(Элемент.ТекущаяСтрока);
		
		РедактируемаяСтрока.Использование = Истина;
		РедактируемаяСтрока.Поле = Новый ПолеКомпоновкиДанных(ПараметрыВыбранногоПоля.Поле);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Показатели

&НаКлиенте
Процедура ПоказателиУстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Отчет.Показатели Цикл 
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиСнятьФлажки(Команда)

	Для Каждого СтрокаТаблицы Из Отчет.Показатели Цикл 
		СтрокаТаблицы.Использование = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеВосстановлениеПользовательскихНастроек

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	ОтчетОбъект = ТекущийОбъект();
	ОтчетМетаданные = ОтчетОбъект.Метаданные();
	
	ТекущиеНастройки = ОтчетОбъект.КомпоновщикНастроек.Настройки;
	
	// очистка пользовательских настроек
	ТекущиеНастройки.Отбор.ИдентификаторПользовательскойНастройки = "";
	ТекущиеНастройки.Порядок.ИдентификаторПользовательскойНастройки = "";
	ТекущиеНастройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "";
	
	// установка пользовательских настроек
	ТекущиеНастройки.Отбор.ИдентификаторПользовательскойНастройки = "Отбор";
	ТекущиеНастройки.Порядок.ИдентификаторПользовательскойНастройки = "Порядок";
	ТекущиеНастройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "УсловноеОформление";
	
	ДополнительныеСвойства = Новый Структура;
	Для Каждого Реквизит Из ОтчетМетаданные.Реквизиты Цикл 	
		ДополнительныеСвойства.Вставить(Реквизит.Имя, ОтчетОбъект[Реквизит.Имя]);
	КонецЦикла;
	
	Для Каждого ТабличнаяЧасть Из ОтчетМетаданные.ТабличныеЧасти Цикл 
		ДополнительныеСвойства.Вставить(ТабличнаяЧасть.Имя, ОтчетОбъект[ТабличнаяЧасть.Имя].Выгрузить());
	КонецЦикла;
	
	Настройки.ДополнительныеСвойства.Вставить("ДанныеОтчета", Новый ХранилищеЗначения(ДополнительныеСвойства));
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	
	Если Настройки <> Неопределено Тогда 
		
		Если Настройки.ДополнительныеСвойства.Свойство("ДанныеОтчета") Тогда 
			
			ДополнительныеСвойства = Настройки.ДополнительныеСвойства.ДанныеОтчета.Получить();
			
			Если ДополнительныеСвойства.Свойство("Раздел") Тогда 					
				Если ДополнительныеСвойства.Раздел <> ПредыдущийРаздел Тогда
					Отчет.Раздел = ДополнительныеСвойства.Раздел;
					ИнициализироватьКомпоновщик();
					ПредыдущийРаздел = Отчет.Раздел;						
					УстановитьЗаголовокФормы();						
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого ЭлементСтруктуры Из ДополнительныеСвойства Цикл 
				Если Отчет.Свойство(ЭлементСтруктуры.Ключ) Тогда 
					
					Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда 
						Отчет[ЭлементСтруктуры.Ключ].Очистить();
						Для Каждого СтрокаТаблицы Из ЭлементСтруктуры.Значение Цикл 
							ЗаполнитьЗначенияСвойств(Отчет[ЭлементСтруктуры.Ключ].Добавить(), СтрокаТаблицы);
						КонецЦикла;						
					Иначе 
						Отчет[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
					КонецЕсли;
					
				КонецЕсли;				
			КонецЦикла;
			
		КонецЕсли;
		
		ТекущиеНастройки = Отчет.КомпоновщикНастроек.Настройки;
		
		// установка пользовательских настроек
		ТекущиеНастройки.Отбор.ИдентификаторПользовательскойНастройки = "Отбор";
		ТекущиеНастройки.Порядок.ИдентификаторПользовательскойНастройки = "Порядок";
		ТекущиеНастройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "УсловноеОформление";
		
		// перенос пользовательских настроек в основные
		Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Настройки);
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчет.КомпоновщикНастроек.ПолучитьНастройки());
		
		// очистка пользовательских настроек
		ТекущиеНастройки = Отчет.КомпоновщикНастроек.Настройки;
		ТекущиеНастройки.Отбор.ИдентификаторПользовательскойНастройки = "";
		ТекущиеНастройки.Порядок.ИдентификаторПользовательскойНастройки = "";
		ТекущиеНастройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтандартныеНастройки(Команда)
	
	УстановитьСтандартныеНастройкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтандартныеНастройкиНаСервере()
	
	ТекущийОбъект().УстановитьСтандартныеНастройкиОтчета(Отчет.КомпоновщикНастроек);
	ЗначениеВРеквизитФормы(ТекущийОбъект(), "Отчет");
	
КонецПроцедуры

#КонецОбласти
