
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолучитьСписокКотировок();
	
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Отчет.Котировка) Тогда
	
		Отчет.Котировка = Элементы.Котировка.СписокВыбора[0].Значение;
			
	КонецЕсли; 
	
	// заполним период по умолчанию
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Отчет.ДатаОтчета)  Тогда
		
		Отчет.ДатаОтчета	=	ТекущаяДата();
		СформироватьЗаголовокФормы(ЭтаФорма);
			
	КонецЕсли; 
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	СформироватьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Отчет.ДатаОтчета) Тогда 
 		Сообщить("Не выбрана дата формирования отчета.");
	Иначе
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьЗаголовокФормы(Форма)
	
		Заголовок 	= "Информация о ЦБ на" +" (" + Формат(Форма.Отчет.ДатаОтчета,"ДЛФ=DD") + ") " ;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	РеквизитФормыВЗначение("Отчет").СформироватьОтчет(ТабличныйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура  ПолучитьСписокКотировок()

	спКотировки = Элементы.Котировка.СписокВыбора;  
	
	Для каждого Ресурс Из Метаданные.РегистрыСведений.Котировки.Ресурсы Цикл
	
		спКотировки.Добавить(Ресурс.Имя, Ресурс.Синоним);
	
	КонецЦикла; 
	
		
КонецПроцедуры

//#КонецОбласти
	

