#Область ОписаниеПеременных

Перем QUIK Экспорт;

#КонецОбласти


#Область ПрограммныйИнтерфейс

Процедура ИнициироватьСоединение(Параметры = Неопределено) Экспорт
	ВнешниеДанные.ИнициироватьСоединение(QUIK, "QUIK", Параметры);
КонецПроцедуры

Процедура ЗагрузитьНеторговыеПоручения() Экспорт
	
	Попытка
		НачатьТранзакцию();
		
		Если ФормироватьСводныеПоручения Тогда
			СформироватьСводныеПоручения();
		КонецЕсли;
		
		Для Каждого Строка Из ДанныеДляПоручений Цикл
			ЭтоСтрокаСводногоПоручения = ФормироватьСводныеПоручения И ЗначениеЗаполнено(Строка.ИД_Брокера);
			Если Не Строка.Загружать Или ЭтоСтрокаСводногоПоручения Тогда
				Продолжить;
			КонецЕсли;
			СформироватьПоручение(Строка);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось загрузить 'Поручения клиентов':
											|
											|" + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПолучитьТаблицуПорученийЗаПериод(НачалоПериода, КонецПериода) Экспорт
	Если ИсточникЗагрузки = Перечисления.ИсточникиЗагрузки.QUIK Тогда
		Если QUIK = Неопределено Тогда
			ИнициироватьСоединение();
		КонецЕсли;
		НеторговыеПоручения = QUIK.НеторговыеПорученияЗаПериод(НачалоПериода, КонецПериода);
		КонвертироватьТаблицуADOвДанные1С(НеторговыеПоручения);
	ИначеЕсли ИсточникЗагрузки = Перечисления.ИсточникиЗагрузки.Панда Тогда
		НеторговыеПоручения = ОбработкаНеторговыхПорученийИзПандаВызовСервера.ДанныеНеторговыхПоручений(НачалоПериода, КонецПериода, Контрагент);
		КонвертироватьДанныеПандаВДанные1С(НеторговыеПоручения);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьНедостающегоПоставщика(Данные) Экспорт
	КодДепонента = Данные.ID;
	ИмяДепонента = Данные.CP;
	Если Не ЗначениеЗаполнено(КодДепонента) Тогда
		Возврат;
	КонецЕсли;
	
	СпрДепонентов = Справочники.Контрагенты;
	СпрСчетовДепо = Справочники.СчетаДепо;
	СпрРазделовСчетовДепо = Справочники.РазделыСчетаДепо;
	
	// Если не заполнен счет Депо, то создадим его, но перед этим попробуем найти Депонента, если и его нет, то создадим и его
	Если Не ЗначениеЗаполнено(Данные.СчетДепоКонтрагента) Тогда
		РодительДляНовыхДепонентов	= СпрДепонентов.ГруппаКонтрагенты();
		Депонент					= СпрДепонентов.НайтиПоКоду(КодДепонента);
		
		Если Депонент = Неопределено ИЛИ Депонент = СпрДепонентов.ПустаяСсылка() Тогда
			НовыйДепонент	= СпрДепонентов.СоздатьЭлемент();
			
			НовыйДепонент.Код					= КодДепонента;
			НовыйДепонент.Наименование			= ИмяДепонента;
			НовыйДепонент.НаименованиеПолное	= ИмяДепонента;
			НовыйДепонент.ЮрФизЛицо				= Перечисления.ЮрФизЛицо.ЮрЛицо;
			НовыйДепонент.Родитель				= РодительДляНовыхДепонентов;
			НовыйДепонент.Контрагент			= Истина;
			
			НовыйДепонент.Записать();
			
			Депонент	= НовыйДепонент.Ссылка;
		КонецЕсли;
		
		НомерСчетаДепо = Данные.DepoCP;
		ЗаполненКодСчетаДепоКлиентаКонтрагента = ЗначениеЗаполнено(Данные.DepoCPClient);
		Если ЗаполненКодСчетаДепоКлиентаКонтрагента Тогда
			КодСчетаДепо = КодСчетаДепоПоКодуСчетаКлиентаКонтрагента(Данные.DepoCPClient, Данные.DepoCP);
			Данные.СчетДепоКонтрагента = Справочники.СчетаДепо.НайтиПоКоду(КодСчетаДепо, , , Депонент);
		Иначе
			Данные.СчетДепоКонтрагента = ПодобратьСчетДепо(Депонент, НомерСчетаДепо);
			КодСчетаДепо = Данные.DepoCP;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Данные.СчетДепоКонтрагента) Тогда
			НовыйСчетДепо	= СпрСчетовДепо.СоздатьЭлемент();
			
			НовыйСчетДепо.Владелец						= Депонент;
			НовыйСчетДепо.Код							= КодСчетаДепо;
			НовыйСчетДепо.Наименование					= НомерСчетаДепо;
			НовыйСчетДепо.СчетВМестеРасчетовНомерСчета	= НомерСчетаДепо;
			НовыйСчетДепо.ТипСчетаДепо					= Перечисления.ТипыСчетовДепо.НоминальногоДержателя;
			НовыйСчетДепо.ПризнакСчетаДепо				= Перечисления.ПризнакиСчетаДепо.СчетКонтрагента;
			НовыйСчетДепо.ВидСчетаДепо					= Перечисления.ВидыСчетовДепо.СчетДЕПО;
			
			НовыйСчетДепо.СчетВМестеРасчетовНомерСчетаКлиента = Данные.DepoCPClient;
			НовыйСчетДепо.СчетВМестеРасчетовНаименованиеКлиента = Данные.ClientName;
			
			НовыйСчетДепо.Записать();
			
			Данные.СчетДепоКонтрагента	= НовыйСчетДепо.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	// Если не заполнен Раздел счета Депо, то создадим его на основании счета Депо
	КодРазделаСчетаДепо = Данные.SubDepoCP;
	Если Не ЗначениеЗаполнено(КодРазделаСчетаДепо) Тогда
		Возврат;
	КонецЕсли;
	Данные.РазделСчетаДепоКонтрагента = СпрРазделовСчетовДепо.НайтиПоКоду(КодРазделаСчетаДепо, , , Данные.СчетДепоКонтрагента);
	
	Если Не ЗначениеЗаполнено(Данные.РазделСчетаДепоКонтрагента) Тогда
		НовыйРазделСчетаДепо	= СпрРазделовСчетовДепо.СоздатьЭлемент();
		НовыйРазделСчетаДепо.Владелец		= Данные.СчетДепоКонтрагента;
		НовыйРазделСчетаДепо.Код			= КодРазделаСчетаДепо;
		НовыйРазделСчетаДепо.Наименование	= КодРазделаСчетаДепо;
		НовыйразделСчетаДепо.Записать();
		
		Данные.РазделСчетаДепоКонтрагента	= НовыйРазделСчетаДепо.Ссылка;
	Иначе
		Если Данные.НаименованиеМестаРасчетов = "Депозитарий БКП" Тогда
			Данные.МХКонтрагент = МХКонтрагентаПоРазделу(Данные.РазделСчетаДепоКонтрагента);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьПоставщикаВПоручениях() Экспорт
	Для Каждого Данные Из ДанныеДляПоручений Цикл
		Если Не Данные.Загружать ИЛИ Не ЭтоОперацияДепонирования(Данные.ВидОперации) Тогда
			Продолжить;
		КонецЕсли;	
		Если ЗначениеЗаполнено(Данные.DepoCP) И Не ЗначениеЗаполнено(Данные.СчетДепоКонтрагента) Тогда
			Данные.СчетДепоКонтрагента = Справочники.СчетаДепо.НайтиПоКоду(Данные.DepoCP);
		КонецЕсли;
		Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента) И ЗначениеЗаполнено(Данные.SubDepoCP)
				И Не ЗначениеЗаполнено(Данные.РазделСчетаДепоКонтрагента) Тогда
			Данные.РазделСчетаДепоКонтрагента = Справочники.РазделыСчетаДепо.НайтиПоКоду(Данные.SubDepoCP, , ,
				Данные.СчетДепоКонтрагента);
		КонецЕсли;	
		Если (ЗначениеЗаполнено(Данные.DepoCP) И Не ЗначениеЗаполнено(Данные.СчетДепоКонтрагента))
			ИЛИ (ЗначениеЗаполнено(Данные.SubDepoCP) И Не ЗначениеЗаполнено(Данные.РазделСчетаДепоКонтрагента)) Тогда
			СоздатьНедостающегоПоставщика(Данные);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Функция ПодобратьСчетДепо(Депонент, НомерСчетаДепо) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетаДепо.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СчетаДепо КАК СчетаДепо
	|ГДЕ
	|	СчетаДепо.Владелец = &Депонент
	|	И СчетаДепо.Наименование = &НомерСчетаДепо
	|	И НЕ СчетаДепо.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Депонент", Депонент);
	Запрос.УстановитьПараметр("НомерСчетаДепо", НомерСчетаДепо);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.СчетаДепо.НайтиПоКоду(НомерСчетаДепо, , , Депонент);
	КонецЕсли;
КонецФункции

Функция КодСчетаДепоПоКодуСчетаКлиентаКонтрагента(КодСчетаДепоКлиентаКонтрагента, КодСчетаДепо) Экспорт
	ДлинаКодаСчетовДепо = Метаданные.Справочники.СчетаДепо.ДлинаКода;
	Возврат Лев(КодСчетаДепоКлиентаКонтрагента + Лев(КодСчетаДепо, 4), ДлинаКодаСчетовДепо);
КонецФункции

Функция МХКонтрагентаПоРазделу(РазделСчетаДепоКонтрагента) Экспорт
	Если Не ЗначениеЗаполнено(РазделСчетаДепоКонтрагента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	ПолучаемыеПоля = Новый Структура("МХКонтрагент", "РазделСчетаДепоМХ.Владелец.Владелец");
	РеквизитыРаздела = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РазделСчетаДепоКонтрагента, ПолучаемыеПоля); 
	Возврат РеквизитыРаздела.МХКонтрагент;
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура СформироватьПоручение(Данные)
	
	Если Не ЗначениеЗаполнено(Данные.Поручение) Тогда
		Поручение = Документы.Поручение.СоздатьДокумент();
	Иначе
		Поручение = Данные.Поручение.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьПоручение(Поручение, Данные);
	
	Поручение.ЦенныеБумагиСписываемые.Очистить();
	НоваяСтрокаЦБ = Поручение.ЦенныеБумагиСписываемые.Добавить();
	НоваяСтрокаЦБ.ЦеннаяБумага = Данные.ЦеннаяБумага;
	НоваяСтрокаЦБ.Количество = Данные.КоличествоЦБ;
	НоваяСтрокаЦБ.ИдентификаторЗагрузки = Данные.НомерПоручения;
	
	
	НачатьТранзакцию();
	Попытка
		Поручение.Записать(РежимЗаписиДокумента.Запись);
		ЗаписатьРезультатОбработкиВходящегоСообщения(Поручение.KafkaMessageId);
		Если ИсточникЗагрузки = Перечисления.ИсточникиЗагрузки.Панда Тогда
			ОтправитьСтатусОбрабатываетсяВПанда(Поручение.Ссылка);
		КонецЕсли;
		Данные.Поручение	= Поручение.Ссылка;
		Данные.Загружать	= Ложь;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстСообщения = "Поручение №" + СокрЛП(Поручение.Номер) + " от " + Поручение.Дата + " не удалось записать "
						+ "по причине: " + ОписаниеОшибки();
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

Функция РеференсИзКомментария(Комментарий)
	
	Референс = "";
	ПозицияReference = Найти(Комментарий, "Референс:");
	Если ПозицияReference > 0 Тогда
	
		Референс = Прав(Комментарий, СтрДлина(Комментарий) -ПозицияReference - 9);
		
		ПозицияТочка = Найти(Референс, ".");
		
		Если ПозицияТочка > 0 Тогда
		
			Референс = СокрЛП(Лев(Референс, ПозицияТочка - 1));
		
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Референс;
	
КонецФункции

Процедура ДозаполнитьДанныеПоручений()
	ОрганизацияПоУмолчанию = ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию();
	МестоХраненияПоУмолчанию = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияПоУмолчанию");
	
	Для Каждого Данные Из ДанныеДляПоручений Цикл
			Данные.Инициатор = Данные.ДОтправитель;
		Если Данные.НаименованиеМестаРасчетов = "Депозитарий БКП" Тогда
			РазделСчетаДепо = ?(ЗначениеЗаполнено(Данные.РCДПолучатель), Данные.РCДПолучатель, Данные.РазделСчетаДепоКонтрагента);
			Данные.МХКонтрагент = МХКонтрагентаПоРазделу(РазделСчетаДепо);
		КонецЕсли;
	КонецЦикла;
	
	ПустаяЦБ = Новый Структура("ЦеннаяБумага", Справочники.ЦенныеБумаги.ПустаяСсылка());
	СтрокиСНезаполненнойЦБ = ДанныеДляПоручений.НайтиСтроки(ПустаяЦБ);
	Для Каждого Строка Из СтрокиСНезаполненнойЦБ Цикл
		Если Строка.ВидОперации <> Справочники.ВидыОпераций.Депонирование Тогда
			Строка.ЦеннаяБумага = ПодобратьЦеннуюБумагуПоОстаткам(Строка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура КонвертироватьТаблицуADOвДанные1С(ТЗ)
	
	ДанныеДляПоручений.Очистить();
	Запрос = Новый Запрос(ТекстЗапросаПоПоручениям());
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ИндексЗапросаКонтрольРеквизитов = РезультатЗапроса.Количество() - 2;
	ИндексЗапросаСИтоговымиДанными = РезультатЗапроса.Количество() - 1;
	
	СводныеПорученияСРазличающимисяРеквизитами = РезультатЗапроса[ИндексЗапросаКонтрольРеквизитов].Выбрать();
	Если СводныеПорученияСРазличающимисяРеквизитами.Количество() > 0 Тогда
		ОповеститьОРазличающихсяРеквизитах(СводныеПорученияСРазличающимисяРеквизитами);
	КонецЕсли;
	
	ДанныеДляПоручений.Загрузить(РезультатЗапроса[ИндексЗапросаСИтоговымиДанными].Выгрузить());
	ДозаполнитьДанныеПоручений();
	
КонецПроцедуры

Функция ТекстЗапросаПоПоручениям()
	
	Возврат
	"ВЫБРАТЬ
	|	КодыЗагрузки.Владелец КАК МестоХранения,
	|	МАКСИМУМ(КодыЗагрузки.Код) КАК Наименование
	|ПОМЕСТИТЬ МестаХраненияПоНаименованиюПанда
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	КодыЗагрузки.Владелец ССЫЛКА Справочник.МестаХранения
	|	И КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.КодыМестХраненияИзПанда)
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	КодыЗагрузки.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТЗ.ТипОперации = ""Депонирование""
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Депонирование)
	|		КОГДА ТЗ.ТипОперации = ""СнятиеСДепонирования""
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СнятиеСДепонирования)
	|		КОГДА ТЗ.ТипОперации = ""Перевод""
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|	КОНЕЦ КАК ВидОперации,
	|	ТЗ.НомерПоручения КАК НомерПоручения,
	|	ТЗ.НомерПлатежа КАК НомерПлатежа,
	|	ТЗ.CurrencyCode КАК CurrencyCode,
	|	ТЗ.ИДФирмы КАК ИДФирмы,
	|	ТЗ.ИДКлиента КАК ИДКлиента,
	|	ТЗ.ИДКлиентаПолучателя КАК ИДКлиентаПолучателя,
	|	ТЗ.ИДКлиентаСубброкер КАК ИДКлиентаСубброкер,
	|	ТЗ.ИДКлиентаПолучателяСубброкер КАК ИДКлиентаПолучателяСубброкер,
	|	ВЫБОР
	|		КОГДА ТЗ.Состояние = 0
	|			ТОГДА ""Активно""
	|		КОГДА ТЗ.Состояние = 1
	|			ТОГДА ""Исполнено""
	|		КОГДА ТЗ.Состояние = 2
	|			ТОГДА ""Снято""
	|		КОГДА ТЗ.Состояние = 3
	|			ТОГДА ""Срок действия истек""
	|		КОГДА ТЗ.Состояние = 4
	|			ТОГДА ""Запрос на отмену""
	|	КОНЕЦ КАК Состояние,
	|	ТЗ.ДатаИсполнения КАК ДатаИсполнения,
	|	ТЗ.ДатаРегистрации КАК ДатаРегистрации,
	|	ТЗ.СчетСписанияД КАК СчетСписанияД,
	|	ТЗ.СчетЗачисленияД КАК СчетЗачисленияД,
	|	ТЗ.Счет КАК Счет,
	|	ТЗ.СчетПриемник КАК СчетПриемник,
	|	ТЗ.UID КАК UID,
	|	ТЗ.SecCode КАК SecCode,
	|	ТЗ.Биржа КАК Биржа,
	|	ТЗ.CommentDeny КАК CommentDeny,
	|	ТЗ.DocComment КАК DocComment,
	|	ТЗ.ТипДеятельности КАК ТипДеятельности,
	|	ТЗ.Объем КАК Объем,
	|	ТЗ.ExtID КАК ExtID,
	|	ТЗ.ID КАК ID,
	|	ТЗ.CP КАК CP,
	|	ТЗ.DepoCP КАК DepoCP,
	|	ТЗ.SubDepoCP КАК SubDepoCP,
	|	ТЗ.PayDate КАК PayDate,
	|	ТЗ.DealDate КАК DealDate,
	|	ТЗ.НаименованиеМестаРасчетов КАК НаименованиеМестаРасчетов,
	|	ТЗ.НаименованиеКлиента КАК НаименованиеКлиента,
	|	ТЗ.СчетДепоКлиентаКонтрагента КАК СчетДепоКлиентаКонтрагента,
	|	ТЗ.Референс КАК Референс,
	|	ТЗ.ДатаСоздания КАК ДатаСоздания
	|ПОМЕСТИТЬ ТД_ADO
	|ИЗ
	|	&ТЗ КАК ТЗ
	|ГДЕ
	|	НЕ(ТЗ.ТипОперации = ""Перевод""
	|				И ТЗ.СчетСписанияД = ТЗ.СчетЗачисленияД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТД_ADO.DepoCP КАК DepoCP,
	|	ТД_ADO.ID КАК ID,
	|	МАКСИМУМ(СчетаДепо.Ссылка) КАК СчетДепо
	|ПОМЕСТИТЬ СчетаДепоКонтрагентов
	|ИЗ
	|	ТД_ADO КАК ТД_ADO
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
	|		ПО ТД_ADO.DepoCP = СчетаДепо.Наименование
	|			И ТД_ADO.ID = СчетаДепо.Владелец.Код
	|			И (ТД_ADO.СчетДепоКлиентаКонтрагента = СчетаДепо.СчетВМестеРасчетовНомерСчетаКлиента
	|				ИЛИ ТД_ADO.СчетДепоКлиентаКонтрагента = """")
	|			И (СчетаДепо.ПометкаУдаления = ЛОЖЬ)
	|ГДЕ
	|	ТД_ADO.DepoCP <> """"
	|	И ТД_ADO.ID <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ТД_ADO.DepoCP,
	|	ТД_ADO.ID
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетаДепо.Ссылка) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТД_ADO.SecCode КАК Код,
	|	МАКСИМУМ(КодыЦБ.Владелец) КАК ЦеннаяБумага
	|ПОМЕСТИТЬ ЦБПоКодамЗагрузки
	|ИЗ
	|	ТД_ADO КАК ТД_ADO
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЦБ
	|		ПО ТД_ADO.SecCode = КодыЦБ.Код
	|			И (ТД_ADO.SecCode <> """")
	|			И (НЕ КодыЦБ.ПометкаУдаления)
	|			И (КодыЦБ.Владелец ССЫЛКА Справочник.ЦенныеБумаги)
	|			И (КодыЦБ.Биржа ССЫЛКА Справочник.Биржи
	|				ИЛИ КодыЦБ.Биржа ССЫЛКА Справочник.КлассификаторыЗагрузки)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТД_ADO.SecCode
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодыЦБ.Владелец) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТД_ADO.ExtID КАК ИД_Брокера,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ВидОперации) КАК ВидОперации,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.НомерПлатежа) КАК НомерПлатежа,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.CurrencyCode) КАК Валюта,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ИДФирмы) КАК ИДФирмы,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ИДКлиента) КАК ИДКлиента,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ИДКлиентаПолучателя) КАК ИДКлиентаПолучателя,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ИДКлиентаСубброкер) КАК ИДКлиентаСубброкер,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ИДКлиентаПолучателяСубброкер) КАК ИДКлиентаПолучателяСубброкер,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.СчетСписанияД) КАК СчетСписанияД,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.СчетЗачисленияД) КАК СчетЗачисленияД,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.Счет) КАК Счет,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.СчетПриемник) КАК СчетПриемник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.UID) КАК UID,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.Биржа) КАК Биржа,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.DocComment) КАК Комментарий,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ТипДеятельности) КАК ТипДеятельности,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ID) КАК ID,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.CP) КАК CP,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.DepoCP) КАК DepoCP,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.SubDepoCP) КАК SubDepoCP,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.PayDate) КАК PayDate,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.DealDate) КАК DealDate
	|ИЗ
	|	ТД_ADO КАК ТД_ADO
	|ГДЕ
	|	ТД_ADO.ExtID <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ТД_ADO.ExtID
	|
	|ИМЕЮЩИЕ
	|	(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ВидОперации) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.НомерПлатежа) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.CurrencyCode) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ИДФирмы) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ИДКлиента) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ИДКлиентаПолучателя) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ИДКлиентаСубброкер) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ИДКлиентаПолучателяСубброкер) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.СчетСписанияД) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.СчетЗачисленияД) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.Счет) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.СчетПриемник) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.UID) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.Биржа) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.DocComment) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ТипДеятельности) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.ID) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.CP) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.DepoCP) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.SubDepoCP) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.PayDate) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТД_ADO.DealDate) > 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ПорученияЦенныеБумаги.Ссылка ЕСТЬ NULL
	|				И НЕ РазделыССД.Ссылка ЕСТЬ NULL
	|				И ТД_ADO.Счет <> """"
	|				И ТД_ADO.Состояние <> ""Снято""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Загружать,
	|	ТД_ADO.ВидОперации КАК ВидОперации,
	|	ТД_ADO.НомерПоручения КАК НомерПоручения,
	|	ТД_ADO.НомерПлатежа КАК НомерПлатежа,
	|	Валюты.Ссылка КАК Валюта,
	|	ТД_ADO.ИДКлиента КАК КодДО,
	|	ЕСТЬNULL(КодыДепонентовОтправителей.Владелец, ДоговорыОтправителейСубброкер.Владелец) КАК ДОтправитель,
	|	ТД_ADO.ИДКлиентаПолучателя КАК КодДП,
	|	ЕСТЬNULL(КодыДепонентовПолучателей.Владелец, ДоговорыПолучателейСубброкер.Владелец) КАК ДПолучатель,
	|	ТД_ADO.Состояние КАК Состояние,
	|	ТД_ADO.ДатаИсполнения КАК ДатаИсполнения,
	|	ТД_ADO.ДатаРегистрации КАК ДатаРегистрации,
	|	ТД_ADO.СчетСписанияД КАК РСДОтправительКод,
	|	РазделыССД.Ссылка КАК РСДОтправитель,
	|	ТД_ADO.СчетЗачисленияД КАК РCДПолучательКод,
	|	РазделыСЗД.Ссылка КАК РCДПолучатель,
	|	РазделыССД.Ссылка.РазделСчетаДепоМХ КАК СчетРазделДЕПО,
	|	ТД_ADO.Счет КАК Счет,
	|	ТД_ADO.СчетПриемник КАК СчетПриемник,
	|	ТД_ADO.UID КАК УидПользователя,
	|	ТД_ADO.SecCode КАК КодЦБ,
	|	ЦБПоКодамЗагрузки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ТД_ADO.Биржа КАК Биржа,
	|	ТД_ADO.CommentDeny КАК ОснованиеОтказа,
	|	ТД_ADO.DocComment КАК Комментарий,
	|	ТД_ADO.ТипДеятельности КАК ТипДеятельности,
	|	ТД_ADO.Объем КАК КоличествоЦБ,
	|	ТД_ADO.ExtID КАК ИД_Брокера,
	|	ТД_ADO.ID КАК ID,
	|	ТД_ADO.CP КАК CP,
	|	ТД_ADO.DepoCP КАК DepoCP,
	|	СчетаДепоКонтрагентов.СчетДепо КАК СчетДепо,
	|	ТД_ADO.SubDepoCP КАК SubDepoCP,
	|	РСчетаДепо.Ссылка КАК РазделСчетаДепоКонтрагента,
	|	ПорученияЦенныеБумаги.Ссылка КАК Поручение,
	|	ТД_ADO.PayDate КАК PayDate,
	|	ТД_ADO.DealDate КАК DealDate,
	|	ТД_ADO.НаименованиеМестаРасчетов КАК НаименованиеМестаРасчетов,
	|	МестаХраненияПоНаименованиюПанда.МестоХранения КАК МХКонтрагент,
	|	ТД_ADO.НаименованиеКлиента КАК ClientName,
	|	ТД_ADO.Референс КАК Референс,
	|	ТД_ADO.ДатаСоздания КАК ДатаСоздания,
	|	ТД_ADO.СчетДепоКлиентаКонтрагента КАК DepoCPClient
	|ИЗ
	|	ТД_ADO КАК ТД_ADO
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ТД_ADO.CurrencyCode = Валюты.Наименование
	|			И (Валюты.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыДепонентовОтправителей
	|		ПО ТД_ADO.ИДКлиента = КодыДепонентовОтправителей.Код
	|			И (КодыДепонентовОтправителей.ПометкаУдаления = ЛОЖЬ)
	|			И (КодыДепонентовОтправителей.Владелец ССЫЛКА Справочник.Контрагенты)
	|			И (КодыДепонентовОтправителей.Биржа ССЫЛКА Справочник.Биржи)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыОтправителейСубброкер
	|		ПО ТД_ADO.ИДКлиентаСубброкер = ДоговорыОтправителейСубброкер.Код
	|			И (ДоговорыОтправителейСубброкер.ПометкаУдаления = ЛОЖЬ)
	|			И (ДоговорыОтправителейСубброкер.Владелец ССЫЛКА Справочник.Контрагенты)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыДепонентовПолучателей
	|		ПО ТД_ADO.ИДКлиентаПолучателя = КодыДепонентовПолучателей.Код
	|			И (КодыДепонентовПолучателей.ПометкаУдаления = ЛОЖЬ)
	|			И (КодыДепонентовПолучателей.Владелец ССЫЛКА Справочник.Контрагенты)
	|			И (КодыДепонентовПолучателей.Биржа ССЫЛКА Справочник.Биржи)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыПолучателейСубброкер
	|		ПО ТД_ADO.ИДКлиентаПолучателяСубброкер = ДоговорыПолучателейСубброкер.Код
	|			И (ДоговорыПолучателейСубброкер.ПометкаУдаления = ЛОЖЬ)
	|			И (ДоговорыПолучателейСубброкер.Владелец ССЫЛКА Справочник.Контрагенты)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РазделыССД
	|		ПО (РазделыССД.Владелец.Владелец = ЕСТЬNULL(КодыДепонентовОтправителей.Владелец, ДоговорыОтправителейСубброкер.Владелец))
	|			И (РазделыССД.Код = ТД_ADO.СчетСписанияД)
	|			И (РазделыССД.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РазделыСЗД
	|		ПО (РазделыСЗД.Владелец.Владелец = ЕСТЬNULL(КодыДепонентовПолучателей.Владелец, ДоговорыПолучателейСубброкер.Владелец))
	|			И (РазделыСЗД.Код = ТД_ADO.СчетЗачисленияД)
	|			И (РазделыСЗД.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦБПоКодамЗагрузки КАК ЦБПоКодамЗагрузки
	|		ПО ТД_ADO.SecCode = ЦБПоКодамЗагрузки.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДепоКонтрагентов КАК СчетаДепоКонтрагентов
	|		ПО ТД_ADO.DepoCP = СчетаДепоКонтрагентов.DepoCP
	|			И ТД_ADO.ID = СчетаДепоКонтрагентов.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
	|		ПО ТД_ADO.DepoCP = СчетаДепо.Код
	|			И (СчетаДепо.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РСчетаДепо
	|		ПО ТД_ADO.SubDepoCP = РСчетаДепо.Код
	|			И (РСчетаДепо.ПометкаУдаления = ЛОЖЬ)
	|			И (РСчетаДепо.Владелец = ЕСТЬNULL(СчетаДепоКонтрагентов.СчетДепо, СчетаДепо.Ссылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестаХраненияПоНаименованиюПанда КАК МестаХраненияПоНаименованиюПанда
	|		ПО ТД_ADO.НаименованиеМестаРасчетов = МестаХраненияПоНаименованиюПанда.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК ПорученияЦенныеБумаги
	|		ПО ТД_ADO.НомерПоручения = ПорученияЦенныеБумаги.ИдентификаторЗагрузки
	|			И ТД_ADO.ExtID = ПорученияЦенныеБумаги.Ссылка.ИдентификаторЗагрузки
	|			И (НЕ ПорученияЦенныеБумаги.Ссылка.ПометкаУдаления)
	|			И (ПорученияЦенныеБумаги.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ТД_ADO.ДатаРегистрации, ДЕНЬ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ТД_ADO.ДатаРегистрации, ДЕНЬ, 1), ДЕНЬ))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаРегистрации,
	|	ИД_Брокера,
	|	НомерПоручения";
	
КонецФункции

Функция ЭтоОперацияДепонирования(ВидОперации)
	Возврат (ВидОперации = Справочники.ВидыОпераций.Депонирование
			ИЛИ ВидОперации = Справочники.ВидыОпераций.СнятиеСДепонирования);
КонецФункции

Функция ПодобратьЦеннуюБумагуПоОстаткам(ДанныеПоручения)
	
	ДанныеЦБУказаны = ЗначениеЗаполнено(ДанныеПоручения.ISIN) И ЗначениеЗаполнено(ДанныеПоручения.SecRegNumber)
	Или ЗначениеЗаполнено(ДанныеПоручения.КодЦБ);
	
	Если Не ДанныеЦБУказаны Или Не ЗначениеЗаполнено(ДанныеПоручения.РСДОтправитель) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КодыЦБ.Владелец КАК ЦеннаяБумага
	|ПОМЕСТИТЬ ЦБПоКодуЗагрузки
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЦБ
	|ГДЕ
	|	КодыЦБ.Код = &КодЗагрузки
	|	И НЕ КодыЦБ.ПометкаУдаления
	|	И КодыЦБ.Владелец ССЫЛКА Справочник.ЦенныеБумаги
	|	И (КодыЦБ.Биржа ССЫЛКА Справочник.Биржи
	|			ИЛИ КодыЦБ.Биржа ССЫЛКА Справочник.КлассификаторыЗагрузки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|ГДЕ
	|	ЦенныеБумаги.ISIN = &ISIN
	|	И ЦенныеБумаги.НомерРегистрации = &НомерРегистрации
	|	И НЕ ЦенныеБумаги.ПометкаУдаления
	|	И &ISIN <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБ.ЦБ КАК ЦеннаяБумага
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&Период,
	|			РазделСчетаДепо = &РазделСчетаДепо
	|				И ЦБ В
	|					(ВЫБРАТЬ
	|						ЦБПоКодуЗагрузки.ЦеннаяБумага
	|					ИЗ
	|						ЦБПоКодуЗагрузки КАК ЦБПоКодуЗагрузки)) КАК ОстаткиЦБ
	|ГДЕ
	|	ОстаткиЦБ.КоличествоОстаток > 0";
	
	Запрос.УстановитьПараметр("КодЗагрузки", ДанныеПоручения.КодЦБ);
	Запрос.УстановитьПараметр("ISIN", ДанныеПоручения.ISIN);
	Запрос.УстановитьПараметр("НомерРегистрации", ДанныеПоручения.SecRegNumber);
	Запрос.УстановитьПараметр("РазделСчетаДепо", ДанныеПоручения.РСДОтправитель);
	Запрос.УстановитьПараметр("Период", ДанныеПоручения.ДатаРегистрации);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.ЦеннаяБумага;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ЕстьРазличающиесяРеквизитыВПоручении(ДанныеПоручения, ИД_Брокера)
	ЕстьРазличающиесяРеквизитыВПоручении = Ложь;
	
	РеквизитыДляПроверкиСтрокой = "ВидОперации, НомерПлатежа, Валюта, КодДО, ДОтправитель, КодДП, ДПолучатель, Состояние,"
	+ "РСДОтправительКод, РСДОтправитель, РCДПолучательКод, РCДПолучатель, Счет, СчетРазделДЕПО, СчетПриемник,"
	+ "УидПользователя, Биржа, Комментарий, ТипДеятельности, ID, CP, DepoCP, СчетДепоКонтрагента, SubDepoCP,"
	+ "РазделСчетаДепоКонтрагента, PayDate, DealDate, Референс, МХКонтрагент, Инициатор";
	РеквизитыДляПроверки = СтрРазделить(РеквизитыДляПроверкиСтрокой, ", ", Ложь);
	
	ИменаРазличающихсяРеквизитов = "";
	Для Каждого Реквизит Из РеквизитыДляПроверки Цикл
		Если ДанныеПоручения[Реквизит] > 1 Тогда
			ИменаРазличающихсяРеквизитов = ИменаРазличающихсяРеквизитов + Реквизит + "; ";
			ЕстьРазличающиесяРеквизитыВПоручении = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьРазличающиесяРеквизитыВПоручении Тогда
		ШаблонСообщения = "В строках с поручением с ИД брокера %1 различаются реквизиты %2. Невозможно создать сводное поручение по этим строкам";
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ИД_Брокера, ИменаРазличающихсяРеквизитов);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат ЕстьРазличающиесяРеквизитыВПоручении;
КонецФункции

Процедура СформироватьСводныеПоручения()
	
	Запрос = ЗапросФормированияСводныхПоручений();
	ИдентификаторыБрокера = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ИдентификаторыБрокера.Следующий() Цикл
		ПорученияКФормированию = ИдентификаторыБрокера.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ПорученияКФормированию.Следующий() Цикл
			Если ЕстьРазличающиесяРеквизитыВПоручении(ПорученияКФормированию, ИдентификаторыБрокера.ИД_Брокера) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ПорученияКФормированию.Поручение) Тогда
				Поручение = Документы.Поручение.СоздатьДокумент();
			Иначе
				Поручение = ПорученияКФормированию.Поручение.ПолучитьОбъект();
			КонецЕсли;
			
			ЗаполнитьИЗаписатьСводноеПоручение(Поручение, ПорученияКФормированию);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИЗаписатьСводноеПоручение(Поручение, ПорученияКФормированию)
	ДанныеПоручения = ПорученияКФормированию.Выбрать();
	ДанныеПоручения.Следующий();
	ЗаполнитьПоручение(Поручение, ДанныеПоручения);
	
	ДанныеПоручения.Сбросить();
	Поручение.ЦенныеБумагиСписываемые.Очистить();
	Пока ДанныеПоручения.Следующий() Цикл
		НоваяСтрокаЦБ = Поручение.ЦенныеБумагиСписываемые.Добавить();
		НоваяСтрокаЦБ.ЦеннаяБумага = ДанныеПоручения.ЦеннаяБумага;
		НоваяСтрокаЦБ.Количество = ДанныеПоручения.КоличествоЦБ;
		НоваяСтрокаЦБ.ИдентификаторЗагрузки = ДанныеПоручения.НомерПоручения;
	КонецЦикла;
	
	Попытка
		Поручение.Записать( РежимЗаписиДокумента.Запись);
		Если ИсточникЗагрузки = Перечисления.ИсточникиЗагрузки.Панда Тогда
			ОтправитьСтатусОбрабатываетсяВПанда(Поручение.Ссылка);
		КонецЕсли;
		ДанныеПоручения.Сбросить();
		Если Не ПустаяСтрока(Поручение.KafkaMessageId) Тогда
			ЗаписатьРезультатОбработкиВходящегоСообщения(Поручение.DepoMessageId);
		КонецЕсли;
		Пока ДанныеПоручения.Следующий() Цикл
			СтрокаПоИдентификатору = ДанныеДляПоручений.Найти(ДанныеПоручения.НомерПоручения, "НомерПоручения");
			СтрокаПоИдентификатору.Поручение = Поручение.Ссылка;
			СтрокаПоИдентификатору.Загружать = Ложь;
		КонецЦикла;
	Исключение
		ТекстСообщения = "Поручение №" + СокрЛП(Поручение.Номер) + " от " + Поручение.Дата + " не удалось записать ";
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения);
		ЗаписатьРезультатОбработкиВходящегоСообщения(ДанныеПоручения.KafkaMessageId, ТекстСообщения);
	КонецПопытки;
КонецПроцедуры

Функция ЗапросФормированияСводныхПоручений()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДляПоручений.ВидОперации КАК ВидОперации,
	|	ДанныеДляПоручений.НомерПоручения КАК НомерПоручения,
	|	ДанныеДляПоручений.НомерПлатежа КАК НомерПлатежа,
	|	ДанныеДляПоручений.Валюта КАК Валюта,
	|	ДанныеДляПоручений.КодДО КАК КодДО,
	|	ДанныеДляПоручений.ДОтправитель КАК ДОтправитель,
	|	ДанныеДляПоручений.КодДП КАК КодДП,
	|	ДанныеДляПоручений.ДПолучатель КАК ДПолучатель,
	|	ДанныеДляПоручений.Состояние КАК Состояние,
	|	ДанныеДляПоручений.ДатаИсполнения КАК ДатаИсполнения,
	|	ДанныеДляПоручений.ДатаРегистрации КАК ДатаРегистрации,
	|	ДанныеДляПоручений.РСДОтправительКод КАК РСДОтправительКод,
	|	ДанныеДляПоручений.РСДОтправитель КАК РСДОтправитель,
	|	ДанныеДляПоручений.РCДПолучательКод КАК РCДПолучательКод,
	|	ДанныеДляПоручений.РCДПолучатель КАК РCДПолучатель,
	|	ДанныеДляПоручений.Счет КАК Счет,
	|	ДанныеДляПоручений.СчетРазделДЕПО КАК СчетРазделДЕПО,
	|	ДанныеДляПоручений.СчетПриемник КАК СчетПриемник,
	|	ДанныеДляПоручений.УидПользователя КАК УидПользователя,
	|	ДанныеДляПоручений.КодЦБ КАК КодЦБ,
	|	ДанныеДляПоручений.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ДанныеДляПоручений.Биржа КАК Биржа,
	|	ДанныеДляПоручений.ОснованиеОтказа КАК ОснованиеОтказа,
	|	ДанныеДляПоручений.Комментарий КАК Комментарий,
	|	ДанныеДляПоручений.ТипДеятельности КАК ТипДеятельности,
	|	ДанныеДляПоручений.КоличествоЦБ КАК КоличествоЦБ,
	|	ДанныеДляПоручений.ИД_Брокера КАК ИД_Брокера,
	|	ДанныеДляПоручений.ID КАК ID,
	|	ДанныеДляПоручений.CP КАК CP,
	|	ДанныеДляПоручений.DepoCP КАК DepoCP,
	|	ДанныеДляПоручений.СчетДепоКонтрагента КАК СчетДепоКонтрагента,
	|	ДанныеДляПоручений.SubDepoCP КАК SubDepoCP,
	|	ДанныеДляПоручений.РазделСчетаДепоКонтрагента КАК РазделСчетаДепоКонтрагента,
	|	ДанныеДляПоручений.Поручение КАК Поручение,
	|	ДанныеДляПоручений.PayDate КАК PayDate,
	|	ДанныеДляПоручений.DealDate КАК DealDate,
	|	ДанныеДляПоручений.Референс КАК Референс,
	|	ДанныеДляПоручений.МХКонтрагент КАК МХКонтрагент,
	|	ДанныеДляПоручений.Инициатор КАК Инициатор,
	|	ДанныеДляПоручений.DepoMessageId КАК DepoMessageId,
	|	ДанныеДляПоручений.KafkaMessageId КАК KafkaMessageId
	|ПОМЕСТИТЬ ДанныеДляПоручений
	|ИЗ
	|	&ДанныеДляПоручений КАК ДанныеДляПоручений
	|ГДЕ
	|	ДанныеДляПоручений.Загружать
	|	И ДанныеДляПоручений.ИД_Брокера <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляПоручений.ВидОперации КАК ВидОперации,
	|	ДанныеДляПоручений.НомерПоручения КАК НомерПоручения,
	|	ДанныеДляПоручений.НомерПлатежа КАК НомерПлатежа,
	|	ДанныеДляПоручений.Валюта КАК Валюта,
	|	ДанныеДляПоручений.КодДО КАК КодДО,
	|	ДанныеДляПоручений.ДОтправитель КАК ДОтправитель,
	|	ДанныеДляПоручений.КодДП КАК КодДП,
	|	ДанныеДляПоручений.ДПолучатель КАК ДПолучатель,
	|	ДанныеДляПоручений.Состояние КАК Состояние,
	|	ДанныеДляПоручений.ДатаИсполнения КАК ДатаИсполнения,
	|	ДанныеДляПоручений.ДатаРегистрации КАК ДатаРегистрации,
	|	ДанныеДляПоручений.РСДОтправительКод КАК РСДОтправительКод,
	|	ДанныеДляПоручений.РСДОтправитель КАК РСДОтправитель,
	|	ДанныеДляПоручений.РCДПолучательКод КАК РCДПолучательКод,
	|	ДанныеДляПоручений.РCДПолучатель КАК РCДПолучатель,
	|	ДанныеДляПоручений.Счет КАК Счет,
	|	ДанныеДляПоручений.СчетРазделДЕПО КАК СчетРазделДЕПО,
	|	ДанныеДляПоручений.СчетПриемник КАК СчетПриемник,
	|	ДанныеДляПоручений.УидПользователя КАК УидПользователя,
	|	ДанныеДляПоручений.КодЦБ КАК КодЦБ,
	|	ДанныеДляПоручений.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ДанныеДляПоручений.Биржа КАК Биржа,
	|	ДанныеДляПоручений.ОснованиеОтказа КАК ОснованиеОтказа,
	|	ДанныеДляПоручений.Комментарий КАК Комментарий,
	|	ДанныеДляПоручений.ТипДеятельности КАК ТипДеятельности,
	|	ДанныеДляПоручений.КоличествоЦБ КАК КоличествоЦБ,
	|	ДанныеДляПоручений.ИД_Брокера КАК ИД_Брокера,
	|	ДанныеДляПоручений.ID КАК ID,
	|	ДанныеДляПоручений.CP КАК CP,
	|	ДанныеДляПоручений.DepoCP КАК DepoCP,
	|	ДанныеДляПоручений.СчетДепоКонтрагента КАК СчетДепоКонтрагента,
	|	ДанныеДляПоручений.SubDepoCP КАК SubDepoCP,
	|	ДанныеДляПоручений.РазделСчетаДепоКонтрагента КАК РазделСчетаДепоКонтрагента,
	|	ДанныеДляПоручений.Поручение КАК Поручение,
	|	ДанныеДляПоручений.PayDate КАК PayDate,
	|	ДанныеДляПоручений.DealDate КАК DealDate,
	|	ДанныеДляПоручений.Референс КАК Референс,
	|	ДанныеДляПоручений.МХКонтрагент КАК МХКонтрагент,
	|	ДанныеДляПоручений.Инициатор КАК Инициатор,
	|	ДанныеДляПоручений.DepoMessageId КАК DepoMessageId,
	|	ДанныеДляПоручений.KafkaMessageId КАК KafkaMessageId
	|ИЗ
	|	ДанныеДляПоручений КАК ДанныеДляПоручений
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВидОперации),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомерПлатежа),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Валюта),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодДО),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДОтправитель),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодДП),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДПолучатель),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Состояние),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РСДОтправительКод),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РСДОтправитель),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РCДПолучательКод),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РCДПолучатель),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Счет),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетРазделДЕПО),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетПриемник),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УидПользователя),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Биржа),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Комментарий),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТипДеятельности),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ID),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CP),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ DepoCP),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетДепоКонтрагента),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ SubDepoCP),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РазделСчетаДепоКонтрагента),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ PayDate),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ DealDate),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Референс),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МХКонтрагент),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Инициатор),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ DepoMessageId),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ KafkaMessageId)
	|ПО
	|	ИД_Брокера,
	|	Поручение";
	
	Запрос.УстановитьПараметр("ДанныеДляПоручений", ДанныеДляПоручений.Выгрузить());
	Возврат Запрос;
	
КонецФункции

Процедура ЗаполнитьПоручение(Поручение, Данные)
	Если Не ЗначениеЗаполнено(Поручение.Дата) Тогда
		Поручение.Дата = ТекущаяДатаСеанса();
	КонецЕсли;

	Поручение.ПометкаУдаления = Ложь;
	Поручение.ИдентификаторЗагрузки = Данные.ИД_Брокера;
	Поручение.ИсточникЗагрузки = ИсточникЗагрузки;
	Поручение.KafkaMessageId = Данные.KafkaMessageId;
	Поручение.DepoMessageId = Данные.DepoMessageId;
	
	Если Данные.Состояние = "Исполнено" И ЗначениеЗаполнено(Данные.ДатаИсполнения) Тогда
		Поручение.ДатаИсполненияПоручения = Данные.ДатаИсполнения;
		Поручение.ДатаИсполненияПорученияВДепозитарииМХ = НачалоДня(Данные.ДатаИсполнения);
		Поручение.ДатаИсполненияПорученияВМестеРасчетов = НачалоДня(Данные.ДатаИсполнения);
	КонецЕсли;
	Поручение.ОснованиеОтмены	= Данные.ОснованиеОтказа;
	Поручение.Комментарий		= Данные.Комментарий;
	Поручение.ВидОперацииД		= Данные.ВидОперации;
	Поручение.Инициатор			= Данные.Инициатор;
	Поручение.СчетДепо			= Данные.РСДОтправитель.Владелец;
	Поручение.РазделСчетаДепо	= Данные.РСДОтправитель;
	Поручение.Депонент			= Поручение.СчетДепо.Владелец;
	
	Если Поручение.Инициатор = ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию() Тогда
		Поручение.ВидИнициатора = 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Референс) Тогда
		Поручение.Референс = Данные.Референс;
	Иначе
		Поручение.Референс = РеференсИзКомментария(Данные.Комментарий);
	КонецЕсли;
	
	Поручение.РазделСчетаДепоМХ = Данные.СчетРазделДЕПО;
	Поручение.СчетДепоМХ = Поручение.РазделСчетаДепоМХ.Владелец;
	
	Если Поручение.ВидОперацииД = Справочники.ВидыОпераций.Перевод Тогда
		Поручение.Контрагент					= Данные.ДПолучатель;
		Поручение.СчетДепоКонтрагента			= Данные.РCДПолучатель.Владелец;
		Поручение.РазделСчетаДепоКонтрагента	= Данные.РCДПолучатель;
		Поручение.РазделСчетаДепоМХКонтрагента	= Данные.РCДПолучатель.РазделСчетаДепоМХ;
		Поручение.СчетДепоМХКонтрагента			= Поручение.РазделСчетаДепоМХКонтрагента.Владелец;
		Поручение.ВидОперацииД = УточненныйВидПереводаПоСчетамДепоМХ(Поручение.СчетДепоМХ, Поручение.СчетДепоМХКонтрагента);
	Иначе
		Поручение.ДатаСделки				= Данные.DealDate;
		Поручение.ПланируемаяДатаРасчетов	= Данные.PayDate;
		Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента) Тогда
			Поручение.СчетДепоКонтрагента	= Данные.СчетДепоКонтрагента;
			Поручение.Контрагент			= Данные.СчетДепоКонтрагента.Владелец;
			Если ЗначениеЗаполнено(Данные.РазделСчетаДепоКонтрагента) Тогда
				Поручение.РазделСчетаДепоКонтрагента = Данные.РазделСчетаДепоКонтрагента;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Поручение.МХКонтрагент = Данные.МХКонтрагент;
	Поручение.МХДепонента = Поручение.СчетДепоМХ.Владелец;
	Поручение.СпособПриемаПоручений = Справочники.СпособыПриемаПоручений.ЭлектронныйВид();
	Поручение.ЗагруженоИзВнешнегоИсточника = Истина;
	Если Не ЗначениеЗаполнено(Поручение.ДатаПриема) Тогда
		Поручение.ДатаПриема = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Функция УточненныйВидПереводаПоСчетамДепоМХ(СчетДепоМХ, СчетДепоМХКонтрагента)
	Если СчетДепоМХ = СчетДепоМХКонтрагента Тогда
		ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо;
	Иначе
		ВидОперацииД = Справочники.ВидыОпераций.Перемещение;
	КонецЕсли;
	
	Возврат ВидОперацииД;
КонецФункции 

Процедура ЗаписатьРезультатОбработкиВходящегоСообщения(DepoMessageId, ОписаниеОшибки = "")
	Идентификатор = DepoMessageId;
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaPandaConsNti1634;
	ПроизошлаОшибкаОбработки = НЕ ПустаяСтрока(ОписаниеОшибки);
	Если ПроизошлаОшибкаОбработки Тогда
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(ВнешнийИсточник, Идентификатор, ОписаниеОшибки);
	Иначе
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗавершитьОбработку(ВнешнийИсточник, Идентификатор);
	КонецЕсли;
КонецПроцедуры

Процедура ОповеститьОРазличающихсяРеквизитах(СводныеПорученияСРазличающимисяРеквизитами)
	РеквизитыДляПроверкиСтрокой = "ВидОперации, НомерПлатежа, Валюта, ИДФирмы, ИДКлиента, ИДКлиентаПолучателя, ИДКлиентаСубброкер,"
	+ "ИДКлиентаПолучателяСубброкер, СчетСписанияД, СчетЗачисленияД, Счет, СчетПриемник,"
	+ "UID, Биржа, Комментарий, ТипДеятельности, ID, CP, DepoCP, ID, CP, DepoCP, SubDepoCP, PayDate, DealDate";
	РеквизитыДляПроверки = СтрРазделить(РеквизитыДляПроверкиСтрокой, ", ", Ложь);
	ШаблонСообщения = "В строках с поручением с ИД брокера %1 различаются реквизиты %2";
	
	Пока СводныеПорученияСРазличающимисяРеквизитами.Следующий() Цикл
		ИменаРазличающихсяРеквизитов = "";
		Для Каждого Реквизит Из РеквизитыДляПроверки Цикл
			Если СводныеПорученияСРазличающимисяРеквизитами[Реквизит] > 1 Тогда
				ИменаРазличающихсяРеквизитов = ИменаРазличающихсяРеквизитов + Реквизит + "; ";
			КонецЕсли;
		КонецЦикла;
		
		ТекстСообщения = СтрШаблон(ШаблонСообщения, СводныеПорученияСРазличающимисяРеквизитами.ИД_Брокера, ИменаРазличающихсяРеквизитов);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		ПараметрыПоиска = Новый Структура("ИД_Брокера", СводныеПорученияСРазличающимисяРеквизитами.ИД_Брокера);
		СтрокиСНекорректнымиПоручениями = ДанныеДляПоручений.НайтиСтроки(ПараметрыПоиска);
		Для Каждого Строка Из СтрокиСНекорректнымиПоручениями Цикл
			Строка.Загружать = Ложь;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ОтправитьСтатусОбрабатываетсяВПанда(Поручение)
	СтатусПоручения = ОбработкаНеторговыхПорученийИзПандаВызовСервера.СтатусПоНаименованию("Обрабатывается");
	ОбработкаНеторговыхПорученийИзПандаВызовСервера.СоздатьСообщениеОбИзмененииСтатусаПорученияВПанда(Поручение, СтатусПоручения);
КонецПроцедуры

Процедура КонвертироватьДанныеПандаВДанные1С(ДанныеПанда)
	
	ДанныеДляПоручений.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаОбработкаДанныхПанда();
	Запрос.УстановитьПараметр("ДанныеПанда", ДанныеПанда);
	Запрос.УстановитьПараметр("ДлинаКодаСчетовДепо", Метаданные.Справочники.СчетаДепо.ДлинаКода);
	Запрос.УстановитьПараметр("ВидыОперацийЗачисление", ВидыОперацийЗачисление());
	Запрос.УстановитьПараметр("ВидыОперацийСписание", ВидыОперацийСписание());
	Запрос.УстановитьПараметр("ВидыОперацийПеревод", ВидыОперацийПеревод());
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеДляПоручений.Загрузить(РезультатЗапроса.Выгрузить());
	ДозаполнитьДанныеПоручений();
	
КонецПроцедуры

Функция ВидыОперацийЗачисление()
	Результат = Новый Массив;
	Результат.Добавить("1");
	Результат.Добавить("2");
	Возврат Результат;
КонецФункции

Функция ВидыОперацийСписание()
	Результат = Новый Массив;
	Результат.Добавить("6");
	Результат.Добавить("7");
	Возврат Результат;
КонецФункции

Функция ВидыОперацийПеревод()
	Возврат "14";
КонецФункции

// BSLLS:MethodSize-off
// Функция возврашает тест запроса
// Возвращаемое значение:
//	Строка
Функция ТекстЗапросаОбработкаДанныхПанда()
	Возврат
	"ВЫБРАТЬ
	|	КодыЗагрузки.Владелец КАК МестоХранения,
	|	МАКСИМУМ(КодыЗагрузки.Код) КАК Наименование
	|ПОМЕСТИТЬ МестаХраненияПоНаименованиюПанда
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	КодыЗагрузки.Владелец ССЫЛКА Справочник.МестаХранения
	|	И КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.КодыМестХраненияИзПанда)
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	КодыЗагрузки.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДанныеПанда.Operation В (&ВидыОперацийЗачисление)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Депонирование)
	|		КОГДА ДанныеПанда.Operation В (&ВидыОперацийСписание)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СнятиеСДепонирования)
	|		КОГДА ДанныеПанда.Operation В (&ВидыОперацийПеревод)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|	КОНЕЦ КАК ВидОперации,
	|	ДанныеПанда.OperationText КАК OperationText,
	|	ДанныеПанда.Created КАК ДатаСоздания,
	|	ДанныеПанда.Id КАК НомерПоручения,
	|	ДанныеПанда.DocComment КАК Комментарий,
	|	ДанныеПанда.DealReference КАК Референс,
	|	ДанныеПанда.DeponentCode КАК КодДепонента,
	|	ДанныеПанда.DeponentName КАК НаименованиеДепонента,
	|	ДанныеПанда.DeponentSubAccount КАК БиржевойКодДепонента,
	|	ДанныеПанда.DeponentDepoAccount КАК КодСчетаДепоДепонента,
	|	ДанныеПанда.DeponentDepoAccountSection КАК КодРазделаСчетаДепоДепонента,
	|	ДанныеПанда.CounterpartyName КАК НаименованиеКонтрагента,
	|	ДанныеПанда.CounterpartyIdentifier КАК ИдентификаторКонтрагента,
	|	ДанныеПанда.CounterpartyDepoAccount КАК КодСчетаДепоКонтрагента,
	|	ДанныеПанда.CounterpartyDepoAccountSection КАК КодРазделаСчетаДепоКонтрагента,
	|	ДанныеПанда.CounterpartyClientName КАК НаименованиеКлиентаКонтрагента,
	|	ДанныеПанда.CounterpartyClientDepoAccount КАК КодСчетаДепоКлиентаКонтрагента,
	|	ДанныеПанда.Place КАК Place,
	|	ДанныеПанда.PlaceText КАК НаименованиеМестаРасчетов,
	|	ДанныеПанда.ISIN КАК ISIN,
	|	ДанныеПанда.SecRegNumber КАК SecRegNumber,
	|	ДанныеПанда.SecCode КАК SecCode,
	|	ДанныеПанда.Quantity КАК КоличествоЦБ,
	|	ДанныеПанда.ConsolidatedNumber КАК ExtID,
	|	ДанныеПанда.KafkaMessageId КАК KafkaMessageId,
	|	ДанныеПанда.DepoMessageId КАК DepoMessageId,
	|	ДанныеПанда.PayDate КАК PayDate,
	|	ДанныеПанда.DealDate КАК DealDate
	|ПОМЕСТИТЬ ДанныеПанда
	|ИЗ
	|	&ДанныеПанда КАК ДанныеПанда
	|ГДЕ
	|	ДанныеПанда.Operation В (&ВидыОперацийЗачисление, &ВидыОперацийСписание, &ВидыОперацийПеревод)
	|	И ДанныеПанда.Created МЕЖДУ &НачалоПериода И &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.НомерРегистрации КАК НомерРегистрации,
	|	ЦенныеБумаги.Ссылка КАК Ссылка,
	|	ЦенныеБумаги.ДатаПриемаНаОбслуживание КАК ДатаПриемаНаОбслуживание,
	|	ЦенныеБумаги.ДатаСнятияСОбслуживания КАК ДатаСнятияСОбслуживания,
	|	ДанныеПанда.ДатаСоздания КАК ДатаСозданияПоручения
	|ПОМЕСТИТЬ втЦенныеБумаги1СДепоСДублями
	|ИЗ
	|	ДанныеПанда КАК ДанныеПанда
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ДанныеПанда.ISIN = ЦенныеБумаги.ISIN
	|			И ДанныеПанда.SecRegNumber = ЦенныеБумаги.НомерРегистрации
	|			И (НЕ ЦенныеБумаги.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// BSLLS:QueryParseError-off
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ДатаПриемаНаОбслуживание <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ЦенныеБумаги.ДатаСнятияСОбслуживания = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * 100 + ВЫБОР
	|		КОГДА ДЛИНАСТРОКИ(ЕСТЬNULL(КодыЗагрузки.Код, """")) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА СТРНАЙТИ(ЕСТЬNULL(КодыЗагрузки.Код, """"), ""/"") = 0
	|						ТОГДА 2
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ * 10 КАК Приоритет,
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.НомерРегистрации КАК НомерРегистрации,
	|	ЦенныеБумаги.Ссылка КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втЦенныеБумаги1СДепоСПриоритетом
	|ИЗ
	|	втЦенныеБумаги1СДепоСДублями КАК ЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ЦенныеБумаги.Ссылка = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.NrdCode))
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ КодыЗагрузки.ДатаОкончанияДействия > ЦенныеБумаги.ДатаСозданияПоручения
	|			КОНЕЦ)
	|			И (КодыЗагрузки.ДатаНачалаДействия <= ЦенныеБумаги.ДатаСозданияПоручения)
	// BSLLS:QueryParseError-on
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(втЦенныеБумаги1СДепоСПриоритетом.Приоритет) КАК Приоритет,
	|	втЦенныеБумаги1СДепоСПриоритетом.ISIN КАК ISIN,
	|	втЦенныеБумаги1СДепоСПриоритетом.НомерРегистрации КАК НомерРегистрации
	|ПОМЕСТИТЬ втЦенныеБумаги1СДепоСМаксимальнымПриоритетом
	|ИЗ
	|	втЦенныеБумаги1СДепоСПриоритетом КАК втЦенныеБумаги1СДепоСПриоритетом
	|
	|СГРУППИРОВАТЬ ПО
	|	втЦенныеБумаги1СДепоСПриоритетом.ISIN,
	|	втЦенныеБумаги1СДепоСПриоритетом.НомерРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.НомерРегистрации КАК НомерРегистрации,
	|	МАКСИМУМ(ЦенныеБумаги.ЦеннаяБумага) КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втЦБпоISINиГосНомерам
	|ИЗ
	|	втЦенныеБумаги1СДепоСПриоритетом КАК ЦенныеБумаги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЦенныеБумаги1СДепоСМаксимальнымПриоритетом КАК втЦенныеБумаги1СДепоСМаксимальнымПриоритетом
	|		ПО ЦенныеБумаги.Приоритет = втЦенныеБумаги1СДепоСМаксимальнымПриоритетом.Приоритет
	|			И ЦенныеБумаги.ISIN = втЦенныеБумаги1СДепоСМаксимальнымПриоритетом.ISIN
	|			И ЦенныеБумаги.НомерРегистрации = втЦенныеБумаги1СДепоСМаксимальнымПриоритетом.НомерРегистрации
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумаги.ISIN,
	|	ЦенныеБумаги.НомерРегистрации
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЦенныеБумаги.ЦеннаяБумага) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПорученияЦенныеБумаги.Ссылка ЕСТЬ NULL
	|				И НЕ РазделыСчетаДепоОтправителя.Ссылка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Загружать,
	|	ДанныеПанда.ВидОперации КАК ВидОперации,
	|	ДанныеПанда.НомерПоручения КАК НомерПоручения,
	|	ДанныеПанда.ДатаСоздания КАК ДатаСоздания,
	|	ДанныеПанда.Комментарий КАК Комментарий,
	|	ДанныеПанда.Референс КАК Референс,
	|	ДанныеПанда.ExtID КАК ИД_Брокера,
	|	ДанныеПанда.KafkaMessageId КАК KafkaMessageId,
	|	ДанныеПанда.DepoMessageId КАК DepoMessageId,
	|	ДанныеПанда.КодДепонента КАК КодДО,
	|	ЕСТЬNULL(КодыДепонентовОтправителей.Владелец, КонтрагентОтправитель.Ссылка) КАК ДОтправитель,
	|	СчетаДепоОтправителя.Ссылка КАК СчетДепоДепонента,
	|	ДанныеПанда.КодРазделаСчетаДепоДепонента КАК РСДОтправительКод,
	|	РазделыСчетаДепоОтправителя.Ссылка КАК РСДОтправитель,
	|	РазделыСчетаДепоОтправителя.РазделСчетаДепоМХ КАК СчетРазделДЕПО,
	|	ВЫБОР
	|		КОГДА ДанныеПанда.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|			ТОГДА ЕСТЬNULL(КодыДепонентовОтправителей.Владелец, КонтрагентОтправитель.Ссылка)
	|	КОНЕЦ КАК ДПолучатель,
	|	ВЫБОР
	|		КОГДА ДанныеПанда.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|			ТОГДА ДанныеПанда.КодРазделаСчетаДепоКонтрагента
	|	КОНЕЦ КАК РCДПолучательКод,
	|	ВЫБОР
	|		КОГДА ДанныеПанда.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|			ТОГДА РазделыСчетаДепоДляПереводов.Ссылка
	|	КОНЕЦ КАК РCДПолучатель,
	|	ДанныеПанда.ИдентификаторКонтрагента КАК ID,
	|	ДанныеПанда.НаименованиеКонтрагента КАК CP,
	|	ДанныеПанда.КодСчетаДепоКонтрагента КАК DepoCP,
	|	СчетаДепоПолучателя.Ссылка КАК СчетДепоКонтрагента,
	|	ДанныеПанда.КодРазделаСчетаДепоКонтрагента КАК SubDepoCP,
	|	РазделыСчетаДепоПолучателя.Ссылка КАК РазделСчетаДепоКонтрагента,
	|	ДанныеПанда.НаименованиеКлиентаКонтрагента КАК ClientName,
	|	ДанныеПанда.КодСчетаДепоКлиентаКонтрагента КАК DepoCPClient,
	|	ДанныеПанда.ISIN КАК ISIN,
	|	ДанныеПанда.SecRegNumber КАК SecRegNumber,
	|	ДанныеПанда.SecCode КАК КодЦБ,
	|	втЦБпоISINиГосНомерам.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ДанныеПанда.КоличествоЦБ КАК КоличествоЦБ,
	|	ДанныеПанда.PayDate КАК PayDate,
	|	ДанныеПанда.DealDate КАК DealDate,
	|	ДанныеПанда.Place КАК Place,
	|	ДанныеПанда.НаименованиеМестаРасчетов КАК НаименованиеМестаРасчетов,
	|	МестаХраненияПоНаименованиюПанда.МестоХранения КАК МХКонтрагент,
	|	ПорученияЦенныеБумаги.Ссылка КАК Поручение
	|ИЗ
	|	ДанныеПанда КАК ДанныеПанда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыДепонентовОтправителей
	|		ПО ДанныеПанда.КодДепонента = КодыДепонентовОтправителей.Код
	|			И (НЕ КодыДепонентовОтправителей.ПометкаУдаления)
	|			И (КодыДепонентовОтправителей.Владелец ССЫЛКА Справочник.Контрагенты)
	|			И (КодыДепонентовОтправителей.Биржа ССЫЛКА Справочник.Биржи)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентОтправитель
	|		ПО ДанныеПанда.КодДепонента = КонтрагентОтправитель.Код
	|			И (ДанныеПанда.КодДепонента <> """")
	|			И (НЕ КонтрагентОтправитель.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепоОтправителя
	|		ПО ДанныеПанда.КодСчетаДепоДепонента = СчетаДепоОтправителя.Код
	|			И (ЕСТЬNULL(КодыДепонентовОтправителей.Владелец, КонтрагентОтправитель.Ссылка) = СчетаДепоОтправителя.Владелец)
	|			И (НЕ СчетаДепоОтправителя.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РазделыСчетаДепоОтправителя
	|		ПО (РазделыСчетаДепоОтправителя.Владелец = СчетаДепоОтправителя.Ссылка)
	|			И (РазделыСчетаДепоОтправителя.Код = ДанныеПанда.КодРазделаСчетаДепоДепонента)
	|			И (НЕ РазделыСчетаДепоОтправителя.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РазделыСчетаДепоДляПереводов
	|		ПО (РазделыСчетаДепоДляПереводов.Владелец.Владелец = ЕСТЬNULL(КодыДепонентовОтправителей.Владелец, КонтрагентОтправитель.Ссылка))
	|			И (РазделыСчетаДепоДляПереводов.Код = ДанныеПанда.КодРазделаСчетаДепоКонтрагента)
	|			И (НЕ РазделыСчетаДепоДляПереводов.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеПанда.ИдентификаторКонтрагента = Контрагенты.Код
	|			И (ДанныеПанда.ИдентификаторКонтрагента <> """")
	|			И (НЕ Контрагенты.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепоПолучателя
	|		ПО (ПОДСТРОКА(ДанныеПанда.КодСчетаДепоКлиентаКонтрагента + ПОДСТРОКА(ДанныеПанда.КодСчетаДепоКонтрагента, 1, 4), 1, &ДлинаКодаСчетовДепо) = СчетаДепоПолучателя.Код)
	|			И (Контрагенты.Ссылка = СчетаДепоПолучателя.Владелец)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РазделыСчетаДепоПолучателя
	|		ПО (РазделыСчетаДепоПолучателя.Владелец = СчетаДепоПолучателя.Ссылка)
	|			И (РазделыСчетаДепоПолучателя.Код = ДанныеПанда.КодРазделаСчетаДепоКонтрагента)
	|			И (НЕ РазделыСчетаДепоПолучателя.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦБпоISINиГосНомерам КАК втЦБпоISINиГосНомерам
	|		ПО ДанныеПанда.ISIN = втЦБпоISINиГосНомерам.ISIN
	|			И ДанныеПанда.SecRegNumber = втЦБпоISINиГосНомерам.НомерРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК ПорученияЦенныеБумаги
	|		ПО ДанныеПанда.НомерПоручения = ПорученияЦенныеБумаги.ИдентификаторЗагрузки
	|			И ДанныеПанда.ExtID = ПорученияЦенныеБумаги.Ссылка.ИдентификаторЗагрузки
	|			И (НЕ ПорученияЦенныеБумаги.Ссылка.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестаХраненияПоНаименованиюПанда КАК МестаХраненияПоНаименованиюПанда
	|		ПО ДанныеПанда.НаименованиеМестаРасчетов = МестаХраненияПоНаименованиюПанда.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания,
	|	ИД_Брокера,
	|	НомерПоручения";
КонецФункции
// BSLLS:MethodSize-on

#КонецОбласти

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);