
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)		
	КонтактнаяИнформацияСервер.ПриСозданииНаСервереФормыВводаКИ(ЭтаФорма, Отказ);

	Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьФормуПоРеквизитуЭтоРоссийскийАдрес();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонтактнаяИнформацияКлиент.ВводКИ_ПередЗакрытием(ЭтаФорма, Отказ);
	// Отключение сообщения о неиспользуемых процедурах и функциях
	Если Ложь Тогда
		Подключаемый_СохранитьИЗакрыть(Неопределено);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЭтоРоссийскийАдресПриИзменении(Элемент)
	НастроитьФормуПоРеквизитуЭтоРоссийскийАдрес();
		
КонецПроцедуры

&НаКлиенте
Процедура РегионПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ГородПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура НаселенныйПунктПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ДомПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура КорпусПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ИндексПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура СтранаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.КлассификаторСтранМира.ФормаВыбора", , Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СтранаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Объект.Поле1 = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВыбранноеЗначение, "Наименование");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	КонтактнаяИнформацияКлиент.ОбновитьПараметрыВыбораДляВидаКИ(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_СохранитьИЗакрыть(Команда)
	КонтактнаяИнформацияКлиент.ВводКИ_СохранитьИЗакрытьНаКлиенте(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьФормуПоРеквизитуЭтоРоссийскийАдрес()
	
	Если Объект.ЭтоРоссийскийАдрес Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = 
			Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаРоссийскийАдрес;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = 
			Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаПроизвольныйАдресСтраница;
	КонецЕсли; 
	
КонецПроцедуры 

// Процедура формирует строковое представление адреса.
&НаКлиенте
Процедура СформироватьПредставление()
	Объект.Представление = КонтактнаяИнформация.ПолучитьПредставлениеАдреса(Объект);    
КонецПроцедуры

#КонецОбласти
