
// IMAPPS-36274 ++
&НаСервере
Процедура fp_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ЭтоКопирование = Не Параметры.ЗначениеКопирования.Пустая();
	
	ДанныеОбъект = РеквизитФормыВЗначение("Объект");
	
	СхемаКомпоновки = Справочники.Портфели.ПолучитьМакет("МакетОтбораПортфелей");
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВоВременномХранилище);
	
	КомпоновщикНастроекОтборПортфелей.Инициализировать(ИсточникНастроек);
	
	Если ЭтоКопирование Тогда
		
		СохраненнаяНастройка = Параметры.ЗначениеКопирования.НастройкиОтбораПортфелейСКД.Получить();
		
	Иначе
		
		СохраненнаяНастройка = ДанныеОбъект.НастройкиОтбораПортфелейСКД.Получить();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СохраненнаяНастройка) Тогда
		
		КомпоновщикНастроекОтборПортфелей.ЗагрузитьНастройки(СохраненнаяНастройка);
		
	Иначе
		
		КомпоновщикНастроекОтборПортфелей.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура fp_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.НастройкиОтбораПортфелейСКД = Новый ХранилищеЗначения(Этотобъект.КомпоновщикНастроекОтборПортфелей.Настройки);
	
КонецПроцедуры
// IMAPPS-36274 --