//////////////////////////////////////////////////////////////////////////////////
//// Подсистема "Базовая функциональность".
////
//////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////
//// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПараметрКлиента(ИмяПараметра = Неопределено) Экспорт
	
	ИмяГлобальногоПараметра = "СтандартныеПодсистемы.ПараметрыКлиента";
	ПараметрыКлиента = ПараметрыПриложения[ИмяГлобальногоПараметра];
	
	Если ПараметрыКлиента = Неопределено Тогда
		// Заполнение постоянных параметров клиента.
		СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске();
		ПараметрыКлиента = ПараметрыПриложения[ИмяГлобальногоПараметра];
	КонецЕсли;
	
	Если ИмяПараметра = Неопределено Тогда
		Возврат ПараметрыКлиента;
	Иначе
		Возврат ПараметрыКлиента[ИмяПараметра];
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Обработка результата выполнения

// Выводит результат выполнения какой-либо операции.
//
// Параметры:
//   ЭтаФорма (УправляемаяФорма) Форма, для которой требуется вывод.
//   Результат (Структура) Результат выполнения операции, который необходимо вывести.
//       |- ВыводОповещения (Структура)
//           |- Использование (Булево) Выводить оповещение.
//           |- Заголовок     (Строка)
//           |- Ссылка        (Строка) Навигационная гиперссылка.
//           |- Текст         (Строка)
//           |- Картинка      (Картинка)
//       |- ВыводСообщения (Структура)
//           |- Использование       (Булево) Выводить сообщение.
//           |- Текст               (Строка)
//           |- ПутьКРеквизитуФормы (Строка) Путь к реквизиту формы, к которому относится сообщение.
//       |- ВыводПредупреждения (Структура)
//           |- Использование       (Булево) Выводить предупреждение.
//           |- Текст               (Строка)
//           |- ТекстОшибок         (Строка) Необязательный. Тексты ошибок, которые при желании может просмотреть пользователь.
//           |- ПутьКРеквизитуФормы (Строка) Необязательный. Путь к реквизиту формы, значение которого вызывало ошибку.
//       |- ОповещениеФорм (Структура, Массив из Структура) см. справку к методу глобального контекста Оповестить().
//           |- Использование (Булево) Оповещать открытые формы.
//           |- ИмяСобытия    (Строка) Имя события, которое используется для первичной идентификации сообщений принимающими формами.
//           |- Параметр      (*) Набор данных, которые используются принимающей формой для обновления состава.
//           |- Источник      (*) Источник оповещения, например форма-источником.
//       |- ОповещениеДинамическихСписков (Структура) см. справку к методу глобального контекста ОповеститьОбИзменении().
//           |- Использование (Булево) Оповещать динамические списки.
//           |- СсылкаИлиТип  (*) Ссылка, тип, или массив типов, которые необходимо обновить.
//
// Описание:
//   Предназначен только для отображения результата работы сервера на клиенте,
//     не предназначен для отображения промежуточных стадий - диалогов и т.п..
//
// См. также:
//   СтандартныеПодсистемыКлиентСервер.НовыйРезультатВыполнения()
//   СтандартныеПодсистемыКлиентСервер.ПодготовитьОповещениеДинамическихСписков()
//
Процедура ПоказатьРезультатВыполнения(ЭтаФорма, Результат) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") И ТипЗнч(Результат) <> Тип("ФиксированнаяСтруктура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("ВыводОповещения") И Результат.ВыводОповещения.Использование Тогда
		Оповещение = Результат.ВыводОповещения;
		ПоказатьОповещениеПользователя(Оповещение.Заголовок, Оповещение.Ссылка, Оповещение.Текст, Оповещение.Картинка);
	КонецЕсли;
	
	Если Результат.Свойство("ВыводСообщения") И Результат.ВыводСообщения.Использование Тогда
		Сообщение = Новый СообщениеПользователю;
		Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
			Сообщение.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
		КонецЕсли;
		Сообщение.Текст = Результат.ВыводСообщения.Текст;
		Сообщение.Поле  = Результат.ВыводСообщения.ПутьКРеквизитуФормы;
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если Результат.Свойство("ВыводПредупреждения") И Результат.ВыводПредупреждения.Использование Тогда
		Если ЗначениеЗаполнено(Результат.ВыводПредупреждения.ТекстОшибок) Тогда
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить(1, НСтр("ru = 'Показать ошибки'"));
			
			Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") И ЗначениеЗаполнено(Результат.ВыводПредупреждения.ПутьКРеквизитуФормы) Тогда
				Кнопки.Добавить(2, НСтр("ru = 'Перейти к реквизиту'"));
			КонецЕсли;
			
			Кнопки.Добавить(0, НСтр("ru = 'Продолжить'"));
			
			Ответ = Вопрос(Результат.ВыводПредупреждения.Текст, Кнопки, , 1);
			
			Если Ответ = 1 Тогда
				
				ЗаголовокДокумента = Результат.ВыводПредупреждения.Текст;
				ЗаголовокДокумента = СтрЗаменить(ЗаголовокДокумента, Символы.ПС, "; ");
				Если СтрДлина(ЗаголовокДокумента) > 75 Тогда
					ЗаголовокДокумента = Лев(ЗаголовокДокумента, 72) + "...";
				КонецЕсли;
				
				ТекстовыйДокумент = Новый ТекстовыйДокумент;
				ТекстовыйДокумент.УстановитьТекст(Результат.ВыводПредупреждения.ТекстОшибок);
				ТекстовыйДокумент.Показать(ЗаголовокДокумента);
				
			ИначеЕсли Ответ = 2 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
				Сообщение.Текст = Результат.ВыводПредупреждения.Текст;
				Сообщение.Поле  = Результат.ВыводПредупреждения.ПутьКРеквизитуФормы;
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		Иначе
			Предупреждение(Результат.ВыводПредупреждения.Текст);
		КонецЕсли;
	КонецЕсли;
	
	Если Результат.Свойство("ОповещениеФорм") Тогда
		Если ТипЗнч(Результат.ОповещениеФорм) = Тип("Структура") Или ТипЗнч(Результат.ОповещениеФорм) = Тип("ФиксированнаяСтруктура") Тогда
			ОповещениеФорм = Результат.ОповещениеФорм;
			Если ОповещениеФорм.Использование Тогда
				Оповестить(ОповещениеФорм.ИмяСобытия, ОповещениеФорм.Параметр, ОповещениеФорм.Источник);
			КонецЕсли;
		Иначе
			Для Каждого ОповещениеФорм Из Результат.ОповещениеФорм Цикл
				Если ОповещениеФорм.Использование Тогда
					Оповестить(ОповещениеФорм.ИмяСобытия, ОповещениеФорм.Параметр, ОповещениеФорм.Источник);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если Результат.Свойство("ОповещениеДинамическихСписков") И Результат.ОповещениеДинамическихСписков.Использование Тогда
		Если ТипЗнч(Результат.ОповещениеДинамическихСписков.СсылкаИлиТип) = Тип("Массив") Тогда
			Для Каждого СсылкаИлиТип Из Результат.ОповещениеДинамическихСписков.СсылкаИлиТип Цикл
				ОповеститьОбИзменении(СсылкаИлиТип);
			КонецЦикла;
		Иначе
			ОповеститьОбИзменении(Результат.ОповещениеДинамическихСписков.СсылкаИлиТип);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
//// Обработчики условных вызовов в другие подсистемы

// Возвращает клиентский общий модуль по имени.
Функция КлиентскийОбщийМодуль(Имя) Экспорт
	
	Модуль = Вычислить(Имя);
	
#Если НЕ ВебКлиент Тогда
	Если ТипЗнч(Модуль) <> Тип(Строка("ОбщийМодуль")) Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Общий модуль ""%1"" не найден.'"), Имя);
	КонецЕсли;
#КонецЕсли
	
	Возврат Модуль;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////
//// Вспомогательные процедуры и функции
