
Функция СведенияОВнешнейОбработке() Экспорт
	
	// Объявим переменную, в которой мы сохраним и вернем "наружу" необходимые данные
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Назначение", Неопределено);
	ПараметрыРегистрации.Вставить("Наименование", НСтр("ru = 'Запуск по расписанию отчета управляющего ДУ'"));
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Версия", "1.01");
	ПараметрыРегистрации.Вставить("Информация", НСтр("ru = 'Запуск по расписанию отчета управляющего ДУ'"));
	
	// Создадим таблицу команд (подробнее смотрим ниже)
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "Запустить по расписанию обработку ""Отчет управляющего ДУ"" (фон.)", "ФоновоеВыполнение", "ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	// Создадим пустую таблицу команд и колонки в ней
	Команды = Новый ТаблицаЗначений;
	
	// Как будет выглядеть описание печатной формы для пользователя
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
	
	// Имя нашего макета, что бы могли отличить вызванную команду в обработке печати
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	
	// Тут задается, как должна вызваться команда обработки
	// Возможные варианты:
	// - ОткрытиеФормы - в этом случае в колонке идентификатор должно быть указано имя формы, которое должна будет открыть система
	// - ВызовКлиентскогоМетода - вызвать клиентскую экспортную процедуру из модуля формы обработки
	// - ВызовСерверногоМетода - вызвать серверную экспортную процедуру из модуля объекта обработки
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	
	// Следующий параметр указывает, необходимо ли показывать оповещение при начале и завершению работы обработки. Не имеет смысла при открытии формы
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	
	// Для печатной формы должен содержать строку ПечатьMXL 
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	// Добавляем команду в таблицу команд по переданному описанию.
	// Параметры и их значения можно посмотреть в функции ПолучитьТаблицуКоманд
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ДополнительнаяОбработкаСсылка = ПараметрыВыполненияКоманды.ДополнительнаяОбработкаСсылка;
	ЭтоРабочийДень = ТекущаяДата() = КалендарныеГрафики.ПолучитьСледующуюРабочуюДату(, ТекущаяДата(), 0);
	
	Если ИдентификаторКоманды = "ФоновоеВыполнение" И ЭтоРабочийДень Тогда 
		
		ПредставлениеНастроек = УстановитьНастройки(ПараметрыВыполненияКоманды);
		
		ВнешняяОбработка = ДополнительныеОтчетыИОбработки.ПолучитьОбъектВнешнейОбработки(ОтчетУправляющегоДУ);
		
		ПараметрыКоманды = Новый Структура();
		ПараметрыКоманды.Вставить("ДополнительнаяОбработкаСсылка", ОтчетУправляющегоДУ);
		ПараметрыКоманды.Вставить("ПараметрыДополнительнойОбработки", Справочники.ДополнительныеОтчетыИОбработки.НастройкиОбработки(ОтчетУправляющегоДУ));
		
		ВнешняяОбработка.ВыполнитьКоманду("ФоновоеВыполнение", ПараметрыКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

Функция УстановитьНастройки(ПараметрыВыполненияКоманды)
	
	НастройкиВыполнения = ПараметрыВыполненияКоманды.ПараметрыДополнительнойОбработки;
	Если ТипЗнч(НастройкиВыполнения) <> Тип("Структура") тогда возврат "<Настройки не установлены>"; КонецЕсли;
	ЗначенияНастроек = НастройкиВыполнения;
	ПредставлениеНастроек = "";
	УстановитьПользовательскиеНастройки(ЗначенияНастроек,ПредставлениеНастроек);
	
	Возврат ПредставлениеНастроек;
КонецФункции

Процедура УстановитьПользовательскиеНастройки(Настройки, ПредставлениеНастроек="") Экспорт
	
	Если Настройки.Свойство("Значения") тогда
		Настройки.Значения.Свойство("ОтчетУправляющегоДУ", ОтчетУправляющегоДУ);
		ПредставлениеНастроек = "Отчет управляющего ДУ:" + ОтчетУправляющегоДУ;
	КонецЕсли;
	
КонецПроцедуры
