#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЯвляетсяДепонентом = Справочники.Контрагенты.ЯвляетсяДепонентом(Объект.Клиент);
	УстановитьВидимостьИДоступностьЭлементов(ТекущийОбъект);
	ПоказатьВремяОтправкиИТекущийСтатусДоставки(ТекущийОбъект.Ссылка);
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьИДоступностьЭлементов(Объект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьВидимостьИДоступностьЭлементов(ТекущийОбъект);
	Если ТекущийОбъект.УведомитьОПриемеКлиента Тогда
		ПоказатьВремяОтправкиИТекущийСтатусДоставки(ТекущийОбъект.Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	КлиентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УведомитьОПриемеКлиентаПриИзменении(Элемент)
	Элементы.УведомитьОПриемеКлиента.ТолькоПросмотр = Объект.УведомитьОПриемеКлиента;
КонецПроцедуры

&НаКлиенте
Процедура КарточкаОфертыПриИзменении(Элемент)
	КарточкаОфертыПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КлиентПриИзмененииНаСервере()
	ЯвляетсяДепонентом = Справочники.Контрагенты.ЯвляетсяДепонентом(Объект.Клиент);
КонецПроцедуры

&НаСервере
Процедура КарточкаОфертыПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.КарточкаОферты) Тогда
		Объект.ЦеннаяБумага = Объект.КарточкаОферты.ЦеннаяБумага;
		Объект.ДатаОферты = Объект.КарточкаОферты.ДатаОферты;
	КонецЕсли;
	УстановитьВидимостьИДоступностьЭлементов(Объект);
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементов(ОбъектДанных)
	НельзяМенятьКлючевыеПоля = ЗначениеЗаполнено(ОбъектДанных.КарточкаОферты);
	Элементы.ЦеннаяБумага.ТолькоПросмотр = НельзяМенятьКлючевыеПоля;
	Элементы.ДатаОферты.ТолькоПросмотр = НельзяМенятьКлючевыеПоля;
	Элементы.УведомитьОПриемеКлиента.ТолькоПросмотр = ОбъектДанных.УведомитьОПриемеКлиента;
КонецПроцедуры

&НаСервере
Процедура ПоказатьВремяОтправкиИТекущийСтатусДоставки(Ссылка)
	СтатусДоставкиУведомления = Неопределено;
	ДатаОтправкиУведомления = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УведомленияОтправленныеЧерезЛичныйКабинет.КД КАК Документ,
	|	МАКСИМУМ(УведомленияОтправленныеЧерезЛичныйКабинет.Период) КАК ДатаОтправки
	|ПОМЕСТИТЬ ВТ_Дата
	|ИЗ
	|	РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК УведомленияОтправленныеЧерезЛичныйКабинет
	|ГДЕ
	|	УведомленияОтправленныеЧерезЛичныйКабинет.КД = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	УведомленияОтправленныеЧерезЛичныйКабинет.КД
	|;
	|
	|/////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Дата.ДатаОтправки КАК ДатаОтправки,
	|	УведомленияОтправленныеЧерезЛичныйКабинет.СтатусДоставкиУведомления КАК СтатусДоставкиУведомления
	|ИЗ ВТ_Дата
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК УведомленияОтправленныеЧерезЛичныйКабинет
	|		ПО УведомленияОтправленныеЧерезЛичныйКабинет.КД = ВТ_Дата.Документ";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		СтатусДоставкиУведомления = Выборка.СтатусДоставкиУведомления;
		ДатаОтправкиУведомления = Выборка.ДатаОтправки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
