&НаСервере
Функция ПодготовитьСтруктуруХранилища()
	 Значения = Новый Структура;
	 Значения.Вставить("Периодичность"    , Объект.Периодичность);
	 Значения.Вставить("ДатаНачалаРасчета", Объект.ДатаНачалаРасчета);
	 Значения.Вставить("ТипПериода"       , Объект.ТипПериода);
	 Значения.Вставить("РассчитыватьБРСА" , Объект.РассчитыватьБРСА);
	 Значения.Вставить("ЗаУспех", Истина);	 
	 Значения.Вставить("ТипДня"           , Объект.ТипДня);
	 Значения.Вставить("ТаблицаКоэффициентов"		  ,	XMLСтрока(Новый ХранилищеЗначения(Объект.ТаблицаКоэффициентов.Выгрузить())));
	 Возврат Значения;
Конецфункции

&НаКлиенте
Процедура Установить(Команда)
	 Заголовок = "Периодичность:"+ Объект.Периодичность+", Дата начала расчета:"+Объект.ДатаНачалаРасчета;
	 ЗначениеВыбора = Новый Структура;
	 ЗначениеВыбора.Вставить("Значения", ПодготовитьСтруктуруХранилища());
	 ЗначениеВыбора.Вставить("ЗаголовокНастроек", Заголовок);
	 
	 ОповеститьОВыборе(ЗначениеВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Параметры.НастройкиАлгоритма)=Тип("Структура") тогда
		
		Настройки = Параметры.НастройкиАлгоритма;
		
		Если Настройки.Свойство("Значения") тогда
			
			Настройки.Значения.Свойство("Периодичность"    , Объект.Периодичность);
			Настройки.Значения.Свойство("ДатаНачалаРасчета", Объект.ДатаНачалаРасчета);
			Настройки.Значения.Свойство("ТипПериода"       , Объект.ТипПериода);
			Настройки.Значения.Свойство("РассчитыватьБРСА" , Объект.РассчитыватьБРСА);
			Настройки.Значения.Свойство("ТипДня"           , Объект.ТипДня);
			Настройки.Значения.Свойство("ЗаУспех"          , Объект.ЗаУспех);	
			Если Настройки.Значения.Свойство("ТаблицаКоэффициентов") Тогда
				//Сообщить(Настройки.Значения.ТаблицаКоэффициентов);
				ТаблицаКоэфициентовХранилище = XMLЗначение(Тип("ХранилищеЗначения"),Настройки.Значения.ТаблицаКоэффициентов).Получить(); 
				Объект.ТаблицаКоэффициентов.Очистить();
				Для Каждого СтрХран ИЗ ТаблицаКоэфициентовХранилище Цикл
					Стр = Объект.ТаблицаКоэффициентов.Добавить();
					ЗаполнитьЗначенияСвойств(стр,СтрХран);
				КонецЦикла;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.Периодичность) Тогда
				Объект.ТипПериода = Перечисления.Периодичность.Квартал;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВознагражденийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
	НоваяСтрока = Объект.ТаблицаВознаграждений.Добавить();
	НоваяСтрока.ТипСравнения = ">";
	
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПутьСохраненияОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогОткрытияКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияКаталога.Каталог = Объект.ПутьСохраненияОтчета;
	//ДиалогОткрытияФайла.Фильтр = ДополнительныеОтчетыИОбработкиКлиентСервер.ФильтрДиалоговВыбораИСохранения();
	//ДиалогОткрытияФайла.ИндексФильтра = ?(Объект.Ссылка.Пустая(), 0, ?(Объект.Вид = ВидДополнительныйОтчет ИЛИ Объект.Вид = ВидОтчет, 1, 2));
	ДиалогОткрытияКаталога.МножественныйВыбор = Ложь;
	ДиалогОткрытияКаталога.Заголовок = НСтр("ru = 'Выберите каталог сохранения отчета'");
	Если ДиалогОткрытияКаталога.Выбрать() Тогда
		Объект.ПутьСохраненияОтчета = ДиалогОткрытияКаталога.Каталог;
	КонецЕсли;

КонецПроцедуры


//Проверка расчета

&НаСервере
Процедура СчитатьНастройки()
	Настройки = Объект.НачислениеВознаграждения.ДоговорКонтрагента.НастройкиАлгоритма.Получить();
	
	Если Настройки.Свойство("Значения") тогда
			
		Настройки.Значения.Свойство("Периодичность"       , Объект.Периодичность);
		Настройки.Значения.Свойство("ДатаНачалаРасчета"   , Объект.ДатаНачалаРасчета);
		Настройки.Значения.Свойство("РассчитыватьБРСА"   , Объект.РассчитыватьБРСА);
		Настройки.Значения.Свойство("ТипПериода"          , Объект.ТипПериода);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Считать(Команда)
	СчитатьНастройки();
КонецПроцедуры

Процедура ЗаписатьНастройкиСервер()
	ОбъектДоговор = Объект.НачислениеВознаграждения.ДоговорКонтрагента.ПолучитьОбъект();
	ОбъектДоговор.НастройкиАлгоритма = Новый ХранилищеЗначения(Новый Структура("Значения,ЗаголовокНастроек", ПодготовитьСтруктуруХранилища(),Заголовок));
	ОбъектДоговор.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНастройкиСервер();
КонецПроцедуры

&НаСервере
Процедура ПроверитьРезультатСервер()
	Настройки = ПодготовитьСтруктуруХранилища();
	СтруктураНастроек = Новый Структура("Значения,ЗаголовокНастроек", ПодготовитьСтруктуруХранилища(), "");
	СтруктураПараметровАлгоритма = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Объект.НачислениеВознаграждения,"Дата, ДоговорДУ, ВалютаДокумента, Контрагент, ДоговорКонтрагента");
	
	//Определение границ периода
	СтруктураПараметровДУ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Объект.НачислениеВознаграждения.ДоговорДУ, "ДатаВводаСредствВДУ, ДатаНачала, ДатаОкончания");
	СтруктураПараметровПериода = Новый Структура;
	СтруктураПараметровПериода.Вставить("ДатаДокумента"     , Объект.НачислениеВознаграждения.Дата); 
	СтруктураПараметровПериода.Вставить("СтруктураДоговораДУ", СтруктураПараметровДУ);
	СтруктураПараметровПериода.Вставить("НастройкиАлгоритма", СтруктураНастроек.Значения);
	СтруктураПериодаРасчета = ГраницыПериодаРасчета(СтруктураПараметровПериода);
    НачалоПериода    = СтруктураПериодаРасчета.РасчетнаяДатаНачала;
	ОкончаниеПериода = СтруктураПериодаРасчета.РасчетнаяДатаОкончания;
	
	//Определение расчета
	Результат = РезультатРасчета(СтруктураНастроек,СтруктураПараметровАлгоритма);	
	
	Объект.СуммаДокумента = Результат.СуммаВознаграждения;
	Объект.СтавкаВознаграждения = Результат.СтавкаВознаграждения;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРезультат(Команда)
	ПроверитьРезультатСервер();
КонецПроцедуры



//Копия модуля расчета   

Функция РасчетСуммыЗаУправление(СтруктураПараметров)
	
	//ДатаНачала = НачалоГода(СтруктураПараметров.Дата);
	//ДатаНачала = ?(СтруктураПараметров.ДатаНачалаДУ>(ДатаНачала), СтруктураПараметров.ДатаНачалаДУ, ДатаНачала);
	//
	//ДатаОкончания = КонецГода(СтруктураПараметров.Дата);
	//ДатаОкончания = ?(ЗначениеЗаполнено(СтруктураПараметров.ДатаОкончанияДУ) и СтруктураПараметров.ДатаОкончанияДУ<ДатаОкончания, СтруктураПараметров.ДатаОкончанияДУ, ДатаОкончания);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПараметров.ДатаНачалаРасчета);
	Запрос.УстановитьПараметр("КонецПериода", СтруктураПараметров.ДатаОкончанияРасчета);
	Запрос.УстановитьПараметр("ДоговорДУ", СтруктураПараметров.ДоговорДУ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			СчетДт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы)),
	|			,
	|			СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетВознаграждениеУКЗаУправление),
	|			,
	|			ДоговорДУ = &ДоговорДУ
	|				) КАК ХозрасчетныйОборотыДтКт
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОборотыДтКт.СуммаОборот";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат ?(Результат.СуммаОборот=NULL, 0, Результат.СуммаОборот);
	Иначе
		Возврат 0;
	КонецЕсли;
			
КонецФункции

Функция СуммыДСиЦБсИП(СтруктураПараметров)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СуммаВложения", 0);
	СтруктураВозврата.Вставить("СуммаИзъятия", 0);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПараметров.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",  СтруктураПараметров.ДатаОкончания);
	Запрос.УстановитьПараметр("ДоговорДУ",     СтруктураПараметров.ДоговорДУ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборотДт,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВводВыводАктивовВИзДУ),
	|			,
	|			ДоговорДУ = &ДоговорДУ
	|				,
	|			,
	|			) КАК ХозрасчетныйОбороты";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		СтруктураВозврата.СуммаИзъятия = Результат.СуммаОборотДт;
		СтруктураВозврата.СуммаВложения = Результат.СуммаОборотКт;		
	КонецЕсли;
	Возврат СтруктураВозврата;
КонецФункции

Функция ИнвестиционныйДоход_Базовый(СтруктураПараметров)
	//ДатаНачалаРасчета = НачалоГода(СтруктураПараметров.Дата)-1;
	//ДатаНачалаРасчета = ?(СтруктураПараметров.ДатаНачалаДУ>(ДатаНачалаРасчета), СтруктураПараметров.ДатаНачалаДУ, ДатаНачалаРасчета);
	//
	//ДатаОкончанияРасчета = КонецГода(СтруктураПараметров.Дата);
	//ДатаОкончанияРасчета = ?(ЗначениеЗаполнено(СтруктураПараметров.ДатаОкончанияДУ) и СтруктураПараметров.ДатаОкончанияДУ<ДатаОкончанияРасчета, СтруктураПараметров.ДатаОкончанияДУ, ДатаОкончанияРасчета);
	
	//СтруктураРасчетаБазовойРСА = РасчетБазовойРСА(СтруктураПараметров);
	БазоваяРСА = РегистрыСведений.РегистрБРСА.ЗначенияБРСА(СтруктураПараметров.ДатаНачалаРасчета, СтруктураПараметров.ДоговорДУ);
	//РСА_Начало    = СтруктураРасчетаБазовойРСА.БазоваяРСА;
	РСА_Окончание = РегистрыСведений.РегистрРСА_СЧА.ЗначенияСЧА_РСА(СтруктураПараметров.ДатаОкончанияРасчета, СтруктураПараметров.ДоговорДУ).РСА;
	
	ПараметрыДСиЦБсИП = Новый Структура;
	ПараметрыДСиЦБсИП.Вставить("ДатаНачала", СтруктураПараметров.ДатаНачалаРасчета+1);
	ПараметрыДСиЦБсИП.Вставить("ДатаОкончания", СтруктураПараметров.ДатаОкончанияРасчета);
	ПараметрыДСиЦБсИП.Вставить("ДоговорДУ", СтруктураПараметров.ДоговорДУ);
	
	СтруктураДСиЦБсИП = СуммыДСиЦБсИП(ПараметрыДСиЦБсИП);
	
	ПриростРСА = (РСА_Окончание-БазоваяРСА)+(СтруктураДСиЦБсИП.СуммаИзъятия-СтруктураДСиЦБсИП.СуммаВложения);
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("РСА_Начало"   , БазоваяРСА);
	СтруктураВозврата.Вставить("РСА_Окончание", РСА_Окончание);
	СтруктураВозврата.Вставить("СуммаВложения", СтруктураДСиЦБсИП.СуммаВложения);
	СтруктураВозврата.Вставить("СуммаИзъятия" , СтруктураДСиЦБсИП.СуммаИзъятия);
	СтруктураВозврата.Вставить("ПриростРСА", ПриростРСА);
	//Показатели расчета базовой
	//СтруктураВозврата.Вставить("БазоваяРСА_Расчетная", СтруктураРасчетаБазовойРСА.БазоваяРСА_Расчетная);
	//СтруктураВозврата.Вставить("РСА_Минус_Управление", СтруктураРасчетаБазовойРСА.РСА_Минус_Управление);
	СтруктураВозврата.Вставить("БазоваяРСА"          , БазоваяРСА);
		
	Возврат СтруктураВозврата;
КонецФункции

Функция РасчетБРСА(СтруктураПараметров)
	
	РСА_конец = РегистрыСведений.РегистрРСА_СЧА.ЗначенияСЧА_РСА(СтруктураПараметров.ДатаОкончанияРасчета, СтруктураПараметров.ДоговорДУ).РСА;
	
	ПараметрыДСиЦБсИП = Новый Структура;
	ПараметрыДСиЦБсИП.Вставить("ДатаНачала", СтруктураПараметров.ДатаНачалаРасчета+1);
	ПараметрыДСиЦБсИП.Вставить("ДатаОкончания", СтруктураПараметров.ДатаОкончанияРасчета);
	ПараметрыДСиЦБсИП.Вставить("ДоговорДУ", СтруктураПараметров.ДоговорДУ);
	СтруктураДСиЦБсИП = СуммыДСиЦБсИП(ПараметрыДСиЦБсИП);

	БРСА_Расчетная         = СтруктураПараметров.БРСА_Прошлая+СтруктураДСиЦБсИП.СуммаВложения-СтруктураДСиЦБсИП.СуммаИзъятия;
	РСАМинусВознаграждения = РСА_Конец-СтруктураПараметров.ВознаграждениеMF-СтруктураПараметров.ВознаграждениеSF;
	
	Возврат Макс(0, БРСА_Расчетная, РСАМинусВознаграждения);
	
КонецФункции


Функция КоличествоМесяцевВПериоде(Период)
	Если Период=Перечисления.Периодичность.Месяц Тогда
		Возврат 1;
	ИначеЕсли Период=Перечисления.Периодичность.Квартал Тогда
		Возврат 3;
	ИначеЕсли Период=Перечисления.Периодичность.Декада Тогда
		Возврат 4;
	ИначеЕсли Период=Перечисления.Периодичность.Полугодие Тогда
		Возврат 6;
	ИначеЕсли Период=Перечисления.Периодичность.Год Тогда
		Возврат 12;
	Иначе
		Возврат 3; //По умолчанию используем период Квартал
	КонецЕсли;
КонецФункции
 
Функция ГраницыПериодаРасчета(СтруктураПараметров)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("РасчетнаяДатаНачала", Дата(1, 1, 1));
	СтруктураВозврата.Вставить("РасчетнаяДатаОкончания", Дата(1, 1, 1));
	СтруктураВозврата.Вставить("КоличествоДнейВГоду", 0);
	КоличествоМесяцевВПериоде = КоличествоМесяцевВПериоде(СтруктураПараметров.НастройкиАлгоритма.Периодичность);
	//СтруктураДоговораДУ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтруктураПараметров.ДоговорДУ, "ДатаВводаСредствВДУ, ДатаНачала, ДатаОкончания");
	//Определение начала периода расчета
	
	//Корректировка по типу периода
	Если СтруктураПараметров.НастройкиАлгоритма.ТипПериода="Календарный" Тогда
		НачальнаяДата    =  НачалоГода(СтруктураПараметров.ДатаДокумента);
	Иначе //Инвестиционный
		Если СтруктураПараметров.НастройкиАлгоритма.ДатаНачалаРасчета="ДатаПодписанияДоговора" Тогда
			НачальнаяДата = СтруктураПараметров.СтруктураДоговораДУ.ДатаНачала;   
		Иначе
			НачальнаяДата = СтруктураПараметров.СтруктураДоговораДУ.ДатаВводаСредствВДУ; 
		КонецЕсли;
    КонецЕсли;
	//НачальнаяДата = ?(ЗначениеЗаполнено(СтруктураПараметров.НастройкиАлгоритма.ДатаНачалаРасчета), СтруктураПараметров.НастройкиАлгоритма.ДатаНачалаРасчета, СтруктураПараметров.ДатаВводаСредствВДУ);
    
	КоличествоМесяцев = ОбщегоНазначенияДУ.КоличествоПериодов(НачальнаяДата, СтруктураПараметров.ДатаДокумента, "Месяц")-1;
	//Если День(НачальнаяДата)>День(СтруктураПараметров.ДатаДокумента) Тогда
	//	КоличествоМесяцев=КоличествоМесяцев-1;
	//КонецЕсли;
	ПрошедшиеПериоды  = Цел(КоличествоМесяцев/КоличествоМесяцевВПериоде)*КоличествоМесяцевВПериоде;
	РасчетнаяДатаНачала = НачалоДня(ОбщегоНазначенияДУ.ДобавитьКДате(НачальнаяДата, "Месяц", ПрошедшиеПериоды));
	//Корректировка дат от периода договора
	Если СтруктураПараметров.НастройкиАлгоритма.ДатаНачалаРасчета="ДатаПодписанияДоговора" Тогда
		РасчетнаяДатаНачала = НачалоДня(Макс(РасчетнаяДатаНачала, СтруктураПараметров.СтруктураДоговораДУ.ДатаНачала));   
	Иначе
		РасчетнаяДатаНачала = НачалоДня(Макс(РасчетнаяДатаНачала,СтруктураПараметров.СтруктураДоговораДУ.ДатаВводаСредствВДУ)); 
	КонецЕсли;
	РасчетнаяДатаОкончания = КонецДня(Мин(СтруктураПараметров.ДатаДокумента, СтруктураПараметров.СтруктураДоговораДУ.ДатаОкончания));	
	
	//Определение количества дней в расчитываемом году для дальнейших расчетов
	ДельтаЛет = Цел(КоличествоМесяцев/12);
	НачалоРасчетногоГода = ОбщегоНазначенияДУ.ДобавитьКДате(НачальнаяДата, "Год", ДельтаЛет);
	КонецРасчетногоГода  = ОбщегоНазначенияДУ.ДобавитьКДате(НачальнаяДата, "Год", ДельтаЛет+1)-1;
	КоличествоДнейВГоду = ОбщегоНазначенияДУ.КоличествоПериодов(НачалоРасчетногоГода, КонецРасчетногоГода, "День");
	
	//Заполнение структуры возврата
	СтруктураВозврата.РасчетнаяДатаНачала    = РасчетнаяДатаНачала;
	СтруктураВозврата.РасчетнаяДатаОкончания = РасчетнаяДатаОкончания;
	СтруктураВозврата.КоличествоДнейВГоду  = КоличествоДнейВГоду;
	
	Возврат СтруктураВозврата;
КонецФункции
 
Функция РезультатРасчета(ПользовательскиеНастройки, СтруктураПараметров) Экспорт
	//Начальная проверка существования нужных настроек расчета
	Если ПользовательскиеНастройки=Неопределено Тогда
		ОбщегоНазначенияДУКлиентСервер.СообщитьОбОшибке("Отсутствуют настройки алгоритма");
		Возврат Неопределено;
	КонецЕсли;

	//Инициализация параметров для расчета
	ПоказателиСправки = Новый Структура;
	ПоказателиСправки.Вставить("ДатаРасчета", "");
	ПоказателиСправки.Вставить("НачалоРасчета", "");
	ПоказателиСправки.Вставить("ОкончаниеРасчета", "");
	
	ПоказателиСправки.Вставить("ДоговорДУ", "");
	ПоказателиСправки.Вставить("ДатаДоговораДУ", "");
	ПоказателиСправки.Вставить("НомерДоговораДУ", "");

	ПоказателиСправки.Вставить("П000", 0);
	ПоказателиСправки.Вставить("П011", 0);
	ПоказателиСправки.Вставить("П012", 0);
	ПоказателиСправки.Вставить("П013", 0);
	ПоказателиСправки.Вставить("П014", 0);
	ПоказателиСправки.Вставить("П015", 0);
	
	ПоказателиСправки.Вставить("П021", 0);
	ПоказателиСправки.Вставить("П022", 0);
	ПоказателиСправки.Вставить("П023", 0);
	
	ПоказателиСправки.Вставить("П031", 0);
	ПоказателиСправки.Вставить("П032", 0);
	ПоказателиСправки.Вставить("П033", 0);

	СтруктураПараметровДУ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтруктураПараметров.ДоговорДУ, "ДатаВводаСредствВДУ, ДатаНачала, ДатаОкончания, Код");
	ПВХ                   = ПланыВидовХарактеристик.ПараметрыДоговораДУ;
	ПроцентВознаграждения = УправлениеПараметрамиДоговораДУ.ПолучитьПараметрДоговораДУ(СтруктураПараметров.ДоговорДУ, ПВХ.ВеличинаВознагражденияЗаУспех, СтруктураПараметров.Дата);
	
	//Определение границ периода
	СтруктураПараметровПериода = Новый Структура;
	СтруктураПараметровПериода.Вставить("ДатаДокумента"     , СтруктураПараметров.Дата); 
	СтруктураПараметровПериода.Вставить("СтруктураДоговораДУ", СтруктураПараметровДУ);
	СтруктураПараметровПериода.Вставить("НастройкиАлгоритма", ПользовательскиеНастройки.Значения);
	 
	СтруктураПериодаРасчета = ГраницыПериодаРасчета(СтруктураПараметровПериода);
    РасчетнаяДатаНачала     = СтруктураПериодаРасчета.РасчетнаяДатаНачала;
	РасчетнаяДатаОкончания  = СтруктураПериодаРасчета.РасчетнаяДатаОкончания;
	ДнейВГоду     = СтруктураПериодаРасчета.КоличествоДнейВГоду;

	СтруктураПараметровПриростРСА = Новый Структура;
	СтруктураПараметровПриростРСА.Вставить("Дата", СтруктураПараметров.Дата);
	СтруктураПараметровПриростРСА.Вставить("ДоговорДУ", СтруктураПараметров.ДоговорДУ);
	
	СтруктураПараметровПриростРСА.Вставить("ДатаНачалаРасчета"   , РасчетнаяДатаНачала);
	СтруктураПараметровПриростРСА.Вставить("ДатаОкончанияРасчета", РасчетнаяДатаОкончания);
	СтруктураПараметровПриростРСА.Вставить("ДатаНачалаДУ"   , СтруктураПараметровДУ.ДатаНачала);
	СтруктураПараметровПриростРСА.Вставить("ДатаОкончанияДУ", СтруктураПараметровДУ.ДатаОкончания);
		
	СтруктураРасчетаПриростРСА = ИнвестиционныйДоход_Базовый(СтруктураПараметровПриростРСА);
	
	СтруктураПараметровУправление = Новый Структура;
	СтруктураПараметровУправление.Вставить("Дата", СтруктураПараметров.Дата);
	СтруктураПараметровУправление.Вставить("ДоговорДУ", СтруктураПараметров.ДоговорДУ);
	СтруктураПараметровУправление.Вставить("ДатаНачалаДУ", СтруктураПараметровДУ.ДатаНачала);
	СтруктураПараметровУправление.Вставить("ДатаОкончанияДУ", СтруктураПараметровДу.ДатаОкончания);
	СтруктураПараметровУправление.Вставить("ДатаНачалаРасчета"   , РасчетнаяДатаНачала);
	СтруктураПараметровУправление.Вставить("ДатаОкончанияРасчета", РасчетнаяДатаОкончания);
	СуммаЗаУправление = РасчетСуммыЗаУправление(СтруктураПараметровУправление);
			
	РачетнаяВеличинаВознаграждения = (СтруктураРасчетаПриростРСА.ПриростРСА-СуммаЗаУправление)*(ПроцентВознаграждения/100);
	ИтоговыйРасчет = ?(СтруктураРасчетаПриростРСА.ПриростРСА>0, Макс(0, РачетнаяВеличинаВознаграждения), 0);
	//Расчет БРСА
	СтруктураПараметровБРСА = Новый Структура;
	СтруктураПараметровУправление.Вставить("ДатаНачалаРасчета"   , РасчетнаяДатаНачала);
	СтруктураПараметровУправление.Вставить("ДатаОкончанияРасчета", РасчетнаяДатаОкончания);
	СтруктураПараметровУправление.Вставить("ДоговорДУ", СтруктураПараметров.ДоговорДУ);
	СтруктураПараметровУправление.Вставить("БРСА_Прошлая", СтруктураРасчетаПриростРСА.БазоваяРСА);
	СтруктураПараметровУправление.Вставить("ВознаграждениеMF", СуммаЗаУправление);
	СтруктураПараметровУправление.Вставить("ВознаграждениеSF", ИтоговыйРасчет);
	БРСА = РасчетБРСА(СтруктураПараметровУправление);

	
	//Заполнение показателей для справки-расчета
	ПоказателиСправки.ДатаРасчета   = Формат(СтруктураПараметров.Дата, "ДФ=dd.MM.yyyy");
	ПоказателиСправки.НачалоРасчета    = РасчетнаяДатаНачала;
	ПоказателиСправки.ОкончаниеРасчета = РасчетнаяДатаОкончания;
	ПоказателиСправки.ДоговорДУ   = СтруктураПараметров.ДоговорДУ;
	ПоказателиСправки.ДатаДоговораДУ = СтруктураПараметровДУ.ДатаНачала;
	ПоказателиСправки.НомерДоговораДУ = СтруктураПараметровДУ.Код;


	ПоказателиСправки.П000 = СуммаЗаУправление;
	ПоказателиСправки.П011 = СтруктураРасчетаПриростРСА.РСА_Начало;
	ПоказателиСправки.П012 = СтруктураРасчетаПриростРСА.РСА_Окончание;
	ПоказателиСправки.П013 = СтруктураРасчетаПриростРСА.СуммаВложения;
	ПоказателиСправки.П014 = СтруктураРасчетаПриростРСА.СуммаИзъятия;
	ПоказателиСправки.П015 = СтруктураРасчетаПриростРСА.ПриростРСА-СуммаЗаУправление;
	
	ПоказателиСправки.П021 = ПроцентВознаграждения;
    ПоказателиСправки.П022 = РачетнаяВеличинаВознаграждения;
	ПоказателиСправки.П023 = ИтоговыйРасчет;
	
	//ПоказателиСправки.П031 = СтруктураРасчетаПриростРСА.БазоваяРСА_Расчетная;
    //ПоказателиСправки.П032 = СтруктураРасчетаПриростРСА.РСА_Минус_Управление;
	//ПоказателиСправки.П033 = СтруктураРасчетаПриростРСА.БазоваяРСА;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СуммаВознаграждения", ИтоговыйРасчет);
	//СтруктураВозврата.Вставить("СправкаРасчет", СправкаРасчет(ПоказателиСправки));
	СтруктураВозврата.Вставить("СтавкаВознаграждения", ПроцентВознаграждения);
	СтруктураВозврата.Вставить("БРСА", БРСА);
	Возврат СтруктураВозврата;
КонецФункции
  