&НаСервере
Функция ПодготовитьСтруктуруХранилища()
	 Значения = Новый Структура;
	 Значения.Вставить("Периодичность"    , Объект.Периодичность);
	 Значения.Вставить("ДатаНачалаРасчета", Объект.ДатаНачалаРасчета);
	 Значения.Вставить("ТипПериода"       , Объект.ТипПериода);
	 Значения.Вставить("РассчитыватьБРСА" , Объект.РассчитыватьБРСА);
	 Значения.Вставить("ЗаУспех", Истина);	 
	 Значения.Вставить("ТипДня"           , Объект.ТипДня);
	 Значения.Вставить("ТаблицаКоэффициентов"		  ,	XMLСтрока(Новый ХранилищеЗначения(Объект.ТаблицаКоэффициентов.Выгрузить())));
	 Возврат Значения;
Конецфункции

&НаКлиенте
Процедура Установить(Команда)
	 Заголовок = "Периодичность:"+ Объект.Периодичность+", Дата начала расчета:"+Объект.ДатаНачалаРасчета;
	 ЗначениеВыбора = Новый Структура;
	 ЗначениеВыбора.Вставить("Значения", ПодготовитьСтруктуруХранилища());
	 ЗначениеВыбора.Вставить("ЗаголовокНастроек", Заголовок);
	 
	 ОповеститьОВыборе(ЗначениеВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Параметры.НастройкиАлгоритма)=Тип("Структура") тогда
		
		Настройки = Параметры.НастройкиАлгоритма;
		
		Если Настройки.Свойство("Значения") тогда
			
			Настройки.Значения.Свойство("Периодичность"    , Объект.Периодичность);
			Настройки.Значения.Свойство("ДатаНачалаРасчета", Объект.ДатаНачалаРасчета);
			Настройки.Значения.Свойство("ТипПериода"       , Объект.ТипПериода);
			Настройки.Значения.Свойство("РассчитыватьБРСА" , Объект.РассчитыватьБРСА);
			Настройки.Значения.Свойство("ТипДня"           , Объект.ТипДня);
			Настройки.Значения.Свойство("ЗаУспех"          , Объект.ЗаУспех);	
			Если Настройки.Значения.Свойство("ТаблицаКоэффициентов") Тогда
				//Сообщить(Настройки.Значения.ТаблицаКоэффициентов);
				ТаблицаКоэфициентовХранилище = XMLЗначение(Тип("ХранилищеЗначения"),Настройки.Значения.ТаблицаКоэффициентов).Получить(); 
				Объект.ТаблицаКоэффициентов.Очистить();
				Для Каждого СтрХран ИЗ ТаблицаКоэфициентовХранилище Цикл
					Стр = Объект.ТаблицаКоэффициентов.Добавить();
					ЗаполнитьЗначенияСвойств(стр,СтрХран);
				КонецЦикла;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.Периодичность) Тогда
				Объект.ТипПериода = Перечисления.Периодичность.Квартал;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВознагражденийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
	НоваяСтрока = Объект.ТаблицаВознаграждений.Добавить();
	НоваяСтрока.ТипСравнения = ">";
	
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПутьСохраненияОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогОткрытияКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияКаталога.Каталог = Объект.ПутьСохраненияОтчета;
	//ДиалогОткрытияФайла.Фильтр = ДополнительныеОтчетыИОбработкиКлиентСервер.ФильтрДиалоговВыбораИСохранения();
	//ДиалогОткрытияФайла.ИндексФильтра = ?(Объект.Ссылка.Пустая(), 0, ?(Объект.Вид = ВидДополнительныйОтчет ИЛИ Объект.Вид = ВидОтчет, 1, 2));
	ДиалогОткрытияКаталога.МножественныйВыбор = Ложь;
	ДиалогОткрытияКаталога.Заголовок = НСтр("ru = 'Выберите каталог сохранения отчета'");
	Если ДиалогОткрытияКаталога.Выбрать() Тогда
		Объект.ПутьСохраненияОтчета = ДиалогОткрытияКаталога.Каталог;
	КонецЕсли;

КонецПроцедуры


//Проверка расчета

&НаСервере
Процедура СчитатьНастройки()
	Настройки = Объект.НачислениеВознаграждения.ДоговорКонтрагента.НастройкиАлгоритма.Получить();
	
	Если Настройки.Свойство("Значения") тогда
			
			Настройки.Значения.Свойство("Периодичность"    , Объект.Периодичность);
			Настройки.Значения.Свойство("ДатаНачалаРасчета", Объект.ДатаНачалаРасчета);
			Настройки.Значения.Свойство("ТипПериода"       , Объект.ТипПериода);
			Настройки.Значения.Свойство("РассчитыватьБРСА" , Объект.РассчитыватьБРСА);
			Настройки.Значения.Свойство("ТипДня"           , Объект.ТипДня);
			Настройки.Значения.Свойство("ЗаУспех"          , Объект.ЗаУспех);	
			Если Настройки.Значения.Свойство("ТаблицаКоэффициентов") Тогда
				//Сообщить(Настройки.Значения.ТаблицаКоэффициентов);
				ТаблицаКоэфициентовХранилище = XMLЗначение(Тип("ХранилищеЗначения"),Настройки.Значения.ТаблицаКоэффициентов).Получить(); 
				Объект.ТаблицаКоэффициентов.Очистить();
				Для Каждого СтрХран ИЗ ТаблицаКоэфициентовХранилище Цикл
					Стр = Объект.ТаблицаКоэффициентов.Добавить();
					ЗаполнитьЗначенияСвойств(стр,СтрХран);
				КонецЦикла;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.Периодичность) Тогда
				Объект.ТипПериода = Перечисления.Периодичность.Квартал;
			КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Считать(Команда)
	СчитатьНастройки();
КонецПроцедуры

Процедура ЗаписатьНастройкиСервер()
	ОбъектДоговор = Объект.НачислениеВознаграждения.ДоговорКонтрагента.ПолучитьОбъект();
	ОбъектДоговор.НастройкиАлгоритма = Новый ХранилищеЗначения(Новый Структура("Значения,ЗаголовокНастроек", ПодготовитьСтруктуруХранилища(),Заголовок));
	ОбъектДоговор.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНастройкиСервер();
КонецПроцедуры
