Процедура ЦеннаяБумагаПроверкаВыборка(ЦБ, ДатаПроверки, НеОтказ) Экспорт
	
	Если ЗначениеЗаполнено(ЦБ) тогда
		ДатаСнятияСОбслуживания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦБ, "ДатаСнятияСОбслуживания");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЦБ) И Значениезаполнено(ДатаСнятияСОбслуживания) Тогда
		Если НачалоДня(ДатаСнятияСОбслуживания) <= НачалоДня(ДатаПроверки) Тогда
			Ответ	= Вопрос("Вы пытаетесь выбрать снятую с обслуживания ЦБ!!!
								|Продолжить?", РежимДиалогаВопрос.ДаНет);
								
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Возврат;
			Иначе
				НеОтказ	= Истина;				
			КонецЕсли; 
		КонецЕсли;
	Иначе
		НеОтказ	= Истина;
	КонецЕсли;
КонецПроцедуры
