 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    Версия = Версия();
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " "+Версия; 
	//ВидДокумента = "НачислениеВознаграждения";

	УстановитьВидимость(); 
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ДополнительнаяОбработка = ОбработкаОбъект.ДополнительнаяОбработка;
	Если Параметры.Свойство("ДополнительнаяОбработкаСсылка", ДополнительнаяОбработка) Тогда
		Если ДополнительнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка() Тогда
			ИмяОбработки = ОбработкаОбъект.Метаданные().Имя;
			ДополнительнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ИмяОбработки);
		КонецЕсли;
	Иначе
		ИмяОбработки = ОбработкаОбъект.Метаданные().Имя;
		ДополнительнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ИмяОбработки);
	КонецЕсли;
	
	Если ДополнительнаяОбработка <> Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка() Тогда
		Настройки = ДополнительнаяОбработка.ХранилищеНастроек.Получить();
		ОбработкаОбъект.УстановитьПользовательскиеНастройки(Настройки);
		
		ОбработкаОбъект.ДополнительнаяОбработка = ДополнительнаяОбработка;
		ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	КонецЕсли;
	
    Объект.Период = ТекущаяДатаСеанса(); 
	
	Если ТипЗнч(Параметры) = Тип("ДанныеФормыСтруктура") Тогда
		Если Параметры.Свойство("ЭтоЗачисленияНаРСРозничногоДУ") = Истина Тогда  
			Объект.ДатаПоступления = Параметры.ДатаПоступления;
			Объект.ВхНомер = Параметры.ВхНомер;
			Объект.НазначениеПлатежа = Параметры.НазначениеПлатежа;
		КонецЕсли;
	КонецЕсли;  
		
КонецПроцедуры

&НаСервере
Функция Версия() 
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Версия = ТекОбъект.Версия();
	
	Возврат Версия;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ЗаполнитьНачислениями(ВидДокумента, Истина);
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект"); 
	Объект.СуммаПоручений     = 0;  
	Объект.СуммаОбязательства = Объект.ДокументыКВыгрузке.Итог("СуммаОбязательства");
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)  
	
	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
		ТекстОшибки = "Поле ""Вид документа основания"" обязательно для заполнения";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СравниватьСБрокерскимиСуммами) Тогда
		ТекстОшибки = "Поле ""Сумму обязательства сравнивать с"" обязательно для заполнения";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	ЗаполнитьНаСервере();
	
	Если Объект.СравниватьСБрокерскимиСуммами = "БрокерскимСчетом" Тогда
		СформироватьПлатежноеПоручение();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтборПоЗеленымНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ЗаполнитьНачислениями(ВидДокумента, Истина);
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект"); 
	Объект.СуммаПоручений     = 0;  
	Объект.СуммаОбязательства = Объект.ДокументыКВыгрузке.Итог("СуммаОбязательства");
    УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоЗеленым(Команда)
	ОтборПоЗеленымНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	Объект.ВидДокументаОснования = ВидДокумента;
КонецПроцедуры

&НаСервере
Процедура СформироватьПлатежноеПоручениеНаСервере()
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект"); 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПлатежноеПоручение()
	
	ДатаПП = ОбщегоНазначения.ДатаСеанса();
	RUB = ПредопределенноеЗначение("Справочник.Валюты.RUB");
	USD = ПредопределенноеЗначение("Справочник.Валюты.USD");
	EUR = ПредопределенноеЗначение("Справочник.Валюты.EUR");
	
	Для каждого Строка Из Объект.ДокументыКВыгрузке Цикл
		
		Если Не ЗначениеЗаполнено(Строка.ПорученияВМидл) Тогда  
					
				Если Объект.СравниватьСБрокерскимиСуммами = "БрокерскимСчетом" И Строка.СуммаБрокерскийСчет < Строка.СуммаОбязательства Тогда
					Продолжить;	
				ИначеЕсли Объект.СравниватьСБрокерскимиСуммами = "РасчетнымСчетом" И Строка.СуммаРасчетныйСчет < Строка.СуммаОбязательства Тогда 
					Продолжить;
				КонецЕсли;	
				Отказ = Ложь;
				ТекстОтказа = "";
				
				РеквизитыПП = Новый Структура();
				РеквизитыПП.Вставить("ДокументОснование",	Строка.Основание);
				РеквизитыПП.Вставить("ВидДокумента",		Строка.ВидДокументаОснования);

				РеквизитыПП.Вставить("Статус",				ПредопределенноеЗначение("Перечисление.СтатусыОбъектов.Новый"));
				РеквизитыПП.Вставить("НеЗаполненоНазначениеПлатежа",Ложь);
				РеквизитыПП.Вставить("ДатаПлатежногоПоручения", 	Объект.Период + 60*60*9);
				РеквизитыПП.Вставить("СуммаОбязательства",  		Строка.СуммаОбязательства);
				РеквизитыПП.Вставить("ДоговорДУ",  					Строка.ДоговорДУ); 
				РеквизитыПП.Вставить("ДоговорКонтрагента",  		Строка.ДоговорПриемник);
				РеквизитыПП.Вставить("АналитическийСчетПриемник",  	Строка.АналитическийСчетПриемник);
				РеквизитыПП.Вставить("АналитическийСчетИсточник",  	Строка.АналитическийСчетИсточник);
                РеквизитыПП.Вставить("Контрагент",  				Строка.Контрагент);
                РеквизитыПП.Вставить("ЕРС",  						Строка.БанковскийСчет);

				Поручение = СоздатьПлатежноеПоручение(РеквизитыПП, Отказ, ТекстОтказа);
				
				Если Не Отказ Тогда
					Строка.ПорученияВМидл 			    = Поручение;
					Строка.Статус 						= РеквизитыПП.Статус;
					Строка.СуммаПоручений 				= Строка.СуммаОбязательства;
				Иначе
					Строка.Комментарий = ТекстОтказа;
				КонецЕсли; 
	 
		КонецЕсли;	
	КонецЦикла;
	
	Объект.СуммаПоручений = Объект.ДокументыКВыгрузке.Итог("СуммаПоручений");

	СформироватьПлатежноеПоручениеНаСервере();
	
КонецПроцедуры

&НаСервере
Функция СоздатьПлатежноеПоручение(РеквизитыПП, Отказ, ТекстОтказа)
	
	Основание = РеквизитыПП.ДокументОснование;
	ПлатежноеПоручение = Документы.Поручение.ПустаяСсылка();
	
	Если Основание.Проведен = Ложь Тогда
		Отказ = Истина;
		ТекстОтказа = НСтр("ru = 'Документ основание: %1 не проведен. Платежное поручение можно создать только на основании проведенного документа основания.'");
		ТекстОтказа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОтказа, Основание);
	КонецЕсли;
	
	ДокПоручение = Документы.Поручение.СоздатьДокумент();
	
	//Заполнение_по_документу_НАЧИСЛЕНИЕ_ЗАДОЛЖЕННОСТИ
	ЗаполнитьЗначенияСвойств(ДокПоручение, Основание);
	//
	ДокПоручение.Номер = "";
	Если ЗначениеЗаполнено(РеквизитыПП.ДатаПлатежногоПоручения) Тогда
		ДокПоручение.Дата = РеквизитыПП.ДатаПлатежногоПоручения;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ДокПоручение.Дата) Тогда
		ДокПоручение.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ДокПоручение.ВидОперации   			= Перечисления.ВидыОперацийПоручение.Перевод; 
	ДокПоручение.ДоговорДУ              = РеквизитыПП.ДоговорДУ;
	ДокПоручение.КлиентДУ               = РеквизитыПП.Контрагент;
	ДокПоручение.СчетКонтрагента        = РеквизитыПП.ЕРС;
	ДокПоручение.ДоговорКонтрагента     = РеквизитыПП.ДоговорКонтрагента;
	ДокПоручение.СуммаДС			    = РеквизитыПП.СуммаОбязательства;
	
	ДокПоручение.АналитическийСчетИсточник	= РеквизитыПП.АналитическийСчетИсточник;
	ДокПоручение.АналитическийСчетПриемник	= РеквизитыПП.АналитическийСчетПриемник;
	ДокПоручение.Комментарий				= ?(ВидДокумента = "НачислениеЗадолженности", "Оплата НДФЛ", "Оплата ВУК"); 
	
	ДокПоручение.КурсВзаиморасчетов			= 1;
	ДокПоручение.КратностьВзаиморасчетов	= 1;

	Если НЕ ДокПоручение.ПроверитьЗаполнение() Тогда
		Отказ = Истина;
		ТекстОтказа = НСтр("ru = 'Невозможно создать платежное поручение т.к не заполнены обязательные реквизиты:'");
		// Выводим сообщения о незаполненных реквизитах.
		СообщенияПользователю = ПолучитьСообщенияПользователю();
		Для каждого ТекСообщение Из СообщенияПользователю Цикл
			ТекстОтказа = ТекстОтказа + Символы.ПС + " - " + ТекСообщение.Текст;
		КонецЦикла;
		Возврат ДокПоручение.Ссылка;
	КонецЕсли;
	
	ДокПоручение.Ответственный 	= Пользователи.ТекущийПользователь();	
	
	Попытка
		ДокПоручение.Записать(РежимЗаписиДокумента.Проведение);
		ПлатежноеПоручение = ДокПоручение.Ссылка;
	Исключение
		Отказ = Истина;
		ТекстОтказа =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не удалось записать платежное поручение по причине ""%1""'"),ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ПлатежноеПоручение;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПлатежнаяПозицияПервыйЭтап(АналитическийСчет)
	
	БанковскийСчет = АналитическийСчет.МестоХранения;
	ДоговорДУ = АналитическийСчет.ДоговорДУ;
	СтруктураПлатежнойПозиции =  Документы.ПлатежноеПоручение.ПервыйЭтапПроверкиДостаточностиДС(БанковскийСчет, ДоговорДУ);
	СтруктураПлатежнойПозиции.Вставить("ДоговорДУ", ДоговорДУ);
	
	Возврат	СтруктураПлатежнойПозиции;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ВыполненВторойЭтапПроверкиДостаточностиДС(ДоговорДУ, ВалютаБС, СуммаПП, ДатаПП, Отказ)
	
	Возврат Документы.ПлатежноеПоручение.ВыполненВторойЭтапПроверкиДостаточностиДС(ДоговорДУ, ВалютаБС, СуммаПП, ДатаПП, Отказ);
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление() 
	
	УсловноеОформление.Элементы.Очистить();
	
	Если Объект.СравниватьСБрокерскимиСуммами = "БрокерскимСчетом"  Тогда
		
		Оформление = УсловноеОформление.Элементы.Добавить();
		Оформление.Использование = Истина;
		Оформление.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЗеленаяЛужайка);
		
		ЭлементОтбора = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДокументыКВыгрузке.СуммаОбязательства");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДокументыКВыгрузке.СуммаБрокерскийСчет");  
		ЭлементОтбора.Использование = Истина;  
		
		//Оформление.Оформление.УстановитьЗначениеПараметра("Видимость",Истина);
		
		ОформляемоеПоле = Оформление.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДокументыКВыгрузкеБрокерскийСчет");  
		
	Иначе                                                                                            
	
		//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		Оформление = УсловноеОформление.Элементы.Добавить();
		Оформление.Использование = Истина;
		Оформление.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЗеленаяЛужайка);
		
		ЭлементОтбора = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДокументыКВыгрузке.СуммаОбязательства");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДокументыКВыгрузке.СуммаРасчетныйСчет");  
		ЭлементОтбора.Использование = Истина;  
		
		//Оформление.Оформление.УстановитьЗначениеПараметра("Видимость",Истина);
		
		ОформляемоеПоле = Оформление.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДокументыКВыгрузкеРасчетныйСчетЕРС");

	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВвода(Число,Параметры) Экспорт
	
	Если Число = Неопределено Тогда
		ТекстОшибки = "Введите начальный номер входящего документа";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Объект.НомерВходящегоДокумента = СтрЗаменить(Строка(Число),Символы.НПП,"");
	
	ДатаПП = ОбщегоНазначения.ДатаСеанса();
	RUB = ПредопределенноеЗначение("Справочник.Валюты.RUB");
	USD = ПредопределенноеЗначение("Справочник.Валюты.USD");
	EUR = ПредопределенноеЗначение("Справочник.Валюты.EUR");
	
	НомерВходящегоДокумента = СтрЗаменить(Строка(Число),Символы.НПП,"");
	Для каждого Строка Из Объект.ДокументыКВыгрузке Цикл
		
		ТекстОтказа = "";
		Отказ = Ложь;
		Если ЗначениеЗаполнено(Строка.ПорученияВМидл) И НЕ ЗначениеЗаполнено(Строка.ПоступлениеНаРасчетныйСчет) Тогда				
			
			// Создание платежного поручения
			РеквизитыПП = Новый Структура();
			РеквизитыПП.Вставить("ДокументОснование",			 Строка.ПорученияВМидл);
			РеквизитыПП.Вставить("НомерВходящегоДокумента",		 НомерВходящегоДокумента);
			РеквизитыПП.Вставить("ДатаПлатежногоПоручения", 	 Объект.ДатаВвода + 60*60*9);
			РеквизитыПП.Вставить("СуммаОбязательства",  		 Строка.СуммаОбязательства);
			РеквизитыПП.Вставить("ДоговорДУ",  					 Строка.ДоговорДУ);
            РеквизитыПП.Вставить("БанковскийСчет",  			 Строка.БанковскийСчет);
			РеквизитыПП.Вставить("ДоговорКонтрагента",  		 Строка.ДоговорПриемник);
            РеквизитыПП.Вставить("АналитическийСчетПлательщик",  Строка.АналитическийСчетИсточник);             
			РеквизитыПП.Вставить("ДоговорДУПрефикс",  			 Строка.ДоговорДУПрефикс);                      
			РеквизитыПП.Вставить("АналитическийСчетПриемник",    Строка.АналитическийСчетПриемник); 
			РеквизитыПП.Вставить("Контрагент",    				 Строка.КонтрагентПоступление); 
            РеквизитыПП.Вставить("ЕРС",    				 		 Строка.БанковскийСчет);
			
			Поручение = СформироватьПоступлениеНаРасчетныйСчетНаСервере(РеквизитыПП, Отказ, ТекстОтказа);
			
			Если Не Отказ Тогда
				Строка.ПоступлениеНаРасчетныйСчет = Поручение;
				НомерВходящегоДокумента = НомерВходящегоДокумента;
			Иначе
				Строка.Комментарий = ТекстОтказа;
			КонецЕсли;
		Иначе
			Строка.Комментарий = Строка.Комментарий +"; Не создан документ постуления";	
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СформироватьПоступлениеНаРасчетныйСчетНаСервере(РеквизитыПП, Отказ, ТекстОтказа)
		
	Основание = РеквизитыПП.ДокументОснование;
	ПлатежноеПоручение = Документы.Поручение.ПустаяСсылка();
	
	Если Основание.Проведен = Ложь Тогда
		Отказ = Истина;
		ТекстОтказа = НСтр("ru = 'Документ основание: %1 не проведен. Поступленин на расчетный счет можно создать только на основании проведенного документа основания.'");
		ТекстОтказа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОтказа, Основание);
	КонецЕсли;
	
	ДокПоступление = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент(); 
	
	ДокПоступление.ЗаполнитьПоДокументуОснованию(Основание);
	//ЗаполнитьЗначенияСвойств(ДокПоступление, Основание);
	ДокПоступление.ВУ	 = Истина;
	ДокПоступление.БУ	 = Истина;
	ДокПоступление.УУ	 = Истина;
	
	ДокПоступление.НомерВходящегоДокумента       = РеквизитыПП.НомерВходящегоДокумента; 
	ДокПоступление.ДатаВходящегоДокумента        = РеквизитыПП.ДатаПлатежногоПоручения;
	ДокПоступление.Ответственный 			     = Пользователи.ТекущийПользователь();	
	ДокПоступление.СтатьяДвиженияДенежныхСредств = Объект.СтатьяДДС;
	ДокПоступление.СтатьяЗатрат 				 = Объект.СтатьяЗатрат;
	ДокПоступление.ДокументОснование 			 = Основание;  
	Если Не ЗначениеЗаполнено(ДокПоступление.ВидОперации) Тогда
		ДокПоступление.ВидОперации			     = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.СписаниеСБрокерскогоСчета; 
	КонецЕсли;
    ДокПоступление.СуммаДокумента				 = РеквизитыПП.СуммаОбязательства;
    ДокПоступление.СчетБанк					 	 = ПланыСчетов.Хозрасчетный.РасчетныеСчета; 
	ДокПоступление.СчетДоговораДУ				 = РеквизитыПП.ЕРС; 
	ДокПоступление.Контрагент                    = РеквизитыПП.Контрагент;
    ДокПоступление.ВалютаДокумента               = Основание.ВалютаДокумента;
   	ДокПоступление.Дата							 = РеквизитыПП.ДатаПлатежногоПоручения;
	ДокПоступление.ДоговорКонтрагента			 = РеквизитыПП.АналитическийСчетПлательщик.ДоговорКонтрагента;
	ДокПоступление.АналитическийСчетПлательщик	 = РеквизитыПП.АналитическийСчетПлательщик;
	ДокПоступление.АналитическийСчет			 = РеквизитыПП.АналитическийСчетПриемник;
	ДокПоступление.СчетУчетаРасчетовСКонтрагентом = Объект.СчетРасчетов;
    ДокПоступление.НазначениеПлатежа 		      = СформироватьНазначениеПлатежа(,Истина,РеквизитыПП.ДоговорДУПрефикс);

	Для Каждого Строка Из ДокПоступление.РасшифровкаПлатежа Цикл
		Строка.СчетУчетаРасчетовСКонтрагентом = Объект.СчетРасчетов; 
		Строка.СуммаПлатежа = ДокПоступление.СуммаДокумента;
	КонецЦикла;
	
	Если НЕ ДокПоступление.ПроверитьЗаполнение() Тогда
		Отказ = Истина;
		ТекстОтказа = НСтр("ru = 'Невозможно создать поступление на расчетный счет т.к не заполнены обязательные реквизиты:'");
		// Выводим сообщения о незаполненных реквизитах.
		СообщенияПользователю = ПолучитьСообщенияПользователю();
		Для каждого ТекСообщение Из СообщенияПользователю Цикл
			ТекстОтказа = ТекстОтказа + Символы.ПС + " - " + ТекСообщение.Текст;
		КонецЦикла;
		Возврат ДокПоступление.Ссылка;
	КонецЕсли;   
	
	Попытка
		ДокПоступление.Записать(РежимЗаписиДокумента.Проведение);
		ПлатежноеПоручение = ДокПоступление.Ссылка;
	Исключение
		Отказ = Истина;
		ТекстОтказа =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не удалось записать поступление на расчетный счет по причине ""%1""'"),ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ПлатежноеПоручение;
	
КонецФункции

&НаКлиенте
Процедура ПослеВводаДаты(Дата,Параметры) Экспорт
	
	Если Дата = Дата(1,1,1) ИЛИ Дата = Неопределено Тогда
		ТекстОшибки = "Нужно выбрать дату ввода";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Объект.ДатаВвода = Дата;
	Оповещение = Новый ОписаниеОповещения("ПослеВвода",ЭтотОбъект);
	ПоказатьВводЧисла(Оповещение,0,"Введите начальный входящий номер",10,0);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПоступлениеНаРасчетныйСчет(Команда)
	
	Если БлокировкаДенежныхСредств() Тогда
		ТекстОшибки = "Документ не соответствует виду сравнения";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДаты",ЭтотОбъект);
	ПоказатьВводДаты(Оповещение,0,"Выберите дату созданию поступления");
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСписания(Число,Параметры) Экспорт
	
	Если Число = Неопределено Тогда
		ТекстОшибки = "Введите начальный номер входящего документа";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ДатаПП = ОбщегоНазначения.ДатаСеанса();
	RUB = ПредопределенноеЗначение("Справочник.Валюты.RUB");
	USD = ПредопределенноеЗначение("Справочник.Валюты.USD");
	EUR = ПредопределенноеЗначение("Справочник.Валюты.EUR");
	
	Объект.НомерВходящегоДокумента 	= СтрЗаменить(Строка(Число),Символы.НПП,"");
	НомерВходящегоДокумента 		= СтрЗаменить(Строка(Число),Символы.НПП,"");
    ВидДокументаОснованияОбъект 	= Объект.ВидДокументаОснования; 
	//НалоговыйПериод 				= НалоговыеПериоды(); 
	СчетНДФЛ						= ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.НДФЛ"); 
	СчетВознаграждение				= ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасчетВознаграждениеУКЗаУправление");
	
	Для каждого Строка Из Объект.ДокументыКВыгрузке Цикл
		
		ТекстОтказа = "";
		Отказ = Ложь;
		Если ЗначениеЗаполнено(Строка.Основание) И НЕ ЗначениеЗаполнено(Строка.СписаниеСРасчетногоСчета) Тогда				
			// Создание платежного поручения
			РеквизитыПП = Новый Структура();
			РеквизитыПП.Вставить("ДокументОснование",			 Строка.Основание);
			РеквизитыПП.Вставить("ДоговорДУ",  					 Строка.ДоговорДУ);
			РеквизитыПП.Вставить("ДоговорКонтрагента",  		 Строка.ДоговорПриемник);
            РеквизитыПП.Вставить("АналитическийСчетПлательщик",  Строка.АналитическийСчетПриемник);
            РеквизитыПП.Вставить("НомерВходящегоДокумента",		 НомерВходящегоДокумента);
            РеквизитыПП.Вставить("ВидДокументаОснования",		 ВидДокументаОснованияОбъект);
            РеквизитыПП.Вставить("СчетНДФЛ",					 СчетНДФЛ);
			РеквизитыПП.Вставить("СчетВознаграждение",			 СчетВознаграждение);
            РеквизитыПП.Вставить("Контрагент",					 Строка.Контрагент);
			РеквизитыПП.Вставить("СчетКонтрагента",				 Строка.СчетКонтрагента);
			РеквизитыПП.Вставить("ИНН",				 			 "");
			РеквизитыПП.Вставить("Наименование",				 "");

			Попытка
				РеквизитыПП.ИНН 			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Контрагент,"ИНН");
				РеквизитыПП.Наименование 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Контрагент,"Наименование");
			Исключение
			КонецПопытки;

			РеквизитыПП.Вставить("УправляющаяКомпания",			 Строка.УправляющаяКомпания);
			РеквизитыПП.Вставить("ДоговорУправляющая",			 Строка.УправляющаяКомпания);
            РеквизитыПП.Вставить("ДоговорДУПрефикс",			 Строка.ДоговорДУПрефикс);
			РеквизитыПП.Вставить("ДатаСписания", 	             Объект.ДатаВвода + 60*60*9);
			РеквизитыПП.Вставить("СтавкаНДФЛ", 	                 Строка.СтавкаНДФЛ);
            РеквизитыПП.Вставить("НалоговыйПериод", 	         Строка.НалоговыйПериод);
			РеквизитыПП.Вставить("ЕРС",				 	         Строка.БанковскийСчет);
			 
			Списание = СформироватьСписаниеСРасчетногоСчетаНаСервере(РеквизитыПП, Отказ, ТекстОтказа);
			           
			Если Не Отказ Тогда
				Строка.СписаниеСРасчетногоСчета = Списание;
				НомерВходящегоДокумента = НомерВходящегоДокумента;
			Иначе
				Строка.Комментарий = ТекстОтказа;
			КонецЕсли;
		Иначе
			Строка.Комментарий = Строка.Комментарий +"; Не создан документ списания";	
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СформироватьСписаниеСРасчетногоСчетаНаСервере(РеквизитыПП, Отказ, ТекстОтказа)
	
	Основание = РеквизитыПП.ДокументОснование;
	ПлатежноеПоручение = Документы.СписаниеСРасчетногоСчета.ПустаяСсылка();
	
	Если Основание.Проведен = Ложь Тогда
		Отказ = Истина;
		ТекстОтказа = НСтр("ru = 'Документ основание: %1 не проведен. Поступленин на расчетный счет можно создать только на основании проведенного документа основания.'");
		ТекстОтказа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОтказа, Основание);
	КонецЕсли;
	
	ДокСписание = Документы.СписаниеСРасчетногоСчета.СоздатьДокумент();
    ДокСписание.ЗаполнитьПоДокументуОснованию(РеквизитыПП.ДокументОснование);
	
	ДокСписание.ВУ	 = Истина;
	ДокСписание.БУ	 = Истина;
	ДокСписание.УУ	 = Истина;

	Если РеквизитыПП.ВидДокументаОснования = "НачислениеЗадолженности" Тогда
		ДокСписание.ВидОперации 					= Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеНалога;
		ДокСписание.СчетУчетаРасчетовСКонтрагентом 	= РеквизитыПП.СчетНДФЛ;
		ДокСписание.СубконтоДт1 					= ?(ЗначениеЗаполнено(РеквизитыПП.СтавкаНДФЛ),РеквизитыПП.СтавкаНДФЛ,Перечисления.НДФЛСтавки.Ставка13);
		ДокСписание.СубконтоДт2 					= РеквизитыПП.НалоговыйПериод; 
		ДокСписание.НазначениеПлатежа 				= СформироватьНазначениеПлатежа(Истина,Ложь,РеквизитыПП.ДоговорДУПрефикс,РеквизитыПП.НалоговыйПериод);
	Иначе  
		ДокСписание.ВидОперации 					= Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочееСписание;
		ДокСписание.СчетУчетаРасчетовСКонтрагентом 	= РеквизитыПП.СчетВознаграждение;  
		ДокСписание.СубконтоДт1 					= РеквизитыПП.УправляющаяКомпания;
		ДокСписание.НазначениеПлатежа 				= СформироватьНазначениеПлатежа(Ложь,Ложь,РеквизитыПП.ДоговорДУПрефикс);
	КонецЕсли;
	
	ДокСписание.ИннПлательщика 					= РеквизитыПП.Инн; 
	ДокСписание.ИннПолучателя					= РеквизитыПП.Инн;
	ДокСписание.ТекстПлательщика 				= РеквизитыПП.Наименование; 
	ДокСписание.ТекстПолучателя 				= РеквизитыПП.Наименование;                                                                                                       
	
	ДокСписание.АналитическийСчет 				= РеквизитыПП.АналитическийСчетПлательщик;
	ДокСписание.СчетДоговораДУ 					= РеквизитыПП.ЕРС;
	
	ДокСписание.Контрагент 						= РеквизитыПП.Контрагент;
	ДокСписание.СчетКонтрагента 				= РеквизитыПП.СчетКонтрагента; 
	
	Если РеквизитыПП.ВидДокументаОснования = "НачислениеЗадолженности" Тогда 
		ДокСписание.СтатьяДвиженияДенежныхСредств = Объект.СтатьяДДССписаниеЗадолженность;
		ДокСписание.СтатьяЗатрат 				  = Объект.СтатьяЗатратСписаниеЗадолженность;
	Иначе	
		ДокСписание.СтатьяДвиженияДенежныхСредств = Объект.СтатьяДДССписание;
		ДокСписание.СтатьяЗатрат 				  = Объект.СтатьяЗатратСписание;
	КонецЕсли;

	ДокСписание.Ответственный 	= Пользователи.ТекущийПользователь();	
	ДокСписание.Дата 			= РеквизитыПП.ДатаСписания;
	
	ДокСписание.НомерВходящегоДокумента       = РеквизитыПП.НомерВходящегоДокумента; 
	ДокСписание.ДатаВходящегоДокумента        = ДокСписание.Дата;
	
 	Попытка
		ДокСписание.Записать(РежимЗаписиДокумента.Проведение);
		ПлатежноеПоручение = ДокСписание.Ссылка;
	Исключение
		Отказ = Истина;
		ТекстОтказа =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не удалось записать списание с расчетного счета по причине ""%1""'"),ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ПлатежноеПоручение;

КонецФункции                                                               

&НаКлиенте
Процедура ПослеВводаДатыСписания(Дата,Параметры)Экспорт
	Если Дата = Дата(1,1,1) ИЛИ Дата = Неопределено Тогда
		ТекстОшибки = "Нужно выбрать дату ввода";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Объект.ДатаВвода = Дата;
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСписания",ЭтотОбъект);
	ПоказатьВводЧисла(Оповещение,0,"Введите начальный входящий номер",10,0);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписаниеСРасчетногоСчета(Команда)
	
	Если БлокировкаДенежныхСредств() Тогда
		ТекстОшибки = "Документ не соответствует виду сравнения";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДатыСписания",ЭтотОбъект);
	ПоказатьВводДаты(Оповещение,0,"Выберите дату созданию списания");
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщенияНаСервере()
	ОписаниеОшибки = "";
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СформироватьИОтправитьПисьмо("Перевод", ОписаниеОшибки);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщения(Команда)
	ОтправитьСообщенияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если РасширенныеРеквизиты Тогда
		
		Элементы.ДокументыКВыгрузкеАналитическийСчетИсточник.Видимость = Истина;
		Элементы.ДокументыКВыгрузкеАналитическийСчетПриемник.Видимость = Истина;
		Элементы.ДокументыКВыгрузкеКонтрагент.Видимость = Истина;

	Иначе
		
		Элементы.ДокументыКВыгрузкеАналитическийСчетИсточник.Видимость = Ложь;
		Элементы.ДокументыКВыгрузкеАналитическийСчетПриемник.Видимость = Ложь;
        Элементы.ДокументыКВыгрузкеКонтрагент.Видимость = Ложь;

	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РасширенныеРеквизитыПриИзменении(Элемент)
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура СравниватьСБрокерскимиСуммамиПриИзменении(Элемент)
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Функция НалоговыеПериоды()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Периоды.Ссылка КАК Период
		|ИЗ
		|	Справочник.Периоды КАК Периоды
		|ГДЕ
		|	ГОД(Периоды.ДатаНачала) = ГОД(&Период)";
	
	Запрос.УстановитьПараметр("Период", Объект.Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Период;	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция СформироватьШаблонНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.СформироватьШаблон();

КонецФункции

&НаСервере
Функция ПолучитьМакетНаСервере(НаименованиеМакета)

	ДокОбъект = РеквизитФормыВЗначение("Объект");	
	
	Возврат ДокОбъект.ПолучитьМакет(НаименованиеМакета);

КонецФункции // ()

&НаКлиенте
Процедура СформироватьШаблон(Команда) 
   
	ШаблонВорд = СформироватьШаблонНаСервере(); 
	
	//ИмяВрем = ПолучитьИмяВременногоФайла(".docx");
	//ШаблонВорд.Записать(ИмяВрем);
	//ЗапуститьПриложение(ИмяВрем);

КонецПроцедуры               

&НаСервере
Функция СформироватьНазначениеПлатежа(НачислениеНДФЛ = Ложь,ПоступлениеНаРасчетныйСчет = Ложь, ПрефиксДоговораДУ = "", Период = "")
	
	НазначениеПлатежа = "";
	Если ПоступлениеНаРасчетныйСчет Тогда
		НазначениеПлатежа = СтрШаблон("Вывод денежных средств с брокерского счета 30601810100012100828, субсчет 13W6XW, НДС не облагается %1", ПрефиксДоговораДУ);
	ИначеЕсли Не ПоступлениеНаРасчетныйСчет И НЕ НачислениеНДФЛ Тогда
		НазначениеПлатежа = СтрШаблон("Вознаграждение согластно п.3 Приложения № 2 Договора %1 от 15.12.2025г. НДС не облагается", ПрефиксДоговораДУ);
	ИначеЕсли Не ПоступлениеНаРасчетныйСчет И НачислениеНДФЛ Тогда                                                                                             
		НазначениеПлатежа = СтрШаблон("Единый налоговый платеж. НДФЛ удержанный при выплате дохода за %2 год по Договору %1 от 15.12.2025. НДС не облагается.", ПрефиксДоговораДУ, Период);
	КонецЕсли;
	
	Возврат НазначениеПлатежа;
	
КонецФункции

&НаСервере
Процедура ДокументыКВыгрузкеПриИзмененииНаСервере()
	
	Объект.СуммаОбязательства = Объект.ДокументыКВыгрузке.Итог("СуммаОбязательства");
	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ДокументыКВыгрузкеПриИзменении(Элемент)
	ДокументыКВыгрузкеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Возврат;
	ТекстОшибки = "Было созданы Поручения в Мидл, отправьте сообщения получателям!";
	Если Объект.СравниватьСБрокерскимиСуммами = "БрокерскимСчетом" Тогда
		Если Объект.СуммаПоручений > 0 И НЕ Объект.РассылкаОтправлена Тогда
			ВызватьИсключение ТекстОшибки;   
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СформироватьБлокировкуДенежныхСредствНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.СформироватьБлокировкуДенежныхСредств();
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект"); 

КонецПроцедуры

&НаКлиенте
Процедура СформироватьБлокировкуДенежныхСредств(Команда)
	
	Если Не БлокировкаДенежныхСредств() Тогда
		ТекстОшибки = "Документ не соответствует виду сравнения";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	СформироватьБлокировкуДенежныхСредствНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеБлокировкаНаСервере()
	
	ОписаниеОшибки = "";
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СформироватьИОтправитьПисьмо("Блокировка", ОписаниеОшибки);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеБлокировка(Команда)
	ОтправитьСообщениеБлокировкаНаСервере();
КонецПроцедуры

&НаКлиенте
Функция БлокировкаДенежныхСредств()
	Если Объект.СравниватьСБрокерскимиСуммами = "УчитыватьОстаткиНаБрокерскомСчете"
		ИЛИ Объект.СравниватьСБрокерскимиСуммами = "НеУчитыватьОстаткиНаБрокерскомСчете" Тогда
		Возврат Истина;
	КонецЕсли; 
	Возврат Ложь;
КонецФункции









