
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		МЗ = РегистрыСведений.НастройкиРазбораТекстовыхДанных.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Запись.ИсходныйКлючЗаписи);
		МЗ.Прочитать();
		Настройка = МЗ.Настройка.Получить();
		
		
		Для Каждого ДоступнаяПеременная Из Настройка.ДоступныеПеременные Цикл
			
			ДоступныеПеременные.Добавить(ДоступнаяПеременная.Ключ, "СтруктураПроверяемыхЗначений." + ДоступнаяПеременная.Ключ + "");
			
		КонецЦикла;
		
		
		Если МЗ.ВидНастройки = 0 Тогда
			ВидНастройки = 0;						
		Иначе
			//скд
			ВидНастройки = 1;		
		КонецЕсли;	
		
	Иначе
		
		ВидНастройки = 0;
	КонецЕсли;
	
	ВидНастройкиПриИзмененииНаСервере();
	
	Если ВидНастройки = 0 Тогда 
		ТекстовоеВыражениеПроверки = Настройка.Данные;
	Иначе
		КомпоновщикНастроекКомпоновкиДанныхСКД.ЗагрузитьНастройки(Настройка.Данные);
		КомпоновщикНастроекКомпоновкиДанныхСКД.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);		
	КонецЕсли;
	

			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидНастройкиПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ВидНастройки = ВидНастройки;
	
	СтруктураПроверяемыхЗначений = Новый Структура;
	Для Каждого ДоступнаяПеременная Из ДоступныеПеременные Цикл
		СтруктураПроверяемыхЗначений.Вставить(ДоступнаяПеременная.Значение);
	КонецЦикла;
	
	
	Если ВидНастройки = 0 Тогда
		Настройка = Новый ХранилищеЗначения(Новый Структура("Данные, ДоступныеПеременные", ТекстовоеВыражениеПроверки, СтруктураПроверяемыхЗначений));
		ТекущийОбъект.Настройка = Настройка;
		
	Иначе
		
		Настройка = Новый ХранилищеЗначения(Новый Структура("Данные, ДоступныеПеременные", КомпоновщикНастроекКомпоновкиДанныхСКД.ПолучитьНастройки(), СтруктураПроверяемыхЗначений));
		ТекущийОбъект.Настройка = Настройка;
		
	КонецЕсли;
	
		
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНастройкиПриИзменении(Элемент)
	Элементы.ГруппаНастройкаТекст.Видимость = ВидНастройки = 0;
	Элементы.ГруппаНастройкаСКД.Видимость = ВидНастройки = 1;
	
	Если Элемент <> Неопределено Тогда
		ВидНастройкиПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидНастройкиПриИзмененииНаСервере()
	
	Если ВидНастройки = 0 Тогда
		Элементы.ДекорацияВидНастройки.Заголовок = "в Текст";
	Иначе
		Если КомпоновщикНастроекКомпоновкиДанныхСКД.ПолучитьНастройки().Структура.Количество() = 0 Тогда
			
			
			//инициализировать
			Структура = Новый Структура;
			Для Каждого ЭлементДоступнаяПеременная Из ДоступныеПеременные Цикл
				Структура.Вставить(ЭлементДоступнаяПеременная.Значение);
			КонецЦикла;
			
			СКД = РегистрыСведений.НастройкиРазбораТекстовыхДанных.ИнициализироватьНастройкиСКД(Структура);
			
			ДлинаПоля = СКД.НаборыДанных.Получить(0).Поля.Найти("ИмяВеткиУсловия").ТипЗначения.КвалификаторыСтроки.Длина;
			Если СтрДлина(Запись.Условие) > ДлинаПоля тогда
				Отказ = Ложь;
				Общегоназначения.СообщитьОбОшибке("Текст поля 'условие' слишком длинный, необходимо сократить соответствующее описание ветки условия в конфигурации (не более 1000 символов)", Отказ);
				ВидНастройки = 0;
				Возврат;
			КонецЕсли;		
			
			АдресСхемы = ПоместитьВоВременноеХранилище(СКД, Этаформа.УникальныйИдентификатор);
			
			КомпоновщикНастроекКомпоновкиДанныхСКД.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
			
			КомпоновщикНастроекКомпоновкиДанныхСКД.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
			Настройки = КомпоновщикНастроекКомпоновкиДанныхСКД.Настройки;
			
			Для Каждого КиЗ Из Структура Цикл
				
				//в структуру настроек СКД
				ВыбранноеПолеСКД = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
				ВыбранноеПолеСКД.Использование = Истина;
				ВыбранноеПолеСКД.Поле = Новый ПолеКомпоновкиДанных(КиЗ.Ключ);
				
			КонецЦикла;
			
			КомпоновщикНастроекКомпоновкиДанныхСКД.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
							
					
		КонецЕсли;
		Элементы.ДекорацияВидНастройки.Заголовок = "в СКД";
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Доступныепеременные.Количество() = 0 Тогда
		Общегоназначения.СообщитьОбОшибке("Не заданы доступные переменные, которыми будут передаваться значения для разбора текста", Отказ);
	КонецЕсли;
	
КонецПроцедуры



