
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДопСвойства = Неопределено;
	Если ЭтаФорма.Параметры.ЗначенияЗаполнения.Свойство("ДополнительныеСвойства",ДопСвойства) Тогда
		СоздатьСубклиентаПоДаннымАнкеты = Ложь;
		Если ДопСвойства.Свойство("СоздатьСубклиентаПоДаннымАнкеты",СоздатьСубклиентаПоДаннымАнкеты) Тогда
			ЭтаФорма.СоздатьСубклиентаПоДаннымАнкеты = СоздатьСубклиентаПоДаннымАнкеты;
			ЭтаФорма.РазрешитьСозданиеСубклиента = Истина;
		КонецЕсли;
		Контрагент = Неопределено;
		Если ДопСвойства.Свойство("Контрагент",Контрагент) Тогда
			ЭтаФорма.Контрагент = Контрагент;
		КонецЕсли;
		ДобавитьВПредоставленныеДокументы = Ложь;
		Если ДопСвойства.Свойство("ДобавитьВПредоставленныеДокументы",ДобавитьВПредоставленныеДокументы) Тогда
			ЭтаФорма.ДобавитьВПредоставленныеДокументы = ДобавитьВПредоставленныеДокументы;
			ЭтаФорма.РазрешитьДобавлениеВПредоставленныеДокументы = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьТипыФорм(ЭтаФорма);
	ОбновитьДоступностьСтавок(ЭтаФорма);
	ОбновитьВидимостьКонтрагента(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	НачислитьКомиссиюДепо = РегистрыСведений.ДокументыКНачислениюКомиссииДепо.НеобходимоНачислитьКомиссию(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РегистрыСведений.ДокументыКНачислениюКомиссииДепо.УстановитьЗначение(ТекущийОбъект.Ссылка, НачислитьКомиссиюДепо);
КонецПроцедуры

&НаКлиенте
Процедура ТипФормыПриИзменении(Элемент)
	СформироватьНаименованиеФормы();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеЛицаАнглПриИзменении(Элемент)
	СформироватьНаименованиеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЛицоПриИзменении(Элемент)
	
	Объект.ТипФормы = ПредопределенноеЗначение("Перечисление.ТипыФормW8.ПустаяСсылка");
	ОбновитьТипыФорм(ЭтаФорма);
	ОбновитьВидимостьКонтрагента(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяСтавкаДивидендыПриИзменении(Элемент)
	
	ОбновитьДоступностьСтавок(ЭтаФорма);
	Если НЕ Объект.ИспользуетсяСтавкаДивиденды Тогда
		Объект.СтавкаДивиденды = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяСтавкаКупоныПриИзменении(Элемент)
	
	ОбновитьДоступностьСтавок(ЭтаФорма);
	Если НЕ Объект.ИспользуетсяСтавкаКупоны Тогда
		Объект.СтавкаКупоны = 0;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура СформироватьНаименованиеФормы()
	
	Если ЗначениеЗаполнено(Объект.НаименованиеЛицаАнгл) И ЗначениеЗаполнено(Объект.ТипФормы) Тогда
		Объект.Наименование = Объект.НаименованиеЛицаАнгл + " (" + Объект.ТипФормы + ")";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТипыФорм(Форма)
	
	СписокВыбора = Форма.Элементы.ТипФормы.СписокВыбора;
	Объект = Форма.Объект;
	
	Форма.Элементы.ТипФормы.Доступность = ЗначениеЗаполнено(Объект.Лицо) ИЛИ Форма.СоздатьСубклиентаПоДаннымАнкеты;
	
	СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(Объект.Лицо) Тогда
		Если ТипЗнч(Объект.Лицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыФормW8.ФормаW8BEN"));
		Иначе
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыФормW8.ФормаW8BENE"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыФормW8.ФормаW8IMY"));
		КонецЕсли;
	ИначеЕсли Форма.СоздатьСубклиентаПоДаннымАнкеты Тогда
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыФормW8.ФормаW8BEN"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыФормW8.ФормаW8BENE"));
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДоступностьСтавок(Форма)
	
	Форма.Элементы.СтавкаДивиденды.Доступность = Форма.Объект.ИспользуетсяСтавкаДивиденды;
	Форма.Элементы.СтавкаКупоны.Доступность = Форма.Объект.ИспользуетсяСтавкаКупоны;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьКонтрагента(Форма)
	
	Если Форма.РазрешитьСозданиеСубклиента И НЕ ЗначениеЗаполнено(Форма.Объект.Лицо) Тогда
		ВидимостьГалкиСоздания = Истина;
	Иначе
		ВидимостьГалкиСоздания = Ложь;
		Форма.СоздатьСубклиентаПоДаннымАнкеты = Ложь;
	КонецЕсли;
	
	Если Форма.РазрешитьДобавлениеВПредоставленныеДокументы Тогда
		ВидимостьГалкиДобавления = Истина;
	Иначе
		ВидимостьГалкиДобавления = Ложь;
		Форма.ДобавитьВПредоставленныеДокументы = Ложь;
	КонецЕсли;
	
	Форма.Элементы.СоздатьСубклиентаПоДаннымАнкеты.Видимость = ВидимостьГалкиСоздания;
	Форма.Элементы.ДобавитьВПредоставленныеДокументы.Видимость = ВидимостьГалкиДобавления;
	
	Форма.Элементы.ГруппаКонтрагент.Видимость = ВидимостьГалкиСоздания ИЛИ ВидимостьГалкиДобавления;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСубклиентаПоДаннымАнкетыПриИзменении(Элемент)
	ОбновитьТипыФорм(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДобавитьВПредоставленныеДокументы",ДобавитьВПредоставленныеДокументы);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("СоздатьСубклиентаПоДаннымАнкеты",СоздатьСубклиентаПоДаннымАнкеты);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Контрагент",Контрагент);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если СоздатьСубклиентаПоДаннымАнкеты Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("Объект");
		Если Индекс<>Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;
		СпрОбъект = РеквизитФормыВЗначение("Объект");
		СпрОбъект.ДополнительныеСвойства.Вставить("СоздатьСубклиентаПоДаннымАнкеты",СоздатьСубклиентаПоДаннымАнкеты);
		СпрОбъект.ДополнительныеСвойства.Вставить("Контрагент",Контрагент);
		Если НЕ СпрОбъект.ПроверитьЗаполнение() Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	РазрешитьДобавлениеВПредоставленныеДокументы = Ложь;
	ОбновитьВидимостьКонтрагента(ЭтаФорма);
КонецПроцедуры

