
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Файлы(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Ответ	= Вопрос("Просмотр списка файлов и их редактирование доступно только для записанных элементов!
						 |
						 |Записать элемент и открыть список?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Записать();
		КонецЕсли;
	КонецЕсли;

	Форма = ПолучитьФорму("Справочник.Файлы.ФормаСписка");
	ОтборФайлов	= Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборФайлов.ЛевоеЗначение		= Форма.Список.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Объект").Поле;
	ОтборФайлов.ПравоеЗначение		= Объект.Ссылка;
	ОтборФайлов.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Форма.Заголовок					= Объект.Ссылка;
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ПерейтиУведомленияОтправленныеЧерезЛичныйКабинет(Команда)
	
	ФормаСписка = ПолучитьФорму("РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет.ФормаСписка");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаСписка.Список,"КД", Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно, Неопределено, Истина);
	ФормаСписка.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиУведомленияКлиентам(Команда)
	
	ФормаСписка = ПолучитьФорму("Документ.УведомлениеКлиентам.ФормаСписка");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаСписка.Список,"ДокументОснование", Объект.РСВ, ВидСравненияКомпоновкиДанных.Равно, Неопределено, Истина);
	ФормаСписка.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапросСубброкеруНаРаскрытие(Команда)
	
	Если Модифицированность Тогда 
		Если Вопрос("Для продолжения необходимо записать изменения. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда 
			Записать();
		Иначе 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Отказ = Ложь;
	ОтправитьЗапросСубброкеруНаРаскрытиеНаСервере(Отказ);	
	Если Отказ Тогда 
		Предупреждение("Не удалось выполнить отправку уведомлений");
	Иначе 
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьЗапросСубброкеруНаРаскрытиеНаСервере(Отказ)
	
	РазблокироватьДанныеФормыДляРедактирования();
	Документы.ЗапросСубброкеруНаРаскрытие.ОтправитьЗапросСубброкеруНаРаскрытие(Объект.Ссылка, Отказ, Параметры.Тестирование);	
	Прочитать();
	ЗаблокироватьДанныеФормыДляРедактирования();
	
 КонецПроцедуры




