
Функция КодЗагрузки(Организация, КлассификаторЗагрузки, Дата) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КодыЗагрузки.Код КАК КодЗагрузки
	|ИЗ
	|	Справочник.Организации КАК Организации
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|	ПО Организации.ЮридическоеЛицо = КодыЗагрузки.Владелец
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|	И КодыЗагрузки.Биржа = &КлассификаторЗагрузки
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|	И (КодыЗагрузки.ДатаОкончанияДействия > &Дата
	|			ИЛИ КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))");
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("КлассификаторЗагрузки",	КлассификаторЗагрузки);
	Запрос.УстановитьПараметр("Дата",					Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат СокрЛП(Выборка.КодЗагрузки);
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции
