Перем мНезаполненныеОбязательныеПоля;	// Массив имен элементов формы
Перем мОрганизация;
Перем мНаименованиеДепозитария;

//////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС МОДУЛЯ

Функция ВидимостьГруппы_БезДивидендов() Экспорт
	Возврат Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "CAPG, DVCA, DVSE")
			И НЕ Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1);
КонецФункции

Функция ВидимостьГруппы_РазмерДивидендов() Экспорт
	Возврат Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "DVCA, DVSE, CAPG, LIQU");
КонецФункции

Функция ВидимостьГруппы_ПогашаемаяЧасть() Экспорт
	Возврат Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "REDM, MCAL, PRED");
КонецФункции

Функция ВидимостьГруппы_КупонныйДоход() Экспорт
	Возврат Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "INTR");
КонецФункции

Функция ВидимостьГруппы_ИнициаторВыкупа() Экспорт
	Возврат Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "TEND, BIDS")
			И Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1);
КонецФункции

Функция ВидимостьГруппы_ЦенаРазмещения() Экспорт
	Возврат Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "PRIO")
			И Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1);
КонецФункции

Функция ВидимостьДатаКДПлан_ВыкупПриобретениеЦБ() Экспорт
	Возврат Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "BPUT")
			И Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1);
КонецФункции

Функция ВидимостьДатаФиксации_КонвертацияОбменЦБ() Экспорт
	Возврат Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "SPLF, SPLR, DECR, EXOF");
КонецФункции

Функция ВидимостьНовыйНоминалАкций() Экспорт
	Возврат Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "SPLF, SPLR, INCR");
КонецФункции

Функция ВидимостьГруппы_КрайнийСрокПриемаТребованийОКонвертации() Экспорт
	Возврат Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "CONV")
		И ПризнакОбязательностиКД = "VOLU"
		И Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1);
КонецФункции

Функция ВидимостьДатаВнесенияЗаписиЕГРЮЛ() Экспорт
	Возврат Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "SOFF")
			И Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1);
КонецФункции

Функция РезультатПодготовкиКОтправкеВЛКSendEmailToClients(ОбъектJSON, ПараметрыУведомления, ВнешнийИсточник = Неопределено) Экспорт
	
	ТекстСообщения = ТелоСообщения;
	Маркер = "#UrlToInstr#";
	ЗаменитьМаркерНаСсылкуДляУчастия(ТекстСообщения, Маркер);
	
	Клиенты = ПараметрыУведомления.ТаблицаКлиентов;
	Возврат ПодготовитьУведомлениеИнформационное(ОбъектJSON, Клиенты, ВнешнийИсточник);
КонецФункции

Функция РезультатОтправкиВЛКSendEmailToClients(ПараметрыУведомления, ОбработкаВебСервисы = Неопределено) Экспорт
	
	ТекстСообщения = ТелоСообщения;
	Маркер = "#UrlToInstr#";
	ЗаменитьМаркерНаСсылкуДляУчастия(ТекстСообщения, Маркер);
	
	Клиенты = ПараметрыУведомления.ТаблицаКлиентов;
	Возврат ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
				ОбработкаВебСервисы);	
КонецФункции
			
Функция РезультатОтправкиВЛКCreateCorporateActionTrec(ПараметрыУведомления, ОбработкаВебСервисы = Неопределено)
	
	ТекстСообщения = СтрЗаменить(ТелоСообщения, WTRCСообщенияQI.БлокУведомленияУчастиеВКорпоративномДействии(), "#UrlToVote#");	
	Если Ссылка = Документы.УведомлениеКлиентам.ПустаяСсылка() Тогда 
		Идентификатор = Строка(ПолучитьСсылкуНового().УникальныйИдентификатор());
	Иначе 
		Идентификатор = Строка(Ссылка.УникальныйИдентификатор());
	КонецЕсли;
	РезультатЗапросаПоДокументуКД = БизнесПроцессы.ОбработкаWTRCСообщения.РезультатЗапросаПоДокументуКД(ДокументОснование);
	ТаблицаКлиентов = ПараметрыУведомления.ТаблицаКлиентов.Скопировать(,"Unit, Isin, SecType, SecName, SecCode, ClientId, GosRegNumber, NominalValue, NominalCurrency, StakeToParticipate");	
	КодКД = ВидКД.Код;
	КодКД = СтрЗаменить(КодКД,"WTRC","NTRC");
	Возврат ВебСервисыСервер.РезультатОтправкиУведомленияПоВозвратуЧастиНалога(ТаблицаКлиентов,
				РезультатЗапросаПоДокументуКД, ЗаголовокСообщения, ТекстСообщения, Идентификатор, КодКД,
				ОбработкаВебСервисы);	
КонецФункции
			

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off

// Процедура - Отправить уведомление
// Отправляет уведомление в кабинет клиента
// Параметры:
//  ОбработкаВебСервисы	 - Неопределено, Обработка.TEST_ВебСервисы	 	- Обработка используемая для вызова методов веб сервиса кабинета клиента, используется для тестирования при недоступности кабинета клиента
//  ПараметрыУведомления - Структура 									- Дополнительные параметры отправки уведомлений 
//
Процедура ОтправитьУведомление(ОбработкаВебСервисы = Неопределено, ПараметрыУведомления = Неопределено) Экспорт
	
	Записывать = Истина;
	Если Документы.УведомлениеКлиентам.СтатусРазрешенДляОтправки(Статус)
		И НЕ ПометкаУдаления
		И (ВидКД.СпособУведомления = Перечисления.СпособыУведомления.ЛичныйКабинет
			ИЛИ ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.СвободнаяФорма) Тогда
		
		ТекущийМомент		= ТекущаяДата();
		ТекстСообщения		= ЭтотОбъект.ТелоСообщения;
		ГраницаДатыФиксации = Новый Граница(?(ЗначениеЗаполнено(ДатаФиксации), КонецДня(ДатаФиксации), КонецДня(ТекущаяДатаСеанса())),
			ВидГраницы.Включая);
		Успешно				= Ложь;
		ЦБПодпадаетПодНалоговоеРегулированиеСША = Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(ЦеннаяБумага1);
		
		Если Не ПараметрыУведомления = Неопределено Тогда 
		
			Записывать = Ложь;
			Успешно = Ложь;
			Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.SendEmailToClients
				ИЛИ ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.CreateCorporateActionWtrc Тогда
				
				Успешно = РезультатОтправкиВЛКSendEmailToClients(ПараметрыУведомления, ОбработкаВебСервисы);
				
			ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.CreateCorporateActionTrec Тогда
				
				Успешно = РезультатОтправкиВЛКCreateCorporateActionTrec(ПараметрыУведомления, ОбработкаВебСервисы);
					
			КонецЕсли;
			
			Клиенты = ПараметрыУведомления.ТаблицаКлиентов.Скопировать(,
				"Клиент, Договор, СчетДепо, РазделСчетаДепо, ЦеннаяБумага, Количество");
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбИзмененииОстатковЦБ Тогда 
			
			Клиенты = СписокКлиентовСвязанныхЗапросовСубброкераДляУведомлений();
			Успешно = ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
					ОбработкаВебСервисы);
			Если ВидКД.Код = "TREC" И Успешно Тогда 
				ОтправитьСвязанныеЗапросыСубброкеруНаРаскрытие();	
			КонецЕсли;
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.УведомлениеОРегистрацииЗаявкиВУКПаи Тогда
			
			Клиенты = СписокКлиентовЗаявкиВУК();
			Успешно = ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
					ОбработкаВебСервисы);
			
		ИначеЕсли Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "MEET, XMET, BMET, OMET") Тогда
			Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеКД
				ИЛИ ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбИтогахСобрания
				ИЛИ ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеСобрания Тогда
				
				Клиенты = КлиентыПоследнегоУведомленияНаОснованииКД(ДокументОснование);
				Успешно = ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
					ОбработкаВебСервисы);
				
			ИначеЕсли НЕ ЗначениеЗаполнено(ДатаФиксации) ИЛИ ДатаФиксации > ТекущийМомент Тогда
				Клиенты = СписокКлиентовДляОтправкиУведомлений(ТекущийМомент);
				Успешно = ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
					ОбработкаВебСервисы);
				
			Иначе
				Клиенты = СписокКлиентовДляОтправкиУведомлений(ГраницаДатыФиксации);
				Если ЕстьДанныеБюллетеня(ДокументОснование)
					И Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1) Тогда
					Если УжеСозданаСтраницаГолосованияВКабинетеКлиента() Тогда
						Успешно = ОбновитьДанныеСтраницыГолосования();
					Иначе
						Успешно = ОтправитьУведомлениеПоСобраниям(ЗаголовокСообщения, ТекстСообщения, Клиенты,
							ОбработкаВебСервисы);
					КонецЕсли;
				Иначе
					Успешно = ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
						ОбработкаВебСервисы);
				КонецЕсли;
			Конецесли;
			
		ИначеЕсли ВидКД.Код = "TEND"
			И (ПризнакОбязательностиКД = Перечисления.ПризнакиОбязательностиКД.MAND ИЛИ НомерСтатьи = "L848") Тогда
			Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеКД Тогда
				Клиенты = КлиентыПоследнегоУведомленияНаОснованииКД(ДокументОснование);				
			ИначеЕсли НЕ ЗначениеЗаполнено(ДатаФиксации) ИЛИ ДатаФиксации > ТекущийМомент Тогда
				Клиенты = СписокКлиентовДляОтправкиУведомлений(ТекущийМомент);				
			Иначе
				Клиенты = СписокКлиентовДляОтправкиУведомлений(ГраницаДатыФиксации);
			Конецесли;
			// Участия в КД не предполагается
			Успешно = ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
				ОбработкаВебСервисы);
			
		ИначеЕсли (ВидКД.Код = "BIDS" И НомерСтатьи = "L750")
				ИЛИ (ВидКД.Код = "BIDS" И НомерСтатьи = "L720")
				ИЛИ (ВидКД.Код = "BIDS" И НомерСтатьи = "")
				ИЛИ (ВидКД.Код = "TEND" И НомерСтатьи = "L841")
				ИЛИ (ВидКД.Код = "TEND" И НомерСтатьи = "L842")
				ИЛИ (ВидКД.Код = "TEND" И НомерСтатьи = "") Тогда
			
			Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеКД Тогда
				Клиенты = КлиентыПоследнегоУведомленияНаОснованииКД(ДокументОснование);
				Успешно = ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
					ОбработкаВебСервисы);
				
			ИначеЕсли ДатаФиксации > ТекущийМомент Тогда
				Клиенты = СписокКлиентовДляОтправкиУведомлений(ТекущийМомент);
				Успешно = ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
					ОбработкаВебСервисы);
				
			Иначе
				Клиенты = СписокКлиентовДляОтправкиУведомлений(ГраницаДатыФиксации);
				Если ЗначениеЗаполнено(СписокНезаполненныхОбязательныхПолей) Тогда
					Успешно = ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
						ОбработкаВебСервисы);
				Иначе	// Все обязательные поля заполнены
					Успешно = ОтправитьУведомлениеПоВыкупам(ЗаголовокСообщения, ТекстСообщения, Клиенты,
						ОбработкаВебСервисы);
				КонецЕсли;
			Конецесли;
			
		ИначеЕсли ВидКД.Код = "BPUT" Тогда
			Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеКД Тогда
				Клиенты = КлиентыПоследнегоУведомленияНаОснованииКД(ДокументОснование);
			Иначе
				Клиенты = СписокКлиентовДляОтправкиУведомлений(ТекущийМомент);
			Конецесли;
			// Возможность участия в КД пока не реализована
			Успешно = ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
				ОбработкаВебСервисы);
			
		ИначеЕсли ВидКД.Код = "PRIO" Тогда
			Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеКД Тогда
				Клиенты = КлиентыПоследнегоУведомленияНаОснованииКД(ДокументОснование);
			ИначеЕсли НЕ ЗначениеЗаполнено(ДатаФиксации) ИЛИ ДатаФиксации > ТекущийМомент Тогда
				Клиенты = СписокКлиентовДляОтправкиУведомлений(ТекущийМомент);
			Иначе
				Клиенты = СписокКлиентовДляОтправкиУведомлений(ГраницаДатыФиксации);
			Конецесли;
			// Возможность участия в КД пока не реализована
			Успешно = ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
				ОбработкаВебСервисы);
			
		ИначеЕсли ВидКД.Код = "WTRC" И ЦБПодпадаетПодНалоговоеРегулированиеСША Тогда
			ПараметрыWebСервиса = ПараметрыWebСервисаДляСообщенияWTRC();
			Клиенты = ПараметрыWebСервиса.Данные.Скопировать(,
				"Клиент, Договор, СчетДепо, РазделСчетаДепо, ЦеннаяБумага, Количество");
			Успешно = Документы.УведомлениеКлиентам.СохранитьКорпоративноеДействиеWTRC(ПараметрыWebСервиса, Ссылка, ОбработкаВебСервисы);
			
		ИначеЕсли ВидКД.Код = "TREC" ИЛИ (ВидКД.Код = "WTRC" И НЕ ЦБПодпадаетПодНалоговоеРегулированиеСША) Тогда
			Если НЕ ЗначениеЗаполнено(ДатаФиксации) ИЛИ ДатаФиксации > ТекущийМомент Тогда
				МоментФормирования = КонецДня(ДатаСообщения);
			Иначе
				МоментФормирования = ГраницаДатыФиксации;
			Конецесли;
			КодКД = ВидКД.Код;
			КодКД = СтрЗаменить(КодКД,"WTRC","NTRC");
			
			Если ВидКД.Код = "WTRC" ИЛИ ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалога Тогда
				// Отправка уведомления с поручением в КК
				Если ВидКД.Код = "WTRC" ИЛИ НЕ WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкера() Тогда
					// Отправка уведомления всем
					Клиенты = СписокКлиентовДляОтправкиУведомлений(МоментФормирования);
					Успешно = ОтправитьУведомлениеПоВозвратуЧастиНалога(ЗаголовокСообщения, ТекстСообщения, Клиенты,
					ОбработкаВебСервисы, КодКД);					
				КонецЕсли;
			ИначеЕсли WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкера(Дата)
				И ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалогаНДИНД Тогда
				Клиенты = СписокКлиентовДляОтправкиУведомлений(МоментФормирования);
				Если АктивнаяСсылка Тогда
					Успешно = ОтправитьУведомлениеПоВозвратуЧастиНалога(ЗаголовокСообщения, ТекстСообщения, Клиенты,
					ОбработкаВебСервисы, КодКД);
				Иначе 
					Успешно = ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
					ОбработкаВебСервисы);
				КонецЕсли;
			КонецЕсли;
			
			Если ВидКД.Код = "TREC" И Успешно Тогда 
				ОтправитьСвязанныеЗапросыСубброкеруНаРаскрытие();	
			КонецЕсли;
				
		ИначеЕсли ТребуетсяДобавитьИнформациюДляСубброкеров() Тогда
			Если НЕ ЗначениеЗаполнено(ДатаФиксации) ИЛИ ДатаФиксации > ТекущийМомент Тогда
				МоментФормирования = ТекущийМомент;
			Иначе
				МоментФормирования = ГраницаДатыФиксации;
			КонецЕсли;
			Клиенты = СписокКлиентовДляОтправкиУведомлений(МоментФормирования);
			Успешно = ОтправитьУведомлениеИнформационноеДляСубброкеров(ЗаголовокСообщения, ТекстСообщения, Клиенты,
				ОбработкаВебСервисы);
			
		ИначеЕсли Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "CHAN, OTHR") Тогда
			МоментФормирования = ТекущийМомент;
			Если ЗначениеЗаполнено(ДатаФиксации) и ДатаФиксации < ТекущийМомент Тогда				
				МоментФормирования = ГраницаДатыФиксации;
			КонецЕсли;

			Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеКД Тогда
				Клиенты = КлиентыПоследнегоУведомленияНаОснованииКД(ДокументОснование);
			Иначе
				Клиенты = СписокКлиентовДляОтправкиУведомлений(МоментФормирования);
			Конецесли;
			
			Успешно = ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
				ОбработкаВебСервисы);
			
		ИначеЕсли ВидКД.Код = "DSCL" Тогда
			Если ЗначениеЗаполнено(ДатаФиксации) Тогда
				Если ДатаФиксации > ТекущийМомент Тогда
					МоментФормирования = ТекущийМомент;
				Иначе
					МоментФормирования = ГраницаДатыФиксации;
				КонецЕсли;
			Иначе
				МоментФормирования = ДатаСообщения;
			Конецесли;
			
			Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеКД Тогда
				Клиенты = КлиентыПоследнегоУведомленияНаОснованииКД(ДокументОснование);
			Иначе
				Клиенты = СписокКлиентовДляОтправкиУведомлений(МоментФормирования);
			Конецесли;
			
			Успешно = ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
				ОбработкаВебСервисы, СсылкаДляУчастияВКД);
			
		Иначе
			Если НЕ ЗначениеЗаполнено(ДатаФиксации) ИЛИ ДатаФиксации > ТекущийМомент Тогда
				Клиенты = СписокКлиентовДляОтправкиУведомлений(ТекущийМомент);
			Иначе
				Клиенты = СписокКлиентовДляОтправкиУведомлений(ГраницаДатыФиксации);
			КонецЕсли;
			Успешно = ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты,
				ОбработкаВебСервисы);
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Если Успешно Тогда
			
			Если Ссылка = Документы.УведомлениеКлиентам.ПустаяСсылка() Тогда
				УведомлениеСсылка = ПолучитьСсылкуНового();
			Иначе 
				УведомлениеСсылка = Ссылка;
			КонецЕсли;
			
			РегистрацияУведомлений = WTRCСообщенияQI.КлиентыДляРегистрацииОтправленныхУведомлений(Клиенты);
			РегистрыСведений.УведомленияОтправленныеЧерезЛичныйКабинет.ЗафиксироватьУведомления(ТекущийМомент,
				УведомлениеСсылка, РегистрацияУведомлений);
			
			Запись = РегистрыСведений.ЭтапыКД.СоздатьМенеджерЗаписи();
			Запись.Период					= ТекущийМомент;
			Запись.КД						= УведомлениеСсылка;
			Запись.КодОтчета				= "";
			Запись.НомерСообщения			= "";
			Запись.НомерСообщенияИсходный	= "";
			Запись.Исходящее				= Истина;
			Запись.ТипУведомления			= Справочники.ТипыУведомления.NEWM();
			Запись.ЭтапКД					= Справочники.ЭтапыКД.УведомлениеКлиентов;
			Запись.Записать();
			
			ЭтотОбъект.Статус = Перечисления.СтатусыУведомленийКлиентам.Отправлено;
			Сообщение.Текст = "Отправлено: " + Ссылка;
		Иначе
			ЭтотОбъект.Статус = Перечисления.СтатусыУведомленийКлиентам.СбойОтправки;
			Сообщение.Текст = "Не отправлено: " + Ссылка;
		КонецЕсли;
		Если Записывать Тогда
			Сообщение.Сообщить();
			Записать();
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ДоотправитьУведомлениеСубброкерам(Клиенты, ОбработкаВебСервисы = Неопределено) Экспорт
	Если Статус = Перечисления.СтатусыУведомленийКлиентам.Отправлено
		И НЕ ПометкаУдаления
		И ТребуетсяДобавитьИнформациюДляСубброкеров() Тогда
		ТекстСообщения = ЭтотОбъект.ТелоСообщения;
		Успешно = ОтправитьУведомлениеИнформационноеДляСубброкеров(ЗаголовокСообщения, ТекстСообщения, Клиенты,
			ОбработкаВебСервисы);
		Если Успешно Тогда
			РегистрыСведений.УведомленияОтправленныеЧерезЛичныйКабинет.ДобавитьКлиентов(ТекущаяДата(),
				Ссылка, Клиенты);
			ТекстСообщенияПользователю = "Доотправлено субброкерам: " + Ссылка;
		Иначе
			ТекстСообщенияПользователю = "Не отправлено субброкерам: " + Ссылка;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю);
	КонецЕсли;
КонецПроцедуры

// Процедура создает записи типа Email в РС ЖурналИсходящихСообщенийKafka
//
// Параметры:
//  ПараметрыУведомления - Структура - Дополнительные параметры отправки уведомлений
//
Процедура ПодготовитьУведомление(ПараметрыУведомления = Неопределено) Экспорт
	
	ЭтоУведомлениеБезКД = ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.УведомлениеОРегистрацииЗаявкиВУКПаи;
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaEmail;
	Записывать = Истина;
	ФормироватьJSON = Документы.УведомлениеКлиентам.СтатусРазрешенДляОтправки(Статус)
		И Не ПометкаУдаления
		И (ЭтоУведомлениеБезКД
			Или ВидКД.СпособУведомления = Перечисления.СпособыУведомления.ЛичныйКабинет
			Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.СвободнаяФорма);
	Если ФормироватьJSON Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоСообщения);
		ОбъектJSON = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		ТекущийМомент = ТекущаяДатаСеанса();
		ДатаПоследнегоВходящегоСообщения = ДатаПоследнегоВходящегоСообщенияЭтапыКД();
		ТекстСообщения		= ЭтотОбъект.ТелоСообщения;
		ГраницаДатыФиксации = Новый Граница(?(ЗначениеЗаполнено(ДатаФиксации), КонецДня(ДатаФиксации), КонецДня(ТекущаяДатаСеанса())),
			ВидГраницы.Включая);
			
		Если ЗначениеЗаполнено(ДатаФиксации) Тогда
			МоментФормирования = ГраницаДатыФиксации;
		Иначе
			МоментФормирования = ДатаПоследнегоВходящегоСообщения;
		КонецЕсли;
		Успешно = Ложь;
		
		ЦБПодпадаетПодНалоговоеРегулированиеСША = Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(ЦеннаяБумага1);
		
		Если Не ПараметрыУведомления = Неопределено Тогда 
			Записывать = Ложь;
			Успешно = Ложь;
			Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.SendEmailToClients
				ИЛИ ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.CreateCorporateActionWtrc Тогда
				
				Успешно = РезультатПодготовкиКОтправкеВЛКSendEmailToClients(ОбъектJSON, ПараметрыУведомления, ВнешнийИсточник);
				// Открытый вопрос, пока не доработано
				//ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.CreateCorporateActionTrec Тогда
				//	
				//	Успешно = РезультатОтправкиВЛКCreateCorporateActionTrec(ПараметрыУведомления, ВнешнийИсточник);
				
			КонецЕсли;
			
			Клиенты = ПараметрыУведомления.ТаблицаКлиентов.Скопировать(,
			"Клиент, Договор, СчетДепо, РазделСчетаДепо, ЦеннаяБумага, Количество");
			ЗаполнитьMessageId(Клиенты);
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбИзмененииОстатковЦБ Тогда
			
			Клиенты = СписокКлиентовСвязанныхЗапросовСубброкераДляУведомлений();
			ЗаполнитьMessageId(Клиенты);
			Успешно = ПодготовитьУведомлениеИнформационное(ОбъектJSON, Клиенты, ВнешнийИсточник);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.УведомлениеОРегистрацииЗаявкиВУКПаи Тогда
			
			Клиенты = СписокКлиентовЗаявкиВУК();
			ЗаполнитьMessageId(Клиенты);
			Успешно = ПодготовитьУведомлениеИнформационное(ОбъектJSON, Клиенты, ВнешнийИсточник);
			
		ИначеЕсли Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "MEET, XMET, BMET, OMET") Тогда
			Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеКД
				ИЛИ ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбИтогахСобрания
				ИЛИ ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеСобрания Тогда
				Клиенты = КлиентыПоследнегоУведомленияНаОснованииКД(ДокументОснование);
			Иначе
				Клиенты = СписокКлиентовДляОтправкиУведомлений(МоментФормирования);
			КонецЕсли;
			ЗаполнитьMessageId(Клиенты);
			Успешно = ПодготовитьУведомлениеИнформационное(ОбъектJSON, Клиенты, ВнешнийИсточник);
			
		ИначеЕсли (ВидКД.Код = "BIDS" И НомерСтатьи = "L750")
			Или (ВидКД.Код = "BIDS" И НомерСтатьи = "L720")
			Или (ВидКД.Код = "BIDS" И НомерСтатьи = "")
			Или (ВидКД.Код = "TEND" И НомерСтатьи = "L841")
			Или (ВидКД.Код = "TEND" И НомерСтатьи = "L842")
			Или (ВидКД.Код = "TEND" И НомерСтатьи = "") 
			Или (ВидКД.Код = "TEND"
				И (ПризнакОбязательностиКД = Перечисления.ПризнакиОбязательностиКД.MAND ИЛИ НомерСтатьи = "L848"))
			Или Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "CHAN, OTHR, PRIO, DSCL") Тогда
			Клиенты = КлиентыДляОтправкиУведомленийСУчетомОтменыКД(МоментФормирования);
			ЗаполнитьMessageId(Клиенты);
			Успешно = ПодготовитьУведомлениеИнформационноеСУчетомОтменыКД(ВнешнийИсточник, МоментФормирования, ОбъектJSON, Клиенты);
			
		ИначеЕсли ВидКД.Код = "BPUT" Тогда
			Клиенты = КлиентыДляОтправкиУведомленийСУчетомОтменыКД(ДатаПоследнегоВходящегоСообщения);
			ЗаполнитьMessageId(Клиенты);
			Успешно = ПодготовитьУведомлениеИнформационноеСУчетомОтменыКД(ВнешнийИсточник, ДатаПоследнегоВходящегоСообщения, ОбъектJSON, Клиенты);
			
		ИначеЕсли ВидКД.Код = "TREC" ИЛИ (ВидКД.Код = "WTRC" И НЕ ЦБПодпадаетПодНалоговоеРегулированиеСША) Тогда
			КодКД = ВидКД.Код;
			КодКД = СтрЗаменить(КодКД, "WTRC", "NTRC");
			
			// открытый вопрос
			//Если ВидКД.Код = "WTRC" ИЛИ ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалога Тогда
			// Отправка уведомления с поручением в КК
			
			//Если ВидКД.Код = "WTRC" ИЛИ НЕ WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкера() Тогда
			//	// Отправка уведомления всем
			//	Клиенты = СписокКлиентовДляОтправкиУведомлений(МоментФормирования);
			//	Успешно = ОтправитьУведомлениеПоВозвратуЧастиНалога(ЗаголовокСообщения, ТекстСообщения, Клиенты,
			//	ВнешнийИсточник, КодКД);					
			//КонецЕсли;
			//ИначеЕсли WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкера(Дата)
			Если WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкера(Дата)
				И ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалогаНДИНД Тогда
				Клиенты = СписокКлиентовДляОтправкиУведомлений(МоментФормирования);
				// открытый вопрос
				//Если АктивнаяСсылка Тогда
				//	Успешно = ОтправитьУведомлениеПоВозвратуЧастиНалога(ЗаголовокСообщения, ТекстСообщения, Клиенты,
				//	ВнешнийИсточник, КодКД);
				//Иначе 
				ЗаполнитьMessageId(Клиенты);
				Успешно = ПодготовитьУведомлениеИнформационное(ОбъектJSON, Клиенты, ВнешнийИсточник);
				//КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ТребуетсяДобавитьИнформациюДляСубброкеров() Тогда
			Клиенты = СписокКлиентовДляОтправкиУведомлений(МоментФормирования);
			ЗаполнитьMessageId(Клиенты);
			Успешно = ПодготовитьУведомлениеИнформационноеДляСубброкеров(ОбъектJSON, Клиенты, ВнешнийИсточник);
			
		Иначе
			Клиенты = СписокКлиентовДляОтправкиУведомлений(МоментФормирования);
			ЗаполнитьMessageId(Клиенты);
			Успешно = ПодготовитьУведомлениеИнформационное(ОбъектJSON, Клиенты, ВнешнийИсточник);
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Если Успешно Тогда
			
			Если Ссылка = Документы.УведомлениеКлиентам.ПустаяСсылка() Тогда
				УведомлениеСсылка = ПолучитьСсылкуНового();
			Иначе 
				УведомлениеСсылка = Ссылка;
			КонецЕсли;
			
			РегистрацияУведомлений = WTRCСообщенияQI.КлиентыДляРегистрацииОтправленныхУведомлений(Клиенты);
			РегистрыСведений.УведомленияОтправленныеЧерезЛичныйКабинет.ЗафиксироватьУведомления(ТекущийМомент,
				УведомлениеСсылка, РегистрацияУведомлений);
				
			Если Не ЭтоУведомлениеБезКД Тогда
				Запись = РегистрыСведений.ЭтапыКД.СоздатьМенеджерЗаписи();
				Запись.Период					= ТекущийМомент;
				Запись.КД						= УведомлениеСсылка;
				Запись.КодОтчета				= "";
				Запись.НомерСообщения			= "";
				Запись.НомерСообщенияИсходный	= "";
				Запись.Исходящее				= Истина;
				Запись.ТипУведомления			= Справочники.ТипыУведомления.NEWM();
				Запись.ЭтапКД					= Справочники.ЭтапыКД.УведомлениеКлиентов;
				Запись.Записать();
			КонецЕсли;
			
			ЭтотОбъект.Статус = Перечисления.СтатусыУведомленийКлиентам.Отправлено;
			Сообщение.Текст = "Отправлено: " + Ссылка;
		Иначе
			ЭтотОбъект.Статус = Перечисления.СтатусыУведомленийКлиентам.СбойОтправки;
			Сообщение.Текст = "Не отправлено: " + Ссылка;
		КонецЕсли;
		Если Записывать Тогда
			Сообщение.Сообщить();
			Записать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьУведомлениеИнформационноеСУчетомОтменыКД(ВнешнийИсточник, МоментФормирования, ОбъектJSON, Клиенты)
	
	Возврат ПодготовитьУведомлениеИнформационное(ОбъектJSON, Клиенты, ВнешнийИсточник);

КонецФункции

//////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполненияИлиСтруктура, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполненияИлиСтруктура) = Тип("Структура") Тогда 
		Клиенты = ДанныеЗаполненияИлиСтруктура.Клиенты;
		ДанныеЗаполнения = ДанныеЗаполненияИлиСтруктура.Основание;
	Иначе
		ДанныеЗаполнения = ДанныеЗаполненияИлиСтруктура;	
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("БизнесПроцессСсылка.ОбработкаWTRCСообщения") Тогда 
		
		КорпоративноеДействиеСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения,"КД");
		ДокументОснование = КорпоративноеДействиеСсылка;
		ПараметрыКД = РегистрыСведений.ЭтапыКД.ПоследниеВходящиеПараметрыКД(ДокументОснование, Дата);
		АктуальныеРеквизиты = Документы.УведомлениеКлиентам.АктуальныеРеквизиты(ФормаСообщенияКК);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗапросСубброкеруНаРаскрытие") Тогда 
		
		КорпоративноеДействиеСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения,"КД");
		ДокументОснование = ДанныеЗаполнения;
		РСВ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения,"РСВ");
		ЗаголовокСообщения = ДанныеЗаполнения.ЗаголовокСообщения;
		ТелоСообщения = ДанныеЗаполнения.ТелоСообщения;
		ПараметрыКД = РегистрыСведений.ЭтапыКД.ПоследниеВходящиеПараметрыКД(КорпоративноеДействиеСсылка, Дата);
		АктуальныеРеквизиты = Документы.УведомлениеКлиентам.АктуальныеРеквизиты(ФормаСообщенияКК);
		Если ЗначениеЗаполнено(КорпоративноеДействиеСсылка) И ЗначениеЗаполнено(АктуальныеРеквизиты.ОбщиеКопируемые) Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, КорпоративноеДействиеСсылка, АктуальныеРеквизиты.ОбщиеКопируемые);
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, РСВ, "Эмитент, ЦеннаяБумага1, ЦеннаяБумага2, КДРеференс, ДатаФиксации");
			ЭтотОбъект.ВидКД = РСВ.ВидКорпоративногоДействия;
			ЭтотОбъект.ДатаСообщения = ТекущаяДатаСеанса();
		КонецЕсли;
		Статус = Перечисления.СтатусыУведомленийКлиентам.ОжидаетОтправки;
		Возврат;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Поручение") Тогда
		ДокументОснование = ДанныеЗаполнения;
		Если ЗначениеЗаполнено(ВходящийПакетИзФайловогоШлюза) Тогда
			ДатаСообщения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВходящийПакетИзФайловогоШлюза, "Дата");
		Иначе
			ДатаСообщения = ТекущаяДатаСеанса();
		КонецЕсли;
		РезультатЗапроса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ЦенныеБумагиСписываемые");
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЦеннаяБумага1 = Выборка.ЦеннаяБумага;
		Эмитент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦеннаяБумага1, "Эмитент");
		СформироватьJSON();
		Возврат;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ДанныеЗаполнения)
		ИЛИ ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.КорпоративноеДействие_Новый") Тогда
		
		ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.СвободнаяФорма;
		Статус = Перечисления.СтатусыУведомленийКлиентам.Новый;
		
		Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
			СформироватьJSON();
		КонецЕсли;
		Возврат;
		
	Иначе
		
		ДокументОснование = ДанныеЗаполнения;
		ПараметрыКД = РегистрыСведений.ЭтапыКД.ПоследниеВходящиеПараметрыКД(ДокументОснование, Дата);
		Если Не ЗначениеЗаполнено(ФормаСообщенияКК) Тогда 
			ФормаСообщенияКК = РегистрыСведений.ФормыСообщенийКабинетаКлиентаВТБКБ.ФормаСообщения(ДокументОснование.ВидКД,
			ПараметрыКД.Этап, ПараметрыКД.ТипУведомления,
			НЕ Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(ДокументОснование.ЦеннаяБумага1));
		КонецЕсли;
		АктуальныеРеквизиты = Документы.УведомлениеКлиентам.АктуальныеРеквизиты(ФормаСообщенияКК);
	
	КонецЕсли;

	
	Если ЗначениеЗаполнено(АктуальныеРеквизиты.ОбщиеКопируемые) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументОснование, АктуальныеРеквизиты.ОбщиеКопируемые);
	КонецЕсли;	
	Этап = ПараметрыКД.Этап;
	ТипУведомления = ПараметрыКД.ТипУведомления;
	
	Если ЗначениеЗаполнено(АктуальныеРеквизиты.СпецифичныеКопируемые) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументОснование, АктуальныеРеквизиты.СпецифичныеКопируемые);
	КонецЕсли;

	ДатаСообщения = ДокументОснование.Дата;
	
	// Маркер заменяется на реальную ссылку для голосования/участия в КД на стороне Web-сервиса
	СсылкаДляУчастияВКД = "#UrlToVote#";
	
	Если Эмитент <> ЦеннаяБумага1.Эмитент Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Эмитент в документе отличается от эмитента ценной бумаги №1";
		Сообщение.Сообщить();
	КонецЕсли;
	
	// Реквизиты, специфические для уведомлений, которые устанавливаются произвольно
	Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПоступленииМатериаловКОбщемуСобраниюВладельцев Тогда
		ДатаОкончанияГолосования	= ДокументОснование.ДатаОкончанияПриемаИнструкцийВТБКБ;
		ДатаКДПлан					= ДокументОснование.ДатаПроведенияСобрания;
		ПризнакОбязательностиКД		= Перечисления.ПризнакиОбязательностиКД.VOLU; // Не предусмотрен отправителем, заполняется для целей отбора
		ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента = ДокументОснование.ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента;
		
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПоступленииИнформацииИзБюллетеня Тогда
		ДатаОкончанияГолосования	= ДокументОснование.ДатаОкончанияПриемаИнструкцийВТБКБ;
		ПризнакОбязательностиКД		= Перечисления.ПризнакиОбязательностиКД.VOLU; // Не предусмотрен отправителем, заполняется для целей отбора
		
	ИначеЕсли  Перечисления.ФормыСообщенийКК.ЭтоФормаСвязаннаяСВыкупомИлиПриобретениемЦБ(ФормаСообщенияКК) Тогда
		ДатаНачалаПериода			= ДокументОснование.ДатаНачалаПриемаЗаявокНаВыкуп;
		ДатаОкончанияПериода		= ДокументОснование.ДатаОкончанияПриемаЗаявокНаВыкуп;
		ВалютаПлатежа				= ДокументОснование.БанковскийСчет.ВалютаДенежныхСредств;
		ВалютаДивидендаКупона		= ДокументОснование.ВалютаДивидендаКупона;
		ДатаКДПлан					= ДокументОснование.ДатаПроведенияСобрания;
		ДатаОкончанияГолосования	= ДокументОснование.ДатаОкончанияПриемаИнструкцийВТБКБ;
		КДРеференсСвязанныйСобрание	= КДРеференсСвязанныйСобрание(ДокументОснование);
			
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_КонвертацияОбменЦБ Тогда
		ДатаОкончанияГолосования	= ДокументОснование.ДатаОкончанияПриемаИнструкцийНРД;
		КДРеференсСвязанныйСобрание	= КДРеференсСвязанныйСобрание(ДокументОснование);
			
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ОбъединениеВыпусковЦБ Тогда
		ЦенныеБумаги.Очистить();
		Для Каждого Строка из ДокументОснование.ЦенныеБумаги Цикл
			НоваяСтрока = ЦенныеБумаги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЦикла;
			
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_РеорганизацииОбщества Тогда
		ДатаНачалаПериода			= ДокументОснование.ДатаНачалаБлокировки;
		ДатаОкончанияПериода		= ДокументОснование.ДатаОкончанияБлокировки;
		КДРеференсСвязанныйСобрание	= КДРеференсСвязанныйСобрание(ДокументОснование);
		
		ЦенныеБумаги.Очистить();
		Для Каждого Строка из ДокументОснование.ЦенныеБумаги Цикл
			НоваяСтрока = ЦенныеБумаги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЦикла;
		
	ИначеЕсли Перечисления.ФормыСообщенийКК.ЭтоФормаСвязаннаяСВыплатой(ФормаСообщенияКК) Тогда
		ДатаНачалаПериода		= ДокументОснование.ДатаНачалаКупонногоПериода;
		ДатаОкончанияПериода	= ДокументОснование.ДатаОкончанияКупонногоПериода;
		ВалютаДивидендаКупона	= ДокументОснование.ВалютаДивидендаКупона;
		
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ПодтверждениеОсвобожденияОтНалога Тогда
		ДатаОкончанияПриемаФормыW8 = Документы.КорпоративноеДействие_Новый.WTRC_ДатаОкончанияПриемаФормыW8(ДокументОснование);
		ДатаОкончанияПриемаПоручений1_5 = Документы.КорпоративноеДействие_Новый.WTRC_ДатаОкончанияПриемаПоручений1_5(ДокументОснование);
		ДатаОкончанияПриемаПоручений1_10 = Документы.КорпоративноеДействие_Новый.WTRC_ДатаОкончанияПриемаПоручений1_10(ДокументОснование);
	
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_РаскрытиеИнформации Тогда
		ДатаНачалаПериода		= ДокументОснование.ДатаНачалаПриемаЗаявокНаВыкуп;
		ДатаОкончанияПериода	= ДокументОснование.ДатаОкончанияПриемаЗаявокНаВыкуп;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер. ЕстьРеквизитИлиСвойствоОбъекта(ДокументОснование, "ДополнительнаяИнформация") Тогда
		ДополнительнаяИнформация = ДокументОснование.ДополнительнаяИнформация;
	Иначе
		ДополнительнаяИнформация = "";
	КонецЕсли;
	
	СформироватьJSON();
	Если ФормаСообщенияКК <> Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалогаНДИНД 
		Или мНезаполненныеОбязательныеПоля.Количество() = 0 Тогда
		// При загрузке КД TREC из НРД не загружается дата окончания приема инструкцию НРД, пользователь указывает ее вручную
		// только после этого мы создаем запросы по данному уведомлению
		СоздатьЗапросыСубброкераНаРаскрытие(Клиенты);
	КонецЕсли;
КонецПроцедуры
// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on

Процедура ПриКопировании(ОбъектКопирования)
	// Скопировать можно только заголовок и тело сообщения
	Для Каждого Реквизит Из ЭтотОбъект.Метаданные().Реквизиты Цикл
		Если НЕ (Реквизит.Имя = "ЗаголовокСообщения" ИЛИ Реквизит.Имя = "ТелоСообщения") Тогда
			ЭтотОбъект[Реквизит.Имя] = "";
		КонецЕсли;
	КонецЦикла;
	
	ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.СвободнаяФорма;
	Статус = Перечисления.СтатусыУведомленийКлиентам.Новый;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(ДокументОснование) ТОгда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан документ-основание!", Отказ);
	КонецЕсли;
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

Функция ПараметрыWebСервисаДляСообщенияWTRC()
	МассивДепонентов = ДепонентыДляОтправкиУведомленияWTRC();
	Данные = Документы.УведомлениеКлиентам.ДанныеДляWebСервисовWTRC(ДокументОснование, МассивДепонентов, Дата);
	
	ПараметрыWebСервиса = Новый Структура;
	ПараметрыWebСервиса.Вставить("Данные", Данные);
	ПараметрыWebСервиса.Вставить("РеференсКД", СокрЛП(КДРеференс));	
	ПараметрыWebСервиса.Вставить("НаименованиеЭмитента",
		Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	ПараметрыWebСервиса.Вставить("НаименованиеЦБ",		Справочники.ЦенныеБумаги.РусскоеНаименование(ЦеннаяБумага1));
	ПараметрыWebСервиса.Вставить("ДатаОкончанияПриемаПоручений1_10", ДатаОкончанияПриемаПоручений1_10);
	ПараметрыWebСервиса.Вставить("ДатаОкончанияПриемаПоручений1_5", ДатаОкончанияПриемаПоручений1_5);
	ПараметрыWebСервиса.Вставить("ЗаголовокСообщения",	ЗаголовокСообщения);
	ПараметрыWebСервиса.Вставить("ТекстСообщения",		ТелоСообщения);
	Возврат ПараметрыWebСервиса;
КонецФункции

Функция ДепонентыДляОтправкиУведомленияWTRC()
	// Депоненты с формой W8, у которых ЦБ не на налоговом разделе и нет условного длящегося поручения
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФормаW8.Депонент КАК Депонент
	|ПОМЕСТИТЬ втФормаW8
	|ИЗ
	|	РегистрСведений.ПредоставленныеДокументы.СрезПоследних(, ВидДокумента = &ФормаW8) КАК ФормаW8
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УсловноеДлящеесяПоручение.Депонент КАК Депонент
	|ПОМЕСТИТЬ втУсловноеДлящеесяПоручение
	|ИЗ
	|	РегистрСведений.ПредоставленныеДокументы.СрезПоследних(, ВидДокумента = &УсловноеДлящеесяПоручение) КАК УсловноеДлящеесяПоручение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Депоненты.Депонент КАК Депонент
	|ИЗ
	|	БизнесПроцесс.ОбработкаWTRCСообщения.Депоненты КАК Депоненты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втФормаW8 КАК ФормаW8
	|		ПО (ФормаW8.Депонент = Депоненты.Депонент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втУсловноеДлящеесяПоручение КАК УсловноеДлящеесяПоручение
	|		ПО (УсловноеДлящеесяПоручение.Депонент = Депоненты.Депонент)
	|ГДЕ
	|	Депоненты.Ссылка.КД = &КД
	|	И НЕ Депоненты.РазделСчетаПолучатель ЕСТЬ NULL 
	|	И НЕ Депоненты.Ссылка.ПометкаУдаления
	|	И Депоненты.Депонент.Субброкер = ЛОЖЬ
	|	И Депоненты.РазделСчета.ТипРазделаСчетаДЕПО <> &Налоговый
	|	И УсловноеДлящеесяПоручение.Депонент ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Депоненты.Депонент
	|ИЗ
	|	БизнесПроцесс.ОбработкаWTRCСообщения.Депоненты КАК Депоненты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втФормаW8 КАК ФормаW8
	|		ПО Депоненты.РазделСчета.Субклиент = ФормаW8.Депонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ втУсловноеДлящеесяПоручение КАК УсловноеДлящеесяПоручение
	|		ПО (УсловноеДлящеесяПоручение.Депонент = Депоненты.РазделСчета.Субклиент)
	|ГДЕ
	|	Депоненты.Ссылка.КД = &КД
	|	И НЕ Депоненты.РазделСчетаПолучатель ЕСТЬ NULL 
	|	И НЕ Депоненты.Ссылка.ПометкаУдаления
	|	И Депоненты.РазделСчета.РазделСубклиента = ИСТИНА
	|	И Депоненты.РазделСчета.ТипРазделаСчетаДЕПО <> &Налоговый
	|	И УсловноеДлящеесяПоручение.Депонент ЕСТЬ NULL
	|";
	Запрос.УстановитьПараметр("КД",			ДокументОснование);
	Запрос.УстановитьПараметр("Дата",		Дата);
	Запрос.УстановитьПараметр("ФормаW8",	Справочники.ВидыДокументовУдостоверяющихПолномочия.ФормаW8BENE_W8BEN);
	Запрос.УстановитьПараметр("УсловноеДлящеесяПоручение", Справочники.ВидыДокументовУдостоверяющихПолномочия.УсловноеДлящеесяПоручение);
	Запрос.УстановитьПараметр("Налоговый",	Перечисления.ТипыРазделовСчетовДЕПО.Налоговый);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Депонент");
КонецФункции
	
Функция СписокКлиентовДляОтправкиУведомлений(ДатаОстатков)
	СписокЦБ = ЦенныеБумагиДокумента();
	ВсеКлиенты = РегистрыСведений.УведомленияОтправленныеЧерезЛичныйКабинет.КлиентыИмеющиеЦенныеБумагиИзСписка(
		ДатаОстатков, СписокЦБ, ДокументОснование.СчетДЕПО);
	Возврат ВсеКлиенты;
КонецФункции

Функция СписокКлиентовДляОтчетаПоКлиентам(ДатаОстатков)
	СписокЦБ = ЦенныеБумагиДокумента();
	Клиенты = РегистрыСведений.УведомленияОтправленныеЧерезЛичныйКабинет.КлиентыИмеющиеЦенныеБумагиИзСписка(
		ДатаОстатков, СписокЦБ, ДокументОснование.СчетДЕПО);
    ПроверитьНаличиеКодаЗагрузкиКлиенты(Клиенты);
	Возврат Клиенты;
КонецФункции

Функция ЦенныеБумагиДокумента()
	
	СписокЦБ = Новый Массив;
	Если ЗначениеЗаполнено(ЦеннаяБумага1) Тогда
		ДобавитьЦенныеБумагиПоISIN(СписокЦБ, ЦеннаяБумага1.ISIN);
	КонецЕсли;	
	Если ЗначениеЗаполнено(ЦеннаяБумага2) Тогда
		ДобавитьЦенныеБумагиПоISIN(СписокЦБ, ЦеннаяБумага2.ISIN);
	КонецЕсли;
	Возврат СписокЦБ;

КонецФункции

Функция СписокКлиентовСвязанныхЗапросовСубброкераДляУведомлений()
	
	Возврат СписокКлиентовСвязанныхЗапросовСубброкера();
	
КонецФункции

Функция СписокКлиентовСвязанныхЗапросовСубброкераДляОтчета()
	
	Клиенты = СписокКлиентовСвязанныхЗапросовСубброкера();
    ПроверитьНаличиеКодаЗагрузкиКлиенты(Клиенты);
	Возврат Клиенты;
	
КонецФункции

Функция СписокКлиентовСвязанныхЗапросовСубброкера()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.Клиент КАК Клиент,
	|	Договоры.Ссылка КАК Договор,
	|	ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
	|	ЗапросСубброкеруНаРаскрытие.СчетДЕПО КАК СчетДЕПО,
	|	ЕСТЬNULL(Договоры.ДатаНачалоДействия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДоговора,
	|	ЕСТЬNULL(Договоры.Наименование, """") КАК НомерДоговора
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ЗапросСубброкеруНаРаскрытие.ISIN = ЦенныеБумаги.ISIN
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО ЗапросСубброкеруНаРаскрытие.СчетДЕПО.Владелец = Договоры.Владелец
	|			И ЗапросСубброкеруНаРаскрытие.СчетДЕПО.Владелец.Код = Договоры.Код
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.УведомлениеКлиентам = &УведомлениеКлиентам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыЗагрузкиКлиента.Код КАК ClientId,
	|	ВТ_Договоры.Клиент КАК Клиент,
	|	ВТ_Договоры.Договор КАК Договор,
	|	ВТ_Договоры.СчетДЕПО КАК СчетДЕПО,
	|	ВЫБОР
	|		КОГДА КодыЗагрузкиКлиента.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьКодЗагрузкиКлиенты,
	|	ВЫБОР
	|		КОГДА ВТ_Договоры.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|			ТОГДА ""физ""
	|		ИНАЧЕ ""юр""
	|	КОНЕЦ КАК ЮрФизЛицо,
	|	ВТ_Договоры.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """")
	|		ИНАЧЕ ""клиент""
	|	КОНЕЦ КАК Фамилия,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Имя, """")
	|		ИНАЧЕ Контрагенты.Наименование
	|	КОНЕЦ КАК Имя,
	|	ВТ_Договоры.ДатаДоговора КАК ДатаДоговора,
	|	ВТ_Договоры.НомерДоговора КАК НомерДоговора,
	|	ВТ_Договоры.Клиент.Наименование КАК КлиентНаименование
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиКлиента
	|			ПО Контрагенты.ЮридическиеФизическиеЛица = КодыЗагрузкиКлиента.Владелец
	|				И (НЕ КодыЗагрузкиКлиента.ПометкаУдаления)
	|				И (КодыЗагрузкиКлиента.Биржа = &КлассификаторыЗагрузкиКлиенты)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|					,
	|					ФизЛицо В
	|						(ВЫБРАТЬ
	|							ВТ_Договоры.Клиент.ЮридическиеФизическиеЛица КАК КлиентЮридическиеФизическиеЛица
	|						ИЗ
	|							ВТ_Договоры КАК ВТ_Договоры)) КАК ФИОФизЛицСрезПоследних
	|			ПО Контрагенты.ЮридическиеФизическиеЛица = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ПО ВТ_Договоры.СчетДЕПО.Владелец = Контрагенты.Ссылка");
	
	Запрос.УстановитьПараметр("КлассификаторыЗагрузкиКлиенты", Справочники.КлассификаторыЗагрузки.Клиенты);
	
	Если Ссылка.Пустая() Тогда 
		Запрос.УстановитьПараметр("УведомлениеКлиентам",		ПолучитьСсылкуНового());
	Иначе 
		Запрос.УстановитьПараметр("УведомлениеКлиентам",		Ссылка);
	КонецЕсли;
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция СписокКлиентовЗаявкиВУК()
	
	СтруктураРеквизитовПоручения = Новый Структура;
	СтруктураРеквизитовПоручения.Вставить("Депонент",					 "Депонент");
	СтруктураРеквизитовПоручения.Вставить("ДепонентИмя",				 "Депонент.Наименование");
	СтруктураРеквизитовПоручения.Вставить("ЮридическиеФизическиеЛица",	 "Депонент.ЮридическиеФизическиеЛица");
	СтруктураРеквизитовПоручения.Вставить("ЮрФизЛицо",					 "Депонент.ЮрФизЛицо");
	СтруктураРеквизитовПоручения.Вставить("СчетДепо",					 "СчетДепо");
	СтруктураРеквизитовПоручения.Вставить("РазделСчетаДепо",			 "РазделСчетаДепо");
	РеквизитыПоручения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, СтруктураРеквизитовПоручения);
	
	Клиенты = НоваяТаблицаКлиентов();
	КлиентВЗаявке = Клиенты.Добавить();
	КлиентВЗаявке.Клиент = РеквизитыПоручения.Депонент;
	КлиентВЗаявке.Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоКлиенту(РеквизитыПоручения.Депонент);
	КлиентВЗаявке.СчетДепо = РеквизитыПоручения.СчетДепо;
	КлиентВЗаявке.РазделСчетаДепо = РеквизитыПоручения.РазделСчетаДепо;
	КлиентВЗаявке.ЦеннаяБумага = ЦеннаяБумага1;
	CrmClientId = Обработки.РегистрацияКлиентаЧерезKafka.CrmClientId(РеквизитыПоручения.ЮридическиеФизическиеЛица);
	КлиентВЗаявке.ClientId = ?(ЗначениеЗаполнено(CrmClientId), СокрЛП(CrmClientId), Неопределено);
	Если Не ЗначениеЗаполнено(КлиентВЗаявке.ClientId) Тогда
		Если ЗначениеЗаполнено(КлиентВЗаявке.Договор) Тогда
			РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КлиентВЗаявке.Договор, "Наименование, ДатаНачалоДействия");
			КлиентВЗаявке.НомерДоговора = СокрЛП(РеквизитыДоговора.Наименование);
			КлиентВЗаявке.ДатаДоговора = РеквизитыДоговора.ДатаНачалоДействия;
		КонецЕсли;
		Если РеквизитыПоручения.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			ФИО = РегистрыСведений.ФИОФизЛиц.СрезПоследних(ТекущаяДатаСеанса(),
				Новый Структура("ФизЛицо", РеквизитыПоручения.ЮридическиеФизическиеЛица));
			Если ЗначениеЗаполнено(ФИО) Тогда
				КлиентВЗаявке.Имя = ФИО[0].Имя;
				КлиентВЗаявке.Фамилия = ФИО[0].Фамилия;
			КонецЕсли;
		Иначе
			КлиентВЗаявке.Имя = РеквизитыПоручения.ДепонентИмя;
			КлиентВЗаявке.Фамилия = "клиент";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Клиенты;
	
КонецФункции

Функция НоваяТаблицаКлиентов()
	
	ТаблицаКлиентов = Новый ТаблицаЗначений();
	ТаблицаКлиентов.Колонки.Добавить("Клиент",			, Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаКлиентов.Колонки.Добавить("Договор"			, Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаКлиентов.Колонки.Добавить("СчетДепо"			, Новый ОписаниеТипов("СправочникСсылка.СчетаДепо"));
	ТаблицаКлиентов.Колонки.Добавить("РазделСчетаДепо"	, Новый ОписаниеТипов("СправочникСсылка.РазделыСчетаДепо"));
	ТаблицаКлиентов.Колонки.Добавить("ЦеннаяБумага"		, Новый ОписаниеТипов("СправочникСсылка.ЦенныеБумаги"));
	ТаблицаКлиентов.Колонки.Добавить("Количество"		, Метаданные.ОпределяемыеТипы.КоличествоЦБ.Тип);
	ТаблицаКлиентов.Колонки.Добавить("ClientId"			, ОбщегоНазначения.ОписаниеТипаСтрока("20"));
	ТаблицаКлиентов.Колонки.Добавить("Имя"				, ОбщегоНазначения.ОписаниеТипаСтрока("50"));
	ТаблицаКлиентов.Колонки.Добавить("Фамилия"			, ОбщегоНазначения.ОписаниеТипаСтрока("50"));
	ТаблицаКлиентов.Колонки.Добавить("НомерДоговора"	, ОбщегоНазначения.ОписаниеТипаСтрока("150"));
	ТаблицаКлиентов.Колонки.Добавить("ДатаДоговора"		, ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	
	Возврат ТаблицаКлиентов;
	
КонецФункции


Функция ЕстьДанныеБюллетеня(КД)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыКД.КД КАК КД
	|ИЗ
	|	РегистрСведений.ЭтапыКД КАК ЭтапыКД
	|ГДЕ
	|	ЭтапыКД.КД = &КД
	|	И ЭтапыКД.ЭтапКД.Код = &Код";
	Запрос.УстановитьПараметр("КД",		КД);
	Запрос.УстановитьПараметр("Код",	"CA014");	// Информация из Бюллетеня
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

Функция ПредставлениеОбязательнойВалюты(Валюта, ИмяЭлементаФормы)
	Если ЗначениеЗаполнено(Валюта) Тогда
		Возврат Справочники.Валюты.ПредставлениеВалюты(Валюта);
	Иначе
		мНезаполненныеОбязательныеПоля.Добавить(ИмяЭлементаФормы);
		Возврат "";
	КонецЕсли;	
КонецФункции

Функция КДРеференсСвязанныйСобрание(ДокументОснование)
	КодКД = ДокументОснование.КДРеференсСвязанныйСсылка.ВидКД.Код;
	Возврат	?(СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("MEET,XMET").Найти(КодКД)	<> Неопределено,
				ДокументОснование.КДРеференсСвязанный, "");
КонецФункции

Функция ФорматДаты(Д)
	Возврат	Формат(Д, "ДЛФ=Д");
КонецФункции

Функция ФорматОбязательнойДаты(Д, ИмяЭлементаФормы)
	Если ЗначениеЗаполнено(Д) Тогда
		Возврат	ФорматДаты(Д);
	Иначе
		мНезаполненныеОбязательныеПоля.Добавить(ИмяЭлементаФормы);
		Возврат "";
	КонецЕсли;
КонецФункции

Функция ФорматДатыСоВременем(Д)
	Возврат	Формат(Д, "ДФ=""дд.ММ.гггг ЧЧ:мм""");
КонецФункции

Функция ФорматОбязательнойДатыСоВременем(Д, ИмяЭлементаФормы)
	Если ЗначениеЗаполнено(Д) Тогда
		Возврат	ФорматДатыСоВременем(Д);
	Иначе
		мНезаполненныеОбязательныеПоля.Добавить(ИмяЭлементаФормы);
		Возврат "";
	КонецЕсли;
КонецФункции

Функция ФорматОбязательнойСтроки(Стр, ИмяЭлементаФормы)
	Если ЗначениеЗаполнено(Стр) Тогда
		Возврат	СокрЛП(Стр);
	Иначе
		мНезаполненныеОбязательныеПоля.Добавить(ИмяЭлементаФормы);
		Возврат "";
	КонецЕсли;
КонецФункции

Функция ФорматОбязательнойСуммы(Сумма, ИмяЭлементаФормы)
	Если Сумма <> 0 Тогда
		Возврат	Строка(Сумма);
	Иначе
		мНезаполненныеОбязательныеПоля.Добавить(ИмяЭлементаФормы);
		Возврат "0";
	КонецЕсли;
КонецФункции

Функция ФорматОбязательнойСуммыСВалютой(Сумма, Валюта, ИмяЭлементаФормы)
	Если Сумма <> 0 Тогда
		Возврат	Строка(Сумма) + " " + Справочники.Валюты.ПредставлениеВалюты(Валюта);
	Иначе
		мНезаполненныеОбязательныеПоля.Добавить(ИмяЭлементаФормы);
		Возврат "0 " + Справочники.Валюты.ПредставлениеВалюты(Валюта);
	КонецЕсли;
КонецФункции

Функция ФорматНеобязательнойСуммыСВалютой(Сумма, Валюта, ИмяЭлементаФормы)
	Если Сумма <> 0 Тогда
		Возврат	Строка(Сумма) + " " + Справочники.Валюты.ПредставлениеВалюты(Валюта);
	Иначе
		мНезаполненныеОбязательныеПоля.Добавить(ИмяЭлементаФормы);
		Возврат "";
	КонецЕсли;
КонецФункции

Функция НаименованиеКД_ОбъединениеВыпусковЦБ()
	Если ЦенныеБумаги.Количество() = 0 Тогда
		мНезаполненныеОбязательныеПоля.Добавить("ЦБ_ОбъединениеВыпусковЦБ");
		Возврат "";
	КонецЕсли;
	
	СписокISIN = Новый Структура;
	Для Каждого Строка из ЦенныеБумаги Цикл
		ISIN = СокрЛП(Строка.ЦеннаяБумага.ISIN);
		Если ЗначениеЗаполнено(ISIN) Тогда
			СписокISIN.Вставить(ISIN);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В строке " + Строка.НомерСтроки + " таблицы ценных бумаг не указана ЦБ или ее ISIN";
			Сообщение.Сообщить();
			мНезаполненныеОбязательныеПоля.Добавить("ЦБ_ОбъединениеВыпусковЦБ");
			Возврат "";
		КонецЕсли;
	КонецЦикла;
	
	Если СписокISIN.Количество() = 1 Тогда	// ISIN бумаг, участвующих в КД, одинаковый
		Возврат "Объединение выпусков ценных бумаг";
	Иначе									// ISIN бумаг, участвующих в КД, различный
		Возврат "Аннулирование дополнительных выпусков акций";
	КонецЕсли;
КонецФункции

Функция ХарактеристикиЦБ_ОбъединениеВыпусковЦБ()
	ХарактеристикиЦБ = "";
	Если ЦенныеБумаги.Количество() = 0 Тогда
		мНезаполненныеОбязательныеПоля.Добавить("ЦБ_ОбъединениеВыпусковЦБ");
		ХарактеристикиЦБ = "";
	Иначе	
		Для Каждого Строка Из ЦенныеБумаги Цикл
			ХарактеристикиЦБ = ХарактеристикиЦБ
				+ Строка(Строка.ЦеннаяБумага.ТипЦБ) + " "
				+ СокрЛП(Строка.ЦеннаяБумага.НомерРегистрации) + ", "
				+ СокрЛП(Строка.ЦеннаяБумага.ISIN)
				+ ?(Строка.НомерСтроки < ЦенныеБумаги.Количество(), " / ", "");
		КонецЦикла;
	КонецЕсли;
	Возврат ХарактеристикиЦБ;
КонецФункции

Функция Выпуски_ОбъединениеВыпусковЦБ(Тип)
	Выпуски = "";
	Отбор = Новый Структура("ДтКт", Тип);
	Строки = ЦенныеБумаги.НайтиСтроки(Отбор);
	Если Строки.Количество() = 0 Тогда
		мНезаполненныеОбязательныеПоля.Добавить("ЦБ_ОбъединениеВыпусковЦБ");
		Выпуски = "";
	Иначе
		Для Каждого Строка из Строки Цикл
			Выпуски = Выпуски + СокрЛП(Строка.ЦеннаяБумага.НомерРегистрации) + " / "
			+ СокрЛП(Строка.ЦеннаяБумага.ISIN) + "<br/>";
		КонецЦикла;
	КонецЕсли;
	Возврат Выпуски;
КонецФункции

Функция СписокISINЦенныхБумаг(Тип)
	СписокISIN = "";
	Отбор = Новый Структура("ДтКт", Тип);
	Строки = ЦенныеБумаги.НайтиСтроки(Отбор);
	Если Строки.Количество() = 0 Тогда
		мНезаполненныеОбязательныеПоля.Добавить("ЦБ_РеорганизацииОбщества");
		СписокISIN = "";
	Иначе
		Для Инд = 0 По Строки.Количество()-1 Цикл
			СписокISIN = СписокISIN	+ СокрЛП(Строки[Инд].ЦеннаяБумага.ISIN)	+ ?(Инд < Строки.Количество()-1, ", ", "");
		КонецЦикла;
	КонецЕсли;
	Возврат СписокISIN;
КонецФункции

Функция ПредставлениеСсылки(URL)
	Возврат ?(ЗначениеЗаполнено(URL), "С деталями корпоративного действия Вы можете ознакомиться по ссылке: " + URL, "");
КонецФункции

Процедура ЗаменитьМаркерНаСсылкуДляУчастия(ОбъектJSON, Ссылка)
	Если ОбъектJSON.Data.ReplaceFields.Свойство("СсылкаДляУчастияВГолосовании") Тогда
		ОбъектJSON.Data.ReplaceFields.СсылкаДляУчастияВГолосовании = "";
	ИначеЕсли ОбъектJSON.Data.ReplaceFields.Свойство("СсылкаДляУчастияВКорпоративномДействии") Тогда
		ОбъектJSON.Data.ReplaceFields.СсылкаДляУчастияВКорпоративномДействии = "";
	ИначеЕсли ОбъектJSON.Data.ReplaceFields.Свойство("СсылкаНаСтраницуКДВКабинетеКлиента") Тогда
		ОбъектJSON.Data.ReplaceFields.СсылкаНаСтраницуКДВКабинетеКлиента = "";
	КонецЕсли;
КонецПроцедуры

Функция ПодписьСообщения()
	КомментарийHTML = "";
	Если ФормаСообщенияКК <> Перечисления.ФормыСообщенийКК.СвободнаяФорма Тогда
		КомментарийHTML = ДобавитьПараграфыHTML(Комментарий);
	КонецЕсли;
	Возврат КомментарийHTML + Символы.ПС + Документы.УведомлениеКлиентам.ПодписьСообщения(Дата);
КонецФункции

Функция ПодписьДляJSON()
	
	УведомлениеОЗадержкеВыплат = "";
	Подпись = СокрЛП(Документы.УведомлениеКлиентам.ПодписьСообщения(Дата));
	
	Возврат Подпись;
	
КонецФункции

Функция ПредставлениеНомераСтатьи()
	Представление = "";
	Если Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1)
		И НЕ Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "BPUT") Тогда
		Если НомерСтатьи = "L400" Тогда
			НомерСтатьиВСообщении = "40 ОП";
		ИначеЕсли НомерСтатьи = "L401" Тогда
			НомерСтатьиВСообщении = "40 ЗП";
		ИначеЕсли НомерСтатьи = "L720" Тогда
			НомерСтатьиВСообщении = "72";
		ИначеЕсли НомерСтатьи = "L750" Тогда
			НомерСтатьиВСообщении = "75";
		ИначеЕсли НомерСтатьи = "L841" Тогда
			НомерСтатьиВСообщении = "84.1";
		ИначеЕсли НомерСтатьи = "L842" Тогда
			НомерСтатьиВСообщении = "84.2";
		ИначеЕсли НомерСтатьи = "L848" Тогда
			НомерСтатьиВСообщении = "84.8";
		Иначе
			НомерСтатьиВСообщении = "";
			мНезаполненныеОбязательныеПоля.Добавить("НомерСтатьи_ВыкупПриобретениеЦБ");
		КонецЕсли;
		Представление = "по статье " + НомерСтатьиВСообщении;
	КонецЕсли;
	Возврат Представление;
КонецФункции

Функция ПредставлениеПериодаПроведения()
	Представление = "";
	Если Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1) Тогда
		Представление = "Период проведения: с %1 по %2";
		Представление = СтрЗаменить(Представление, "%1", ФорматОбязательнойДаты(ДатаНачалаПериода, "ДатаНачалаПериодаПроведения"));
		Представление = СтрЗаменить(Представление, "%2", ФорматОбязательнойДаты(ДатаОкончанияПериода, "ДатаОкончанияПериодаПроведения"));
		
	ИначеЕсли ЗначениеЗаполнено(ДатаНачалаПериода) И ЗначениеЗаполнено(ДатаОкончанияПериода) Тогда
		Представление = "Период проведения: с %1 по %2";
		Представление = СтрЗаменить(Представление, "%1", ФорматДаты(ДатаНачалаПериода));
		Представление = СтрЗаменить(Представление, "%2", ФорматДаты(ДатаОкончанияПериода));
	КонецЕсли;
	
	Возврат Представление;
КонецФункции

Функция ПредставлениеПризнакаОбязательностиКД(ИмяЭлементаФормы)
	Если ПризнакОбязательностиКД = Перечисления.ПризнакиОбязательностиКД.VOLU Тогда
		Представление = "Добровольное событие, для участия требуются инструкции.";
		
	ИначеЕсли ПризнакОбязательностиКД = Перечисления.ПризнакиОбязательностиКД.MAND Тогда
		Представление = "Обязательное событие, инструкций не требуется.";
		
	ИначеЕсли ПризнакОбязательностиКД = Перечисления.ПризнакиОбязательностиКД.CHOS Тогда
		Представление = "Обязательное событие, требуются инструкции.";
		
	Иначе
		мНезаполненныеОбязательныеПоля.Добавить(ИмяЭлементаФормы);
		Представление = "";
	КонецЕсли;
	Возврат Представление;
КонецФункции

Функция ДатаФиксацииВыкупаПриобретенияЦБ()
	Если ЗначениеЗаполнено(ДатаФиксации) Тогда
		Представление = ФорматДаты(ДатаФиксации);
	Иначе
		Если (ВидКД.Код = "TEND" И ПризнакОбязательностиКД = "VOLU")
			ИЛИ (ВидКД.Код = "BIDS" И НомерСтатьи = "L720")
			ИЛИ ВидКД.Код = "PRIO" Тогда
			Представление = "";
				
		ИначеЕсли (ВидКД.Код = "TEND" И ПризнакОбязательностиКД = "MAND")
			ИЛИ (ВидКД.Код = "BIDS" И НомерСтатьи = "L750") Тогда
			мНезаполненныеОбязательныеПоля.Добавить("ДатаФиксации_ВыкупПриобретениеЦБ");
			Представление = "";
		КонецЕсли;
	КонецЕсли;
	
	ДатаФиксацииОбязательна = (ВидКД.Код = "TEND" И ПризнакОбязательностиКД = "MAND")
								ИЛИ (ВидКД.Код = "BIDS" И НомерСтатьи = "L750");	
	
	Возврат Представление;
КонецФункции

Функция ХарактеристикиЦБ()
	Если ЗначениеЗаполнено(ЦеннаяБумага1)
		И ЗначениеЗаполнено(ЦеннаяБумага1.ТипЦБ)
		И ЗначениеЗаполнено(ЦеннаяБумага1.ISIN) Тогда
		Возврат СокрЛП(ЦеннаяБумага1.ТипЦБ) + " " + СокрЛП(ЦеннаяБумага1.ISIN)
				+ ?(ЗначениеЗаполнено(ЦеннаяБумага2), " / " + СокрЛП(ЦеннаяБумага2.ТипЦБ) + " "
					+ СокрЛП(ЦеннаяБумага2.ISIN), "");
	Иначе
		мНезаполненныеОбязательныеПоля.Добавить("ЦеннаяБумага1");
		Возврат "";
	КонецЕсли;
КонецФункции

// Каждая строка преобразуется в параграф HTML <p></p>. Пустые строки игнорируются.
//
// Параметры:
// Текст - многострочная строка
//
// Возвращаемое значение:
// строка
Функция ДобавитьПараграфыHTML(Текст) Экспорт
	Строки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Текст, Символы.ПС);	
	Результат = "";
	Для Каждого Строка Из Строки Цикл
		Если ЗначениеЗаполнено(Строка) Тогда
			Результат = Результат + ?(ЗначениеЗаполнено(Результат), Символы.ПС, "") + "<p>" + СокрЛП(Строка) + "</p>";
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Процедура ДобавитьЦенныеБумагиПоISIN(СписокЦБ, ISIN)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка КАК ЦеннаяБумага
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|ГДЕ
	|	ЦенныеБумаги.ISIN В (&СписокISIN)";
	Запрос.УстановитьПараметр("СписокISIN", ISIN);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СписокЦБ.Найти(Выборка.ЦеннаяБумага) = Неопределено Тогда
			СписокЦБ.Добавить(Выборка.ЦеннаяБумага);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Для данного КД выбираем записи последнего уведомления, т.к. интересны остатки на дату фиксации,
// которыми клиент имеет право участвовать в КД.
Функция КлиентыПоследнегоУведомленияНаОснованииКД(КД)
	Возврат СообщенияПоследнегоУведомленияНаОснованииКД(КД);
КонецФункции

Функция КлиентыПоследнегоУведомленияДляОтчетаПоКлиентам(КД)
	
	Клиенты = СообщенияПоследнегоУведомленияНаОснованииКД(КД);
    ПроверитьНаличиеКодаЗагрузкиКлиенты(Клиенты);
	Возврат Клиенты;
	
КонецФункции

Процедура ПроверитьНаличиеКодаЗагрузкиКлиенты(Клиенты)
	
	Для Каждого Клиент Из Клиенты Цикл
		Если Не Клиент.ЕстьКодЗагрузкиКлиенты Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = СтрШаблон("У клиента %1 в %2 лице нет кода загрузки с типом ""Клиенты""",
				Клиент.КлиентНаименование, Клиент.ЮрФизЛицо);
			СообщениеПользователю.Сообщить();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция СообщенияПоследнегоУведомленияНаОснованииКД(Знач КД)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Уведомления.Клиент КАК Клиент,
	|	Уведомления.Договор КАК Договор,
	|	Уведомления.СчетДепо КАК СчетДепо,
	|	Уведомления.РазделСчетаДепо КАК РазделСчетаДепо,
	|	Уведомления.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Уведомления.Количество КАК Количество,
	|	КодыЗагрузкиКлиента.Код КАК ClientId,
	|	ВЫБОР
	|		КОГДА КодыЗагрузкиКлиента.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьКодЗагрузкиКлиенты,
	|	ВЫБОР
	|		КОГДА Уведомления.Клиент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|			ТОГДА ""физ""
	|		ИНАЧЕ ""юр""
	|	КОНЕЦ КАК ЮрФизЛицо,
	|	ЕСТЬNULL(Уведомления.Договор.Наименование, """") КАК НомерДоговора,
	|	ЕСТЬNULL(Уведомления.Договор.ДатаНачалоДействия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДоговора
	|ПОМЕСТИТЬ ВТ_ДанныеУведомления
	|ИЗ
	|	РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК Уведомления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиКлиента
	|		ПО Уведомления.Клиент.ЮридическиеФизическиеЛица = КодыЗагрузкиКлиента.Владелец
	|			И (НЕ КодыЗагрузкиКлиента.ПометкаУдаления)
	|			И (КодыЗагрузкиКлиента.Биржа = &КлассификаторыЗагрузкиКлиенты)
	|ГДЕ
	|	Уведомления.КД ССЫЛКА Документ.УведомлениеКлиентам
	|	И НЕ Уведомления.КД.ПометкаУдаления
	|	И ВЫРАЗИТЬ(Уведомления.КД КАК Документ.УведомлениеКлиентам).ДокументОснование = &КД
	|	И Уведомления.КД.Дата В
	|			(ВЫБРАТЬ
	|				МАКСИМУМ(Уведомления.КД.Дата) КАК Дата
	|			ИЗ
	|				РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК Уведомления
	|			ГДЕ
	|				Уведомления.КД ССЫЛКА Документ.УведомлениеКлиентам
	|				И НЕ Уведомления.КД.ПометкаУдаления
	|				И ВЫРАЗИТЬ(Уведомления.КД КАК Документ.УведомлениеКлиентам).ДокументОснование = &КД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеУведомления.Клиент КАК Клиент,
	|	ВТ_ДанныеУведомления.Договор КАК Договор,
	|	ВТ_ДанныеУведомления.СчетДепо КАК СчетДепо,
	|	ВТ_ДанныеУведомления.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ВТ_ДанныеУведомления.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_ДанныеУведомления.Количество КАК Количество,
	|	ВТ_ДанныеУведомления.ClientId КАК ClientId,
	|	ВТ_ДанныеУведомления.ЕстьКодЗагрузкиКлиенты КАК ЕстьКодЗагрузкиКлиенты,
	|	ВТ_ДанныеУведомления.ЮрФизЛицо КАК ЮрФизЛицо,
	|	ВТ_ДанныеУведомления.НомерДоговора КАК НомерДоговора,
	|	ВТ_ДанныеУведомления.ДатаДоговора КАК ДатаДоговора,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеУведомления.Клиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """")
	|		ИНАЧЕ ""клиент""
	|	КОНЕЦ КАК Фамилия,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеУведомления.Клиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Имя, """")
	|		ИНАЧЕ ВТ_ДанныеУведомления.Клиент.Наименование
	|	КОНЕЦ КАК Имя,
	|	ВТ_ДанныеУведомления.Клиент.Наименование КАК КлиентНаименование
	|ИЗ
	|	ВТ_ДанныеУведомления КАК ВТ_ДанныеУведомления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|				,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_ДанныеУведомления.Клиент.ЮридическиеФизическиеЛица КАК КлиентЮридическиеФизическиеЛица
	|					ИЗ
	|						ВТ_ДанныеУведомления КАК ВТ_ДанныеУведомления)) КАК ФИОФизЛицСрезПоследних
	|		ПО ВТ_ДанныеУведомления.Клиент.ЮридическиеФизическиеЛица = ФИОФизЛицСрезПоследних.ФизЛицо";
	Запрос.УстановитьПараметр("КД", КД);
	Запрос.УстановитьПараметр("КлассификаторыЗагрузкиКлиенты", Справочники.КлассификаторыЗагрузки.Клиенты);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Возвращаемое значение:
//	Истина, если для данного КД уже была создана страница для голосования в кабинете клиента
Функция УжеСозданаСтраницаГолосованияВКабинетеКлиента()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УведомлениеКлиентам.Ссылка КАК ДокументУведомлениеСсылка
	|ИЗ
	|	Документ.УведомлениеКлиентам КАК УведомлениеКлиентам
	|ГДЕ
	|	УведомлениеКлиентам.ДокументОснование = &ДокументОснование
	|	И НЕ УведомлениеКлиентам.ПометкаУдаления
	|	И УведомлениеКлиентам.СозданаСтраницаГолосованияВКабинетеКлиента";
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

Функция ОбновитьДанныеСтраницыГолосования()
	СообщитьОбОшибке("Страница для голосования была создана ранее.");
	Возврат Истина;
КонецФункции

Процедура СообщитьОбОшибке(ОписаниеОшибки)
	ИмяСобытия = "Вызов внешнего веб-сервиса для отправки уведомления о КД";
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Предупреждение,,, ОписаниеОшибки);
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ОписаниеОшибки;
	Сообщение.Сообщить();
КонецПроцедуры

Процедура УстановитьСтатусЕстьРахожденияВПоследнихПолученныхЗапросах(КорпоративноеДействиеСсылка, ЗапросыСубброкеру)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.Клиент КАК Клиент,
	|	ЗапросСубброкеруНаРаскрытие.Ссылка КАК Запрос
	|ПОМЕСТИТЬ НовыеЗапросы
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.Ссылка В(&ЗапросыСубброкеру)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапросСубброкеруНаРаскрытие.Клиент,
	|	ЗапросСубброкеруНаРаскрытие.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.Клиент КАК Клиент,
	|	МАКСИМУМ(ЗапросСубброкеруНаРаскрытие.ДатаВремяОтправкиЗапроса) КАК ДатаПоследнейОтправки
	|ПОМЕСТИТЬ ДатаИВремяОтправкиЗапросов
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.КД = &КорпоративноеДействиеСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапросСубброкеруНаРаскрытие.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.Ссылка КАК ЗапросСубброкеру,
	|	ЗапросСубброкеруНаРаскрытие.Клиент КАК Клиент
	|ПОМЕСТИТЬ ПоследниеОтправленныеЗапросыСубброкеру
	|ИЗ
	|	ДатаИВремяОтправкиЗапросов КАК ДатаИВремяОтправкиЗапросов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|		ПО (ЗапросСубброкеруНаРаскрытие.КД = &КорпоративноеДействиеСсылка)
	|			И ДатаИВремяОтправкиЗапросов.Клиент = ЗапросСубброкеруНаРаскрытие.Клиент
	|			И ДатаИВремяОтправкиЗапросов.ДатаПоследнейОтправки = ЗапросСубброкеруНаРаскрытие.ДатаВремяОтправкиЗапроса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветСубброкераНаРаскрытие.Ссылка КАК ОтветСубброкера,
	|	ОтветСубброкераНаРаскрытие.ЗапросНаРСВ.Клиент КАК Клиент,
	|	ОтветСубброкераНаРаскрытие.Дата КАК ДатаПолучения,
	|	ОтветСубброкераНаРаскрытие.ЗапросНаРСВ КАК ЗапросНаРСВ
	|ПОМЕСТИТЬ ОтветыСубброкера
	|ИЗ
	|	Документ.ОтветСубброкераНаРаскрытие КАК ОтветСубброкераНаРаскрытие
	|ГДЕ
	|	ОтветСубброкераНаРаскрытие.ЗапросНаРСВ.Клиент В
	|			(ВЫБРАТЬ
	|				НовыеЗапросы.Клиент
	|			ИЗ
	|				НовыеЗапросы)
	|	И ОтветСубброкераНаРаскрытие.ЗапросНаРСВ.КД = &КорпоративноеДействиеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветыСубброкера.Клиент КАК Клиент,
	|	МАКСИМУМ(ОтветыСубброкера.ДатаПолучения) КАК ДатаПолучения
	|ПОМЕСТИТЬ ДатаИВремяПолученияОтвета
	|ИЗ
	|	ОтветыСубброкера КАК ОтветыСубброкера
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтветыСубброкера.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветыСубброкера.ОтветСубброкера КАК ОтветСубброкера,
	|	ОтветыСубброкера.Клиент КАК Клиент,
	|	ОтветыСубброкера.ЗапросНаРСВ КАК ЗапросНаРСВ
	|ПОМЕСТИТЬ ПоследниеПолученныеОтветыСубброкера
	|ИЗ
	|	ДатаИВремяПолученияОтвета КАК ПоследниеПолученныеОтветы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтветыСубброкера КАК ОтветыСубброкера
	|		ПО ПоследниеПолученныеОтветы.Клиент = ОтветыСубброкера.Клиент
	|			И (ОтветыСубброкера.ДатаПолучения = ПоследниеПолученныеОтветы.ДатаПолучения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыеЗапросы.Клиент КАК Клиент,
	|	НовыеЗапросы.Запрос КАК НовыйЗапрос,
	|	ЕСТЬNULL(ПоследниеПолученныеОтветыСубброкера.ЗапросНаРСВ, ПоследниеОтправленныеЗапросыСубброкеру.ЗапросСубброкеру) КАК СтарыйЗапрос,
	|	ПоследниеПолученныеОтветыСубброкера.ОтветСубброкера КАК ОтветСубброкера
	|ИЗ
	|	НовыеЗапросы КАК НовыеЗапросы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеОтправленныеЗапросыСубброкеру КАК ПоследниеОтправленныеЗапросыСубброкеру
	|		ПО НовыеЗапросы.Клиент = ПоследниеОтправленныеЗапросыСубброкеру.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеПолученныеОтветыСубброкера КАК ПоследниеПолученныеОтветыСубброкера
	|		ПО НовыеЗапросы.Клиент = ПоследниеПолученныеОтветыСубброкера.Клиент");
	
	Запрос.УстановитьПараметр("ЗапросыСубброкеру",ЗапросыСубброкеру);
	Запрос.УстановитьПараметр("СтатусПолученОтвет",Перечисления.СтатусыДокументаОтветСубброкераНаРаскрытие.Загружен);
	Запрос.УстановитьПараметр("КорпоративноеДействиеСсылка", КорпоративноеДействиеСсылка);
	
	ПВХ = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОСозданииЗапросаНаРаскрытиеTrec;
	Результат = Запрос.Выполнить();	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ОтветСубброкера) Тогда
			ОтветОбъект = Выборка.ОтветСубброкера.ПолучитьОбъект();
			ОтветОбъект.Статус = Перечисления.СтатусыДокументаОтветСубброкераНаРаскрытие.ИзменилсяОстатокЦБ;
			ОтветОбъект.Записать();
		КонецЕсли;
		СлужебноеУведомление = СообщенияQI.СлужебноеУведомлениеОбИзмененииОстаткаЦБ(Выборка.СтарыйЗапрос, Выборка.НовыйЗапрос);
		СообщенияQI.ОтправитьСлужебноеУведомление(ПВХ,СлужебноеУведомление.Тема,СлужебноеУведомление.Тело);
	КонецЦикла;
	
КонецПроцедуры 


Процедура СоздатьЗапросыСубброкераНаРаскрытие(Клиенты = Неопределено)
	
	ПВХ = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОСозданииЗапросаНаРаскрытиеTrec;
	Если Не WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкера(ДокументОснование.Дата) Тогда 
		Возврат;
	ИначеЕсли АктивнаяСсылка И ВидКД.Код = "TREC" И ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалогаНДИНД Тогда 
		ЗапросСубброкеру = Документы.ЗапросСубброкеруНаРаскрытие.СоздатьЗапросыСубброкеруНаРаскрытиеTrec(ДокументОснование, ЭтотОбъект);
		Для Каждого ЗапросСубброкеруСсылка Из ЗапросСубброкеру Цикл
			Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалогаНДИНД Тогда  
				СлужебноеУведомление = СообщенияQI.СлужебноеУведомлениеОФормированииЗапросаСубброкеру(ЗапросСубброкеруСсылка);
				СообщенияQI.ОтправитьСлужебноеУведомление(ПВХ,СлужебноеУведомление.Тема,СлужебноеУведомление.Тело);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбИзмененииОстатковЦБ Тогда
		ЗапросСубброкеру = Документы.ЗапросСубброкеруНаРаскрытие.СоздатьЗапросыСубброкеруНаРаскрытиеTrec(ДокументОснование, ЭтотОбъект, Клиенты);
		УстановитьСтатусЕстьРахожденияВПоследнихПолученныхЗапросах(ДокументОснование,ЗапросСубброкеру);  
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ФОРМИРОВАНИЯ ТЕКСТА СООБЩЕНИЙ (реквизиты ЗаголовокСообщения и ТелоСообщения)

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off
// Формирует текст заголовка и тела сообщения
Процедура СформироватьТекстСообщения() Экспорт
	Если ФормаСообщенияКК <> Перечисления.ФормыСообщенийКК.СвободнаяФорма
		И (НЕ ЗначениеЗаполнено(Статус)
			ИЛИ Статус = Перечисления.СтатусыУведомленийКлиентам.ОжидаетОтправки
			ИЛИ Статус = Перечисления.СтатусыУведомленийКлиентам.СформированоСОшибками) Тогда

		мНезаполненныеОбязательныеПоля = Новый Массив;
		ДатаФиксацииОбязательна = Ложь;
		ЗаголовокСообщения = "";
		ТелоСообщения = "";
		Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПоступленииМатериаловКОбщемуСобраниюВладельцев Тогда
			ЗаголовокСообщения = "Поступила информация о проведении общего собрания владельцев";
			ТелоСообщения = ТекстСообщенияОПоступленииМатериаловКОбщемуСобраниюВладельцев();
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПоступленииИнформацииИзБюллетеня Тогда
			ЗаголовокСообщения = "Поступила информация из бюллетеня к общему собранию владельцев";
			ТелоСообщения = ТекстСообщенияОПоступленииИнформацииИзБюллетеня();
			
		ИначеЕсли Перечисления.ФормыСообщенийКК.ЭтоФормаСвязаннаяСВыплатой(ФормаСообщенияКК) Тогда
			ЗаголовокСообщения = "Поступила информация о проведении выкупа/приобретении ценных бумаг";
			ТелоСообщения = ТекстСообщенияОПроведенииКД_ВыкупПриобретениеЦБ();
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_КонвертацияОбменЦБ Тогда
			ЗаголовокСообщения = "Поступила информация о конвертации/обмене ценных бумаг";
			ТелоСообщения = ТекстСообщенияОПроведенииКД_КонвертацияОбменЦБ();
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ОбъединениеВыпусковЦБ Тогда
			ЗаголовокСообщения = "Поступила информация об объединении выпусков ценных бумаг/аннулировании доп. выпусков акций";
			ТелоСообщения = ТекстСообщенияОПроведенииКД_ОбъединениеВыпусковЦБ();
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_РеорганизацииОбщества Тогда
			ЗаголовокСообщения = "Поступила информация о реорганизации общества";
			ТелоСообщения = ТекстСообщенияОПроведенииКД_РеорганизацииОбщества();
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ПрочихВидов Тогда
			ЗаголовокСообщения = "Поступила информация о корпоративном действии";
			ТелоСообщения = ТекстСообщенияОПроведенииКД_ПрочихВидов();
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеКД Тогда
			ЗаголовокСообщения = "Отмена корпоративного действия";
			ТелоСообщения = ТекстСообщенияОбОтменеКД();
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_CписаниеЦБ Тогда
			ЗаголовокСообщения = "Поступила информация о списании ценных бумаг";
			ТелоСообщения = ТекстСообщенияОПроведенииКД_CписаниеЦБ();
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_CвязанногоСВыплатой Тогда
			ЗаголовокСообщения = "Поступила информация о выплатах по ценным бумагам";
			ТелоСообщения = ТекстСообщенияОПроведенииКД_CвязанногоСВыплатой();
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ПодтверждениеОсвобожденияОтНалога Тогда
			ЗаголовокСообщения = "Поступила информация о проведении корпоративного действия - подтверждение "
				+ "освобождения от налога";
			ТелоСообщения = ТекстСообщенияОПроведенииКД_ПодтверждениеОсвобожденияОтНалога();
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалога Тогда
			ЗаголовокСообщения = "Поступила информация о возврате части удержанного налога";
			ТелоСообщения = ТекстСообщенияОПроведенииКД_ВозвратЧастиНалога();
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалогаНДИНД Тогда
			ЗаголовокСообщения = "Поступила информация о возврате части удержанного налога";
			ТелоСообщения = ТекстСообщенияОПроведенииКД_ВозвратЧастиНалогаНДИНД();
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_СущественноеИзменениеПоЦБИноеСобытие Тогда
			ЗаголовокСообщения = "Поступила информация о проведении корпоративного действия";
			ТелоСообщения = ТекстСообщенияОПроведенииКД_СущественноеИзменениеПоЦБИноеСобытие();
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_РаскрытиеИнформации Тогда
			ЗаголовокСообщения = "Поступила информация о проведении корпоративного действия";
			ТелоСообщения = ТекстСообщенияОПроведенииКД_РаскрытиеИнформации();
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбИтогахСобрания Тогда
			ЗаголовокСообщения = "Поступила информация о решениях, принятых общим собранием акционеров, "
				+ "а также об итогах голосования на общем собрании акционеров";
			ТелоСообщения = ТекстСообщенияОбИтогахСобрания();
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеСобрания Тогда
			ЗаголовокСообщения = "Поступила информация об отмене общего собрания акционеров";
			ТелоСообщения = ТекстСообщенияОбОтменеСобрания();
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ПодтверждениеОсвобожденияОтНалогаПоЦБНеПодпадающимПодНалоговоеРегулированиеСША Тогда
			ЗаголовокСообщения = "Поступила информация о проведении корпоративного действия - подтверждение освобождения от налога";
			ТелоСообщения = ТекстСообщенияОПроведенииКД_ПодтверждениеОсвобожденияОтНалогаПоЦБНеПодпадающимПодНалоговоеРегулированиеСША();
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбИзмененииОстатковЦБ Тогда
	        ЗаголовокСообщения = "Поступила информация о проведении корпоративного действия";
			ТелоСообщения = ТекстСообщенияОбИзмененииОстатков();
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.УведомлениеОРегистрацииЗаявкиВУКПаи Тогда
			ЗаголовокСообщения = Строка(ФормаСообщенияКК);
			ТелоСообщения = ТекстСообщенияОРегистрацииЗаявкиВУКПаи();
		КонецЕсли;
		
		ТелоСообщения = "<p>#Hello#</p>" + Символы.ПС	// Этот маркер заменяется на текст приветствия на стороне Web-сервиса
			+ ТелоСообщения + Символы.ПС
			+ ПодписьСообщения();						// {Обязательный блок}
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорпоративноеДействие_Новый")
			И ДокументОснование.Инициатор = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияБЭБ") Тогда
			ТелоСообщения = СтрЗаменить(ТелоСообщения, "#СсылкаДляУчастияВКорпоративномДействии#", "");
		КонецЕсли;
		
		// Общие обязательные поля
		Если НЕ ЗначениеЗаполнено(Эмитент) Тогда
			мНезаполненныеОбязательныеПоля.Добавить("Эмитент");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЦеннаяБумага1) Тогда
			мНезаполненныеОбязательныеПоля.Добавить("ЦеннаяБумага1");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(мНезаполненныеОбязательныеПоля) Тогда
			Статус = Перечисления.СтатусыУведомленийКлиентам.СформированоСОшибками;
			СписокНезаполненныхОбязательныхПолей = ЗначениеВСтрокуВнутр(мНезаполненныеОбязательныеПоля);
		Иначе
			Статус = Перечисления.СтатусыУведомленийКлиентам.ОжидаетОтправки;
			СписокНезаполненныхОбязательныхПолей = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on


Функция ТекстСообщенияОПоступленииМатериаловКОбщемуСобраниюВладельцев()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в %1 поступила информация о проведении корпоративного действия
	|""%2"" - %3 (%4, Референс КД %5).</p>
	|<p>Дата КД (план.): %6</p>";
	Текст = СтрЗаменить(Текст, "%1", мНаименованиеДепозитария);
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	Текст = СтрЗаменить(Текст, "%6", ФорматОбязательнойДатыСоВременем(ДатаКДПлан, "ДатаКДПлан_КОбщемуСобраниюВладельцев"));
	
	// {Опциональный блок, только для КД российских Эмитентов}
	Если Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1)
		ИЛИ (НЕ Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1) И ЗначениеЗаполнено(ДатаФиксации)) Тогда
		Текст = Текст + "
		|<p>Дата фиксации: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ФорматОбязательнойДаты(ДатаФиксации, "ДатаФиксации_КОбщемуСобраниюВладельцев"));
		ДатаФиксацииОбязательна = Истина;
	КонецЕсли;
	
	// {Опциональный блок, при наличии ссылки}
	Если ЗначениеЗаполнено(АдресВСетиИнтернет) Тогда
		Текст = Текст + "
		|<p>Для ознакомления с материалами перейдите по ссылке: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеСсылки(АдресВСетиИнтернет));
	КонецЕсли;
		
	// {Опциональный блок, при наличии возможности участия}
	Текст = Текст + Символы.ПС + "#СсылкаДляУчастияВГолосовании#";	// Этот маркер заменяется на ссылку при отправке уведомления
	
	// {Обязательный блок}
	Текст = Текст + "
	|<p>Последний срок участия в голосовании не позднее: %1</p>";
	Текст = СтрЗаменить(Текст, "%1", 
		?(Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1),
			ФорматОбязательнойДатыСоВременем(ДатаОкончанияГолосования, "ДатаОкончанияГолосования_КОбщемуСобраниюВладельцев"),
			ФорматОбязательнойДатыСоВременем(ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента, "ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента")));
			
	Возврат Текст;			
КонецФункции

Процедура ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет)
	
	СопутствующийТекстКСсылке = ?(ЗначениеЗаполнено(АдресВСетиИнтернет),
		"С деталями корпоративного действия Вы можете ознакомиться по ссылке:", "");
	ReplaceFields.Вставить("СопутствующийТекстКСсылке"	, СопутствующийТекстКСсылке);
	ReplaceFields.Вставить("АдресВСетиИнтернет"			, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПоступленииМатериаловКОбщемуСобраниюВладельцев(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПоступленииМатериаловКОбщемуСобраниюВладельцев");
	
	ДатаОкончанияГолосованияТекст = ?(Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1),
		ФорматОбязательнойДаты(ДатаОкончанияГолосования, "ДатаОкончанияГолосования_КОбщемуСобраниюВладельцев"),
		ФорматОбязательнойДаты(ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента, "ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента"));
		
	ReplaceFields = ТекстJSON.Data.ReplaceFields;
	ReplaceFields.Вставить("ДатаКДПлан", ФорматОбязательнойДатыСоВременем(ДатаКДПлан, "ДатаКДПлан_КОбщемуСобраниюВладельцев"));
	ReplaceFields.Вставить("ДатаФиксации", ФорматОбязательнойДаты(ДатаФиксации, "ДатаФиксации_КОбщемуСобраниюВладельцев"));
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	ReplaceFields.Вставить("СсылкаДляУчастияВГолосовании", "");
	ReplaceFields.Вставить("ДатаОкончанияГолосования", ДатаОкончанияГолосованияТекст);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПоступленииИнформацииИзБюллетеня(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПоступленииИнформацииИзБюллетеня");
	
	ДатаОкончанияГолосованияТекст = ФорматОбязательнойДаты(ДатаОкончанияГолосования,
		"ДатаОкончанияГолосования_ОПоступленииИнформацииИзБюллетеня");
	
	ReplaceFields = Data.ReplaceFields;
	ReplaceFields.Вставить("ДатаОкончанияГолосования", ДатаОкончанияГолосованияТекст);
	ReplaceFields.Вставить("СсылкаДляУчастияВГолосовании", "");
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_ВыкупПриобретениеЦБ(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_ВыкупПриобретениеЦБ");
	
	ReplaceFields = Data.ReplaceFields;
	
	ReplaceFields.Вставить("ПредставлениеПериодаПроведения", ПредставлениеПериодаПроведения());
	ReplaceFields.Вставить("ИнициаторВыкупа", ФорматОбязательнойСтроки(ИнициаторВыкупа, "ИнициаторВыкупа"));
	ReplaceFields.Вставить("ЦенаПредложения", ФорматОбязательнойСуммыСВалютой(ВыплатаНа1ЦБ, ВалютаДивидендаКупона, "ЦенаПредложения"));
	ReplaceFields.Вставить("ДатаКДРеестр", ?(ЗначениеЗаполнено(ДатаКДРеестр), ФорматДаты(ДатаКДРеестр),
		ФорматДаты(ТекущаяДатаСеанса())));
	ReplaceFields.Вставить("ЦенаРазмещения", ФорматОбязательнойСуммыСВалютой(ЦенаРазмещения,
		ВалютаЦеныРазмещения, "ЦенаРазмещения"));
	ReplaceFields.Вставить("ДатаКДПлан", ФорматОбязательнойДатыСоВременем(ДатаКДПлан, "ДатаКДПлан_ВыкупПриобретениеЦБ"));
	ReplaceFields.Вставить("ПризнакОбязательностиКД_КонвертацияОбменЦБ",
		ПредставлениеПризнакаОбязательностиКД("ПризнакОбязательностиКД_ВыкупПриобретениеЦБ"));
	ReplaceFields.Вставить("ДатаФиксации", ДатаФиксацииВыкупаПриобретенияЦБ());
	
	Если ВидКД.Код = "BPUT" Тогда
		Если ЗначениеЗаполнено(ДатаОкончанияПериода) Тогда
			ДатаОкончанияПриемаЗаявлений = КонецДня(Документы.УведомлениеКлиентам.ДобавитьРабочийДень(ДатаОкончанияПериода, -2));
		Иначе
			ДатаОкончанияПриемаЗаявлений = ФорматОбязательнойДатыСоВременем('00010101', "ДатаОкончанияПериодаПроведения");
		КонецЕсли;
	Иначе
		ДатаОкончанияПриемаЗаявленийСрокРынка = ?(ЗначениеЗаполнено(ДатаОкончанияГолосования), ДатаОкончанияГолосования, ПоследнийСрокРынка);
		ДатаОкончанияПриемаЗаявлений = ФорматОбязательнойДаты(ДатаОкончанияПриемаЗаявленийСрокРынка, "ПоследнийСрокРынка");
	КонецЕсли;
	ReplaceFields.Вставить("ДатаОкончанияПриемаЗаявлений", ДатаОкончанияПриемаЗаявлений);
	ReplaceFields.Вставить("КДРеференсСвязанныйСобрание", КДРеференсСвязанныйСобрание);
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	ReplaceFields.Вставить("СсылкаДляУчастияВКорпоративномДействии", "");
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_BPUT(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_BPUT");
	
	ReplaceFields = Data.ReplaceFields;
	
	ReplaceFields.Вставить("ПредставлениеПериодаПроведения", ПредставлениеПериодаПроведения());
	ReplaceFields.Вставить("ДатаКДРеестр", ?(ЗначениеЗаполнено(ДатаКДРеестр), ФорматДаты(ДатаКДРеестр), ""));
	ReplaceFields.Вставить("ДатаКДПлан", ФорматОбязательнойДатыСоВременем(ДатаКДПлан, "ДатаКДПлан_ВыкупПриобретениеЦБ"));
	ReplaceFields.Вставить("ПризнакОбязательностиКД_КонвертацияОбменЦБ",
		ПредставлениеПризнакаОбязательностиКД("ПризнакОбязательностиКД_ВыкупПриобретениеЦБ"));
	ReplaceFields.Вставить("ДатаФиксации", ДатаФиксацииВыкупаПриобретенияЦБ());
	
	ДатаОкончанияПриемаЗаявлений = ФорматОбязательнойДатыСоВременем(ДатаОкончанияГолосования, "ДатаОкончанияГолосования");
	ReplaceFields.Вставить("ДатаОкончанияПриемаЗаявлений", ДатаОкончанияПриемаЗаявлений);
	
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	ReplaceFields.Вставить("СсылкаДляУчастияВКорпоративномДействии", "");
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_BIDS_TEND(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_BIDS_TEND");
	
	ReplaceFields = Data.ReplaceFields;
	
	ReplaceFields.Вставить("ПредставлениеПериодаПроведения", ПредставлениеПериодаПроведения());
	ReplaceFields.Вставить("ИнициаторВыкупа", ФорматОбязательнойСтроки(ИнициаторВыкупа, "ИнициаторВыкупа"));
	ReplaceFields.Вставить("ЦенаПредложения", ФорматНеобязательнойСуммыСВалютой(ВыплатаНа1ЦБ, ВалютаДивидендаКупона, "ЦенаПредложения"));
	ReplaceFields.Вставить("ДатаКДРеестр", ?(ЗначениеЗаполнено(ДатаКДРеестр), ФорматДаты(ДатаКДРеестр), ""));
	ReplaceFields.Вставить("ДатаКДПлан", ФорматОбязательнойДатыСоВременем(ДатаКДПлан, "ДатаКДПлан_ВыкупПриобретениеЦБ"));
	ReplaceFields.Вставить("ПризнакОбязательностиКД_КонвертацияОбменЦБ",
		ПредставлениеПризнакаОбязательностиКД("ПризнакОбязательностиКД_ВыкупПриобретениеЦБ"));
	ReplaceFields.Вставить("ДатаФиксации", ДатаФиксацииВыкупаПриобретенияЦБ());
	
	ДатаОкончанияПриемаЗаявленийСрокРынка = ?(ЗначениеЗаполнено(ДатаОкончанияГолосования), ДатаОкончанияГолосования, ПоследнийСрокРынка);
	ДатаОкончанияПриемаЗаявлений = ФорматОбязательнойДаты(ДатаОкончанияПриемаЗаявленийСрокРынка, "ПоследнийСрокРынка");
	ReplaceFields.Вставить("ДатаОкончанияПриемаЗаявлений", ДатаОкончанияПриемаЗаявлений);
	
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	ReplaceFields.Вставить("СсылкаДляУчастияВКорпоративномДействии", "");
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_PRIO(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_PRIO");
	
	ReplaceFields = Data.ReplaceFields;
	
	ReplaceFields.Вставить("ПредставлениеПериодаПроведения", ПредставлениеПериодаПроведения());
	ReplaceFields.Вставить("ДатаКДРеестр", ?(ЗначениеЗаполнено(ДатаКДРеестр), ФорматДаты(ДатаКДРеестр), ""));
	ReplaceFields.Вставить("ЦенаРазмещения", ФорматНеобязательнойСуммыСВалютой(ЦенаРазмещения, ВалютаЦеныРазмещения, "ЦенаРазмещения"));
	ReplaceFields.Вставить("ДатаКДПлан", ФорматОбязательнойДатыСоВременем(ДатаКДПлан, "ДатаКДПлан_ВыкупПриобретениеЦБ"));
	ReplaceFields.Вставить("ПризнакОбязательностиКД_КонвертацияОбменЦБ",
		ПредставлениеПризнакаОбязательностиКД("ПризнакОбязательностиКД_ВыкупПриобретениеЦБ"));
	ReplaceFields.Вставить("ДатаФиксации", ДатаФиксацииВыкупаПриобретенияЦБ());
	
	ДатаОкончанияПриемаЗаявленийСрокРынка = ?(ЗначениеЗаполнено(ДатаОкончанияГолосования), ДатаОкончанияГолосования, ПоследнийСрокРынка);
	ДатаОкончанияПриемаЗаявлений = ФорматОбязательнойДаты(ДатаОкончанияПриемаЗаявленийСрокРынка, "ПоследнийСрокРынка");
	ReplaceFields.Вставить("ДатаОкончанияПриемаЗаявлений", ДатаОкончанияПриемаЗаявлений);
	
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	ReplaceFields.Вставить("СсылкаДляУчастияВКорпоративномДействии", "");
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_КонвертацияОбменЦБ(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_КонвертацияОбменЦБ");
	
	ReplaceFields = Data.ReplaceFields;
	ReplaceFields.Вставить("ДатаКДРеестр", ФорматОбязательнойДаты(ДатаКДРеестр, "ДатаКДРеестр_КонвертацияОбменЦБ"));
	ReplaceFields.Вставить("ДатаФиксации", ФорматОбязательнойДаты(ДатаФиксации, "ДатаФиксации_КонвертацияОбменЦБ"));
	ReplaceFields.Вставить("ПризнакОбязательностиКД_КонвертацияОбменЦБ",
		ПредставлениеПризнакаОбязательностиКД("ПризнакОбязательностиКД_КонвертацияОбменЦБ"));
	ReplaceFields.Вставить("НовыйНоминалАкций", ?(ЗначениеЗаполнено(НовыйНоминалАкций),
		"Новый номинал акций: " + Строка(НовыйНоминалАкций), ""));
	ReplaceFields.Вставить("КоэффициентКонвертации", КоэффициентКонвертации);
	ReplaceFields.Вставить("ПравилоОкругления", ПравилоОкругления);
	ReplaceFields.Вставить("КДРеференсСвязанныйСобрание", КДРеференсСвязанныйСобрание);
	ReplaceFields.Вставить("ДатаОкончанияГолосования", ФорматДаты(ДатаОкончанияГолосования));
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);

КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_ОбъединениеВыпусковЦБ(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_ОбъединениеВыпусковЦБ");
	
	ReplaceFields = Data.ReplaceFields;
	ReplaceFields.Вставить("ДатаКДРеестр", ФорматОбязательнойДаты(ДатаКДРеестр, "ДатаКДРеестр_ОбъединениеВыпусковЦБ"));
	ReplaceFields.Вставить("ДатаКДНРД", ФорматОбязательнойДаты(ДатаКДРеестр, "ДатаКДНРД_ОбъединениеВыпусковЦБ"));
	ReplaceFields.Вставить("ОбъединениеВыпусковDBIT", Выпуски_ОбъединениеВыпусковЦБ("DBIT"));
	ReplaceFields.Вставить("ОбъединениеВыпусковCRDT", Выпуски_ОбъединениеВыпусковЦБ("CRDT"));
	ReplaceFields.Удалить("ХарактеристикиЦБ");
	ReplaceFields.Вставить("ХарактеристикиЦБ_ОбъединениеВыпусковЦБ", ХарактеристикиЦБ_ОбъединениеВыпусковЦБ());
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_РеорганизацииОбщества(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_РеорганизацииОбщества");
	
	ReplaceFields = Data.ReplaceFields;
	ReplaceFields.Вставить("СписокISINЦенныхБумагDBIT", СписокISINЦенныхБумаг("DBIT"));
	ReplaceFields.Вставить("СписокISINЦенныхБумагCRDT", СписокISINЦенныхБумаг("CRDT"));
	ReplaceFields.Вставить("ПризнакОбязательностиКД_РеорганизацииОбщества",
		ПредставлениеПризнакаОбязательностиКД("ПризнакОбязательностиКД_РеорганизацииОбщества"));
		
	ДатаЕГРЮЛТекст = ?(ЗначениеЗаполнено(ДатаЕГРЮЛ), "Дата внесения записи ЕГРЮЛ: " + ФорматДаты(ДатаЕГРЮЛ), "");
	ReplaceFields.Вставить("ДатаЕГРЮЛ", ДатаЕГРЮЛТекст);
	ReplaceFields.Вставить("ДатаКДРеестр", ФорматДаты(ДатаКДРеестр));
	ReplaceFields.Вставить("ДатаКДНРД", ФорматДаты(ДатаКДНРД));
	ReplaceFields.Вставить("ДатаФиксации", ФорматДаты(ДатаФиксации));
	ReplaceFields.Вставить("КоэффициентКонвертации", КоэффициентКонвертации);
	
	ДатаНачалаПериодаТекст = ?(ЗначениеЗаполнено(ДатаНачалаПериода), "Дата начала блокировки:" + ФорматДаты(ДатаНачалаПериода), "");
	ReplaceFields.Вставить("ДатаНачалаПериода", ДатаНачалаПериодаТекст);
	
	ДатаОкончанияПериодаТекст = ?(ЗначениеЗаполнено(ДатаОкончанияПериода), "Дата окончания блокировки: "
		+ ФорматДаты(ДатаОкончанияПериода), "");
	ReplaceFields.Вставить("ДатаОкончанияПериода", ДатаОкончанияПериодаТекст);
	
	ДатаПодачиДокументовНаГосРегистрациюТекст = ?(ЗначениеЗаполнено(ДатаПодачиДокументовНаГосРегистрацию),
		"Дата подачи документов на государственную регистрацию: " + ФорматДаты(ДатаПодачиДокументовНаГосРегистрацию), "");
	ReplaceFields.Вставить("ДатаПодачиДокументовНаГосРегистрацию", ФорматДаты(ДатаПодачиДокументовНаГосРегистрацию));
	
	ПравилоОкругленияТекст = ?(ЗначениеЗаполнено(ПравилоОкругления), "Правило округления дробных частей ЦБ: " + ПравилоОкругления, "");
	ReplaceFields.Вставить("ПравилоОкругления", ПравилоОкругленияТекст);
	
	КДРеференсСвязанныйСобраниеТекст = ?(ЗначениеЗаполнено(КДРеференсСвязанныйСобрание),
		"Референс связанного КД ""Общее собрание владельцев"": " + КДРеференсСвязанныйСобрание, "");
	ReplaceFields.Вставить("КДРеференсСвязанныйСобрание", КДРеференсСвязанныйСобраниеТекст);
	
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_ПрочихВидов(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_ПрочихВидов");
	
	ReplaceFields = Data.ReplaceFields;
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОбОтменеКД(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОбОтменеКД");
	
	ReplaceFields = Data.ReplaceFields;
	ReplaceFields.Вставить("ПричинаОтмены", ПричинаОтмены.Наименование);
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_CписаниеЦБ(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_СписаниеЦБ");
	
	ReplaceFields = Data.ReplaceFields;
	ReplaceFields.Вставить("ДатаКДРеестр", ФорматОбязательнойДаты(ДатаКДРеестр, "ДатаКДРеестр_СписаниеЦБ"));
	ReplaceFields.Вставить("ДатаКДНРД", ФорматОбязательнойДаты(ДатаКДНРД, "ДатаКДНРД_СписаниеЦБ"));
	ReplaceFields.Вставить("ПризнакОбязательностиКД_СписаниеЦБ", ПредставлениеПризнакаОбязательностиКД("ПризнакОбязательностиКД_СписаниеЦБ"));
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_CвязанногоСВыплатой(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_СвязанногоСВыплатой");
	
	ReplaceFields = Data.ReplaceFields;
	ReplaceFields.Вставить("ДатаКДПлан", ФорматОбязательнойДаты(ДатаКДПлан, "ДатаКДПлан_СвязанногоСВыплатой"));
	ReplaceFields.Вставить("ДатаФиксации", ФорматОбязательнойДаты(ДатаФиксации, "ДатаФиксации_СвязанногоСВыплатой"));
	ReplaceFields.Вставить("ПризнакОбязательностиКД_СвязанногоСВыплатой",
		ПредставлениеПризнакаОбязательностиКД("ПризнакОбязательностиКД_СвязанногоСВыплатой"));
	ReplaceFields.Вставить("ХДивДата", ФорматДаты(ХДивДата));
	
	ЭтоБумагаРоссийскогоЭмитента = Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1);
	Если Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "DVCA, CAPG, CAPD")
		И НЕ ЭтоБумагаРоссийскогоЭмитента Тогда
		ReplaceFields.Вставить("ЧистаяСтавкаДивидендов", "Чистая ставка дивидендов: " + Формат(ЧистаяСтавкаДивидендов, "ЧН=0"));
		ReplaceFields.Вставить("ВалютаЧистойСтавкиДивидендов", Справочники.Валюты.ПредставлениеВалюты(ВалютаЧистойСтавкиДивидендов));
		
	Иначе
		ReplaceFields.Вставить("ЧистаяСтавкаДивидендов", "");
		ReplaceFields.Вставить("ВалютаЧистойСтавкиДивидендов", "");
	КонецЕсли;
	ВалютаПлатежаТекст = ?(ЗначениеЗаполнено(ВалютаПлатежа), "Валюта платежа: " + Справочники.Валюты.ПредставлениеВалюты(ВалютаПлатежа), "");
	ReplaceFields.Вставить("ВалютаПлатежа", ВалютаПлатежаТекст);
	ЗаполнитьСтавкуНалога(ReplaceFields, ЭтоБумагаРоссийскогоЭмитента);
	ReplaceFields.Вставить("ВыплатаНа1ЦБ", ФорматОбязательнойСуммыСВалютой(ВыплатаНа1ЦБ, ВалютаДивидендаКупона, "РазмерДивидендов"));
	Если Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "DVCA, CAPG, DVSE, LIQU") Тогда
		ReplaceFields.Вставить("Период", Период);
	Иначе
		ReplaceFields.Вставить("Период", "");
	КонецЕсли;
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьСтавкуНалога(ReplaceFields, ЭтоБумагаРоссийскогоЭмитента)
	
	Если НЕ ЭтоБумагаРоссийскогоЭмитента Тогда
		ReplaceFields.Вставить("СтавкаНалога", "Ставка удерживаемого налога, %: " + Формат(СтавкаНалога, "ЧН=0"));
	Иначе
		ReplaceFields.Вставить("СтавкаНалога", "");
	КонецЕсли;

КонецПроцедуры
	
Процедура ЗаполнитьТекстСообщенияОПроведенииКД_CвязанногоСВыплатой_INTR_PRII(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_СвязанногоСВыплатой_INTR_PRII");
	
	ReplaceFields = Data.ReplaceFields;
	ReplaceFields.Вставить("ДатаКДПлан", ФорматОбязательнойДаты(ДатаКДПлан, "ДатаКДПлан_СвязанногоСВыплатой"));
	ReplaceFields.Вставить("ДатаФиксации", ФорматОбязательнойДаты(ДатаФиксации, "ДатаФиксации_СвязанногоСВыплатой"));
	ReplaceFields.Вставить("ПризнакОбязательностиКД_СвязанногоСВыплатой",
		ПредставлениеПризнакаОбязательностиКД("ПризнакОбязательностиКД_СвязанногоСВыплатой"));
		
	ЭтоБумагаРоссийскогоЭмитента = Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1);
	ЗаполнитьСтавкуНалога(ReplaceFields, ЭтоБумагаРоссийскогоЭмитента);
	
	ReplaceFields.Вставить("СтавкаКупонногоДоходаГодовых",
		ФорматОбязательнойСуммы(СтавкаКупонногоДоходаГодовых, "СтавкаКупонногоДоходаГодовых"));
	ReplaceFields.Вставить("РазмерКупонногоДохода", ФорматОбязательнойСуммыСВалютой(ВыплатаНа1ЦБ, ВалютаДивидендаКупона,
		"РазмерКупонногоДохода"));
	ВалютаПлатежаТекст = ?(ЗначениеЗаполнено(ВалютаПлатежа), "Валюта платежа: " + Справочники.Валюты.ПредставлениеВалюты(ВалютаПлатежа), "");
	ReplaceFields.Вставить("ВалютаПлатежа", ВалютаПлатежаТекст);
	ReplaceFields.Вставить("ДатаНачалаКупонногоПериода", ФорматОбязательнойДаты(ДатаНачалаПериода, "ДатаНачалаКупонногоПериода"));
	ReplaceFields.Вставить("ДатаОкончанияКупонногоПериода", ФорматОбязательнойДаты(ДатаОкончанияПериода, "ДатаОкончанияКупонногоПериода"));
	ReplaceFields.Вставить("КоличествоДнейВКупонномПериоде",
		ФорматОбязательнойСуммы(КоличествоДнейВКупонномПериоде, "КоличествоДнейВКупонномПериоде"));
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_CвязанногоСВыплатой_PRED_REDM_MCAL_others(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_СвязанногоСВыплатой_PRED_REDM_MCAL_others");
	
	ReplaceFields = Data.ReplaceFields;
	ReplaceFields.Вставить("ДатаКДПлан", ФорматОбязательнойДаты(ДатаКДПлан, "ДатаКДПлан_СвязанногоСВыплатой"));
	ReplaceFields.Вставить("ДатаФиксации", ФорматОбязательнойДаты(ДатаФиксации, "ДатаФиксации_СвязанногоСВыплатой"));
	ReplaceFields.Вставить("ПризнакОбязательностиКД_СвязанногоСВыплатой",
		ПредставлениеПризнакаОбязательностиКД("ПризнакОбязательностиКД_СвязанногоСВыплатой"));
		
	ЭтоБумагаРоссийскогоЭмитента = Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1);
	ЗаполнитьСтавкуНалога(ReplaceFields, ЭтоБумагаРоссийскогоЭмитента);
	
	ReplaceFields.Вставить("ПогашаемаяЧасть", ФорматОбязательнойСуммы(ПогашаемаяЧасть, "ПогашаемаяЧасть"));
	ReplaceFields.Вставить("РазмерПогашаемойЧасти", ФорматОбязательнойСуммыСВалютой(РазмерПогашаемойЧасти,
		ВалютаПлатежа, "РазмерПогашаемойЧасти"));
	ВалютаПлатежаТекст = ?(ЗначениеЗаполнено(ВалютаПлатежа), "Валюта платежа: " + Справочники.Валюты.ПредставлениеВалюты(ВалютаПлатежа), "");
	ReplaceFields.Вставить("ВалютаПлатежа", ВалютаПлатежаТекст);
	
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_ПодтверждениеОсвобожденияОтНалога(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_ПодтверждениеОсвобожденияОтНалога");
	
	ReplaceFields = Data.ReplaceFields;
	ReplaceFields.Удалить("НаименованиеДепозитария");
	ReplaceFields.Вставить("НаименованиеОрганизации", СокрЛП(ДокументОснование.Организация.Наименование));
	ReplaceFields.Вставить("ВидКД", СокрЛП(ДокументОснование.ВидКД.Наименование));
	ReplaceFields.Вставить("ДатаКДПлан", ФорматДаты(ДатаКДПлан));
	ReplaceFields.Вставить("ДатаФиксации", ФорматДаты(ДатаФиксации));
	
	ЭтоДоходыСША = ?(Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(ЦеннаяБумага1),
		"Доходы по указанным ценным бумагам по умолчанию будут облагаться налогом по ставке 30%.", "");
	ReplaceFields.Вставить("ДоходыСША", ЭтоДоходыСША);
	
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_ВозвратЧастиНалога(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_ВозвратЧастиНалога");
	
	ReplaceFields = Data.ReplaceFields;
	ReplaceFields.Вставить("НаименованиеОрганизации", СокрЛП(ДокументОснование.Организация.Наименование));
	ReplaceFields.Вставить("ВидКД", СокрЛП(ДокументОснование.ВидКД.Наименование));
	ReplaceFields.Вставить("ДатаФиксации", ФорматОбязательнойДаты(ДатаФиксации, "ДатаФиксации_ВозвратЧастиНалога"));
	ДатаОкончанияПриемаИнструкцийНРБанка = ФорматОбязательнойДатыСоВременем(ДатаОкончанияПриемаИнструкцийВТБКБ,
		"ДатаОкончанияПриемаИнструкцийВТБКБ_ВозвратЧастиНалога");
	ReplaceFields.Вставить("ДатаОкончанияПриемаИнструкцийНРБанка", ДатаОкончанияПриемаИнструкцийНРБанка);
	ReplaceFields.Вставить("СсылкаДляУчастияВКорпоративномДействии", "");
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_СущественноеИзменениеПоЦБИноеСобытие(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_СущественноеИзменениеПоЦБИноеСобытие");
	
	ReplaceFields = Data.ReplaceFields;
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_РаскрытиеИнформации(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_РаскрытиеИнформации");
	
	ReplaceFields = Data.ReplaceFields;
	ReplaceFields.Вставить("ДатаНачалаПериода", ФорматОбязательнойДаты(ДатаНачалаПериода,
		"ДатаНачалаПериода_РаскрытиеИнформации"));
	ReplaceFields.Вставить("ДатаОкончанияПериода", ФорматОбязательнойДаты(ДатаОкончанияПериода, "ДатаОкончанияПериода_РаскрытиеИнформации"));
	ReplaceFields.Вставить("ДатаФиксации", ФорматОбязательнойДаты(ДатаФиксации, "ДатаФиксации_РаскрытиеИнформации"));
	ReplaceFields.Вставить("ВалютаПлатежа", ПредставлениеОбязательнойВалюты(ВалютаПлатежа, "ВалютаПлатежа_РаскрытиеИнформации"));
	ДатаОкончанияПриемаИнструкцийНРБанка = ФорматОбязательнойДатыСоВременем(ДатаОкончанияПриемаИнструкцийВТБКБ,
		"ДатаОкончанияПриемаИнструкцийВТБКБ_РаскрытиеИнформации");
	ReplaceFields.Вставить("ДатаОкончанияПриемаИнструкцийНРБанка", ДатаОкончанияПриемаИнструкцийНРБанка);
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОбИтогахСобрания(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОбИтогахСобрания");
	
	ReplaceFields = Data.ReplaceFields;
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОбОтменеСобрания(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОбОтменеСобрания");
	
	ReplaceFields = Data.ReplaceFields;
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОПроведенииКД_ПодтверждениеОсвобожденияОтНалогаПоЦБНеПодпадающимПодНалоговоеРегулированиеСША(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_ПодтверждениеОсвобожденияОтНалогаПоЦБНеПодпадающимПодНалоговоеРегулированиеСША");
	
	ReplaceFields = Data.ReplaceFields;
	ReplaceFields.Вставить("НаименованиеОрганизации", СокрЛП(ДокументОснование.Организация.Наименование));
	ReplaceFields.Вставить("ВидКД", СокрЛП(ДокументОснование.ВидКД.Наименование));
	ReplaceFields.Вставить("ДатаКДПлан", ФорматДаты(ДатаКДПлан));
	ReplaceFields.Вставить("ДатаФиксации", ФорматДаты(ДатаФиксации));
	ReplaceFields.Вставить("ДатаОкончанияПриемаПоручений1_5", ФорматДаты(ДатаОкончанияПриемаПоручений1_5));
	ReplaceFields.Вставить("ДатаОкончанияПриемаПоручений1_10", ФорматДаты(ДатаОкончанияПриемаПоручений1_10));
	ДополнитьТекстСообщенияАдресомВСетиИнтернет(ReplaceFields, АдресВСетиИнтернет);
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияОРегистрацииЗаявкиВУКПаи(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "УведомлениеОРегистрацииЗаявкиВУКПаи");
	
	ReplaceFields = Data.ReplaceFields;
	ReplaceFields.Вставить("ЗаголовокСообщения", Строка(ФормаСообщенияКК));
	ReplaceFields.Вставить("ТелоСообщения", ТекстСообщенияОРегистрацииЗаявкиВУКПаи());
	
КонецПроцедуры

Процедура ЗаполнитьТекстСообщенияСвободнаяФорма(ТекстJSON)
	
	Data = ТекстJSON.Data;
	Data.Вставить("MailTemplateTitle", "СвободнаяФорма");
	
	ReplaceFields = Data.ReplaceFields;
	ReplaceFields.Вставить("ЗаголовокСообщения", "Заполнить заголовок, который требуется");
	ReplaceFields.Вставить("ТелоСообщения", "Свободная формулировка, необходимо заполнить вручную");
	
КонецПроцедуры

Функция ТекстСообщенияОПоступленииИнформацииИзБюллетеня()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в %1 поступила информация из бюллетеня для голосования к корпоративному действию
	|""%2"" - %3 (%4, Референс КД %5).</p>";
	Текст = СтрЗаменить(Текст, "%1", мНаименованиеДепозитария);
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	
	// {Опциональный блок, при наличии возможности участия}
	Текст = Текст + Символы.ПС + "#СсылкаДляУчастияВГолосовании#";	// Этот маркер заменяется на ссылку при отправке уведомления
	
	// {Обязательный блок}
	Текст = Текст + "
	|<p>Последний срок участия в голосовании не позднее: %1</p>";
	Текст = СтрЗаменить(Текст, "%1", ФорматОбязательнойДатыСоВременем(ДатаОкончанияГолосования, "ДатаОкончанияГолосования_ОПоступленииИнформацииИзБюллетеня"));
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОПроведенииКД_ВыкупПриобретениеЦБ()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в %1 поступила информация о проведении корпоративного действия
	|""%2"" %3 - %4 (%5, Референс КД %6).</p>";
	Текст = СтрЗаменить(Текст, "%1", мНаименованиеДепозитария);
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", ПредставлениеНомераСтатьи());
	Текст = СтрЗаменить(Текст, "%4", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%5", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%6", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	
	Если ЗначениеЗаполнено(ПредставлениеПериодаПроведения()) Тогда
		Текст = Текст + "
		|<p>%1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеПериодаПроведения());
	КонецЕсли;
	
	// {Опциональный блок, для КД типа BIDS, TEND}
	Если ВидимостьГруппы_ИнициаторВыкупа() Тогда
		Текст = Текст + "
		|<p>Инициатор выкупа: %1</p>
		|<p>Цена предложения за 1 ц/б: %2</p>
		|<p>Дата проведения корпоративного действия в реестре: %3</p>";
		Текст = СтрЗаменить(Текст, "%1", ФорматОбязательнойСтроки(ИнициаторВыкупа, "ИнициаторВыкупа"));
		Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСуммыСВалютой(ВыплатаНа1ЦБ, ВалютаПлатежа, "ЦенаПредложения"));
		Текст = СтрЗаменить(Текст, "%3", ?(ЗначениеЗаполнено(ДатаКДРеестр), ФорматДаты(ДатаКДРеестр), ФорматДаты(ТекущаяДатаСеанса())));
	КонецЕсли;
		
	// {Опциональный блок, для КД типа PRIO}	
	Если ВидимостьГруппы_ЦенаРазмещения() Тогда
		Текст = Текст + "
		|<p>Цена размещения: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ФорматОбязательнойСуммыСВалютой(ЦенаРазмещения,
			ВалютаЦеныРазмещения, "ЦенаРазмещения"));
	КонецЕсли;
	
	// {Опциональный блок, для КД типа BPUT}
	Если ВидимостьДатаКДПлан_ВыкупПриобретениеЦБ() Тогда
		Текст = Текст + "
		|<p>Плановая дата проведения корпоративного действия: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ФорматОбязательнойДатыСоВременем(ДатаКДПлан, "ДатаКДПлан_ВыкупПриобретениеЦБ"));
	КонецЕсли;
	
	// {Опциональный блок, только для КД иностранных эмитентов }
	Если НЕ Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1) Тогда
		Текст = Текст + "
		|<p>Признак обязательности КД: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеПризнакаОбязательностиКД("ПризнакОбязательностиКД_ВыкупПриобретениеЦБ"));
	КонецЕсли;
	
	// {Опциональный блок, при наличии данных}
	Если ЗначениеЗаполнено(ДатаФиксацииВыкупаПриобретенияЦБ()) Тогда
		Текст = Текст + "
		|<p>Дата фиксации: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ДатаФиксацииВыкупаПриобретенияЦБ());
	КонецЕсли;
	
	// {Опциональный блок, при наличии возможности участия КД}
	Текст = Текст + Символы.ПС + "#СсылкаДляУчастияВКорпоративномДействии#";	// Этот маркер заменяется на ссылку при отправке уведомления
	
	Текст = Текст + "
	|<p>Дата окончания приема заявлений: %1</p>";
	Если ВидКД.Код = "BPUT" Тогда
		Если ЗначениеЗаполнено(ДатаОкончанияПериода) Тогда
			ДатаОкончанияПриемаЗаявлений = КонецДня(Документы.УведомлениеКлиентам.ДобавитьРабочийДень(ДатаОкончанияПериода, -2));
		Иначе
			ДатаОкончанияПриемаЗаявлений = ФорматОбязательнойДатыСоВременем('00010101', "ДатаОкончанияПериодаПроведения");
		КонецЕсли;
	Иначе
		ДатаОкончанияПриемаЗаявлений = ФорматОбязательнойДатыСоВременем(?(ЗначениеЗаполнено(ДатаОкончанияГолосования),
			ДатаОкончанияГолосования, ПоследнийСрокРынка), "ПоследнийСрокРынка");
	КонецЕсли;
	Текст = СтрЗаменить(Текст, "%1", ДатаОкончанияПриемаЗаявлений);
	
	// {Опциональный блок, при наличии связанного КД типа собрание}
	Если ЗначениеЗаполнено(КДРеференсСвязанныйСобрание) Тогда
		Текст = Текст + "
		|<p>Референс связанного КД ""Общее собрание владельцев"": %1</p>";
		Текст = СтрЗаменить(Текст, "%1", КДРеференсСвязанныйСобрание);
	КонецЕсли;
	
	// {Опциональный блок, только при наличии ссылки}
	Если ЗначениеЗаполнено(АдресВСетиИнтернет) Тогда
		Текст = Текст + "
		|<p>С деталями корпоративного действия Вы можете ознакомиться по ссылке: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеСсылки(АдресВСетиИнтернет));
	КонецЕсли;
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОПроведенииКД_КонвертацияОбменЦБ()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в %1 поступила информация о проведении корпоративного действия
	|""%2"" - %3 (%4, Референс КД %5).</p>
	|<p>Дата конвертации: %6</p>";
	Текст = СтрЗаменить(Текст, "%1", мНаименованиеДепозитария);
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	Текст = СтрЗаменить(Текст, "%6", ФорматОбязательнойДаты(ДатаКДРеестр, "ДатаКДРеестр_КонвертацияОбменЦБ"));
	
	// {Опциональный блок, только для КД иностранных эмитентов}
	Если НЕ Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1) Тогда
		Текст = Текст + "
		|<p>Признак обязательности КД: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеПризнакаОбязательностиКД("ПризнакОбязательностиКД_КонвертацияОбменЦБ"));
	КонецЕсли;
	
	// {Опциональный блок, только для КД типов SPLF, SPLR, DECR, EXOF}
	Если ВидимостьДатаФиксации_КонвертацияОбменЦБ() Тогда
		Если Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1) Тогда
			Текст = Текст + "
			|<p>Дата фиксации: %1</p>";
			Текст = СтрЗаменить(Текст, "%1", ФорматОбязательнойДаты(ДатаФиксации, "ДатаФиксации_КонвертацияОбменЦБ"));
			ДатаФиксацииОбязательна = Истина;
			
		ИначеЕсли ЗначениеЗаполнено(ДатаФиксации) Тогда
			Текст = Текст + "
			|<p>Дата фиксации: %1</p>";
			Текст = СтрЗаменить(Текст, "%1", ФорматДаты(ДатаФиксации));
		КонецЕсли;
	КонецЕсли;

	// {Опциональный блок, только для КД только для SPLF, SPLR, INCR}
	Если ВидимостьНовыйНоминалАкций() И НовыйНоминалАкций <> 0 Тогда
		Текст = Текст + "
		|<p>Новый номинал акций: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", НовыйНоминалАкций);
	КонецЕсли;
	
	// {Опциональный блок, при наличии данных}
	Если ЗначениеЗаполнено(КоэффициентКонвертации) Тогда
		Текст = Текст + "
		|<p>Коэффициент: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", КоэффициентКонвертации);
	КонецЕсли;
	
	// {Опциональный блок, при наличии данных}
	Если ЗначениеЗаполнено(ПравилоОкругления) Тогда
		Текст = Текст + "
		|<p>Правило округления:<br/>
		|%1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПравилоОкругления);
	КонецЕсли;

    // {Опциональный блок, в случае КД CONV (типа VOLU) для российского эмитента}
	Если ВидимостьГруппы_КрайнийСрокПриемаТребованийОКонвертации() Тогда
		// {Опциональный блок, при наличии возможности участия}
		Текст = Текст + Символы.ПС + "#СсылкаДляУчастияВКорпоративномДействии#";	// Этот маркер заменяется на ссылку при отправке уведомления
		
		Если ЗначениеЗаполнено(ДатаОкончанияГолосования) Тогда
			Текст = Текст + "
			|<p>Крайний срок приема требований о конвертации: %1</p>";
			Текст = СтрЗаменить(Текст, "%1", ФорматДаты(ДатаОкончанияГолосования));
		КонецЕсли;
	КонецЕсли;

	// {Опциональный блок, при наличии связанного КД типа собрание}
	Если ЗначениеЗаполнено(КДРеференсСвязанныйСобрание) Тогда
		Текст = Текст + "
		|<p>Референс связанного КД ""Общее собрание владельцев"": %1</p>";
		Текст = СтрЗаменить(Текст, "%1", КДРеференсСвязанныйСобрание);
	КонецЕсли;
	
	// {Опциональный блок, только при наличии ссылки}
	Если ЗначениеЗаполнено(АдресВСетиИнтернет) Тогда
		Текст = Текст + "
		|<p>С деталями корпоративного действия Вы можете ознакомиться по ссылке: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеСсылки(АдресВСетиИнтернет));
	КонецЕсли;
			
	Возврат Текст;	
КонецФункции

Функция ТекстСообщенияОПроведенииКД_ОбъединениеВыпусковЦБ()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в %1 поступила информация о проведении корпоративного действия
	|""%2"" - %3 (%4, Референс КД %5).</p>
	|<p>Дата проведения операции в реестре: %6</p>
	|<p>Дата проведения операции в НРД: %7</p>
	|<p>Объединяемые выпуски:<br/>
	|%8</p>
	|<p>Объединённый выпуск:
	|%9</p>";
	Текст = СтрЗаменить(Текст, "%1", мНаименованиеДепозитария);
	Текст = СтрЗаменить(Текст, "%2", НаименованиеКД_ОбъединениеВыпусковЦБ());
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ_ОбъединениеВыпусковЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	Текст = СтрЗаменить(Текст, "%6", ФорматОбязательнойДаты(ДатаКДРеестр, "ДатаКДРеестр_ОбъединениеВыпусковЦБ"));
	Текст = СтрЗаменить(Текст, "%7", ФорматОбязательнойДаты(ДатаКДНРД, "ДатаКДНРД_ОбъединениеВыпусковЦБ"));
	Текст = СтрЗаменить(Текст, "%8", Выпуски_ОбъединениеВыпусковЦБ("DBIT"));
	Текст = СтрЗаменить(Текст, "%9", Выпуски_ОбъединениеВыпусковЦБ("CRDT"));
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОПроведенииКД_РеорганизацииОбщества()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в %1 поступила информация о проведении корпоративного действия
	|""%2"" - %3 (%4, Референс КД %5).</p>";
	Текст = СтрЗаменить(Текст, "%1", мНаименованиеДепозитария);
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	
	Если Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1) Тогда
		Текст = Текст + "
		|<p>Размещённые ценные бумаги (ISIN): %1</p>
		|<p>Размещаемые ценные бумаги (ISIN): %2</p>";
		Текст = СтрЗаменить(Текст, "%1", СписокISINЦенныхБумаг("DBIT"));
		Текст = СтрЗаменить(Текст, "%2", СписокISINЦенныхБумаг("CRDT"));
	Иначе
		Текст = Текст + "
		|<p>Признак обязательности КД: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеПризнакаОбязательностиКД("ПризнакОбязательностиКД_РеорганизацииОбщества"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаФиксации) ИЛИ ДатаФиксацииНеизвестна Тогда
		Текст = Текст + "
		|<p>Дата фиксации: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ?(ДатаФиксацииНеизвестна, "Неизвестна", ФорматДаты(ДатаФиксации)));
	КонецЕсли;

	Если ЗначениеЗаполнено(ДатаЕГРЮЛ) И ВидимостьДатаВнесенияЗаписиЕГРЮЛ() Тогда
		Текст = Текст + "
		|<p>Дата внесения записи ЕГРЮЛ: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ФорматДаты(ДатаЕГРЮЛ));
	КонецЕсли;
	
	Если (ЗначениеЗаполнено(ДатаКДРеестр) ИЛИ ДатаКДРеестрНеизвестна)
		И Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1) Тогда
		Текст = Текст + "
		|<p>Дата проведения операции в реестре: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ?(ДатаКДРеестрНеизвестна, "Неизвестна", ФорматДаты(ДатаКДРеестр)));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаКДНРД) ИЛИ ДатаКДНРДНеизвестна Тогда
		Текст = Текст + "
		|<p>Дата проведения операции в НРД: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ?(ДатаКДНРДНеизвестна, "Неизвестна", ФорматДаты(ДатаКДНРД)));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КоэффициентКонвертации) Тогда
		Текст = Текст + "
		|<p>Коэффициент конвертации (Количество новых ЦБ за имеющиеся): %1</p>";
		Текст = СтрЗаменить(Текст, "%1", КоэффициентКонвертации);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаНачалаПериода) Тогда
		Текст = Текст + "
		|<p>Дата начала блокировки: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ФорматДаты(ДатаНачалаПериода));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОкончанияПериода) Тогда
		Текст = Текст + "
		|<p>Дата окончания блокировки: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ФорматДаты(ДатаОкончанияПериода));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаПодачиДокументовНаГосРегистрацию) Тогда
		Текст = Текст + "
		|<p>Дата подачи документов на государственную регистрацию: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ФорматДаты(ДатаПодачиДокументовНаГосРегистрацию));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПравилоОкругления) Тогда
		Текст = Текст + "
		|<p>Правило округления дробных частей ЦБ: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПравилоОкругления);
	КонецЕсли;
	
	// {Опциональный блок, при наличии связанного КД типа собрание}
	Если ЗначениеЗаполнено(КДРеференсСвязанныйСобрание) Тогда
		Текст = Текст + "
		|<p>Референс связанного КД ""Общее собрание владельцев"": %1</p>";
		Текст = СтрЗаменить(Текст, "%1", КДРеференсСвязанныйСобрание);
	КонецЕсли;
	
	// {Опциональный блок, только при наличии ссылки}
	Если ЗначениеЗаполнено(АдресВСетиИнтернет) Тогда
		Текст = Текст + "
		|<p>С дополнительными материалами корпоративного действия Вы можете ознакомиться по ссылке: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеСсылки(АдресВСетиИнтернет));
	КонецЕсли;
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОПроведенииКД_ПрочихВидов()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в %1 поступила информация о проведении корпоративного действия
	|""%2"" - %3 (%4, Референс КД %5).</p>";
	Текст = СтрЗаменить(Текст, "%1", мНаименованиеДепозитария);
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	
	// {Опциональный блок, только при наличии ссылки}
	Если ЗначениеЗаполнено(АдресВСетиИнтернет) Тогда
		Текст = Текст + "
		|<p>С деталями корпоративного действия Вы можете ознакомиться по ссылке: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеСсылки(АдресВСетиИнтернет));
	КонецЕсли;
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОбОтменеКД()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в %1 поступила информация об отмене корпоративного действия
	|""%2"" - %3 (%4, Референс КД %5).</p>";
	Текст = СтрЗаменить(Текст, "%1", мНаименованиеДепозитария);
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	
	// {Опциональный блок, при наличии данных}
	Если ЗначениеЗаполнено(ПричинаОтмены) Тогда
		Текст = Текст + "
		|<p>Причина отмены: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПричинаОтмены.Наименование);
	КонецЕсли;
	
	// {Опциональный блок, только при наличии ссылки}
	Если ЗначениеЗаполнено(АдресВСетиИнтернет) Тогда
		Текст = Текст + "
		|<p>С деталями корпоративного действия Вы можете ознакомиться по ссылке: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеСсылки(АдресВСетиИнтернет));
	КонецЕсли;
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОПроведенииКД_CписаниеЦБ()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в %1 поступила информация о проведении корпоративного действия
	|""%2"" - %3 (%4, Референс КД %5).</p>";
	Текст = СтрЗаменить(Текст, "%1", мНаименованиеДепозитария);
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));

	Если Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1) Тогда
		Текст = Текст + "
		|<p>Дата проведения операции в реестре: %1</p>
		|<p>Дата проведения операции в НРД: %2</p>";
		Текст = СтрЗаменить(Текст, "%1", ФорматОбязательнойДаты(ДатаКДРеестр, "ДатаКДРеестр_CписаниеЦБ"));
		Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойДаты(ДатаКДНРД, "ДатаКДНРД_CписаниеЦБ"));
	Иначе
		Текст = Текст + "
		|<p>Признак обязательности КД: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеПризнакаОбязательностиКД("ПризнакОбязательностиКД_CписаниеЦБ"));
	КонецЕсли;
	
	// {Опциональный блок, только при наличии ссылки}
	Если ЗначениеЗаполнено(АдресВСетиИнтернет) Тогда
		Текст = Текст + "
		|<p>С деталями корпоративного действия Вы можете ознакомиться по ссылке: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеСсылки(АдресВСетиИнтернет));
	КонецЕсли;
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОПроведенииКД_CвязанногоСВыплатой()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в %1 поступила информация о проведении корпоративного действия
	|""%2"" - %3 (%4, Референс КД %5).</p>";
	Текст = СтрЗаменить(Текст, "%1", мНаименованиеДепозитария);
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	
	Если Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1)
		ИЛИ (НЕ Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1) И ЗначениеЗаполнено(ДатаКДПлан)) Тогда
		Текст = Текст + "
		|<p>Дата проведения (план.): %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ФорматОбязательнойДаты(ДатаКДПлан, "ДатаКДПлан_CвязанногоСВыплатой"));
	КонецЕсли;
	
	Текст = Текст + "
	|<p>Дата фиксации: %1</p>";
	Текст = СтрЗаменить(Текст, "%1", ФорматОбязательнойДаты(ДатаФиксации, "ДатаФиксации_CвязанногоСВыплатой"));
	ДатаФиксацииОбязательна = Истина;
	
	// {Опциональный блок, только для КД иностранных эмитентов}
	Если НЕ Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1) Тогда
		Текст = Текст + "
		|<p>Признак обязательности КД: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеПризнакаОбязательностиКД("ПризнакОбязательностиКД_CвязанногоСВыплатой"));
	КонецЕсли;
	
	// {Опциональный блок, только для КД иностранных эмитентов по КД типов CAPG, DVCA, DVSE}
	Если ВидимостьГруппы_БезДивидендов() Тогда
		Если ЗначениеЗаполнено(ХДивДата) Тогда
			Текст = Текст + "
			|<p>Дата, с которой ценные бумаги торгуются ""без дивидендов"": %1</p>";
			Текст = СтрЗаменить(Текст, "%1", ФорматДаты(ХДивДата));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтавкаНалога) Тогда
			Текст = Текст + "
			|<p>Ставка удерживаемого налога, %: %1</p>";
			Текст = СтрЗаменить(Текст, "%1", СтавкаНалога);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЧистаяСтавкаДивидендов) Тогда
			Текст = Текст + "
			|<p>Чистая ставка дивидендов: %1 %2</p>";
			Текст = СтрЗаменить(Текст, "%1", ЧистаяСтавкаДивидендов);
			Текст = СтрЗаменить(Текст, "%2", Справочники.Валюты.ПредставлениеВалюты(ВалютаЧистойСтавкиДивидендов));
		КонецЕсли;
	КонецЕсли;
	
	// {Опциональный блок, только для DVCA, DVSE, CAPG, LIQU}
	Если ВидимостьГруппы_РазмерДивидендов() Тогда
		Текст = Текст + "
		|<p>Размер дивидендов на одну ценную бумагу в валюте платежа: %1</p>
		|<p>Валюта платежа: %2</p>";
		ПредставлениеВыплатаНа1ЦБ = ФорматОбязательнойСуммыСВалютой(ВыплатаНа1ЦБ, ВалютаПлатежа, "РазмерДивидендов");
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеВыплатаНа1ЦБ);
		Текст = СтрЗаменить(Текст, "%2", Справочники.Валюты.ПредставлениеВалюты(ВалютаПлатежа));
		
		Если Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1) И ЗначениеЗаполнено(Период) Тогда
			Текст = Текст + "
			|<p>Период: %1</p>";
			Текст = СтрЗаменить(Текст, "%1", Период);
		КонецЕсли;
	КонецЕсли;
	
	// {Опциональный блок, только для REDM, MCAL, PRED}
	Если ВидимостьГруппы_ПогашаемаяЧасть() Тогда
		Текст = Текст + "
		|<p>Погашаемая часть в %: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ФорматОбязательнойСуммы(ПогашаемаяЧасть, "ПогашаемаяЧасть"));
		
		Если Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(ЦеннаяБумага1) Тогда
			Текст = Текст + "
			|<p>Размер погашаемой части в валюте платежа: %1</p>";
			Текст = СтрЗаменить(Текст, "%1", ФорматОбязательнойСуммыСВалютой(РазмерПогашаемойЧасти,
				ВалютаПлатежа, "РазмерПогашаемойЧасти"));
		КонецЕсли;
		Текст = Текст + "
		|<p>Валюта платежа: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеОбязательнойВалюты(ВалютаПлатежа, "ВалютаПлатежа_ПогашаемаяЧасть"));
	КонецЕсли;
	
	// {Опциональный блок, только для INTR}
	Если ВидимостьГруппы_КупонныйДоход() Тогда
		Текст = Текст + "
		|<p>Ставка купонного дохода (%, годовых): %1</p>
		|<p>Размер купонного дохода в валюте платежа: %2</p>
		|<p>Валюта платежа: %3</p>
		|<p>Дата начала текущего купонного периода: %4</p>
		|<p>Дата окончания текущего купонного периода: %5</p>
		|<p>Количество дней в купонном периоде: %6</p>";
		Текст = СтрЗаменить(Текст, "%1", ФорматОбязательнойСуммы(СтавкаКупонногоДоходаГодовых, "СтавкаКупонногоДоходаГодовых"));
		Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСуммыСВалютой(ВыплатаНа1ЦБ, ВалютаПлатежа,
			"РазмерКупонногоДохода"));
		Текст = СтрЗаменить(Текст, "%3", ПредставлениеОбязательнойВалюты(ВалютаПлатежа, "ВалютаПлатежаКупонногоДохода"));
		Текст = СтрЗаменить(Текст, "%4", ФорматОбязательнойДаты(ДатаНачалаПериода, "ДатаНачалаКупонногоПериода"));
		Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойДаты(ДатаОкончанияПериода, "ДатаОкончанияКупонногоПериода"));
		Текст = СтрЗаменить(Текст, "%6", ФорматОбязательнойСуммы(КоличествоДнейВКупонномПериоде, "КоличествоДнейВКупонномПериоде"));
	КонецЕсли;
	
	// {Опциональный блок}
	Если ТребуетсяДобавитьИнформациюДляСубброкеров() Тогда
		Текст = Текст + "
		|#ИнформацияДляСубброкера#";
	КонецЕсли;
	
	// {Опциональный блок, только при наличии ссылки}
	Если ЗначениеЗаполнено(АдресВСетиИнтернет) Тогда
		Текст = Текст + "
		|<p>С деталями корпоративного действия Вы можете ознакомиться по ссылке: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеСсылки(АдресВСетиИнтернет));
	КонецЕсли;
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОПроведенииКД_ПодтверждениеОсвобожденияОтНалога()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в Депозитарий %1 поступила информация о проведении корпоративного действия
	|""%2"" - %3 (%4, Референс КД %5).</p>
	|<p>Дата КД (план.): %6</p>
	|<p>Дата фиксации: %7</p>
	|<p>Доходы по указанным ценным бумагам по умолчанию будут облагаться налогом по ставке 30%.
	|При наличии предоставленных в %1 документов:
	|<ul>
	|	<li>Формы W-8BEN для физических лиц или W-8BENE для юридических лиц,</li>
	|	<li>Условного поручения (Приложение 1.9 к РДО с отмеченным пунктом ""Раскрытие"")</li>
	|</ul>
	|будет произведено раскрытие владельца ценных бумаг налоговому агенту и применена льготная налоговая ставка.</p>
	|#UrlToInstr#
	|#UrlToVote#
	|<p>Последний срок участия в КД по форме 1.5 (перевод на налоговый раздел) не позднее: %8</p>
	|<p>Последний срок участия в КД по форме 1.9 (участие в раскрытии) не позднее: %9</p>";
	Текст = СтрЗаменить(Текст, "%1", СокрЛП(ДокументОснование.Организация.Наименование));
	Текст = СтрЗаменить(Текст, "%2", СокрЛП(ДокументОснование.ВидКД.Наименование));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", СокрЛП(КДРеференс));
	Текст = СтрЗаменить(Текст, "%6", ФорматДаты(ДатаКДПлан));
	Текст = СтрЗаменить(Текст, "%7", ФорматДаты(ДатаФиксации));
	Текст = СтрЗаменить(Текст, "%8", ФорматДаты(ДатаОкончанияПриемаПоручений1_5));
	Текст = СтрЗаменить(Текст, "%9", ФорматДаты(ДатаОкончанияПриемаПоручений1_10));
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОПроведенииКД_ВозвратЧастиНалога()
	
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в Депозитарий %1 поступила информация о проведении корпоративного действия
	|""%2"" - %3 (%4).</p>
	|<p>Референс КД: %5</p>
	|<p>Дата фиксации: %6</p>
	|<p>Дата окончания приёма инструкций ВТБКБ: %7</p>
	|<p>Для участия в КД необходимо предоставить Приложение 1.9 в %1 в указанный выше срок.</p>
	|#СсылкаДляУчастияВКорпоративномДействии#";
	Текст = СтрЗаменить(Текст, "%1", СокрЛП(ДокументОснование.Организация.Наименование));
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ДокументОснование.ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	Текст = СтрЗаменить(Текст, "%6", ФорматОбязательнойДаты(ДатаФиксации, "ДатаФиксации_ВозвратЧастиНалога"));
	Текст = СтрЗаменить(Текст, "%7", ФорматОбязательнойДаты(ДатаОкончанияПриемаИнструкцийВТБКБ,
	"ДатаОкончанияПриемаИнструкцийВТБКБ_ВозвратЧастиНалога"));
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОПроведенииКД_ВозвратЧастиНалогаНДИНД()
	
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	ДатаФиксации1РабочийДень = НачалоДня(КонецДня(ДатаФиксации) + 1);
	ДатаФиксации5РабочихДней = ОбщегоНазначения.ДобавитьРабочийКалендарныйДень(ДатаФиксации,5);
	ДатаСообщения = НачалоДня(БизнесПроцессы.ОбработкаWTRCСообщения.ДатаСообщенияWTRC(ДокументОснование));
	
	Если ДатаСообщения > ДатаФиксации Тогда 
	   // Активная ссылка без ответственности
		АктивнаяСсылка = Истина;
		Текст =
		"<p>Уведомляем Вас о том, что в Депозитарий %1 поступила информация о проведении корпоративного действия
		|""%2"" - %3 (%4).</p>
		|<p>Референс КД: %5</p>
		|<p>Дата фиксации: %7</p>
		|<p>#СсылкаДляУчастияВКорпоративномДействии#</p>
		|<p>Дата окончания приёма инструкций %1: %8</p>";
		Текст = СтрЗаменить(Текст, "%1", СокрЛП(ДокументОснование.Организация.Наименование));
		Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ДокументОснование.ВидКД.Наименование, "ВидКД"));
		Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
		Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
		Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
		Текст = СтрЗаменить(Текст, "%7", ФорматОбязательнойДаты(ДатаФиксации, "ДатаФиксации_ВозвратЧастиНалога"));
		Текст = СтрЗаменить(Текст, "%8", ФорматОбязательнойДаты(ДатаОкончанияПриемаИнструкцийВТБКБ, "ДатаОкончанияПриемаИнструкцийВТБКБ_ВозвратЧастиНалога"));

	ИначеЕсли ДатаФиксации5РабочихДней >= ДатаОкончанияПриемаИнструкцийНРД 
		ИЛИ ТекущаяДата = ДатаФиксации1РабочийДень Тогда
		// Активная ссылка
		АктивнаяСсылка = Истина;
		Текст =
		"<p>Уведомляем Вас о том, что в Депозитарий %1 поступила информация о проведении корпоративного действия
		|""%2"" - %3 (%4).</p>
		|<p>Референс КД: %5</p>
		|<p>Дата фиксации: %7</p>
		|<p>#СсылкаДляУчастияВКорпоративномДействии#</p>
		|<p>%1 не несет ответственности за обработку документов, предоставленных в дату окончания приема инструкций после 17:00.</p> 
		|<p>Дата окончания приёма инструкций %1: %8</p>";
		Текст = СтрЗаменить(Текст, "%1", СокрЛП(ДокументОснование.Организация.Наименование));
		Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ДокументОснование.ВидКД.Наименование, "ВидКД"));
		Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
		Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
		Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
		Текст = СтрЗаменить(Текст, "%7", ФорматОбязательнойДаты(ДатаФиксации, "ДатаФиксации_ВозвратЧастиНалога"));
		Текст = СтрЗаменить(Текст, "%8", ФорматОбязательнойДаты(ДатаОкончанияПриемаИнструкцийВТБКБ, "ДатаОкончанияПриемаИнструкцийВТБКБ_ВозвратЧастиНалога"));
	Иначе
		// Сначала не активная ссылка
		АктивнаяСсылка = Ложь;
		Текст =
		"<p>Уведомляем Вас о том, что в Депозитарий %1 поступила информация о проведении корпоративного действия
		|""%2"" - %3 (%4).</p>
		|<p>Референс КД: %5</p>
		|<p>Дата фиксации: %7</p>
		|<p>Подписание поручения на участие будет доступно на вкладке ""Корп. Действия"" в кабинете клиента после наступления даты фиксации.</p> 
		|<p>Дата окончания приёма инструкций %1: %8</p>";
		Текст = СтрЗаменить(Текст, "%1", СокрЛП(ДокументОснование.Организация.Наименование));
		Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ДокументОснование.ВидКД.Наименование, "ВидКД"));
		Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
		Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
		Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
		Текст = СтрЗаменить(Текст, "%7", ФорматОбязательнойДаты(ДатаФиксации, "ДатаФиксации_ВозвратЧастиНалога"));
		Текст = СтрЗаменить(Текст, "%8", ФорматОбязательнойДаты(ДатаОкончанияПриемаИнструкцийВТБКБ, "ДатаОкончанияПриемаИнструкцийВТБКБ_ВозвратЧастиНалога"));
	КонецЕсли;
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОПроведенииКД_СущественноеИзменениеПоЦБИноеСобытие()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в %1 поступила информация о проведении корпоративного действия
	|""%2"" - %3 (%4, Референс КД %5).</p>";
	Текст = СтрЗаменить(Текст, "%1", мНаименованиеДепозитария);
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	
	// {Опциональный блок, только при наличии ссылки}
	Если ЗначениеЗаполнено(АдресВСетиИнтернет) Тогда
		Текст = Текст + "
		|<p>С деталями корпоративного действия Вы можете ознакомиться по ссылке: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеСсылки(АдресВСетиИнтернет));
	КонецЕсли;
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОПроведенииКД_РаскрытиеИнформации()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в %1 поступила информация о проведении корпоративного действия
	|""%2"" - %3 (%4, Референс КД %5).</p>
	|<p>Период действия: с %6 по %7</p>
	|<p>Дата фиксации: %8</p>
	|<p>Валюта: %9</p>
	|<p>Для участия в КД необходимо предоставить в ООО Брокерская компания Платформа Поручение 1.9<p>
	|<p>Последний срок участия в КД: %A</p>";
	Текст = СтрЗаменить(Текст, "%1", мНаименованиеДепозитария);
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	Текст = СтрЗаменить(Текст, "%6", ФорматОбязательнойДаты(ДатаНачалаПериода,
		"ДатаНачалаПериода_РаскрытиеИнформации"));
	Текст = СтрЗаменить(Текст, "%7", ФорматОбязательнойДаты(ДатаОкончанияПериода,
		"ДатаОкончанияПериода_РаскрытиеИнформации"));
	Текст = СтрЗаменить(Текст, "%8", ФорматОбязательнойДаты(ДатаФиксации,
		"ДатаФиксации_РаскрытиеИнформации"));
	Текст = СтрЗаменить(Текст, "%9", ПредставлениеОбязательнойВалюты(ВалютаПлатежа,
		"ВалютаПлатежа_РаскрытиеИнформации"));
	Текст = СтрЗаменить(Текст, "%A", ФорматОбязательнойДаты(ДатаОкончанияПриемаИнструкцийВТБКБ,
		"ДатаОкончанияПриемаИнструкцийВТБКБ_РаскрытиеИнформации"));
		
	// {Опциональный блок, только при наличии ссылки}
	Если ЗначениеЗаполнено(АдресВСетиИнтернет) Тогда
		Текст = Текст + "
		|<p>С деталями корпоративного действия Вы можете ознакомиться по ссылке: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеСсылки(АдресВСетиИнтернет));
	КонецЕсли;
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОбИтогахСобрания()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в %1 поступила информация о решениях, принятых общим собранием акционеров, а также об итогах голосования на общем собрании акционеров
	|""%2"" - %3 (%4, Референс КД %5).</p>";
	Текст = СтрЗаменить(Текст, "%1", мНаименованиеДепозитария);
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	
	// {Опциональный блок, только при наличии ссылки}
	Если ЗначениеЗаполнено(АдресВСетиИнтернет) Тогда
		Текст = Текст + "
		|<p>С документацией Вы можете ознакомиться по ссылке: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеСсылки(АдресВСетиИнтернет));
	КонецЕсли;
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОбОтменеСобрания()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в %1 поступила информация об отмене общего собрания акционеров
	|""%2"" - %3 (%4, Референс КД %5).</p>";
	Текст = СтрЗаменить(Текст, "%1", мНаименованиеДепозитария);
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	
	// {Опциональный блок, только при наличии ссылки}
	Если ЗначениеЗаполнено(АдресВСетиИнтернет) Тогда
		Текст = Текст + "
		|<p>С документацией Вы можете ознакомиться по ссылке: %1</p>";
		Текст = СтрЗаменить(Текст, "%1", ПредставлениеСсылки(АдресВСетиИнтернет));
	КонецЕсли;
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОПроведенииКД_ПодтверждениеОсвобожденияОтНалогаПоЦБНеПодпадающимПодНалоговоеРегулированиеСША()
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в Депозитарий %1 поступила информация о проведении корпоративного действия
	|""%2"" - %3 (%4).</p>
	|<p>Референс КД: %5</p>
	|<p>Дата фиксации: %6</p>
	|<p>Дата окончания приёма инструкций ВТБКБ: %7</p>
	|<p>Для участия в КД необходимо предоставить Приложение 1.9 в %1 в указанный выше срок.</p>
	|#СсылкаДляУчастияВКорпоративномДействии#";
	Текст = СтрЗаменить(Текст, "%1", СокрЛП(ДокументОснование.Организация.Наименование));
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ДокументОснование.ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	Текст = СтрЗаменить(Текст, "%6", ФорматОбязательнойДаты(ДатаФиксации, "ДатаФиксации_ОсвобожденияОтНалогаНеСША"));
	Текст = СтрЗаменить(Текст, "%7", ФорматОбязательнойДаты(ДатаОкончанияПриемаИнструкцийВТБКБ,
		"ДатаОкончанияПриемаИнструкцийВТБКБ_ОсвобожденияОтНалогаНеСША"));
	
	Возврат Текст;
КонецФункции

Функция ТекстСообщенияОбИзмененииОстатков()
	
	// {Обязательный блок}
	Текст =
	"<p>Уведомляем Вас о том, что в %1 поступила информация о проведении корпоративного действия
	|""%2"" - %3 (%4, Референс КД %5).</p>
	|<p>За период с даты предоставления последнего списка владельцев ценных бумаг у Вас изменилось количество ценных бумаг.</p>";
	Текст = СтрЗаменить(Текст, "%1", мНаименованиеДепозитария);
	Текст = СтрЗаменить(Текст, "%2", ФорматОбязательнойСтроки(ВидКД.Наименование, "ВидКД"));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", ХарактеристикиЦБ());
	Текст = СтрЗаменить(Текст, "%5", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	АктивнаяСсылка = Ложь;
	
	Возврат Текст;
	
КонецФункции

Функция ТекстСообщенияОРегистрацииЗаявкиВУКПаи()
	
	// {Обязательный блок}
	Текст =
	"<p>%1.</p>
	|<p>Ваша Заявка на приобретение/погашение инвестиционных паев в Управляющую компанию через %2 по %3 (ISIN %4), %5.</p>";
	
	Если ЗначениеЗаполнено(ВходящийПакетИзФайловогоШлюза) Тогда
		MESSAGE = Обработки.ЭкспортПорученийВЛуч.ЗначениеЭлементаИзДанныхФайлов(ВходящийПакетИзФайловогоШлюза.СодержимоеФайла, "MESSAGE");
	Иначе
		MESSAGE = "";
	КонецЕсли;
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "МХДепонента, Дата");
	Текст = СтрЗаменить(Текст, "%1", MESSAGE);
	Текст = СтрЗаменить(Текст, "%2", РеквизитыОснования.МХДепонента);
	Текст = СтрЗаменить(Текст, "%3", ЦеннаяБумага1);
	Текст = СтрЗаменить(Текст, "%4", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦеннаяБумага1, "ISIN"));
	Текст = СтрЗаменить(Текст, "%5", Формат(РеквизитыОснования.Дата, "ДФ=dd.MM.yyyy"));
	
	Возврат Текст;
	
КонецФункции

Функция ОбщийEmailJSON()
	
	Результат = Новый Структура();
	
	MessageInfo = РаботаСJSON.СтруктураMessageInfo();
	MessageInfo.Вставить("MessageType", "Email");
	MessageInfo.Вставить("JsonVersion", "1.0.0");
	MessageInfo.Вставить("SystemSource", "Depo");
	MessageInfo.Вставить("ParentMessageId", Неопределено);
	MessageInfo.Вставить("ActionType", "INS");
	
	Data = Новый Структура();
	Data.Вставить("NotificationType", "Client");
	Data.Вставить("CrmClientId", Неопределено);
	Data.Вставить("Email", Неопределено);
	Data.Вставить("MailTemplateId", Неопределено);
	Data.Вставить("MailTemplateTitle", Неопределено);
	
	ReplaceFields = Новый Структура;
	ReplaceFields.Вставить("Имя", "");
	ReplaceFields.Вставить("Фамилия", "");
	ReplaceFields.Вставить("НомерДоговора", "");
	ReplaceFields.Вставить("ДатаДоговора", "");
	Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.УведомлениеОРегистрацииЗаявкиВУКПаи Тогда
		ReplaceFields.Вставить("ЗаголовокСообщения", ФормаСообщенияКК);
		ReplaceFields.Вставить("ТелоСообщения", "");
	ИначеЕсли ФормаСообщенияКК <> Перечисления.ФормыСообщенийКК.СвободнаяФорма Тогда
		ReplaceFields.Вставить("НаименованиеДепозитария", мНаименованиеДепозитария);
		ReplaceFields.Вставить("ВидКД", ФорматОбязательнойСтроки(ВидКД.Наименование, "ВидКД"));
		ReplaceFields.Вставить("НаименованиеЭмитента", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
		ReplaceFields.Вставить("ХарактеристикиЦБ", ХарактеристикиЦБ());
		ReplaceFields.Вставить("КДРеференс", ФорматОбязательнойСтроки(КДРеференс, "КДРеференс"));
	Иначе
		ReplaceFields = Новый Структура;
	КонецЕсли;
	
	Data.Вставить("ReplaceFields", ReplaceFields);
	
	Результат.Вставить("MessageInfo", MessageInfo);
	Результат.Вставить("Data", Data);
	
	Возврат Результат;

КонецФункции

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off

// Инициализирует структуру для документа JSON
Процедура СформироватьJSON(Шаблон = Неопределено) Экспорт
	
	Если (Не ЗначениеЗаполнено(Статус)
			Или Статус = Перечисления.СтатусыУведомленийКлиентам.ОжидаетОтправки
			Или Статус = Перечисления.СтатусыУведомленийКлиентам.СформированоСОшибками)
			Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.УведомлениеОРегистрацииЗаявкиВУКПаи
			Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.СвободнаяФорма Тогда
		
		ДатаФиксацииОбязательна = Ложь;
		ТелоСообщения = "";
		ОбъектJSON = ОбщийEmailJSON();
		
		Если Шаблон <> Неопределено Тогда
			ФормаСообщенияКК = Шаблон;
		КонецЕсли;
		
		Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПоступленииМатериаловКОбщемуСобраниюВладельцев Тогда
			ЗаполнитьТекстСообщенияОПоступленииМатериаловКОбщемуСобраниюВладельцев(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПоступленииИнформацииИзБюллетеня Тогда
			ЗаполнитьТекстСообщенияОПоступленииИнформацииИзБюллетеня(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВыкупПриобретениеЦБ Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_ВыкупПриобретениеЦБ(ОбъектJSON);
					
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_BPUT Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_BPUT(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_BIDS_TEND Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_BIDS_TEND(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_PRIO Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_PRIO(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_КонвертацияОбменЦБ Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_КонвертацияОбменЦБ(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ОбъединениеВыпусковЦБ Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_ОбъединениеВыпусковЦБ(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_РеорганизацииОбщества Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_РеорганизацииОбщества(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ПрочихВидов Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_ПрочихВидов(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеКД Тогда
			ЗаполнитьТекстСообщенияОбОтменеКД(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_CписаниеЦБ Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_CписаниеЦБ(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_CвязанногоСВыплатой Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_CвязанногоСВыплатой(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_CвязанногоСВыплатой_INTR_PRII Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_CвязанногоСВыплатой_INTR_PRII(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_CвязанногоСВыплатой_PRED_REDM_MCAL_others Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_CвязанногоСВыплатой_PRED_REDM_MCAL_others(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ПодтверждениеОсвобожденияОтНалога Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_ПодтверждениеОсвобожденияОтНалога(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалога
			Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ВозвратЧастиНалогаНДИНД Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_ВозвратЧастиНалога(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_СущественноеИзменениеПоЦБИноеСобытие Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_СущественноеИзменениеПоЦБИноеСобытие(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_РаскрытиеИнформации Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_РаскрытиеИнформации(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбИтогахСобрания Тогда
			ЗаполнитьТекстСообщенияОбИтогахСобрания(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеСобрания Тогда
			ЗаполнитьТекстСообщенияОбОтменеСобрания(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ПодтверждениеОсвобожденияОтНалогаПоЦБНеПодпадающимПодНалоговоеРегулированиеСША Тогда
			ЗаполнитьТекстСообщенияОПроведенииКД_ПодтверждениеОсвобожденияОтНалогаПоЦБНеПодпадающимПодНалоговоеРегулированиеСША(ОбъектJSON);
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбИзмененииОстатковЦБ Тогда
			
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.УведомлениеОРегистрацииЗаявкиВУКПаи Тогда
			ЗаполнитьТекстСообщенияОРегистрацииЗаявкиВУКПаи(ОбъектJSON);
			ЗаголовокСообщения = ОбъектJSON.Data.ReplaceFields.ЗаголовокСообщения;
		ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.СвободнаяФорма Тогда
			ЗаполнитьТекстСообщенияСвободнаяФорма(ОбъектJSON);
		КонецЕсли;
		
		Если ФормаСообщенияКК <> Перечисления.ФормыСообщенийКК.СвободнаяФорма
			И ФормаСообщенияКК <> Перечисления.ФормыСообщенийКК.УведомлениеОРегистрацииЗаявкиВУКПаи Тогда
			ТекстДопИнфо = Документы.УведомлениеКлиентам.УбратьЛишниеСимволы(Комментарий);
			Если ЗначениеЗаполнено(ДополнительнаяИнформация) Тогда
				ТекстДопИнфо = ДополнительнаяИнформация + Символы.ПС + ТекстДопИнфо;
			КонецЕсли;
			ТекстДопИнфо = СтрЗаменить(ТекстДопИнфо, Символы.ПС, "<br/>");
			ОбъектJSON.Data.ReplaceFields.Вставить("ДопИнфо", ТекстДопИнфо);
		КонецЕсли;
		ОбъектJSON.Data.ReplaceFields.Вставить("Подпись", ПодписьДляJSON());
		
		Для Каждого ПолеReplaceFields Из ОбъектJSON.Data.ReplaceFields Цикл
			Если ПолеReplaceFields.Значение = 0 Или СокрЛП(ПолеReplaceFields.Значение) = "0" Тогда
				ОбъектJSON.Data.ReplaceFields[ПолеReplaceFields.Ключ] = "";
			КонецЕсли;
		КонецЦикла;
		
		ТелоСообщения = РаботаСJSON.ТекстСообщенияJSON(ОбъектJSON.MessageInfo, ОбъектJSON.Data);
		
		// Общие обязательные поля
		Если ФормаСообщенияКК <> Перечисления.ФормыСообщенийКК.СвободнаяФорма Тогда
			Если НЕ ЗначениеЗаполнено(Эмитент) Тогда
				мНезаполненныеОбязательныеПоля.Добавить("Эмитент");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ЦеннаяБумага1) Тогда
				мНезаполненныеОбязательныеПоля.Добавить("ЦеннаяБумага1");
			КонецЕсли;
			
			РеквизитыЭмитента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Эмитент, "ЮрФизЛицо, ЮридическиеФизическиеЛица");
			Если РеквизитыЭмитента.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
				РеквизитыЮрлица = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыЭмитента.ЮридическиеФизическиеЛица,
					"МеждународнаяКомпания, Страна");
				Если РеквизитыЮрлица.МеждународнаяКомпания И РеквизитыЮрлица.Страна = Справочники.КлассификаторСтранМира.РОССИЯ Тогда
					ИндексДатыОкончанияПриемаИнструкций = мНезаполненныеОбязательныеПоля.Найти("ДатаОкончанияПриемаИнструкцийНРДИностранногоЭмитента");
					Если ИндексДатыОкончанияПриемаИнструкций <> Неопределено Тогда
						мНезаполненныеОбязательныеПоля.Удалить(ИндексДатыОкончанияПриемаИнструкций);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(мНезаполненныеОбязательныеПоля) Тогда
				Статус = Перечисления.СтатусыУведомленийКлиентам.СформированоСОшибками;
				СписокНезаполненныхОбязательныхПолей = ЗначениеВСтрокуВнутр(мНезаполненныеОбязательныеПоля);
			Иначе
				Статус = Перечисления.СтатусыУведомленийКлиентам.ОжидаетОтправки;
				СписокНезаполненныхОбязательныхПолей = "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on


//////////////////////////////////////////////////////////////////////////////////////////////
// ВЫГРУЗКА УВЕДОМЛЕНИЙ О КД

// Вызываемый метод Web-сервиса выполняет функции:
// 1. рассылает сообщение клиентам по эл.почте;
// 2. публикует сообщение в кабинете клиента;
// 3. создает в кабинете клиента форму поручения для участия в выкупе.
//
// В теле сообщения может содержаться маркер, который на стороне Web-сервиса заменяется на ссылку для участия в выкупе.
//
// Параметры:
//	ЗаголовокСообщения - простая строка
//	ТекстСообщения - строка HTML
//	Клиенты - таблица значений с данными клиентов для рассылки
//
// Возвращаемое значение:
//	Истина, если рассылка успешна, иначе Ложь
//
Функция ОтправитьУведомлениеПоВыкупам(ЗаголовокСообщения, ТекстСообщения, Клиенты, ОбработкаВебСервисы)
	Если Клиенты.Количество() = 0 Тогда
		СообщитьОбОшибке("Нет данных для отправки.");
		Возврат Ложь;
	КонецЕсли;
	
	ЗаменитьМаркерНаСсылкуДляУчастия(ТекстСообщения, СсылкаДляУчастияВКД);
	
	Запрос = Новый Запрос(ТекстЗапросаДляСообщенияTendBids());
	ЗаполнитьПараметрыЗапроса(Запрос, Клиенты);
	Результат = Запрос.ВыполнитьПакет();
	
	РезультатЗапросаПоДокументуКД = Результат[3];
	ТаблицаОпций = Результат[4].Выгрузить();
	РезультатЗапросаПоКлиентам = Результат[5];	
	
	ОпубликованоУспешно = ВебСервисыСервер.РезультатОтправкиУведомленияПоВыкупам(ТаблицаОпций,
		РезультатЗапросаПоКлиентам, РезультатЗапросаПоДокументуКД, ЗаголовокСообщения, ТекстСообщения,
		Строка(Ссылка.УникальныйИдентификатор()), ОбработкаВебСервисы);
	
	Возврат ОпубликованоУспешно;
КонецФункции

// Вызываемый метод Web-сервиса выполняет функции:
// 1. рассылает сообщение клиентам по эл.почте;
// 2. публикует сообщение в кабинете клиента;
// 3. создает страницу для голосования в кабинете клиента.
//
// В теле сообщения может содержаться маркер, который на стороне Web-сервиса заменяется на ссылку для голосования.
//
// Параметры:
//	ЗаголовокСообщения - простая строка
//	ТекстСообщения - строка HTML
//	Клиенты - таблица значений с данными клиентов для рассылки
//
// Возвращаемое значение:
//	Истина, если рассылка успешна, иначе Ложь
//
Функция ОтправитьУведомлениеПоСобраниям(ЗаголовокСообщения, ТекстСообщения, Клиенты, ОбработкаВебСервисы)
	Если Клиенты.Количество() = 0 Тогда
		СообщитьОбОшибке("Нет данных для отправки.");
		Возврат Ложь;
	КонецЕсли;
	
	ЗаменитьМаркерНаСсылкуДляУчастия(ТекстСообщения, СсылкаДляУчастияВКД);					
	
	Запрос = Новый Запрос(ТекстЗапросаДляСообщенияMeet());
	ЗаполнитьПараметрыЗапроса(Запрос, Клиенты);
	Результат = Запрос.ВыполнитьПакет();
	
	РезультатЗапросаПоДокументуКД	= Результат[3];
	РезультатЗапросаПоВопросам		= Результат[4];
	РезультатЗапросаПоКлиентам		= Результат[5];
	
	ОпубликованоУспешно = ВебСервисыСервер.РезультатОтправкиУведомленияПоСобраниям(РезультатЗапросаПоКлиентам,
		РезультатЗапросаПоВопросам, РезультатЗапросаПоДокументуКД,
		ЗаголовокСообщения, ТекстСообщения, Строка(Ссылка.УникальныйИдентификатор()), ОбработкаВебСервисы);
	
	Если ОпубликованоУспешно Тогда
		ЭтотОбъект.СозданаСтраницаГолосованияВКабинетеКлиента = Истина;	
	КонецЕсли;
	
	Возврат ОпубликованоУспешно;
КонецФункции

// Вызываемый метод Web-сервиса выполняет функции:
// 1. рассылает сообщение клиентам по эл.почте
// 2. публикует сообщение в кабинете клиента
//
// Параметры:
//	ЗаголовокСообщения - простая строка
//	ТекстСообщения - строка HTML
//	Клиенты - таблица значений с данными клиентов для рассылки
//
// Возвращаемое значение:
//	Истина, если рассылка успешна, иначе Ложь
//
Функция ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСообщения, Клиенты, ОбработкаВебСервисы,
		Маркер = "")
		
	Если Клиенты.Количество() = 0 Тогда
		СообщитьОбОшибке("Нет данных для отправки.");
		Возврат Ложь;
	КонецЕсли;
	
	ЗаменитьМаркерНаСсылкуДляУчастия(ТекстСообщения, Маркер);
	
	// Каждое сообщение должно быть опубликовано в кабинете клиента только 1 раз
	Если Ссылка = Документы.УведомлениеКлиентам.ПустаяСсылка() Тогда 
		Идентификатор = Строка(ПолучитьСсылкуНового().УникальныйИдентификатор());
	Иначе 
		Идентификатор = Строка(Ссылка.УникальныйИдентификатор());
	КонецЕсли;
	Если СтрНайти(ТекстСообщения, "<ИнформацияДляКлиентовИНД>") > 0 Тогда
		ТипыСчетовИНД = БизнесПроцессы.ОбработкаWTRCСообщения.ТипыСчетовИНД();
		ИдентификаторыКлиентовИНД = Новый Массив;
		ИдентификаторыКлиентовНеИНД = Новый Массив;
		Для Каждого Клиент Из Клиенты Цикл
			ClientId = СокрЛП(Клиент.ClientId);
			Если ТипыСчетовИНД.Найти(Клиент.СчетДепо.ТипСчетаДепо) = Неопределено Тогда
				ИдентификаторыКлиентовНеИНД.Добавить(ClientId);
			Иначе
				ИдентификаторыКлиентовИНД.Добавить(ClientId);
			КонецЕсли;
		КонецЦикла;
		Если ИдентификаторыКлиентовИНД.Количество() > 0 Тогда
			ТекстСообщенияИНД = ЗаменитьТекстУведомленияДляИНД(ТекстСообщения);
			ОпубликованоУспешноИНД = ВебСервисыСервер.РезультатОтправкиУведомленияИнформационного(ИдентификаторыКлиентовИНД,
				ЗаголовокСообщения, ТекстСообщенияИНД, Идентификатор, ОбработкаВебСервисы);
		Иначе
			ОпубликованоУспешноИНД = Истина;	
		КонецЕсли;
			
		Если ИдентификаторыКлиентовНеИНД.Количество() > 0 Тогда
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "<ИнформацияДляКлиентовИНД>", "");
			ОпубликованоУспешноНеИНД = ВебСервисыСервер.РезультатОтправкиУведомленияИнформационного(ИдентификаторыКлиентовНеИНД,
				ЗаголовокСообщения, ТекстСообщения, Идентификатор, ОбработкаВебСервисы);
		Иначе
			ОпубликованоУспешноНеИНД = Истина;	
		КонецЕсли;
			
		ОпубликованоУспешно = ОпубликованоУспешноИНД И ОпубликованоУспешноНеИНД;	
		
	Иначе
		ТаблицаКлиентов = Клиенты.Скопировать(, "ClientId");
		ТаблицаКлиентов.Свернуть("ClientId");
		ИдентификаторыКлиентов = ТаблицаКлиентов.ВыгрузитьКолонку("ClientId");
	
		
		ОпубликованоУспешно = ВебСервисыСервер.РезультатОтправкиУведомленияИнформационного(ИдентификаторыКлиентов,
			ЗаголовокСообщения, ТекстСообщения, Идентификатор, ОбработкаВебСервисы);

	КонецЕсли;
	Возврат ОпубликованоУспешно;
КонецФункции

Функция ПодготовитьУведомлениеИнформационное(ОбъектJSON, Клиенты, ВнешнийИсточник, Маркер = "")
		
	Если Клиенты.Количество() = 0 Тогда
		СообщитьОбОшибке("Нет данных для отправки.");
		Возврат Ложь;
	КонецЕсли;
	
	ЗаменитьМаркерНаСсылкуДляУчастия(ОбъектJSON, Маркер);
	Если Клиенты.Колонки.Найти("СпособОтправкиОтчетов") = Неопределено Тогда
		Клиенты.Колонки.Добавить("СпособОтправкиОтчетов");
	КонецЕсли;
	
	Если ОбъектJSON.Data.ReplaceFields.Свойство("ИнформацияДляКлиентовИНД") Тогда
		ТипыСчетовИНД = БизнесПроцессы.ОбработкаWTRCСообщения.ТипыСчетовИНД();
		ИдентификаторыКлиентовИНД = Новый Массив;
		ИдентификаторыКлиентовНеИНД = Новый Массив;
		Для Каждого ДанныеКлиента Из Клиенты Цикл
			ДанныеКлиента.ClientId = СокрЛП(ДанныеКлиента.ClientId);
			ДанныеКлиента.СпособОтправкиОтчетов = ДанныеКлиента.Клиент.СпособОтправкиОтчетов;
			ИдентификаторыКлиента = ЗаполненныеДанныеКлиента(ДанныеКлиента);

			Если ТипыСчетовИНД.Найти(ДанныеКлиента.СчетДепо.ТипСчетаДепо) = Неопределено Тогда
				ИдентификаторыКлиентовНеИНД.Добавить(ИдентификаторыКлиента);
			Иначе
				ИдентификаторыКлиентовИНД.Добавить(ИдентификаторыКлиента);
			КонецЕсли;
		КонецЦикла;
		Если ИдентификаторыКлиентовИНД.Количество() > 0 Тогда
			ЗаменитьИнформацияДляКлиентовИНД(ОбъектJSON);
			Для Каждого ИдентификаторыКлиента Из ИдентификаторыКлиентовИНД Цикл
				Документы.УведомлениеКлиентам.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, ИдентификаторыКлиента, ОбъектJSON, Ссылка);
			КонецЦикла;
		КонецЕсли;
			
		Если ИдентификаторыКлиентовНеИНД.Количество() > 0 Тогда
			ЗаменитьИнформацияДляКлиентовИНД(ОбъектJSON, "");
			Для Каждого ИдентификаторыКлиента Из ИдентификаторыКлиентовНеИНД Цикл
				Документы.УведомлениеКлиентам.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, ИдентификаторыКлиента, ОбъектJSON, Ссылка);
			КонецЦикла;
		КонецЕсли;
	Иначе
		ИдентификаторыКлиентов = Новый Массив;
		Для Каждого ДанныеКлиента Из Клиенты Цикл
			ДанныеКлиента.СпособОтправкиОтчетов = ДанныеКлиента.Клиент.СпособОтправкиОтчетов;
			ИдентификаторыКлиента = ЗаполненныеДанныеКлиента(ДанныеКлиента);
			ИдентификаторыКлиентов.Добавить(ИдентификаторыКлиента);
		КонецЦикла;
		Для Каждого ИдентификаторыКлиента Из ИдентификаторыКлиентов Цикл
			Документы.УведомлениеКлиентам.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, ИдентификаторыКлиента, ОбъектJSON, Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполненныеДанныеКлиента(ДанныеКлиента)
	
	ИдентификаторыКлиента = Новый Структура("ClientId, MessageId, Имя, Фамилия, НомерДоговора, ДатаДоговора, СпособОтправкиОтчетов");
	ЗаполнитьЗначенияСвойств(ИдентификаторыКлиента, ДанныеКлиента);
	Возврат ИдентификаторыКлиента;

КонецФункции

// Вызываемый метод Web-сервиса выполняет функции:
// 1. рассылает сообщение клиентам по эл.почте;
// 2. публикует сообщение в кабинете клиента;
// 3. создает в кабинете клиента форму поручения для участия в выкупе.
//
// В теле сообщения может содержаться маркер, который на стороне Web-сервиса заменяется на ссылку для участия
//
// Параметры:
//	ЗаголовокСообщения - простая строка
//	ТекстСообщения - строка HTML
//	Клиенты - таблица значений с данными клиентов для рассылки
//
// Возвращаемое значение:
//	Истина, если рассылка успешна, иначе Ложь
//
Функция ОтправитьУведомлениеПоВозвратуЧастиНалога(ЗаголовокСообщения, ТекстСообщения, Клиенты, ОбработкаВебСервисы, ВидКД)
	Если Клиенты.Количество() = 0 Тогда
		СообщитьОбОшибке("Нет данных для отправки.");
		Возврат Ложь;
	КонецЕсли;
	
	ЗаменитьМаркерНаСсылкуДляУчастия(ТекстСообщения, СсылкаДляУчастияВКД);
	
	Запрос = Новый Запрос(ТекстЗапросаДляСообщенияTrec());
	ЗаполнитьПараметрыЗапроса(Запрос, Клиенты);
	Результат = Запрос.ВыполнитьПакет();
	
	РезультатЗапросаПоДокументуКД = Результат[3];
	ТаблицаКлиентов = Результат[4].Выгрузить();
	
	ОпубликованоУспешно = ВебСервисыСервер.РезультатОтправкиУведомленияПоВозвратуЧастиНалога(ТаблицаКлиентов,
		РезультатЗапросаПоДокументуКД, ЗаголовокСообщения, ТекстСообщения, Строка(Ссылка.УникальныйИдентификатор()), ВидКД,
		ОбработкаВебСервисы);
	
	Возврат ОпубликованоУспешно;
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ ДЛЯ ВЫГРУЗКИ УВЕДОМЛЕНИЙ О КД
Функция ЗаменитьТекстУведомленияДляИНД(ТекстСообщения)
	ТекстУведомленияИНД = "<p>Выплата дивидендов по акциям, права на которые учитываются иностранными номинальными держателями," + 
		" и по акциям, права в отношении которых удостоверяются ценными бумагами иностранного эмитента" + 
		" (далее — депозитарные расписки), будет осуществляться в порядке, отличном от порядка, установленного пунктом 4 статьи 8.7 Закона № 39-ФЗ</p>";
	Возврат СтрЗаменить(ТекстСообщения, "<ИнформацияДляКлиентовИНД>", ТекстУведомленияИНД);
КонецФункции

Процедура ЗаменитьИнформацияДляКлиентовИНД(ОбъектJSON, ИнформацияДляКлиентовИНД = "")
	Если Не ЗначениеЗаполнено(ИнформацияДляКлиентовИНД) Тогда
		ИнформацияДляКлиентовИНД = ЗаменитьТекстУведомленияДляИНД("ИнформацияДляКлиентовИНД");
	КонецЕсли;
	ОбъектJSON.Data.ReplaceFields.ИнформацияДляКлиентовИНД = ИнформацияДляКлиентовИНД;
КонецПроцедуры

Функция ТекстЗапросаДляСообщенияTendBids()
	Возврат
	"// Запрос 0
	|ВЫБРАТЬ
	|	КД.ВидКД.Код КАК ВидКДКод,
	|	КД.КДРеференс КАК КДРеференс,
	|	КД.АдресВСетиИнтернет КАК АдресВСетиИнтернет,
	|	ПРЕДСТАВЛЕНИЕ(КД.Эмитент) КАК ЭмитентПредставление,
	|	КД.ЦеннаяБумага1 КАК ЦеннаяБумага1,
	|	КД.ЦеннаяБумага1Остаток КАК ЦеннаяБумага1Остаток,
	|	КД.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	|	КД.МинимальноеКодичествоДляУчастияВКД КАК МинимальноеКоличествоДляУчастияВКД,
	|	КД.ВыплатаНа1ЦБ КАК ВыплатаНа1ЦБ,
	|	КД.ДатаНачалаПриемаЗаявокНаВыкуп КАК ДатаНачалаПриемаЗаявокНаВыкуп,
	|	КД.ДатаОкончанияПриемаЗаявокНаВыкуп КАК ДатаОкончанияПриемаЗаявокНаВыкуп,
	|	КД.ДатаВыплатыНеПозднее КАК ДатаВыплатыНеПозднее,
	|	КД.БанковскийСчет.ВалютаДенежныхСредств.Наименование КАК ВалютаВыплаты,
	|	КД.ДатаФиксации КАК ДатаФиксации,
	|	КД.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втДанныеДокумента
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый КАК КД
	|ГДЕ
	|	КД.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Запрос 1
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ОстаткиПоКлиентам.ЦеннаяБумага КАК Справочник.ЦенныеБумаги) КАК ЦеннаяБумага,
	|	ОстаткиПоКлиентам.ClientId		КАК ClientId,
	|	ОстаткиПоКлиентам.Количество	КАК Количество
	|ПОМЕСТИТЬ втОстаткиПоКлиентамИсходная
	|ИЗ
	|	&ОстаткиПоКлиентам КАК ОстаткиПоКлиентам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Запрос 2
	|ВЫБРАТЬ
	|	ОстаткиПоКлиентам.ЦеннаяБумага		КАК ЦеннаяБумага,
	|	ОстаткиПоКлиентам.ClientId			КАК ClientId,
	|	СУММА(ОстаткиПоКлиентам.Количество)	КАК Количество
	|ПОМЕСТИТЬ втОстаткиПоКлиентам
	|ИЗ
	|	втОстаткиПоКлиентамИсходная КАК ОстаткиПоКлиентам
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоКлиентам.ЦеннаяБумага,
	|	ОстаткиПоКлиентам.ClientId
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Запрос 3: ВыборкаДокументов
	|ВЫБРАТЬ
	|	Документ.ВидКДКод КАК type,
	|	Документ.КДРеференс КАК reference,
	|	Документ.АдресВСетиИнтернет КАК ftpFile,
	|	Документ.ЭмитентПредставление КАК issuerName,
	|	Документ.ДатаОкончанияПриемаИнструкцийВТБКБ КАК deadLineDate,
	|	Документ.ДатаФиксации КАК cutOffDate,
	|	Документ.МинимальноеКоличествоДляУчастияВКД КАК unitMin
	|ИЗ
	|	втДанныеДокумента КАК Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Запрос 4: ТаблицаОпций
	|ВЫБРАТЬ
	|	Документ.ВыплатаНа1ЦБ КАК Price,
	|	ВЫБОР
	|		КОГДА Документ.ДатаНачалаПриемаЗаявокНаВыкуп = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Документ.ДатаНачалаПриемаЗаявокНаВыкуп
	|	КОНЕЦ КАК DateStart,
	|	ВЫБОР
	|		КОГДА Документ.ДатаОкончанияПриемаЗаявокНаВыкуп = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Документ.ДатаОкончанияПриемаЗаявокНаВыкуп
	|	КОНЕЦ КАК DateEnd,
	|	ВЫБОР
	|		КОГДА Документ.ДатаВыплатыНеПозднее = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Документ.ДатаВыплатыНеПозднее
	|	КОНЕЦ КАК DatePay,
	|	Документ.ВалютаВыплаты КАК PriceCurrencyType,
	|	""CASH"" КАК Type,
	|	""001"" КАК Number
	|ИЗ
	|	втДанныеДокумента КАК Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Запрос 5: ВыборкаКлиентов
	|ВЫБРАТЬ
	|	ОстаткиПоКлиентам.Количество КАК Unit,
	|	ОстаткиПоКлиентам.ЦеннаяБумага.ISIN КАК Isin,
	|	ОстаткиПоКлиентам.ЦеннаяБумага.Наименование КАК SecName,
	|	ВЫБОР
	|		КОГДА ОстаткиПоКлиентам.ЦеннаяБумага.ВидЦБ = &ВидыАкцийОбыкновенная
	|			ТОГДА ""Ordinary""
	|		ИНАЧЕ ""Preference""
	|	КОНЕЦ КАК SecType,
	|	КодыЗагрузки.Код КАК SecCode,
	|	ОстаткиПоКлиентам.ClientId КАК ClientId,
	|	ОстаткиПоКлиентам.ЦеннаяБумага.НомерРегистрации КАК GosRegNumber,
	|	ЕСТЬNULL(НоминалЦБСрезПоследних.Сумма, 0) КАК NominalValue,
	|	ОстаткиПоКлиентам.ЦеннаяБумага.ВалютаНоминала.Наименование КАК NominalCurrency,
	|	0 КАК StakeToParticipate
	|ИЗ
	|	втОстаткиПоКлиентам КАК ОстаткиПоКлиентам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ОстаткиПоКлиентам.ЦеннаяБумага = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = &НДЦ)
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ДатаДокумента)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ.СрезПоследних КАК НоминалЦБСрезПоследних
	|		ПО ОстаткиПоКлиентам.ЦеннаяБумага = НоминалЦБСрезПоследних.ЦеннаяБумага
	|ИТОГИ
	|	СУММА(Unit)
	|ПО
	|	ClientId";
КонецФункции

Функция ТекстЗапросаДляСообщенияMeet()
	Возврат
	"// Запрос 0
	|ВЫБРАТЬ
	|	КД.ВидКД.Код КАК ВидКДКод,
	|	КД.КДРеференс КАК КДРеференс,
	|	КД.АдресВСетиИнтернет КАК АдресВСетиИнтернет,
	|	ПРЕДСТАВЛЕНИЕ(КД.Эмитент) КАК ЭмитентПредставление,
	|	КД.ЦеннаяБумага1 КАК ЦеннаяБумага1,
	|	КД.ЦеннаяБумага1Остаток КАК ЦеннаяБумага1Остаток,
	|	КД.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	|	КД.МинимальноеКодичествоДляУчастияВКД КАК МинимальноеКоличествоДляУчастияВКД,
	|	КД.ВыплатаНа1ЦБ КАК ВыплатаНа1ЦБ,
	|	КД.ДатаНачалаПриемаЗаявокНаВыкуп КАК ДатаНачалаПриемаЗаявокНаВыкуп,
	|	КД.ДатаОкончанияПриемаЗаявокНаВыкуп КАК ДатаОкончанияПриемаЗаявокНаВыкуп,
	|	КД.ДатаВыплатыНеПозднее КАК ДатаВыплатыНеПозднее,
	|	КД.БанковскийСчет.ВалютаДенежныхСредств.Наименование КАК ВалютаВыплаты,
	|	КД.ДатаФиксации КАК ДатаФиксации,
	|	КД.Ссылка КАК Ссылка,
	|	КД.ДатаПроведенияСобрания КАК ДатаПроведенияСобрания
	|ПОМЕСТИТЬ втДанныеДокумента
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый КАК КД
	|ГДЕ
	|	КД.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Запрос 1
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ОстаткиПоКлиентам.ЦеннаяБумага КАК Справочник.ЦенныеБумаги) КАК ЦеннаяБумага,
	|	ОстаткиПоКлиентам.ClientId		КАК ClientId,
	|	ОстаткиПоКлиентам.Количество	КАК Количество
	|ПОМЕСТИТЬ втОстаткиПоКлиентамИсходная
	|ИЗ
	|	&ОстаткиПоКлиентам КАК ОстаткиПоКлиентам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Запрос 2
	|ВЫБРАТЬ
	|	ОстаткиПоКлиентам.ЦеннаяБумага		КАК ЦеннаяБумага,
	|	ОстаткиПоКлиентам.ClientId			КАК ClientId,
	|	СУММА(ОстаткиПоКлиентам.Количество)	КАК Количество
	|ПОМЕСТИТЬ втОстаткиПоКлиентам
	|ИЗ
	|	втОстаткиПоКлиентамИсходная КАК ОстаткиПоКлиентам
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоКлиентам.ЦеннаяБумага,
	|	ОстаткиПоКлиентам.ClientId
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Запрос 3: ВыборкаДокументов
	|ВЫБРАТЬ
	|	Документ.ВидКДКод КАК type,
	|	Документ.КДРеференс КАК reference,
	|	Документ.АдресВСетиИнтернет КАК ftpFile,
	|	Документ.ЭмитентПредставление КАК issuerName,
	|	Документ.ДатаПроведенияСобрания КАК MeetDate,
	|	Документ.ДатаОкончанияПриемаИнструкцийВТБКБ КАК deadLineDate,
	|	Документ.ДатаФиксации КАК cutOffDate
	|ИЗ
	|	втДанныеДокумента КАК Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Запрос 4: ВыборкаВопросов
	|ВЫБРАТЬ
	|	Вопросы.ДляИнформации КАК ForInformationOnly,
	|	Вопросы.КуммулятивныйВопрос КАК CumulativeVoting,
	|	Вопросы.ТекстВопроса КАК Description,
	|	ВЫБОР
	|		КОГДА Вопросы.Коэффициент = 0
	|			ТОГДА 1
	|		ИНАЧЕ Вопросы.Коэффициент
	|	КОНЕЦ КАК VoteMultiplier,
	|	Вопросы.ВариантыГолосования КАК VoteInstrTp,
	|	Вопросы.НомерВопроса КАК Number
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый.ВопросыКГолосованию КАК Вопросы
	|ГДЕ
	|	Вопросы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вопросы.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Запрос 5: ВыборкаКлиентов
	|ВЫБРАТЬ
	|	ОстаткиПоКлиентам.Количество КАК Unit,
	|	ОстаткиПоКлиентам.ЦеннаяБумага.ISIN КАК Isin,
	|	ОстаткиПоКлиентам.ЦеннаяБумага.Наименование КАК SecName,
	|	ВЫБОР
	|		КОГДА ОстаткиПоКлиентам.ЦеннаяБумага.ВидЦБ = &ВидыАкцийОбыкновенная
	|			ТОГДА ""Ordinary""
	|		ИНАЧЕ ""Preference""
	|	КОНЕЦ КАК SecType,
	|	КодыЗагрузки.Код КАК SecCode,
	|	ОстаткиПоКлиентам.ClientId КАК ClientId,
	|	ОстаткиПоКлиентам.ЦеннаяБумага.НомерРегистрации КАК GosRegNumber,
	|	ЕСТЬNULL(НоминалЦБСрезПоследних.Сумма, 0) КАК NominalValue,
	|	ОстаткиПоКлиентам.ЦеннаяБумага.ВалютаНоминала.Наименование КАК NominalCurrency,
	|	0 КАК StakeToParticipate,
	|	ОстаткиПоКлиентам.Количество КАК VoteNb
	|ИЗ
	|	втОстаткиПоКлиентам КАК ОстаткиПоКлиентам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ОстаткиПоКлиентам.ЦеннаяБумага = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = &НДЦ)
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ДатаДокумента)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ.СрезПоследних КАК НоминалЦБСрезПоследних
	|		ПО ОстаткиПоКлиентам.ЦеннаяБумага = НоминалЦБСрезПоследних.ЦеннаяБумага
	|ИТОГИ
	|	СУММА(Unit),
	|	СУММА(VoteNb)
	|ПО
	|	ClientId";
КонецФункции

Функция ТекстЗапросаДляСообщенияTrec()
	Возврат
	"// Запрос 0
	|ВЫБРАТЬ
	|	УведомлениеКлиентам.КДРеференс КАК КДРеференс,
	|	ПРЕДСТАВЛЕНИЕ(УведомлениеКлиентам.Эмитент) КАК ЭмитентПредставление,
	|	УведомлениеКлиентам.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ
	|ПОМЕСТИТЬ втДанныеДокумента
	|ИЗ
	|	Документ.УведомлениеКлиентам КАК УведомлениеКлиентам
	|ГДЕ
	|	УведомлениеКлиентам.Ссылка = &УведомлениеКлиентам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Запрос 1
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ОстаткиПоКлиентам.ЦеннаяБумага КАК Справочник.ЦенныеБумаги) КАК ЦеннаяБумага,
	|	ОстаткиПоКлиентам.ClientId		КАК ClientId,
	|	ОстаткиПоКлиентам.Количество	КАК Количество
	|ПОМЕСТИТЬ втОстаткиПоКлиентамИсходная
	|ИЗ
	|	&ОстаткиПоКлиентам КАК ОстаткиПоКлиентам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Запрос 2
	|ВЫБРАТЬ
	|	ОстаткиПоКлиентам.ЦеннаяБумага		КАК ЦеннаяБумага,
	|	ОстаткиПоКлиентам.ClientId			КАК ClientId,
	|	СУММА(ОстаткиПоКлиентам.Количество)	КАК Количество
	|ПОМЕСТИТЬ втОстаткиПоКлиентам
	|ИЗ
	|	втОстаткиПоКлиентамИсходная КАК ОстаткиПоКлиентам
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоКлиентам.ЦеннаяБумага,
	|	ОстаткиПоКлиентам.ClientId
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Запрос 3: ВыборкаДокументов
	|ВЫБРАТЬ
	|	Документ.КДРеференс КАК reference,
	|	Документ.ЭмитентПредставление КАК issuerName,
	|	Документ.ДатаОкончанияПриемаИнструкцийВТБКБ КАК deadLineDate
	|ИЗ
	|	втДанныеДокумента КАК Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Запрос 4: ВыборкаКлиентов
	|ВЫБРАТЬ
	|	ОстаткиПоКлиентам.Количество КАК Unit,
	|	ОстаткиПоКлиентам.ЦеннаяБумага.ISIN КАК Isin,
	|	ОстаткиПоКлиентам.ЦеннаяБумага.Наименование КАК SecName,
	|	ВЫБОР
	|		КОГДА ОстаткиПоКлиентам.ЦеннаяБумага.ВидЦБ = &ВидыАкцийОбыкновенная
	|			ТОГДА ""Ordinary""
	|		ИНАЧЕ ""Preference""
	|	КОНЕЦ КАК SecType,
	|	КодыЗагрузки.Код КАК SecCode,
	|	ОстаткиПоКлиентам.ClientId КАК ClientId,
	|	ОстаткиПоКлиентам.ЦеннаяБумага.НомерРегистрации КАК GosRegNumber,
	|	ЕСТЬNULL(НоминалЦБСрезПоследних.Сумма, 0) КАК NominalValue,
	|	ВЫБОР
	|		КОГДА ОстаткиПоКлиентам.ЦеннаяБумага.ВалютаНоминала = &ПустаяВалюта
	|			ТОГДА &НаименованиеВалютыПоУмолчанию
	|		ИНАЧЕ ОстаткиПоКлиентам.ЦеннаяБумага.ВалютаНоминала.Наименование
	|	КОНЕЦ КАК NominalCurrency,
	|	0 КАК StakeToParticipate
	|ИЗ
	|	втОстаткиПоКлиентам КАК ОстаткиПоКлиентам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ОстаткиПоКлиентам.ЦеннаяБумага = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = &НДЦ)
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ДатаДокумента)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ.СрезПоследних КАК НоминалЦБСрезПоследних
	|		ПО ОстаткиПоКлиентам.ЦеннаяБумага = НоминалЦБСрезПоследних.ЦеннаяБумага
	|";
КонецФункции

Процедура ЗаполнитьПараметрыЗапроса(Запрос, Клиенты)
	Запрос.УстановитьПараметр("Ссылка", 			ДокументОснование);
	Запрос.УстановитьПараметр("ДатаДокумента", 		Дата);
	Запрос.УстановитьПараметр("НДЦ", 				Константы.КлассификаторЗагрузкиНДЦ.Получить());
	Запрос.УстановитьПараметр("ОстаткиПоКлиентам",	Клиенты);
	Запрос.УстановитьПараметр("ВидыАкцийОбыкновенная",	Перечисления.ВидыАкций.Обыкновенная);
	Запрос.УстановитьПараметр("УведомлениеКлиентам",Ссылка);
	Запрос.УстановитьПараметр("ПустаяВалюта", 		Справочники.Валюты.ПустаяСсылка());
	Запрос.УстановитьПараметр("НаименованиеВалютыПоУмолчанию", Справочники.Валюты.ДолларСША().Наименование);
КонецПроцедуры

Функция ТребуетсяДобавитьИнформациюДляСубброкеров()
	Возврат ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_CвязанногоСВыплатой
			И Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "INTR, DVCA");
КонецФункции

Функция ОтправитьУведомлениеИнформационноеДляСубброкеров(ЗаголовокСообщения, ТекстСообщения, Клиенты, ОбработкаВебСервисы)
	Если Клиенты.Количество() = 0 Тогда
		СообщитьОбОшибке("Нет данных для отправки.");
		Возврат Ложь;
	КонецЕсли;
	
	СпискиКлиентов = КлиентыСКлассификациейПоСубброкеру(Клиенты);
	Успешно = Истина;
	
	Если СпискиКлиентов.Субброкеры.Количество() > 0 Тогда
		ТекстСубброкера = СтрЗаменить(ТекстСообщения, "#ИнформацияДляСубброкера#",
			"<p>По данному корпоративному действию необходимо предоставить информацию о владельцах ценных бумаг на дату фиксации для выплаты дохода.</p>");
		Если НЕ ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстСубброкера, СпискиКлиентов.Субброкеры,
					ОбработкаВебСервисы) Тогда
			Успешно = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если СпискиКлиентов.Клиенты.Количество() > 0 Тогда
		ТекстКлиента = СтрЗаменить(ТекстСообщения, "#ИнформацияДляСубброкера#", "");
		Если НЕ ОтправитьУведомлениеИнформационное(ЗаголовокСообщения, ТекстКлиента, СпискиКлиентов.Клиенты,
					ОбработкаВебСервисы) Тогда
			Успешно = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Успешно;
КонецФункции

Функция ПодготовитьУведомлениеИнформационноеДляСубброкеров(ОбъектJSON, Клиенты, ВнешнийИсточник)
	Если Клиенты.Количество() = 0 Тогда
		СообщитьОбОшибке("Нет данных для отправки.");
		Возврат Ложь;
	КонецЕсли;
	
	СпискиКлиентов = КлиентыСКлассификациейПоСубброкеру(Клиенты);
	Успешно = Истина;
	
	Если СпискиКлиентов.Субброкеры.Количество() > 0 Тогда
		Если НЕ ПодготовитьУведомлениеИнформационное(ОбъектJSON, СпискиКлиентов.Субброкеры, ВнешнийИсточник) Тогда
			Успешно = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если СпискиКлиентов.Клиенты.Количество() > 0 Тогда
		Если НЕ ПодготовитьУведомлениеИнформационное(ОбъектJSON, СпискиКлиентов.Клиенты, ВнешнийИсточник) Тогда
			Успешно = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Успешно;
КонецФункции

Функция КлиентыСКлассификациейПоСубброкеру(ВсеКлиенты)
	Субброкеры = ВсеКлиенты.СкопироватьКолонки();
	Клиенты = ВсеКлиенты.СкопироватьКолонки();
	
	Для Каждого Строка Из ВсеКлиенты Цикл
		Если Строка.Субброкер Тогда
			НоваяСтрока = Субброкеры.Добавить();
		Иначе
			НоваяСтрока = Клиенты.Добавить();
		Конецесли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Возврат Новый Структура("Субброкеры, Клиенты", Субброкеры, Клиенты);
КонецФункции

Процедура ОтправитьСвязанныеЗапросыСубброкеруНаРаскрытие()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.Ссылка КАК Ссылка,
	|	ЗапросСубброкеруНаРаскрытие.Клиент.Наименование КАК КлиентНаименование,
	|	ЗапросСубброкеруНаРаскрытие.СчетДЕПО.НомерДепозитарногоДоговора КАК НомерДепозитарногоДоговора
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.Статус = &Статус
	|	И ЗапросСубброкеруНаРаскрытие.УведомлениеКлиентам = &УведомлениеКлиентам
	|	И НЕ ЗапросСубброкеруНаРаскрытие.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("УведомлениеКлиентам", Ссылка);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Сформирован);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 
		ЗапросСубброкера = Выборка.Ссылка.ПолучитьОбъект();
		ЗапросСубброкера.Отправить();
		Если ЗапросСубброкера.Статус = Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Отправлен Тогда 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Отправлен запрос субброкеру на раскрытие %1 %2 по клиенту %3 %4",
			ЗапросСубброкера.Номер, ЗапросСубброкера.Дата,Выборка.КлиентНаименование, Выборка
			.НомерДепозитарногоДоговора);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьMessageId(Клиенты)
	
	Клиенты.Колонки.Добавить("MessageId");
	Для Каждого СтрокаТЗ Из Клиенты Цикл
		СтрокаТЗ.MessageId = Строка(Новый УникальныйИдентификатор());
	КонецЦикла;

КонецПроцедуры

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off

Функция КлиентыДляОтправкиУведомлений(ПараметрыУведомления = Неопределено) Экспорт
	
	ДатаСообщенияКД = ДатаПоследнегоВходящегоСообщенияЭтапыКД();
	
	ГраницаДатыФиксации = Новый Граница(?(ЗначениеЗаполнено(ДатаФиксации), КонецДня(ДатаФиксации), КонецДня(ТекущаяДатаСеанса())),
	ВидГраницы.Включая);
	
	Если ЗначениеЗаполнено(ДатаФиксации) Тогда
		МоментФормирования = ГраницаДатыФиксации;
	Иначе
		МоментФормирования = ДатаСообщенияКД;
	КонецЕсли;
	
	Клиенты = Неопределено;
	
	Если Не ПараметрыУведомления = Неопределено Тогда 
		Клиенты = ПараметрыУведомления.ТаблицаКлиентов.Скопировать(,
		"Клиент, Договор, СчетДепо, РазделСчетаДепо, ЦеннаяБумага, Количество");
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбИзмененииОстатковЦБ Тогда
		Клиенты = СписокКлиентовСвязанныхЗапросовСубброкераДляОтчета();
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.УведомлениеОРегистрацииЗаявкиВУКПаи Тогда
		Клиенты = СписокКлиентовЗаявкиВУК();
	ИначеЕсли Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "MEET, XMET, BMET, OMET") Тогда
		Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеКД
			Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбИтогахСобрания
			Или ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеСобрания Тогда
			Клиенты = КлиентыПоследнегоУведомленияДляОтчетаПоКлиентам(ДокументОснование);
		Иначе
			Клиенты = СписокКлиентовДляОтчетаПоКлиентам(МоментФормирования);
		КонецЕсли;
	ИначеЕсли (ВидКД.Код = "BIDS" И НомерСтатьи = "L750")
		Или (ВидКД.Код = "BIDS" И НомерСтатьи = "L720")
		Или (ВидКД.Код = "BIDS" И НомерСтатьи = "")
		Или (ВидКД.Код = "TEND" И НомерСтатьи = "L841")
		Или (ВидКД.Код = "TEND" И НомерСтатьи = "L842")
		Или (ВидКД.Код = "TEND" И НомерСтатьи = "")
		Или (ВидКД.Код = "TEND"
		И (ПризнакОбязательностиКД = Перечисления.ПризнакиОбязательностиКД.MAND ИЛИ НомерСтатьи = "L848"))
		Или Документы.УведомлениеКлиентам.ВидКДВСписке(ВидКД, "CHAN, OTHR, PRIO, DSCL") Тогда
		Клиенты = КлиентыДляОтправкиУведомленийСУчетомОтменыКД(МоментФормирования);
	ИначеЕсли ВидКД.Код = "BPUT" Тогда
		Клиенты = КлиентыДляОтправкиУведомленийСУчетомОтменыКД(ДатаСообщенияКД);
	Иначе
		Клиенты = СписокКлиентовДляОтчетаПоКлиентам(МоментФормирования);
	КонецЕсли;
	
	Возврат Клиенты;
	
КонецФункции

// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on

Функция КлиентыДляОтправкиУведомленийСУчетомОтменыКД(МоментФормирования)
	
	Если ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеКД Тогда
		Клиенты = КлиентыПоследнегоУведомленияДляОтчетаПоКлиентам(ДокументОснование);
	Иначе
		Клиенты = СписокКлиентовДляОтчетаПоКлиентам(МоментФормирования);
	КонецЕсли;
	
	Возврат Клиенты;

КонецФункции

Функция ДатаПоследнегоВходящегоСообщенияЭтапыКД()
	
	ТекущийМомент = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭтапыКДСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.ЭтапыКД.СрезПоследних(
	|			,
	|			КД В
	|					(ВЫБРАТЬ
	|						УведомлениеКлиентам.ДокументОснование КАК ДокументОснование
	|					ИЗ
	|						Документ.УведомлениеКлиентам КАК УведомлениеКлиентам
	|					ГДЕ
	|						УведомлениеКлиентам.Ссылка = &Ссылка)
	|				И НЕ Исходящее) КАК ЭтапыКДСрезПоследних";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ТекущийМомент = ВыборкаДетальныеЗаписи.Период;
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонецДня(ТекущийМомент);

КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мОрганизация				= Константы.ОрганизацияПоУмолчанию.Получить();
мНаименованиеДепозитария	= "Депозитарий " + СокрЛП(мОрганизация.Наименование);
мНезаполненныеОбязательныеПоля = Новый Массив;
