Процедура ФормированиеВыпискиОСостоянииСчетаДЕПО(Знач ПроверятьИсходящийНомер = Ложь, Знач АвтоИсполнение = Ложь) Экспорт
	Если ПроверятьИсходящийНомер Тогда
		Если ЗначениеЗаполнено(ИсходящийНомер) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	#Если Клиент Тогда
		ПараметрыОтчета = Новый Структура("Выписка", Ссылка);
		ОткрытьФорму("Отчет.ВыпискаОСостоянииСчетаДепо.Форма.ФормаОтчета", ПараметрыОтчета);
	#КонецЕсли
КонецПроцедуры

Процедура ФормированиеВыпискиОбОперацияхПоСчетуДЕПО(Знач ПроверятьИсходящийНомер = Ложь, Знач АвтоИсполнение = Ложь) Экспорт
	Если ПроверятьИсходящийНомер Тогда
		Если ЗначениеЗаполнено(ИсходящийНомер) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Форма = Отчеты.ВыпискаОбОперацияхСчетамДепо_Новая.ПолучитьФорму("ФормаОтчета");
	//---
	Форма.Элементы.ФормаНастройкиФормированияВыписок.Пометка	= Истина;
	Форма.Отчет.ВыпискаДокумент									= Ссылка;
	Форма.Отчет.Выписка											= Истина;
	
	Форма.Открыть();
	
	Форма.ВыпискаДокументПриИзменении();
	
	Форма.Сформировать();
КонецПроцедуры

Процедура ФормированиеОтчетаОВыполненнойОперации(Знач ПроверятьИсходящийНомер = Ложь, Знач АвтоИсполнение = Ложь) Экспорт
	Если ПроверятьИсходящийНомер Тогда
		Если ЗначениеЗаполнено(ИсходящийНомер) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка.ОперацияЦБ) Тогда
		Форма	= Отчеты.ОтчетОВыполненнойОперации_Новый.ПолучитьФорму("ФормаОтчета");
		Форма.ОтчетОбъект.Основание		= Ссылка;
		Форма.ОтчетОбъект.ОперацияЦБ	= Ссылка.ОперацияЦБ;
		Форма.ОтчетОбъект.ДатаВыписки	= Ссылка.Дата;
		Форма.Открыть();
		Форма.ОтчетОбъект.ТипОперации	= Ссылка.ОперацияЦБ.Метаданные().Имя;
		Форма.ЗаполнитьОтчет();
	Иначе
		Сообщить("Не определена 'Операция ЦБ'!!!");
	КонецЕсли;
КонецПроцедуры

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИсходящийНомер) Тогда
		СпособОтправкиОтчета = Справочники.СпособыПередачиИнформации.ЭДО;
	Иначе
		СпособОтправкиОтчета = Справочники.СпособыПередачиИнформации.Лично;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Автор	= ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Если Не ЭтоНовый() Тогда
			Изменил	= ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
	// Счет ДЕПО должен соответствовать владельцу счета
	Если ЗначениеЗаполнено(ВладелецСчета)
		И ЗначениеЗаполнено(СчетДепо)
		И СчетДепо.Владелец <> ВладелецСчета Тогда
		Сообщить("Счет ДЕПО не принадлежит владельцу счета!", СтатусСообщения.Внимание);
		Отказ = Истина;
	КонецЕсли;
	
	ОбновитьДопИнформацию();
	
	// Операция должна иметь тот же документ-основание, что и выписка
	РазныеДокументыОснования = Ложь;
	Если ЗначениеЗаполнено(ДокументОснование) И ЗначениеЗаполнено(ОперацияЦБ) Тогда
		
		Если ТипЗнч(ОперацияЦБ) = Тип("ДокументСсылка.ОперацииЦБ")
			И ОперацияЦБ.ВидОперацииД = Справочники.ВидыОпераций.Перевод Тогда
			
			Если ЗначениеЗаполнено(ОперацияЦБ.ДокументОснование)
				И ДокументОснование <> ОперацияЦБ.ДокументОснование
				И ЗначениеЗаполнено(ОперацияЦБ.ДокументОснованиеВстречный)
				И ДокументОснование <> ОперацияЦБ.ДокументОснованиеВстречный Тогда
				
				РазныеДокументыОснования = Истина;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ОперацияЦБ.ДокументОснование)
				И ДокументОснование <> ОперацияЦБ.ДокументОснование Тогда
				РазныеДокументыОснования = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если РазныеДокументыОснования Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Операция ЦБ и выписка имеют разные документы-основания.";
    	Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on

Процедура ОбработкаЗаполнения(Основание)
	ТипОснования = ТипЗнч(Основание);
	ТипОперацииЦБ = ТипЗнч(ОперацияЦБ);
	
	Если ТипОснования = Тип("ДокументСсылка.Поручение") Или ТипОснования = Тип("ДокументОбъект.Поручение") Тогда
		Если Основание.ВидОперацииД = Справочники.ВидыОпераций.ПредоставлениеУведомления Тогда 
			Дата							= Основание.Дата;
			ДокументОснование 				= Основание.Ссылка;			
			ВладелецСчета 					= Основание.Инициатор;
			СчетДепо						= Основание.СчетДепо;
			ДатаНачПериода					= Основание.ДатаНачПериода;
			ДатаКонПериода					= Основание.ДатаКонПериода;
			МХУведомление					= Основание.МХДепонента;
			МХВыписка						= Основание.МХКонтрагент;
			ЭмитентУведомление				= Основание.ЭмитентУведомление;
			ЭмитентВыписка					= Основание.ЭмитентВыписка;
		ИначеЕсли НЕ ФормироватьОперацииПоПоручениямНаОтчет(Основание.Дата)
					И Перечисления.ВидыОтчетов.ЭтоВыпискаИлиОтчет(Основание.ВидОперацииД) Тогда
			ЗаполнитьВыпискуНаОснованииПорученияНаОтчет(Основание);
		Иначе
			Проверка = Истина;
			Сообщить("На основании данного вида поручения нельзя создать документ Выписка !!!");
			Возврат;
		КонецЕсли;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОперацииЦБ") ИЛИ ТипОснования = Тип("ДокументОбъект.ОперацииЦБ") Тогда
		Дата				= Основание.Дата;
		ВидОтчета			= Перечисления.ВидыОтчетов.Отчет;		
		ОперацияЦБ			= Основание.Ссылка;
		ТипОперацииЦБ		= ТипЗнч(ОперацияЦБ);
		ДокументОснование	= Основание.ДокументОснование;
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.иц_СводноеПоручение") И ЗначениеЗаполнено(ДокументОснование.ДатаФормированияОтчетов) Тогда
			Дата = ДокументОснование.ДатаФормированияОтчетов;
		КонецЕсли;
		Если ТипОперацииЦБ	= Тип("ДокументСсылка.ОткрытиеСчетаДепо") 
			ИЛИ ТипОперацииЦБ = Тип("ДокументСсылка.ОткрытиеРазделаСчетаДепо")
			ИЛИ ТипОперацииЦБ = Тип("ДокументСсылка.КорректировкаРеквизитовСчетаДепо")
			ИЛИ ТипОперацииЦБ = Тип("ДокументСсылка.НазначениеПредставителяСчетаДепо")
			ИЛИ ТипОперацииЦБ = Тип("ДокументСсылка.ОтменаПредставителяСчетаДепо")
			ИЛИ ТипОперацииЦБ = Тип("ДокументСсылка.ЗакрытиеСчетаДепо")
		Тогда
			СчетДепо		= Основание.СчетДепо;
			ВладелецСчета	= Основание.ДокументОснование.Инициатор;
		ИначеЕсли ТипОперацииЦБ = Тип("ДокументСсылка.ЦбВПути") ИЛИ ТипОперацииЦБ = Тип("ДокументСсылка.ОперацииЦБ") Тогда
			СчетДепо		= ОперацияЦБ.СчетДепо;
			ВладелецСчета	= ОперацияЦБ.Депонент;
		ИначеЕсли
			ТипОперацииЦБ = Тип("ДокументСсылка.ВводДивидендов") 
			ИЛИ ТипОперацииЦБ = Тип("ДокументСсылка.ПогашениеЦБ")
			ИЛИ ТипОперацииЦБ = Тип("ДокументСсылка.ПогашениеЦБПолное")
			ИЛИ ТипОперацииЦБ = Тип("ДокументСсылка.ПогашениеЦБЧастичное")
			ИЛИ ТипОперацииЦБ = Тип("ДокументСсылка.ГлобальнаяОперация")
			ИЛИ ТипОперацииЦБ = Тип("ДокументСсылка.КонвертацияЦБ")
			ИЛИ ТипОперацииЦБ = Тип("ДокументСсылка.ПогашениеНКД") 
			ИЛИ ТипОперацииЦБ = Тип("ДокументСсылка.ОтменаПоручения")
		Тогда
			ВладелецСчета = ?(ТипОперацииЦБ = Тип("ДокументСсылка.ОтменаПоручения"),ОперацияЦБ.ДокументОснование.Инициатор,ОперацияЦБ.Инициатор);
		ИначеЕсли ТипОперацииЦБ = Тип("ДокументСсылка.ФормированиеРеестраВладельцев") Тогда
			ВладелецСчета = ОперацияЦБ.Эмитент;
		КонецЕсли;	
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОткрытиеСчетаДепо") 
		ИЛИ ТипОснования = Тип("ДокументОбъект.ОткрытиеСчетаДепо")
		ИЛИ ТипОснования = Тип("ДокументОбъект.ЗакрытиеСчетаДепо")
		ИЛИ ТипОснования = Тип("ДокументСсылка.ЗакрытиеСчетаДепо")
	Тогда
		Дата				= Основание.Дата;
		ДокументОснование	= Основание.ДокументОснование;
		ВидОтчета			= Перечисления.ВидыОтчетов.Отчет;
		ВладелецСчета		= Основание.ВладелецСчета;
		СчетДЕПО			= Основание.СчетДЕПО;
		Если Не ЗначениеЗаполнено(СпособОтправкиОтчета) Тогда
			СпособОтправкиОтчета = Справочники.СпособыПередачиИнформации.ЭДО;
		КонецЕсли;
		ОперацияЦБ			= Основание.Ссылка;
		ТарифныйПлан		= Основание.ТарифныйПлан;
		Автор				= ПараметрыСеанса.ТекущийПользователь;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОткрытиеРазделаСчетаДепо") ИЛИ ТипОснования = Тип("ДокументОбъект.ОткрытиеРазделаСчетаДепо")
		Или ТипОснования = Тип("ДокументСсылка.ЗакрытиеРазделаСчетаДепо") ИЛИ ТипОснования = Тип("ДокументОбъект.ЗакрытиеРазделаСчетаДепо") Тогда
		
		Дата = Основание.Дата;
		ДокументОснование = Основание.ДокументОснование;
		ВидОтчета = Перечисления.ВидыОтчетов.Отчет;
		ВладелецСчета = Основание.ВладелецСчета;
		СчетДЕПО = Основание.СчетДЕПО;
		Если Не ЗначениеЗаполнено(СпособОтправкиОтчета) Тогда
			СпособОтправкиОтчета = Справочники.СпособыПередачиИнформации.ЭДО;
		КонецЕсли;
		ОперацияЦБ = Основание.Ссылка;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.НазначениеПредставителяСчетаДепо") ИЛИ ТипОснования = Тип("ДокументОбъект.НазначениеПредставителяСчетаДепо") Тогда
		Дата = Основание.Дата;
		ДокументОснование = Основание.ДокументОснование;
		ВидОтчета = Перечисления.ВидыОтчетов.Отчет;
		ВладелецСчета = Основание.ВладелецСчета;
		СчетДЕПО = Основание.СчетДЕПО;
		Если Не ЗначениеЗаполнено(СпособОтправкиОтчета) Тогда
			СпособОтправкиОтчета = Справочники.СпособыПередачиИнформации.ЭДО;
		КонецЕсли;
		ОперацияЦБ = Основание.Ссылка;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтменаПредставителяСчетаДепо") ИЛИ ТипОснования = Тип("ДокументОбъект.ОтменаПредставителяСчетаДепо") Тогда
		Дата				= Основание.Дата;
		ДокументОснование	= Основание.ДокументОснование;
		ОперацияЦБ			= Основание.Ссылка;
		ВидОтчета			= Перечисления.ВидыОтчетов.Отчет;
		ВладелецСчета		= Основание.ВладелецСчета;
		СчетДЕПО			= Основание.СчетДЕПО;
		ТарифныйПлан		= Основание.ТарифныйПлан;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ГлобальнаяОперация") ИЛИ ТипОснования = Тип("ДокументОбъект.ГлобальнаяОперация") Тогда
		Дата				= Основание.Дата;
		ВидОтчета			= Перечисления.ВидыОтчетов.Отчет;
		ОперацияЦБ			= Основание.Ссылка;
		ДокументОснование	= Основание.ДокументОснование;
		ВладелецСчета		= Основание.СчетДепо.Владелец;
		СчетДепо			= Основание.СчетДепо;
		ТарифныйПлан		= Основание.ТарифныйПлан;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтменаПоручения") ИЛИ ТипОснования = Тип("ДокументОбъект.ОтменаПоручения") Тогда
		Дата				= Основание.Дата;
		ВидОтчета			= Перечисления.ВидыОтчетов.Отчет;
		ОперацияЦБ			= Основание.Ссылка;
		ДокументОснование	= Основание.ДокументОснование;
		ВладелецСчета		= Основание.ОтменяемоеПоручение.СчетДепо.Владелец;
		СчетДепо			= Основание.ОтменяемоеПоручение.СчетДепо;
		ТарифныйПлан		= Основание.ТарифныйПлан;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.УчастиеВКД") ИЛИ ТипОснования = Тип("ДокументОбъект.УчастиеВКД") Тогда
		Дата				= Основание.Дата;
		ВидОтчета			= Перечисления.ВидыОтчетов.Отчет;
		ОперацияЦБ			= Основание.Ссылка;
		ДокументОснование	= Основание.ДокументОснование;
		ВладелецСчета		= Основание.Депонент;
		СчетДепо			= Основание.СчетДепо;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ИзменениеАнкетныхДанных") ИЛИ ТипОснования = Тип("ДокументОбъект.ИзменениеАнкетныхДанных") Тогда
		Дата				= Основание.Дата;
		ВидОтчета			= Перечисления.ВидыОтчетов.Отчет;
		ОперацияЦБ			= Основание.Ссылка;
		ДокументОснование	= Основание.ДокументОснование;
		ВладелецСчета		= Основание.ВладелецСчета;
		СчетДепо			= Основание.СчетДепо;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ФормированиеОтчетаВыписки")
				ИЛИ ТипОснования = Тип("ДокументОбъект.ФормированиеОтчетаВыписки") Тогда
		Если ЗначениеЗаполнено(Основание.ДокументОснование)
			И ФормироватьОперацииПоПоручениямНаОтчет(Основание.ДокументОснование.Дата)
			И Перечисления.ВидыОтчетов.ЭтоВыпискаИлиОтчет(Основание.ВидОтчета) Тогда
			
			ЗаполнитьВыпискуНаОснованииПорученияНаОтчет(Основание.ДокументОснование);
			ОперацияЦБ = Основание.Ссылка;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если ТипЗнч(ОперацияЦБ) = Тип("ДокументСсылка.ОперацииЦБ") Тогда
		Если НЕ ОперацияЦБ.ВидОперацииД = Справочники.ВидыОпераций.ПриемЦБНаОбслуживание 
			И НЕ ОперацияЦБ.ВидОперацииД = Справочники.ВидыОпераций.СнятиеЦБсОбслуживания 
		Тогда
			Если ОбщегоНазначения.ПроверкаЗаполненностиРеквизитов1(ВладелецСчета) Тогда
				Отказ = Истина;
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		Если ОбщегоНазначения.ПроверкаЗаполненностиРеквизитов1(ВладелецСчета) Тогда
			Отказ = Истина;
		КонецЕсли; 
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетДЕПО) Тогда
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду(Лев(СокрЛП(СчетДЕПО.Код), 7));
		Услуга = Новый Структура("Операция, МестоХранения1, МестоХранения2", ВидОтчета, Неопределено, Неопределено);
		РасчетныеПараметры = РасчетТарифов.РасчетСтоимостиУслуги(Дата, Договор, Услуга);
								
		Если РасчетныеПараметры <> Неопределено Тогда
			Движение = Движения.УслугиДепозитария.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Инициатор = ВладелецСчета;
			Движение.Услуга = РасчетныеПараметры.Услуга;
			Движение.МестоХранения = МХВыписка;
			Движение.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118;
			Движение.Валюта = РасчетныеПараметры.Валюта;
			Движение.Сумма = РасчетныеПараметры.Сумма;
			Движение.СуммаВВалюте = Конвертации.КонвертацияВалюты(Дата, Движение.Сумма, РасчетныеПараметры.Валюта);
			Движение.СуммаНДС = РасчетТарифов.РТ_РасчетНДС(Движение.СтавкаНДС, Движение.Сумма);
			Движение.СуммаВсего = РасчетТарифов.РТ_ОбщаяСумма(Движение.СтавкаНДС,Движение.Сумма,Движение.СуммаНДС);
			Движение.Сумма = Движение.СуммаВсего - Движение.СуммаНДС;
			Движение.ТипТарифа = РасчетныеПараметры.ТипТарифа;
			Движение.Тариф = РасчетныеПараметры.Тариф;
			Движения.УслугиДепозитария.Записать();
		КонецЕсли; 	
	
	КонецЕсли; 
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Поручение") Тогда
		Если ДокументОснование.Эдо Тогда
			Если ВидОтчета = Перечисления.ВидыОтчетов.ВыпискаОСостоянииСчетаДЕПО Тогда
				ФормированиеВыпискиОСостоянииСчетаДЕПО(Истина, Истина);
			ИначеЕсли ВидОтчета = Перечисления.ВидыОтчетов.ОтчетОбОперацияхПоСчетуДЕПО Тогда
				ФормированиеВыпискиОбОперацияхПоСчетуДЕПО(Истина, Истина);
			ИначеЕсли ВидОтчета = Перечисления.ВидыОтчетов.Выписка Тогда
				ФормированиеВыпискиОбОперацияхПоСчетуДЕПО(Истина, Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
			
	Если Документы.Поручение.ЭтоВыплатаДоходаПоПрогрессивнойШкалеНДФЛ(ДокументОснование) Тогда
		ДатаИсполненияПоручения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ДатаИсполненияПоручения");
		Если Не ЗначениеЗаполнено(ДатаИсполненияПоручения) Тогда
			НоваяДатаИсполнения = Документы.Поручение.ДатаИсполненияПорученияВыплатыДоходаПоПрогрессивнойШкалеНДФЛ(ДокументОснование);		
			Если ЗначениеЗаполнено(НоваяДатаИсполнения) Тогда
				ДокументПоручение = ДокументОснование.ПолучитьОбъект();
				ДокументПоручение.ДатаИсполненияПоручения = НоваяДатаИсполнения;
				РегистрыСведений.СтатусыПоручений.УстановитьСтатус(ДокументПоручение.Движения, ДокументОснование,
					НоваяДатаИсполнения, Перечисления.СтатусыПоручений.Исполнено);
				ДокументПоручение.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НЕ СуществуетИсполнениеПоручения()
		И ЗначениеЗаполнено(ДокументОснование) 
		И ОбщегоНазначения.ЕстьРеквизитДокумента("ДатаИсполненияПоручения", ДокументОснование.Метаданные()) 
		И ДокументОснование.ДатаИсполненияПоручения <> Дата И НЕ ДополнительныеСвойства.Свойство("ИсключитьИзменениеВремениИсполнения") Тогда
			
		ДокументПоручение = ДокументОснование.ПолучитьОбъект();
		ДокументПоручение.ДатаИсполненияПоручения = Дата;
		ДокументПоручение.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
КонецПроцедуры

Функция СуществуетИсполнениеПоручения()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Выписка.ОперацияЦБ КАК Документ.ОперацииЦБ).ДокументОснование КАК Документ.Поручение).Исполнение КАК ИсполнениеПоручения
	|ИЗ
	|	Документ.Выписка КАК Выписка
	|ГДЕ
	|	Выписка.Ссылка = &Выписка
	|	И ВЫРАЗИТЬ(ВЫРАЗИТЬ(Выписка.ОперацияЦБ КАК Документ.ОперацииЦБ).ДокументОснование КАК Документ.Поручение).Исполнение <> ЗНАЧЕНИЕ(Документ.ИсполнениеПоручения.ПустаяСсылка)
	|";
	Запрос.УстановитьПараметр("Выписка", Ссылка);
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//процедуры печати
#Если Клиент Тогда
// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	СтруктураПечатныхФорм = Новый Структура;
	Возврат СтруктураПечатныхФорм;
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
КонецПроцедуры

#КонецЕсли

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Если РучнойВвод Тогда
		Возврат;
	КонецЕсли;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если ВыпискаУжеВыгруженаВСЭД() Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Удаление выгруженной в ЭДО выписки невозможно. Документ: "+Ссылка;
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

Функция ВыпискаУжеВыгруженаВСЭД()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РегистрацияДокументовВЭДО.Документ) КАК КоличествоВыгруженныхДокументов
	|ИЗ
	|	РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияДокументовВЭДО
	|ГДЕ
	|	ВЫРАЗИТЬ(РегистрацияДокументовВЭДО.Документ КАК Документ.Выписка) = &Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоВыгруженныхДокументов > 0;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ФормироватьОперацииПоПоручениямНаОтчет(ДатаПоручения)
	Возврат ЗначениеЗаполнено(Константы.ДатаНачалаФормированияОперацийПоПоручениямНаОтчет.Получить())
		И НачалоДня(ДатаПоручения) >= НачалоДня(Константы.ДатаНачалаФормированияОперацийПоПоручениямНаОтчет.Получить());
КонецФункции

Функция ЗаполнитьВыпискуНаОснованииПорученияНаОтчет(Основание)
	Дата							= Основание.ДатаИсполненияПоручения;
	ДокументОснование 				= Основание.Ссылка;
	ВладелецСчета 					= Основание.СчетДепо.Владелец;
	СчетДепо						= Основание.СчетДепо;
	ДатаНачПериода					= Основание.ДатаНачПериода;
	Если Основание.ВидОперацииД = Перечисления.ВидыОтчетов.ВыпискаОСостоянииСчетаДЕПО Тогда
		ДатаКонПериода = Основание.ДатаНачПериода;
	Иначе
		ДатаКонПериода = Основание.ДатаКонПериода;
	КонецЕсли;
	МХУведомление					= Основание.МХДепонента;
	МХВыписка						= Основание.МХКонтрагент;
	ЭмитентУведомление				= Основание.ЭмитентУведомление;
	ЭмитентВыписка					= Основание.ЭмитентВыписка;
	ВидОтчета						= Основание.ВидОперацииД;
	ПозицияВыпискиОперационныйДень	= Основание.ПозицияВыпискиОперационныйДень;
	СпособОтправкиОтчета			= Основание.СпособОтправкиОтчета;
	ЦБУведомление					= Основание.ЦБУведомление;
	ЦБВыписка						= Основание.ЦБВыписка;
КонецФункции

Процедура ОбновитьДопИнформацию()
	
	Если НеОбновлятьДопИнформацию Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Или Не ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Поручение") Тогда
		
		ДопИнформация = "";
		
		Возврат;
		
	КонецЕсли;
	
	ДопИнформация = Документы.Поручение.ОписаниеПараметровDVP3(ДокументОснование);
	
КонецПроцедуры