
Процедура СписокW8УстановитьОтборы(РеквизитФормыСписокW8, ЭлементФормыСписокW8, Лицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредоставленныеДокументы.ПредоставленнаяФорма
		|ИЗ
		|	РегистрСведений.ПредоставленныеДокументы КАК ПредоставленныеДокументы
		|ГДЕ
		|	ПредоставленныеДокументы.ПредоставленнаяФорма.Лицо = &Лицо";
	
	Запрос.УстановитьПараметр("Лицо", Лицо);
	МассивПредоставленныхФорм = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПредоставленнаяФорма");

	РеквизитФормыСписокW8.Отбор.ПредоставленнаяФорма.ВидСравнения = ВидСравнения.ВСписке;
	РеквизитФормыСписокW8.Отбор.ПредоставленнаяФорма.Значение.ЗагрузитьЗначения(МассивПредоставленныхФорм);
	РеквизитФормыСписокW8.Отбор.ПредоставленнаяФорма.Использование = Истина;
	ЭлементФормыСписокW8.НастройкаОтбора.ПредоставленнаяФорма.Доступность = Ложь;
	
КонецПроцедуры

Процедура УстановитьОтборыW8(Ссылка, НаборW8) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредоставленныеДокументы.ПредоставленнаяФорма
		|ИЗ
		|	РегистрСведений.ПредоставленныеДокументы КАК ПредоставленныеДокументы
		|ГДЕ
		|	ПредоставленныеДокументы.ПредоставленнаяФорма.Лицо = &Лицо";
	
	Запрос.УстановитьПараметр("Лицо", Ссылка);
	МассивПредоставленныхФорм = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПредоставленнаяФорма");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НаборW8
		, "ПредоставленнаяФорма"
		, МассивПредоставленныхФорм, ВидСравненияКомпоновкиДанных.ВСписке);


КонецПроцедуры

Процедура ДобавитьУсловноеДлящеесяПоручение(Дата, Депонент) Экспорт
	
	МЗ = РегистрыСведений.ПредоставленныеДокументы.СоздатьМенеджерЗаписи();
	МЗ.Период = Дата;
	МЗ.Лицо = Депонент.ЮридическиеФизическиеЛица;
	МЗ.Депонент = Депонент;
	МЗ.ВидДокумента = Справочники.ВидыДокументовУдостоверяющихПолномочия.УсловноеДлящеесяПоручение;
	МЗ.ДатаПредоставления = Дата;
	МЗ.Записать();
	
КонецПроцедуры

// Удаление записи регистра сведений ПредоставленныеДокументы
//
// Параметры:
//  Период		 - Дата		 - Период удаляемой записи
//  Лицо		 - СправочникСсылка.Юридическиелица/СправочникСсылка.ФизическиеЛица	- Значение измерения Лицо удаляемой записи
//  Депонент	 - СправочникСсылка.Контрагенты	- Значение измерения Контрагент удаляемой записи
//  ВидДокумента - СправочникСсылка.ВидыДокументовУдостоверяющихПолномочия - Значение измерения ВидДокумента удаляемой записи
Процедура УдалитьЗапись(Период, Лицо, Депонент, ВидДокумента) Экспорт
	Запись = РегистрыСведений.ПредоставленныеДокументы.СоздатьМенеджерЗаписи();
	Запись.Период = Период;
	Запись.Лицо = Лицо;
	Запись.Депонент = Депонент;
	Запись.ВидДокумента = ВидДокумента;
	Запись.Удалить();
КонецПроцедуры