///////////////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//----------------------------------------------------------------------------------------
// Функции формирования уведомлений

// Формирует содержание уведомления предоставить форму W-8IMY.
//
// Параметры:
//	БизнесПроцессСсылка - ссылка на бизнес-процесс ОбработкаWTRCСообщения
//
// Возвращаемое значение:
//	структура с полями Тема и Тело
//
Функция УведомлениеПредоставитьФормуW8IMY(БизнесПроцессСсылка, Повторное) Экспорт
	
	Возврат УведомлениеПредоставитьФормуW8(БизнесПроцессСсылка,
		Справочники.ВидыДокументовУдостоверяющихПолномочия.ФормаW8IMY, Повторное);
	
КонецФункции

// Формирует содержание уведомления предоставить форму W-8BEN/W-8BEN-E для прямых клиентов и субклиентов.
//
// Параметры:
//	БизнесПроцессСсылка - ссылка на бизнес-процесс ОбработкаWTRCСообщения
//
// Возвращаемое значение:
//	структура с полями Тема и Тело
//
Функция УведомлениеПредоставитьФормуW8BEN_W8BENE(БизнесПроцессСсылка, Повторное) Экспорт
	
	Возврат УведомлениеПредоставитьФормуW8(БизнесПроцессСсылка,
		Справочники.ВидыДокументовУдостоверяющихПолномочия.ФормаW8BENE_W8BEN, Повторное);
	
КонецФункции

// Формирует содержание уведомления о КД: ссылка на 2.13 (не активная) для американских ЦБ.
//
// Параметры:
//	БизнесПроцессСсылка - ссылка на бизнес-процесс ОбработкаWTRCСообщения
//
// Возвращаемое значение:
//	структура с полями Тема и Тело
//
Функция УведомлениеОКД_Раскрытие_ЦБСШАНеактивнаяСсылка(БизнесПроцессСсылка) Экспорт
	
	ОпциональныйБлок =
		БлокУведомленияРаскрытиеИнформацииПоСубклиентамБезСсылкиДляАмериканскихЦБ() + Символы.ПС
		+ БлокУведомленияУсловиеДоступностиСсылокДляАмериканскихЦБ();
	НомерУведомления = 3;
	ТребуетсяРаскрытиеСпискаВладельцев = Истина;
	Возврат СодержаниеУведомления(БизнесПроцессСсылка, ОпциональныйБлок, НомерУведомления, Перечисления.ФормыСообщенийКК.SendEmailToClients, ТребуетсяРаскрытиеСпискаВладельцев);
	
КонецФункции

// Формирует содержание уведомления о КД: ссылка на 2.13 (не активная) для американских ЦБ
// с предупреждением об ответственности.
//
// Параметры:
//	БизнесПроцессСсылка - ссылка на бизнес-процесс ОбработкаWTRCСообщения
//
// Возвращаемое значение:
//	структура с полями Тема и Тело
//
Функция УведомлениеОКД_Раскрытие_ЦБСШААктивнаяСсылкаОтветственность(БизнесПроцессСсылка) Экспорт
	
	ОпциональныйБлок =
		БлокУведомленияРаскрытиеИнформацииПоСубклиентамБезСсылкиДляАмериканскихЦБ() + Символы.ПС
		+ БлокУведомленияОтветственность();
		ТребуетсяРаскрытиеСпискаВладельцев = Истина;
		НомерУведомления = 4;
	Возврат СодержаниеУведомления(БизнесПроцессСсылка, ОпциональныйБлок,НомерУведомления, Перечисления.ФормыСообщенийКК.CreateCorporateActionWtrc, ТребуетсяРаскрытиеСпискаВладельцев);
	
КонецФункции

// Формирует содержание уведомления о КД: ссылка на 2.13 (не активная) для американских ЦБ.
//
// Параметры:
//	БизнесПроцессСсылка - ссылка на бизнес-процесс ОбработкаWTRCСообщения
//
// Возвращаемое значение:
//	структура с полями Тема и Тело
//
Функция УведомлениеОКД_Раскрытие_ЦБСШААктивнаяСсылка(БизнесПроцессСсылка, Повторное) Экспорт
	
	ТребуетсяРаскрытиеСпискаВладельцев = Истина;
	НомерУведомления = 5;
	ОпциональныйБлок = БлокУведомленияРаскрытиеИнформацииПоСубклиентамБезСсылкиДляАмериканскихЦБ();
	Возврат СодержаниеУведомления(БизнесПроцессСсылка, ОпциональныйБлок, НомерУведомления, Перечисления.ФормыСообщенийКК.CreateCorporateActionWtrc, ТребуетсяРаскрытиеСпискаВладельцев, Повторное);
	
КонецФункции

// Формирует содержание уведомления о КД: ссылка на 1.10 (активная) для неамериканских ЦБ.
//
// Параметры:
//	БизнесПроцессСсылка - ссылка на бизнес-процесс ОбработкаWTRCСообщения
//
// Возвращаемое значение:
//	структура с полями Тема и Тело
//
Функция УведомлениеОКД_Участие_ЦБНеСШААктивнаяСсылка(БизнесПроцессСсылка) Экспорт
	
	ТребуетсяРаскрытиеСпискаВладельцев = Ложь;
	НомерУведомления = 6;
	ОпциональныйБлок = БлокУведомленияУчастиеВКорпоративномДействии();
	Возврат СодержаниеУведомления(БизнесПроцессСсылка, ОпциональныйБлок, НомерУведомления, Перечисления.ФормыСообщенийКК.CreateCorporateActionTrec, ТребуетсяРаскрытиеСпискаВладельцев);
	
КонецФункции

// Формирует содержание уведомления о КД: ссылка на 1.10 и 2.13 (активная) для неамериканских ЦБ.
//
// Параметры:
//	БизнесПроцессСсылка - ссылка на бизнес-процесс ОбработкаWTRCСообщения
//
// Возвращаемое значение:
//	структура с полями Тема и Тело
//
Функция УведомлениеОКД_УчастиеРаскрытие_ЦБНеСШААктивнаяСсылка(БизнесПроцессСсылка) Экспорт
	
	ТребуетсяРаскрытиеСпискаВладельцев = Истина;
	НомерУведомления = 7;
	ОпциональныйБлок =
		БлокУведомленияУчастиеВКорпоративномДействии() + Символы.ПС
		+ БлокУведомленияРаскрытиеИнформацииПоСубклиентамБезСсылки();
	Возврат СодержаниеУведомления(БизнесПроцессСсылка, ОпциональныйБлок, НомерУведомления, Перечисления.ФормыСообщенийКК.CreateCorporateActionTrec, ТребуетсяРаскрытиеСпискаВладельцев);
	
КонецФункции

// Формирует содержание уведомления о КД: ссылка на 1.10 (активная) для неамериканских ЦБ
// с предупреждением об ответственности.
//
// Параметры:
//	БизнесПроцессСсылка - ссылка на бизнес-процесс ОбработкаWTRCСообщения
//
// Возвращаемое значение:
//	структура с полями Тема и Тело
//
Функция УведомлениеОКД_Участие_ЦБНеСШААктивнаяСсылкаОтветственность(БизнесПроцессСсылка, Повторное) Экспорт
	
	ТребуетсяРаскрытиеСпискаВладельцев = Истина;
	НомерУведомления = 8;
	ОпциональныйБлок =
		БлокУведомленияУчастиеВКорпоративномДействии() + Символы.ПС
		+ БлокУведомленияОтветственность();
	Возврат СодержаниеУведомления(БизнесПроцессСсылка, ОпциональныйБлок, НомерУведомления, Перечисления.ФормыСообщенийКК.CreateCorporateActionTrec, ТребуетсяРаскрытиеСпискаВладельцев, Повторное);
	
КонецФункции

// Формирует содержание уведомления о КД: ссылка на 2.13 (активная) для неамериканских ЦБ
// с предупреждением об ответственности.
//
// Параметры:
//	БизнесПроцессСсылка - ссылка на бизнес-процесс ОбработкаWTRCСообщения
//
// Возвращаемое значение:
//	структура с полями Тема и Тело
//
Функция УведомлениеОКД_УчастиеРаскрытие_ЦБНеСШААктивнаяСсылкаОтветственность(БизнесПроцессСсылка, Повторное) Экспорт
	
	ТребуетсяРаскрытиеСпискаВладельцев = Истина;
	НомерУведомления = 9;
	ОпциональныйБлок =
		БлокУведомленияУчастиеВКорпоративномДействии() + Символы.ПС
		+ БлокУведомленияРаскрытиеИнформацииПоСубклиентамБезСсылки() + Символы.ПС
		+ БлокУведомленияОтветственность();
	Возврат СодержаниеУведомления(БизнесПроцессСсылка, ОпциональныйБлок, НомерУведомления, Перечисления.ФормыСообщенийКК.CreateCorporateActionTrec, ТребуетсяРаскрытиеСпискаВладельцев, Повторное);
	
КонецФункции

// Формирует содержание уведомления о КД: ссылка на 1.10 (неактивная) для неамериканских ЦБ.
//
// Параметры:
//	БизнесПроцессСсылка - ссылка на бизнес-процесс ОбработкаWTRCСообщения
//
// Возвращаемое значение:
//	структура с полями Тема и Тело
//
Функция УведомлениеОКД_Участие_ЦБНеСШАНеактивнаяСсылка(БизнесПроцессСсылка) Экспорт
	
	ТребуетсяРаскрытиеСпискаВладельцев = Ложь;
	НомерУведомления = 10;
	ОпциональныйБлок = БлокУведомленияУчастиеВКорпоративномДействииБезСсылки();
	Возврат СодержаниеУведомления(БизнесПроцессСсылка, ОпциональныйБлок, НомерУведомления,Перечисления.ФормыСообщенийКК.SendEmailToClients, ТребуетсяРаскрытиеСпискаВладельцев);
	
КонецФункции

// Формирует содержание уведомления о КД: ссылка на 2.13 (неактивная) для неамериканских ЦБ.
//
// Параметры:
//	БизнесПроцессСсылка - ссылка на бизнес-процесс ОбработкаWTRCСообщения
//
// Возвращаемое значение:
//	структура с полями Тема и Тело
//
Функция УведомлениеОКД_УчастиеРаскрытие_ЦБНеСШАНеактивнаяСсылка(БизнесПроцессСсылка) Экспорт
	
	ТребуетсяРаскрытиеСпискаВладельцев = Истина;
	НомерУведомления = 11;
	ОпциональныйБлок = БлокУведомленияУчастиеВКорпоративномДействииБезСсылки() + Символы.ПС 
	+ БлокУведомленияРаскрытиеИнформацииПоСубклиентамБезСсылки();
	Возврат СодержаниеУведомления(БизнесПроцессСсылка, ОпциональныйБлок, НомерУведомления, Перечисления.ФормыСообщенийКК.SendEmailToClients, ТребуетсяРаскрытиеСпискаВладельцев);
	
КонецФункции

// Формирует содержание уведомления об изменении количества по американским и неамериканским ЦБ.
//
// Параметры:
//	БизнесПроцессСсылка - ссылка на бизнес-процесс ОбработкаWTRCСообщения
//
// Возвращаемое значение:
//	структура с полями Тема и Тело
//
Функция УведомлениеОбИзмененииКоличестваЦБ(БизнесПроцессСсылка) Экспорт
	
	ТребуетсяРаскрытиеСпискаВладельцев = Ложь;
	НомерУведомления = 12;
	ОпциональныйБлок = БлокУведомленияОбИзмененииКоличестваЦБ();
	Возврат СодержаниеУведомления(БизнесПроцессСсылка, ОпциональныйБлок, НомерУведомления, Перечисления.ФормыСообщенийКК.SendEmailToClients, ТребуетсяРаскрытиеСпискаВладельцев);
	
КонецФункции

Функция Уведомление1_10(НомерУведомления)
	
	НомераУведомлений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("6,7,8,10");
	Если НомераУведомлений.Найти(Строка(НомерУведомления)) = Неопределено Тогда 
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция Уведомление2_13(НомерУведомления)
	
	НомераУведомлений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("3,4,5,9,11");
	Если НомераУведомлений.Найти(Строка(НомерУведомления)) = Неопределено Тогда 
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция УведомлениеW8(НомерУведомления)
	
	НомераУведомлений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("1,2");
	Если НомераУведомлений.Найти(Строка(НомерУведомления)) = Неопределено Тогда 
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ТребуетсяОтправкаЗапросовСубброкеру(НомерУведомления)
	
	НомераУведомлений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("4,5,6,7,8,9");
	Если НомераУведомлений.Найти(Строка(НомерУведомления)) = Неопределено Тогда 
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

//----------------------------------------------------------------------------------------
// Функции формирования файла запроса на раскрытие

Функция ДоступныеЗначенияТипыСчета() Экспорт 
	
	ДоступныеЗначения = Новый Соответствие();
	ДоступныеЗначения.Вставить("01", "01 - Счет владельца");		
	ДоступныеЗначения.Вставить("02", "02 - Счет номинального держателя");		
	ДоступныеЗначения.Вставить("03", "03 - Счет ДУ (доверительного управляющего)");		
	ДоступныеЗначения.Вставить("04", "04 - Счет залогодержателя");		
	ДоступныеЗначения.Вставить("05", "05 - Эмиссионный счет эмитента (для размещения ценных бумаг)");		
	ДоступныеЗначения.Вставить("06", "06 - Лицевой счет эмитента (для выкупа-погашения ценных бумаг)");		
	ДоступныеЗначения.Вставить("07", "07 - Счет ""Ценные бумаги неустановленных лиц""");		
	Возврат ДоступныеЗначения;
	
КонецФункции

Функция ДоступныеЗначенияСтраны() Экспорт 
	
	ДоступныеЗначения = Новый Соответствие();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КлассификаторСтранМира.КодАльфа2 КАК КодАльфа2,
	|	КлассификаторСтранМира.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|ГДЕ
	|	НЕ КлассификаторСтранМира.ПометкаУдаления");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Не ПустаяСтрока(Выборка.КодАльфа2) Тогда 
			ДоступныеЗначения.Вставить(СокрЛП(Выборка.КодАльфа2), Выборка.Ссылка);	
		КонецЕсли;
	КонецЦикла;
	Возврат ДоступныеЗначения;
	
КонецФункции

Функция ДоступныеЗначенияПризнакЮлФл() Экспорт 
	
	ДоступныеЗначения = Новый Соответствие();
	ДоступныеЗначения.Вставить("LEGL", Перечисления.ЮрФизЛицо.ЮрЛицо);		
	ДоступныеЗначения.Вставить("INDV", Перечисления.ЮрФизЛицо.ФизЛицо);			
	Возврат ДоступныеЗначения;
		
КонецФункции

Функция ДоступныеЗначенияРегистрационныеДокументы() Экспорт 
	
	ДоступныеЗначения = Новый Соответствие();
	КодыИМНС = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("21,10,12,00,11,22,01,23,02,13,03,14,04,26,05,27,06,28,07,29,09,91,30,31");
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДокументыУдостоверяющиеЛичность.Ссылка КАК Ссылка,
	|	ДокументыУдостоверяющиеЛичность.КодИМНС КАК КодИМНС
	|ИЗ
	|	Справочник.ДокументыУдостоверяющиеЛичность КАК ДокументыУдостоверяющиеЛичность
	|ГДЕ
	|	НЕ ДокументыУдостоверяющиеЛичность.ПометкаУдаления
	|	И ДокументыУдостоверяющиеЛичность.КодИМНС В(&КодыИМНС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыЮридическихЛиц.Ссылка,
	|	ДокументыЮридическихЛиц.Код
	|ИЗ
	|	Справочник.ДокументыЮридическихЛиц КАК ДокументыЮридическихЛиц");
	Запрос.УстановитьПараметр("КодыИМНС",КодыИМНС);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДоступныеЗначения.Вставить(СокрЛП(Выборка.КодИМНС), Выборка.Ссылка);	
	КонецЦикла;
	Возврат ДоступныеЗначения;
	
КонецФункции

Функция ДоступныеЗначенияСтатусНалогоплательщика() Экспорт 
	
	ДоступныеЗначения = Новый Соответствие();
	ДоступныеЗначения.Вставить("1", "Налоговый резидент РФ");		
	ДоступныеЗначения.Вставить("2", "Налоговый нерезидент РФ");			
	Возврат ДоступныеЗначения;
	
КонецФункции

Функция ПараметрыКолонки(Обязательная = Истина, ДоступныеЗначения = Неопределено, ТипЗначения = Неопределено)
	Если ТипЗначения = Неопределено Тогда 
		ТипЗначения = Тип("Строка");	
	КонецЕсли;
	Возврат Новый Структура("Обязательная, ДоступныеЗначения, НомерКолонки, Ключевая, ТипЗначения",Обязательная, ДоступныеЗначения, Неопределено, Ложь, ТипЗначения);
КонецФункции

// Функция - Параметры колонок файла расшифровки запроса на раскрытие
// Возвращает структуру с описанием параметров колонок Excel файла раскрытия(обязательность заполнения, допустимые значения)
// Параметры:
//  ЦеннаяБумагаСсылка			 - СправочникСсылка.ЦеннаяБумага
//  ВидКорпоративногоДействия	 - 	Строка, СправочникСсылка.ВидыКорпоративныхДействий - Код вида корпоративного действия или элемент справочника ВидыКорпоративныхДействий
// 
// Возвращаемое значение:
// Структура  - параметры колонок
//
Функция ПараметрыКолонокФайлаРасшифровкиЗапросаНаРаскрытие(ЦеннаяБумагаСсылка, ВидКорпоративногоДействия) Экспорт 
	
	ОбязательноЗаполнение = Истина;
	ОбязательноЗаполнениеКодаКлиента = Ложь;
	ОбязательноЗаполнениеНомераСчетаДепоКлиента = Истина;
	ОбязательноЗаполнениеИндекса = Ложь;
	ОбязательноЗаполнениеСерииДокумента = Ложь;
	ОбязательноЗаполнениеДатыРожденияФЛ = Истина;
	ОбязательноЗаполнениеГражданствоФЛ = Ложь;
	ОбязательноЗаполнениеКодаЗагрузки = Истина;
	ОбязательноЗаполнениеНалогов = Справочники.ВидыКорпоративныхДействий.ЭтоКорпоративноедействиеДоходы(ВидКорпоративногоДействия);

	Если ТипЗнч(ВидКорпоративногоДействия) = Тип("СправочникСсылка.ВидыКорпоративныхДействий") Тогда 
		КодВидаКД = ВРег(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидКорпоративногоДействия, "Код"));
	Иначе 
		КодВидаКД = ВидКорпоративногоДействия;
	КонецЕсли;
		
	Если КодВидаКД = "WTRC" Тогда
		ОбязательноЗаполнениеКодаКлиента = Истина;
		ОбязательноЗаполнениеНомераСчетаДепоКлиента = Ложь;
		ОбязательноЗаполнениеКодаЗагрузки = Ложь;
	КонецЕсли;
	
	Колонки = Новый Структура();
	Колонки.Вставить("КодКлиента",ПараметрыКолонки(ОбязательноЗаполнениеКодаКлиента));
	Колонки.Вставить("НомерСчетаДепоКлиента",ПараметрыКолонки(ОбязательноЗаполнениеНомераСчетаДепоКлиента));
	Колонки.Вставить("РазделСчетаДепо",ПараметрыКолонки());
	Колонки.Вставить("ТипСчета",ПараметрыКолонки(ОбязательноЗаполнение, ДоступныеЗначенияТипыСчета()));
	Колонки.Вставить("ПолноеНаименованиеЛица",ПараметрыКолонки(ОбязательноЗаполнение));
	Колонки.Вставить("АдресМестонахожденияРегистрацииСтрана",ПараметрыКолонки(ОбязательноЗаполнение, ДоступныеЗначенияСтраны()));	
	Колонки.Вставить("АдресМестонахожденияРегистрацииИндекс",ПараметрыКолонки(ОбязательноЗаполнениеИндекса));	
	Колонки.Вставить("АдресМестонахожденияРегистрацииАдрес",ПараметрыКолонки());	
	Колонки.Вставить("ПризнакЮЛФЛ",ПараметрыКолонки(ОбязательноЗаполнение, ДоступныеЗначенияПризнакЮлФл()));
	Колонки.Вставить("ДокументВладельцаТип",ПараметрыКолонки(ОбязательноЗаполнение, ДоступныеЗначенияРегистрационныеДокументы()));
	Колонки.Вставить("ДокументВладельцаНомер",ПараметрыКолонки());
	Колонки.Вставить("ДокументВладельцаСерия",ПараметрыКолонки(ОбязательноЗаполнениеСерииДокумента));
	Колонки.Вставить("ДокументВладельцаДатаВыдачи",ПараметрыКолонки(Истина,,Тип("Дата")));
	Колонки.Вставить("ДокументВладельцаОрганВыдачи",ПараметрыКолонки());
	Колонки.Вставить("ДатаРожденияФЛ", ПараметрыКолонки(ОбязательноЗаполнениеДатыРожденияФЛ,,Тип("Дата")));
	Колонки.Вставить("ГражданствоФЛ", ПараметрыКолонки(ОбязательноЗаполнениеГражданствоФЛ, ДоступныеЗначенияСтраны()));
	Колонки.Вставить("ПолноеНаименованиеЮЛФЛСубклиента", ПараметрыКолонки(ОбязательноЗаполнение));
	Колонки.Вставить("АдресПочтовыйСтрана",ПараметрыКолонки(ОбязательноЗаполнение, ДоступныеЗначенияСтраны()));
	Колонки.Вставить("АдресПочтовыйИндекс",ПараметрыКолонки(ОбязательноЗаполнениеИндекса));
	Колонки.Вставить("АдресПочтовыйАдрес",ПараметрыКолонки());
	Колонки.Вставить("СтатусНалогоплательщика",ПараметрыКолонки(ОбязательноЗаполнениеНалогов, ДоступныеЗначенияСтатусНалогоплательщика()));
	Колонки.Вставить("НаличиеНалоговыхЛьгот",ПараметрыКолонки(ОбязательноЗаполнениеНалогов));
	Колонки.Вставить("НалоговаяСтавка",ПараметрыКолонки(ОбязательноЗаполнениеНалогов,, Тип("Число")));	
	Колонки.Вставить("LEIКодСубброкера",ПараметрыКолонки());
	Колонки.Вставить("ISIN", ПараметрыКолонки());
	Колонки.Вставить("КодЗагрузкиЦБ",ПараметрыКолонки(ОбязательноЗаполнениеКодаЗагрузки));
	Колонки.Вставить("Количество",ПараметрыКолонки(,,Тип("Число")));

	Если КодВидаКД = "WTRC" И Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(ЦеннаяБумагаСсылка) Тогда
		Колонки.КодКлиента.Ключевая = Истина;
		Для Каждого Колонка Из Колонки Цикл 
			Колонка.Значение.Обязательная = Ложь;
		КонецЦикла;
		Колонки.ПолноеНаименованиеЮЛФЛСубклиента.Обязательная = Истина;
		Колонки.КодКлиента.Обязательная = Истина;
		Колонки.Количество.Обязательная = Истина;
		Колонки.ISIN.Обязательная = Истина;
		Колонки.РазделСчетаДепо.Обязательная = Истина;
	Иначе 
		Колонки.НомерСчетаДепоКлиента.Ключевая = Истина
	КонецЕсли;

	Возврат Колонки;
	
КонецФункции

Процедура ДобавитьИсточникДляРаскрытияИзБизнесПроцесса(МВТ, БизнесПроцессСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Депоненты.Депонент КАК Субброкер,
	|	Депоненты.РазделСчета.Владелец КАК СчетДепо,
	|	Депоненты.РазделСчета КАК РазделСчетаДепо,
	|	Депоненты.Ссылка.КДРеференс КАК КДРеференс,
	|	Депоненты.Ссылка.КД.ВидКД.Наименование КАК ТипКД,
	|	Депоненты.Ссылка.КД.ВидКД.Код КАК КодТипаКД,
	|	ИСТИНА КАК ВидКДВыплатаДоходов,
	|	&ПустойДоходНДФЛ КАК КодДоходовНДФЛ,
	|	ЛОЖЬ КАК ЗаполнятьЗаявленнуюНалоговуюСтавку,
	|	Депоненты.Ссылка.ДатаФиксации КАК ДатаФиксации,
	|	Депоненты.Ссылка.ЦеннаяБумага1 КАК ЦеннаяБумага,
	|	Депоненты.Ссылка.ЦеннаяБумага1.НаименованиеВыпуска КАК НаименованиеВыпуска, 
	|	Депоненты.РазделСчета.Субклиент КАК Субклиент,
	|	""01"" КАК ТипСчета,
	|	Депоненты.Количество КАК Количество,
	|	Депоненты.Ссылка.Дата КАК ДатаДокументаРаскрытия,
	|	Депоненты.Ссылка.Дата КАК ДатаДокументаЗапроса,
	|	Депоненты.Ссылка.КД.Организация КАК Организация,
	|	Депоненты.Ссылка.КД.Организация.Наименование КАК НаименованиеЮЛОрганизации,
	|	Депоненты.Ссылка.КД.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	|	ВЫБОР
	|		КОГДА Депоненты.РазделСчета.Владелец.ТипСчетаДепо В (&ТипСчетаДЕПОНДИНД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВыводитьСтрокиТаблицы
	|ПОМЕСТИТЬ втИсточникДляРаскрытия
	|ИЗ
	|	БизнесПроцесс.ОбработкаWTRCСообщения.Депоненты КАК Депоненты
	|ГДЕ
	|	Депоненты.Ссылка = &БизнесПроцессСсылка
	|	И Депоненты.РазделСчета.Владелец.ТипСчетаДепо В(&ТипСчетаДЕПОНДИНД)";
	Запрос.УстановитьПараметр("БизнесПроцессСсылка",	БизнесПроцессСсылка);
	Запрос.УстановитьПараметр("ПустойДоходНДФЛ",	Справочники.ДоходыНДФЛ.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипСчетаДЕПОНДИНД",	БизнесПроцессы.ОбработкаWTRCСообщения.ТипыСчетовНДИНД());

	Запрос.Выполнить();
	
КонецПроцедуры

Функция ДанныеДляЗаполненияЗапросовНаРаскрытиеПоСубклиентам(МВТ, ДатаФиксации,
	ПредставлениеЗначений = Неопределено) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Источник.Субброкер КАК Субброкер,
	|	Источник.Субброкер.ВнешнийИсточникДляРСВПоСубклиентам КАК ВнешнийИсточник,
	|	ВЫРАЗИТЬ(Источник.Субброкер.ЮридическиеФизическиеЛица.ПолноеНаименование КАК СТРОКА(255)) КАК ПолноеНаименованиеЮЛСубброкера,
	|	Источник.Субброкер.LEI КАК LEIКодСубброкера,
	|	Источник.СчетДепо.Код КАК КодСчетаДепоСубброкера,
	|	Источник.СчетДепо КАК СчетДепо,
	|	Источник.КДРеференс КАК КДРеференс,
	|	Источник.ТипКД КАК ТипКД,
	|	Источник.КодТипаКД КАК КодТипаКД,
	|	Источник.ВидКДВыплатаДоходов КАК ВидКДВыплатаДоходов,
	|	Источник.ЗаполнятьЗаявленнуюНалоговуюСтавку КАК ЗаполнятьЗаявленнуюНалоговуюСтавку,
	|	Источник.ДатаФиксации КАК ДатаФиксации,
	|	Источник.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Источник.ЦеннаяБумага.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ПолноеНаименование КАК СТРОКА(255)) КАК ПолноеНаименованиеЭмитента,
	|	Источник.ЦеннаяБумага.ISIN КАК ISIN,
	|	Источник.ЦеннаяБумага.НомерРегистрации КАК ГосРегНомерВыпуска,
	|	Источник.Субброкер.Код КАК КодСубброкера,
	|	Источник.Субклиент.Код КАК КодСубклиента,
	|	Источник.Субклиент КАК Субклиент,
	|	Источник.ТипСчета КАК ТипСчета,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(Источник.Субклиент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ПолноеНаименование КАК СТРОКА(255))
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(Источник.Субклиент.ЮридическиеФизическиеЛица КАК Справочник.ФизическиеЛица).Наименование
	|	КОНЕЦ КАК ПолноеНаименованиеЮЛФЛСубклиента,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА &ЮрЛицо
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА &ФизЛицо
	|	КОНЕЦ КАК ПризнакЮЛФЛ,
	|	Источник.Субклиент.ЮридическиеФизическиеЛица.ДатаРождения КАК ДатаРожденияФЛ,
	|	ЕСТЬNULL(ГражданствоФизЛиц.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) КАК ГражданствоФЛ,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|					И НЕ Источник.Субклиент.ЮридическиеФизическиеЛица.НеРезидент
	|				ИЛИ Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|					И ГражданствоФизЛиц.Страна = &Россия
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НалоговыйРезидентРФ,
	|	ЕСТЬNULL(КодыЗагрузкиЦБ.Код, """") КАК КодНРД,
	|	Источник.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыРегистрацииЮрЛиц.Поле1, """")
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыРегистрацииФизЛиц.Поле1, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АдресМестонахожденияРегистрацииСтрана,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыРегистрацииЮрЛиц.Представление, """")
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыРегистрацииФизЛиц.Представление, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АдресМестонахожденияРегистрацииАдрес,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыПочтовыеЮрЛиц.Поле1, """")
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыПочтовыеФизЛиц.Поле1, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АдресПочтовыйСтрана,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыПочтовыеЮрЛиц.Представление, """")
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыПочтовыеФизЛиц.Представление, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АдресПочтовыйАдрес,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА &REGN
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ПаспортФизЛиц.ДокументВид.Ссылка
	|		ИНАЧЕ &ПустаяСтрока4
	|	КОНЕЦ КАК ДокументВладельцаТип,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА Источник.Субклиент.ЮридическиеФизическиеЛица.РегНомер
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ПаспортФизЛиц.ДокументНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДокументВладельцаНомер,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА """"
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ПаспортФизЛиц.ДокументСерия, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДокументВладельцаСерия,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА Источник.Субклиент.ЮридическиеФизическиеЛица.ДатаГосРегистрации
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ПаспортФизЛиц.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДокументВладельцаДатаВыдачи,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА Источник.Субклиент.ЮридическиеФизическиеЛица.РегистрирующийОрган
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ПаспортФизЛиц.ДокументКемВыдан, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДокументВладельцаОрганВыдачи,
	|	Источник.ДатаДокументаРаскрытия КАК ДатаДокументаРаскрытия,
	|	Источник.ДатаДокументаЗапроса КАК ДатаДокументаЗапроса,
	|	КодыЗагрузкиОрганизации.Код КАК КодЗагрузкиНДЦОрганизации,
	|	Источник.НаименованиеЮЛОрганизации КАК НаименованиеЮЛОрганизации,
	|	Источник.НаименованиеВыпуска КАК НаименованиеВыпуска,
	|	Источник.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	|	Источник.ВыводитьСтрокиТаблицы КАК ВыводитьСтрокиТаблицы,
	|	Источник.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ВЫРАЗИТЬ(Источник.СчетДепо КАК Справочник.СчетаДепо).ТипСчетаДепо КАК ТипСчетаДепо
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	втИсточникДляРаскрытия КАК Источник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ГражданствоФизЛиц
	|		ПО (ГражданствоФизЛиц.ФизЛицо = Источник.Субклиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиЦБ
	|		ПО (КодыЗагрузкиЦБ.Владелец = Источник.ЦеннаяБумага)
	|			И ((ВЫРАЗИТЬ(КодыЗагрузкиЦБ.Биржа КАК Справочник.КлассификаторыЗагрузки)) = &НДЦ)
	|			И (КодыЗагрузкиЦБ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузкиЦБ.ДатаОкончанияДействия > &ДатаСреза)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&ДатаСреза,
	|				Вид = &МестоГосРегистрации
	|					И Тип = &Адрес) КАК КонтактыРегистрацииЮрЛиц
	|		ПО ((ВЫРАЗИТЬ(КонтактыРегистрацииЮрЛиц.Объект КАК Справочник.ЮридическиеЛица)) = Источник.Субклиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&ДатаСреза,
	|				Вид = &МестоЖительства
	|					И Тип = &Адрес) КАК КонтактыРегистрацииФизЛиц
	|		ПО ((ВЫРАЗИТЬ(КонтактыРегистрацииФизЛиц.Объект КАК Справочник.ФизическиеЛица)) = Источник.Субклиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ПаспортФизЛиц
	|		ПО (ПаспортФизЛиц.ФизЛицо = Источник.Субклиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&ДатаСреза,
	|				Вид = &ФактическийАдресЮрЛица
	|					И Тип = &Адрес) КАК КонтактыПочтовыеЮрЛиц
	|		ПО ((ВЫРАЗИТЬ(КонтактыПочтовыеЮрЛиц.Объект КАК Справочник.ЮридическиеЛица)) = Источник.Субклиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&ДатаСреза,
	|				Вид = &МестоПребывания
	|					И Тип = &Адрес) КАК КонтактыПочтовыеФизЛиц
	|		ПО ((ВЫРАЗИТЬ(КонтактыПочтовыеФизЛиц.Объект КАК Справочник.ФизическиеЛица)) = Источник.Субклиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиОрганизации
	|		ПО (КодыЗагрузкиОрганизации.Владелец = Источник.Организация.ЮридическоеЛицо)
	|			И ((ВЫРАЗИТЬ(КодыЗагрузкиОрганизации.Биржа КАК Справочник.КлассификаторыЗагрузки)) = &НДЦ)
	|			И (КодыЗагрузкиОрганизации.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузкиОрганизации.ДатаОкончанияДействия > &ДатаСреза)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Субброкер КАК Субброкер,
	|	Данные.ВнешнийИсточник КАК ВнешнийИсточник,
	|	Данные.ПолноеНаименованиеЮЛСубброкера КАК ПолноеНаименованиеЮЛСубброкера,
	|	Данные.LEIКодСубброкера КАК LEIКодСубброкера,
	|	Данные.КодСчетаДепоСубброкера КАК КодСчетаДепоСубброкера,
	|	Данные.КДРеференс КАК КДРеференс,
	|	Данные.ТипКД КАК ТипКД,
	|	Данные.КодТипаКД КАК КодТипаКД,
	|	Данные.ВидКДВыплатаДоходов КАК ВидКДВыплатаДоходов,
	|	Данные.ДатаФиксации КАК ДатаФиксации,
	|	Данные.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Данные.ПолноеНаименованиеЭмитента КАК ПолноеНаименованиеЭмитента,
	|	Данные.ISIN КАК ISIN,
	|	Данные.ГосРегНомерВыпуска КАК ГосРегНомерВыпуска,
	|	Данные.КодСубброкера КАК КодСубброкера,
	|	Данные.КодСубклиента КАК КодСубклиента,
	|	Данные.ТипСчета КАК ТипСчета,
	|	Данные.ПолноеНаименованиеЮЛФЛСубклиента КАК ПолноеНаименованиеЮЛФЛСубклиента,
	|	Данные.ПризнакЮЛФЛ КАК ПризнакЮЛФЛ,
	|	Данные.ДатаРожденияФЛ КАК ДатаРожденияФЛ,
	|	Данные.ГражданствоФЛ КАК ГражданствоФЛ,
	|	ВЫБОР
	|		КОГДА Данные.НалоговыйРезидентРФ
	|			ТОГДА &ПредставлениеСтатусаНалоговогоРезидентаРФ
	|		ИНАЧЕ &ПредставлениеСтатусаНалоговогоНерезидентаРФ
	|	КОНЕЦ КАК СтатусНалогоплательщика,
	|	Данные.КодНРД КАК КодНРД,
	|	Данные.Количество КАК Количество,
	|	0 КАК ЗаявленнаяНалоговаяСтавкаЧисло,
	|	Данные.ЗаполнятьЗаявленнуюНалоговуюСтавку КАК ЗаполнятьЗаявленнуюНалоговуюСтавку,
	|	ВЫБОР
	|		КОГДА НЕ КлассификаторАдресМестонахожденияСтрана.Ссылка ЕСТЬ NULL
	|			ТОГДА КлассификаторАдресМестонахожденияСтрана.Ссылка
	|		ИНАЧЕ Данные.АдресМестонахожденияРегистрацииСтрана
	|	КОНЕЦ КАК АдресМестонахожденияРегистрацииСтрана,
	|	Данные.АдресМестонахожденияРегистрацииСтрана КАК АдресМестонахожденияРегистрацииИндекс,
	|	Данные.АдресМестонахожденияРегистрацииАдрес КАК АдресМестонахожденияРегистрацииАдрес,
	|	ВЫБОР
	|		КОГДА НЕ КлассификаторАдресПочтовыйСтрана.Ссылка ЕСТЬ NULL
	|			ТОГДА КлассификаторАдресПочтовыйСтрана.Ссылка
	|		ИНАЧЕ Данные.АдресПочтовыйСтрана
	|	КОНЕЦ КАК АдресПочтовыйСтрана,
	|	Данные.АдресПочтовыйСтрана КАК АдресПочтовыйИндекс,
	|	Данные.АдресПочтовыйАдрес КАК АдресПочтовыйАдрес,
	|	Данные.ДокументВладельцаТип КАК ДокументВладельцаТип,
	|	Данные.ДокументВладельцаНомер КАК ДокументВладельцаНомер,
	|	Данные.ДокументВладельцаСерия КАК ДокументВладельцаСерия,
	|	Данные.ДокументВладельцаДатаВыдачи КАК ДокументВладельцаДатаВыдачи,
	|	Данные.ДокументВладельцаОрганВыдачи КАК ДокументВладельцаОрганВыдачи,
	|	Данные.ДатаДокументаРаскрытия КАК ДатаДокументаРаскрытия,
	|	Данные.КодЗагрузкиНДЦОрганизации КАК КодЗагрузкиНДЦОрганизации,
	|	Данные.НаименованиеЮЛОрганизации КАК НаименованиеЮЛОрганизации,
	|	Данные.НаименованиеВыпуска КАК НаименованиеВыпуска,
	|	Данные.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	|	Данные.ВыводитьСтрокиТаблицы КАК ВыводитьСтрокиТаблицы,
	|	Данные.СчетДепо КАК СчетДепо,
	|	Данные.Субклиент КАК Субклиент,
	|	Данные.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ВЫБОР
	|		КОГДА Данные.ТипСчетаДепо В (&ТипыСчетовНД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НД,
	|	ВЫБОР
	|		КОГДА Данные.ТипСчетаДепо В (&ТипыСчетовИНД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИНД,
	|	Данные.ДатаДокументаЗапроса КАК ДатаДокументаЗапроса
	|ИЗ
	|	втДанные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторАдресПочтовыйСтрана
	|		ПО (НЕ Данные.АдресПочтовыйСтрана = &ПустаяСтрока)
	|			И Данные.АдресПочтовыйСтрана = КлассификаторАдресПочтовыйСтрана.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторАдресМестонахожденияСтрана
	|		ПО (НЕ Данные.АдресМестонахожденияРегистрацииСтрана = &ПустаяСтрока)
	|			И Данные.АдресМестонахожденияРегистрацииСтрана = КлассификаторАдресМестонахожденияСтрана.Наименование";
	
	ПустаяСтрока4 = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(Символ(32),4);
	Запрос.УстановитьПараметр("ДатаСреза",	ДатаФиксации);
	Запрос.УстановитьПараметр("Россия",		Справочники.КлассификаторСтранМира.РОССИЯ);
	Запрос.УстановитьПараметр("НДЦ",		Константы.КлассификаторЗагрузкиНДЦ.Получить());
	Запрос.УстановитьПараметр("Адрес",					Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("МестоГосРегистрации",	Справочники.ВидыКонтактнойИнформации.ЮрАдресЮрЛица);
	Запрос.УстановитьПараметр("МестоЖительства",		Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Запрос.УстановитьПараметр("ФактическийАдресЮрЛица",	Справочники.ВидыКонтактнойИнформации.ФактАдресЮрЛица);
	Запрос.УстановитьПараметр("МестоПребывания",		Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
	Запрос.УстановитьПараметр("ТипыСчетовНД",	БизнесПроцессы.ОбработкаWTRCСообщения.ТипыСчетовНД());
	Запрос.УстановитьПараметр("ТипыСчетовИНД",	БизнесПроцессы.ОбработкаWTRCСообщения.ТипыСчетовИНД());
	Запрос.УстановитьПараметр("ПустаяСтрока","");
	Запрос.УстановитьПараметр("ПустаяСтрока4",ПустаяСтрока4);
	Запрос.УстановитьПараметр("ПредставлениеСтатусаНалоговогоРезидентаРФ",		"1");
	Запрос.УстановитьПараметр("ПредставлениеСтатусаНалоговогоНерезидентаРФ",	"2");
	Запрос.УстановитьПараметр("ЮрЛицо",	Перечисления.ЮрФизЛицо.ЮрЛицо);
	Запрос.УстановитьПараметр("ФизЛицо",	Перечисления.ЮрФизЛицо.ФизЛицо);
	Запрос.УстановитьПараметр("REGN",Справочники.ДокументыЮридическихЛиц.REGN);

	
	// Замена значений параметров запроса
	Если ПредставлениеЗначений <> Неопределено Тогда
		Для Каждого КлючИЗначение Из Запрос.Параметры Цикл
			НайденноеЗначение = "";
			Если ПредставлениеЗначений.Свойство(КлючИЗначение.Ключ, НайденноеЗначение) Тогда
				Запрос.УстановитьПараметр(КлючИЗначение.Ключ, НайденноеЗначение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Данные = Запрос.Выполнить().Выгрузить();
	
	Данные.Колонки.Добавить("КодКлиента", Новый ОписаниеТипов("Строка"));
	Данные.Колонки.Добавить("ЗаявленнаяНалоговаяСтавка", Новый ОписаниеТипов("Строка"));
	Для Каждого Строка Из Данные Цикл
				
		Если Строка.КодТипаКД = "WTRC" И ТипЗнч(Строка.Субклиент) = Тип("СправочникСсылка.Субклиенты") Тогда 
			ДанныеПоследнейФормыW8 = Справочники.ФормыW8.ДанныеПоследнейФормыW8(Строка.Субклиент);
			Если ЗначениеЗаполнено(ДанныеПоследнейФормыW8.ФормаW8) Тогда	
				Строка.КодКлиента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПоследнейФормыW8.ФормаW8, "ДепозитарныйКодСублиентаПоДаннымСубброкера");
			КонецЕсли;
		КонецЕсли;
		
		Строка.ЗаявленнаяНалоговаяСтавка = "";
	
		Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Строка.АдресМестонахожденияРегистрацииСтрана) Тогда
			Строка.АдресМестонахожденияРегистрацииСтрана = Справочники.КлассификаторСтранМира.РОССИЯ;
		Иначе
			Строка.АдресМестонахожденияРегистрацииИндекс = "";
		КонецЕсли;
		Если Не ОбщегоНазначения.ТолькоЦифрыВСтроке(Строка.АдресМестонахожденияРегистрацииИндекс) Тогда
			Строка.АдресМестонахожденияРегистрацииИндекс = "";	
		КонецЕсли;
		Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Строка.АдресПочтовыйСтрана) Тогда
			Строка.АдресПочтовыйСтрана = Справочники.КлассификаторСтранМира.РОССИЯ;
		Иначе
			Строка.АдресПочтовыйИндекс = "";
		КонецЕсли;
		Если Не ОбщегоНазначения.ТолькоЦифрыВСтроке(Строка.АдресМестонахожденияРегистрацииИндекс) Тогда
			Строка.АдресПочтовыйИндекс = "";	
		КонецЕсли;

	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

Функция ДанныеДляЗаполненияЗапросовНаРаскрытиеПоСубклиентам_БезДокументовЗапросов(МВТ, ДатаФиксации,
	ПредставлениеЗначений = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Источник.Субброкер КАК Субброкер,
	|	Источник.Субброкер.ВнешнийИсточникДляРСВПоСубклиентам КАК ВнешнийИсточник,
	|	ВЫРАЗИТЬ(Источник.Субброкер.ЮридическиеФизическиеЛица.ПолноеНаименование КАК СТРОКА(255)) КАК ПолноеНаименованиеЮЛСубброкера,
	|	Источник.Субброкер.LEI КАК LEIКодСубброкера,
	|	Источник.СчетДепо.Код КАК КодСчетаДепоСубброкера,
	|	Источник.СчетДепо КАК СчетДепо,
	|	Источник.КДРеференс КАК КДРеференс,
	|	Источник.ТипКД КАК ТипКД,
	|	Источник.КодТипаКД КАК КодТипаКД,
	|	Источник.ВидКДВыплатаДоходов КАК ВидКДВыплатаДоходов,
	|	Источник.КодДоходовНДФЛ.РазмерСтавкиРезидента КАК РазмерСтавкиРезидента,
	|	Источник.КодДоходовНДФЛ.РазмерСтавкиНерезидента КАК РазмерСтавкиНерезидента,
	|	Источник.ЗаполнятьЗаявленнуюНалоговуюСтавку КАК ЗаполнятьЗаявленнуюНалоговуюСтавку,
	|	Источник.ДатаФиксации КАК ДатаФиксации,
	|	Источник.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Источник.ЦеннаяБумага.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ПолноеНаименование КАК СТРОКА(255)) КАК ПолноеНаименованиеЭмитента,
	|	Источник.ЦеннаяБумага.ISIN КАК ISIN,
	|	Источник.ЦеннаяБумага.НомерРегистрации КАК ГосРегНомерВыпуска,
	|	Источник.Субброкер.Код КАК КодСубброкера,
	|	Источник.Субклиент.Код КАК КодСубклиента,
	|	Источник.Субклиент КАК Субклиент,
	|	Источник.ТипСчета КАК ТипСчета,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(Источник.Субклиент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ПолноеНаименование КАК СТРОКА(255))
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(Источник.Субклиент.ЮридическиеФизическиеЛица КАК Справочник.ФизическиеЛица).Наименование
	|	КОНЕЦ КАК ПолноеНаименованиеЮЛФЛСубклиента,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ""LEGL""
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ""INDV""
	|	КОНЕЦ КАК ПризнакЮЛФЛ,
	|	Источник.Субклиент.ЮридическиеФизическиеЛица.ДатаРождения КАК ДатаРожденияФЛ,
	|	ЕСТЬNULL(ГражданствоФизЛиц.Страна.Наименование, """") КАК ГражданствоФЛ,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|					И НЕ Источник.Субклиент.ЮридическиеФизическиеЛица.НеРезидент
	|				ИЛИ Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|					И ГражданствоФизЛиц.Страна = &Россия
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НалоговыйРезидентРФ,
	|	ЕСТЬNULL(КодыЗагрузкиЦБ.Код, """") КАК КодНРД,
	|	Источник.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыРегистрацииЮрЛиц.Поле1, """")
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыРегистрацииФизЛиц.Поле1, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АдресМестонахожденияРегистрацииСтрана,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыРегистрацииЮрЛиц.Представление, """")
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыРегистрацииФизЛиц.Представление, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АдресМестонахожденияРегистрацииАдрес,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыПочтовыеЮрЛиц.Поле1, """")
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыПочтовыеФизЛиц.Поле1, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АдресПочтовыйСтрана,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыПочтовыеЮрЛиц.Представление, """")
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(КонтактыПочтовыеФизЛиц.Представление, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АдресПочтовыйАдрес,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ""Свидетельство о регистрации""
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ""Паспорт""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДокументВладельцаТип,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА Источник.Субклиент.ЮридическиеФизическиеЛица.РегНомер
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ПаспортФизЛиц.ДокументНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДокументВладельцаНомер,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА """"
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ПаспортФизЛиц.ДокументСерия, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДокументВладельцаСерия,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА Источник.Субклиент.ЮридическиеФизическиеЛица.ДатаГосРегистрации
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ПаспортФизЛиц.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДокументВладельцаДатаВыдачи,
	|	ВЫБОР
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА Источник.Субклиент.ЮридическиеФизическиеЛица.РегистрирующийОрган
	|		КОГДА Источник.Субклиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ПаспортФизЛиц.ДокументКемВыдан, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДокументВладельцаОрганВыдачи,
	|	Источник.ДатаДокументаРаскрытия КАК ДатаДокументаРаскрытия,
	|	КодыЗагрузкиОрганизации.Код КАК КодЗагрузкиНДЦОрганизации,
	|	Источник.НаименованиеЮЛОрганизации КАК НаименованиеЮЛОрганизации,
	|	Источник.НаименованиеВыпуска КАК НаименованиеВыпуска,
	|	Источник.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	|	Источник.ВыводитьСтрокиТаблицы КАК ВыводитьСтрокиТаблицы,
	|	Источник.РазделСчетаДепо КАК РазделСчетаДепо
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	втИсточникДляРаскрытия КАК Источник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ГражданствоФизЛиц
	|		ПО (ГражданствоФизЛиц.ФизЛицо = Источник.Субклиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиЦБ
	|		ПО (КодыЗагрузкиЦБ.Владелец = Источник.ЦеннаяБумага)
	|			И ((ВЫРАЗИТЬ(КодыЗагрузкиЦБ.Биржа КАК Справочник.КлассификаторыЗагрузки)) = &НДЦ)
	|			И (КодыЗагрузкиЦБ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузкиЦБ.ДатаОкончанияДействия > &ДатаСреза)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&ДатаСреза,
	|				Вид = &МестоГосРегистрации
	|					И Тип = &Адрес) КАК КонтактыРегистрацииЮрЛиц
	|		ПО ((ВЫРАЗИТЬ(КонтактыРегистрацииЮрЛиц.Объект КАК Справочник.ЮридическиеЛица)) = Источник.Субклиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&ДатаСреза,
	|				Вид = &МестоЖительства
	|					И Тип = &Адрес) КАК КонтактыРегистрацииФизЛиц
	|		ПО ((ВЫРАЗИТЬ(КонтактыРегистрацииФизЛиц.Объект КАК Справочник.ФизическиеЛица)) = Источник.Субклиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ПаспортФизЛиц
	|		ПО (ПаспортФизЛиц.ФизЛицо = Источник.Субклиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&ДатаСреза,
	|				Вид = &ФактическийАдресЮрЛица
	|					И Тип = &Адрес) КАК КонтактыПочтовыеЮрЛиц
	|		ПО ((ВЫРАЗИТЬ(КонтактыПочтовыеЮрЛиц.Объект КАК Справочник.ЮридическиеЛица)) = Источник.Субклиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&ДатаСреза,
	|				Вид = &МестоПребывания
	|					И Тип = &Адрес) КАК КонтактыПочтовыеФизЛиц
	|		ПО ((ВЫРАЗИТЬ(КонтактыПочтовыеФизЛиц.Объект КАК Справочник.ФизическиеЛица)) = Источник.Субклиент.ЮридическиеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиОрганизации
	|		ПО (КодыЗагрузкиОрганизации.Владелец = Источник.Организация.ЮридическоеЛицо)
	|			И ((ВЫРАЗИТЬ(КодыЗагрузкиОрганизации.Биржа КАК Справочник.КлассификаторыЗагрузки)) = &НДЦ)
	|			И (КодыЗагрузкиОрганизации.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузкиОрганизации.ДатаОкончанияДействия > &ДатаСреза)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Субброкер КАК Субброкер,
	|	Данные.ВнешнийИсточник КАК ВнешнийИсточник,
	|	Данные.ПолноеНаименованиеЮЛСубброкера КАК ПолноеНаименованиеЮЛСубброкера,
	|	Данные.LEIКодСубброкера КАК LEIКодСубброкера,
	|	Данные.КодСчетаДепоСубброкера КАК КодСчетаДепоСубброкера,
	|	Данные.СчетДепо КАК СчетДепо,
	|	Данные.КДРеференс КАК КДРеференс,
	|	Данные.ТипКД КАК ТипКД,
	|	Данные.КодТипаКД КАК КодТипаКД,
	|	Данные.ВидКДВыплатаДоходов КАК ВидКДВыплатаДоходов,
	|	Данные.ДатаФиксации КАК ДатаФиксации,
	|	Данные.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Данные.ПолноеНаименованиеЭмитента КАК ПолноеНаименованиеЭмитента,
	|	Данные.ISIN КАК ISIN,
	|	Данные.ГосРегНомерВыпуска КАК ГосРегНомерВыпуска,
	|	Данные.КодСубброкера КАК КодСубброкера,
	|	Данные.КодСубклиента КАК КодСубклиента,
	|	Данные.Субклиент КАК Субклиент,
	|	Данные.ТипСчета КАК ТипСчета,
	|	Данные.ПолноеНаименованиеЮЛФЛСубклиента КАК ПолноеНаименованиеЮЛФЛСубклиента,
	|	Данные.ПризнакЮЛФЛ КАК ПризнакЮЛФЛ,
	|	Данные.ДатаРожденияФЛ КАК ДатаРожденияФЛ,
	|	Данные.ГражданствоФЛ КАК ГражданствоФЛ,
	|	ВЫБОР
	|		КОГДА Данные.НалоговыйРезидентРФ
	|			ТОГДА &ПредставлениеСтатусаНалоговогоРезидентаРФ
	|		ИНАЧЕ &ПредставлениеСтатусаНалоговогоНерезидентаРФ
	|	КОНЕЦ КАК СтатусНалогоплательщика,
	|	Данные.КодНРД КАК КодНРД,
	|	Данные.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА Данные.НалоговыйРезидентРФ
	|			ТОГДА ЕСТЬNULL(Данные.РазмерСтавкиРезидента, 0)
	|		ИНАЧЕ ЕСТЬNULL(Данные.РазмерСтавкиНерезидента, 0)
	|	КОНЕЦ КАК ЗаявленнаяНалоговаяСтавкаЧисло,
	|	Данные.ЗаполнятьЗаявленнуюНалоговуюСтавку КАК ЗаполнятьЗаявленнуюНалоговуюСтавку,
	|	Данные.АдресМестонахожденияРегистрацииСтрана КАК АдресМестонахожденияРегистрацииСтрана,
	|	Данные.АдресМестонахожденияРегистрацииСтрана КАК АдресМестонахожденияРегистрацииИндекс,
	|	Данные.АдресМестонахожденияРегистрацииАдрес КАК АдресМестонахожденияРегистрацииАдрес,
	|	Данные.АдресПочтовыйСтрана КАК АдресПочтовыйСтрана,
	|	Данные.АдресПочтовыйСтрана КАК АдресПочтовыйИндекс,
	|	Данные.АдресПочтовыйАдрес КАК АдресПочтовыйАдрес,
	|	Данные.ДокументВладельцаТип КАК ДокументВладельцаТип,
	|	Данные.ДокументВладельцаНомер КАК ДокументВладельцаНомер,
	|	Данные.ДокументВладельцаСерия КАК ДокументВладельцаСерия,
	|	Данные.ДокументВладельцаДатаВыдачи КАК ДокументВладельцаДатаВыдачи,
	|	Данные.ДокументВладельцаОрганВыдачи КАК ДокументВладельцаОрганВыдачи,
	|	Данные.ДатаДокументаРаскрытия КАК ДатаДокументаРаскрытия,
	|	Данные.КодЗагрузкиНДЦОрганизации КАК КодЗагрузкиНДЦОрганизации,
	|	Данные.НаименованиеЮЛОрганизации КАК НаименованиеЮЛОрганизации,
	|	Данные.НаименованиеВыпуска КАК НаименованиеВыпуска,
	|	Данные.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	|	Данные.ВыводитьСтрокиТаблицы КАК ВыводитьСтрокиТаблицы,
	|	Данные.РазделСчетаДепо КАК РазделСчетаДепо
	|ИЗ
	|	втДанные КАК Данные";
	Запрос.УстановитьПараметр("ДатаСреза",	ДатаФиксации);
	Запрос.УстановитьПараметр("Россия",		Справочники.КлассификаторСтранМира.РОССИЯ);
	Запрос.УстановитьПараметр("НДЦ",		Константы.КлассификаторЗагрузкиНДЦ.Получить());
	Запрос.УстановитьПараметр("Адрес",					Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("МестоГосРегистрации",	Справочники.ВидыКонтактнойИнформации.ЮрАдресЮрЛица);
	Запрос.УстановитьПараметр("МестоЖительства",		Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Запрос.УстановитьПараметр("ФактическийАдресЮрЛица",	Справочники.ВидыКонтактнойИнформации.ФактАдресЮрЛица);
	Запрос.УстановитьПараметр("МестоПребывания",		Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
	
	Запрос.УстановитьПараметр("ПредставлениеСтатусаНалоговогоРезидентаРФ",		"Налоговый резидент РФ");
	Запрос.УстановитьПараметр("ПредставлениеСтатусаНалоговогоНерезидентаРФ",	"Налоговый нерезидент РФ");
	
	// Замена значений параметров запроса
	Если ПредставлениеЗначений <> Неопределено Тогда
		Для Каждого КлючИЗначение Из Запрос.Параметры Цикл
			НайденноеЗначение = "";
			Если ПредставлениеЗначений.Свойство(КлючИЗначение.Ключ, НайденноеЗначение) Тогда
				Запрос.УстановитьПараметр(КлючИЗначение.Ключ, НайденноеЗначение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Данные = Запрос.Выполнить().Выгрузить();
	
	Данные.Колонки.Добавить("КодКлиента");
	Данные.Колонки.Добавить("ЗаявленнаяНалоговаяСтавка");
	Для Каждого Строка Из Данные Цикл
		Строка.КодКлиента = СокрЛП(Строка.КодСубброкера) + "_" + СокрЛП(Строка.КодСубклиента);
		Если Строка.ЗаполнятьЗаявленнуюНалоговуюСтавку Тогда
			Строка.ЗаявленнаяНалоговаяСтавка = Строка(Строка.ЗаявленнаяНалоговаяСтавкаЧисло) + "%";
		Иначе
			Строка.ЗаявленнаяНалоговаяСтавка = "";
		КонецЕсли;		
		Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Строка.АдресМестонахожденияРегистрацииСтрана) Тогда
			Строка.АдресМестонахожденияРегистрацииСтрана = "РОССИЯ";
		Иначе
			Строка.АдресМестонахожденияРегистрацииИндекс = "";
		КонецЕсли;
		Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Строка.АдресПочтовыйСтрана) Тогда
			Строка.АдресПочтовыйСтрана = "РОССИЯ";
		Иначе
			Строка.АдресПочтовыйИндекс = "";
		КонецЕсли;
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

Функция ФайлРасшифровкиЗапросаНаРаскрытиеПоСубклиентамЦБНеСША(ДанныеПоСубброкеру, ИспользоватьРегистрациюЗапросовСубброкера = Ложь) Экспорт
	
	ИмяМакета = "ЗапросНаРаскрытиеПоСубклиентам";
	Если Не ИспользоватьРегистрациюЗапросовСубброкера Тогда 
		ИмяМакета = "ЗапросНаРаскрытиеПоСубклиентам_БезДокументовЗапросов";	
	КонецЕсли;
	
	ЦБПодпадаетПодНалоговоеРегулировениеСША = Ложь;
	Возврат ФайлРасшифровкиЗапросаНаРаскрытиеПоСубклиентам(ДанныеПоСубброкеру, ИмяМакета,
				ЦБПодпадаетПодНалоговоеРегулировениеСША);
	
КонецФункции

Функция ФайлРасшифровкиЗапросаНаРаскрытиеПоСубклиентамЦБСША(ДанныеПоСубброкеру, ИспользоватьРегистрациюЗапросовСубброкера = Ложь) Экспорт
	
	ИмяМакета = "ЗапросНаРаскрытиеПоСубклиентамЦБСША";
	Если Не ИспользоватьРегистрациюЗапросовСубброкера Тогда 
		ИмяМакета = "ЗапросНаРаскрытиеПоСубклиентамЦБСША_БезДокументовЗапросов";	
	КонецЕсли;
	ЦБПодпадаетПодНалоговоеРегулировениеСША = Истина;	
	Возврат ФайлРасшифровкиЗапросаНаРаскрытиеПоСубклиентам(ДанныеПоСубброкеру, ИмяМакета,
				ЦБПодпадаетПодНалоговоеРегулировениеСША);
	
КонецФункции

// Возвращает имя временного XLSX-файла расшифровки запроса субброкера на раскрытие
//
// Параметры:
//  ДанныеПоСубброкеру	 - ТаблицаЗначений, Массив строк ТаблицыЗначений - данные о субклиентах для вывода в файл
//  ИспользоватьРегистрациюЗапросовСубброкераИЗагрузкуОтветовСубброкера	 - Булево	 - указывает, следует ли при
//		формировании файла использовать макет, предполагающий загрузку в документ ОтветСубброкераНаРаскрытие
// 
// Возвращаемое значение:
//  Строка  - Имя сформированного файла
//
Функция ФайлРасшифровкиЗапросаСубброкераНаРаскрытие(ДанныеПоСубброкеру, ИспользоватьРегистрациюЗапросовСубброкераИЗагрузкуОтветовСубброкера = Ложь) Экспорт
	
	ИмяМакета = "ЗапросСубброкераНаРаскрытие";
	Если Не ИспользоватьРегистрациюЗапросовСубброкераИЗагрузкуОтветовСубброкера Тогда 
		ИмяМакета = "ЗапросНаРаскрытиеПоСубклиентам_БезДокументовЗапросов";	
	КонецЕсли;
	ЦБПодпадаетПодНалоговоеРегулировениеСША = Ложь;
	ВыводитьНалоги = Истина;
	Возврат ФайлРасшифровкиЗапросаНаРаскрытиеПоСубклиентам(ДанныеПоСубброкеру, ИмяМакета,
				ЦБПодпадаетПодНалоговоеРегулировениеСША, ВыводитьНалоги);
	
КонецФункции

// формирует xml-файл расшифровки запроса на раскрытие и возвращает его имя
//
// Параметры:
//  ДанныеЗаполнения	 - выборка из запроса - данные заполнения уведомлений и запросов к отправке
// 
// Возвращаемое значение:
//  Строка  - Имя сформированного файла
Функция ФайлРасшифровкиЗапросаСубброкераНаРаскрытиеXML(ДанныеЗаполнения) Экспорт

	ДанныеДляЗаполненияXML = ДанныеДляЗаполненияЗапросаСубброкераНаРаскрытиеXML(ДанныеЗаполнения);
	Если ДанныеДляЗаполненияXML = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ПространствоИмен = "FCDR_2017_02(2019v3)";
	
	ТипРаскрытие = ФабрикаXDTO.Пакеты.Получить(ПространствоИмен).КорневыеСвойства.Получить("DISCLOSURE_REQUEST").Тип;
	РаскрытиеXDTO = ФабрикаXDTO.Создать(ТипРаскрытие);
	РаскрытиеXDTO.version	= "FCDR_17_02";
	РаскрытиеXDTO.header = Header_РСВ_FCDR(ДанныеДляЗаполненияXML, ПространствоИмен);
	
	РаскрытиеXDTO.message_function = "NEWM";
	РаскрытиеXDTO.corporate_action_reference = Сorporate_action_reference_РСВ_FCDR(ДанныеДляЗаполненияXML, ПространствоИмен);
	РаскрытиеXDTO.issuer.Добавить(Issuer_РСВ_FCDR(ДанныеДляЗаполненияXML, ПространствоИмен));
	Если ЗначениеЗаполнено(ДанныеДляЗаполненияXML.ПайНаименованиеВыпуска) Тогда
		РаскрытиеXDTO.issuer.Добавить(IssuerПай_РСВ_FCDR(ДанныеДляЗаполненияXML, ПространствоИмен));
	КонецЕсли;
	РаскрытиеXDTO.initiator_request = НовыйОбъектСхемыFCDR("initiator_request_type_t", ПространствоИмен);
	РаскрытиеXDTO.initiator_request.initiator_request_type_code = ДанныеДляЗаполненияXML.РСВИнициаторЗапроса;
	
	СтрокаBasis_of_request = РаскрытиеXDTO.basis_of_request.Добавить(НовыйОбъектСхемыFCDR("laws_in_place_t", ПространствоИмен));
	СтрокаBasis_of_request.laws_in_place_code = ДанныеДляЗаполненияXML.РСВКодОснованияЗапроса;
	
	Если ДанныеДляЗаполненияXML.РСВКодОснованияЗапроса = "OTHR" 
		Или ЗначениеЗаполнено(ДанныеДляЗаполненияXML.РСВДополнительноеОписаниеОснованияЗапроса) Тогда
		СтрокаBasis_of_request.narrative = ДанныеДляЗаполненияXML.РСВДополнительноеОписаниеОснованияЗапроса;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеДляЗаполненияXML.РСВПодзаконныйАкт) Тогда
		СтрокаBasis_of_request.subordinate_legislation.Добавить(ДанныеДляЗаполненияXML.РСВПодзаконныйАкт);
	КонецЕсли;
	
	РаскрытиеXDTO.information_indicator = НовыйОбъектСхемыFCDR("information_type_V02_t", ПространствоИмен);
	РаскрытиеXDTO.information_indicator.information_type_code = ДанныеДляЗаполненияXML.РСВТипСписка;
	РаскрытиеXDTO.information_indicator.request_bank_details = ?(ДанныеДляЗаполненияXML.РСВБанковскиеРеквизиты, "Yes", "No");
	РаскрытиеXDTO.information_indicator.disclosure_template = ДанныеДляЗаполненияXML.РСВШаблонFCDR_2017_02;
	
	РаскрытиеXDTO.record_date = ДанныеДляЗаполненияXML.ДатаСпискаЛиц;
	РаскрытиеXDTO.response_deadline = ДанныеДляЗаполненияXML.ДатаОкончанияПриемаИнструкцийВТБКБ;
	ТипRegistered_shareholders = РаскрытиеXDTO.Свойства().Получить("Registered_shareholders").Тип;
	СтрокаRegistered_shareholders = РаскрытиеXDTO.registered_shareholders.Добавить(ФабрикаXDTO.Создать(ТипRegistered_shareholders));
	СтрокаRegistered_shareholders.account_dtls = НовыйОбъектСхемыFCDR("account_dtls_v04_t", ПространствоИмен);
	СтрокаRegistered_shareholders.account_dtls.account_id = НовыйОбъектСхемыFCDR("id_V02_t", ПространствоИмен);
	СтрокаRegistered_shareholders.account_dtls.account_id.id = СокрЛП(ДанныеДляЗаполненияXML.СчетДЕПОПредставление);
	СтрокаRegistered_shareholders.account_dtls.account_type = НовыйОбъектСхемыFCDR("account_type_V02_t", ПространствоИмен);
	Если ДанныеДляЗаполненияXML.Резидент Тогда
		КодТипаДержателя = "02";
	Иначе
		КодТипаДержателя = "20";
	КонецЕсли;
	
	СтрокаRegistered_shareholders.account_dtls.account_type.account_type_code = КодТипаДержателя;
	СтрокаRegistered_shareholders.account_holder = НовыйОбъектСхемыFCDR("party_id_name_V03_t", ПространствоИмен);
	Строкаaccount_holder_id = СтрокаRegistered_shareholders.account_holder.id.Добавить(НовыйОбъектСхемыFCDR("id_V02_t", ПространствоИмен));
	Строкаaccount_holder_id.id = СокрЛП(ДанныеДляЗаполненияXML.КлиентКод);
	СтрокаRegistered_shareholders.account_holder.name = СокрЛП(ДанныеДляЗаполненияXML.КлиентНаименование);
	
	security_balance_t_v03 = НовыйОбъектСхемыFCDR("security_balance_t_v03", ПространствоИмен);
	Строкаsecurity_balance = СтрокаRegistered_shareholders.security_balance.Добавить(security_balance_t_v03);
	Строкаsecurity_balance.security = НовыйОбъектСхемыFCDR("security_info_V3_t", ПространствоИмен);
	Строкаsecurity_balance.security.security_classification = ДанныеДляЗаполненияXML.ТипЦБ;
	Если ЗначениеЗаполнено(ДанныеДляЗаполненияXML.ВидЦБАкция) Тогда
		Строкаsecurity_balance.security.security_category = ДанныеДляЗаполненияXML.ВидЦБАкция;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеДляЗаполненияXML.ВалютаНоминалаНаименованиеДляОтчетов) Тогда
		Строкаsecurity_balance.security.nominal_value = НовыйОбъектСхемыFCDR("currency_and_amount_t", ПространствоИмен);
		Строкаsecurity_balance.security.nominal_value.ccy_code = ДанныеДляЗаполненияXML.ВалютаНоминалаНаименованиеДляОтчетов;
		ДанныеНоминалаЦБ = РегистрыСведений.НоминалЦБ.СрезПоследних(, Новый Структура("ЦеннаяБумага", ДанныеДляЗаполненияXML.ЦБ));
		Если ДанныеНоминалаЦБ.Количество() > 0 Тогда
			ЦБНоминал = ДанныеНоминалаЦБ[0].Сумма;
		Иначе
			ЦБНоминал = 0;
		КонецЕсли;
		Строкаsecurity_balance.security.nominal_value.amount = ЦБНоминал;
		
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеДляЗаполненияXML.НомерРегистрации) Тогда
		Строкаsecurity_balance.security.state_reg_num = ДанныеДляЗаполненияXML.НомерРегистрации;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеДляЗаполненияXML.ISIN) Тогда
		Строкаsecurity_balance.security.ISIN_identifier = ДанныеДляЗаполненияXML.ISIN;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеДляЗаполненияXML.ЦБКод) Тогда
		Строкаsecurity_balance.security.proprietary_security_code = НовыйОбъектСхемыFCDR("id_V02_t", ПространствоИмен);
		Строкаsecurity_balance.security.proprietary_security_code.id = ДанныеДляЗаполненияXML.КодНДЦ;
		Строкаsecurity_balance.security.proprietary_security_code.issuer = "NSDR";
	КонецЕсли;
	Строкаsecurity_balance.total = НовыйОбъектСхемыFCDR("quantity_choice_t", ПространствоИмен);
	КоличествоЦБ = ДанныеДляЗаполненияXML.ЗапросСубброкеруНаРаскрытие.ДанныеСубброкера.Итог("Количество");
	ТипQty_units = Строкаsecurity_balance.total.свойства().получить("qty_units").Тип;
	Строкаsecurity_balance.total.qty_units = ФабрикаXDTO.Создать(ТипQty_units);
	Строкаsecurity_balance.total.qty_units.units = КоличествоЦБ;
	СтрокаContacts = РаскрытиеXDTO.contacts.Добавить(НовыйОбъектСхемыFCDR("party_contacts_t_v02", ПространствоИмен));
	СтрокаPhone_or_fax = СтрокаContacts.phone_or_fax.Добавить(НовыйОбъектСхемыFCDR("phone_V02_t", ПространствоИмен));
	ОтборТелефонаОрганизации = Новый Структура("Объект,Тип,Вид", ДанныеДляЗаполненияXML.Организация,
	Перечисления.ТипыКонтактнойИнформации.Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	ДанныеНомерТелефона = РегистрыСведений.КонтактнаяИнформация.СрезПоследних(, ОтборТелефонаОрганизации);
	Если ДанныеНомерТелефона.Количество() > 0 Тогда
		НомерТелефона = ДанныеНомерТелефона[0].Представление;
	Иначе
		НомерТелефона = "";
	КонецЕсли;
	СтрокаPhone_or_fax.phone_num = НомерТелефона;
	
	ТекстДокумента = ПереработанныйТекстДокумента(ДанныеДляЗаполненияXML, РаскрытиеXDTO);
	
	ИмяФайла = ПолучитьИмяВременногоФайла("xml");
	ТекстXML = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.Системная);
	ТекстXML.Записать(ТекстДокумента);
	ТекстXML.Закрыть();
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ДанныеДляЗаполненияЗапросаСубброкераНаРаскрытиеXML(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.КодLEI КАК КлиентLEI,
	|	ЗапросСубброкеруНаРаскрытие.Клиент.Наименование КАК КлиентНаименование,
	|	РаскрытиеСпискаВладельцев.Номер КАК РСВНомер,
	|	РаскрытиеСпискаВладельцев.Дата КАК РСВДата,
	|	РаскрытиеСпискаВладельцев.Организация.Наименование КАК ОрганизацияНаименование,
	|	РаскрытиеСпискаВладельцев.Организация.LEI КАК ОрганизацияLEI,
	|	ЗапросСубброкеруНаРаскрытие.РеференсКД КАК РеференсКД,
	|	РаскрытиеСпискаВладельцев.Эмитент.НаименованиеПолное КАК ЭмитентПредставление,
	|	РаскрытиеСпискаВладельцев.Эмитент.ЮридическиеФизическиеЛица.ОГРН КАК ЭмитентОГРН,
	|	РаскрытиеСпискаВладельцев.Эмитент.ЮридическиеФизическиеЛица.ИНН КАК ЭмитентИНН,
	|	РаскрытиеСпискаВладельцев.Эмитент.ЮридическиеФизическиеЛица.ПолноеНаименование КАК ПолноеНаименованиеЮрЛицо,
	|	ВЫБОР
	|		КОГДА РаскрытиеСпискаВладельцев.ЦеннаяБумага1.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Пай)
	|			ТОГДА РаскрытиеСпискаВладельцев.ЦеннаяБумага1.НаименованиеВыпуска
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПайНаименованиеВыпуска,
	|	ВЫБОР
	|		КОГДА РаскрытиеСпискаВладельцев.ЦеннаяБумага1.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Пай)
	|			ТОГДА РаскрытиеСпискаВладельцев.ЦеннаяБумага1.НомерРегистрации
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПайНомерРегистрации,
	|	ЗапросСубброкеруНаРаскрытие.ДатаСпискаЛиц КАК ДатаСпискаЛиц,
	|	РаскрытиеСпискаВладельцев.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	|	ПРЕДСТАВЛЕНИЕ(ЗапросСубброкеруНаРаскрытие.СчетДЕПО) КАК СчетДЕПОПредставление,
	|	ВЫБОР
	|		КОГДА РаскрытиеСпискаВладельцев.Эмитент.ЮридическиеФизическиеЛица.Страна = ЗНАЧЕНИЕ(Справочник.Классификаторстранмира.Россия)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Резидент,
	|	ВЫБОР
	|		КОГДА РаскрытиеСпискаВладельцев.ЦеннаяБумага1.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
	|			ТОГДА ""BOND""
	|		КОГДА РаскрытиеСпискаВладельцев.ЦеннаяБумага1.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Акция)
	|			ТОГДА ""SHAR""
	|		КОГДА РаскрытиеСпискаВладельцев.ЦеннаяБумага1.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Пай)
	|			ТОГДА ""MFUN""
	|		КОГДА РаскрытиеСпискаВладельцев.ЦеннаяБумага1.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.ДепозитарнаяРасписка)
	|				И РаскрытиеСпискаВладельцев.ЦеннаяБумага1.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхРасписок.РоссийскаяДепозитарнаяРасписка)
	|			ТОГДА ""RDRP""
	|		КОГДА РаскрытиеСпискаВладельцев.ЦеннаяБумага1.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.КлиринговыйСертификатУчастия)
	|			ТОГДА ""MPPC""
	|	КОНЕЦ КАК ТипЦБ,
	|	ВЫБОР
	|		КОГДА РаскрытиеСпискаВладельцев.ЦеннаяБумага1.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Акция)
	|				И РаскрытиеСпискаВладельцев.ЦеннаяБумага1.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыАкций.Обыкновенная)
	|			ТОГДА ""ORDN""
	|		КОГДА РаскрытиеСпискаВладельцев.ЦеннаяБумага1.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Акция)
	|				И РаскрытиеСпискаВладельцев.ЦеннаяБумага1.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыАкций.Привилегированная)
	|			ТОГДА ""PREF""
	|	КОНЕЦ КАК ВидЦБАкция,
	|	РаскрытиеСпискаВладельцев.ЦеннаяБумага1.ВалютаНоминала.НаименованиеДляОтчетов КАК ВалютаНоминалаНаименованиеДляОтчетов,
	|	РаскрытиеСпискаВладельцев.ЦеннаяБумага1 КАК ЦБ,
	|	РаскрытиеСпискаВладельцев.ЦеннаяБумага1.НомерРегистрации КАК НомерРегистрации,
	|	РаскрытиеСпискаВладельцев.ЦеннаяБумага1.ISIN КАК ISIN,
	|	РаскрытиеСпискаВладельцев.ЦеннаяБумага1.Код КАК ЦБКод,
	|	ЗапросСубброкеруНаРаскрытие.Ссылка КАК ЗапросСубброкеруНаРаскрытие,
	|	РаскрытиеСпискаВладельцев.Организация КАК Организация,
	|	РаскрытиеСпискаВладельцев.Комментарий КАК РСВКомментарий,
	|	РаскрытиеСпискаВладельцев.ИнициаторЗапроса.Код КАК РСВИнициаторЗапроса,
	|	РаскрытиеСпискаВладельцев.КодОснованияЗапроса.Код КАК РСВКодОснованияЗапроса,
	|	РаскрытиеСпискаВладельцев.ДополнительноеОписаниеОснованияЗапроса КАК РСВДополнительноеОписаниеОснованияЗапроса,
	|	РаскрытиеСпискаВладельцев.ПодзаконныйАкт КАК РСВПодзаконныйАкт,
	|	РаскрытиеСпискаВладельцев.ТипСписка.Код КАК РСВТипСписка,
	|	РаскрытиеСпискаВладельцев.ПредоставитьБанковскиеРеквизиты КАК РСВБанковскиеРеквизиты,
	|	РаскрытиеСпискаВладельцев.ШаблонFCDR_2017_02 КАК РСВШаблонFCDR_2017_02,
	|	ЗапросСубброкеруНаРаскрытие.Номер КАК ЗапросНомер,
	|	ЗапросСубброкеруНаРаскрытие.Дата КАК ЗапросДата,
	|	ВЫБОР
	|		КОГДА ЗапросСубброкеруНаРаскрытие.ВидКД.ТипКорпоративныхДействий = ЗНАЧЕНИЕ(Перечисление.ТипыКорпоративныхДействий.Доход)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоДоход,
	|	ЗапросСубброкеруНаРаскрытие.Клиент.Код КАК КлиентКод,
	|	КодыЗагрузки.Код КАК КодНДЦ
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|			ПО (КодыЗагрузки.Биржа = &НДЦ)
	|				И РаскрытиеСпискаВладельцев.ЦеннаяБумага1 = КодыЗагрузки.Владелец
	|		ПО ЗапросСубброкеруНаРаскрытие.РСВ = РаскрытиеСпискаВладельцев.Ссылка
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("НДЦ", Константы.КлассификаторЗагрузкиНДЦ.Получить());
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения.ЗапросСубброкеруСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция Header_РСВ_FCDR(ДанныеДляЗаполненияXML, ПространствоИмен)
	Результат = НовыйОбъектСхемыFCDR("header_t", ПространствоИмен);
	
	НомерРаскрытия = "ZS" + ДанныеДляЗаполненияXML.ЗапросНомер;
	
	Результат.doc_num = НомерРаскрытия;
	Результат.doc_date = Новый_date_or_datetime_t(ПространствоИмен, ДанныеДляЗаполненияXML.ЗапросДата);
	
	РегистрационныеДанные = НовыйРегистрационныеДанныеДля_party_identification2_V02_t(ДанныеДляЗаполненияXML.ОрганизацияLEI, "OTHR", "LEIC");
	Результат.from = Новый_party_identification2_V02_t(РегистрационныеДанные,
		ДанныеДляЗаполненияXML.ОрганизацияНаименование, ПространствоИмен);
	
	РегистрационныеДанные = НовыйРегистрационныеДанныеДля_party_identification2_V02_t(ДанныеДляЗаполненияXML.КлиентLEI, "OTHR", "LEIC");
	Результат.to = Новый_party_identification2_V02_t(РегистрационныеДанные, ДанныеДляЗаполненияXML.КлиентНаименование, ПространствоИмен);
	Возврат Результат;
КонецФункции

Функция Новый_party_identification2_V02_t(РегистрационныеДанные, Наименование = Неопределено, ПространствоИмен)
	
	Результат = НовыйОбъектСхемыFCDR("party_identification2_V02_t", ПространствоИмен);
	
	Результат.id_2.Добавить(Новый_id_type_V02_t(РегистрационныеДанные, ПространствоИмен));
	Результат.name = Наименование;

	Возврат Результат;
КонецФункции

Функция Новый_id_type_V02_t(РегистрационныеДанные, ПространствоИмен)
	
	Результат = НовыйОбъектСхемыFCDR("id_type_V02_t", ПространствоИмен);
	
	Результат.id = СокрЛП(РегистрационныеДанные.Идентификатор);
	Результат.id_type = РегистрационныеДанные.ТипИдентификатора;
	Результат.narrative = РегистрационныеДанные.ОписаниеТипаИдентификатораПрочее;

	Возврат Результат;
КонецФункции

Функция Новый_date_or_datetime_t(ПространствоИмен, Дата = Неопределено, ВключаяВремя = Ложь)
	Результат = НовыйОбъектСхемыFCDR("date_or_datetime_t", ПространствоИмен);
	
	Если ВключаяВремя Тогда
		Результат.datetime = Дата;
	Иначе
		Результат.date = Дата;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция НовыйРегистрационныеДанныеДля_party_identification2_V02_t(Идентификатор, ТипИдентификатора,
		ОписаниеТипаИдентификатораПрочее = Неопределено)
	Возврат Новый Структура("Идентификатор, ТипИдентификатора, ОписаниеТипаИдентификатораПрочее",
	Идентификатор, ТипИдентификатора, ОписаниеТипаИдентификатораПрочее);
КонецФункции

Функция НовыйОбъектСхемыFCDR(ИмяТипа, ПространствоИмен)
	Тип = ФабрикаXDTO.Тип(ПространствоИмен, ИмяТипа);
	Возврат ФабрикаXDTO.Создать(Тип);
КонецФункции

Функция Сorporate_action_reference_РСВ_FCDR(ДанныеДляЗаполненияXML, ПространствоИмен)
	 Результат = НовыйОбъектСхемыFCDR("corporate_action_reference_t_v03", ПространствоИмен);
	 
	 Результат.corp_actn_evt_id = ДанныеДляЗаполненияXML.РеференсКД;
	 Результат.corporate_action_code = "DSCL";
	 
	 Возврат Результат;
КонецФункции

Функция Issuer_РСВ_FCDR(ДанныеДляЗаполненияXML, ПространствоИмен)
	Результат = НовыйОбъектСхемыFCDR("legal_entity_details_t", ПространствоИмен);
	
	Результат.legal_entity_name = ДанныеДляЗаполненияXML.ПолноеНаименованиеЮрЛицо;
	Результат.legal_entity_id = НовыйОбъектСхемыFCDR("organization_id_t", ПространствоИмен);
	organization_document_t = НовыйОбъектСхемыFCDR("organization_document_t", ПространствоИмен);
	СтрокаOrganization_id = Результат.legal_entity_id.organization_id.Добавить(organization_document_t);
	Если ЗначениеЗаполнено(ДанныеДляЗаполненияXML.ЭмитентОГРН) Тогда
		СтрокаOrganization_id.organization_code_type = "OGRN";
		СтрокаOrganization_id.org_doc_num = НовыйОбъектСхемыFCDR("document_details_choice_t", ПространствоИмен);
		СтрокаOrganization_id.org_doc_num.doc_num = ДанныеДляЗаполненияXML.ЭмитентОГРН;
	ИначеЕсли ЗначениеЗаполнено(ДанныеДляЗаполненияXML.ЭмитентИнн) Тогда
		СтрокаOrganization_id.organization_code_type = "OTHR";
		СтрокаOrganization_id.narrative = "INN";
		СтрокаOrganization_id.org_doc_num = НовыйОбъектСхемыFCDR("document_details_choice_t", ПространствоИмен);
		СтрокаOrganization_id.org_doc_num.doc_num = ДанныеДляЗаполненияXML.ЭмитентИнн;
	Иначе
		СтрокаOrganization_id.organization_code_type = "OGRN";
		СтрокаOrganization_id.org_doc_num = НовыйОбъектСхемыFCDR("document_details_choice_t", ПространствоИмен);
		СтрокаOrganization_id.org_doc_num.doc_num = "UKWN";
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция IssuerПай_РСВ_FCDR(ДанныеДляЗаполненияXML, ПространствоИмен)
	Результат = НовыйОбъектСхемыFCDR("legal_entity_details_t", ПространствоИмен);
	
	Результат.legal_entity_name = ДанныеДляЗаполненияXML.ПайНаименованиеВыпуска;
	Результат.legal_entity_id = НовыйОбъектСхемыFCDR("organization_id_t", ПространствоИмен);
	organization_document_t = НовыйОбъектСхемыFCDR("organization_document_t", ПространствоИмен);
	СтрокаOrganization_id = Результат.legal_entity_id.organization_id.Добавить(organization_document_t);
	СтрокаOrganization_id.organization_code_type = "TMRL";
	СтрокаOrganization_id.org_doc_num = НовыйОбъектСхемыFCDR("document_details_choice_t", ПространствоИмен);
	СтрокаOrganization_id.org_doc_num.doc_num = ДанныеДляЗаполненияXML.ПайНомерРегистрации;
	
	Возврат Результат;
КонецФункции

Функция add_info_РСВ_FCDR(ДанныеДляЗаполненияXML)
	
	ТекстДляДобавления = "";
	СтрокиКомментария = СтрРазделить(ДанныеДляЗаполненияXML.РСВКомментарий, Символы.ПС, Ложь);
	Если ДанныеДляЗаполненияXML.ЭтоДоход Тогда
		ТекстДляДобавления = "<text>
		|Документы, дающие основания владельцам ценных бумаг на льготное налогообложение доходов, просим предоставить"
			+ "не позднее указанного срока приема раскрытия списка владельцев
		|</text>" + Символы.ПС;
	КонецЕсли;
	Для Каждого СтрокаКомментария Из СтрокиКомментария Цикл
		Если СтрНайти(СтрокаКомментария, "text: ") > 0 Тогда
			СтрокаКомментария = СокрЛП(СтрЗаменить(СтрокаКомментария, "text: ", ""));
			ТекстДляДобавления = ТекстДляДобавления + "<text>" + СтрокаКомментария + "</text>";
		ИначеЕсли СтрНайти(СтрокаКомментария, "Ext/FormCode: ") > 0 Тогда
			СтрокаКомментария = СокрЛП(СтрЗаменить(СтрокаКомментария, "Ext/FormCode: ", ""));
			ТекстДляДобавления = ТекстДляДобавления + "<Ext><FormCode>" + СтрокаКомментария + "</FormCode></Ext>";
		ИначеЕсли СтрНайти(СтрокаКомментария, "XtnsnDt/response_deadline_time: ") > 0 Тогда
			СтрокаКомментария = СокрЛП(СтрЗаменить(СтрокаКомментария, "XtnsnDt/response_deadline_time: ", ""));
			ТекстДляДобавления = ТекстДляДобавления + "<XtnsnDt><response_deadline_time>" + СтрокаКомментария + "</response_deadline_time>";
		ИначеЕсли СтрНайти(СтрокаКомментария, "XtnsnDt/disclosure_currency: ") > 0 Тогда
			СтрокаКомментария = СокрЛП(СтрЗаменить(СтрокаКомментария, "XtnsnDt/disclosure_currency: ", ""));
			ТекстДляДобавления = ТекстДляДобавления + "<disclosure_currency>" + СтрокаКомментария + "</disclosure_currency></XtnsnDt>";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекстДляДобавления;
	
КонецФункции

Функция ПереработанныйТекстДокумента(ДанныеДляЗаполненияXML, РаскрытиеXDTO)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("Windows-1251");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ТекстДляДобавления = add_info_РСВ_FCDR(ДанныеДляЗаполненияXML);
	
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, РаскрытиеXDTO, "DISCLOSURE_REQUEST");
	ТекстДокумента = ЗаписьXML.Закрыть();
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "<DISCLOSURE_REQUEST xmlns=""FCDR_2017_02(2019v3)"" xmlns:xs=""http://www.w3.org/2001/"
		 + "XMLSchema""xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"">", "<DISCLOSURE_REQUEST>");
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "xmlns="""" xmlns:d2p1=""FCDR_2017_02(2019v3)""", "");
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "d2p1:", "");
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "xsi:type=""xs:string""", "");
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "xmlns=""""", "");
	Если ЗначениеЗаполнено(ТекстДляДобавления) Тогда
		ТекстДляДобавления = "<add_info>" + ТекстДляДобавления + "</add_info>
		|</DISCLOSURE_REQUEST>";
		ТекстДокумента = СтрЗаменить(ТекстДокумента, "</DISCLOSURE_REQUEST>", ТекстДляДобавления);
	КонецЕсли;
	
	Возврат ТекстДокумента;
	
КонецФункции

//----------------------------------------------------------------------------------------
// Функции формирования временных таблиц для отчетов 1042 и 1042S

// Создает и заполняет временную таблицу втДанныеВыплатПоЦБСШАИРаскрытий в переданном Менеджере временных таблиц
//
// Параметры:
//  МВТ				 - Менеджер временных таблиц - в него помещается временная таблица
//  ДатаНачала		 - Дата - начало периода за который собираются выплаты
//  ДатаОкончания	 - Дата - конец периода за который собираются выплаты
//
Процедура ПодготовитьВТДанныеВыплатПоЦБАмерикиОпределениеРСВ(МВТ, ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = ТекстЗапросаДанныеВыплатПоЦБАмерикиОпределениеРСВ();
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("DVCA", Справочники.ВидыКорпоративныхДействий.DVCA());
	Запрос.УстановитьПараметр("INTR", Справочники.ВидыКорпоративныхДействий.INTR());
	Запрос.УстановитьПараметр("MCAL", Справочники.ВидыКорпоративныхДействий.MCAL());
	Запрос.УстановитьПараметр("CAPG", Справочники.ВидыКорпоративныхДействий.CAPG());
	Запрос.УстановитьПараметр("WTRC", Справочники.ВидыКорпоративныхДействий.WTRC());
	Запрос.УстановитьПараметр("США", Справочники.КлассификаторСтранМира.США());
	Запрос.УстановитьПараметр("Исполнено", Перечисления.СтатусыПоручений.Исполнено);
	Запрос.УстановитьПараметр("ДепозитарнаяРасписка", Перечисления.ТипыЦБ.ДепозитарнаяРасписка);
	Запрос.УстановитьПараметр("ВидДокументаW8BENE_W8BEN", Справочники.ВидыДокументовУдостоверяющихПолномочия.ФормаW8BENE_W8BEN);
	Запрос.УстановитьПараметр("ТипФормыW8IMY", Перечисления.ТипыФормW8.ФормаW8IMY);
	Запрос.УстановитьПараметр("РСВПустаяСсылка", Документы.РаскрытиеСпискаВладельцев.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДатаВводаQI", ОбщегоНазначения.ДобавитьРабочийДень(Константы.ДатаВводаСхемыУведомленийWTRC_QI.Получить(), 1));
	Запрос.Выполнить();
	
КонецПроцедуры

// Возвращает таблицу значений по субклиентам общих разделов по выплатам, определенным в МВТ
//
// Параметры:
//  МВТ	 - Менеджер временных таблиц - Менеджер в котором определена ВТ "втДанныеВыплатПоЦБСШАИРаскрытий"
// 
// Возвращаемое значение:
//  Таблица значений - данные субклиентов общих разделов по выплатам из ВТ
//
Функция ТаблицаСубклиентовОбщихРазделовПоДаннымВыплатЦБАмерики(МВТ) Экспорт
	
	ДанныеСубклиентовОбщиеРазделы = НоваяТаблицаСубклиентовОбщихРазделов();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = ТекстЗапросаВыборкаРаскрытийОбщихРазделовСубброкеров();
	ВыборкаРСВ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРСВ.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаРСВ.РСВ) Тогда
			ДанныеРСВ = Неопределено;
		ИначеЕсли ВыборкаРСВ.РСВ.СводноеРаскрытие.Количество() > 0 Тогда
			ДанныеРСВ = ВыборкаРСВ.РСВ.СводноеРаскрытие.Выгрузить();
		Иначе
			РСВОбъект = ВыборкаРСВ.РСВ.ПолучитьОбъект();
			ДанныеРСВ = РСВОбъект.ВыборкаДанныхЗаполненияСводногоРСВ().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		КонецЕсли;
		ВыборкаРСВДетальныеЗаписи = ВыборкаРСВ.Выбрать();
		Пока ВыборкаРСВДетальныеЗаписи.Следующий() Цикл
			Строки = Новый Массив;
			Если ТипЗнч(ДанныеРСВ) = Тип("ТаблицаЗначений") Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("РазделСчетаДепоМХ", ВыборкаРСВДетальныеЗаписи.РазделСчетаДепоМХ);
				Отбор.Вставить("НалоговаяСтавка", ВыборкаРСВДетальныеЗаписи.СтавкаНалога);
				Отбор.Вставить("СтатусПоГлаве4", ВыборкаРСВДетальныеЗаписи.СтатусПоГлаве4);
				Отбор.Вставить("РазделСчетаДепо", ВыборкаРСВДетальныеЗаписи.РазделСчетаДепо);
				Строки = ДанныеРСВ.НайтиСтроки(Отбор);
				Если Строки.Количество() > 0 Тогда
					Для Каждого Строка Из Строки Цикл
						Если Не ЗначениеЗаполнено(Строка.СчетДепоМХ) Тогда // У итоговых записей этот реквизит должен быть пуст
							Продолжить;
						КонецЕсли;
						НоваяСтрока = ДанныеСубклиентовОбщиеРазделы.Добавить();
						НоваяСтрока.РСВ = ВыборкаРСВДетальныеЗаписи.РСВ;
						НоваяСтрока.Поручение = ВыборкаРСВДетальныеЗаписи.Поручение;
						НоваяСтрока.Клиент = Строка.Клиент;
						НоваяСтрока.СчетДепо = Строка.СчетДепо;
						НоваяСтрока.СчетДепоМХ = Строка.СчетДепоМХ;
						НоваяСтрока.РазделСчетаДепо = Строка.РазделСчетаДепо;
						НоваяСтрока.РазделСчетаДепоМХ = Строка.РазделСчетаДепоМХ;
						НоваяСтрока.Количество = Строка.КоличествоЦБ;
						НоваяСтрока.W8BENE_W8BEN = Строка.W8BENE_W8NEN;
						НоваяСтрока.W8IMY = Строка.W8IMY;
						НоваяСтрока.НалоговаяСтавка = Строка.НалоговаяСтавка;
						НоваяСтрока.СтатусПоГлаве4 = Строка.СтатусПоГлаве4;
						НоваяСтрока.Субклиент = Строка.Субклиент;
					КонецЦикла;
				КонецЕсли;
				Продолжить;
			ИначеЕсли ДанныеРСВ = Неопределено Тогда
				НоваяСтрока = ДанныеСубклиентовОбщиеРазделы.Добавить();
				НоваяСтрока.Поручение = ВыборкаРСВДетальныеЗаписи.Поручение;
				НоваяСтрока.Клиент = ВыборкаРСВДетальныеЗаписи.Контрагент;
				НоваяСтрока.СчетДепо = ВыборкаРСВДетальныеЗаписи.СчетДепо;
				НоваяСтрока.СчетДепоМХ = ВыборкаРСВДетальныеЗаписи.СчетДепоМХ;
				НоваяСтрока.РазделСчетаДепо = ВыборкаРСВДетальныеЗаписи.РазделСчетаДепо;
				НоваяСтрока.РазделСчетаДепоМХ = ВыборкаРСВДетальныеЗаписи.РазделСчетаДепоМХ;
				НоваяСтрока.Количество = ВыборкаРСВДетальныеЗаписи.Количество;
				НоваяСтрока.НалоговаяСтавка = ВыборкаРСВДетальныеЗаписи.СтавкаНалога;
				НоваяСтрока.СтатусПоГлаве4 = ВыборкаРСВДетальныеЗаписи.СтатусПоГлаве4;
				Продолжить;
			КонецЕсли;
			ДанныеРСВ.Сбросить();
			Пока ДанныеРСВ.Следующий() Цикл
				Если ДанныеРСВ.РазделСчетаДепоМХ <> ВыборкаРСВДетальныеЗаписи.РазделСчетаДепоМХ Тогда
					Продолжить;
				КонецЕсли;
				ВыборкаНалоговаяСтавка = ДанныеРСВ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаНалоговаяСтавка.Следующий() Цикл
					Если ВыборкаНалоговаяСтавка.НалоговаяСтавка <> ВыборкаРСВДетальныеЗаписи.СтавкаНалога Тогда
						Продолжить;
					КонецЕсли;
					ВыборкаСтатусПоГлаве4 = ВыборкаНалоговаяСтавка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаСтатусПоГлаве4.Следующий() Цикл
						Если ВыборкаСтатусПоГлаве4.СтатусПоГлаве4 <> ВыборкаРСВДетальныеЗаписи.СтатусПоГлаве4 Тогда
							Продолжить;
						КонецЕсли;
						ВыборкаДетальныеЗаписи = ВыборкаСтатусПоГлаве4.Выбрать();
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							Если ВыборкаДетальныеЗаписи.РазделСчетаДепо <> ВыборкаРСВДетальныеЗаписи.РазделСчетаДепо Тогда
								Продолжить;
							КонецЕсли; 							
							НоваяСтрока = ДанныеСубклиентовОбщиеРазделы.Добавить();
							НоваяСтрока.РСВ = ВыборкаРСВДетальныеЗаписи.РСВ;
							НоваяСтрока.Поручение = ВыборкаРСВДетальныеЗаписи.Поручение;
							НоваяСтрока.Клиент = ВыборкаДетальныеЗаписи.Клиент;
							НоваяСтрока.СчетДепо = ВыборкаДетальныеЗаписи.СчетДепо;
							НоваяСтрока.СчетДепоМХ = ВыборкаДетальныеЗаписи.СчетДепоМХ;
							НоваяСтрока.РазделСчетаДепо = ВыборкаДетальныеЗаписи.РазделСчетаДепо;
							НоваяСтрока.РазделСчетаДепоМХ = ВыборкаДетальныеЗаписи.РазделСчетаДепоМХ;
							НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоЦБ;
							НоваяСтрока.W8BENE_W8BEN = ВыборкаДетальныеЗаписи.W8BENE_W8NEN;
							НоваяСтрока.W8IMY = ВыборкаДетальныеЗаписи.W8IMY;
							НоваяСтрока.НалоговаяСтавка = ВыборкаДетальныеЗаписи.НалоговаяСтавка;
							НоваяСтрока.СтатусПоГлаве4 = ВыборкаДетальныеЗаписи.СтатусПоГлаве4;
							НоваяСтрока.Субклиент = ВыборкаДетальныеЗаписи.Субклиент;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	Возврат ДанныеСубклиентовОбщиеРазделы;
	
КонецФункции

// Создает и заполняет временную таблицу втДанныеВыплатПоЦБСШАИРаскрытий в переданном Менеджере временных таблиц
//
// Параметры:
//  МВТ								 - Менеджер временных таблиц - в него помещается временная таблица
//  ДанныеСубклиентовОбщиеРазделы	 - Таблица значений - данные по субклиентам общих разделов из выплат
//  ТекстОшибок						 - Строка(необязательный) - текст ошибок при подготовке ВТ
//
Процедура ПодготовитьВТДетальныеЗаписиПоВыплатамИФормамW8(МВТ, ДанныеСубклиентовОбщиеРазделы, ТекстОшибок = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Организация = ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию();
	ЮЛВТБКБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮридическоеЛицо");
	Запрос.Текст = ТекстЗапросаДетальныеЗаписиПоВыплатамИФормамW8();
	Запрос.УстановитьПараметр("ДанныеСубклиентовОбщиеРазделы",ДанныеСубклиентовОбщиеРазделы);
	Запрос.УстановитьПараметр("ТипФормыW8BEN", Перечисления.ТипыФормW8.ФормаW8BEN);
	Запрос.УстановитьПараметр("ТипФормыW8BENE", Перечисления.ТипыФормW8.ФормаW8BENE);
	Запрос.УстановитьПараметр("ТипФормыW8IMY", Перечисления.ТипыФормW8.ФормаW8IMY);
	Запрос.УстановитьПараметр("W8BENE_W8BEN", Справочники.ВидыДокументовУдостоверяющихПолномочия.ФормаW8BENE_W8BEN);
	Запрос.УстановитьПараметр("ЮЛВТБКБ", ЮЛВТБКБ);
	Запрос.УстановитьПараметр("INDV", Справочники.СтатусыUSTAXCODEгл4.НайтиПоКодуНРД("INDV"));
	Запрос.УстановитьПараметр("ТекстINDV", "INDV");
	Запрос.УстановитьПараметр("QI_EIN", QI_EINПоУмолчанию());
	
	Запрос.УстановитьПараметр("",);
	ВыборкаОшибки = Запрос.Выполнить().Выбрать();
	ТекстОшибок = "";
	Пока ВыборкаОшибки.Следующий() Цикл
		ТекстОшибок = "На дату " +Формат(ВыборкаОшибки.ДатаФиксации, "ДФ=dd.MM.yyyy") + " по клиенту "
			+ СокрЛП(ВыборкаОшибки.КодКонтрагента) + " " + ВыборкаОшибки.Контрагент;
		Если ЗначениеЗаполнено(ВыборкаОшибки.Субклиент) Тогда
			ТекстОшибок = ТекстОшибок + " " + ВыборкаОшибки.Субклиент;
		КонецЕсли;
		ТекстОшибок = ТекстОшибок + " отсутствуют формы:";
		Если Не ЗначениеЗаполнено(ВыборкаОшибки.W8BENE_W8BEN) Тогда
			ТекстОшибок = ТекстОшибок + "W8BEN/W8BENE;";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВыборкаОшибки.W8IMY) И Не ВыборкаОшибки.ЭтоПрямойКлиент Тогда
			ТекстОшибок = ТекстОшибок + "W8IMY;";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВыборкаОшибки.W8IMYДляВТБКБ) Тогда
			ТекстОшибок = ТекстОшибок + "W8IMY для ВТБКБ;";
		КонецЕсли;
		ТекстОшибок = ТекстОшибок+Символы.ПС;
	КонецЦикла;
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Маркер #СсылкаНаСтраницуКДВКабинетеКлиента# будет заменен на ссылку в кабинете клиента
Функция БлокУведомленияУчастиеВКорпоративномДействии() Экспорт
	
	Возврат "<p>Для участия в корпоративном действии перейдите по ссылке: #СсылкаНаСтраницуКДВКабинетеКлиента#</p>";
	
КонецФункции

Функция БлокУведомленияУчастиеВКорпоративномДействииБезСсылки()
	
	Возврат "<p>Подписание поручения на участие будет доступно на вкладке ""Корп. Действия"" в кабинете клиента после наступления даты фиксации.</p>";
	
КонецФункции


// Маркер #СсылкаНаСтраницуКДВКабинетеКлиента# будет заменен на ссылку в кабинете клиента

Функция БлокУведомленияРаскрытиеИнформацииПоСубклиентамБезСсылки()
	
	Возврат "<p>Для раскрытия информации по субклиентам заполните блок &quot;Раскрытие списка владельцев&quot; "
		+ "на странице корпоративного действия.</p>";
	
КонецФункции

Функция БлокУведомленияРаскрытиеИнформацииПоСубклиентамБезСсылкиДляАмериканскихЦБ()
	
	Возврат "<p>Для раскрытия информации по субклиентам заполните форму раскрытия списка владельцев ценных бумаг.</p>";
	
КонецФункции


Функция БлокУведомленияУсловиеДоступностиСсылокДляАмериканскихЦБ()
	
	Возврат "<p>Форма будет доступна для заполнения после наступления даты фиксации по корпоративному действию.</p>";
	
КонецФункции


Функция БлокУведомленияОтветственность()
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<p>%1 не несет ответственности за обработку документов, предоставленных в дату окончания приема инструкций после 17:00.</p>",
		СокрЛП(ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию().Наименование));
	
КонецФункции

Функция БлокУведомленияОбИзмененииКоличестваЦБ()
	
	Возврат "<p>За период с даты предоставления документов в ООО Брокерская компания Платформа" +
	" у Вас изменилось количество ценных бумаг.</p>";
	
КонецФункции

Функция БлокУведомленияПоследнийСрокПодачи(БизнесПроцессСсылка)
	
	ДатаОкончанияПриемаФормыW8 = ОбщегоНазначения.ДобавитьРабочийКалендарныйДень(
			БизнесПроцессСсылка.КД.ДатаОкончанияПриемаИнструкцийНРД, -3);
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<p>Последний срок подачи заполненной формы в %1: %2</p>",
		СокрЛП(ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию().Наименование),
		Формат(ДатаОкончанияПриемаФормыW8, "ДЛФ=Д"));
	
КонецФункции

Функция УведомлениеПредоставитьФормуW8(БизнесПроцессСсылка, ВидУдостоверяющегоДокумента, Повторное)
	
	ТребуетсяРаскрытиеСпискаВладельцев = Ложь;
	НомерУведомления = 0;
	Если ВидУдостоверяющегоДокумента = Справочники.ВидыДокументовУдостоверяющихПолномочия.ФормаW8BENE_W8BEN Тогда
		ОпциональныйБлок =
			"<p>Доходы по указанным ценным бумагам по умолчанию будут облагаться налогом "
			+ "по ставке 30%. Для подтверждения освобождения от налога необходимо предоставить форму "
			+ "W-8BEN для физических лиц или W-8BEN-E для юридических лиц на выгодоприобретателя дохода.</p>";
			НомерУведомления = 2;
	ИначеЕсли ВидУдостоверяющегоДокумента = Справочники.ВидыДокументовУдостоверяющихПолномочия.ФормаW8IMY Тогда
		ОпциональныйБлок =
			"<p>Доходы по указанным ценным бумагам по умолчанию будут облагаться налогом "
			+ "по ставке 30%. Для подтверждения освобождения от налога необходимо предоставить форму "
			+ "W-8IMY на посредника, а также формы W-8BEN/W-8BEN-E на выгодоприобретателей дохода.</p>";
			НомерУведомления = 1;
	Иначе
		ОпциональныйБлок = "";
	КонецЕсли;
	ОпциональныйБлок = ОпциональныйБлок + Символы.ПС + БлокУведомленияПоследнийСрокПодачи(БизнесПроцессСсылка);
	Возврат СодержаниеУведомления(БизнесПроцессСсылка, ОпциональныйБлок, НомерУведомления, Перечисления.ФормыСообщенийКК.SendEmailToClients, ТребуетсяРаскрытиеСпискаВладельцев, Повторное);
	
КонецФункции

Функция СодержаниеУведомления(БизнесПроцессСсылка, ОпциональныйБлок, НомерУведомления, ФормаСообщенияКК, ТребуетсяРаскрытиеСпискаВладельцев, Повторное = Ложь)
	
	Результат = Новый Структура;
	Результат.Вставить("Тема",
		"Поступила информация о проведении корпоративного действия - подтверждение освобождения от налога");
	Результат.Вставить("Тело", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1
		|%2
		|%3",
		БлокУведомленияОбязательныйОткрывающий(БизнесПроцессСсылка),
		ОпциональныйБлок,
		БлокУведомленияОбязательныйЗакрывающий(БизнесПроцессСсылка)));
	Результат.Вставить("РаскрытиеСпискаВладельцев",ТребуетсяРаскрытиеСпискаВладельцев);
	Результат.Вставить("НомерУведомления",НомерУведомления);
	Результат.Вставить("ФормаСообщенияКК",ФормаСообщенияКК);
	Результат.Вставить("Повторное",Повторное);
	Результат.Вставить("Уведомление1_10",Уведомление1_10(НомерУведомления));
	Результат.Вставить("Уведомление2_13",Уведомление2_13(НомерУведомления));
	Результат.Вставить("УведомлениеW8",УведомлениеW8(НомерУведомления));
	Результат.Вставить("ТребуетсяОтправкаЗапросовСубброкеру",ТребуетсяОтправкаЗапросовСубброкеру(НомерУведомления));
	
	Возврат Результат;
	
КонецФункции

Функция БлокУведомленияОбязательныйОткрывающий(БизнесПроцессСсылка)
	
	Если ТипЗнч(БизнесПроцессСсылка) = Тип("ДокументСсылка.КорпоративноеДействие_Новый")  Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(КорпоративноеДействие_Новый.ВидКД.Наименование, """") КАК НаименованиеКД,
		|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(КорпоративноеДействие_Новый.ЦеннаяБумага1.ТипЦБ), """") КАК ТипЦБ1,
		|	ЕСТЬNULL(КорпоративноеДействие_Новый.ЦеннаяБумага1.ISIN, """") КАК ISINЦБ1,
		|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(КорпоративноеДействие_Новый.ЦеннаяБумага2.ТипЦБ), """") КАК ТипЦБ2,
		|	ЕСТЬNULL(КорпоративноеДействие_Новый.ЦеннаяБумага2.ISIN, """") КАК ISINЦБ2,
		|	КорпоративноеДействие_Новый.ЦеннаяБумага1 КАК ЦеннаяБумага1,
		|	КорпоративноеДействие_Новый.КДРеференс КАК КДРеференс,
		|	КорпоративноеДействие_Новый.ДатаКДПлан КАК ДатаКДПлан,
		|	КорпоративноеДействие_Новый.ДатаФиксации КАК ДатаФиксации
		|ИЗ
		|	Документ.КорпоративноеДействие_Новый КАК КорпоративноеДействие_Новый
		|ГДЕ
		|	КорпоративноеДействие_Новый.Ссылка = &БизнесПроцессWTRC");
		Запрос.УстановитьПараметр("БизнесПроцессWTRC", БизнесПроцессСсылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если НЕ Выборка.Следующий() Тогда
			Возврат "";
		КонецЕсли;
		
	Иначе 
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(БизнесПроцесс.КД.ВидКД.Наименование, """") КАК НаименованиеКД,
		|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(БизнесПроцесс.ЦеннаяБумага1.ТипЦБ), """") КАК ТипЦБ1,
		|	ЕСТЬNULL(БизнесПроцесс.ЦеннаяБумага1.ISIN, """") КАК ISINЦБ1,
		|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(БизнесПроцесс.ЦеннаяБумага2.ТипЦБ), """") КАК ТипЦБ2,
		|	ЕСТЬNULL(БизнесПроцесс.ЦеннаяБумага2.ISIN, """") КАК ISINЦБ2,
		|	БизнесПроцесс.ЦеннаяБумага1 КАК ЦеннаяБумага1,
		|	БизнесПроцесс.КДРеференс КАК КДРеференс,
		|	БизнесПроцесс.ДатаКДПлан КАК ДатаКДПлан,
		|	БизнесПроцесс.ДатаФиксации КАК ДатаФиксации
		|ИЗ
		|	БизнесПроцесс.ОбработкаWTRCСообщения КАК БизнесПроцесс
		|ГДЕ
		|	БизнесПроцесс.Ссылка = &БизнесПроцессWTRC");
		Запрос.УстановитьПараметр("БизнесПроцессWTRC", БизнесПроцессСсылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если НЕ Выборка.Следующий() Тогда
			Возврат "";
		КонецЕсли;
	
	КонецЕсли;
	
	
	
	Если ЗначениеЗаполнено(Выборка.ТипЦБ1) И ЗначениеЗаполнено(Выборка.ISINЦБ1) Тогда
		ХарактеристикиЦБ = СокрЛП(Выборка.ТипЦБ1) + " " + СокрЛП(Выборка.ISINЦБ1);
		Если ЗначениеЗаполнено(Выборка.ТипЦБ2) И ЗначениеЗаполнено(Выборка.ISINЦБ2) Тогда
			ХарактеристикиЦБ = ХарактеристикиЦБ + " / " + СокрЛП(Выборка.ТипЦБ2) + " "
				+ СокрЛП(Выборка.ISINЦБ2);
		КонецЕсли;
	Иначе
		ХарактеристикиЦБ = "Данные отсутствуют";
	КонецЕсли;
	
	Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<p>#Hello#</p>
		|<p>Уведомляем Вас о том, что в Депозитарий %1 поступила информация о проведении корпоративного действия 
		|""%2"" - %3 (%4, Референс КД %5).</p>
		|<p>Дата КД (план.): %6</p>
		|<p>Дата фиксации: %7</p>",
		СокрЛП(ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию().Наименование),
		Выборка.НаименованиеКД,
		Справочники.ЦенныеБумаги.НаименованиеЭмитента(Выборка.ЦеннаяБумага1),
		ХарактеристикиЦБ,
		Выборка.КДРеференс,
		Формат(Выборка.ДатаКДПлан, "ДЛФ=Д"),
		Формат(Выборка.ДатаФиксации, "ДЛФ=Д"));	
	Возврат Текст;
	
КонецФункции

Функция БлокУведомленияОбязательныйЗакрывающий(БизнесПроцессСсылка)

	Если ТипЗнч(БизнесПроцессСсылка) = Тип("ДокументСсылка.КорпоративноеДействие_Новый")  Тогда
		ДатаОкончанияПриемаИнструкцийНРД = БизнесПроцессСсылка.ДатаОкончанияПриемаИнструкцийНРД;	
	Иначе 
		ДатаОкончанияПриемаИнструкцийНРД = БизнесПроцессСсылка.КД.ДатаОкончанияПриемаИнструкцийНРД;	
	КонецЕсли;
	
	ДатаОкончанияПриемаВТБКБ = ОбщегоНазначения.ДобавитьРабочийКалендарныйДень(
		ДатаОкончанияПриемаИнструкцийНРД, -2);
	ОбщегоНазначения.СкопироватьВремя(ДатаОкончанияПриемаВТБКБ, '00010101170000');
	
	Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<p>Дата окончания приёма документов %1: %2</p>
		|%3",
		СокрЛП(ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию().Наименование),
		Формат(ДатаОкончанияПриемаВТБКБ, "ДЛФ=DT"),
		Документы.УведомлениеКлиентам.ПодписьСообщения(БизнесПроцессСсылка.Дата));
	Возврат Текст;
	
КонецФункции

Функция ТаблицаДанныхСубброкера()
	
	ТаблицаЗначений = Новый ТаблицаЗначений();
	ТаблицаЗначений.Колонки.Добавить("Субброкер");
	ТаблицаЗначений.Колонки.Добавить("ВнешнийИсточник");
	ТаблицаЗначений.Колонки.Добавить("ПолноеНаименованиеЮЛСубброкера");
	ТаблицаЗначений.Колонки.Добавить("LEIКодСубброкера");
	ТаблицаЗначений.Колонки.Добавить("КодСчетаДепоСубброкера");
	ТаблицаЗначений.Колонки.Добавить("КДРеференс");
	ТаблицаЗначений.Колонки.Добавить("ТипКД");
	ТаблицаЗначений.Колонки.Добавить("КодТипаКД");
	ТаблицаЗначений.Колонки.Добавить("ВидКДВыплатаДоходов");
	ТаблицаЗначений.Колонки.Добавить("ДатаФиксации");
	ТаблицаЗначений.Колонки.Добавить("ЦеннаяБумага");
	ТаблицаЗначений.Колонки.Добавить("ПолноеНаименованиеЭмитента");
	ТаблицаЗначений.Колонки.Добавить("ISIN");
	ТаблицаЗначений.Колонки.Добавить("ГосРегНомерВыпуска");
	ТаблицаЗначений.Колонки.Добавить("КодСубброкера");
	ТаблицаЗначений.Колонки.Добавить("КодСубклиента");
	ТаблицаЗначений.Колонки.Добавить("ТипСчета");
	ТаблицаЗначений.Колонки.Добавить("ПолноеНаименованиеЮЛФЛСубклиента");
	ТаблицаЗначений.Колонки.Добавить("ПризнакЮЛФЛ");
	ТаблицаЗначений.Колонки.Добавить("ДатаРожденияФЛ");
	ТаблицаЗначений.Колонки.Добавить("ГражданствоФЛ");
	ТаблицаЗначений.Колонки.Добавить("СтатусНалогоплательщика");
	ТаблицаЗначений.Колонки.Добавить("КодНРД");
	ТаблицаЗначений.Колонки.Добавить("Количество");
	ТаблицаЗначений.Колонки.Добавить("ЗаявленнаяНалоговаяСтавкаЧисло");
	ТаблицаЗначений.Колонки.Добавить("ЗаполнятьЗаявленнуюНалоговуюСтавку");
	ТаблицаЗначений.Колонки.Добавить("АдресМестонахожденияРегистрацииСтрана");
	ТаблицаЗначений.Колонки.Добавить("АдресМестонахожденияРегистрацииИндекс");
	ТаблицаЗначений.Колонки.Добавить("АдресМестонахожденияРегистрацииАдрес");
	ТаблицаЗначений.Колонки.Добавить("АдресПочтовыйСтрана");
	ТаблицаЗначений.Колонки.Добавить("АдресПочтовыйИндекс");
	ТаблицаЗначений.Колонки.Добавить("АдресПочтовыйАдрес");
	ТаблицаЗначений.Колонки.Добавить("ДокументВладельцаТип");
	ТаблицаЗначений.Колонки.Добавить("ДокументВладельцаНомер");
	ТаблицаЗначений.Колонки.Добавить("ДокументВладельцаСерия");
	ТаблицаЗначений.Колонки.Добавить("ДокументВладельцаДатаВыдачи");
	ТаблицаЗначений.Колонки.Добавить("ДокументВладельцаОрганВыдачи");
	ТаблицаЗначений.Колонки.Добавить("ДатаДокументаРаскрытия");
	ТаблицаЗначений.Колонки.Добавить("КодЗагрузкиНДЦОрганизации");
	ТаблицаЗначений.Колонки.Добавить("НаименованиеЮЛОрганизации");
	ТаблицаЗначений.Колонки.Добавить("НаименованиеВыпуска");
	ТаблицаЗначений.Колонки.Добавить("ДатаОкончанияПриемаИнструкцийВТБКБ");
	ТаблицаЗначений.Колонки.Добавить("ВыводитьСтрокиТаблицы");
	ТаблицаЗначений.Колонки.Добавить("СчетДепо");
	ТаблицаЗначений.Колонки.Добавить("Субклиент");
	ТаблицаЗначений.Колонки.Добавить("РазделСчетаДЕПО");
	ТаблицаЗначений.Колонки.Добавить("НД");
	ТаблицаЗначений.Колонки.Добавить("ИНД");
	ТаблицаЗначений.Колонки.Добавить("КодКлиента");
	ТаблицаЗначений.Колонки.Добавить("ЗаявленнаяНалоговаяСтавка");
	Возврат ТаблицаЗначений;
	
КонецФункции

// Возвращает имя временного XLSX-файла расшифровки запроса на раскрытие по субклиентам
//
// Параметры:
//  ДанныеПоСубброкеру						 - ТаблицаЗначений	 - данные по субклиентам для заполнения файла
//  ИмяМакета								 - Строка	 - имя макета документа РаскрытиеСпискаВладельцев
//  ЦБПодпадаетПодНалоговоеРегулировениеСША	 - Булево	 - регулирует вывод налоговых колонок
//  ВыводитьНалоги							 - Булево	 - включает вывод налоговых колонок независимо от вида КД
// 
// Возвращаемое значение:
//  Строка - имя временного файла XLSX
//
Функция ФайлРасшифровкиЗапросаНаРаскрытиеПоСубклиентам(Знач ДанныеПоСубброкеру, ИмяМакета,
	ЦБПодпадаетПодНалоговоеРегулировениеСША, ВыводитьНалоги = Ложь) Экспорт 
	
	ТаблицаДанныхСубброкера = ТаблицаДанныхСубброкера();
	Для Каждого Строка Из ДанныеПоСубброкеру Цикл 
		ЗаполнитьЗначенияСвойств(ТаблицаДанныхСубброкера.Добавить(), Строка);	
	КонецЦикла;
	
	ТаблицаДанныхСубброкера.Сортировать("КодСубклиента Убыв");
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = Документы.РаскрытиеСпискаВладельцев.ПолучитьМакет(ИмяМакета);
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапки.Параметры.Заполнить(ТаблицаДанныхСубброкера[0]);
	ТабличныйДокумент.Вывести(ОбластьШапки);
	
	ОбластьШапкиТаблицыОсновная = Макет.ПолучитьОбласть("ШапкаТаблицы|Основной");
	ТабличныйДокумент.Вывести(ОбластьШапкиТаблицыОсновная);
	
	Если НЕ ЦБПодпадаетПодНалоговоеРегулировениеСША Тогда
		Если ТаблицаДанныхСубброкера[0].ВидКДВыплатаДоходов ИЛИ ВыводитьНалоги Тогда
			ОбластьНалоги = Макет.ПолучитьОбласть("ШапкаТаблицы|Налоги");
			ТабличныйДокумент.Присоединить(ОбластьНалоги);
		КонецЕсли;
	КонецЕсли;
	
	Если Макет.Области.Найти("Хвост") <> Неопределено Тогда 
		ОбластьХвост = Макет.ПолучитьОбласть("ШапкаТаблицы|Хвост");
		ТабличныйДокумент.Присоединить(ОбластьХвост);
	КонецЕсли;
	
	ПараметрыКолонок = ПараметрыКолонокФайлаРасшифровкиЗапросаНаРаскрытие(ТаблицаДанныхСубброкера[0].ЦеннаяБумага,
		ТаблицаДанныхСубброкера[0].КодТипаКД); 
	Для Каждого Область Из ТабличныйДокумент.Области Цикл
		ПараметрКолонки = Неопределено;
		Если ПараметрыКолонок.Свойство(Область.Имя, ПараметрКолонки) Тогда
			Если ПараметрКолонки.Обязательная Тогда
				НалоговыеКолонки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
					"СтатусНалогоплательщика,НаличиеНалоговыхЛьгот,НалоговаяСтавка");
				Если НалоговыеКолонки.Найти(Область.Имя) = Неопределено Тогда
					Область.Текст = "Обязательно";
				Иначе
					Область.Текст = "Обязательно при раскрытии для выплаты дохода";
				КонецЕсли;
			Иначе
				Область.Текст = "Желательно";
			КонецЕсли;
			
			Если ПараметрКолонки.ДоступныеЗначения <> Неопределено Тогда
				ДанныеКолонки = ТаблицаДанныхСубброкера.ВыгрузитьКолонку(Область.Имя);
				ДанныеКолонкиСКодами = Новый Массив();
				Для Каждого Значение Из ДанныеКолонки Цикл 
					Если ПараметрКолонки.ДоступныеЗначения.Получить(Значение) = Неопределено Тогда 
						Для Каждого ЗначениеСоотвествия Из ПараметрКолонки.ДоступныеЗначения Цикл
							Если ЗначениеСоотвествия.Значение = Значение Тогда
								Значение = ЗначениеСоотвествия.Ключ;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					ДанныеКолонкиСКодами.Добавить(Значение);
				КонецЦикла;
				ТаблицаДанныхСубброкера.ЗагрузитьКолонку(ДанныеКолонкиСКодами,Область.Имя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаДанныхСубброкера[0].ВыводитьСтрокиТаблицы Тогда	
		Для Каждого Строка Из ТаблицаДанныхСубброкера Цикл
			
			ОбластьОсновной	= Макет.ПолучитьОбласть("Строка|Основной");
			Если НЕ ЦБПодпадаетПодНалоговоеРегулировениеСША Тогда
				ОбластьНалоги	= Макет.ПолучитьОбласть("Строка|Налоги");
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Строка.КодСубклиента) Тогда 
				ДанныеЗаполнения = Новый Структура("ВидКДВыплатаДоходов, Количество, РазделСчетаДепо, КодНРД, ISIN, LEIКодСубброкера");
				ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Строка);
			Иначе
				ДанныеЗаполнения = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Строка);
			КонецЕсли;
						
			ОбластьОсновной.Параметры.Заполнить(ДанныеЗаполнения);
						
			ТабличныйДокумент.Вывести(ОбластьОсновной);
			
			Если НЕ ЦБПодпадаетПодНалоговоеРегулировениеСША Тогда
				Если ДанныеЗаполнения.ВидКДВыплатаДоходов ИЛИ ВыводитьНалоги Тогда
					ОбластьНалоги.Параметры.Заполнить(ДанныеЗаполнения);
					ТабличныйДокумент.Присоединить(ОбластьНалоги);
				КонецЕсли;			
			КонецЕсли;
			
			Если Макет.Области.Найти("Хвост") <> Неопределено Тогда 
				ОбластьХвост	= Макет.ПолучитьОбласть("Строка|Хвост");
				ОбластьХвост.Параметры.Заполнить(ДанныеЗаполнения);
				ТабличныйДокумент.Присоединить(ОбластьХвост);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если Макет.Области.Найти("Легенда") <> Неопределено Тогда 
		Организация = Константы.ОрганизацияПоУмолчанию.Получить();
		ЮрЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮридическоеЛицо");
		НаименованиеЮЛОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрЛицо, "Наименование");
		
		ОбластьЛегенда = Макет.ПолучитьОбласть("Легенда");
		ОбластьЛегенда.Параметры.НаименованиеЮЛОрганизации = НаименованиеЮЛОрганизации;
		ТабличныйДокумент.Вывести(ОбластьЛегенда);
	КонецЕсли;
		
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ТабличныйДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	Возврат ИмяФайла;
КонецФункции

Функция ФайлЗапросаНаРаскрытиеПоСубклиентамПриложение2_5(ДанныеПоСубброкеру, ЗапросНаРаскрытиеСсылка = Неопределено) Экспорт 
	ИтогоКоличествоПоСубброкеру = 0;
	Для Каждого Строка Из ДанныеПоСубброкеру Цикл
		ИтогоКоличествоПоСубброкеру = ИтогоКоличествоПоСубброкеру + Строка.Количество;
	КонецЦикла;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = Документы.РаскрытиеСпискаВладельцев.ПолучитьМакет("Макет_2_5_2022");
	Область = Макет.ПолучитьОбласть("Документ");
	Область.Параметры.Заполнить(ДанныеПоСубброкеру[0]);
	Область.Параметры.ИтогоКоличествоПоСубброкеру = ИтогоКоличествоПоСубброкеру;
	Если ТипЗнч(ЗапросНаРаскрытиеСсылка) = Тип("ДокументСсылка.ЗапросСубброкеруНаРаскрытие") Тогда
		Область.Параметры.НомерДокументаРаскрытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗапросНаРаскрытиеСсылка,"Номер");	
	КонецЕсли;
	ТабличныйДокумент.Вывести(Область);
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ТабличныйДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	Возврат ИмяФайла;
КонецФункции


// Функции формирования уведомлений документа "Запрос субброкеру на раскрытие"

Функция УведомлениеЗапросСубброкеруНаРаскрытиеОбязательное(РаскрытиеСпискаВладельцевСсылка, ДанныеЗаполнения)
	
	Тема = "Запрос на раскрытие списка владельцев ценных бумаг";
	
	MessageInfo = РаботаСJSON.СтруктураMessageInfo();
	MessageInfo.Вставить("MessageType", "Email");
	MessageInfo.Вставить("JsonVersion", "1.0.0");
	MessageInfo.Вставить("SystemSource", "Depo");
	MessageInfo.Вставить("ParentMessageId", Неопределено);
	MessageInfo.Вставить("ActionType", "INS");
	
	Data = Новый Структура();
	Data.Вставить("NotificationType", "Client");
	Data.Вставить("CrmClientId", Неопределено);
	Data.Вставить("Email", Неопределено);
	Data.Вставить("MailTemplateId", Неопределено);
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_РеорганизацииОбщества");
	
	ReplaceFields = Новый Структура;
	ReplaceFields.Вставить("ВидКД", ДанныеЗаполнения.НаименованиеКД);
	ReplaceFields.Вставить("НаименованиеЦБ", ДанныеЗаполнения.НаименованиеЦБ);
	ReplaceFields.Вставить("ISIN", ДанныеЗаполнения.ISIN);
	ReplaceFields.Вставить("ДатаОкончанияПриемаИнструкцийНРБанка", ДанныеЗаполнения.ДатаОкончанияПриемаИнструкцийВТБКБ);
	ReplaceFields.Вставить("СсылкаНаСтраницуКДВКабинетеКлиента", "");
	ReplaceFields.Вставить("ИнформацияДляКлиентовИНД", "");
	Подпись = Документы.УведомлениеКлиентам.ПодписьСообщения(ДанныеЗаполнения.Дата);
	ReplaceFields.Вставить("Подпись", Подпись);
	
	Data.Вставить("ReplaceFields", ReplaceFields);
	Тело = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	Результат = Новый Структура;
	Результат.Вставить("Тема", Тема);
	Результат.Вставить("Тело", Тело);
	Результат.Вставить("РаскрытиеСпискаВладельцев", Истина);
	Результат.Вставить("НомерУведомления", 49601);
	Результат.Вставить("ФормаСообщенияКК", Перечисления.ФормыСообщенийКК.ЗапросСубброкеруНаРаскрытиеОбязательное);
	Результат.Вставить("Повторное", Ложь);
	Результат.Вставить("Уведомление1_10", Ложь);
	Результат.Вставить("Уведомление2_13", Ложь);
	Результат.Вставить("УведомлениеW8", Ложь);
	Возврат Результат;
	
КонецФункции

Функция УведомлениеЗапросСубброкеруНаРаскрытиеДобровольное(РаскрытиеСпискаВладельцевСсылка, ДанныеЗаполнения)
	
	Тема = "Поступила информация о проведении корпоративного действия - <ТипКД>";
	Тема = СтрЗаменить(Тема, "<ТипКД>", ДанныеЗаполнения.ТипКД);
	
	MessageInfo = РаботаСJSON.СтруктураMessageInfo();
	MessageInfo.Вставить("MessageType", "Email");
	MessageInfo.Вставить("JsonVersion", "1.0.0");
	MessageInfo.Вставить("SystemSource", "Depo");
	MessageInfo.Вставить("ParentMessageId", Неопределено);
	MessageInfo.Вставить("ActionType", "INS");
	
	Data = Новый Структура();
	Data.Вставить("NotificationType", "Client");
	Data.Вставить("CrmClientId", Неопределено);
	Data.Вставить("Email", Неопределено);
	Data.Вставить("MailTemplateId", Неопределено);
	Data.Вставить("MailTemplateTitle", "ОПроведенииКД_РеорганизацииОбщества");
	
	ReplaceFields = Новый Структура;
	ReplaceFields.Вставить("ВидКД", ДанныеЗаполнения.НаименованиеКД);
	ReplaceFields.Вставить("НаименованиеЭмитента", ДанныеЗаполнения.НаименованиеЦБ);
	ТипЦБ	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2", ДанныеЗаполнения.ТипЦБ1, ДанныеЗаполнения.ISIN1);
	Если ЗначениеЗаполнено(ДанныеЗаполнения.ТипЦБ2) Тогда 
		ТипЦБ = ТипЦБ + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(" / %1 %2", ДанныеЗаполнения.ТипЦБ2, ДанныеЗаполнения.ISIN2);
	КонецЕсли;
	ReplaceFields.Вставить("ХарактеристикиЦБ", ТипЦБ);
	ReplaceFields.Вставить("КДРеференс", ДанныеЗаполнения.РеференсКД);
	ReplaceFields.Вставить("ДатаКДПлан", ДанныеЗаполнения.ДатаКДПлан);
	ReplaceFields.Вставить("ДатаФиксации", ДанныеЗаполнения.ДатаФиксации);
	ReplaceFields.Вставить("СсылкаНаСтраницуКДВКабинетеКлиента", "");
	ReplaceFields.Вставить("ДатаОкончанияПриемаИнструкцийНРБанка", ДанныеЗаполнения.ДатаОкончанияПриемаИнструкцийВТБКБ);
	Подпись = Документы.УведомлениеКлиентам.ПодписьСообщения(ДанныеЗаполнения.Дата);
	Подпись = СтрЗаменить(Подпись, "<p>", "");
	Подпись = СокрЛП(СтрЗаменить(Подпись, "</p>", ""));
	ReplaceFields.Вставить("Подпись", Подпись);
	
	Data.Вставить("ReplaceFields", ReplaceFields);
	Тело = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	Результат = Новый Структура;
	Результат.Вставить("Тема", Тема);
	Результат.Вставить("Тело", Тело);
	Результат.Вставить("РаскрытиеСпискаВладельцев", Истина);
	Результат.Вставить("НомерУведомления", 49602);
	Результат.Вставить("ФормаСообщенияКК", Перечисления.ФормыСообщенийКК.ЗапросСубброкеруНаРаскрытиеДобровольное);
	Результат.Вставить("Повторное", Ложь);
	Результат.Вставить("Уведомление1_10", Ложь);
	Результат.Вставить("Уведомление2_13", Ложь);
	Результат.Вставить("УведомлениеW8", Ложь);
	Возврат Результат;
	
КонецФункции

// Возвращает данные уведомления субброкеру (запрос субброкеру на раскрытие владельцев)
//
// Параметры:
//  РаскрытиеСпискаВладельцевСсылка	 - ДокументСсылка.РаскрытиеСпискаВладельцев	 - Документ РСВ
//  ЦеннаяБумага					 - СправочникСсылка.ЦенныеБумаги - Ценная бумага (ЦБ1 или ЦБ2). Для обязательного КД
// 
// Возвращаемое значение:
//	Неопределено
//  или Структура - 
//		* Тема - Строка
//		* Тело - Строка
//		* РаскрытиеСпискаВладельцев - Булево
//		* НомерУведомления - Число
//		* ФормаСообщенияКК - ПеречислениеСсылка.ФормыСообщенийКК
//		* Повторное - Булево
//		* Уведомление1_10 - Булево
//		* Уведомление2_13 - Булево
//		* УведомлениеW8 - Булево
//
Функция УведомлениеЗапросСубброкеруНаРаскрытие(РаскрытиеСпискаВладельцевСсылка, ЦеннаяБумага) Экспорт
	
	
	ОбязательныеВидыКД = Новый Массив();
	ОбязательныеВидыКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("DVCA"));
	ОбязательныеВидыКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("INTR"));
	ОбязательныеВидыКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("MCAL"));
	ОбязательныеВидыКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("PRED"));
	ОбязательныеВидыКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("CAPG"));
	ОбязательныеВидыКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("MEET"));
	ОбязательныеВидыКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("XMET"));
	ОбязательныеВидыКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("BMET"));
	ОбязательныеВидыКД.Добавить(Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("OMET"));
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РаскрытиеСпискаВладельцев.Ссылка,
	|	РаскрытиеСпискаВладельцев.ВидКорпоративногоДействия,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(РаскрытиеСпискаВладельцев.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).Страна = &РФ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РоссийскаяЦБ
	|ПОМЕСТИТЬ РСВ
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|ГДЕ
	|	РаскрытиеСпискаВладельцев.Ссылка = &РаскрытиеСпискаВладельцевСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РСВ.РоссийскаяЦБ
	|				И РСВ.ВидКорпоративногоДействия = &DSCL
	|			ТОГДА &УведомлениеДляОбязательныхКД
	|		КОГДА РСВ.ВидКорпоративногоДействия В (&ОбязательныеВидыКД)
	|			ТОГДА &УведомлениеДляОбязательныхКД
	|		КОГДА НЕ РСВ.РоссийскаяЦБ
	|				И РСВ.ВидКорпоративногоДействия = &DSCL
	|			ТОГДА &УведомлениеДляДобровольных
	|		КОГДА РСВ.ВидКорпоративногоДействия = &TREC
	|			ТОГДА &УведомлениеДляДобровольных
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ТипУведомления,
	|	ВЫБОР
	|		КОГДА РСВ.Ссылка.СвязанныйРеференсКД1 <> """"
	|			ТОГДА РСВ.Ссылка.СвязанныйВидКД1.Наименование
	|		ИНАЧЕ РСВ.Ссылка.ВидКорпоративногоДействия.Наименование
	|	КОНЕЦ КАК ТипКД,
	|	ВЫБОР
	|		КОГДА РСВ.Ссылка.СвязанныйРеференсКД1 <> """"
	|			ТОГДА РСВ.Ссылка.СвязанныйРеференсКД1
	|		ИНАЧЕ РСВ.Ссылка.КДРеференс
	|	КОНЕЦ КАК РеференсКД,
	|	ЕСТЬNULL(ЦенныеБумаги.Наименование, """") КАК НаименованиеЦБ,
	|	ЕСТЬNULL(ЦенныеБумаги.ISIN, """") КАК ISIN,
	|	ЕСТЬNULL(РСВ.Ссылка.ДатаОкончанияПриемаИнструкцийВТБКБ, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	|	ЕСТЬNULL(РСВ.ВидКорпоративногоДействия.Наименование, """") КАК НаименованиеКД,
	|	ЕСТЬNULL(РСВ.Ссылка.Эмитент.Наименование, """") КАК НаименованиеЭмитента,
	|	ЕСТЬNULL(РСВ.Ссылка.ЦеннаяБумага1.ТипЦБ, """") КАК ТипЦБ1,
	|	ЕСТЬNULL(РСВ.Ссылка.ЦеннаяБумага1.ISIN, """") КАК ISIN1,
	|	ЕСТЬNULL(РСВ.Ссылка.ЦеннаяБумага2.ТипЦБ, """") КАК ТипЦБ2,
	|	ЕСТЬNULL(РСВ.Ссылка.ЦеннаяБумага2.ISIN, """") КАК ISIN2,
	|	ЕСТЬNULL(РСВ.Ссылка.ДатаКДПлан, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаКДПлан,
	|	ЕСТЬNULL(РСВ.Ссылка.ДатаФиксации, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаФиксации,
	|	РСВ.Ссылка.Дата КАК Дата
	|ИЗ
	|	РСВ КАК РСВ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|	ПО ЦенныеБумаги.Ссылка = &ЦеннаяБумага
	|");
	
	Запрос.УстановитьПараметр("РФ", Справочники.КлассификаторСтранМира.РОССИЯ);
	Запрос.УстановитьПараметр("РаскрытиеСпискаВладельцевСсылка", РаскрытиеСпискаВладельцевСсылка);
	Запрос.УстановитьПараметр("DSCL", Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("DSCL"));
	Запрос.УстановитьПараметр("TREC", Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("TREC"));
	Запрос.УстановитьПараметр("ОбязательныеВидыКД", ОбязательныеВидыКД);
	Запрос.УстановитьПараметр("УведомлениеДляДобровольных", Перечисления.ТипыКорпоративныхДействий.Добровольное);
	Запрос.УстановитьПараметр("УведомлениеДляОбязательныхКД", Перечисления.ТипыКорпоративныхДействий.Обязательное);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	
	ДанныеЗаполнения = Запрос.Выполнить().Выгрузить()[0];
	Если ДанныеЗаполнения.ТипУведомления = Перечисления.ТипыКорпоративныхДействий.Добровольное Тогда 
		Возврат УведомлениеЗапросСубброкеруНаРаскрытиеДобровольное(РаскрытиеСпискаВладельцевСсылка, ДанныеЗаполнения);
	ИначеЕсли  ДанныеЗаполнения.ТипУведомления = Перечисления.ТипыКорпоративныхДействий.Обязательное Тогда 
		Возврат УведомлениеЗапросСубброкеруНаРаскрытиеОбязательное(РаскрытиеСпискаВладельцевСсылка, ДанныеЗаполнения);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции 

Функция ИспользоватьСхемуУведомленийWTRC_QI(ДатаПроверки = Неопределено) Экспорт
	Если ДатаПроверки = Неопределено Тогда 
		ДатаПроверки = ТекущаяДатаСеанса();
	КонецЕсли;
	ДатаВводаСхемыУведомленийWTRC_QI = Константы.ДатаВводаСхемыУведомленийWTRC_QI.Получить();	
	Возврат (ЗначениеЗаполнено(ДатаВводаСхемыУведомленийWTRC_QI) = Истина И  ДатаПроверки >= ДатаВводаСхемыУведомленийWTRC_QI);
КонецФункции

Функция ИспользоватьРегистрациюЗапросовСубброкера(ДатаПроверки = Неопределено) Экспорт
	Если ДатаПроверки = Неопределено Тогда 
		ДатаПроверки = ТекущаяДатаСеанса();
	КонецЕсли;
	ДатаРегистрацииЗапросовСубброкера = Константы.ДатаРегистрацииЗапросовСубброкера.Получить();	
	Возврат (ЗначениеЗаполнено(ДатаРегистрацииЗапросовСубброкера) = Истина И  ДатаПроверки >= ДатаРегистрацииЗапросовСубброкера);
КонецФункции


// Функции создания Уведомлений клиентам
Функция ТаблицаКлиентов() Экспорт 
		
	КолонкиТаблицыКлиентов = 	"Клиент, Договор, СчетДепо, РазделСчетаДепо, ЦеннаяБумага, Количество,
								|Unit, Isin, SecName, SecType, SecCode, ClientId, GosRegNumber, NominalValue, NominalCurrency, 
								|StakeToParticipate, DepoAccountFrom, DepoSectionFrom, DepoAccountTo, DepoSectionTo, СтрокаТабличнойЧасти, Тема, Тело";
	ИменаКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КолонкиТаблицыКлиентов);	
	ТаблицаКлиентов = Новый ТаблицаЗначений();
	Для Каждого ИмяКолонки Из ИменаКолонок Цикл 
		ТаблицаКлиентов.Колонки.Добавить(СокрЛП(ИмяКолонки));
	КонецЦикла;
    Возврат ТаблицаКлиентов; 
	
КонецФункции

Процедура ДобавитьУведомлениеКОтправке(УведомленияКОтправке, Уведомление, ДанныеКОбработке, СтрокаТабличнойЧасти = Неопределено) Экспорт 
	
	ПараметрыУведомления = УведомленияКОтправке.Получить(Уведомление.НомерУведомления);
	Если ПараметрыУведомления = Неопределено Тогда 
		ПараметрыУведомления = Новый Структура("Уведомление, ТаблицаКлиентов, КодСубброкера", Уведомление, ТаблицаКлиентов(), ДанныеКОбработке.ДепонентКод);
	КонецЕсли;
	
	НоваяСтрока = ПараметрыУведомления.ТаблицаКлиентов.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеКОбработке);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Уведомление);
	НоваяСтрока.СтрокаТабличнойЧасти = СтрокаТабличнойЧасти;
	УведомленияКОтправке.Вставить(Уведомление.НомерУведомления, ПараметрыУведомления);
	
КонецПроцедуры
		
// Создает, заполняет и отправляет документ УведомлениеКлиентам по данным бизнес процесса ОбработкаWTRCСообщения
//
// Параметры:
//  БизнесПроцессСсылка	 - 									 - БизнесПроцессСсылка.ОбработкаWTRCСообщения
//  ПараметрыУведомления - Структура						 - Структура с описанием параметров уведомления
//  ДанныеКОбработке	 - ВыборкаИзРезультатаЗапроса		 - 
//  ОбработкаВебСервисы	 - ОбработкаОбъект.TEST_ВебСервисы	 - 
// 
// Возвращаемое значение:
//  Булево - результат создания и отправки уведомления
//
Функция РезультатСозданияИОтправкиУведомленияКлиентам(БизнесПроцессСсылка, ПараметрыУведомления, ДанныеКОбработке, ОбработкаВебСервисы = Неопределено) Экспорт 
	
	Уведомление = ПараметрыУведомления.Уведомление;
	УведомлениеКлиентам = Документы.УведомлениеКлиентам.УведомлениеПоТексту(БизнесПроцессСсылка, Уведомление.ФормаСообщенияКК, Уведомление.Тело); 
	Если УведомлениеКлиентам = Неопределено Тогда 
	
		Попытка	
			Уведомление = ПараметрыУведомления.Уведомление;
			ТаблицаКлиентов = ПараметрыУведомления.ТаблицаКлиентов;
			
			ДокументУведомление = Документы.УведомлениеКлиентам.СоздатьДокумент();
			ДокументУведомление.УстановитьСсылкуНового(Документы.УведомлениеКлиентам.ПолучитьСсылку());
			ДокументУведомление.УстановитьНовыйНомер();	
			ДокументУведомление.Дата = ТекущаяДата();
			ДокументУведомление.Заполнить(БизнесПроцессСсылка);
			ДокументУведомление.ЗаголовокСообщения = Уведомление.Тема;
			ДокументУведомление.ТелоСообщения = Уведомление.Тело;
			ДокументУведомление.ФормаСообщенияКК = Уведомление.ФормаСообщенияКК;
			Если ТипЗнч(БизнесПроцессСсылка) = Тип("ДокументСсылка.ЗапросСубброкеруНаРаскрытие") Тогда
				ДокументУведомление.ДокументОснование = БизнесПроцессСсылка;
				ДокументУведомление.Статус = Перечисления.СтатусыУведомленийКлиентам.Отправлено;
			Иначе
				ДокументУведомление.ОтправитьУведомление(ОбработкаВебСервисы, ПараметрыУведомления);
			КонецЕсли;
			
			Если ДокументУведомление.Статус = Перечисления.СтатусыУведомленийКлиентам.Отправлено Тогда
				ДокументУведомление.Записать();
				Возврат Истина;
			Иначе
				ЗаписьЖурналаРегистрации("Отправка уведомления в КК", УровеньЖурналаРегистрации.Предупреждение,,БизнесПроцессСсылка, "Не удалось отправить уведомление в КК");
				Возврат Ложь;
			КонецЕсли;
		Исключение
			ЗаписьЖурналаРегистрации("Отправка уведомления в КК", УровеньЖурналаРегистрации.Ошибка,,БизнесПроцессСсылка, ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
	ИначеЕсли Уведомление.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.SendEmailToClients Тогда 
		
		Возврат ДокументУведомление.РезультатОтправкиВЛКSendEmailToClients(ПараметрыУведомления, ОбработкаВебСервисы);
		
	ИначеЕсли Уведомление.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.CreateCorporateActionWtrc Тогда 
		
		// В связи с тем что в настоящее время на стороне веб сервиса не внесены соответсвующие изменения, в кабинет клиента данные отправляем через SendEmailToClients.
		// Отправка запроса на раскрытие реализована через Excel файл
		Возврат ДокументУведомление.РезультатОтправкиВЛКSendEmailToClients(ПараметрыУведомления, ОбработкаВебСервисы);
		//Возврат ВебСервисыСервер.РезультатДобавленияКлиентаВСуществующееКорпоративноеДействиеWTRC(
		//ПараметрыУведомления, Строка(УведомлениеКлиентам.УникальныйИдентификатор()));
	Иначе 
		
		ВызватьИсключение "Неожиданный значение формы сообщения клиента, доотправка возможно только для SendEmailToClients, CreateCorporateActionWtrc";
	
	КонецЕсли;
	
КонецФункции

// Общие функции
Функция НалоговаяСтавкаОбязательна(ВидКорпоративногоДействияСсылка) Экспорт 
	
	Возврат ВидКорпоративногоДействияСсылка.ТипКорпоративныхДействий = Перечисления.ТипыКорпоративныхДействий.Доход;
	
КонецФункции

Функция УказаниеРазделаСчетаДепоОбязательно(ВидКорпоративногоДействияСсылка) Экспорт
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидКорпоративногоДействияСсылка,"Код, ТипКорпоративныхДействий");
	Собрания = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("MEET,XMET,BMET,OMET,DISCL");
	
	Если Реквизиты.ТипКорпоративныхДействий = Перечисления.ТипыКорпоративныхДействий.Доход 
		ИЛИ Не Собрания.Найти(Реквизиты.Код) = Неопределено Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ТребуетсяЗапросСубброкеруНаРаскрытие(ВидКорпоративногоДействияСсылка) Экспорт 

	КодыВидовКД = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("DSCL,DVCA,INTR,MCAL,PRED,CAPG,MEET,XMET,BMET,OMET");
	Возврат Не КодыВидовКД.Найти(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидКорпоративногоДействияСсылка,"Код")) = Неопределено;
	
КонецФункции 

Функция ИспользоватьРегистрациюЗапросовСубброкераДляДокумента(ДокументСсылка) Экспорт 
	
	ДокументПоискаСсылка = Неопределено;
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорпоративноеДействие_Новый") Тогда 
		ДокументПоискаСсылка = ДокументСсылка;
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РаскрытиеСпискаВладельцев") Тогда
		// Если передан РСВ не DSCL то смотрим дату по КД иначе смотрим по РСВ
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, Новый Структура("КодВидаКД, КД","ВидКорпоративногоДействия.Код","КарточкаКД"));
		Если Реквизиты.КодВидаКД = "DSCL" Тогда 
			ДокументПоискаСсылка = ДокументСсылка;
		Иначе
			ДокументПоискаСсылка = Реквизиты.КД;
		КонецЕсли;
	Иначе
		ВызватьИсключение "Не верный параметр номер 1, ожидается ДокументСсылка.КорпоративноеДействие_Новый, ДокументСсылка.РаскрытиеСпискаВладельцев"; 
	КонецЕсли;
	
	ДатаПроверки = ТекущаяДатаСеанса();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МИНИМУМ(ЭтапыКД.Период) КАК Период,
	|	ЭтапыКД.КД КАК КД
	|ИЗ
	|	РегистрСведений.ЭтапыКД КАК ЭтапыКД
	|ГДЕ
	|	ЭтапыКД.КД = &ДокументПоиска
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапыКД.КД");
	
	Запрос.УстановитьПараметр("ДокументПоиска", ДокументПоискаСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДатаПроверки = Выборка.Период;	
	КонецЦикла;
	
	Возврат ИспользоватьРегистрациюЗапросовСубброкера(ДатаПроверки);
		
КонецФункции

Функция ИспользоватьСхемуУведомленийWTRC_QIДляДокумента(ДокументСсылка) Экспорт
	
	ДокументПоискаСсылка = Неопределено;
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорпоративноеДействие_Новый") Тогда 
		ДокументПоискаСсылка = ДокументСсылка;
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РаскрытиеСпискаВладельцев") Тогда
		ДокументПоискаСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта("ДокументСсылка", "КарточкаКД");
	Иначе
		ВызватьИсключение "Не верный параметр номер 1, ожидается ДокументСсылка.КорпоративноеДействие_Новый, ДокументСсылка.РаскрытиеСпискаВладельцев"; 
	КонецЕсли;
	
	ДатаПроверки = ТекущаяДатаСеанса();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МИНИМУМ(ЭтапыКД.Период) КАК Период,
	|	ЭтапыКД.КД КАК КД
	|ИЗ
	|	РегистрСведений.ЭтапыКД КАК ЭтапыКД
	|ГДЕ
	|	ЭтапыКД.КД = &ДокументПоиска
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапыКД.КД");
	
	Запрос.УстановитьПараметр("ДокументПоиска", ДокументПоискаСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДатаПроверки = Выборка.Период;	
	КонецЦикла;
	
	Возврат ИспользоватьСхемуУведомленийWTRC_QI(ДатаПроверки);
	
КонецФункции

// Функция - Клиенты для регистрации отправленных уведомлений
// Принимает таблицу значений или массив строк таблицы значений, возвращает таблицу клиентов(без суббклиентов) для отправки уведомлений
// Параметры:
//  ИсходнаяТаблицаКлиентов	 - ТаблицаЗначений, Массив из строк ТаблицыЗначений	
// 
// Возвращаемое значение:
//  ТаблицаЗначений -  
//
Функция КлиентыДляРегистрацииОтправленныхУведомлений(ИсходнаяТаблицаКлиентов) Экспорт 
	ТаблицаКлиентов = Новый ТаблицаЗначений();
	ТаблицаКлиентов.Колонки.Добавить("Клиент");
	ТаблицаКлиентов.Колонки.Добавить("Договор");
	ТаблицаКлиентов.Колонки.Добавить("СчетДепо");
	ТаблицаКлиентов.Колонки.Добавить("ЦеннаяБумага");
	ТаблицаКлиентов.Колонки.Добавить("Количество");
	ТаблицаКлиентов.Колонки.Добавить("MessageId");
	Для Каждого СтрокаТаблицы Из ИсходнаяТаблицаКлиентов Цикл 
		ЗаполнитьЗначенияСвойств(ТаблицаКлиентов.Добавить(), СтрокаТаблицы);	
	КонецЦикла;
	ТаблицаКлиентов.Свернуть("Клиент, Договор, СчетДепо, ЦеннаяБумага, MessageId", "Количество");
	Возврат ТаблицаКлиентов;
КонецФункции

// Возвращает пустую таблицу значений с типизированными колонками для
//  субклиентов общих разделов
// 
// Возвращаемое значение:
//  Таблица значений - таблица субклиентов
//
Функция НоваяТаблицаСубклиентовОбщихРазделов()
	
	СубклиентыОбщиеРазделы = Новый ТаблицаЗначений;
	СубклиентыОбщиеРазделы.Колонки.Добавить("РСВ", Новый ОписаниеТипов("ДокументСсылка.РаскрытиеСпискаВладельцев"));
	СубклиентыОбщиеРазделы.Колонки.Добавить("Клиент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	СубклиентыОбщиеРазделы.Колонки.Добавить("СчетДепо", Новый ОписаниеТипов("СправочникСсылка.СчетаДепо"));
	СубклиентыОбщиеРазделы.Колонки.Добавить("СчетДепоМХ", Новый ОписаниеТипов("СправочникСсылка.СчетаДепоМХ"));
	СубклиентыОбщиеРазделы.Колонки.Добавить("РазделСчетаДепо", Новый ОписаниеТипов("СправочникСсылка.РазделыСчетаДепо"));
	СубклиентыОбщиеРазделы.Колонки.Добавить("РазделСчетаДепоМХ", Новый ОписаниеТипов("СправочникСсылка.РазделыСчетаДепоМХ"));
	СубклиентыОбщиеРазделы.Колонки.Добавить("Количество", Метаданные.ОпределяемыеТипы.КоличествоЦБ.Тип);
	СубклиентыОбщиеРазделы.Колонки.Добавить("W8BENE_W8BEN", Новый ОписаниеТипов("СправочникСсылка.ФормыW8"));
	СубклиентыОбщиеРазделы.Колонки.Добавить("W8IMY", Новый ОписаниеТипов("СправочникСсылка.ФормыW8"));
	СубклиентыОбщиеРазделы.Колонки.Добавить("НалоговаяСтавка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4,2)));
	СубклиентыОбщиеРазделы.Колонки.Добавить("СтатусПоГлаве4", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10)));
	СубклиентыОбщиеРазделы.Колонки.Добавить("Субклиент", Новый ОписаниеТипов("Строка,СправочникСсылка.Субклиенты",,Новый КвалификаторыСтроки(255)));
	СубклиентыОбщиеРазделы.Колонки.Добавить("Поручение", Новый ОписаниеТипов("ДокументСсылка.Поручение"));
	Возврат СубклиентыОбщиеРазделы;
	
КонецФункции

Функция ТекстЗапросаДанныеВыплатПоЦБАмерикиОпределениеРСВ()
	
	Возврат
	"ВЫБРАТЬ
	|	ПоручениеКлиента.Ссылка КАК Поручение,
	|	ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ПоручениеЦенныеБумагиСписываемые.СчетДепо КАК СчетДепо,
	|	ПоручениеЦенныеБумагиСписываемые.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ПоручениеЦенныеБумагиСписываемые.СчетДепоМХ КАК СчетДепоМХ,
	|	ПоручениеЦенныеБумагиСписываемые.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ПоручениеЦенныеБумагиСписываемые.Сумма КАК Сумма,
	|	ПоручениеЦенныеБумагиСписываемые.СуммаНалога КАК СуммаНалога,
	|	ПоручениеЦенныеБумагиСписываемые.СуммаКВыплатеПоИПД КАК СуммаКВыплатеПоИПД,
	|	ПоручениеКлиента.КарточкаКД КАК КорпоративноеДействие,
	|	ПОДСТРОКА(ПоручениеКлиента.КарточкаКД.КДРеференс, 0, 6) КАК КДРеференсСвязанный,
	|	ПоручениеЦенныеБумагиСписываемые.Количество КАК Количество,
	|	ПоручениеЦенныеБумагиСписываемые.СтавкаНалога КАК СтавкаНалога,
	|	ПоручениеКлиента.СтатусПоГлаве4 КАК СтатусПоГлаве4,
	|	ПоручениеЦенныеБумагиСписываемые.СчетДепо.Владелец КАК Контрагент,
	|	ПоручениеЦенныеБумагиСписываемые.СчетДепо.Владелец.Субброкер КАК ЭтоСубброкер,
	|	ПоручениеЦенныеБумагиСписываемые.СчетДепо.Владелец.УправляющаяКомпания КАК ЭтоУправляющаяКомпания,
	|	ПоручениеКлиента.КарточкаКД.ВидКД КАК ВидКД,
	|	ПоручениеЦенныеБумагиСписываемые.ДополнительныеУдержания КАК ДополнительныеУдержания
	|ПОМЕСТИТЬ втДанныеВыплатПоЦБСША
	|ИЗ
	|	РегистрСведений.СтатусыПоручений.СрезПоследних(, ) КАК СтатусыПорученийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение КАК ПоручениеКлиента
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦенныеБумагиСписываемые
	|			ПО (ПоручениеЦенныеБумагиСписываемые.Ссылка = ПоручениеКлиента.Ссылка)
	|		ПО СтатусыПорученийСрезПоследних.Поручение = ПоручениеКлиента.Ссылка
	|			И (СтатусыПорученийСрезПоследних.СтатусПоручения = &Исполнено)
	|			И (ПоручениеКлиента.КарточкаКД.ДатаВыплатыНеПозднее МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|ГДЕ
	|	ПоручениеКлиента.Проведен
	|	И ВЫРАЗИТЬ(ПоручениеКлиента.ВидОперацииД КАК Справочник.ВидыОпераций).ВыплатаДоходаВДенежнойФорме
	|	И ПоручениеКлиента.КарточкаКД.ВидКД В (&INTR, &DVCA, &MCAL, &CAPG)
	|	И ПоручениеКлиента.ЦБ.ТипЦБ <> &ДепозитарнаяРасписка
	|	И ВЫРАЗИТЬ(ПоручениеКлиента.ЦБ.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).Страна = &США
	|	И ПоручениеКлиента.ДатаПлатежногоПоручения >= &ДатаВводаQI
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПорученийWTRC.Поручение КАК Поручение,
	|	ДанныеПорученийWTRC.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ДанныеПорученийWTRC.СчетДепо КАК СчетДепо,
	|	ДанныеПорученийWTRC.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ДанныеПорученийWTRC.СчетДепоМХ КАК СчетДепоМХ,
	|	ДанныеПорученийWTRC.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ДанныеПорученийWTRC.Сумма КАК Сумма,
	|	ДанныеПорученийWTRC.СуммаНалога КАК СуммаНалога,
	|	ДанныеПорученийWTRC.СуммаКВыплатеПоИПД КАК СуммаКВыплатеПоИПД,
	|	ДанныеПорученийWTRC.КорпоративноеДействие КАК КорпоративноеДействие,
	|	ДанныеПорученийWTRC.СвязанноеКДWTRC КАК СвязанноеКДWTRC,
	|	ДанныеПорученийWTRC.СвязанноеКДWTRC.ДатаФиксации КАК ДатаФиксации,
	|	ЕСТЬNULL(РаскрытиеСпискаВладельцев.Ссылка, &РСВПустаяСсылка) КАК РСВ,
	|	ДанныеПорученийWTRC.Количество КАК Количество,
	|	ДанныеПорученийWTRC.СтавкаНалога КАК СтавкаНалога,
	|	ДанныеПорученийWTRC.СтатусПоГлаве4 КАК СтатусПоГлаве4,
	|	ДанныеПорученийWTRC.Контрагент КАК Контрагент,
	|	ДанныеПорученийWTRC.ЭтоСубброкер КАК ЭтоСубброкер,
	|	ДанныеПорученийWTRC.ЭтоУправляющаяКомпания КАК ЭтоУправляющаяКомпания,
	|	ДанныеПорученийWTRC.ВидКД КАК ВидКД,
	|	ДанныеПорученийWTRC.ДополнительныеУдержания КАК ДополнительныеУдержания,
	|	ДанныеПорученийWTRC.КорпоративноеДействие.ДатаВыплатыНеПозднее КАК ДатаВыплатыНеПозднее
	|ПОМЕСТИТЬ втДанныеВыплатПоЦБСШАИРаскрытий
	|ИЗ
	|	(ВЫБРАТЬ
	|		втДанныеПорученийНаВыплатуПоЦБСША.Поручение КАК Поручение,
	|		втДанныеПорученийНаВыплатуПоЦБСША.ЦеннаяБумага КАК ЦеннаяБумага,
	|		втДанныеПорученийНаВыплатуПоЦБСША.СчетДепо КАК СчетДепо,
	|		втДанныеПорученийНаВыплатуПоЦБСША.РазделСчетаДепо КАК РазделСчетаДепо,
	|		втДанныеПорученийНаВыплатуПоЦБСША.СчетДепоМХ КАК СчетДепоМХ,
	|		втДанныеПорученийНаВыплатуПоЦБСША.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|		втДанныеПорученийНаВыплатуПоЦБСША.Сумма КАК Сумма,
	|		втДанныеПорученийНаВыплатуПоЦБСША.СуммаНалога КАК СуммаНалога,
	|		втДанныеПорученийНаВыплатуПоЦБСША.СуммаКВыплатеПоИПД КАК СуммаКВыплатеПоИПД,
	|		втДанныеПорученийНаВыплатуПоЦБСША.КорпоративноеДействие КАК КорпоративноеДействие,
	|		МАКСИМУМ(КорпоративноеДействиеWTRC.Ссылка) КАК СвязанноеКДWTRC,
	|		втДанныеПорученийНаВыплатуПоЦБСША.Количество КАК Количество,
	|		втДанныеПорученийНаВыплатуПоЦБСША.СтавкаНалога КАК СтавкаНалога,
	|		втДанныеПорученийНаВыплатуПоЦБСША.СтатусПоГлаве4 КАК СтатусПоГлаве4,
	|		втДанныеПорученийНаВыплатуПоЦБСША.Контрагент КАК Контрагент,
	|		втДанныеПорученийНаВыплатуПоЦБСША.ЭтоСубброкер КАК ЭтоСубброкер,
	|		втДанныеПорученийНаВыплатуПоЦБСША.ЭтоУправляющаяКомпания КАК ЭтоУправляющаяКомпания,
	|		втДанныеПорученийНаВыплатуПоЦБСША.ВидКД КАК ВидКД,
	|		втДанныеПорученийНаВыплатуПоЦБСША.ДополнительныеУдержания КАК ДополнительныеУдержания
	|	ИЗ
	|		втДанныеВыплатПоЦБСША КАК втДанныеПорученийНаВыплатуПоЦБСША
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорпоративноеДействие_Новый КАК КорпоративноеДействиеWTRC
	|			ПО (втДанныеПорученийНаВыплатуПоЦБСША.КДРеференсСвязанный = ПОДСТРОКА(КорпоративноеДействиеWTRC.КДРеференсСвязанный, 0, 6))
	|				И (НЕ КорпоративноеДействиеWTRC.ПометкаУдаления)
	|				И (КорпоративноеДействиеWTRC.ВидКД = &WTRC)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		втДанныеПорученийНаВыплатуПоЦБСША.КорпоративноеДействие,
	|		втДанныеПорученийНаВыплатуПоЦБСША.Поручение,
	|		втДанныеПорученийНаВыплатуПоЦБСША.СчетДепоМХ,
	|		втДанныеПорученийНаВыплатуПоЦБСША.СчетДепо,
	|		втДанныеПорученийНаВыплатуПоЦБСША.ЦеннаяБумага,
	|		втДанныеПорученийНаВыплатуПоЦБСША.РазделСчетаДепо,
	|		втДанныеПорученийНаВыплатуПоЦБСША.РазделСчетаДепоМХ,
	|		втДанныеПорученийНаВыплатуПоЦБСША.Сумма,
	|		втДанныеПорученийНаВыплатуПоЦБСША.СуммаНалога,
	|		втДанныеПорученийНаВыплатуПоЦБСША.СуммаКВыплатеПоИПД,
	|		втДанныеПорученийНаВыплатуПоЦБСША.Количество,
	|		втДанныеПорученийНаВыплатуПоЦБСША.СтавкаНалога,
	|		втДанныеПорученийНаВыплатуПоЦБСША.СтатусПоГлаве4,
	|		втДанныеПорученийНаВыплатуПоЦБСША.Контрагент,
	|		втДанныеПорученийНаВыплатуПоЦБСША.ЭтоСубброкер,
	|		втДанныеПорученийНаВыплатуПоЦБСША.ЭтоУправляющаяКомпания,
	|		втДанныеПорученийНаВыплатуПоЦБСША.ВидКД,
	|		втДанныеПорученийНаВыплатуПоЦБСША.ДополнительныеУдержания) КАК ДанныеПорученийWTRC
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|		ПО ДанныеПорученийWTRC.СвязанноеКДWTRC = РаскрытиеСпискаВладельцев.КарточкаКД
	|			И (НЕ РаскрытиеСпискаВладельцев.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втДанныеВыплатПоЦБСША";
	
КонецФункции

Функция ТекстЗапросаВыборкаРаскрытийОбщихРазделовСубброкеров()
	
	Возврат
	"ВЫБРАТЬ
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Поручение КАК Поручение,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЦеннаяБумага КАК ЦеннаяБумага,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СчетДепо КАК СчетДепо,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепо КАК РазделСчетаДепо,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СчетДепоМХ КАК СчетДепоМХ,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Сумма КАК Сумма,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СуммаНалога КАК СуммаНалога,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СуммаКВыплатеПоИПД КАК СуммаКВыплатеПоИПД,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.КорпоративноеДействие КАК КорпоративноеДействие,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СвязанноеКДWTRC КАК СвязанноеКДWTRC,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ДатаФиксации КАК ДатаФиксации,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РСВ КАК РСВ,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Количество КАК Количество,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СтавкаНалога КАК СтавкаНалога,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СтатусПоГлаве4 КАК СтатусПоГлаве4,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Контрагент КАК Контрагент,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоСубброкер КАК ЭтоСубброкер,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоУправляющаяКомпания КАК ЭтоУправляющаяКомпания
	|ИЗ
	|	втДанныеВыплатПоЦБСШАИРаскрытий КАК втДанныеВыплатПоЦБСШАИРаскрытий
	|ГДЕ
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоСубброкер
	|	И НЕ втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепо.РазделСубклиента
	|ИТОГИ ПО
	|	РСВ";
	
КонецФункции

Функция ТекстЗапросаДетальныеЗаписиПоВыплатамИФормамW8()
	
	Возврат
	"ВЫБРАТЬ
	|	ДанныеСубклиентовОбщиеРазделы.РСВ КАК РСВ,
	|	ДанныеСубклиентовОбщиеРазделы.Клиент КАК Клиент,
	|	ДанныеСубклиентовОбщиеРазделы.СчетДепо КАК СчетДепо,
	|	ДанныеСубклиентовОбщиеРазделы.СчетДепоМХ КАК СчетДепоМХ,
	|	ДанныеСубклиентовОбщиеРазделы.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ДанныеСубклиентовОбщиеРазделы.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ДанныеСубклиентовОбщиеРазделы.Количество КАК Количество,
	|	ДанныеСубклиентовОбщиеРазделы.W8BENE_W8BEN КАК W8BENE_W8BEN,
	|	ДанныеСубклиентовОбщиеРазделы.W8IMY КАК W8IMY,
	|	ДанныеСубклиентовОбщиеРазделы.Субклиент КАК Субклиент,
	|	ДанныеСубклиентовОбщиеРазделы.НалоговаяСтавка КАК НалоговаяСтавка,
	|	ДанныеСубклиентовОбщиеРазделы.СтатусПоГлаве4 КАК СтатусПоГлаве4,
	|	ДанныеСубклиентовОбщиеРазделы.Поручение КАК Поручение
	|ПОМЕСТИТЬ втОбщиеРазделыСРСВ
	|ИЗ
	|	&ДанныеСубклиентовОбщиеРазделы КАК ДанныеСубклиентовОбщиеРазделы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Поручение КАК Поручение,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЦеннаяБумага КАК ЦеннаяБумага,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СчетДепо КАК СчетДепо,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепо КАК РазделСчетаДепо,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СчетДепоМХ КАК СчетДепоМХ,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Сумма КАК Сумма,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СуммаНалога КАК СуммаНалога,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СуммаКВыплатеПоИПД КАК СуммаКВыплатеПоИПД,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.КорпоративноеДействие КАК КорпоративноеДействие,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СвязанноеКДWTRC КАК СвязанноеКДWTRC,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ДатаФиксации КАК ДатаФиксации,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РСВ КАК РСВ,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Количество КАК Количество,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СтавкаНалога КАК СтавкаНалога,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СтатусПоГлаве4 КАК СтатусПоГлаве4,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Контрагент КАК Контрагент,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Количество = ЕСТЬNULL(ИтогиПоРазделамОбщиеРазделыСРСВ.Количество, 0) КАК КоличествоРаскрытиеБезРасхождений,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоСубброкер КАК ЭтоСубброкер,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоУправляющаяКомпания КАК ЭтоУправляющаяКомпания,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ВидКД КАК ВидКД,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ДополнительныеУдержания КАК ДополнительныеУдержания,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ДатаВыплатыНеПозднее КАК ДатаВыплатыНеПозднее
	|ПОМЕСТИТЬ втОбщиеРазделыВыплаты
	|ИЗ
	|	втДанныеВыплатПоЦБСШАИРаскрытий КАК втДанныеВыплатПоЦБСШАИРаскрытий
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			втОбщиеРазделыСРСВ.РСВ КАК РСВ,
	|			втОбщиеРазделыСРСВ.Клиент КАК Клиент,
	|			втОбщиеРазделыСРСВ.СчетДепо КАК СчетДепо,
	|			втОбщиеРазделыСРСВ.РазделСчетаДепо КАК РазделСчетаДепо,
	|			СУММА(втОбщиеРазделыСРСВ.Количество) КАК Количество,
	|			втОбщиеРазделыСРСВ.НалоговаяСтавка КАК НалоговаяСтавка,
	|			втОбщиеРазделыСРСВ.СтатусПоГлаве4 КАК СтатусПоГлаве4,
	|			втОбщиеРазделыСРСВ.Поручение КАК Поручение
	|		ИЗ
	|			втОбщиеРазделыСРСВ КАК втОбщиеРазделыСРСВ
	|		
	|		СГРУППИРОВАТЬ ПО
	|			втОбщиеРазделыСРСВ.НалоговаяСтавка,
	|			втОбщиеРазделыСРСВ.Поручение,
	|			втОбщиеРазделыСРСВ.РСВ,
	|			втОбщиеРазделыСРСВ.РазделСчетаДепо,
	|			втОбщиеРазделыСРСВ.Клиент,
	|			втОбщиеРазделыСРСВ.СчетДепо,
	|			втОбщиеРазделыСРСВ.СтатусПоГлаве4) КАК ИтогиПоРазделамОбщиеРазделыСРСВ
	|		ПО втДанныеВыплатПоЦБСШАИРаскрытий.РСВ = ИтогиПоРазделамОбщиеРазделыСРСВ.РСВ
	|			И втДанныеВыплатПоЦБСШАИРаскрытий.Поручение = ИтогиПоРазделамОбщиеРазделыСРСВ.Поручение
	|			И втДанныеВыплатПоЦБСШАИРаскрытий.Контрагент = ИтогиПоРазделамОбщиеРазделыСРСВ.Клиент
	|			И втДанныеВыплатПоЦБСШАИРаскрытий.СчетДепо = ИтогиПоРазделамОбщиеРазделыСРСВ.СчетДепо
	|			И втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепо = ИтогиПоРазделамОбщиеРазделыСРСВ.РазделСчетаДепо
	|			И втДанныеВыплатПоЦБСШАИРаскрытий.СтавкаНалога = ИтогиПоРазделамОбщиеРазделыСРСВ.НалоговаяСтавка
	|			И втДанныеВыплатПоЦБСШАИРаскрытий.СтатусПоГлаве4 = ИтогиПоРазделамОбщиеРазделыСРСВ.СтатусПоГлаве4
	|ГДЕ
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоСубброкер
	|	И НЕ ВЫРАЗИТЬ(втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепо КАК Справочник.РазделыСчетаДепо).РазделСубклиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Поручение КАК Поручение,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЦеннаяБумага КАК ЦеннаяБумага,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СчетДепо КАК СчетДепо,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепо КАК РазделСчетаДепо,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СчетДепоМХ КАК СчетДепоМХ,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Сумма КАК Сумма,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СуммаНалога КАК СуммаНалога,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СуммаКВыплатеПоИПД КАК СуммаКВыплатеПоИПД,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.КорпоративноеДействие КАК КорпоративноеДействие,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СвязанноеКДWTRC КАК СвязанноеКДWTRC,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ДатаФиксации КАК ДатаФиксации,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РСВ КАК РСВ,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Количество КАК Количество,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СтавкаНалога КАК СтавкаНалога,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СтатусПоГлаве4 КАК СтатусПоГлаве4,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Контрагент КАК Контрагент,
	|	ПредоставленныеДокументыW8BEN_W8BENE.ПредоставленнаяФорма КАК W8BENE_W8BEN,
	|	ЗНАЧЕНИЕ(Справочник.ФормыW8.ПустаяСсылка) КАК W8IMY,
	|	ИСТИНА КАК КоличествоРаскрытиеБезРасхождений,
	|	"""" КАК Субклиент,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоСубброкер КАК ЭтоСубброкер,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоУправляющаяКомпания КАК ЭтоУправляющаяКомпания,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ВидКД КАК ВидКД,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ДополнительныеУдержания КАК ДополнительныеУдержания,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ДатаВыплатыНеПозднее КАК ДатаВыплатыНеПозднее
	|ПОМЕСТИТЬ втДанныеВыплатИОпределениеФормW8
	|ИЗ
	|	втДанныеВыплатПоЦБСШАИРаскрытий КАК втДанныеВыплатПоЦБСШАИРаскрытий
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредоставленныеДокументы КАК ПредоставленныеДокументыW8BEN_W8BENE
	|		ПО втДанныеВыплатПоЦБСШАИРаскрытий.Контрагент = ПредоставленныеДокументыW8BEN_W8BENE.Депонент
	|			И (ПредоставленныеДокументыW8BEN_W8BENE.ВидДокумента = &W8BENE_W8BEN)
	|			И (втДанныеВыплатПоЦБСШАИРаскрытий.ДатаФиксации МЕЖДУ ПредоставленныеДокументыW8BEN_W8BENE.ДатаПредоставления И ПредоставленныеДокументыW8BEN_W8BENE.СрокДействия)
	|			И (НЕ ПредоставленныеДокументыW8BEN_W8BENE.ПредоставленнаяФорма.ПометкаУдаления)
	|ГДЕ
	|	НЕ втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоСубброкер
	|	И НЕ втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоУправляющаяКомпания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Поручение,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЦеннаяБумага,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СчетДепо,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепо,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СчетДепоМХ,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепоМХ,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Сумма,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СуммаНалога,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СуммаКВыплатеПоИПД,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.КорпоративноеДействие,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СвязанноеКДWTRC,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ДатаФиксации,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РСВ,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Количество,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СтавкаНалога,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СтатусПоГлаве4,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Контрагент,
	|	ПредоставленныеДокументыW8BEN_W8BENE.ПредоставленнаяФорма,
	|	ФормыW8IMY.Ссылка,
	|	ИСТИНА,
	|	"""",
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоСубброкер,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоУправляющаяКомпания,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ВидКД,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ДополнительныеУдержания,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ДатаВыплатыНеПозднее
	|ИЗ
	|	втДанныеВыплатПоЦБСШАИРаскрытий КАК втДанныеВыплатПоЦБСШАИРаскрытий
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредоставленныеДокументы КАК ПредоставленныеДокументыW8BEN_W8BENE
	|		ПО втДанныеВыплатПоЦБСШАИРаскрытий.Контрагент = ПредоставленныеДокументыW8BEN_W8BENE.Депонент
	|			И (ПредоставленныеДокументыW8BEN_W8BENE.ВидДокумента = &W8BENE_W8BEN)
	|			И (втДанныеВыплатПоЦБСШАИРаскрытий.ДатаФиксации МЕЖДУ ПредоставленныеДокументыW8BEN_W8BENE.ДатаПредоставления И ПредоставленныеДокументыW8BEN_W8BENE.СрокДействия)
	|			И (НЕ ПредоставленныеДокументыW8BEN_W8BENE.ПредоставленнаяФорма.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФормыW8 КАК ФормыW8IMY
	|		ПО (ПредоставленныеДокументыW8BEN_W8BENE.ПредоставленнаяФорма.Посредник = (ВЫРАЗИТЬ(ФормыW8IMY.Лицо КАК Справочник.ЮридическиеЛица)))
	|			И (ФормыW8IMY.ТипФормы = &ТипФормыW8IMY)
	|			И (втДанныеВыплатПоЦБСШАИРаскрытий.ДатаФиксации МЕЖДУ ФормыW8IMY.ДатаПредоставления И ФормыW8IMY.СрокДействия)
	|			И (НЕ ФормыW8IMY.ПометкаУдаления)
	|ГДЕ
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоУправляющаяКомпания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Поручение,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЦеннаяБумага,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СчетДепо,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепо,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СчетДепоМХ,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепоМХ,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Сумма,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СуммаНалога,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СуммаКВыплатеПоИПД,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.КорпоративноеДействие,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СвязанноеКДWTRC,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ДатаФиксации,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РСВ,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Количество,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СтавкаНалога,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.СтатусПоГлаве4,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.Контрагент,
	|	ПредоставленныеДокументыW8BEN_W8BENE.ПредоставленнаяФорма,
	|	ФормыW8IMY.Ссылка,
	|	ИСТИНА,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепо.Субклиент,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоСубброкер,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоУправляющаяКомпания,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ВидКД,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ДополнительныеУдержания,
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ДатаВыплатыНеПозднее
	|ИЗ
	|	втДанныеВыплатПоЦБСШАИРаскрытий КАК втДанныеВыплатПоЦБСШАИРаскрытий
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредоставленныеДокументы КАК ПредоставленныеДокументыW8BEN_W8BENE
	|		ПО втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепо.Субклиент = ПредоставленныеДокументыW8BEN_W8BENE.Депонент
	|			И (ПредоставленныеДокументыW8BEN_W8BENE.ВидДокумента = &W8BENE_W8BEN)
	|			И (втДанныеВыплатПоЦБСШАИРаскрытий.ДатаФиксации МЕЖДУ ПредоставленныеДокументыW8BEN_W8BENE.ДатаПредоставления И ПредоставленныеДокументыW8BEN_W8BENE.СрокДействия)
	|			И (НЕ ПредоставленныеДокументыW8BEN_W8BENE.ПредоставленнаяФорма.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФормыW8 КАК ФормыW8IMY
	|		ПО (втДанныеВыплатПоЦБСШАИРаскрытий.Контрагент.ЮридическиеФизическиеЛица = (ВЫРАЗИТЬ(ФормыW8IMY.Лицо КАК Справочник.ЮридическиеЛица)))
	|			И (ФормыW8IMY.ТипФормы = &ТипФормыW8IMY)
	|			И (втДанныеВыплатПоЦБСШАИРаскрытий.ДатаФиксации МЕЖДУ ФормыW8IMY.ДатаПредоставления И ФормыW8IMY.СрокДействия)
	|			И (НЕ ФормыW8IMY.ПометкаУдаления)
	|ГДЕ
	|	втДанныеВыплатПоЦБСШАИРаскрытий.ЭтоСубброкер
	|	И втДанныеВыплатПоЦБСШАИРаскрытий.РазделСчетаДепо.РазделСубклиента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втОбщиеРазделыВыплаты.Поручение,
	|	втОбщиеРазделыВыплаты.ЦеннаяБумага,
	|	втОбщиеРазделыВыплаты.СчетДепо,
	|	втОбщиеРазделыВыплаты.РазделСчетаДепо,
	|	втОбщиеРазделыВыплаты.СчетДепоМХ,
	|	втОбщиеРазделыВыплаты.РазделСчетаДепоМХ,
	|	ВЫБОР
	|		КОГДА втОбщиеРазделыВыплаты.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ втОбщиеРазделыВыплаты.Сумма / втОбщиеРазделыВыплаты.Количество * втОбщиеРазделыСРСВ.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА втОбщиеРазделыВыплаты.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ втОбщиеРазделыВыплаты.СуммаНалога / втОбщиеРазделыВыплаты.Количество * втОбщиеРазделыСРСВ.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА втОбщиеРазделыВыплаты.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ втОбщиеРазделыВыплаты.СуммаКВыплатеПоИПД / втОбщиеРазделыВыплаты.Количество * втОбщиеРазделыСРСВ.Количество
	|	КОНЕЦ,
	|	втОбщиеРазделыВыплаты.КорпоративноеДействие,
	|	втОбщиеРазделыВыплаты.СвязанноеКДWTRC,
	|	втОбщиеРазделыВыплаты.ДатаФиксации,
	|	втОбщиеРазделыВыплаты.РСВ,
	|	втОбщиеРазделыСРСВ.Количество,
	|	втОбщиеРазделыВыплаты.СтавкаНалога,
	|	втОбщиеРазделыВыплаты.СтатусПоГлаве4,
	|	втОбщиеРазделыВыплаты.Контрагент,
	|	втОбщиеРазделыСРСВ.W8BENE_W8BEN,
	|	втОбщиеРазделыСРСВ.W8IMY,
	|	втОбщиеРазделыВыплаты.КоличествоРаскрытиеБезРасхождений,
	|	втОбщиеРазделыСРСВ.Субклиент,
	|	втОбщиеРазделыВыплаты.ЭтоСубброкер,
	|	втОбщиеРазделыВыплаты.ЭтоУправляющаяКомпания,
	|	втОбщиеРазделыВыплаты.ВидКД,
	|	ВЫБОР
	|		КОГДА втОбщиеРазделыВыплаты.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ втОбщиеРазделыВыплаты.ДополнительныеУдержания / втОбщиеРазделыВыплаты.Количество * втОбщиеРазделыСРСВ.Количество
	|	КОНЕЦ,
	|	втОбщиеРазделыВыплаты.ДатаВыплатыНеПозднее
	|ИЗ
	|	втОбщиеРазделыВыплаты КАК втОбщиеРазделыВыплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОбщиеРазделыСРСВ КАК втОбщиеРазделыСРСВ
	|		ПО втОбщиеРазделыВыплаты.РСВ = втОбщиеРазделыСРСВ.РСВ
	|			И втОбщиеРазделыВыплаты.Поручение = втОбщиеРазделыСРСВ.Поручение
	|			И втОбщиеРазделыВыплаты.Контрагент = втОбщиеРазделыСРСВ.Клиент
	|			И втОбщиеРазделыВыплаты.СчетДепо = втОбщиеРазделыСРСВ.СчетДепо
	|			И втОбщиеРазделыВыплаты.РазделСчетаДепо = втОбщиеРазделыСРСВ.РазделСчетаДепо
	|			И втОбщиеРазделыВыплаты.СтатусПоГлаве4 = втОбщиеРазделыСРСВ.СтатусПоГлаве4
	|			И втОбщиеРазделыВыплаты.СтавкаНалога = втОбщиеРазделыСРСВ.НалоговаяСтавка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТипыВыплатIRS.Ссылка КАК КодВыплаты,
	|	втДанныеВыплатИОпределениеФормW8.Поручение КАК Поручение,
	|	втДанныеВыплатИОпределениеФормW8.ЦеннаяБумага КАК ЦеннаяБумага,
	|	втДанныеВыплатИОпределениеФормW8.СчетДепо КАК СчетДепо,
	|	втДанныеВыплатИОпределениеФормW8.РазделСчетаДепо КАК РазделСчетаДепо,
	|	втДанныеВыплатИОпределениеФормW8.СчетДепоМХ КАК СчетДепоМХ,
	|	втДанныеВыплатИОпределениеФормW8.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	втДанныеВыплатИОпределениеФормW8.Сумма КАК Доход,
	|	втДанныеВыплатИОпределениеФормW8.СуммаНалога КАК УдержанныйНалог,
	|	втДанныеВыплатИОпределениеФормW8.СуммаКВыплатеПоИПД КАК ЧистыйДоход,
	|	втДанныеВыплатИОпределениеФормW8.КорпоративноеДействие КАК КорпоративноеДействие,
	|	втДанныеВыплатИОпределениеФормW8.СвязанноеКДWTRC КАК СвязанноеКДWTRC,
	|	втДанныеВыплатИОпределениеФормW8.ДатаФиксации КАК ДатаФиксации,
	|	втДанныеВыплатИОпределениеФормW8.РСВ КАК РСВ,
	|	втДанныеВыплатИОпределениеФормW8.Количество КАК Количество,
	|	втДанныеВыплатИОпределениеФормW8.СтавкаНалога КАК СтавкаНалога,
	|	втДанныеВыплатИОпределениеФормW8.СтатусПоГлаве4 КАК СтатусПоГлаве4,
	|	втДанныеВыплатИОпределениеФормW8.Контрагент КАК Контрагент,
	|	втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN КАК W8BENE_W8BEN,
	|	втДанныеВыплатИОпределениеФормW8.W8IMY КАК W8IMY,
	|	втДанныеВыплатИОпределениеФормW8.КоличествоРаскрытиеБезРасхождений КАК КоличествоРаскрытиеБезРасхождений,
	|	втДанныеВыплатИОпределениеФормW8.Субклиент КАК Субклиент,
	|	втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.НаименованиеЛицаАнгл КАК НаименованиеКонечногоБенефициара,
	|	ВЫБОР
	|		КОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.ТипФормы = &ТипФормыW8BEN
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.СтранаНалоговогоРезиденстваЛица
	|		КОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.ТипФормы = &ТипФормыW8BENE
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.СтранаНалоговогоРезидентстваВыгодоприобретателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяССылка)
	|	КОНЕЦ КАК Страна,
	|	втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.АдресПМЖ_АдресДом КАК Адрес1,
	|	втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.АдресПМЖ_Город КАК Адрес2,
	|	втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.ИНН_TIN КАК ИНН_TIN,
	|	втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.СтатусПоГлаве3USTAXCODE КАК СтатусПоГлаве3USTAXCODE,
	|	ВЫБОР
	|		КОГДА втДанныеВыплатИОпределениеФормW8.СтатусПоГлаве4 = &ТекстINDV
	|			ТОГДА &INDV
	|		ИНАЧЕ втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.СтатусПоГлаве4USTAXCODE
	|	КОНЕЦ КАК СтатусПоГлаве4USTAXCODE,
	|	ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) КАК Пул,
	|	3 КАК ChapterIndicator,
	|	ВЫБОР
	|		КОГДА втДанныеВыплатИОпределениеФормW8.СтавкаНалога = 0
	|			ТОГДА ""04""
	|		ИНАЧЕ ""00""
	|	КОНЕЦ КАК ExemptionСode3,
	|	втДанныеВыплатИОпределениеФормW8.СтавкаНалога КАК TaxRate3,
	|	""15"" КАК ExemptionСode4,
	|	""00"" КАК TaxRate4,
	|	0 КАК WithholdingAllowance,
	|	"""" КАК Check7b,
	|	"""" КАК Check7c,
	|	0 КАК TaxWithheldByOtherAgents,
	|	0 КАК OverwithheldTaxRepaidToRecipientPursuantToAdjustment,
	|	втДанныеВыплатИОпределениеФормW8.СуммаНалога КАК TotalWithholdingCredit,
	|	0 КАК TaxPaidByWithholdingAgent,
	|	&QI_EIN КАК WithholdingAgentsEIN,
	|	ФормыW8IMYДляВТБКБ.СтатусПоГлаве3USTAXCODE.Код КАК Chapter3ВТБКБКод,
	|	ФормыW8IMYДляВТБКБ.СтатусПоГлаве4USTAXCODE.Код КАК Chapter4ВТБКБКод,
	|	ФормыW8IMYДляВТБКБ.НаименованиеЛицаАнгл КАК WithholdingAgentsName,
	|	ФормыW8IMYДляВТБКБ.GIINЛица КАК WIthholdingAgentsGIIN,
	|	ФормыW8IMYДляВТБКБ.СтранаРегистрации.КодИРС КАК CountryCodeВТБКБ,
	|	ФормыW8IMYДляВТБКБ.ИНН_TIN КАК ForeignTaxIdentificationNumber,
	|	ФормыW8IMYДляВТБКБ.АдресПМЖ_АдресДом КАК AdressВТБКБ,
	|	ФормыW8IMYДляВТБКБ.АдресПМЖ_Город КАК CityOrTownВТБКБ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.НаименованиеЛицаАнгл
	|		ИНАЧЕ ""Withholding Rate Pool""
	|	КОНЕЦ КАК RecipientsName,
	|	втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.АдресПМЖ_Страна КАК RecipientsCountry,
	|	ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.АдресПМЖ_Страна.КодИРС, """") КАК RecipientsCountryCode,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.АдресПМЖ_АдресДом
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК RecipientsAdress,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.АдресПМЖ_Город
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК RecipientsCityOrTown,
	|	"""" КАК RecipientsTIN,
	|	втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.СтатусПоГлаве3USTAXCODE КАК RecipientsChapter3,
	|	втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.СтатусПоГлаве4USTAXCODE КАК RecipientsChapter4,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.GIINЛица
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК RecipientsGIIN,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.ИНН_TIN
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК RecipientsForeignTax,
	|	"""" КАК LOBCode,
	|	"""" КАК RecipientsAccountNumber,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.ДатаРождения
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК RecipientsDateOfBirth,
	|	""National Settlement Depository"" КАК PrimaryWithholdingAgentsName,
	|	980242512 КАК PrimaryWithholdingAgentsEIN,
	|	"""" КАК Check15,
	|	"""" КАК IntermediaryEIN,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8IMY.СтатусПоГлаве3USTAXCODE.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК W8IMYСтатусПоГлаве3USTAXCODEКод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8IMY.СтатусПоГлаве4USTAXCODE.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК W8IMYСтатусПоГлаве4USTAXCODEКод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8IMY.НаименованиеЛицаАнгл
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК IntermediaryName,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8IMY.GIINЛица
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК IntermediaryGIIN,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8IMY.СтранаРегистрации.КодИРС
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК IntermediaryCountryCode,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8IMY.ИНН_TIN
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК IntermediaryForeignTaxIdentificationNumber,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8IMY.АдресПМЖ_АдресДом
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК IntermediaryAdress,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8IMY.АдресПМЖ_Город
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК IntermediaryCityOrTown,
	|	"""" КАК PayersName,
	|	"""" КАК PayersTIN,
	|	"""" КАК PayersGIIN,
	|	"""" КАК PayersChapter3,
	|	"""" КАК PayersChapter4,
	|	0 КАК PayersStateIncomeTaxWithheld,
	|	"""" КАК PayersStateTaxNo,
	|	"""" КАК PayersNameOfState,
	|	ТипыВыплатIRS.Код КАК КодВыплатыКод,
	|	втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.СтатусПоГлаве3USTAXCODE.Код КАК СтатусПоГлаве3USTAXCODEКод,
	|	ВЫБОР
	|		КОГДА втДанныеВыплатИОпределениеФормW8.СтатусПоГлаве4 = &ТекстINDV
	|			ТОГДА ВЫРАЗИТЬ(&INDV КАК Справочник.СтатусыUSTAXCODEгл4).Код
	|		ИНАЧЕ втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.СтатусПоГлаве4USTAXCODE.Код
	|	КОНЕЦ КАК СтатусПоГлаве4USTAXCODEКод,
	|	втДанныеВыплатИОпределениеФормW8.ВидКД КАК ВидКД,
	|	втДанныеВыплатИОпределениеФормW8.ДополнительныеУдержания КАК ДополнительныеУдержания,
	|	ВЫБОР
	|		КОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.ТипФормы = &ТипФормыW8BEN
	|			ТОГДА ЛОЖЬ
	|		КОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.ТипФормы = &ТипФормыW8BENE
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоЮрЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN, ЗНАЧЕНИЕ(Справочник.Формыw8.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Формыw8.ПустаяСсылка)
	|	КОНЕЦ КАК W8BENE_W8BENДля1042S,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8IMY, ЗНАЧЕНИЕ(Справочник.Формыw8.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Формыw8.ПустаяСсылка)
	|	КОНЕЦ КАК W8IMYДля1042S,
	|	ФормыW8IMYДляВТБКБ.Ссылка КАК W8IMYДляВТБКБ,
	|	втДанныеВыплатИОпределениеФормW8.ЭтоСубброкер КАК ЭтоСубброкер,
	|	втДанныеВыплатИОпределениеФормW8.ЭтоУправляющаяКомпания КАК ЭтоУправляющаяКомпания,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.АдресПМЖ_Индекс, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК RecipientsZipCode,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.Пул, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8IMY.АдресПМЖ_Индекс
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК IntermediaryZipCode,
	|	втДанныеВыплатИОпределениеФормW8.ДатаВыплатыНеПозднее КАК ДатаВыплатыНеПозднее,
	|	ФормыW8IMYДляВТБКБ.АдресПМЖ_Индекс КАК ZIPCodeВТБКБ,
	|	втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.АдресПМЖ_Страна КАК СтранаПроживания,
	|	ВЫБОР
	|		КОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.ТипФормы = &ТипФормыW8BEN
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.СтранаНалоговогоРезиденстваЛица
	|		КОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.ТипФормы = &ТипФормыW8BENE
	|			ТОГДА втДанныеВыплатИОпределениеФормW8.W8BENE_W8BEN.СтранаНалоговогоРезидентстваВыгодоприобретателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяССылка)
	|	КОНЕЦ КАК СтранаНалогооблажения
	|ПОМЕСТИТЬ втДетальныеЗаписиПоВыплатамИФормамW8
	|ИЗ
	|	втДанныеВыплатИОпределениеФормW8 КАК втДанныеВыплатИОпределениеФормW8
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФормыW8 КАК ФормыW8IMYДляВТБКБ
	|		ПО (ФормыW8IMYДляВТБКБ.ТипФормы = &ТипФормыW8IMY)
	|			И (ФормыW8IMYДляВТБКБ.Лицо = &ЮЛВТБКБ)
	|			И (НЕ ФормыW8IMYДляВТБКБ.ПометкаУдаления)
	|			И (втДанныеВыплатИОпределениеФормW8.ДатаВыплатыНеПозднее МЕЖДУ ФормыW8IMYДляВТБКБ.ДатаПредоставления И ФормыW8IMYДляВТБКБ.СрокДействия)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыВыплатIRS КАК ТипыВыплатIRS
	|		ПО втДанныеВыплатИОпределениеФормW8.ВидКД = ТипыВыплатIRS.ВидКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втОбщиеРазделыСРСВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втОбщиеРазделыВыплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втДанныеВыплатИОпределениеФормW8
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДетальныеЗаписиПоВыплатамИФормамW8.Контрагент КАК Контрагент,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.Субклиент КАК Субклиент,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.W8BENE_W8BEN КАК W8BENE_W8BEN,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.W8IMY КАК W8IMY,
	|	втДетальныеЗаписиПоВыплатамИФормамW8.W8IMYДляВТБКБ КАК W8IMYДляВТБКБ,
	|	НАЧАЛОПЕРИОДА(втДетальныеЗаписиПоВыплатамИФормамW8.ДатаФиксации, ДЕНЬ) КАК ДатаФиксации,
	|	ВЫРАЗИТЬ(втДетальныеЗаписиПоВыплатамИФормамW8.Контрагент КАК Справочник.Контрагенты).Код КАК КодКонтрагента,
	|	НЕ втДетальныеЗаписиПоВыплатамИФормамW8.ЭтоСубброкер
	|		И НЕ втДетальныеЗаписиПоВыплатамИФормамW8.ЭтоУправляющаяКомпания КАК ЭтоПрямойКлиент
	|ИЗ
	|	втДетальныеЗаписиПоВыплатамИФормамW8 КАК втДетальныеЗаписиПоВыплатамИФормамW8
	|ГДЕ
	|	(втДетальныеЗаписиПоВыплатамИФормамW8.W8BENE_W8BEN.Ссылка ЕСТЬ NULL
	|			ИЛИ втДетальныеЗаписиПоВыплатамИФормамW8.W8IMY.Ссылка ЕСТЬ NULL
	|				И (втДетальныеЗаписиПоВыплатамИФормамW8.ЭтоСубброкер
	|					ИЛИ втДетальныеЗаписиПоВыплатамИФормамW8.ЭтоУправляющаяКомпания)
	|			ИЛИ втДетальныеЗаписиПоВыплатамИФормамW8.W8IMYДляВТБКБ.Ссылка ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодКонтрагента,
	|	ДатаФиксации";
	
КонецФункции

//Возвращает значение QI-EIN из организации по умолчанию
// 
// Возвращаемое значение:
//  Строка - значение QI-EIN
//
Функция QI_EINПоУмолчанию() Экспорт
	
	ОрганизацияПоУмолчанию = ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию();
	QI_EIN = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОрганизацияПоУмолчанию, "QI_EIN");
	Возврат QI_EIN;
	
КонецФункции

//Возвращает значение TCC код (IRS США) из организации по умолчанию
// 
// Возвращаемое значение:
//  Строка - значение TCC код (IRS США)
//
Функция TCCКод_IRSСШАПоУмолчанию() Экспорт
	
	ОрганизацияПоУмолчанию = ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию();
	TCCКод = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОрганизацияПоУмолчанию, "TCCКод_IRSСША");
	Возврат TCCКод;
	
КонецФункции

