
&НаКлиенте
Процедура ЗафиксироватьСообщения(Команда)
	ЗафиксироватьСообщенияСервер();
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьСообщенияСервер()
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.ЗафиксироватьСообщенияКД(Объект.ДатаНач, Объект.ДатаКон, Объект.ВремяЗаписи);
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ДатаНач = ТекущаяДата();
	Объект.ДатаКон = ТекущаяДата();
	Объект.ВремяЗаписи = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Период = Новый СтандартныйПериод(Объект.ДатаНач,  ?(Объект.ДатаКон=Дата("00010101"), Объект.ДатаКон, КонецДня(Объект.ДатаКон)));
	Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Период = Период;
	Если Диалог.Редактировать() Тогда 
		Объект.ДатаНач = Диалог.Период.ДатаНачала;
		Объект.ДатаКон = Диалог.Период.ДатаОкончания;
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	ПолучитьДанныеСервер();
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеСервер()
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.ПолучитьДанные(Объект.ДатаНач, Объект.ДатаКон);
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
КонецПроцедуры
