Процедура НайтиПоручения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса();
	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ДатаФормирования));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ДатаФормирования));
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = НеттоПоручения.Добавить();
		НоваяСтрока.Документ = Выборка.Документ;
		
		//«ДОФР» + НеттоПоручение.Депонент.Код + НеттоПоручение.Депонент.Наименование
		ТелоПисьма =
		"Блок депонент-----------------------------
		|ДОФР " + СокрЛП(Выборка.ДепонентКод) + " " + СокрЛП(Выборка.Депонент) + "
		|Место хранения : " + Выборка.МестоХраненияНаименование + "
		|Счет депо МХ : " + Выборка.СчетДепоМХКод + "
		|Раздел cчета депо МХ : " + Выборка.РазделСчетаДепоМХКод + "
		|------------------------------------------
		|Ценная бумага : " + Выборка.ЦеннаяБумагаНаименование + "
		|ISIN : " + Выборка.ЦеннаяБумагаISIN + "
		|Банковский счет : " + Выборка.БанковскийСчет + "
		|" + Выборка.НомерБанковскогоСчета + "
		|Плановая дата расчетов : " + Формат(Выборка.ПланируемаяДатаРасчетов, "ДФ=dd.MM.yyyy") + "
		|Количество : " + Выборка.Количество + "
		|Сумма : " + Выборка.Сумма + "
		|Валюта : " + Выборка.ВалютаДенежныхСредств + "
		|" + ?(Выборка.Сумма>0, "Зачисление", ?(Выборка.Сумма<0, "Перечисление", "----")) + "
		|
		|Поручения на инвентарную операцию---------" + Символы.ПС;
					
		ВыборкаПоручения = Выборка.Выбрать();
		Пока ВыборкаПоручения.Следующий() Цикл
			ТелоПисьма = ТелоПисьма + "Поручение № " + СокрЛП(ВыборкаПоручения.НомерПоручения) + " от " + Формат(ВыборкаПоручения.ДатаПоручения, "ДФ=dd.MM.yyyy")
			+ "; Поручения Депо в ИЦ №" + СокрЛП(ВыборкаПоручения.НомерПорученияВБО) + Символы.ПС;
		КонецЦикла;
		
		НоваяСтрока.ТекстПисьма = ТелоПисьма;
	КонецЦикла;
	
КонецПроцедуры

Процедура ИсполнитьПоручения() Экспорт
	
	ПолучитьНастройкиОтправки();
	
	НастройкаОтправки = НастройкаДляОтправкиУведомленийПоПочте;

	Если Не ЗначениеЗаполнено(НастройкаОтправки) Тогда
		ЗаписьЖурналаРегистрации("Сообщение о нулевом неттинге", УровеньЖурналаРегистрации.Предупреждение,,, "Не заполнена настройка обмена данными <<Настройка сообщений о нулевом неттинге>> ");
	Иначе
		ТемаПисьма = "Сообщение о нулевом неттинге";
	КонецЕсли;
	
	ВсегоИсполнено = 0;
	ВсегоНеИсполнено = 0;
	
	ДатаВвода = Константы.ДатаВводаЧастичногоИсполненияИнвентарныхПоручений.Получить();
	
	Для Каждого СтрокаДокумента Из НеттоПоручения Цикл
		Попытка
			ДокументПоручение = СтрокаДокумента.Документ.ПолучитьОбъект();
			Если Не ЗначениеЗаполнено(ДокументПоручение.ДатаИсполнения) Тогда
				ДокументПоручение.ДатаИсполнения = ТекущаяДата();
				ДокументПоручение.Записать(РежимЗаписиДокумента.Проведение);
				
				Если ЗначениеЗаполнено(ДатаВвода) И ДокументПоручение.Дата >= ДатаВвода Тогда
					НачатьТранзакцию();
					ТекстОшибки = Документы.ИсполнениеПоручения.РезультатФормированияИсполненияПорученияНулевогоНеттинга(
						ДокументПоручение.Ссылка, ДокументПоручение.ВидОперации,
						ДокументПоручение.КодОтчетаВышестоящегоДепозитария, ДокументПоручение.ДатаИсполнения);
					
					Если ЗначениеЗаполнено(ТекстОшибки) Тогда
						ОтменитьТранзакцию();
						ЗаписьЖурналаРегистрации("Сообщение о нулевом неттинге", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
					Иначе
						ЗафиксироватьТранзакцию();
					КонецЕсли;
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("Сообщение о нулевом неттинге", УровеньЖурналаРегистрации.Информация,,, "Исполнен документ " + СтрокаДокумента.Документ);
				
				ВсегоИсполнено = ВсегоИсполнено + 1;
				
				Если ЗначениеЗаполнено(НастройкаОтправки) Тогда
					ОтправитьНаПочту(НастройкаОтправки, ТемаПисьма, СтрокаДокумента.ТекстПисьма);
				КонецЕсли;
			КонецЕсли;
		Исключение
			ЗаписьЖурналаРегистрации("Сообщение о нулевом неттинге", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось исполнить документ " + СтрокаДокумента.Документ);
			ВсегоНеИсполнено = ВсегоНеИсполнено + 1;
		КонецПопытки;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Исполнено " + Формат(ВсегоИсполнено, "ЧН=0; ЧГ=") + " поручений"
	+ ?(ВсегоНеИсполнено > 0, "; не исполнено " + Формат(ВсегоНеИсполнено, "ЧГ="), ""));
	
КонецПроцедуры

Процедура ПолучитьНастройкиОтправки() Экспорт

	Если не ЗначениеЗаполнено(ВнешнийИсточник) Тогда
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.НастройкиСообщенийОНулевомНеттинге;
	КонецЕсли;
	
	НастройкаДляОтправкиУведомленийПоПочте	= ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	АдресПолучателя = НастройкаДляОтправкиУведомленийПоПочте.АдресПолучателя;
	
КонецПроцедуры

Процедура ОтправитьНаПочту(НастройкаОтправки, ТемаПисьма, ТелоПисьма) 
	
	ПараметрыУведомления = Новый Соответствие;
	
	ПараметрыУведомления.Вставить("НастройкиОбмена"		, НастройкаОтправки);
	
	ПараметрыУведомления.Вставить("ТемаПисьма"			, ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма"			, ТелоПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма"		, ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Кодировка"			, "UTF-8");
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
	
КонецПроцедуры

Функция ТекстЗапроса()
	
	Возврат
	"ВЫБРАТЬ
	|	НеттоПоручения.Ссылка КАК Документ,
	|	НеттоПоручения.ВидОперации.Наименование КАК ВидОперацииНаименование,
	|	НеттоПоручения.МестоХранения.Наименование КАК МестоХраненияНаименование,
	|	НеттоПоручения.СчетДепоМХ.Код КАК СчетДепоМХКод,
	|	НеттоПоручения.РазделСчетаДепоМХ.Код КАК РазделСчетаДепоМХКод,
	|	НеттоПоручения.Контрагент.Наименование КАК КонтрагентНаименование,
	|	НеттоПоручения.СчетДепоКонтрагента.Наименование КАК СчетДепоКонтрагентаНаименование,
	|	НеттоПоручения.РазделСчетаДепоКонтрагента.Наименование КАК РазделСчетаДепоКонтрагентаНаименование,
	|	НеттоПоручения.МестоХраненияКонтрагента.Наименование КАК МестоХраненияКонтрагентаНаименование,
	|	НеттоПоручения.ЦеннаяБумага.Наименование КАК ЦеннаяБумагаНаименование,
	|	НеттоПоручения.ЦеннаяБумага.ISIN КАК ЦеннаяБумагаISIN,
	|	НеттоПоручения.ЦеннаяБумага.ВалютаНоминала КАК ЦеннаяБумагаВалютаНоминала,
	|	НеттоПоручения.Количество КАК Количество,
	|	НеттоПоручения.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА НеттоПоручения.Депонент ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(НеттоПоручения.Депонент КАК Справочник.Контрагенты).Код
	|		КОГДА НеттоПоручения.Депонент ССЫЛКА Справочник.Субклиенты
	|			ТОГДА ВЫРАЗИТЬ(НеттоПоручения.Депонент КАК Справочник.Субклиенты).Владелец.Код
	|	КОНЕЦ КАК ДепонентКод,
	|	НеттоПоручения.Депонент.Наименование КАК Депонент,
	|	НеттоПоручения.БанковскийСчет КАК БанковскийСчет,
	|	НеттоПоручения.БанковскийСчет.НомерСчета КАК НомерБанковскогоСчета,
	|	НеттоПоручения.БанковскийСчет.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	НеттоПоручения.ПланируемаяДатаРасчетов КАК ПланируемаяДатаРасчетов,
	|	НеттоПоручениеПоручения.Поручение КАК Поручение,
	|	НеттоПоручениеПоручения.Поручение.Дата КАК ДатаПоручения,
	|	НеттоПоручениеПоручения.Поручение.Номер КАК НомерПоручения,
	|	НеттоПоручениеПоручения.Поручение.НомерПорученияВБО КАК НомерПорученияВБО
	|ИЗ
	|	Документ.НеттоПоручение КАК НеттоПоручения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НеттоПоручение.Поручения КАК НеттоПоручениеПоручения
	|		ПО НеттоПоручения.Ссылка = НеттоПоручениеПоручения.Ссылка
	|ГДЕ
	|	НеттоПоручения.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НеттоПоручения.Проведен = ИСТИНА
	|	И НеттоПоручения.Количество = 0
	|	И НеттоПоручения.ДатаИсполнения = ДАТАВРЕМЯ(1, 1, 1)
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Поручение)
	|ПО
	|	Документ";
	
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
