////#Область ОписаниеПеременных
////#КонецОбласти 

////#Область ПрограммныйИнтерфейс
////#КонецОбласти 

////#Область ОбработчикиСобытийФормы
////#КонецОбласти

////#Область ОбработчикиСобытийЭлементовШапкиФормы
////#КонецОбласти

////#Область ОбработчикиСобытийЭлементовТаблицыФормы
////#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПредопределенные(Команда)
	ЗаполнитьПредопределенныеНаСервере();
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьПредопределенныеНаСервере()
	
	// Справочник "Контрагенты"
	Вид = Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты;
	ОбновитьВидКИ(1, 0, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,          "Юридический адрес", Ложь, Ложь, Перечисления.ТипыКонтактнойИнформации.Адрес,   Вид);
	ОбновитьВидКИ(2, 0, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента,        "Фактический адрес", Ложь, Ложь, Перечисления.ТипыКонтактнойИнформации.Адрес,   Вид);
	ОбновитьВидКИ(3, 0, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента,          "Телефон",           Ложь, Ложь, Перечисления.ТипыКонтактнойИнформации.Телефон, Вид);
	ОбновитьВидКИ(4, 0, Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияКонтрагента, "Другая информация", Ложь, Ложь, Перечисления.ТипыКонтактнойИнформации.Другое,  Вид);
	
	// Справочник "Организации"
	Вид = Перечисления.ВидыОбъектовКонтактнойИнформации.Организации;
	ОбновитьВидКИ(1, 2, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,           "Юридический адрес",                           Истина, Истина, Перечисления.ТипыКонтактнойИнформации.Адрес,                 Вид);
	ОбновитьВидКИ(2, 2, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации,         "Фактический адрес",                           Истина, Истина, Перечисления.ТипыКонтактнойИнформации.Адрес,                 Вид);
	ОбновитьВидКИ(3, 0, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,           "Телефон",                                       Ложь,   Ложь, Перечисления.ТипыКонтактнойИнформации.Телефон,               Вид);
	ОбновитьВидКИ(4, 1, Справочники.ВидыКонтактнойИнформации.ФаксОрганизации,              "Факс",                                          Ложь,   Ложь, Перечисления.ТипыКонтактнойИнформации.Телефон,               Вид);
	ОбновитьВидКИ(5, 0, Справочники.ВидыКонтактнойИнформации.АдресОрганизацииПочтовый,     "Почтовый адрес",                              Истина, Истина, Перечисления.ТипыКонтактнойИнформации.Адрес,                 Вид);
	ОбновитьВидКИ(6, 0, Справочники.ВидыКонтактнойИнформации.АдресИнострОрганизацииУчред,  "Учредительный адрес иностранной организации",   Ложь,   Ложь, Перечисления.ТипыКонтактнойИнформации.Адрес,                 Вид);
	ОбновитьВидКИ(7, 0, Справочники.ВидыКонтактнойИнформации.ТелефонПоЮрАдресуОрганизации, "Телефон по юридическому адресу",                Ложь,   Ложь, Перечисления.ТипыКонтактнойИнформации.Телефон,               Вид);
	ОбновитьВидКИ(8, 0, Справочники.ВидыКонтактнойИнформации.EmailОрганизации,             "Email",                                         Ложь,   Ложь, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Вид);
	ОбновитьВидКИ(9, 0, Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияОрганизации,  "Другая информация",                             Ложь,   Ложь, Перечисления.ТипыКонтактнойИнформации.Другое,                Вид);
	
	// Справочник "Пользователи"
	Вид = Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи;
	ОбновитьВидКИ(1, 0, Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя, "Служебный адрес электронной почты", Ложь, Ложь, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Вид);
	ОбновитьВидКИ(2, 0, Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияПользователя,               "Другая информация",                 Ложь, Ложь, Перечисления.ТипыКонтактнойИнформации.Другое,  Вид);
	
	// Справочник "Контактные лица"
	Вид = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛица;
	ОбновитьВидКИ(1, 0, Справочники.ВидыКонтактнойИнформации.ИнформАдресКонтактногоЛица,      "Адрес для информирования", Ложь, Ложь, Перечисления.ТипыКонтактнойИнформации.Адрес,   Вид);
	ОбновитьВидКИ(2, 0, Справочники.ВидыКонтактнойИнформации.ТелефонМобильный,                "Телефон мобильный",        Ложь, Ложь, Перечисления.ТипыКонтактнойИнформации.Телефон, Вид);
	ОбновитьВидКИ(3, 0, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица,          "Телефон рабочий",          Ложь, Ложь, Перечисления.ТипыКонтактнойИнформации.Телефон, Вид);
	ОбновитьВидКИ(4, 0, Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияКонтактногоЛица, "Другая информация",        Ложь, Ложь, Перечисления.ТипыКонтактнойИнформации.Другое,  Вид);
	
	// Справочник "Физические лица"
	Вид = Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица;
	ОбновитьВидКИ(1, 2, Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица,          "Адрес по прописке",        Истина, Истина, Перечисления.ТипыКонтактнойИнформации.Адрес,                 Вид);
	ОбновитьВидКИ(2, 2, Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица,        "Адрес проживания",         Истина, Истина, Перечисления.ТипыКонтактнойИнформации.Адрес,                 Вид);
	ОбновитьВидКИ(3, 0, Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица,          "Телефон",                    Ложь,   Ложь, Перечисления.ТипыКонтактнойИнформации.Телефон,               Вид);
	ОбновитьВидКИ(4, 2, Справочники.ВидыКонтактнойИнформации.ИнформАдресФизЛица,      "Адрес для информирования", Истина, Истина, Перечисления.ТипыКонтактнойИнформации.Адрес,                 Вид);
	ОбновитьВидКИ(5, 0, Справочники.ВидыКонтактнойИнформации.ИнострАдресФизЛица,      "Адрес за пределами РФ",      Ложь,   Ложь, Перечисления.ТипыКонтактнойИнформации.Адрес,                 Вид);
	ОбновитьВидКИ(6, 0, Справочники.ВидыКонтактнойИнформации.ТелефонСлужебныйФизЛица, "Телефон служебный",          Ложь,   Ложь, Перечисления.ТипыКонтактнойИнформации.Телефон,               Вид);
	ОбновитьВидКИ(7, 0, Справочники.ВидыКонтактнойИнформации.EmailФизЛица,            "Email",                      Ложь,   Ложь, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Вид);
	ОбновитьВидКИ(8, 0, Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияФизЛица, "Другая информация",          Ложь,   Ложь, Перечисления.ТипыКонтактнойИнформации.Другое,                Вид);
	
	// Справочник "ЮридическиеЛица"
	Вид = Перечисления.ВидыОбъектовКонтактнойИнформации.ЮридическиеЛица;
	ОбновитьВидКИ(1, 0, Справочники.ВидыКонтактнойИнформации.ЮрАдресЮрЛица,          "Юридический адрес", Ложь, Ложь, Перечисления.ТипыКонтактнойИнформации.Адрес,   Вид);
	ОбновитьВидКИ(2, 0, Справочники.ВидыКонтактнойИнформации.ФактАдресЮрЛица,        "Фактический адрес", Ложь, Ложь, Перечисления.ТипыКонтактнойИнформации.Адрес,   Вид);
	ОбновитьВидКИ(3, 0, Справочники.ВидыКонтактнойИнформации.ТелефонЮрЛица,        	 "Телефон", Ложь, Ложь, Перечисления.ТипыКонтактнойИнформации.Телефон,   Вид);
	ОбновитьВидКИ(4, 0, Справочники.ВидыКонтактнойИнформации.ФаксЮрЛица,        	 "Факс", Ложь, Ложь, Перечисления.ТипыКонтактнойИнформации.Телефон,   Вид);
	ОбновитьВидКИ(5, 0, Справочники.ВидыКонтактнойИнформации.EmailЮрЛица,        	 "Email", Ложь, Ложь, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,   Вид);
	
КонецПроцедуры

// Обновить один вид контактной информации
&НаСервереБезКонтекста
Процедура ОбновитьВидКИ(Порядок, НомерКартинки, Ссылка, Наименование, РедактированиеВДиалоге, МожноРедактироватьТолькоВДиалоге, Тип = Неопределено, Вид = Неопределено)

	Объект = Ссылка.ПолучитьОбъект();
//	Объект.Порядок                          = Порядок;
	Объект.Наименование                     = Наименование;
	//Объект.РедактированиеВДиалоге           = РедактированиеВДиалоге;
	//Объект.МожноРедактироватьТолькоВДиалоге = МожноРедактироватьТолькоВДиалоге;
	//Объект.НомерКартинки                    = НомерКартинки;
	Объект.Тип                              = Тип;
	Объект.ВидОбъектаКонтактнойИнформации   = Вид;
	
	Объект.Записать();

КонецПроцедуры

//#КонецОбласти

////#Область Инициализация
////#КонецОбласти 



