перем НаименованиеОтчета;
#Область ОписаниеПодключаемогоОтчета

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Назначение", Неопределено);
	ПараметрыРегистрации.Вставить("Наименование", НСтр("ru = '" + НаименованиеОтчета + "'"));
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Версия", "1.1");    
	ПараметрыРегистрации.Вставить("ВерсияБСП", "2.2.2.1");
	ПараметрыРегистрации.Вставить("Информация", НСтр("ru = '" + НаименованиеОтчета + "'"));
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, НаименованиеОтчета, "ОткрытиеФормыОбработки", "ОткрытиеФормы", Истина, "");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	// Создадим пустую таблицу команд и колонки в ней
	Команды = Новый ТаблицаЗначений;
	
	// Как будет выглядеть описание печатной формы для пользователя
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
	
	// Имя нашего макета, что бы могли отличить вызванную команду в обработке печати
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	
	// Тут задается, как должна вызваться команда обработки
	// Возможные варианты:
	// - ОткрытиеФормы - в этом случае в колонке идентификатор должно быть указано имя формы, которое должна будет открыть система
	// - ВызовКлиентскогоМетода - вызвать клиентскую экспортную процедуру из модуля формы обработки
	// - ВызовСерверногоМетода - вызвать серверную экспортную процедуру из модуля объекта обработки
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	
	// Следующий параметр указывает, необходимо ли показывать оповещение при начале и завершению работы обработки. Не имеет смысла при открытии формы
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	
	// Для печатной формы должен содержать строку ПечатьMXL 
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	// Добавляем команду в таблицу команд по переданному описанию.
	// Параметры и их значения можно посмотреть в функции ПолучитьТаблицуКоманд
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция СформироватьОтчет(ДатаОтчета) Экспорт
	
	// Валидация входных данных
	Если НЕ ЗначениеЗаполнено(ДатаОтчета) Тогда
		ВызватьИсключение "Не указана дата для формирования отчета";
	КонецЕсли;
	
	// Получение данных из ОСВ
	ТабличныйДокумент = ПолучитьДанныеОСВ(ДатаОтчета);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает данные из регистра бухгалтерии (ОСВ)
//
// Параметры:
//  Дата - Дата - отчетная дата
//
// Возвращаемое значение:
//  РезультатЗапроса - результат выполнения запроса к ОСВ
//
Функция ПолучитьДанныеОСВ(Дата)
	
	// Создание запроса к регистру бухгалтерии
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК АналитическийСчет,
	|	ХозрасчетныйОстатки.ДоговорДУ КАК ДоговорДУ,
	|	СУММА(ХозрасчетныйОстатки.СуммаОстатокДт) КАК КонечныйОстаток,
	|	ХозрасчетныйОстатки.Валюта КАК Валюта
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаОтчета, Счет В (&СчетаДС), , ДоговорДУ.Пул = &Пул) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.СуммаОстатокДт < 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.ДоговорДУ,
	|	ХозрасчетныйОстатки.Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	АналитическийСчет";
	
	// Параметры запроса
	
	СчетаДС = Новый Массив;
	ДС = ПланыСчетов.Хозрасчетный.НайтиПоКоду("ДС");
	Если ЗначениеЗаполнено(ДС) Тогда
		СчетаДС.Добавить(ДС);
	КонецЕсли;
	ПулРозничноеДУ = Справочники.Пул.НайтиПоНаименованию("Розничное ДУ");
	
	Запрос.УстановитьПараметр("Пул", ПулРозничноеДУ);
	Запрос.УстановитьПараметр("СчетаДС", СчетаДС);
    Запрос.УстановитьПараметр("ДатаОтчета", КонецДня(Дата));

	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		ОбластьСтрока.Область(1,5,1,7).ЦветТекста = Новый Цвет(0,0,0);
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции

#КонецОбласти
НаименованиеОтчета = "Отчет отрицательные остатки по аналитическим счетам";