
//////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьСтатусыНаСервере();
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьСтатусыНаСервере();
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСтатусыНаСервере();
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	БанковскийСчетПриИзменении("");
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаСервере
Процедура УправлениеОтображениемРеквизитов()
	// Видимость связанных КД Собрания
	Видимость = ВидКДВСписке("XMET, MEET, BMET, OMET");
	Элементы.СтраницыГолосованиеВариантыУчастия.Видимость = Видимость;
	
	Видимость = ВидКДВСписке("BIDS, TEND, MCAL, MCAL/BN, PRIO, BPUT");
	Элементы.ВидВыкупа.Видимость						= Видимость;
	Элементы.МинКоличествоДляУчастияВКД.Видимость		= Видимость;
	Элементы.ГруппаПериодПриемаЗаявокНаВыкуп.Видимость	= Видимость;
	
	Видимость = ВидКДВСписке("BIDS, TEND, MCAL, MCAL/BN, DVCA, CAPG, INTR, PRII, BPUT, REDM, PRED, PRIO");
	Элементы.ВыплатаНа1ЦБ.Видимость			= Видимость;
	Элементы.ДатаВыплатыНеПозднее.Видимость	= Видимость;
	Элементы.ГруппаБанковскийСчет.Видимость	= Видимость;
	
	Обязательность = ВидКДВСписке("TREC")
		ИЛИ ЭтоПодтверждениеОсвобожденияОтНалоговПоЦБНеПодпадающимПодНалоговоеРегулированиеСША();
	Элементы.ДатаОкончанияПриемаИнструкцийНРД.АвтоОтметкаНезаполненного = Обязательность;
		
	// Страницы дополнительных реквизитов
	Элементы.ДатаФиксацииНеизвестна.Видимость = Ложь;
	
	ФормаСообщенияКК = РегистрыСведений.ФормыСообщенийКабинетаКлиентаВТБКБ.ФормаСообщения(Объект.ВидКД,
		Объект.Этап, Объект.ТипУведомления,
		НЕ Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(Объект.ЦеннаяБумага1));
	
	Если Перечисления.ФормыСообщенийКК.ЭтоФормаСвязаннаяСВыкупомИлиПриобретениемЦБ(ФормаСообщенияКК) Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_ВыкупПриобретениеЦБ;
		
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_КонвертацияОбменЦБ Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_КонвертацияОбменЦБ;
		
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ОбъединениеВыпусковЦБ Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_ОбъединениеВыпусковЦБ;
		
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_РеорганизацииОбщества Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_РеорганизацииОбщества;
		Элементы.ДатаФиксацииНеизвестна.Видимость = Истина;
		
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеКД Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОбОтменеКД;
		
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_CписаниеЦБ Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_CписаниеЦБ;
		
	ИначеЕсли Перечисления.ФормыСообщенийКК.ЭтоФормаСвязаннаяСВыплатой(ФормаСообщенияКК) Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_CвязанногоСВыплатой;
		
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПоступленииИнформацииИзБюллетеня Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПоступленииИнформацииИзБюллетеня;
		
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ПодтверждениеОсвобожденияОтНалога Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_ОсвобожденияОтНалога;
		
	ИначеЕсли ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_РаскрытиеИнформации Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_РаскрытиеИнформации;
		
	Иначе
		ТекущаяСтраница = Неопределено;
	КонецЕсли;
	
	Если ТекущаяСтраница <> Неопределено Тогда
		Элементы.СтраницыРеквизитыСообщений.ТекущаяСтраница = ТекущаяСтраница;
	КонецЕсли;
	Элементы.СтраницыРеквизитыСообщений.Видимость = ТекущаяСтраница <> Неопределено;
	Элементы.СтраницаВариантыУчастия.Видимость = Не Элементы.СтраницыГолосованиеВариантыУчастия.Видимость;
	Элементы.СтраницаДополнительнаяИнформация2.Видимость = Не Элементы.СтраницыГолосованиеВариантыУчастия.Видимость;
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ И КОМАНДНЫХ ПАНЕЛЕЙ

&НаКлиенте
Процедура ВидКорпоративногоДействияПриИзменении(Элемент)
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыКД(Команда)
	Отбор = Новый Структура("КД", Объект.Ссылка);
	Парам = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.ЭтапыКД.ФормаСписка", Парам);
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетПриИзменении(Элемент)
	ВалютаВыплаты = НаименованиеВалютыБанковскогоСчетаСервер(Объект.БанковскийСчет);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеДанных(Команда)
	ПроверитьЗаполнениеДанныхНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтправленныеУведомления(Команда)
	Отбор = Новый Структура("КД", Объект.Ссылка);
	Парам = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет.ФормаСписка", Парам);
КонецПроцедуры

&НаКлиенте
Процедура КодОтчетаПриИзменении(Элемент)
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ТипУведомленияПриИзменении(Элемент)
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриемаИнструкцийНРДПриИзменении(Элемент)
	ДатаОкончанияПриемаИнструкцийНРДПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УведомленияКлиентам(Команда)
	ЗначениеОтбора = Новый Структура("ДокументОснование", Объект.Ссылка);
	ПараметрыОтбора = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("Документ.УведомлениеКлиентам.ФормаСписка", ПараметрыОтбора);
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ УПРАВЛЕНИЯ СТАТУСАМИ

&НаСервере
Функция ОтправленЗапросСубброкера()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗапросСубброкеруНаРаскрытие.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.КД = &КД
	|	И ЗапросСубброкеруНаРаскрытие.Статус В(&СтатусыОтправлено)");
	
	СтатусыОтправлено = Новый Массив();
	СтатусыОтправлено.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Сформирован);
	СтатусыОтправлено.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Отправлен);
	СтатусыОтправлено.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ОтправленПовторно);
	Запрос.УстановитьПараметр("КД",Объект.Ссылка);
	Запрос.УстановитьПараметр("СтатусыОтправлено",СтатусыОтправлено);
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();

КонецФункции





&НаСервере
Процедура ОбновитьСтатусыНаСервере()
	СтруктураРесурсов 	= РегистрыСведений.СтатусыКорпоративныхДействий.ПолучитьПоследнее(,Новый Структура("КорпоративноеДействие", Объект.Ссылка));
	ТекущийСтатус 		= СтруктураРесурсов.Статус;
	СтруктураРесурсов 	= РегистрыСведений.СостоянияКорпоративныхДействий.ПолучитьПоследнее(,Новый Структура("КорпоративноеДействие", Объект.Ссылка));
	ТекущееСостояние 	= СтруктураРесурсов.Состояние;
	ОтправленЗапросСубброкера = ОтправленЗапросСубброкера();
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСтатусНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("КорпоративноеДействие", Объект.Ссылка)); 
	ФормаСписка = ОткрытьФорму("РегистрСведений.СтатусыКорпоративныхДействий.ФормаСписка", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ТекущееСостояниеНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("КорпоративноеДействие", Объект.Ссылка)); 
	ФормаСписка = ОткрытьФорму("РегистрСведений.СостоянияКорпоративныхДействий.ФормаСписка", ПараметрыФормы);
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПроверитьЗаполнениеДанныхНаСервере()
	МассивСообщенийОбОшибкеЗаполнения = Новый Массив;
	Документы.КорпоративноеДействие_Новый.ПроверитьКорректностьВводаРаскрытияСпискаВладельцев(Объект.Ссылка, МассивСообщенийОбОшибкеЗаполнения);
	Документы.КорпоративноеДействие_Новый.ПроверитьДостаточностьДанныхДляОтправкиУведомлений(Объект.Ссылка, МассивСообщенийОбОшибкеЗаполнения);
	Если МассивСообщенийОбОшибкеЗаполнения.Количество() > 0 Тогда 
		Для каждого СтрокаОшибки из МассивСообщенийОбОшибкеЗаполнения Цикл
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаОшибки);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НаименованиеВалютыБанковскогоСчетаСервер(БанковскийСчет)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БанковскиеСчета.ВалютаДенежныхСредств.Наименование КАК НаименованиеВалюты
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Ссылка = &БанковскийСчет";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НаименованиеВалюты;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ВидКДВСписке(СписокКодовКД)
	// Удалить лишние разделители
	Стр = СтрЗаменить(СписокКодовКД, " ", "");
	Стр = СтрЗаменить(Стр, Символы.ПС, "");
	Стр = СтрЗаменить(Стр, Символы.Таб, "");
	МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр);	
	Возврат МассивПодстрок.Найти(Объект.ВидКД.Код) <> Неопределено;
КонецФункции

&НаСервере
Процедура ДатаОкончанияПриемаИнструкцийНРДПриИзмененииНаСервере()
	Если СокрЛП(Объект.ВидКД.Код) = "TREC"
		ИЛИ ЭтоПодтверждениеОсвобожденияОтНалоговПоЦБНеПодпадающимПодНалоговоеРегулированиеСША() Тогда
		// Предусмотрен ручной ввод даты НРД, при этом пересчитывается дата ВТБКБ
		НоваяДата = Документы.КорпоративноеДействие_Новый.TREC_ДатаОкончанияПриемаИнструкцийВТБКБ(Объект);
		Если Объект.ДатаОкончанияПриемаИнструкцийВТБКБ <> НоваяДата Тогда
			Объект.ДатаОкончанияПриемаИнструкцийВТБКБ = НоваяДата;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменена дата окончания приема инструкций ВТБКБ.");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЭтоПодтверждениеОсвобожденияОтНалоговПоЦБНеПодпадающимПодНалоговоеРегулированиеСША()
	Возврат СокрЛП(Объект.ВидКД.Код) = "WTRC"
			И НЕ Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(Объект.ЦеннаяБумага1);
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "КорпоративноеДействие_Новый/СформироватьУведомление" Тогда 
		ОбновитьСтатусыНаСервере();	
	КонецЕсли;
КонецПроцедуры
