
Функция НовыйПорядковыйНомерВТечениеДня(Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(МАКСИМУМ(ТехническаяОперация.ПорядковыйНомерВнутриДня), 0) КАК ПорядковыйНомер
	               |ИЗ
	               |	Документ.ТехническаяОперация КАК ТехническаяОперация
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ТехническаяОперация.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПорядковыйНомер + 1;
	Иначе
		Возврат 1;
	КонецЕсли; 
КонецФункции // НовыйПорядковыйНомерВТечениеДня()
 
Функция НайтиДокумент(Параметры) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТехническаяОперация.Ссылка
	|ИЗ
	|	Документ.ТехническаяОперация КАК ТехническаяОперация
	|ГДЕ Истина";
	
	НомерПараметра = 0;
	Для каждого Параметр Из Параметры Цикл
		Если ТипЗнч(Параметр.Значение) = Тип("Строка") Тогда
			Запрос.Текст = Запрос.Текст + " И ВЫРАЗИТЬ(" + Параметр.Ключ + " КАК Строка(1000)) = &Параметр" + НомерПараметра;
		Иначе
			Запрос.Текст = Запрос.Текст + " И " + Параметр.Ключ + " = &Параметр" + НомерПараметра;
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("Параметр" + НомерПараметра, Параметр.Значение);
		
		НомерПараметра = НомерПараметра + 1;
	КонецЦикла; 
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.ТехническаяОперация.ПустаяСсылка();
	КонецЕсли;

КонецФункции // НайтиДокумент()
  