
#Область ПрограммныйИнтерфейс

Функция ВидОперацииИзменениеАнкетныхДанных() Экспорт
	
	ОперацияИзменениеАнкетныхДанныхСсылка = НайтиПоНаименованию("Изменение анкетных данных");
	Если Не ЗначениеЗаполнено(ОперацияИзменениеАнкетныхДанныхСсылка) Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОперацияИзменениеАнкетныхДанных = Справочники.ВидыОпераций.СоздатьЭлемент();
		ОперацияИзменениеАнкетныхДанных.Наименование = "Изменение анкетных данных";
		ОперацияИзменениеАнкетныхДанных.КлассОпераций = Перечисления.КлассыОпераций.Административные;
		ОперацияИзменениеАнкетныхДанных.Записать();
		ОперацияИзменениеАнкетныхДанныхСсылка = ОперацияИзменениеАнкетныхДанных.Ссылка;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ОперацияИзменениеАнкетныхДанныхСсылка;
КонецФункции

Функция ОперацииВыплатыДоходаВДенежнойФорме() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВидыОпераций.Ссылка КАК ВидОперации
	|ИЗ
	|	Справочник.ВидыОпераций КАК ВидыОпераций
	|ГДЕ
	|	ВидыОпераций.ВыплатаДоходаВДенежнойФорме");
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидОперации");
КонецФункции

// Определяет, является ли переданный вид операции, выплатой дохода по акциям или иным ценным бумагам
//
// Параметры:
//  ВидОперации	 - СправочникСсылка.ВидыОпераций - вид операции
// 
// Возвращаемое значение:
//  Булево - признак того, что переданный вид операции является выплатой дохода по акциям или иным ценным бумагам
//
Функция ЭтоВыплатаДоходаПоАкциямИлиИнымЦБ(ВидОперации) Экспорт
	
	Возврат ВидОперации = НачислениеДивидендов Или ВидОперации = НачислениеДоходаПрочие Или ВидОперации = ПогашениеНКД;
	
КонецФункции

// Определяет, является ли переданный вид операции, переводом ЦБ
//
// Параметры:
//  ВидОперации	 - СправочникСсылка.ВидыОпераций - вид операции
// 
// Возвращаемое значение:
//  Булево - признак того, что переданный вид операции является переводом
//
Функция ЭтоПереводЦБ(ВидОперации) Экспорт
	
	Возврат ВидОперации = Перевод Или ВидОперации = ПереводМеждуРазделамиСчетаДепо Или ВидОперации = Перемещение;
	
КонецФункции

#КонецОбласти
