//СОБЫТИЯ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ//////////////////////////////////

//КОМАНДЫ ФОРМЫ/////////////////////////////////////////////////

&НаКлиенте
Процедура ПрочитатьОбъекты(Команда)
	 ПрочитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере(Отказ = Ложь)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ЗагрузитьОбъекты(Отказ);
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
	Если Отказ Тогда
		Сообщить("Во время загрузки произошли ошибки", СтатусСообщения.Важное);
	Иначе
		Сообщить("Чтение успешно завершено", СтатусСообщения.Информация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСделки(Команда)
	СоздатьСделкиНаСервере();
	
	Объект.Лог.ТолькоПросмотр = Истина;
	Объект.Лог.Показать();
	

КонецПроцедуры

&НаСервере
Процедура СоздатьСделкиНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.СоздатьОбъекты(Ложь);
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКомиссиюБрокера(Команда)
	ПересчитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ОбновитьКомиссиюБрокера();
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.УстановитьНастройкиПриОткрытии();
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
КонецПроцедуры




