#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДатуВнесенияВСписок = Не ЗначениеЗаполнено(Запись.ДатаВнесенияВСписок) Или Не ЗначениеЗаполнено(Параметры.Ключ);
	Если УстановитьДатуВнесенияВСписок Тогда
		Запись.ДатаВнесенияВСписок = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Параметры.Ключ.Пустой() Тогда
		Запись.СозданоАвтоматически = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ЦеннаяБумагаПриИзмененииНаСервере()
	Запись.ISIN = Запись.ЦеннаяБумага.ISIN;
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент)
	ЦеннаяБумагаПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

