
&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.НастройкиПоУмолчанию();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДопОбработка", Объект.ДополнительнаяОбработка);
	
	Если Не ЗначениеЗаполнено(Объект.ДополнительнаяОбработка) Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		Объект.ДополнительнаяОбработка = ОбработкаОбъект.ДополнительнаяОбработкаСсылка();
	КонецЕсли;
	
	Настройки = Объект.ДополнительнаяОбработка.ХранилищеНастроек.Получить();
		
	Если ТипЗнч(Настройки) = Тип("Структура") Тогда
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.УстановитьПользовательскиеНастройки(Настройки);
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	
	Заголовок = "";
	УстановитьПараметры(Заголовок);	
	
	Сообщить("Настройки установлены");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметры(Заголовок)
	
	Значения = Новый Структура;
	Значения.Вставить("ОчищатьДепозитыПередЗагрузкой", Объект.ОчищатьДепозитыПередЗагрузкой);
	Значения.Вставить("ВебСервисДУ", Объект.ВебСервисДУ);
	Значения.Вставить("ВебСервисПИФ", Объект.ВебСервисПИФ);
	Значения.Вставить("Логин", Объект.Логин);
	Значения.Вставить("Пароль", Объект.Пароль);
	Значения.Вставить("ПочтовыйЛогин", Объект.ПочтовыйЛогин);
	Значения.Вставить("СписокРассылки", XMLСтрока(Новый ХранилищеЗначения(Объект.СписокРассылки.Выгрузить())));
	Значения.Вставить("ОбработкаПерерасчетаСтоимости", Объект.ОбработкаПерерасчетаСтоимости);
	
	ДопОбработка = Объект.ДополнительнаяОбработка.ПолучитьОбъект();
	ДопОбработка.ХранилищеНастроек = Новый ХранилищеЗначения(Значения);
	ДопОбработка.Записать();
	
КонецПроцедуры
