
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьЗаголовокФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ФизическиеЛицаКлиент.ОповеститьПослеРедактирования(Запись.ФизЛицо, "Гражданство");
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	УстановитьЗаголовокФормы();
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовокФормы()
	РегистрыСведений.ГражданствоФизЛиц.УстановитьЗаголовокФормы(ЭтаФорма, Запись.ФизЛицо);
КонецПроцедуры

//#КонецОбласти


