#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущаяДатаЗапретаРедактирования = Константы.ДатаЗапретаРедактирования.Получить();
	ЗакрытьПериодНаДату = НачалоПрошлогоДня();
	// BSLLS:IsInRoleMethod-on
	ВозможнаУстановкаЛюбойДатыЗапрета = РольДоступна("ИзменениеДатыЗапретаРедактирования") Или РольДоступна("ПолныеПрава");
	// BSLLS:IsInRoleMethod-off
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьДатуЗапретаРедактирования(Команда)
	Если (ЗакрытьПериодНаДату = НачалоПрошлогоДня() И ТекущаяДатаЗапретаРедактирования < ЗакрытьПериодНаДату)
			Или ВозможнаУстановкаЛюбойДатыЗапрета Тогда
			Привилегированный.УстановитьДатуЗапретаРедактирования(ЗакрытьПериодНаДату, Объект.Комментарий);
		ТекущаяДатаЗапретаРедактирования = ЗакрытьПериодНаДату;
	Иначе
		Текст = "У Вас недостаточно прав для установки даты запрета редактирования на " + Формат(ЗакрытьПериодНаДату, "ДФ=""дд-ММ-гггг""");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ВспомогательныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция НачалоПрошлогоДня()
	Возврат НачалоДня(НачалоДня(ТекущаяДатаСеанса()) - 1);
КонецФункции

#КонецОбласти
