Перем мОснование;

// Функция возвращает результат запроса по справочнику контрагентов с заданным головным контрагентом
//
// Параметры:
//  ГоловнойКонтрагент - заданный головной контрагент
//
// Возвращаемое значение:
//  Результат - результат работы запроса
// 
Функция ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(ГоловнойКонтрагент) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ГоловнойКонтрагент", ГоловнойКонтрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|
	|ГДЕ
	|	Контрагенты.ГоловнойКонтрагент = &ГоловнойКонтрагент
	|   и Контрагенты.ГоловнойКонтрагент <> Контрагенты.Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)

	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		ЭтотОбъект.ОсновнойДоговорКонтрагента = Неопределено;
	КонецЕсли;

КонецПроцедуры

// Обработчик события ПередЗаписью
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(ГоловнойКонтрагент) И ГоловнойКонтрагент <> Ссылка Тогда

		Если Не ОбщегоНазначения.ЗначениеНеЗаполнено(ГоловнойКонтрагент.ГоловнойКонтрагент) И ГоловнойКонтрагент.ГоловнойКонтрагент <> ГоловнойКонтрагент Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Контрагент "+СокрЛП(ГоловнойКонтрагент)+" не может быть выбран головным, 
							|так как для него уже был назначен головной контрагент "+СокрЛП(ГоловнойКонтрагент.ГоловнойКонтрагент)+"!");
			Отказ = Истина;
			Возврат;
		Иначе

			// надо проверить, что если указываем головного контрагента, то этот элемент уже не был установлен
			// в качестве головного у другого контрагента.
			ВыборкаПоГоловномуКонтрагенту = ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(Ссылка).Выбрать();
			Если ВыборкаПоГоловномуКонтрагенту.Количество() <> 0 Тогда

				СообщениеОНевозможностиЗаписи = "Контрагент "+СокрЛП(ЭтотОбъект)+" не может иметь головного контрагента!
												|Этот контрагент уже установлен головным для: ";
				Пока ВыборкаПоГоловномуКонтрагенту.Следующий() Цикл
					СообщениеОНевозможностиЗаписи = СообщениеОНевозможностиЗаписи + Символы.ПС + СокрЛП(ВыборкаПоГоловномуКонтрагенту.Контрагент);
				КонецЦикла;

				ОбщегоНазначения.СообщитьОбОшибке(СообщениеОНевозможностиЗаписи);
				Отказ = Истина;
				Возврат;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактныеЛица.Ссылка КАК КонтЛицо
	|ИЗ
	|	Справочник.КонтактныеЛица КАК КонтактныеЛица
	|
	|ГДЕ
	|	КонтактныеЛица.ОбъектВладелец = &Ссылка";
	ВыборкаКонтЛиц = Запрос.Выполнить().Выбрать();

	Пока ВыборкаКонтЛиц.Следующий() Цикл

		КонтЛицо = ВыборкаКонтЛиц.КонтЛицо.ПолучитьОбъект();
		КонтЛицо.УстановитьПометкуУдаления(ПометкаУдаления);
		КонтЛицо.Записать();

	КонецЦикла;

	//  Заполнение поля УИд будущим уникальным идентификаторорм
	Если ЭтоНовый() И Не ОбменДанными.Загрузка Тогда
		обУИд = Новый УникальныйИдентификатор();
		УИд = Строка(обУИд);
		
		УстановитьСсылкуНового(Справочники.Контрагенты.ПолучитьСсылку(обУИд));
	КонецЕсли;
	
	ПерезаполнитьРегионДляОтчетовЕслиНужно();
	
	ПроверитьСчетСписанияКомиссииВНРБанке(Отказ);
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Организации") Тогда

		Наименование           = Основание.Наименование;
		ЮрФизЛицо              = Перечисления.ЮрФизЛицо.ЮрЛицо;
		НаименованиеПолное     = Основание.НаименованиеПолное;
		ОсновнойБанковскийСчет = Основание.ОсновнойБанковскийСчет;
		ИНН                    = Основание.ИНН;
		КПП                    = Основание.КПП;
		КодПоОКПО              = Основание.КодПоОКПО;
		мОснование             = Основание;

	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПерезаполнитьРегионДляОтчетовЕслиНужно()
	Если ЗаполнениеРегионаНевозможно() Тогда
		Возврат;
	КонецЕсли;
	
	ПерезаполнятьПринудительно = (ДополнительныеСвойства.Свойство("ПерезаполнятьРегионДляОтчетов")
									И ДополнительныеСвойства.ПерезаполнятьРегионДляОтчетов)
									Или ЭтоНовый();
	Если Не ПерезаполнятьПринудительно И ЗначениеЗаполнено(РегионДляОтчетов) Тогда
		ПоменялисьРеквизитыВлияющиеНаРегион = Резидент <> Ссылка.Резидент Или ЮридическиеФизическиеЛица <> Ссылка.ЮридическиеФизическиеЛица;
		Перезаполнять = ПоменялисьРеквизитыВлияющиеНаРегион;
	Иначе
		Перезаполнять = ПерезаполнятьПринудительно;
	КонецЕсли;
	Если Перезаполнять Тогда
		РегионИСтрана = Справочники.КлассификаторРегионов.РегионЮридическогоФизическогоЛица(ЮридическиеФизическиеЛица);
		РегионДляОтчетов = Справочники.КлассификаторРегионов.РегионДляКонтрагента(РегионИСтрана, Резидент);
		Если Не ЗначениеЗаполнено(РегионДляОтчетов) Тогда
			ТекстСообщения = "Не удалось определить код региона для контрагента " + Строка(Ссылка)
							+ " (юридическое/физическое лицо: " + Строка(ЮридическиеФизическиеЛица) + ")";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ИмяСобытия = "Получение значения для заполнения реквизита ""РегионДляОтчетов"" в справочнике ""Депоненты/Контрагенты""";
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.КлассификаторРегионов, 
										ЮридическиеФизическиеЛица, ТекстСообщения);
		Иначе
			// Перезаполнить для остальных контрагентов связанных с тем же юрлицом
			Справочники.КлассификаторРегионов.УстановитьРегионДляКонтрагентов(ЮридическиеФизическиеЛица, РегионИСтрана, Ссылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ЗаполнениеРегионаНевозможно()
	ЗаполнениеНевозможно
		= (ДополнительныеСвойства.Свойство("НеПерезаполнятьРегионДляОтчетов") И ДополнительныеСвойства.НеПерезаполнятьРегионДляОтчетов)
			Или ЭтоГруппа
			Или РегионДляОтчетовРучнойВвод 
			Или Не ЗначениеЗаполнено(ЮридическиеФизическиеЛица);
	Возврат ЗаполнениеНевозможно;
КонецФункции

Процедура ПроверитьСчетСписанияКомиссииВНРБанке(Отказ)
	
	Если КлиентОтсутствуетВBQ Тогда
		
		СчетСписания = СокрЛП(СчетСписанияКомиссииВНРБанке);
		
		Если ЗначениеЗаполнено(СчетСписания) И СтрДлина(СчетСписания) < 20 Тогда
			ТекстСообщения = "Длина поля ""Счет списания депозитарной комиссии в НРБанке"" должна быть не менее 20 символов";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ОбщегоНазначения.ТолькоЦифрыВСтроке(СчетСписания) Тогда
			ТекстСообщения = "В поле ""Счет списания депозитарной комиссии в НРБанке"" должны быть указаны только цифры";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ПриЗаписи
// Параметры:
//	Отказ - Булево
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		// Должно обязательно отработать в обработчике даже в режиме загрузки, чтобы изменения были выгружены в бэкофис (BQ)
		РегистрацияИзмененийДляВыгрузки.ОтметитьИзмененияВСправочнике(ЭтотОбъект, Отказ);
		
		Возврат;
	КонецЕсли;
	
	РегистрацияИзмененийДляВыгрузки.ОтметитьИзмененияВСправочнике(ЭтотОбъект, Отказ);
КонецПроцедуры
