
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьНастройкиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрочитатьНастройки(Команда)
	ПрочитатьНастройкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьНастройкиНаСервере()
	Настройки.Очистить();
	НастройкиВыгрузки = Обработки.ВыгрузкаКотировокВBackQort.НастройкиВыгрузки();
	Для Каждого НастройкаВыгрузки Из НастройкиВыгрузки Цикл
		НоваяСтрока = Настройки.Добавить();
		НоваяСтрока.ИсточникКотировок = НастройкаВыгрузки.Ключ;
		НоваяСтрока.ПоследняяУспешнаяВыгрузкаКотировок = НастройкаВыгрузки.Значение.ПоследняяУспешнаяВыгрузкаКотировок;
		НоваяСтрока.ДатаКотировокКВыгрузке = НастройкаВыгрузки.Значение.ДатаКотировокКВыгрузке;
	КонецЦикла;
	Настройки.Сортировать("ИсточникКотировок");
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	Для Каждого СтрокаНастроек Из Настройки Цикл
		Обработки.ВыгрузкаКотировокВBackQort.СохранитьНастройкуВыгрузки(СтрокаНастроек.ИсточникКотировок,
			СтрокаНастроек.ПоследняяУспешнаяВыгрузкаКотировок, СтрокаНастроек.ДатаКотировокКВыгрузке);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
