
////////////////////////////////////////////////////////////////////////////////
//	ИНТЕРФЕЙС

Перем ВебСервис Экспорт;


Функция СтатусыДокументов(ИдентификаторыДокументов) Экспорт

	СтатусыДокументов = Новый ТаблицаЗначений;
	СтатусыДокументов.Колонки.Добавить("DocumentId");
	СтатусыДокументов.Колонки.Добавить("StatusId");
	СтатусыДокументов.Колонки.Добавить("SigningIsRequired");
	
	Если ВебСервис = Неопределено Тогда
		ВебСервис	= ВебСервисыПовтИсп.ПолучитьПроксиСЭД();
	КонецЕсли;
	
	Для Каждого ИдентификаторДокумента Из ИдентификаторыДокументов Цикл
		DocumentID = Формат(ИдентификаторДокумента, "ЧГ=");
		Если ЗначениеЗаполнено(DocumentID) Тогда
			ОтветВебСервиса	= ВебСервис.GetDocumentStatuses(DocumentID);
			Для каждого DocumentStatus Из ОтветВебСервиса.DocumentStatus Цикл
				НоваяСтрока = СтатусыДокументов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, DocumentStatus);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Возврат СтатусыДокументов;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
//	Вспомогательные функции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
