
// Процедура выполняет регистрацию документов в регистре сведений "РегистрацияДокументовКПеренумерации"
// по записям регистра выполняется регламентная перенумерация документов за день
// Параметры: 
// ИмяДокумента  - Строка: имя объекта метаданных
// ДатаДокумента - Дата: дата (день) перенумерации документов 
Процедура ЗарегистрироватьДокументыКПеренумерации(ИмяДокумента, ДатаДокумента) Экспорт 
	
	МетаДок = Метаданные.Документы.Найти(ИмяДокумента);
	
	ПроверитьНеобходимостьПеренумерации(МетаДок, ИмяДокумента, ДатаДокумента);
	
КонецПроцедуры

Процедура ПроверитьНеобходимостьПеренумерации(МетаДок, ИмяДокумента, ДатаДокумента)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", 		НачалоДня(ДатаДокумента));
	Запрос.УстановитьПараметр("ИмяДокумента", 	ИмяДокумента);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрацияДокументов.Период КАК Период,
	|	РегистрацияДокументов.ИмяДокумента КАК ИмяДокумента,
	|	РегистрацияДокументов.ВыполненСтарт КАК ВыполненСтарт
	|ИЗ
	|	РегистрСведений.РегистрацияДокументовКПеренумерации КАК РегистрацияДокументов
	|ГДЕ
	|	РегистрацияДокументов.Период = &Период
	|	И РегистрацияДокументов.ИмяДокумента = &ИмяДокумента";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() ИЛИ Выборка.ВыполненСтарт Тогда
		Запись = РегистрыСведений.РегистрацияДокументовКПеренумерации.СоздатьМенеджерЗаписи();
		
		Запись.Период        		= НачалоДня(ДатаДокумента);
		Запись.ИмяДокумента  		= ИмяДокумента;
		Запись.ВыполненСтарт 		= Ложь; 
		Запись.ВыполненоДоМомента 	= Дата("00010101");
		Запись.Записать();
		
		ЗаписьЖурналаРегистрации("Перенумерация документов"
			, УровеньЖурналаРегистрации.Предупреждение
			, МетаДок
			, 
			, "Необходима перенумерация документов за день "+Формат(ДатаДокумента, "ДФ=dd.MM.yyyy"));  
	КонецЕсли;		
КонецПроцедуры