
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Режим = "";
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
	Если ДеньНедели(ТекущаяДата()) = 1 Тогда
		Объект.ДатаНачала		= НачалоДня(ТекущаяДата()-60*60*72);
		Объект.ДатаОкончания	= КонецДня(Объект.ДатаНачала);
	Иначе
		Объект.ДатаНачала		= НачалоДня(ТекущаяДата()-60*60*24);
		Объект.ДатаОкончания	= КонецДня(Объект.ДатаНачала);
	КонецЕсли;
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапроскСервису(Команда)
	
	Отказ = Ложь;
	ЗапросКСервисуНаСервере(Отказ);
	
	Если Отказ Тогда
		Сообщить("Во время загрузки произошли ошибки", СтатусСообщения.Важное);
	Иначе
		Сообщить("Чтение успешно завершено", СтатусСообщения.Информация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
	
	//ЭтаФорма.Объект.Лог.ОтображатьГруппировки = Ложь;
	//ЭтаФорма.Объект.Лог.ОтображатьСетку 		= Ложь;
	//ЭтаФорма.Объект.Лог.ОтображатьЗаголовки 	= Ложь;
	//ЭтаФорма.Объект.Лог.Защита				= Истина;
	//Объект.Лог.Показать();
	СоздатьТабличныйДокументНаСервере(ЭтаФорма.Объект.Лог).Показать();
	
	Если ЭтаФорма.Объект.ЕстьРасхожденияКотировок Тогда
		СоздатьТабличныйДокументНаСервере(ЭтаФорма.Объект.ЛогИзменений).Показать();
	КонецЕсли;
КонецПроцедуры // Загрузить()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РежимПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры // РежимПриИзменении()

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ЗапросКСервисуНаСервере(Отказ)
	Перем ТекОбъект;
	
	Объект.СписокЗагрузки.Очистить();
	
	Если ЗначениеЗаполнено(ЭтаФорма.Режим) Тогда
		ЭтаФорма.Объект.Актив = Справочники.Активы.ПустаяСсылка();
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ЭтаФорма.Режим) И НЕ ЗначениеЗаполнено(ЭтаФорма.Объект.Актив) Тогда
		Отказ = Истина;
		
		Сообщить("Не указан актив!", СтатусСообщения.Информация);
		Возврат;
		
	КонецЕсли;
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ЗагрузитьОбъекты(,, ЭтаФорма.Режим);
	
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
КонецПроцедуры // ЗапросКСервисуНаСервере()

&НаСервереБезКонтекста
Функция СоздатьТабличныйДокументНаСервере(Знач ТабЛог)
	Перем ТабДок;
	
	ТабДок = Новый ТабличныйДокумент();
	ТабДок.ОтображатьГруппировки = Ложь;
	ТабДок.ОтображатьСетку		 = Ложь;
	ТабДок.ОтображатьЗаголовки	 = Ложь;
	ТабДок.Защита				 = Истина;
	ТабДок.Вывести(ТабЛог);
	
	Возврат ТабДок;
КонецФункции // СоздатьТабличныйДокументНаСервере()

&НаСервере
Процедура ЗагрузитьНаСервере()
	Перем ТекОбъект;
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.СоздатьОбъекты(,, ЭтаФорма.Режим);
	
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
КонецПроцедуры // ЗагрузитьНаСервере()

&НаКлиенте
Процедура УправлениеФормой()
	ЭтаФорма.Элементы.Актив.Доступность = НЕ ЗначениеЗаполнено(ЭтаФорма.Режим);
КонецПроцедуры // УправлениеФормой()

#КонецОбласти