
#Область ПрограммныйИнтерфейс

// Функция возвращает ссылку на значение перечисления МестаОбращаемостиЦБ по признаку обращаемости ЦБ из RuData
//
// Параметры:
//  ПризнакОбращаемостиЦБ - Строка - Признак обращаемости ЦБ из RuData
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.МестаОбращаемостиЦБ - ссылка на значение перечисления
//
Функция МестоОбращаемостиЦБ(ПризнакОбращаемостиЦБ) Экспорт
	
	МестаОбращаемостиЦБ = Перечисления.МестаОбращаемостиЦБ;
	Если ПризнакОбращаемостиЦБ = "0" Тогда
		Возврат МестаОбращаемостиЦБ.НеОбращаетсяНаБирже;
	ИначеЕсли ПризнакОбращаемостиЦБ = "1" Тогда
		Возврат МестаОбращаемостиЦБ.ОбращаетсяНаМосковскойБирже;
	ИначеЕсли ПризнакОбращаемостиЦБ = "2" Или ПризнакОбращаемостиЦБ = "3" Тогда
		Возврат МестаОбращаемостиЦБ.ОбращаетсяНаИностранныхБиржах;
	ИначеЕсли ПризнакОбращаемостиЦБ = Неопределено Или НРег(ПризнакОбращаемостиЦБ) = НРег("null") Тогда
		Возврат МестаОбращаемостиЦБ.ИнформацияПоТоргамОтсутствуетИлиЦБПогашена;
	Иначе
		Возврат МестаОбращаемостиЦБ.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти