
&НаКлиенте
Процедура ОбработатьДокументы(Команда)
	ОбработатьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработатьДокументыНаСервере()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Поручение.Ссылка КАК Ссылка,
	|	Поручение.Депонент КАК Депонент,
	|	Поручение.СчетДепо КАК СчетДепо,
	|	Поручение.СчетДепо.Владелец КАК СчетДепоВладелец,
	|	Поручение.Инициатор КАК Инициатор
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.Депонент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)");
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Депонент = Выборка.СчетДепоВладелец;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОперацииЦБ.Ссылка КАК Ссылка,
	|	ОперацииЦБ.Депонент КАК Депонент,
	|	ОперацииЦБ.СчетДепо КАК СчетДепо,
	|	ОперацииЦБ.СчетДепо.Владелец КАК СчетДепоВладелец,
	|	ОперацииЦБ.Инициатор КАК Инициатор
	|ИЗ
	|	Документ.ОперацииЦБ КАК ОперацииЦБ
	|ГДЕ
	|	ОперацииЦБ.Депонент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)");
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Депонент = Выборка.СчетДепоВладелец;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЦикла;
	
КонецПроцедуры
