#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПолучениеБазиса

&Вместо("БазисыОтАктивов")
Функция FO_LimitProfile_БазисыОтАктивов(Запрос, Параметры)

	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Результат = ПродолжитьВызов(Запрос, Параметры);
	FO_LimitProfile_Замеры.Добавить("ПроверкаЛимитовСлужебный.БазисыОтАктивов", ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт);
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
