
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Строка Из ЭтотОбъект Цикл
		Если (Строка.СчетДепо.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.Закрыт
			И Строка.СчетДепо.ДатаЗакрытияСчета <= Строка.Период)
		Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Вы пытаетесь провести документ по закрытому 'Счету ДЕПО' - "
				+ СокрЛП(Строка.СчетДепо.Код) + " (" + СокрЛП(Строка.СчетДепо.Владелец) + ")", Отказ);
			Возврат;
		КонецЕсли;
			
		Если (Строка.РазделСчетаДепо.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.Закрыт
			И Строка.РазделСчетаДепо.ДатаЗакрытияСчета <= Строка.Период)
		Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Вы пытаетесь провести документ по закрытому 'Разделу счета ДЕПО' - "
				+ СокрЛП(Строка.РазделСчетаДепо.Код) + " (" + СокрЛП(Строка.РазделСчетаДепо.Владелец.Код) + " / "
				+ СокрЛП(Строка.РазделСчетаДепо.Владелец.Владелец.Наименование) + ")", Отказ);
			Возврат;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры
