Перем КэшДат;

Процедура СформироватьПорученияПриемаИСнятия() Экспорт
	
	Если ПериодКонец >= ПериодНачало 
		И ЗначениеЗаполнено(ПериодНачало)
	Тогда
		НачатьТранзакцию();
		ОтобратьЦенныеБумаги();
		СоздатьПоручения();
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтобратьЦенныеБумаги(Прием = Истина, Снятие = Истина) Экспорт
	
	ЦенныеБумаги.Очистить();
	
	Если Прием Тогда
		ЗаполнитьЦенныеБумаги(ТекстЗапросаДляПриемаНаОбслуживание());
	КонецЕсли;
	
	Если Снятие Тогда
		ЗаполнитьЦенныеБумаги(ТекстЗапросаДляСнятияСОбслуживания());
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьПоручения(Прием = Истина, Снятие = Истина) Экспорт

	ОрганизацияПоУмолчанию = Константы.ОрганизацияПоУмолчанию.Получить();
	КэшДат = Новый Соответствие;
	ВТранзакции = ТранзакцияАктивна();
	Если Не ВТранзакции Тогда
		ПомеченныеСтроки = ЦенныеБумаги.НайтиСтроки(Новый Структура("Пометка", Истина));
		МассивЦБ = ЦенныеБумаги.Выгрузить(ПомеченныеСтроки, "ЦБ").ВыгрузитьКолонку("ЦБ");	
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Поручение.ЦБ
		|ИЗ
		|	Документ.Поручение КАК Поручение
		|ГДЕ
		|	Поручение.ЦБ В(&ЦБ)
		|	И Поручение.ВидОперацииД = &ВидОперации
		|	И НЕ Поручение.ПометкаУдаления
		|	И Поручение.Проведен";
		Запрос.УстановитьПараметр("ЦБ", МассивЦБ);
		Если Прием Тогда
			Запрос.УстановитьПараметр("ВидОперации", Справочники.ВидыОпераций.ПриемЦБНаОбслуживание);
			УжеПринятые = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
		Если Снятие Тогда
			Запрос.УстановитьПараметр("ВидОперации", Справочники.ВидыОпераций.СнятиеЦБсОбслуживания);
			УжеСнятые = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
	КонецЕсли;
	
	Если Снятие Тогда
		ЦБСНенулевымОстатком = Новый Массив;
	КонецЕсли;
		
	Для Каждого Строка Из ЦенныеБумаги Цикл
		Если Строка.Пометка = Ложь 
			Или (Строка.Снятие И Не Снятие)
			Или (Не Строка.Снятие И Не Прием)
		Тогда
			Продолжить;
		ИначеЕсли Строка.Снятие И Строка.КоличествоОстаток > 0 Тогда
			ЦБСНенулевымОстатком.Добавить(Строка);
			Продолжить;
		КонецЕсли;
		Если Не ВТранзакции Тогда
			Если Прием И УжеПринятые.Найти(Строка.ЦБ) <> Неопределено Тогда
				Сообщить("ЦБ <"+Строка.ЦБ+"> уже была принята на обслуживание!");
				Продолжить;
			КонецЕсли;
			Если Снятие И УжеСнятые.Найти(Строка.ЦБ) <> Неопределено Тогда
				Сообщить("ЦБ <"+Строка.ЦБ+"> уже была снята с обслуживания!");
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Строка.Период) Или Строка.Снятие Тогда
			ДатаВКэше = КэшДат.Получить(Строка.Период); // Виталий Донченко: все можно сформировать одним временем
			Если ДатаВКэше = Неопределено Тогда
				ДатаПоследнегоПоручения = ДатаПоследнегоПоручения(Строка.Период);
				Если Час(ДатаПоследнегоПоручения) < 20 Тогда
					ДатаВремя = Строка.Период + 20*60*60;
				Иначе
					ДатаВремя = ДатаПоследнегоПоручения + 5;
				КонецЕсли;
				КэшДат.Вставить(Строка.Период, ДатаВремя);
				Строка.Период = ДатаВремя;
			Иначе 
				Строка.Период = ДатаВКэше;
			КонецЕсли;
		Иначе
			СекундВМинуте = 60;
			КоличествоМинут = 5;
			ПятьМинут = СекундВМинуте * КоличествоМинут;
			Строка.Период = Строка.Период - ПятьМинут;
		КонецЕсли;
		Поручение = Документы.Поручение.СоздатьДокумент();
		Поручение.Дата						= Строка.Период;
		Поручение.ДатаИсполненияПоручения	= Строка.Период+1;
		Если Строка.Снятие Тогда
			ВидОперации = "'Снятие ЦБ с обслуживания'";
			Поручение.ВидОперацииД				= Справочники.ВидыОпераций.СнятиеЦБсОбслуживания;
		Иначе
			ВидОперации = "'Прием ЦБ на обслуживание'";
			Поручение.ВидОперацииД				= Справочники.ВидыОпераций.ПриемЦБНаОбслуживание;
		КонецЕсли;
		Поручение.Инициатор					= ОрганизацияПоУмолчанию;
		Поручение.ЦБ						= Строка.ЦБ;
		Попытка
			Поручение.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Проведена операция "+ВидОперации+" ("+Поручение.Ссылка+") для ЦБ: "+Строка.ЦБ);
			ЗаписьЖурналаРегистрации("Обработка Ценных бумаг к приему на обслуживание", УровеньЖурналаРегистрации.Информация, Поручение.Метаданные(), Поручение.Ссылка, 
				"Проведена операция "+ВидОперации+" ("+Поручение.Ссылка+") для ЦБ: "+Строка.ЦБ);
		Исключение
			Сообщить("Не удалось провести операцию "+ВидОперации+" для ЦБ: "+Строка.ЦБ+" !!!", СтатусСообщения.Внимание);
			ЗаписьЖурналаРегистрации("Обработка Ценных бумаг к приему на обслуживание", УровеньЖурналаРегистрации.Информация, Поручение.Метаданные(), Поручение.Ссылка, 
				"Не удалось провести операцию "+ВидОперации+" для ЦБ: "+Строка.ЦБ);
		КонецПопытки;
	КонецЦикла;
	
	Если Снятие И ЦБСНенулевымОстатком.Количество() > 0 Тогда
		ИмяСобытия = "Обработка Снятие ЦБ с обслуживания";
		
		ТекстСообщения = "При создании поручений на снятие с обслуживания обнаружены остатки по следующим ЦБ:";
		Для Каждого Строка Из ЦБСНенулевымОстатком Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС + Строка.ЦБ + " (" + Строка.ЦБ.ISIN + "), код загрузки: " + Строка.КодЗагрузки;
		КонецЦикла;
		ТекстСообщения = ТекстСообщения + Символы.ПС + "Снятие с обслуживания данных ЦБ отменено";
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, Метаданные(),,  ТекстСообщения);
		
		НастройкаОтправки = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОСнятииЦБСОбслуживания).Настройка;
		Если Не ЗначениеЗаполнено(НастройкаОтправки) Тогда
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Предупреждение,,, "Не заполнена настройка обмена данными <<Депозитарий и IT>> ");
		Иначе
			ПараметрыУведомления = Новый Соответствие;
			ПараметрыУведомления.Вставить("НастройкиОбмена"		, НастройкаОтправки);
			ПараметрыУведомления.Вставить("ТемаПисьма"			, ИмяСобытия);
			ПараметрыУведомления.Вставить("ТекстПисьма"			, ТекстСообщения);
			ПараметрыУведомления.Вставить("ТипТекстаПисьма"		, ТипТекстаПочтовогоСообщения.ПростойТекст);
			ПараметрыУведомления.Вставить("Кодировка"			, "UTF-8");
			РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДатаПоследнегоПоручения(ПериодДень)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ДокументОбъект.Дата), &Дата) КАК ПоследняяДата
	|ИЗ
	|	Документ.Поручение КАК ДокументОбъект
	|ГДЕ
	|	ДокументОбъект.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДокументОбъект.ПометкаУдаления = ЛОЖЬ
	|");
	Запрос.УстановитьПараметр("Дата", ПериодДень);
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоДня(ПериодДень));
	Запрос.УстановитьПараметр("КонецПериода",	КонецДня(ПериодДень));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПоследняяДата;
	Иначе
		Возврат ПериодДень;
	КонецЕсли;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ФУНКЦИИ

Функция ТекстЗапросаДляПриемаНаОбслуживание()
	Возврат
	"ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка КАК ЦеннаяБумага
	|ПОМЕСТИТЬ ЦБОбслуживаемые
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|ГДЕ
	|	НЕ ЦенныеБумаги.ДатаПриемаНаОбслуживание = &ПустаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОбороты.ЦБ КАК ЦБ,
	|	ОстаткиЦБОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ОстаткиЦБОбороты.КоличествоРасход КАК КоличествоРасход
	|ПОМЕСТИТЬ ОборотыДо
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Обороты(
	|			,
	|			&ПериодНачалоИсключая,
	|			,
	|			НЕ ЦБ В
	|					(ВЫБРАТЬ
	|						ЦБОбслуживаемые.ЦеннаяБумага
	|					ИЗ
	|						ЦБОбслуживаемые)) КАК ОстаткиЦБОбороты
	|ГДЕ
	|	(ОстаткиЦБОбороты.КоличествоПриход <> 0
	|			ИЛИ ОстаткиЦБОбороты.КоличествоРасход <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОстаткиИОбороты.ЦБ КАК ЦБ,
	|	ОстаткиЦБОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоОстаток,
	|	ОстаткиЦБОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ОстаткиЦБОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход
	|ПОМЕСТИТЬ ВТ_ОстаткиИОборотыЦБ
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.ОстаткиИОбороты(
	|			&ПериодНачало,
	|			&ПериодКонец,
	|			,
	|			,
	|			НЕ ЦБ В
	|					(ВЫБРАТЬ
	|						ЦБОбслуживаемые.ЦеннаяБумага
	|					ИЗ
	|						ЦБОбслуживаемые
	|			
	|					ОБЪЕДИНИТЬ
	|			
	|					ВЫБРАТЬ
	|						ОборотыДо.ЦБ
	|					ИЗ
	|						ОборотыДо)) КАК ОстаткиЦБОстаткиИОбороты
	|ГДЕ
	|	ОстаткиЦБОстаткиИОбороты.КоличествоНачальныйОстаток = 0
	|	И (ОстаткиЦБОстаткиИОбороты.КоличествоПриход <> 0
	|			ИЛИ ОстаткиЦБОстаткиИОбороты.КоличествоРасход <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБ.ЦБ КАК ЦБ,
	|	МИНИМУМ(ОстаткиЦБ.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ОстаткиЦБПериоды
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ КАК ОстаткиЦБ
	|ГДЕ
	|	ОстаткиЦБ.Период МЕЖДУ &ПериодНачало И &ПериодКонец
	|	И ОстаткиЦБ.ЦБ В
	|			(ВЫБРАТЬ
	|				ВТ_ОстаткиИОборотыЦБ.ЦБ
	|			ИЗ
	|				ВТ_ОстаткиИОборотыЦБ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиЦБ.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиИОборотыЦБ.ЦБ КАК ЦБ,
	|	ОстаткиИОборотыЦБ.КоличествоОстаток КАК КоличествоОстаток,
	|	ОстаткиИОборотыЦБ.КоличествоПриход КАК КоличествоПриход,
	|	ОстаткиИОборотыЦБ.КоличествоРасход КАК КоличествоРасход,
	|	ЛОЖЬ КАК Снятие,
	|	ОстаткиЦБПериоды.Период КАК Период
	|ИЗ
	|	ВТ_ОстаткиИОборотыЦБ КАК ОстаткиИОборотыЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиЦБПериоды КАК ОстаткиЦБПериоды
	|		ПО ОстаткиИОборотыЦБ.ЦБ = ОстаткиЦБПериоды.ЦБ";
КонецФункции

Функция ТекстЗапросаДляСнятияСОбслуживания()
	
	Возврат
	"ВЫБРАТЬ
	|	КодыЗагрузки.ДатаОкончанияДействия КАК Период,
	|	ЦенныеБумаги.Ссылка КАК ЦБ,
	|	КодыЗагрузки.Код КАК КодЗагрузки
	|ПОМЕСТИТЬ ВТ_ЦБДляСнятияСОбслуживания
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ЦенныеБумаги.Ссылка = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = &КлассификаторЗагрузкиНДЦ)
	|			И (КодыЗагрузки.ДатаОкончанияДействия <> &ПустаяДата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиНовые
	|		ПО ЦенныеБумаги.Ссылка = КодыЗагрузкиНовые.Владелец
	|			И (КодыЗагрузкиНовые.Биржа = &КлассификаторЗагрузкиНДЦ)
	|			И (КодыЗагрузкиНовые.ДатаОкончанияДействия = &ПустаяДата)
	|ГДЕ
	|	КодыЗагрузки.ДатаОкончанияДействия МЕЖДУ &ПериодНачало И &ПериодКонец
	|	И ЦенныеБумаги.ДатаСнятияСОбслуживания = &ПустаяДата
	|	И ЦенныеБумаги.ДатаПриемаНаОбслуживание <> &ПустаяДата
	|	И КодыЗагрузкиНовые.Код ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК Снятие,
	|	ЦБДляСнятияСОбслуживания.Период КАК Период,
	|	ЦБДляСнятияСОбслуживания.ЦБ КАК ЦБ,
	|	ЦБДляСнятияСОбслуживания.КодЗагрузки КАК КодЗагрузки,
	|	ЕСТЬNULL(ЦБОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	ВТ_ЦБДляСнятияСОбслуживания КАК ЦБДляСнятияСОбслуживания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦБ.Остатки(
	|				&ПериодКонец,
	|				ЦБ В
	|					(ВЫБРАТЬ
	|						ВТ_ЦБДляСнятияСОбслуживания.ЦБ
	|					ИЗ
	|						ВТ_ЦБДляСнятияСОбслуживания)) КАК ЦБОстатки
	|		ПО ЦБДляСнятияСОбслуживания.ЦБ = ЦБОстатки.ЦБ";
	
КонецФункции

Процедура ЗаполнитьЦенныеБумаги(ТекстЗапроса)
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("КлассификаторЗагрузкиНДЦ", Справочники.КлассификаторыЗагрузки.НДЦ());
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	Дата = НачалоДня(ПериодНачало);
	Запрос.УстановитьПараметр("ПериодНачалоИсключая", Новый Граница(Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ПериодНачало", Дата);
	Запрос.УстановитьПараметр("ПериодКонец", КонецДня(ПериодКонец));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = ЦенныеБумаги.Добавить();
		Строка.Пометка = Истина;
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
		Если Не ЗначениеЗаполнено(Строка.Период) Тогда
			Строка.Период = ОбщегоНазначения.ПредыдущийРабочийДень(Дата);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ТекстЗапросаКонтрольЗаСнятиемЦБсОбслуживания()

	Возврат
	"ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка КАК ЦБ,
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	КодыЗагрузки.Код КАК КодЗагрузки,
	|	ЦенныеБумаги.ТипЦБ КАК ТипЦБ,
	|	ЦенныеБумаги.ДатаПогашения КАК ДатаПогашения,
	|	КодыЗагрузки.ДатаОкончанияДействия КАК ДатаОкончанияДействия
	|ПОМЕСТИТЬ ВТ_ЦенныеБумаги
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ЦенныеБумаги.Ссылка = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = &КлассификаторЗагрузкиНДЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиНовые
	|		ПО ЦенныеБумаги.Ссылка = КодыЗагрузкиНовые.Владелец
	|			И (КодыЗагрузкиНовые.ДатаНачалаДействия <> КодыЗагрузки.ДатаНачалаДействия)
	|			И (КодыЗагрузкиНовые.Биржа = &КлассификаторЗагрузкиНДЦ)
	|			И (КодыЗагрузкиНовые.ДатаОкончанияДействия = &ПустаяДата)
	|ГДЕ
	|	ЦенныеБумаги.ДатаПриемаНаОбслуживание <> &ПустаяДата
	|	И КодыЗагрузкиНовые.Код ЕСТЬ NULL
	|	И ЦенныеБумаги.ДатаСнятияСОбслуживания = &ПустаяДата
	|	И (КодыЗагрузки.ДатаОкончанияДействия <> &ПустаяДата
	|				И (КодыЗагрузки.ДатаОкончанияДействия МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
	|			ИЛИ ЦенныеБумаги.ДатаПогашения <> &ПустаяДата
	|				И (ЦенныеБумаги.ДатаПогашения МЕЖДУ &НачалоПериода И &ОкончаниеПериода))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумаги.ЦБ КАК ЦБ,
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.КодЗагрузки КАК КодЗагрузки,
	|	ЦенныеБумаги.ТипЦБ КАК ТипЦБ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Поручение.ДатаИсполненияПоручения, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Поручение.ДатаИсполненияПоручения
	|		ИНАЧЕ ЦенныеБумаги.ДатаПогашения
	|	КОНЕЦ КАК ДатаПогашения,
	|	ЦенныеБумаги.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ЕСТЬNULL(ЦБОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	Поручение.Ссылка КАК ПоручениеПогашения,
	|	ЦенныеБумагиОбслуживание.Ссылка КАК ДокументСнятия
	|ИЗ
	|	ВТ_ЦенныеБумаги КАК ЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручение
	|		ПО ЦенныеБумаги.ЦБ = Поручение.ЦБ
	|			И (Поручение.ВидОперацииД = &ВидПогашениеЦБ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЦенныеБумагиОбслуживание КАК ЦенныеБумагиОбслуживание
	|		ПО (ЦенныеБумагиОбслуживание.Проведен)
	|			И ЦенныеБумаги.ЦБ = ЦенныеБумагиОбслуживание.ЦБ
	|			И (ЦенныеБумагиОбслуживание.ВидОперацииД = &СнятиеСОбслуживания)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦБ.Остатки(
	|				&Период,
	|				ЦБ В
	|					(ВЫБРАТЬ
	|						ВТ_ЦенныеБумаги.ЦБ КАК ЦБ
	|					ИЗ
	|						ВТ_ЦенныеБумаги)) КАК ЦБОстатки
	|		ПО ЦенныеБумаги.ЦБ = ЦБОстатки.ЦБ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПогашения,
	|	ПоручениеПогашения,
	|	ДокументСнятия,
	|	ДатаОкончанияДействия";

КонецФункции	

Функция ТекстЗапросаКонтрольЗаПриемомЦБНаОбслуживание()
	
	Возврат 
	"ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка КАК ЦеннаяБумага
	|ПОМЕСТИТЬ ЦБОбслуживаемые
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|ГДЕ
	|	НЕ ЦенныеБумаги.ДатаПриемаНаОбслуживание = ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОбороты.ЦБ КАК ЦБ,
	|	ОстаткиЦБОбороты.ЦБ.ISIN КАК ISIN,
	|	ОстаткиЦБОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ОстаткиЦБОбороты.КоличествоРасход КАК КоличествоРасход
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Обороты(
	|			&ПериодНачало,
	|			&ПериодКонец,
	|			,
	|			НЕ ЦБ В
	|					(ВЫБРАТЬ
	|						ЦБОбслуживаемые.ЦеннаяБумага
	|					ИЗ
	|						ЦБОбслуживаемые)) КАК ОстаткиЦБОбороты
	|ГДЕ
	|	(ОстаткиЦБОбороты.КоличествоПриход <> 0
	|			ИЛИ ОстаткиЦБОбороты.КоличествоРасход <> 0)";
	
КонецФункции

// Выполняет проверки корректности приема и снятия ЦБ на/с обслуживания.
// 
// Возвращаемое значение:
//  Структура - Описание результатов контроля
//
Функция РезультатКонтроля() Экспорт
	
	ПараметрыСообщения = Новый Структура();
	ПараметрыСообщения.Вставить("ТекстКонтрольЗаПриемомЦБНаОбслуживание", "");
	ПараметрыСообщения.Вставить("ТекстКонтрольЗаСнятиемЦБсОбслуживания", "");
	
	КонтрольЗаСнятиемЦБсОбслуживания(ПараметрыСообщения);
	КонтрольЗаПриемомЦБНаОбслуживание(ПараметрыСообщения);
	
	Возврат ПараметрыСообщения;
	
КонецФункции

// Формирует связное описание результатов проверки корректности приема/снятия ЦБ
//
// Параметры:
//  ПараметрыСообщения	 - Структура	 - См. функцию РезультатыКонтроля()
// 
// Возвращаемое значение:
//  Строка - Текст для отправки письма о результатах контроля
//
Функция ТекстСообщенияКонтроля(ПараметрыСообщения) Экспорт
	
	НачальнаяДата = Формат(ПериодНачало, "ДЛФ=D");
	КонечнаяДата = Формат(ПериодКонец, "ДЛФ=D");
	
	Если Не ЗначениеЗаполнено(ПараметрыСообщения.ТекстКонтрольЗаПриемомЦБНаОбслуживание) Тогда
		ТекстСообщенияПрием = "Контроль за приемом - ОК" + Символы.ПС + "<br>";
	Иначе
		ТекстСообщенияПрием = "Обнаружены обороты по ценным бумагам с " + НачальнаяДата + " по " + КонечнаяДата 
		+ ", с незаполненной датой приема на обслуживание:" + Символы.ПС + "<br>" + ПараметрыСообщения.ТекстКонтрольЗаПриемомЦБНаОбслуживание;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ПараметрыСообщения.ТекстКонтрольЗаСнятиемЦБсОбслуживания) Тогда
		ТекстСообщенияСнятие = "Контроль за снятием - ОК" + Символы.ПС + "<br>";
	Иначе
		ТекстСообщенияСнятие = "За период с " + НачальнаяДата + " по " + КонечнаяДата
		+ " обнаружены ценные бумаги с незаполненной датой снятия с обслуживания:"
		+ Символы.ПС + "<br>" + ПараметрыСообщения.ТекстКонтрольЗаСнятиемЦБсОбслуживания;
	КонецЕсли;
	
	ТекстСообщения = ТекстСообщенияПрием + Символы.ПС + "<br>" + ТекстСообщенияСнятие;
	
	Возврат ТекстСообщения;
	
КонецФункции	

#Область Контроль

Процедура ВыполнитьКонтроль() Экспорт
	
	ПараметрыСообщения = РезультатКонтроля();
	ТекстСообщения = ТекстСообщенияКонтроля(ПараметрыСообщения);
	ОтправитьУведомлениеОНеПринятыхИНеСнятыхЦБсОбслуживания(ТекстСообщения);
	
КонецПроцедуры

Процедура КонтрольЗаПриемомЦБНаОбслуживание(ПараметрыСообщения)

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаКонтрольЗаПриемомЦБНаОбслуживание();
	
	Запрос.УстановитьПараметр("ПериодНачало", НачалоМесяца(ПериодНачало));
	Запрос.УстановитьПараметр("ПериодКонец", КонецМесяца(ПериодКонец));
	
	Выборка= Запрос.Выполнить().Выбрать();
	ТекстСообщения = "";
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = ТекстСообщения + Выборка.ЦБ + " (" + Выборка.ISIN + ")" + Символы.ПС + "<br>";
	КонецЦикла;
	
	ПараметрыСообщения.ТекстКонтрольЗаПриемомЦБНаОбслуживание = ТекстСообщения;
	
КонецПроцедуры

Процедура КонтрольЗаСнятиемЦБсОбслуживания(ПараметрыСообщения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаКонтрольЗаСнятиемЦБсОбслуживания();
	
	Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(ПериодКонец), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	Запрос.УстановитьПараметр("КлассификаторЗагрузкиНДЦ", Справочники.КлассификаторыЗагрузки.НДЦ());
	Запрос.УстановитьПараметр("ВидПогашениеЦБ", Справочники.ВидыОпераций.Погашение);
	Запрос.УстановитьПараметр("СнятиеСОбслуживания", Справочники.ВидыОпераций.СнятиеЦБсОбслуживания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ТекстСообщения = "";
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = ТекстСообщения + Выборка.ЦБ + " (" + Выборка.ISIN + "), код загрузки " + СокрЛП(Выборка.КодЗагрузки); 
		Если ЗначениеЗаполнено(Выборка.ДатаОкончанияДействия) Тогда
			ТекстСообщения = ТекстСообщения + ", код закрыт " + Формат(Выборка.ДатаОкончанияДействия, "ДЛФ=D");
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ДатаПогашения) Тогда
			ДатаПогашения = Формат(Выборка.ДатаПогашения, "ДЛФ=D");
			Если ЗначениеЗаполнено(Выборка.ПоручениеПогашения) Тогда
				ТекстСообщения = ТекстСообщения + ", погашена " + ДатаПогашения;
			Иначе
				ТекстСообщения = ТекстСообщения + ", плановая дата погашения " + ДатаПогашения;
			КонецЕсли;
		КонецЕсли;
		Если Выборка.КоличествоОстаток <> 0 Тогда
			ТекстСообщения = ТекстСообщения + ", остаток: " + Выборка.КоличествоОстаток;
		КонецЕсли;
		ТекстСообщения = ТекстСообщения + Символы.ПС + "<br>";
	КонецЦикла;
	
	ПараметрыСообщения.ТекстКонтрольЗаСнятиемЦБсОбслуживания = ТекстСообщения;
	
КонецПроцедуры	

// Отправляет электронной почтой переданный текст
//
// Параметры:
//  ТекстСообщения	 - Строка	 - Текст сообщения, которое необходимо отправить.
//
Процедура ОтправитьУведомлениеОНеПринятыхИНеСнятыхЦБсОбслуживания(ТекстСообщения) Экспорт
	
	ИмяСобытия = "Обработка Снятие ЦБ с обслуживания. Контроль за приемом/снятием с обслуживания";
	
	ВИ = ПланыВидовХарактеристик.ВнешниеИсточники.УведомлениеОКонтролеНепринятыхНеснятыхЦБ;
	НастройкаОтправкиУведомлений = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВИ).Настройка;
	Если Не ЗначениеЗаполнено(НастройкаОтправкиУведомлений) Тогда
		ТекстСообщенияЖР = "Не заполнена настройка для отправки уведомлений!" + Символы.ПС + ТекстСообщения;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Предупреждение, , , ТекстСообщенияЖР);
		Возврат;
	КонецЕсли;
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена"		, НастройкаОтправкиУведомлений);
	ПараметрыУведомления.Вставить("ТемаПисьма"			, ИмяСобытия);
	ПараметрыУведомления.Вставить("ТекстПисьма"		, ТекстСообщения);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма"		, ТипТекстаПочтовогоСообщения.HTML);
	ПараметрыУведомления.Вставить("Кодировка"			, "UTF-8");
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
	
КонецПроцедуры

#КонецОбласти

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);