// Количество ЦБ с обременением для списания
//
Перем КолСписЦБСОбрем;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура заполнения реквизитов в зависимости от вида операции
//
Процедура ЗаполнениеРеквизитовПоВидуОперации() Экспорт
	
	Если ВидОперацииД = Справочники.ВидыОпераций.Перевод Тогда
		
		МестоХраненияПолучатель 	= МестоХранения;
		СчетДепоМХПолучатель		= СчетДепоМХ;
		РазделСчетаДепоМХПолучатель	= РазделСчетаДепоМХ;
		
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Перемещение
				ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
		
		Получатель					= Инициатор;
		СчетДепоПолучатель			= СчетДепо;
		РазделСчетаДепоПолучатель 	= РазделСчетаДепо;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнениеРеквизитовПоВидуОперации()
	
#Если Клиент Тогда
	
// Функция определения достаточности остатка на счете для списания 
//
Функция НеХватаетОстатка(выбРегистр, выбМомент, выбИзмерения, выбЗначение, КолСписываемыхСОбременением=0)
	
	Перем ЕстьОшибка;
	
	ЕстьОшибка = ЛОЖЬ;
	текОстаток = выбРегистр.Остатки(выбМомент, выбИзмерения,,"Количество");
	
	Если текОстаток.Количество() = 0 ИЛИ текОстаток.Итог("Количество") < выбЗначение Тогда
		
		ЕстьОшибка = ИСТИНА;
		Возврат ЕстьОшибка;
		
	КонецЕсли;
	
	Если выбРегистр = РегистрыНакопления.ОстаткиЦБ Тогда
		
		ОстатокСвободных 		= 0;
		ОстатокСОбременением 	= 0;
		
		Для каждого СтрокаОстаток Из текОстаток Цикл
			
			Если СтрокаОстаток.СтатусЦБ = Перечисления.СтатусыЦБ.Свободна Тогда
				
				ОстатокСвободных = СтрокаОстаток.Количество;
				
			КонецЕсли;
			
			Если СтрокаОстаток.СтатусЦБ = Перечисления.СтатусыЦБ.Обременена Тогда
				
				ОстатокСОбременением = СтрокаОстаток.Количество;
				
			КонецЕсли;
			
		КонецЦикла; 
	
		Если ОстатокСвободных + ОстатокСОбременением < выбЗначение Тогда
			
			ЕстьОшибка = ИСТИНА;
			Возврат ЕстьОшибка;
			
		КонецЕсли;
		
		Если ОстатокСвободных < выбЗначение Тогда
			
			Если Вопрос("Списывать ЦБ с обременением?", РежимДиалогаВопрос.ДаНет,,,) = КодВозвратаДиалога.Да Тогда
				
				КолСписываемыхСОбременением = выбЗначение - ОстатокСвободных;
				
			Иначе
				
				ЕстьОшибка =  Истина;
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЕстьОшибка;
	
КонецФункции // НеХватаетОстатка()

// Функция определения наличия ошибок 
//
Функция ЕстьОшибки()
	
	Перем ЕстьОшибка;
	
	ЕстьОшибка = ЛОЖЬ;
	КолСписЦБСОбрем = 0;
	
	//ПРИЕМ ЦЕННЫХ БУМАГ НА ХРАНЕНИЕ И УЧЕТ
	Если ВидОперацииД = Справочники.ВидыОпераций.Депонирование Тогда
		
		Если СчетДепо.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.Закрыт Тогда
			
			Сообщить("Счет депо получателя закрыт!");
			ЕстьОшибка = ИСТИНА;
			
		ИначеЕсли СчетДепо.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.НеОткрыт Тогда
			
			Сообщить("Счет депо получателя не открыт!");
			ЕстьОшибка = ИСТИНА;
			
		КонецЕсли;
		
	//СНЯТИЕ ЦЕННЫХ БУМАГ С ХРАНЕНИЯ И УЧЕТА
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
	
		Если НеХватаетОстатка(РегистрыНакопления.ОстаткиЦБ, МоментВремени(), Новый Структура("СчетДепо,РазделСчетаДепо,СчетДепоМХ,РазделСчетаДепоМХ,ЦБ",СчетДепо,РазделСчетаДепо,СчетДепоМХ,РазделСчетаДепоМХ,ЦБ), Количество, КолСписЦБСОбрем) Тогда
				
			Сообщить("Количество списания превышает остаток на счете клиента!");
			ЕстьОшибка = ИСТИНА;
				
		КонецЕсли;	
		
	//ПЕРЕВОД ЦЕННЫХ БУМАГ
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Перевод Тогда
	
		Если СчетДепоПолучатель.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.Закрыт Тогда
			
			Сообщить("Счет депо получателя закрыт!");
			ЕстьОшибка = ИСТИНА;
			
		ИначеЕсли СчетДепоПолучатель.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.НеОткрыт Тогда
			
			Сообщить("Счет депо получателя не открыт!");
			ЕстьОшибка = ИСТИНА;
			
		КонецЕсли;		
		
		Если НеХватаетОстатка(РегистрыНакопления.ОстаткиЦБ, МоментВремени(), Новый Структура("СчетДепо,РазделСчетаДепо,СчетДепоМХ,РазделСчетаДепоМХ,ЦБ",СчетДепо,РазделСчетаДепо,СчетДепоМХ,РазделСчетаДепоМХ,ЦБ), Количество, КолСписЦБСОбрем) Тогда
				
			Сообщить("Количество списания превышает остаток на счете клиента!");
			ЕстьОшибка = ИСТИНА;
				
		КонецЕсли;
		
	//ПЕРЕМЕЩЕНИЕ ЦЕННЫХ БУМАГ
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Перемещение
				ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
	
		Если НеХватаетОстатка(РегистрыНакопления.ОстаткиЦБ, МоментВремени(), Новый Структура("СчетДепо,РазделСчетаДепо,СчетДепоМХ,РазделСчетаДепоМХ,ЦБ",СчетДепо,РазделСчетаДепо,СчетДепоМХ,РазделСчетаДепоМХ,ЦБ), Количество, КолСписЦБСОбрем) Тогда
				
			Сообщить("Количество списания превышает остаток на счете клиента!");
			ЕстьОшибка = ИСТИНА;
				
		КонецЕсли;	
		
	Иначе
		
		Сообщить("Данная операция документом Операция с ЦБ не производится!");
		ЕстьОшибка = ИСТИНА;
		
	КонецЕсли;		
	
	Возврат ЕстьОшибка;
	
КонецФункции // ЕстьОшибки()

#Конецесли
//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
    #Если Клиент Тогда
	Отказ = ЕстьОшибки();
	#Конецесли
	Если ВидОперацииД = Справочники.ВидыОпераций.Депонирование Тогда
			
		Движение = Движения.ЦБВПути.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.СчетДепо = СчетДепо;
		Движение.РазделСчетаДепо = РазделСчетаДепо;
		Движение.ЦБ = ЦБ;
		Движение.СчетДепоМХ = СчетДепоМХ;
		Движение.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
		Движение.Количество = Количество;

	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
			
		Движение = Движения.ЦБВПути.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.СчетДепо = СчетДепо;
		Движение.РазделСчетаДепо = РазделСчетаДепо;
		Движение.ЦБ = ЦБ;
		Движение.СчетДепоМХ = СчетДепоМХ;
		Движение.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
		Движение.Количество = Количество;
			
		Если Количество > КолСписЦБСОбрем Тогда
				
			Движение = Движения.ОстаткиЦБ.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.СчетДепо = СчетДепо;
			Движение.РазделСчетаДепо = РазделСчетаДепо;
			Движение.ЦБ = ЦБ;
			Движение.СчетДепоМХ = СчетДепоМХ;
			Движение.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
			Движение.СтатусЦБ = Перечисления.СтатусыЦБ.Свободна;
			Движение.Количество = Количество - КолСписЦБСОбрем;
				
		КонецЕсли;
			
		Если КолСписЦБСОбрем > 0 Тогда
				
			Движение = Движения.ОстаткиЦБ.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.СчетДепо = СчетДепо;
			Движение.РазделСчетаДепо = РазделСчетаДепо;
			Движение.ЦБ = ЦБ;
			Движение.СчетДепоМХ = СчетДепоМХ;
			Движение.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
			Движение.СтатусЦБ = Перечисления.СтатусыЦБ.Обременена;
			Движение.Количество = КолСписЦБСОбрем;
				
		КонецЕсли;
		
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Перевод
		ИЛИ ВидОперацииД = Справочники.ВидыОпераций.Перемещение
		ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
			
		Если Количество > КолСписЦБСОбрем Тогда
				
			Движение = Движения.ОстаткиЦБ.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.СчетДепо = СчетДепо;
			Движение.РазделСчетаДепо = РазделСчетаДепо;
			Движение.ЦБ = ЦБ;
			Движение.СчетДепоМХ = СчетДепоМХ;
			Движение.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
			Движение.СтатусЦБ = Перечисления.СтатусыЦБ.Свободна;
			Движение.Количество = Количество - КолСписЦБСОбрем;
				
		КонецЕсли;
			
		Если КолСписЦБСОбрем > 0 Тогда
				
			Движение = Движения.ОстаткиЦБ.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.СчетДепо = СчетДепо;
			Движение.РазделСчетаДепо = РазделСчетаДепо;
			Движение.ЦБ = ЦБ;
			Движение.СчетДепоМХ = СчетДепоМХ;
			Движение.РазделСчетаДепоМХ = РазделСчетаДепоМХ;
			Движение.СтатусЦБ = Перечисления.СтатусыЦБ.Обременена;
			Движение.Количество = КолСписЦБСОбрем;
				
		КонецЕсли;
			
		Движение = Движения.ЦБВПути.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.СчетДепо = СчетДепоПолучатель;
		Движение.РазделСчетаДепо = РазделСчетаДепоПолучатель;
		Движение.ЦБ = ЦБ;
		Движение.СчетДепоМХ = СчетДепоМХПолучатель;
		Движение.РазделСчетаДепоМХ = РазделСчетаДепоМХПолучатель;
		Движение.Количество = Количество;
			
	КонецЕсли;
		
	// записываем движения регистров
	Движения.ОстаткиЦБ.Записать();
	Движения.ЦБВПути.Записать();
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	// регистр ЦБВПути Приход

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры // ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	
	Если ВидОперацииД = Справочники.ВидыОпераций.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбран вид операции");  
		Отказ = Истина;			
		
	КонецЕсли;	    
	
	//Если СпособХранения = Перечисления.СпособыХранения.ПустаяСсылка() Тогда
	//	
	//	Предупреждение("Не выбран способ хранения");  
	//	Отказ = Истина;			
	//	
	//КонецЕсли;
	
	Если СчетДепоМХ = Справочники.СчетаДепоМХ.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбран счет депо хранилища");  
		Отказ = Истина;			
		
	КонецЕсли;
	
	Если СчетДепо = Справочники.СчетаДепо.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбран счет депо депонента");  
		Отказ = Истина;			
		
	КонецЕсли;	     
	
	Если РазделСчетаДепоМХ = Справочники.РазделыСчетаДепоМХ.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбран раздел счета депо хранилища");  
		Отказ = Истина;			
		
	КонецЕсли;	                                        
	
	Если РазделСчетаДепо = Справочники.РазделыСчетаДепо.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбран раздел счета депо депонента");  
		Отказ = Истина;			
		
	КонецЕсли;
	
	Если Инициатор = Справочники.Контрагенты.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбран депонент");  
		Отказ = Истина;			
		
	КонецЕсли;	
	
	Если МестоХранения = Справочники.МестаХранения.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбрано хранилище");  
		Отказ = Истина;			
		
	КонецЕсли;	
	
	Если ЦБ = Справочники.ЦенныеБумаги.ПустаяСсылка() Тогда
		
		Предупреждение("Не выбрана ценная бумага");  
		Отказ = Истина;			
		
	КонецЕсли;	
	
	Если Количество = 0 Тогда
		
		Предупреждение("Не задано количество");  
		Отказ = Истина;			
		
	КонецЕсли;
	
	Если ВидОперацииД = Справочники.ВидыОпераций.Перевод
		ИЛИ ВидОперацииД = Справочники.ВидыОпераций.Перемещение
		ИЛИ ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
		
		Если Получатель = Справочники.Контрагенты.ПустаяСсылка() Тогда
		
			Предупреждение("Не выбран депонент-получатель");  
			Отказ = Истина;			
		
		КонецЕсли;	
		
		Если СчетДепоПолучатель = Справочники.СчетаДепо.ПустаяСсылка() Тогда
		
			Предупреждение("Не выбран счет депо получателя");  
			Отказ = Истина;			
		
		КонецЕсли;	
		
		Если РазделСчетаДепоПолучатель = Справочники.РазделыСчетаДепо.ПустаяСсылка() Тогда
		
			Предупреждение("Не выбран раздел счета депо получателя");  
			Отказ = Истина;			
		
		КонецЕсли;	
		
		Если МестоХраненияПолучатель = Справочники.МестаХранения.ПустаяСсылка() Тогда
		
			Предупреждение("Не выбрано хранилище получателя");  
			Отказ = Истина;			
		
		КонецЕсли;	
		
		Если СчетДепоМХПолучатель = Справочники.СчетаДепоМХ.ПустаяСсылка() Тогда
		
			Предупреждение("Не выбран счет депо хранилища получателя");  
			Отказ = Истина;			
		
		КонецЕсли;	
		
		Если РазделСчетаДепоМХПолучатель = Справочники.РазделыСчетаДепоМХ.ПустаяСсылка() Тогда
		
			Предупреждение("Не выбран раздел счета депо хранилища получателя");  
			Отказ = Истина;			
		
		КонецЕсли;	
		
	КонецЕсли;
	
	#КонецЕсли

	УстановитьНовыйНомер();
КонецПроцедуры // ПередЗаписью()

Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если ЗначениеЗаполнено(Основание) И Основание.ВидОперацииД.КлассОпераций = Перечисления.КлассыОпераций.Инвентарные Тогда 
			
		ДокументОснование 	= Основание.Ссылка;			
		ВидОперацииД	 	= Основание.ВидОперацииД;			
		Комментарий			= "Поручение № " + Основание.Номер + " от " + Основание.Дата;
		Инициатор			= Основание.Инициатор;
		СчетДепо			= Основание.СчетДепо;
		РазделСчетаДепо		= Основание.РазделСчетаДепо;
		МестоХранения		= Основание.МХДепонента;
		ЦБ					= Основание.ЦБ;
		Цена                = Основание.ЦенаСделкиЦБ;
		Сумма               = Основание.СуммаСделки;
		Дата				= ОбщегоНазначения.ДатаДокумента(Основание);
			
		ЗаполнениеРеквизитовПоВидуОперации();
					
	Иначе
			
		Проверка = Истина;
		ДокументОснование 	= Документы.Поручение.ПустаяСсылка();			
		Сообщить("На основании данного вида поручения нельзя создать документ ""Ценные бумаги в пути"". 
				  |Класс операции должен относиться к классу инвентарных операций!");
				  
		Возврат;	
			
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения

////////////////////////////////////////////////////////////////////////////////
//процедуры печати
#Если Клиент Тогда
// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	СтруктураПечатныхФорм = Новый Структура;
	Возврат СтруктураПечатныхФорм;
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
КонецПроцедуры

#КонецЕсли

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры
