

//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Макет = Справочники.ДокументыУдостоверяющиеЛичность.ПолучитьМакет("КлассификаторИМНС");

	Макет.Параметры.Расшифровка = Истина; // чтобы работала расшифровка

	//ТабличныйДокумент = ЭлементыФормы.ПолеТабличногоДокумента;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Макет);

	ТабличныйДокумент.ФиксацияСверху      = 3;

	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку     = Ложь;
	ТабличныйДокумент.ТолькоПросмотр      = Истина;

КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
		СтандартнаяОбработка = Ложь;

	// Получение значений полей выбранной строки.
	//ТабличныйДокумент = ЭлементыФормы.ПолеТабличногоДокумента;
	ТекущаяОбласть    = ТабличныйДокумент.ТекущаяОбласть;

	ОбластьКодИМНС      = ТабличныйДокумент.Области.КодИМНС;
	ОбластьКодПФР       = ТабличныйДокумент.Области.КодПФР;
	ОбластьНаименование = ТабличныйДокумент.Области.Наименование;
    ОбластьПримечание   = ТабличныйДокумент.Области.Примечание;
	
	КодИМНС      = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьКодИМНС.        Лево, ТекущаяОбласть.Низ, ОбластьКодИМНС.        Право).Текст;
	КодПФР       = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьКодПФР.        Лево, ТекущаяОбласть.Низ, ОбластьКодПФР.        Право).Текст;
	Наименование = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименование.Лево, ТекущаяОбласть.Низ, ОбластьНаименование.Право).Текст;
    Примечание   = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьПримечание. Лево, ТекущаяОбласть.Низ, ОбластьПримечание. Право).Текст;
	
	//Проверка наличия выбранного элемента.
	Ссылка = ПолучитьСсылку(Наименование);
	
	Если НЕ Ссылка.Пустая() Тогда
		
		Вопрос = "В справочнике ""Документы, удостоверяющие личность"" уже существует элемент с наименованием """ + Наименование + """! Открыть существующий?";
		Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена, );
		
		Если      Ответ = КодВозвратаДиалога.Да Тогда
			
			Ссылка.ПолучитьФорму( , ВладелецФормы, ).Открыть();
			Возврат;

		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	// Создание нового элемента справочника.
	ФормаНовогоЭлемента = ПолучитьФорму("Справочник.ДокументыУдостоверяющиеЛичность.Форма.ФормаЭлемента",,ВладелецФормы);

	ФормаНовогоЭлемента.Объект.Наименование = Наименование;
	ФормаНовогоЭлемента.Объект.КодИМНС      = КодИМНС;
	ФормаНовогоЭлемента.Объект.КодПФР       = КодПФР;
	ФормаНовогоЭлемента.Открыть();


КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьСсылку(Наименование)
	
	Возврат Справочники.ДокументыУдостоверяющиеЛичность.НайтиПоНаименованию(Наименование);
	
КонецФункции

//#КонецОбласти


	

