#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		НуженРасчетКурса = (Запись.Цена <> 0 И Запись.ЦенаРуб = 0) Или (Запись.НКД <> 0 И Запись.НКДРуб = 0);
		Если НуженРасчетКурса Тогда
			ПроизвестиПересчетВРубли(Запись);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Произвести пересчет в рубли
//
// Параметры:
//  Запись	 - Структура - Структура, соответствующая записи регистра сведений "РасчетРыночныхЦенЦенныхБумаг"
//
Процедура ПроизвестиПересчетВРубли(Запись) Экспорт
	
	ДанныеВалюты = ОбщегоНазначения.ПолучитьКурсВалюты(Запись.Валюта, Запись.Период);
	КурсВалюты = ДанныеВалюты.Курс / ?(ДанныеВалюты.Кратность = 0, 1, ДанныеВалюты.Кратность);
	Если Запись.ЦенаРуб = 0 Тогда
		Запись.ЦенаРуб = Запись.Цена * КурсВалюты;
	КонецЕсли;
	Если Запись.НКДРуб = 0 Тогда
		Запись.НКДРуб = Запись.НКД * КурсВалюты;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти