
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыполнитьМетодОбъекта("ИнициироватьПараметры");
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодОтбораПриИзменении(Элемент)
	
	Объект.ПериодРасчета = КонецМесяца(Объект.ПериодОтбора.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура СформированныеДокументыПоПоручениямПриАктивизацииСтроки(Элемент)
	Элементы.ПорученияОснования.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдСтрокиУслуг", 
													?(Элемент.ТекущиеДанные = Неопределено, Неопределено, Элемент.ТекущиеДанные.ИдСтроки));
КонецПроцедуры

&НаКлиенте
Процедура СформированныеДокументыПоФормамW8ПриАктивизацииСтроки(Элемент)
		Элементы.ФормыW8Основания.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдСтрокиУслуг", 
													?(Элемент.ТекущиеДанные = Неопределено, Неопределено, Элемент.ТекущиеДанные.ИдСтроки));
КонецПроцедуры

&НаКлиенте
Процедура СформированныеУслугиПоПоручениямУслугиДепозитарияОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОповещениеПослеРедактированияУслуг = Новый ОписаниеОповещения("ПослеРедактированияУслуг", ЭтотОбъект);
	ОткрытьФорму("Документ.УслугиДепозитария.ФормаОбъекта",
		Новый Структура("Ключ", Элементы.СформированныеУслугиПоПоручениям.ТекущиеДанные.УслугиДепозитария),
		,
		,
		,
		,
		ОповещениеПослеРедактированияУслуг);
	
КонецПроцедуры

&НаКлиенте
Процедура СформированныеУслугиПоФормамW8УслугиДепозитарияОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОповещениеПослеРедактированияУслуг = Новый ОписаниеОповещения("ПослеРедактированияУслуг", ЭтотОбъект);
	ОткрытьФорму("Документ.УслугиДепозитария.ФормаОбъекта",
		Новый Структура("Ключ", Элементы.СформированныеУслугиПоФормамW8.ТекущиеДанные.УслугиДепозитария),
		,
		,
		,
		,
		ОповещениеПослеРедактированияУслуг);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияУслуг(Результат, Параметры) Экспорт
	
	ОбновитьСтатусыДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура СформированныеУслугиПоФормамW8ОтметкаПриИзменении(Элемент)	// BSLLS:LatinAndCyrillicSymbolInWord-off
	УстановитьОдинаковыеОтметкиДляВсехСтрокДокумента(Объект.УслугиПоФормамW8, Элементы.СформированныеУслугиПоФормамW8.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СформированныеУслугиПоПоручениямОтметкаПриИзменении(Элемент)
	УстановитьОдинаковыеОтметкиДляВсехСтрокДокумента(Объект.УслугиПоПоручениям, Элементы.СформированныеУслугиПоПоручениям.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СформированныеУслугиПоПоручениямВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СписокРеквизитовКПоказуСтрокой = "УслугиДепозитария,Контрагент,Договор,Валюта,ВидОперации,МестоХранения,Услуга,Выгодоприобретатель";
	ИмяТЧ = "УслугиПоПоручениям";
	ПоказатьЗначениеПоля(ИмяТЧ, ВыбраннаяСтрока, Поле, СписокРеквизитовКПоказуСтрокой);
КонецПроцедуры

&НаКлиенте
Процедура ПорученияОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СписокРеквизитовКПоказуСтрокой = "Документ,ВидОперацииД,ВидКД,Инициатор";
	ИмяТЧ = "ПорученияОснования";
	ПоказатьЗначениеПоля(ИмяТЧ, ВыбраннаяСтрока, Поле, СписокРеквизитовКПоказуСтрокой);
КонецПроцедуры

&НаКлиенте
Процедура СформированныеУслугиПоФормамW8Выбор(Элемент, ВыбраннаяСтрока, Поле, 	// BSLLS:LatinAndCyrillicSymbolInWord-off
																				СтандартнаяОбработка)
	СписокРеквизитовКПоказуСтрокой = "УслугиДепозитария,Контрагент,Договор,Валюта,ВидОперации,МестоХранения,Услуга,Выгодоприобретатель";
	ИмяТЧ = "УслугиПоФормамW8";
	ПоказатьЗначениеПоля(ИмяТЧ, ВыбраннаяСтрока, Поле, СписокРеквизитовКПоказуСтрокой);
КонецПроцедуры

&НаКлиенте
Процедура ФормыW8ОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	// BSLLS:LatinAndCyrillicSymbolInWord-off
	СписокРеквизитовКПоказуСтрокой = "Документ";
	ИмяТЧ = "ФормыW8Основания";
	ПоказатьЗначениеПоля(ИмяТЧ, ВыбраннаяСтрока, Поле, СписокРеквизитовКПоказуСтрокой);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьУслугиКНачислению(Команда)
	
	Если Объект.УслугиПоПоручениям.Количество() = 0
		И Объект.УслугиПоФормамW8.Количество() = 0 Тогда
		ВыполнитьМетодОбъекта("ЗаполнитьУслугиКНачислению");
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОПерезаполнении", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Очистить текущие данные?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПерезаполнении(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьМетодОбъекта("ЗаполнитьУслугиКНачислению");
		ОбновитьОтображениеДанных();
		Элемент = Элементы.СформированныеУслугиПоПоручениям;
		ИдСтрокиУслуг = ?(Элемент.ТекущиеДанные = Неопределено, Неопределено, Элемент.ТекущиеДанные.ИдСтроки);
		Элементы.ПорученияОснования.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдСтрокиУслуг", ИдСтрокиУслуг);
		Элемент = Элементы.СформированныеУслугиПоФормамW8;
		ИдСтрокиФорм = ?(Элемент.ТекущиеДанные = Неопределено, Неопределено, Элемент.ТекущиеДанные.ИдСтроки);
		Элементы.ФормыW8Основания.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдСтрокиУслуг", ИдСтрокиФорм);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	ВыполнитьМетодОбъекта("СформироватьДокументы");
КонецПроцедуры

&НаКлиенте
Процедура ОснованияКНачислениюУслуг(Команда)
	ПараметрыФормы = Новый Структура("Период, Контрагент", Объект.ПериодОтбора, Объект.Контрагент);
	ОткрытьФорму("Обработка.ФормированиеУслугДепозитария.Форма.ФормаОтчета", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПровестиУслугиПоПоручениям(Команда)
	ВыполнитьМетодОбъекта("ОбработатьУслуги", """УслугиПоПоручениям"", ""Провести""");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведениеУслугПоПоручениям(Команда)
	ВыполнитьМетодОбъекта("ОбработатьУслуги", """УслугиПоПоручениям"", ""ОтменитьПроведение""");
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеУслугиПоПоручениям(Команда)
	ВыполнитьМетодОбъекта("ОбработатьУслуги", """УслугиПоПоручениям"", ""ПометитьНаУдаление""");
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуУдаленияУслугиПоПоручениям(Команда)
	ВыполнитьМетодОбъекта("ОбработатьУслуги", """УслугиПоПоручениям"", ""СнятьПометкуУдаления""");
КонецПроцедуры

&НаКлиенте
Процедура ПровестиУслугиПоФормамW8(Команда)
	ВыполнитьМетодОбъекта("ОбработатьУслуги", """УслугиПоФормамW8"", ""Провести""");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведениеУслугФормамW8(Команда)
	ВыполнитьМетодОбъекта("ОбработатьУслуги", """УслугиПоФормамW8"", ""ОтменитьПроведение""");
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеУслугиПоФормамW8(Команда)
	ВыполнитьМетодОбъекта("ОбработатьУслуги", """УслугиПоФормамW8"", ""ПометитьНаУдаление""");
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуУдаленияУслугиПоФормамW8(Команда)
	ВыполнитьМетодОбъекта("ОбработатьУслуги", """УслугиПоФормамW8"", ""СнятьПометкуУдаления""");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкиУслугиПоПоручениям(Команда)
	ВыполнитьМетодОбъекта("УстановитьОтметки", """УслугиПоПоручениям""");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкиУслугиПоФормамW8(Команда)
	ВыполнитьМетодОбъекта("УстановитьОтметки", """УслугиПоФормамW8""");
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиУслугиПоПоручениям(Команда)
	ВыполнитьМетодОбъекта("СнятьОтметки", """УслугиПоПоручениям""");
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиУслугиПоФормамW8(Команда)
	ВыполнитьМетодОбъекта("СнятьОтметки", """УслугиПоФормамW8""");
КонецПроцедуры

&НаКлиенте
Процедура УдалитьУслугиПоПоручениям(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбУдалении", ЭтотОбъект, """УслугиПоПоручениям""");
	ПоказатьВопрос(Оповещение, "Удалить отмеченные услуги?", РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьУслугиПоФормамW8(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбУдалении", ЭтотОбъект, """УслугиПоФормамW8""");
	ПоказатьВопрос(Оповещение, "Удалить отмеченные услуги?", РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбУдалении(Результат, ИмяТаблицы) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьМетодОбъекта("УдалитьУслуги", ИмяТаблицы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	ОбновитьСтатусыДокументов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьМетодОбъекта(ИмяМетода, ПараметрыМетода = "")
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Выполнить("Обработка." + ИмяМетода + "(" + ПараметрыМетода + ")");
	ЗначениеВРеквизитФормы(Обработка, "Объект");
	
	ОбновитьСтатусыДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыДокументов()
	
	ДокументСоздан = 0;
	ДокументПроведен = 1;
	ДокументПомеченНаУдаление = 3;
	
	Услуги = Объект.УслугиПоПоручениям.Выгрузить(, "УслугиДепозитария").ВыгрузитьКолонку("УслугиДепозитария");
	УслугиПоФормамW8 = Объект.УслугиПоФормамW8.Выгрузить(, "УслугиДепозитария").ВыгрузитьКолонку("УслугиДепозитария");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Услуги, УслугиПоФормамW8);
	СтатусыУслуг = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Услуги, "Проведен, ПометкаУдаления");
	
	ТабличныеЧастиСУслугами = Новый Массив;
	ТабличныеЧастиСУслугами.Добавить("УслугиПоПоручениям");
	ТабличныеЧастиСУслугами.Добавить("УслугиПоФормамW8");
	
	Для Каждого ИмяТабличнойЧасти Из ТабличныеЧастиСУслугами Цикл
		Для Каждого Строка Из Объект[ИмяТабличнойЧасти] Цикл
			Строка.СтатусДокумента = ДокументСоздан;
			СтатусУслуги = СтатусыУслуг[Строка.УслугиДепозитария];
			Если ЗначениеЗаполнено(СтатусУслуги) Тогда
				Если СтатусУслуги.Проведен Тогда
					Строка.СтатусДокумента = ДокументПроведен;
				ИначеЕсли СтатусУслуги.ПометкаУдаления Тогда
					Строка.СтатусДокумента = ДокументПомеченНаУдаление;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОдинаковыеОтметкиДляВсехСтрокДокумента(ТабЧасть, ТекущиеДанные)
	ТекОтметка = ТекущиеДанные.Отметка;
	ТекКонтрагент = ТекущиеДанные.Контрагент;
	ТекДоговор = ТекущиеДанные.Договор;
	ТекДокумент = ТекущиеДанные.УслугиДепозитария;
	Для Каждого СтрокаТЧ Из ТабЧасть Цикл
		Если ЗначениеЗаполнено(ТекДокумент) И СтрокаТЧ.УслугиДепозитария = ТекДокумент Тогда
			СтрокаТЧ.Отметка = ТекОтметка;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекДокумент) И ЭтоСтрокаБезДокументаИСТемЖеКонтрагентомИДоговором(СтрокаТЧ, ТекКонтрагент, ТекДоговор) Тогда
			СтрокаТЧ.Отметка = ТекОтметка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ЭтоСтрокаБезДокументаИСТемЖеКонтрагентомИДоговором(СтрокаТЧ, ТекКонтрагент, ТекДоговор)
	Возврат Не ЗначениеЗаполнено(СтрокаТЧ.УслугиДепозитария) И СтрокаТЧ.Контрагент = ТекКонтрагент И СтрокаТЧ.Договор = ТекДоговор;
КонецФункции

&НаКлиенте
Процедура ПоказатьЗначениеПоля(ИмяТЧ, ВыбраннаяСтрока, ВыбранноеПоле, СписокРеквизитовКПоказуСтрокой)
	ИмяРеквизитаДляПоказа = Неопределено;
	ИменаРеквизитовКПоказу = СтрРазделить(СписокРеквизитовКПоказуСтрокой, ",");
	ИмяВыбранногоПоля = ВыбранноеПоле.Имя;
	Для Каждого ИмяРеквизита Из ИменаРеквизитовКПоказу Цикл
		Если СтрНайти(ИмяВыбранногоПоля, ИмяРеквизита) <> 0 Тогда
			ИмяРеквизитаДляПоказа = ИмяРеквизита;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ИмяРеквизитаДляПоказа <> Неопределено Тогда
		ТекСтрока = Объект[ИмяТЧ].НайтиПоИдентификатору(ВыбраннаяСтрока);
		Значение = ТекСтрока[ИмяРеквизитаДляПоказа];
		Если ЗначениеЗаполнено(Значение) Тогда
			ПоказатьЗначение(, Значение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
