//////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеОтображениемРеквизитовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	ДокументОснованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФормаСообщенияКК1ПриИзменении(Элемент)
	УправлениеОтображениемРеквизитовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумага_ПоПоручениюОРегистрацииЗаявкиВУКПаиПриИзменении(Элемент)
	ЦеннаяБумага_ПоПоручениюОРегистрацииЗаявкиВУКПаиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВходящийПакетИзФайловогоШлюза_ПоПоручениюОРегистрацииЗаявкиВУКПаиПриИзменении(Элемент)
	ВходящийПакетИзФайловогоШлюза_ПоПоручениюОРегистрацииЗаявкиВУКПаиПриИзмененииНаСервере();
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура ДобавитьТегиHTML(Команда)
	ДобавитьТегиHTMLНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУведомление(Команда)
	ОтправитьУведомлениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КОтправке(Команда)
	КОтправкеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтправленныеУведомления(Команда)
	Отбор = Новый Структура("КД", Объект.Ссылка);
	Парам = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет.ФормаСписка", Парам);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекстСообщения(Команда)
	ОбновитьТекстСообщенияНаСервере();
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off

&НаСервере
Процедура УправлениеОтображениемРеквизитовНаСервере()
	// Установка состава формы
	Если Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.СвободнаяФорма Тогда
		Элементы.ГруппаШапкаДокумента.Высота			= 4;
		Элементы.СтраницыШапкиДокумента.ТекущаяСтраница	= Элементы.СтраницаШапкиДокументаСвободнойФормы;		
		Элементы.СтраницаРеквизитов.Видимость = Ложь;
		Элементы.СтраницаКомментария.Видимость = Ложь;
		Элементы.ОбновитьТекстСообщенияБезКомментария.Видимость = Истина;
	ИначеЕсли Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.УведомлениеОРегистрацииЗаявкиВУКПаи Тогда
		Элементы.ГруппаШапкаДокумента.Высота = 4;
		Элементы.СтраницыШапкиДокумента.ТекущаяСтраница = Элементы.СтраницаШапкиДокументаПоПоручениюОРегистрацииЗаявкиВУКПаи;
		Элементы.СтраницаРеквизитов.Видимость = Ложь;
		Элементы.СтраницаКомментария.Видимость = Ложь;
		Элементы.ОбновитьТекстСообщенияБезКомментария.Видимость = Истина;
	Иначе
		Элементы.ГруппаШапкаДокумента.Высота			= 0;
		Элементы.СтраницыШапкиДокумента.ТекущаяСтраница = Элементы.СтраницаШапкиДокументаУстановленнойФормы;		
		Элементы.СтраницаРеквизитов.Видимость = Истина;
		Элементы.СтраницаКомментария.Видимость = Истина;
		Элементы.ОбновитьТекстСообщенияБезКомментария.Видимость = Ложь;
		УстановитьТекущуюСтраницуРеквизитовСообщенийНаСервере();
		ОтметитьНезаполненныеОбязательныеПоляНаСервере();
		Если ЗначениеЗаполнено(Объект.Эмитент) И ЗначениеЗаполнено(Объект.ЦеннаяБумага1) Тогда
			ЭтаФорма.ИндикаторРоссийскийЭмитент =
				?(Справочники.ЦенныеБумаги.ЭтоБумагаРоссийскогоЭмитента(Объект.ЦеннаяБумага1), "Российский", "Иностранный") + " эмитент";
		Иначе
			ЭтаФорма.ИндикаторРоссийскийЭмитент = "";
		КонецЕсли;
		
		Если Объект.ВидКД.Код = "WTRC" И ЗначениеЗаполнено(Объект.ЦеннаяБумага1) Тогда
			Элементы.ИндикаторЦБ1ПодпадаетПодНалоговоеРегулированиеСША.Видимость = Истина;
			Элементы.ИндикаторЦБ1ПодпадаетПодНалоговоеРегулированиеСША.Заголовок =
				?(Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(Объект.ЦеннаяБумага1), "Подпадает", "Не подпадает")
				+ " под налоговое регулирование США";
		Иначе
			Элементы.ИндикаторЦБ1ПодпадаетПодНалоговоеРегулированиеСША.Видимость = Ложь;
		КонецЕсли;
		
		Если Объект.ВидКД.Код = "WTRC" И ЗначениеЗаполнено(Объект.ЦеннаяБумага2) Тогда
			Элементы.ИндикаторЦБ2ПодпадаетПодНалоговоеРегулированиеСША.Видимость = Истина;
			Элементы.ИндикаторЦБ2ПодпадаетПодНалоговоеРегулированиеСША.Заголовок =
				?(Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(Объект.ЦеннаяБумага2), "Подпадает", "Не подпадает")
				+ " под налоговое регулирование США";
		Иначе
			Элементы.ИндикаторЦБ2ПодпадаетПодНалоговоеРегулированиеСША.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.SendEmailToClients 
		ИЛИ Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.CreateCorporateActionWtrc
		ИЛИ Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.CreateCorporateActionTrec Тогда 
		Элементы.ФормаСообщенияКК.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ФормаКОтправке.Видимость				= (Объект.Статус = Перечисления.СтатусыУведомленийКлиентам.Новый);
	Элементы.ФормаОтправитьУведомление.Видимость	= Документы.УведомлениеКлиентам.СтатусРазрешенДляОтправки(Объект.Статус);
	
	Если Объект.Статус = Перечисления.СтатусыУведомленийКлиентам.Новый
		ИЛИ Объект.Статус = Перечисления.СтатусыУведомленийКлиентам.ОжидаетОтправки
		ИЛИ Объект.Статус = Перечисления.СтатусыУведомленийКлиентам.СформированоСОшибками Тогда
		Элементы.ФормаЗаписатьИЗакрыть.Видимость			= Истина;
		Элементы.ФормаЗаписатьИЗакрыть.КнопкаПоУмолчанию	= Истина;
		Элементы.ФормаЗаписать.Видимость					= Истина;
		Элементы.ФормаЗакрыть.Видимость						= Ложь;
		Элементы.ТелоСообщения.АктивизироватьПоУмолчанию	= Истина;
	Иначе
		Элементы.ФормаЗаписатьИЗакрыть.Видимость	= Ложь;
		Элементы.ФормаЗаписать.Видимость			= Ложь;
		Элементы.ФормаЗакрыть.Видимость				= Истина;
		Элементы.ФормаЗакрыть.КнопкаПоУмолчанию		= Истина;
	КонецЕсли;
	
	// Установка доступности элементов формы
	Если Объект.Статус <> Перечисления.СтатусыУведомленийКлиентам.Новый Тогда
		ДоступныеЭлементы = Новый Массив;
		ДоступныеЭлементы.Добавить("ФормаКоманднаяПанель");
		ДоступныеЭлементы.Добавить("ФормаЗакрыть");
		ДоступныеЭлементы.Добавить("ФормаЗаписатьИЗакрыть");
		ДоступныеЭлементы.Добавить("ФормаЗаписать");
		ДоступныеЭлементы.Добавить("ФормаОбщаяКомандаСтруктураПодчиненности");
		ДоступныеЭлементы.Добавить("ФормаОтправитьУведомление");
		ДоступныеЭлементы.Добавить("ФормаПолучитьКлиентов");
		ДоступныеЭлементы.Добавить("ФормаКОтправке");
		ДоступныеЭлементы.Добавить("ФормаГруппаПерейти");
		ДоступныеЭлементы.Добавить("ФормаОтправленныеУведомления");
		
		Если Объект.Статус = Перечисления.СтатусыУведомленийКлиентам.ОжидаетОтправки
			ИЛИ Объект.Статус = Перечисления.СтатусыУведомленийКлиентам.СформированоСОшибками Тогда
			ДоступныеЭлементы.Добавить("Комментарий");
			ДоступныеЭлементы.Добавить("ОбновитьТекстСообщения");
			ДоступныеЭлементы.Добавить("ДополнительнаяИнформация");
		КонецЕсли;
	
		Для Каждого Элемент Из Элементы Цикл
			Если ТипЗнч(Элемент) = Тип("ГруппаФормы") ИЛИ ДоступныеЭлементы.Найти(Элемент.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда
				Элемент.Доступность = Ложь;
			Иначе
				Попытка
					Элемент.ТолькоПросмотр = Истина;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on

&НаСервере
Процедура ДобавитьТегиHTMLНаСервере()
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.ТелоСообщения = мОбъект.ДобавитьПараграфыHTML(мОбъект.ТелоСообщения);
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

// BSLLS:CognitiveComplexity-off
&НаСервере
Процедура УстановитьТекущуюСтраницуРеквизитовСообщенийНаСервере()
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПоступленииМатериаловКОбщемуСобраниюВладельцев Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПоступленииМатериаловКОбщемуСобраниюВладельцев;
		
	ИначеЕсли Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПоступленииИнформацииИзБюллетеня Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПоступленииИнформацииИзБюллетеня;
		
	ИначеЕсли Перечисления.ФормыСообщенийКК.ЭтоФормаСвязаннаяСВыкупомИлиПриобретениемЦБ(Объект.ФормаСообщенияКК) Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_ВыкупПриобретениеЦБ;
		Элементы.ГруппаИнициаторВыкупа.Видимость			= мОбъект.ВидимостьГруппы_ИнициаторВыкупа();
		Элементы.ГруппаЦенаРазмещения.Видимость				= мОбъект.ВидимостьГруппы_ЦенаРазмещения();
		Элементы.ДатаКДПлан_ВыкупПриобретениеЦБ.Видимость	= мОбъект.ВидимостьДатаКДПлан_ВыкупПриобретениеЦБ();
		
	ИначеЕсли Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_КонвертацияОбменЦБ Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_КонвертацияОбменЦБ;
		Элементы.ДатаФиксации_КонвертацияОбменЦБ.Видимость	= мОбъект.ВидимостьДатаФиксации_КонвертацияОбменЦБ();
		Элементы.НовыйНоминалАкций.Видимость				= мОбъект.ВидимостьНовыйНоминалАкций();
		Элементы.ГруппаКрайнийСрокПриемаТребованийОКонвертации.Видимость =
			мОбъект.ВидимостьГруппы_КрайнийСрокПриемаТребованийОКонвертации();
		
	ИначеЕсли Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ОбъединениеВыпусковЦБ Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_ОбъединениеВыпусковЦБ;
		
	ИначеЕсли Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_РеорганизацииОбщества Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_РеорганизацииОбщества;
		Элементы.ДатаЕГРЮЛ.Видимость = мОбъект.ВидимостьДатаВнесенияЗаписиЕГРЮЛ();
		
	ИначеЕсли Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_ПрочихВидов Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_ПрочихВидов;
		
	ИначеЕсли Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеКД Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОбОтменеКД;
		
	ИначеЕсли Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОПроведенииКД_CписаниеЦБ Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_CписаниеЦБ;
		
	ИначеЕсли Перечисления.ФормыСообщенийКК.ЭтоФормаСвязаннаяСВыплатой(Объект.ФормаСообщенияКК) Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_CвязанногоСВыплатой;
		Элементы.ГруппаБезДивидендов.Видимость		= мОбъект.ВидимостьГруппы_БезДивидендов();
		Элементы.ГруппаРазмерДивидендов.Видимость	= мОбъект.ВидимостьГруппы_РазмерДивидендов();
		Элементы.ГруппаПогашаемаяЧасть.Видимость	= мОбъект.ВидимостьГруппы_ПогашаемаяЧасть();
		Элементы.ГруппаКупонныйДоход.Видимость		= мОбъект.ВидимостьГруппы_КупонныйДоход();
		
	ИначеЕсли Объект.ФормаСообщенияКК =
		Перечисления.ФормыСообщенийКК.ОПроведенииКД_ПодтверждениеОсвобожденияОтНалога Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_ОсвобожденияОтНалога;
		
	ИначеЕсли Перечисления.ФормыСообщенийКК.ЭтоФормаСвязаннаяСвозвратомЧастиНалога(Объект.ФормаСообщенияКК) Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_ВозвратЧастиНалога;
		
	ИначеЕсли Объект.ФормаСообщенияКК =
		Перечисления.ФормыСообщенийКК.ОПроведенииКД_СущественноеИзменениеПоЦБИноеСобытие Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_СущественноеИзменениеПоЦБИноеСобытие;
		
	ИначеЕсли Объект.ФормаСообщенияКК =
		Перечисления.ФормыСообщенийКК.ОПроведенииКД_РаскрытиеИнформации Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_РаскрытиеИнформации;
		
	ИначеЕсли Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбИтогахСобрания Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОбИтогахСобрания;
		
	ИначеЕсли Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.ОбОтменеСобрания Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОбОтменеСобрания;
		
	ИначеЕсли Объект.ФормаСообщенияКК =
		Перечисления.ФормыСообщенийКК.ОПроведенииКД_ПодтверждениеОсвобожденияОтНалогаПоЦБНеПодпадающимПодНалоговоеРегулированиеСША Тогда
		ТекущаяСтраница = Элементы.СтраницаСообщениеОПроведенииКД_ОсвобожденияОтНалогаНеСША;
		
	Иначе
		ТекущаяСтраница = Неопределено;
	КонецЕсли;
	
	УстановитьТекущуюСтраницуРеквизитовСообщений(ТекущаяСтраница);
КонецПроцедуры
// BSLLS:CognitiveComplexity-on

&НаСервере
Процедура УстановитьТекущуюСтраницуРеквизитовСообщений(ТекущаяСтраница)
	Если ТекущаяСтраница <> Неопределено Тогда
		Элементы.СтраницыРеквизитыСообщений.ТекущаяСтраница = ТекущаяСтраница;
	КонецЕсли;
	Элементы.СтраницыРеквизитыСообщений.Видимость = ТекущаяСтраница <> Неопределено;
КонецПроцедуры

&НаСервере
Процедура ОтметитьНезаполненныеОбязательныеПоляНаСервере()
	Если ЗначениеЗаполнено(Объект.СписокНезаполненныхОбязательныхПолей) Тогда
		Попытка
			НезаполненныеОбязательныеПоля = ЗначениеИзСтрокиВнутр(Объект.СписокНезаполненныхОбязательныхПолей);
		Исключение
			Возврат;
		КонецПопытки;
		
		Если ТипЗнч(НезаполненныеОбязательныеПоля) = Тип("Массив") Тогда
			Для Каждого ИмяЭлемента Из НезаполненныеОбязательныеПоля Цикл
				ЭлементФормы = Элементы.Найти(ИмяЭлемента);
				Если ЭлементФормы <> Неопределено Тогда
					ЭлементФормы.АвтоОтметкаНезаполненного = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьУведомлениеНаСервере()
	мОбъект = РеквизитФормыВЗначение("Объект");
	Если ЭтаФорма.Модифицированность Тогда
		мОбъект.Записать();
		ЭтаФорма.Модифицированность = Ложь;
	КонецЕсли;
	мОбъект.ПодготовитьУведомление();
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
	УправлениеОтображениемРеквизитовНаСервере();
КонецПроцедуры

&НаСервере
Процедура КОтправкеНаСервере()
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.Статус = Перечисления.СтатусыУведомленийКлиентам.ОжидаетОтправки;
	мОбъект.Записать();
	ЭтаФорма.Модифицированность = Ложь;
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
	УправлениеОтображениемРеквизитовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстСообщенияНаСервере()
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.СформироватьJSON();
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере()
	Если Объект.ФормаСообщенияКК = Перечисления.ФормыСообщенийКК.СвободнаяФорма Тогда
		Объект.ВидКД = Объект.ДокументОснование.ВидКД;
		Объект.ЦеннаяБумага1 = Объект.ДокументОснование.ЦеннаяБумага1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКлиентовДляРассылкиУведомлений(Команда)
	ТабличныйДокумент = ОтчетПоКлиентамНаСервере();
	Если ТабличныйДокумент = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет актуальных данных или произошла ошибка.");
	Иначе
		ТабличныйДокумент.Показать("Список клиентов для отправки уведомлений.");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОтчетПоКлиентамНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Клиенты = ДокументОбъект.КлиентыДляОтправкиУведомлений();
	
	Если ЗначениеЗаполнено(Клиенты) Тогда
		ТабличныйДокумент = ОбщегоНазначения.ДанныеТаблицыЗначенийВТабличныйДокументСКД(Клиенты);
		Возврат ТабличныйДокумент;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЦеннаяБумага_ПоПоручениюОРегистрацииЗаявкиВУКПаиПриИзмененииНаСервере()
	Объект.Эмитент = Объект.ЦеннаяБумага1.Эмитент;
КонецПроцедуры

&НаСервере
Процедура ВходящийПакетИзФайловогоШлюза_ПоПоручениюОРегистрацииЗаявкиВУКПаиПриИзмененииНаСервере()
		Если ЗначениеЗаполнено(Объект.ВходящийПакетИзФайловогоШлюза) Тогда
			Объект.ДатаСообщения = Объект.ВходящийПакетИзФайловогоШлюза.Дата;
		Иначе
			Объект.ДатаСообщения = ТекущаяДатаСеанса();
		КонецЕсли;
КонецПроцедуры


