

//Обработчик события создания документа "Назначение представителя счета депо" на основании.
//
Процедура ОбработкаЗаполнения(Основание)
	
		
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение") 
		Или ТипЗнч(Основание) = Тип("ДокументОбъект.Поручение") Тогда
		
		Если 	Основание.ВидОперацииД   = Справочники.ВидыОпераций.НазначениеОператораСчетаДепо 
			ИЛИ Основание.ВидОперацииД   = Справочники.ВидыОпераций.НазначениеПопечителяСчетаДепо 
			ИЛИ Основание.ВидОперацииД   = Справочники.ВидыОпераций.НазначениеРаспорядителяСчетаДепо	Тогда
			
			ДокументОснование 				= Основание.Ссылка;			
			ВладелецСчета 					= Основание.Инициатор;
			СчетДепо						= Основание.СчетДепо;
			ВидПредставителяСчетаДепо 		= Основание.ВидПредставителяСчетаДепо;
			ПредставительСчетаДепо			= Основание.ПредставительСчетаДепо;
			НомерДоверенностиПредставителя  = Основание.НомерДоверенностиПредставителя;
			ДатаНачалаДоверенности			= Основание.ДатаНачалаДоверенности;
			ДатаОкончанияДоверенности		= Основание.ДатаОкончанияДоверенности;
			Дата							= Основание.ДатаИсполненияПоручения;
			
		Иначе
			
			Проверка = Истина;
			Сообщить("На основании данного вида поручения нельзя создать документ Назначение представителя счета депо !!!");
			Возврат;	
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//проверка  ВидПредставителяСчетаДепо.
	Если Не ЗначениеЗаполнено(ВидПредставителяСчетаДепо) 
		ИЛИ Не ЗначениеЗаполнено(ПредставительСчетаДепо) Тогда
		
		Сообщить("Не заполнен вид или не выбран представитель счета депо!");
		Отказ	=	Истина;
		
	КонецЕсли; 
	
	//проверка  ВладелецСчета.
	Если ОбщегоНазначения.ПроверкаЗаполненностиРеквизитов1(ВладелецСчета) Тогда
		
		Сообщить("Не заполнены реквизиты документа!!!");
		Отказ = Истина;
	
	КонецЕсли; 

	Если ВидПредставителяСчетаДепо = Перечисления.ВидыПредставителейСчетаДепо.Оператор      Тогда
		ОперацияУслуги = Справочники.ВидыОпераций.НазначениеОператораСчетаДепо; 
	ИначеЕсли ВидПредставителяСчетаДепо = Перечисления.ВидыПредставителейСчетаДепо.Попечитель Тогда 												
		ОперацияУслуги = Справочники.ВидыОпераций.НазначениеПопечителяСчетаДепо; 
	ИначеЕсли ВидПредставителяСчетаДепо = Перечисления.ВидыПредставителейСчетаДепо.Распорядитель Тогда
		ОперацияУслуги = Справочники.ВидыОпераций.НазначениеРаспорядителяСчетаДепо; 
	КонецЕсли;											
  	
	Движение 									= Движения.ПредставителиСчетаДепо.Добавить();
	Движение.Период								= Дата;
	Движение.СчетДепо 							= СчетДепо;		  
	Движение.ВидПредставителя 					= ВидПредставителяСчетаДепо;
	Движение.Представитель 						= ПредставительСчетаДепо;
	Движение.СтатусПредставителя 				= Перечисления.СтатусыПредставителей.Назначен;
	Движение.НомерДоверенности      			= НомерДоверенностиПредставителя;
	Движение.ДатаНачалаДействияДоворенности		= ДатаНачалаДоверенности;
	Движение.ДатаОкончанияДействияДоверенности	= ДатаОкончанияДоверенности;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//процедуры печати
#Если Клиент Тогда
// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	СтруктураПечатныхФорм = Новый Структура;
	Возврат СтруктураПечатныхФорм;
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
КонецПроцедуры

#КонецЕсли

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

