
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ТекущийОбъект.ВыражениеПоручения) 
		И РегистрыСведений.ПараметрыСделокДляЭкспортаВЛуч.ЗначениеПараметра(Документы.Поручение.ПустаяСсылка(), ТекущийОбъект.ВыражениеПоручения) = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОбъект.ВыражениеНеттоПоручения) 
		И РегистрыСведений.ПараметрыСделокДляЭкспортаВЛуч.ЗначениеПараметра(Документы.НеттоПоручение.ПустаяСсылка(), ТекущийОбъект.ВыражениеНеттоПоручения) = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыражениеПорученияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФормуРедактирования(Элементы.ВыражениеПоручения.ТекстРедактирования, ПредопределенноеЗначение("Документ.Поручение.ПустаяСсылка"), Элементы.ВыражениеПоручения);
КонецПроцедуры

&НаКлиенте
Процедура ВыражениеНеттоПорученияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФормуРедактирования(Элементы.ВыражениеНеттоПоручения.ТекстРедактирования, ПредопределенноеЗначение("Документ.НеттоПоручение.ПустаяСсылка"), Элементы.ВыражениеНеттоПоручения);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактирования(Текст, Документ, Элемент)
	ОткрытьФорму("РегистрСведений.ПараметрыСделокДляЭкспортаВЛуч.Форма.ФормаРедактированияШаблона", Новый Структура("Шаблон,Поручение", Текст, Документ), Элемент);
КонецПроцедуры
