
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрыОтчета	= КомпоновщикНастроек.Настройки.ПараметрыДанных;
		
	Если ЗначениеЗаполнено(Поручение) Тогда
		ПараметрыОтчета.Элементы.Найти("ДатаНачала").Использование = Ложь;
		ПараметрыОтчета.Элементы.Найти("ДатаОкончания").Использование = Ложь;
	Иначе
		Если Не ЗначениеЗаполнено(ДатаНачала) И Не ЗначениеЗаполнено(ДатаОкончания) Тогда
			ВызватьИсключение "Необходимо заполнить ""Период"" или ""Поручение"" для формирования отчета";
		КонецЕсли;
		ПараметрыОтчета.УстановитьЗначениеПараметра("ДатаНачала"	, ДатаНачала);
		ПараметрыОтчета.УстановитьЗначениеПараметра("ДатаОкончания"	, ДатаОкончания);
	КонецЕсли;
	
	ПараметрПоручение = ПараметрыОтчета.Элементы.Найти("Поручение");
	Если Не ПараметрПоручение = Неопределено Тогда
		ПараметрПоручение.Значение		= Поручение;
		ПараметрПоручение.Использование	= ЗначениеЗаполнено(Поручение);
	КонецЕсли;
	
КонецПроцедуры

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
