//#Область ОписаниеПеременных

&НаСервере
Перем мТекущийОбъектНаСервере;

//#КонецОбласти 

//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	глТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	ЗаполнитьСписокВыбораНаименования(ЭтаФорма);
	ПриИзмененииВидаКонтактногоЛица(ЭтаФорма);

	текФамилия  = Объект.Фамилия;
	текИмя      = Объект.Имя;
	текОтчество = Объект.Отчество;

	ДоступностьОтветственного(ЭтаФорма);
	ВидимостьДопонительнойИнформации(ЭтаФорма);

	// Установим ЭУ по умолчанию
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Объект.ВидКонтактногоЛица) Тогда
		ТекущийЭлемент = Элементы.ВидКонтактногоЛица;

	ИначеЕсли Объект.ВидКонтактногоЛица = Перечисления.ВидыКонтактныхЛиц.КонтактноеЛицоКонтрагента 
			И ОбщегоНазначения.ЗначениеНеЗаполнено(Объект.ОбъектВладелец) Тогда

		ТекущийЭлемент = Элементы.ОбъектВладелец;

	Иначе
		ТекущийЭлемент = Элементы.Фамилия;

	КонецЕсли;	
	
	КонтактнаяИнформацияСервер.ПриСозданииНаСервере(ЭтаФорма);	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	КонтактнаяИнформацияСервер.ПриЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, Отказ);	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)

	Фамилия = Объект.Фамилия;

	ПозицииПробелов = ОпределитьПозицииПробелов();

	Если ПозицииПробелов[0] > 0 Тогда
		ФамилияИзНаименования = Сред(Объект.Наименование, 1, (ПозицииПробелов[0] - 1));
		Если ФамилияИзНаименования <> текФамилия И НЕ ПустаяСтрока(ФамилияИзНаименования) Тогда
			текФамилия = СокрЛП(Фамилия);
			Возврат;
		КонецЕсли;

		Объект.Наименование = СокрЛП(Фамилия) + Сред(Объект.Наименование, ПозицииПробелов[0]);

	Иначе
		Если ПустаяСтрока(Объект.Наименование) Тогда
			Объект.Наименование = СокрЛП(Фамилия);

		Иначе
			Если СокрЛП(Объект.Наименование) = текФамилия Тогда
				Объект.Наименование = СокрЛП(Фамилия);

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	ТекФамилия = СокрЛП(Фамилия);
	
	ЗаполнитьСписокВыбораНаименования(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)

	Имя = Объект.Имя;
	ПозицииПробелов = ОпределитьПозицииПробелов();

	Если ПозицииПробелов[0] > 0 И ПозицииПробелов[1] > 0 Тогда
		ИмяИзНаименования = Сред(Объект.Наименование, (ПозицииПробелов[0] + 1), (ПозицииПробелов[1] - ПозицииПробелов[0] - 1));

		Если ИмяИзНаименования <> текИмя И НЕ ПустаяСтрока(ИмяИзНаименования) Тогда
			текИмя = СокрЛП(Имя);
			Возврат;
		КонецЕсли;

		Объект.Наименование = Сред(Объект.Наименование, 1, ПозицииПробелов[0]) + СокрЛП(Имя) + Сред(Объект.Наименование, ПозицииПробелов[1]);

	ИначеЕсли ПозицииПробелов[0] > 0 Тогда
		ИмяИзНаименования = Сред(Объект.Наименование, (ПозицииПробелов[0] + 1));
		Если ИмяИзНаименования <> текИмя И НЕ ПустаяСтрока(ИмяИзНаименования) Тогда
			текИмя = СокрЛП(Имя);
			Возврат;
		КонецЕсли; 

		Объект.Наименование = Сред(Объект.Наименование, 1, ПозицииПробелов[0]) + СокрЛП(Имя);

	Иначе
		Если НЕ ПустаяСтрока(Объект.Наименование) Тогда
			Объект.Наименование = Объект.Наименование + " " + СокрЛП(Имя);
		Иначе
			Объект.Наименование = " " + СокрЛП(Имя);

		КонецЕсли; 
	КонецЕсли;

	текИмя = СокрЛП(Имя);
	
	ЗаполнитьСписокВыбораНаименования(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)

	Отчество = Объект.Отчество;
	ПозицииПробелов = ОпределитьПозицииПробелов();

	Если ПозицииПробелов[1] > 0 Тогда
		ОтчествоИзНаименования = Сред(Объект.Наименование, (ПозицииПробелов[1] + 1));
		Если ОтчествоИзНаименования <> текОтчество И НЕ ПустаяСтрока(ОтчествоИзНаименования) Тогда
			текОтчество = СокрЛП(Отчество);
			Возврат;
		КонецЕсли;

		Объект.Наименование = Сред(Объект.Наименование, 1, ПозицииПробелов[1]) + СокрЛП(Отчество);
	Иначе
		Если НЕ ПустаяСтрока(Объект.Наименование) Тогда
			Объект.Наименование = Объект.Наименование + " " + СокрЛП(Отчество);
		Иначе
			Объект.Наименование = "  " + СокрЛП(Отчество);
		КонецЕсли;
	КонецЕсли;

	текОтчество = СокрЛП(Отчество);	
	
	ЗаполнитьСписокВыбораНаименования(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВидКонтактногоЛицаПриИзменении(Элемент)
	ПриИзмененииВидаКонтактногоЛица(ЭтаФорма);
	ДоступностьОтветственного(ЭтаФорма);
	ВидимостьДопонительнойИнформации(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОбъектВладелецПриИзменении(Элемент)
	ПриИзмененииВидаКонтактногоЛица(ЭтаФорма);
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыНаборКонтактнаяИнформация

&НаКлиенте
Процедура НаборКонтактнаяИнформацияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	КонтактнаяИнформацияКлиент.НачалоВыбораПредставления(ЭтаФорма);
КонецПроцедуры

//#КонецОбласти 

//#Область СлужебныеПроцедурыИФункции

//#Область Сервис

&НаКлиентеНаСервереБезКонтекста
Функция ВидыКонтактныхЛиц(ИмяЗначенияПеречисления)
	Возврат ЗначениеПеречисления("ВидыКонтактныхЛиц", ИмяЗначенияПеречисления);	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПеречисления(ИмяВида, ИмяЗначения)	
	ПолноеИмя = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Перечисление.%1.%2", ИмяВида, ИмяЗначения);
	Возврат ПредопределенноеЗначение(ПолноеИмя);	
КонецФункции

//#КонецОбласти 

//#Область Диалог

// Процедура обрабатывает событие ПриИзменении реквизита ВидКонтактногоЛица.
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииВидаКонтактногоЛица(Форма)

	ОбъектФормы = Форма.Объект;
		
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(ОбъектФормы.ВидКонтактногоЛица) Тогда
		ОбъектФормы.ВидКонтактногоЛица = ВидыКонтактныхЛиц("ЛичныйКонтакт");
	КонецЕсли;

	Если ОбъектФормы.ВидКонтактногоЛица = ВидыКонтактныхЛиц("КонтактноеЛицоКонтрагента") Тогда

		Если ТипЗнч(ОбъектФормы.ОбъектВладелец) <> Тип("СправочникСсылка.Контрагенты") Тогда
			ОбъектФормы.ОбъектВладелец = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		КонецЕсли;

	ИначеЕсли ОбъектФормы.ВидКонтактногоЛица = ВидыКонтактныхЛиц("ЛичныйКонтакт") Тогда
		Если ОбъектФормы.ОбъектВладелец <> Форма.глТекущийПользователь Тогда
			ОбъектФормы.ОбъектВладелец = Форма.глТекущийПользователь;
		КонецЕсли;

	Иначе

		Если ТипЗнч(ОбъектФормы.ОбъектВладелец) <> Тип("СправочникСсылка.Пользователи") Тогда
			ОбъектФормы.ОбъектВладелец = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// Процедура управляет доступностью поля ввода ОбъектВладелец.
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ДоступностьОтветственного(Форма)
	ОбъектФормы = Форма.Объект;
	ЭлементыФормы = Форма.Элементы;

	Если ОбъектФормы.ВидКонтактногоЛица = ВидыКонтактныхЛиц("КонтактноеЛицоКонтрагента") Тогда

		ЭлементыФормы.ОбъектВладелец.Заголовок = "Контрагент";
		ЭлементыФормы.ОбъектВладелец.ТолькоПросмотр = Ложь;

	ИначеЕсли ОбъектФормы.ВидКонтактногоЛица = ВидыКонтактныхЛиц("ЛичныйКонтакт") Тогда

		ЭлементыФормы.ОбъектВладелец.Заголовок = "Ответственный";
		ЭлементыФормы.ОбъектВладелец.ТолькоПросмотр = Истина;

	ИначеЕсли ОбъектФормы.ВидКонтактногоЛица = ВидыКонтактныхЛиц("ПрочееКонтактноеЛицо") Тогда
		ЭлементыФормы.ОбъектВладелец.Заголовок = "Ответственный";
		ЭлементыФормы.ОбъектВладелец.ТолькоПросмотр = Ложь;

	КонецЕсли;

КонецПроцедуры

// Процедура управляет видимостью панели данных (роль, должность).
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьДопонительнойИнформации(Форма)
	ОбъектФормы = Форма.Объект;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементыФормы.ГруппаДопИнфоКонтрагента.Видимость = 
		ОбъектФормы.ВидКонтактногоЛица = ВидыКонтактныхЛиц("КонтактноеЛицоКонтрагента");

КонецПроцедуры

//#КонецОбласти 

//#Область СборДанных

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораНаименования(Форма)
	
	Фамилия = Форма.Объект.Фамилия;
	Имя = Форма.Объект.Имя;
	Отчество = Форма.Объект.Отчество;
	
	СписокВыбора = Форма.Элементы.Наименование.СписокВыбора;
	СписокВыбора.Очистить();

	Если НЕ ПустаяСтрока(Фамилия) Тогда
		СписокВыбора.Добавить(СокрЛП(Фамилия));
	КонецЕсли;

	Если НЕ ПустаяСтрока(Фамилия) И НЕ ПустаяСтрока(Имя) Тогда
		СписокВыбора.Добавить((СокрЛП(Фамилия) + " " + СокрЛП(Имя)));
		СписокВыбора.Добавить((СокрЛП(Фамилия) + " " + СокрЛП(Сред(Имя,1,1)) + "."));
	КонецЕсли;

	Если НЕ ПустаяСтрока(Фамилия) И НЕ ПустаяСтрока(Имя) И НЕ ПустаяСтрока(Отчество) Тогда
		СписокВыбора.Добавить((СокрЛП(Фамилия) + " " + СокрЛП(Имя) + " " + СокрЛП(Отчество)));
		СписокВыбора.Добавить((СокрЛП(Фамилия) + " " + СокрЛП(Сред(Имя,1,1)) + "." + СокрЛП(Сред(Отчество,1,1)) + "."));
	КонецЕсли;
	
КонецПроцедуры
 
// Функция определяет номера позиций пробелов в строке реквизита Наименование
//
// Параметры
//  НЕТ
//
// Возвращаемое значение
//  Массив, числа - позиции пробелов в строке
//
&НаКлиенте
Функция ОпределитьПозицииПробелов()

	Пробелы = Новый Массив;

	Для а = 1 По 2 Цикл

		Пробелы.Добавить(0);

	КонецЦикла; 

	КолПробелов = 0;

	Для а = 1 По СтрДлина(Объект.Наименование) Цикл

		Если Сред(Объект.Наименование, а, 1) = " " Тогда

			Пробелы[КолПробелов] = а;
			КолПробелов = КолПробелов + 1;

		КонецЕсли;

		Если КолПробелов = 2 Тогда

			Прервать;

		КонецЕсли;

	КонецЦикла;

	Возврат Пробелы;

КонецФункции

//#КонецОбласти 

//#КонецОбласти