//#Область ОписаниеПеременных

&НаСервере
Перем мТекущийОбъектНаСервере;

&НаКлиенте
Перем мФормироватьНаименованиеПолноеАвтоматически;

//#КонецОбласти 

//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	                                          
	КонтактнаяИнформацияСервер.ПриСозданииНаСервере(ЭтаФорма, "ЮридическиеФизическиеЛица");
	НастроитьЭлементыПриСозданииНаСервере();
	НастроитьФорму();		
		
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);	
	КИПоЗакону = РегистрыСведений.РеестрКвалифицированныхИнвесторовПоЗакону.ЕстьКИПОЗакону(Объект.ЮридическиеФизическиеЛица, ТекущаяДата());
	
	ПредЮрФизЛицо = Объект.ЮрФизЛицо;
	
	ЗаполнитьФормуW8();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьФлагФормироватьНаименованиеПолноеАвтоматически();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		Если ВыбранноеЗначение = "ОбновлениеКонтактнойИнформации" Тогда
			ОбновитьТелефоныКонтактногоЛица();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновленыПредоставленныеДокументы" Тогда
		//ПрочитатьНаборЗаписейНаСервере("НаборПредоставленныеДокументы", "Депонент", Объект.Ссылка);
		УстановитьОтборПредоставленныеДокументы(ЭтаФорма);
		//УстановитьОтборСписка(ПредоставленныеДокументы, Объект.Ссылка, "Депонент");
		ЗаполнитьФормуW8();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПрочитатьНаборыЗаписейНаСервере(ТекущийОбъект);
	КатегорияРолиКлиентаСогласноУказов81и95 =
		РегистрыСведений.КатегорииРолейКлиентовСогласноУказов81и95.КатегорияРолиКлиента(Объект.Ссылка);
	ОтобразитьНаличиеСчетовТипаC();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.ГоловнойКонтрагент) Тогда
		Объект.ГоловнойКонтрагент = Объект.Ссылка;
	КонецЕсли;
	
	ЭтоФизЛицо = Объект.ЮрФизЛицо = ЮрФизЛицо("ФизЛицо");
	Если ЭтоФизЛицо И Не ЗначениеЗаполнено(Объект.ЮридическиеФизическиеЛица) Тогда
		Отказ = Истина;
		Сообщить("Не заполнено поле Физ. лицо"); 
	КонецЕсли; 
	
	// Проверка на заполненость поля - Получатель
	ЭтоБезнал = Объект.ФормаВыплатыДоходов = ЗначениеПеречисления("ФормыВыплатыДоходовПоЦБ", "Безналичная");
	Если ЭтоБезнал И Не ЗначениеЗаполнено(Объект.Получатель) Тогда
		Отказ = Истина;
		Сообщить("Не заполнено поле Получатель при выборе формы выплаты доходов - безналичная"); 
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДопСвойства = Новый Структура("НеПерезаполнятьРегионДляОтчетов", Истина);
	КонтактнаяИнформацияСервер.ПриЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, Отказ, ДопСвойства);
	
	ПерезаполнятьРегион = Ложь;
	Если Не ТекущийОбъект.Резидент Тогда
		// Как ни странно это ветка для резидентов т.к. ТекущийОбъект.Резидент означет Нерезидент (по документам) бу-ха-ха
		Для каждого Запись Из НаборКонтактнаяИнформация Цикл
			Если Справочники.КлассификаторРегионов.МожноОпределитьРегионПоКонтактнойИнформации(Запись) Тогда
				ПерезаполнятьРегион = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		// Это ветка для нерезидентов
		ПерезаполнятьРегион = Истина;
	КонецЕсли;
		
	Если ПерезаполнятьРегион Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ПерезаполнятьРегионДляОтчетов", Истина);
	КонецЕсли;
	
	Если Объект.Родитель = Справочники.Контрагенты.Депоненты И Не ЗначениеЗаполнено(Объект.СпособОтправкиОтчетов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен ""Способ отправки отчетов""", , , "Объект.СпособОтправкиОтчетов");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьНаборыЗаписейНаСервере(Отказ, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьДоступностьДинамическихСписков();		
	УстановитьОтборыДинамическихСписков(ЭтаФорма);

КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РезидентПриИзменении(Элемент)
	Если Объект.Резидент Тогда
		Объект.ДляОтчетов3533_УКод = Неопределено;
		Объект.СекторЭкономикиИностранногоЭмитента = Неопределено;
	КонецЕсли; 
	
	НастроитьВидимостьРеквизитов_ДляОтчетов3533(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЮридическиеФизическиеЛицаПриИзменении(Элемент)
	ЮридическиеФизическиеЛицаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)
	
	ЗаполнитьФормуW8();
	Если НЕ ЗначениеЗаполнено(Объект.ЮрФизЛицо) Тогда
		Объект.ЮрФизЛицо = ПредЮрФизЛицо;
		Возврат;
	КонецЕсли; 
	
	Если ПредЮрФизЛицо <> Объект.ЮрФизЛицо Тогда
		НастроитьДиалогПоРеквизитуЮрФизЛицо(ЭтаФорма);
		ПредЮрФизЛицо = Объект.ЮрФизЛицо;		
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если мФормироватьНаименованиеПолноеАвтоматически Тогда
		Объект.НаименованиеПолное = Объект.Наименование;		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Наименование) Тогда
		Элементы.НаименованиеПолное.СписокВыбора.Очистить();
		Элементы.НаименованиеПолное.СписокВыбора.Добавить(Объект.Наименование);		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)
	УстановитьФлагФормироватьНаименованиеПолноеАвтоматически();
КонецПроцедуры

&НаКлиенте
Процедура СубброкерПриИзменении(Элемент)
	НастроитьДиалогПоФлагуСубброкер(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ФормаВыплатыДоходовПриИзменении(Элемент)
	НастроитьДиалогПоРеквизитуФормаВыплатыДоходов(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РегионДляОтчетовПриИзменении(Элемент)
	Объект.РегионДляОтчетовРучнойВвод = ЗначениеЗаполнено(Объект.РегионДляОтчетов);
КонецПроцедуры

&НаКлиенте
Процедура КлиентОтсутствуетВBQПриИзменении(Элемент)
	
	НастроитьРеквизитыПоДепозитарномуОбслуживанию(ЭтотОбъект);
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыДоговоры

&НаКлиенте
Процедура ДоговорыПриАктивизацииСтроки(Элемент)
	УстановитьСвойстваКнопкиУстановкиОсновногоДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ОсновнойДоговорКонтрагента) Тогда
		Возврат;		
	КонецЕсли; 
	УстановитьОсновнойДоговорНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = НЕ РаботаСДиалогамиКлиент.ЗаписатьНовыйОбъектВФорме(ЭтаФорма);	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыБанковскиеСчета

&НаКлиенте
Процедура БанковскиеСчетаПриАктивизацииСтроки(Элемент)
	УстановитьСвойстваКнопкиУстановкиОсновногоБанковскогоСчета();
КонецПроцедуры

&НаКлиенте
Процедура БанковскиеСчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = НЕ РаботаСДиалогамиКлиент.ЗаписатьНовыйОбъектВФорме(ЭтаФорма);	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыТабличноеПолеСчетаДепо

&НаКлиенте
Процедура СчетаДепоПриАктивизацииСтроки(Элемент)
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли; 
	УстановитьСвойстваКнопкиУстановкиОсновногоСчетаДепо();
	УстановитьОтборРазделыСчетаДепо(ЭтаФорма, ТекДанные.Ссылка);	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыКонтактныеЛица

&НаКлиенте
Процедура КонтактныеЛицаПриАктивизацииСтроки(Элемент)
	УстановитьСвойстваКнопкиУстановкиОсновногоКонтактногоЛица();
	УстановитьСвойстваКнопкиУстановкиГлавногоБухгалтера();
	УстановитьСвойстваКнопкиУстановкиРуководителя();
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = НЕ РаботаСДиалогамиКлиент.ЗаписатьНовыйОбъектВФорме(ЭтаФорма);
	Если Отказ ИЛИ Копирование Тогда
		Возврат;		
	КонецЕсли; 
	
	ПараметрыЗаполнения = Новый Структура;
	
	Если Объект.ЮрФизЛицо = ЮрФизЛицо("ФизЛицо") Тогда
		ПараметрыЗаполнения.Вставить("ОбъектВладелец", Объект.ЮридическиеФизическиеЛица);
	Иначе
		ПараметрыЗаполнения.Вставить("ОбъектВладелец", Объект.Ссылка);		
	КонецЕсли; 	
	
	ПараметрыЗаполнения.Вставить("ВидКонтактногоЛица", ЗначениеПеречисления("ВидыКонтактныхЛиц", "КонтактноеЛицоКонтрагента"));
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ПараметрыЗаполнения);
	
	ОткрытьФорму("Справочник.КонтактныеЛица.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыНаборКонтактнойИнформации

&НаКлиенте
Процедура НаборКонтактнаяИнформацияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	КонтактнаяИнформацияКлиент.НачалоВыбораПредставления(ЭтаФорма);
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьОсновнойБанковскийСчет(Команда)	
	УстановитьОсновнойРеквизит(Элементы.БанковскиеСчета.ТекущиеДанные
		, Объект.ОсновнойБанковскийСчет);
	УстановитьСвойстваКнопкиУстановкиОсновногоБанковскогоСчета();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновнойСчетДепо(Команда)
	УстановитьОсновнойРеквизит(Элементы.СчетаДепо.ТекущиеДанные
		, Объект.ОсновнойСчетДепо);
	УстановитьСвойстваКнопкиУстановкиОсновногоСчетаДепо();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновноеКонтактноеЛицо(Команда)
	УстановитьОсновнойРеквизит(Элементы.КонтактныеЛица.ТекущиеДанные
		, Объект.ОсновноеКонтактноеЛицо);
	УстановитьСвойстваКнопкиУстановкиОсновногоКонтактногоЛица();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьРуководителя(Команда)
	УстановитьОсновнойРеквизит(Элементы.КонтактныеЛица.ТекущиеДанные
		, Объект.Руководитель);
	УстановитьСвойстваКнопкиУстановкиРуководителя();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьГлавногоБухгалтера(Команда)
	УстановитьОсновнойРеквизит(Элементы.КонтактныеЛица.ТекущиеДанные
		, Объект.ГлавныйБухгалтер);
	УстановитьСвойстваКнопкиУстановкиГлавногоБухгалтера();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновнойДоговор(Команда)
	УстановитьОсновнойДоговорНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ИсторияКатегорииРолиКлиента(Команда)
	ЗначениеОтбора = Новый Структура("ЮрФизЛицо", Объект.ЮридическиеФизическиеЛица);
	ПараметрыОткрытия = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.КатегорииРолейКлиентовСогласноУказов81и95.ФормаСписка", ПараметрыОткрытия);
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

//#Область Сервис

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоНовый(Форма)
	Возврат НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка);	
КонецФункции 

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъекта(Источник, ИмяРеквизита)	
	Результат = Неопределено;
	Если ЗначениеЗаполнено(Источник) Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, ИмяРеквизита);			
	КонецЕсли; 
	Возврат Результат;	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ФормаВыплатыДоходов(ИмяЗначенияПеречисления)
	Возврат ЗначениеПеречисления("ФормыВыплатыДоходовПоЦБ", ИмяЗначенияПеречисления);
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ЮрФизЛицо(ИмяЗначенияПеречисления)
	Возврат ЗначениеПеречисления("ЮрФизЛицо", ИмяЗначенияПеречисления);
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПеречисления(ИмяВида, ИмяЗначения)
	ПолноеИмя = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Перечисление.%1.%2", ИмяВида, ИмяЗначения);
	Возврат ПредопределенноеЗначение(ПолноеИмя);	
КонецФункции

//#КонецОбласти 

//#Область Диалог

//#Область НастройкиФормы

&НаСервере
Процедура НастроитьЭлементыПриСозданииНаСервере()
	Элементы.ГруппаЮрФизЛицоСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;	
	Элементы.ОПФ.СписокВыбора.Добавить("ЗАО");
	Элементы.ОПФ.СписокВыбора.Добавить("ОАО");	
	
	Если ЭтоНовый(ЭтаФорма) Тогда
		СоздаватьОсновнойДоговор = Истина;
		СоздаватьОсновнойПортфель = Истина;
	КонецЕсли; 	
	
	УстановитьОтборРазделыСчетаДепо(ЭтаФорма);
	УстановитьОтборыДинамическихСписков(ЭтаФорма);
	УстановитьДоступностьДинамическихСписков();
	
КонецПроцедуры 

&НаСервере
Процедура НастроитьФорму()
	НастроитьВидимостьРеквизитов_ДляОтчетов3533(ЭтаФорма);	
	НастроитьПросмотрКонтактнойИнформации();
	НастроитьДиалогПоФлагуСубброкер(ЭтаФорма);
	НастроитьДиалогПоФлагуБлокирован(ЭтаФорма);
	НастроитьДиалогПоРеквизитуЮрФизЛицо(ЭтаФорма);
	НастроитьДиалогПоРеквизитуФормаВыплатыДоходов(ЭтаФорма);
	НастроитьРеквизитыПоДепозитарномуОбслуживанию(ЭтотОбъект);
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьРеквизитов_ДляОтчетов3533(Форма)
	
	ОбъектФормы = Форма.Объект;
	ЭлементыФормы = Форма.Элементы;
	
	ГлавныйРодитель	= ГлавныйРодительРекурсивно(ОбъектФормы.Родитель);
	ЭтоЭмитент = ГлавныйРодитель = ПредопределенноеЗначение("Справочник.Контрагенты.Эмитенты");
	
	ВидимостьСекторЭкономики = Истина;
	ЭлементыФормы.СекторЭкономикиИностранногоЭмитента.Видимость = ВидимостьСекторЭкономики;
	
	ВидимостьУКод = НЕ ЭтоЭмитент И Не ОбъектФормы.Резидент И Не ОбъектФормы.Контрагент;
	ЭлементыФормы.ДляОтчетов3533_УКод.Видимость = ВидимостьУКод;
	
КонецПроцедуры 

&НаСервере
Процедура НастроитьПросмотрКонтактнойИнформации()
	// В будущем будет какой-то признак получен ли этот контрагент из Панды или заведен в ДЕПО,
	// если заведен в ДЕПО, то редактировать контактную информацию можно, а если из Панды - нет.
	Элементы.НаборКонтактнаяИнформация.ТолькоПросмотр = Ложь;
КонецПроцедуры
 
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьДиалогПоФлагуСубброкер(Форма)
	ОбъектФормы = Форма.Объект;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементыФормы.ФорматЗапросовИРСВ.Видимость = ОбъектФормы.Субброкер;
	ЭлементыФормы.LEI.Видимость = ОбъектФормы.Субброкер;
	ЭлементыФормы.ВнешнийИсточникДляРСВПоСубклиентам.Видимость = ОбъектФормы.Субброкер;
	ЭлементыФормы.СписокСубклиентовСправочник.Видимость = ОбъектФормы.Субброкер;
КонецПроцедуры
 
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьДиалогПоФлагуБлокирован(Форма)
	
	ОбъектФормы = Форма.Объект;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементыФормы.ПолеКартинкиБлокировка.Видимость = ОбъектФормы.Блокирован;
	ЭлементыФормы.ПричинаБлокировки.Доступность = ОбъектФормы.Блокирован;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьДиалогПоРеквизитуЮрФизЛицо(Форма)
	ОбъектФормы = Форма.Объект;
	ЭлементыФормы = Форма.Элементы;	
	
	ЭтоЮрЛицо = ОбъектФормы.ЮрФизЛицо = ЮрФизЛицо("ЮрЛицо")
		ИЛИ НЕ ЗначениеЗаполнено(ОбъектФормы.ЮрФизЛицо);
	
	Если ЭтоЮрЛицо Тогда
		ЭлементыФормы.ГруппаЮрФизЛицоСтраницы.ТекущаяСтраница = ЭлементыФормы.ГруппаЮрЛицо;
		
	Иначе
		ЭлементыФормы.ГруппаЮрФизЛицоСтраницы.ТекущаяСтраница = ЭлементыФормы.ГруппаФизЛицо;
		
	КонецЕсли;
	
	ЭлементыФормы.ГруппаОбщиеПараметрыСтраницы.ПодчиненныеЭлементы.ГруппаОбщиеПараметрыРегДокументы.Доступность = ЭтоЮрЛицо;
	ЭлементыФормы.ОПФ.Видимость = ЭтоЮрЛицо;
	ЭлементыФормы.НаборДоверенныеЛица.ПодчиненныеЭлементы.НаборДоверенныеЛицаБезДоверенности.Видимость = ЭтоЮрЛицо;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьДиалогПоРеквизитуФормаВыплатыДоходов(Форма)
	ОбъектФормы = Форма.Объект;
	ЭлементыФормы = Форма.Элементы;	
	
	ЭлементыФормы.Получатель.Доступность = ОбъектФормы.ФормаВыплатыДоходов =
		ФормаВыплатыДоходов("Безналичная");

	ЭлементыФормы.НомерСчетаВТоргСистеме.Доступность = ОбъектФормы.ФормаВыплатыДоходов =
		ФормаВыплатыДоходов("ПереводВТорговуюСистему");
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьРеквизитыПоДепозитарномуОбслуживанию(Форма)
	
	Форма.Элементы.СчетСписанияКомиссииВНРБанке.Видимость = Форма.Объект.КлиентОтсутствуетВBQ;
	
КонецПроцедуры

//#КонецОбласти 

//#Область СвойстваКнопокУстановкиОсновныхРеквизитов

&НаКлиенте
Процедура УстановитьСвойстваКнопкиУстановкиОсновногоБанковскогоСчета()
	УстановитьСвойстваКнопкиУстановкиОсновногоРеквизита(Элементы.БанковскиеСчетаУстановитьОсновнойБанковскийСчет
		, Элементы.БанковскиеСчета.ТекущиеДанные
		, Объект.ОсновнойБанковскийСчет);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвойстваКнопкиУстановкиОсновногоСчетаДепо()	
	УстановитьСвойстваКнопкиУстановкиОсновногоРеквизита(Элементы.СчетаДепоУстановитьОсновнойСчетДепо
		, Элементы.СчетаДепо.ТекущиеДанные
		, Объект.ОсновнойСчетДепо);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвойстваКнопкиУстановкиОсновногоКонтактногоЛица()
	УстановитьСвойстваКнопкиУстановкиОсновногоРеквизита(Элементы.КонтактныеЛицаУстановитьОсновноеКонтактноеЛицо
		, Элементы.КонтактныеЛица.ТекущиеДанные
		, Объект.ОсновноеКонтактноеЛицо);
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьСвойстваКнопкиУстановкиРуководителя()
	УстановитьСвойстваКнопкиУстановкиОсновногоРеквизита(Элементы.КонтактныеЛицаУстановитьРуководителя
		, Элементы.КонтактныеЛица.ТекущиеДанные
		, Объект.Руководитель);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвойстваКнопкиУстановкиГлавногоБухгалтера()
	УстановитьСвойстваКнопкиУстановкиОсновногоРеквизита(Элементы.КонтактныеЛицаУстановитьГлавногоБухгалтера
		, Элементы.КонтактныеЛица.ТекущиеДанные
		, Объект.ГлавныйБухгалтер);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвойстваКнопкиУстановкиОсновногоДоговора()
	УстановитьСвойстваКнопкиУстановкиОсновногоРеквизита(Элементы.ДоговорыУстановитьОсновнойДоговор
		, Элементы.Договоры.ТекущиеДанные
		, Объект.ОсновнойДоговорКонтрагента);
	
КонецПроцедуры
 
&НаКлиенте
Процедура УстановитьСвойстваКнопкиУстановкиОсновногоРеквизита(Кнопка, ДанныеСписка, ОсновнойРеквизит)
	
	Если ДанныеСписка = Неопределено Тогда
		Кнопка.Доступность = Ложь;
		Кнопка.Пометка = Ложь;
	Иначе
		Кнопка.Доступность = Истина;		
		Кнопка.Пометка = ДанныеСписка.Ссылка = ОсновнойРеквизит;		
	КонецЕсли; 
	
КонецПроцедуры

//#КонецОбласти 

//#Область НаборыЗаписей

&НаСервере
Процедура ЗаписатьНаборыЗаписейНаСервере(Отказ, ТекущийОбъект)	
	ЗначениеОтбора = ТекущийОбъект.Ссылка;
	
	ЗаписатьНаборЗаписейНаСервере("НаборДоверенныеЛица", "Депонент", ЗначениеОтбора, Отказ);	
	ЗаписатьНаборЗаписейНаСервере("НаборСубклиенты", "Объект", ЗначениеОтбора, Отказ);		
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборыЗаписейНаСервере(ТекущийОбъект)	
	ЗначениеОтбора = ТекущийОбъект.Ссылка;
	ЗначениеОтбораКИ = ТекущийОбъект.ЮридическиеФизическиеЛица;

	ПрочитатьНаборЗаписейНаСервере("НаборДоверенныеЛица", "Депонент", ЗначениеОтбора);	
	ПрочитатьНаборЗаписейНаСервере("НаборСубклиенты", "Объект", ЗначениеОтбора);		
	НаборРеестрКвалИнвесторов.Параметры.УстановитьЗначениеПараметра("ЮрФизЛицо", ЗначениеОтбораКИ);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаборЗаписейНаСервере(ИмяЭлемента, ИмяПоля, ЗначениеОтбора, Отказ)
	
	Если Отказ Тогда
		Возврат;		
	КонецЕсли; 
	
	НаборЗначение = РеквизитФормыВЗначение(ИмяЭлемента);
	НаборЗначение.Отбор[ИмяПоля].Установить(ЗначениеОтбора);
	Для каждого ЗаписьНабора Из НаборЗначение Цикл
		ЗаписьНабора[ИмяПоля] = ЗначениеОтбора;		
	КонецЦикла; 
	
	Попытка
		НаборЗначение.Записать();
	Исключение
		МетаНабор = НаборЗначение.Метаданные();
		
		ОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки
			, Отказ
			, "Элемент """ + СокрЛП(ЗначениеОтбора) + """ не записан. Не записан набор "+ МетаНабор.Синоним +".");			
	КонецПопытки;
			
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборЗаписейНаСервере(ИмяЭлемента, ИмяПоля, ЗначениеОтбора)
	
	Если ЭтоНовый(ЭтаФорма) Тогда
		Возврат;		
	КонецЕсли; 
	
	НаборЗначение = РеквизитФормыВЗначение(ИмяЭлемента);
	НаборЗначение.Отбор[ИмяПоля].Установить(ЗначениеОтбора);
	НаборЗначение.Прочитать();
	ЗначениеВРеквизитФормы(НаборЗначение, ИмяЭлемента);
		
КонецПроцедуры

//#КонецОбласти 

//#Область ДинамическиеСписки

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборыДинамическихСписков(Форма)
	УстановитьОтборБанковскиеСчета(Форма);
	УстановитьОтборДоговоры(Форма);
	УстановитьОтборКодыЗагрузки(Форма);
	УстановитьОтборКонтактныеЛица(Форма);
	УстановитьОтборСчетаДепо(Форма);
	УстановитьОтборСубклиенты(Форма);
	УстановитьОтборПредоставленныеДокументы(Форма);
КонецПроцедуры
 
&НаСервере
Процедура УстановитьДоступностьДинамическихСписков()
	
	ДоступностьЗакладок = НЕ ЭтоНовый(ЭтаФорма);
	
	Элементы.ГруппаКонтакты.Доступность = ДоступностьЗакладок;
	Элементы.ГруппаСчетаИДоговоры.Доступность = ДоступностьЗакладок;
	Элементы.ГруппаУчетЦБ.Доступность = ДоступностьЗакладок;
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборБанковскиеСчета(Форма)
	ДинСписок = Форма.БанковскиеСчета;
	УстановитьОтборСписка(ДинСписок, Форма.Объект.Ссылка);		
КонецПроцедуры
 
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборДоговоры(Форма)
	ДинСписок = Форма.Договоры;
	УстановитьОтборСписка(ДинСписок, Форма.Объект.Ссылка);		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборКодыЗагрузки(Форма)
	ДинСписок = Форма.КодыЗагрузки;
	УстановитьОтборСписка(ДинСписок, Форма.Объект.Ссылка);		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборКонтактныеЛица(Форма)
	ДинСписок = Форма.КонтактныеЛица;
	УстановитьОтборСписка(ДинСписок, Форма.Объект.Ссылка, "ОбъектВладелец");
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСчетаДепо(Форма)
	ДинСписок = Форма.СчетаДепо;
	УстановитьОтборСписка(ДинСписок, Форма.Объект.Ссылка);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСубклиенты(Форма)
	ДинСписок = Форма.СписокСубклиентовСправочник;
	УстановитьОтборСписка(ДинСписок, Форма.Объект.Ссылка);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборРазделыСчетаДепо(Форма, Владелец = Неопределено)
	ДинСписок = Форма.РазделыСчетаДепо;
	УстановитьОтборСписка(ДинСписок, Владелец, "Владелец");	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПредоставленныеДокументы(Форма)
	ДинСписок = Форма.ПредоставленныеДокументы;
	ПараметрКонтрагент = ДинСписок.Параметры.Элементы.Найти("Контрагент");
	ПараметрКонтрагент.Использование = Истина;
	ПараметрКонтрагент.Значение = Форма.Объект.Ссылка;
	
	ПараметрЮрлицо = ДинСписок.Параметры.Элементы.Найти("Юрлицо");
	ПараметрЮрлицо.Использование = Истина;
	ПараметрЮрлицо.Значение = Форма.Объект.ЮридическиеФизическиеЛица;
	//УстановитьОтборСписка(ДинСписок, Форма.Объект.Ссылка, "Депонент");		
КонецПроцедуры
 
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(ДинСписок, ЗначениеПоля = Неопределено, ИмяПоля = "Владелец")	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДинСписок
		, ИмяПоля
		, ЗначениеПоля);
КонецПроцедуры 

//#КонецОбласти 

//#КонецОбласти 

//#Область ЗаполнениеДанных

&НаКлиенте
Процедура УстановитьОсновнойДоговорНаКлиенте()
	УстановитьОсновнойРеквизит(Элементы.Договоры.ТекущиеДанные
		, Объект.ОсновнойДоговорКонтрагента);
	УстановитьСвойстваКнопкиУстановкиОсновногоДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновнойРеквизит(ДанныеСписка, ТекущийОсновнойРеквизит)
	
	Если ДанныеСписка = Неопределено Тогда
		Возврат;		
	КонецЕсли; 
	
	Если ТекущийОсновнойРеквизит = ДанныеСписка.Ссылка Тогда
		ТекущийОсновнойРеквизит = Неопределено;
	Иначе
		ТекущийОсновнойРеквизит = ДанныеСписка.Ссылка;		
	КонецЕсли; 
	
	Модифицированность = Истина;
	
КонецПроцедуры
 
// Процедура проверяет, совпадало ли ранее полное наименование с наименованием,
// и присваивает соответствующее значение переменной мФормироватьНаименованиеПолноеАвтоматически.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура УстановитьФлагФормироватьНаименованиеПолноеАвтоматически()
	мФормироватьНаименованиеПолноеАвтоматически = ПустаяСтрока(Объект.НаименованиеПолное)
		ИЛИ Объект.НаименованиеПолное = Объект.Наименование;

КонецПроцедуры

Процедура ОбновитьТелефоныКонтактногоЛица()
	//СтрокаТелефонов = "";

	//Если ЭлементыФормы.КонтактныеЛица.ТекущиеДанные <> Неопределено Тогда 
	//	
	//	Если ЗначениеЗаполнено(ЭлементыФормы.КонтактныеЛица.ТекущиеДанные.Ссылка) Тогда

	//		Запрос = Новый Запрос;
	//		Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Телефон);
	//		Запрос.УстановитьПараметр("Объект", ЭлементыФормы.КонтактныеЛица.ТекущиеДанные.Ссылка);
	//		Запрос.Текст = "
	//		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//		|	Представление
	//		|ИЗ
	//		|	РегистрСведений.КонтактнаяИнформация
	//		|ГДЕ
	//		|	Тип = &Тип
	//		|	И Объект = &Объект
	//		|УПОРЯДОЧИТЬ ПО
	//		|	Период УБЫВ";
	//		Выборка = Запрос.Выполнить().Выбрать();

	//		Пока Выборка.Следующий() Цикл
	//			СтрокаТелефонов = СтрокаТелефонов + ", " + Выборка.Представление;
	//		КонецЦикла;
	//	
	//	КонецЕсли;

	//КонецЕсли;

	//Если Не ПустаяСтрока(СтрокаТелефонов) Тогда
	//	СтрокаТелефонов = Сред(СтрокаТелефонов, 3);
	//КонецЕсли;

	//ЭлементыФормы.ТелефоныКонтактногоЛица.Заголовок = "Телефоны: " + СтрокаТелефонов;
	//ЭлементыФормы.ТелефоныКонтактногоЛица.Видимость = ЗначениеЗаполнено(СтрокаТелефонов);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуW8()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ДанныеПоследнейФормыW8 = Справочники.ФормыW8.ДанныеПоследнейФормыW8(Объект.Ссылка);
		СсылкаНаФормуW8 = ДанныеПоследнейФормыW8.ФормаW8;
		Если ЗначениеЗаполнено(СсылкаНаФормуW8) И ЗначениеЗаполнено(Объект.ЮридическиеФизическиеЛица) Тогда
			
			ФормаW8 = СсылкаНаФормуW8;
			
			Если ДанныеПоследнейФормыW8.ЕстьПересеченияПоСрокамСдругимиФормами Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеПоследнейФормыW8.ТекстОшибки);
			КонецЕсли;
			
			Если ЗначениеРеквизитаОбъекта(СсылкаНаФормуW8,"СрокДействия") < ТекущаяДатаСеанса() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Текущая форма W8 просрочена!");
			КонецЕсли;
			
			Если ТипЗнч(ФормаW8.Лицо) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
				Элементы.ГруппаW8.ТекущаяСтраница = Элементы.ГруппаПредоставленнаяФормаW8ЮрЛица;
			Иначе
				Элементы.ГруппаW8.ТекущаяСтраница = Элементы.ГруппаПредоставленнаяФормаW8ФизЛица;
			КонецЕсли;
			
		Иначе
			
			ФормаW8 = Справочники.ФормыW8.ПустаяСсылка();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.СтраницаW8.Доступность = ЗначениеЗаполнено(ФормаW8);
	
КонецПроцедуры

//#КонецОбласти 

//#Область СборДанных

&НаСервереБезКонтекста
Функция ГлавныйРодительРекурсивно(РодительПромежуточный)
	РодительТекущий = ЗначениеРеквизитаОбъекта(РодительПромежуточный, "Родитель");	
	Если ЗначениеЗаполнено(РодительТекущий) Тогда
		Возврат ГлавныйРодительРекурсивно(РодительТекущий);
	Иначе
		Возврат РодительПромежуточный;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЮридическиеФизическиеЛицаПриИзмененииНаСервере()
	КонтактнаяИнформацияСервер.ПрочитатьКонтактнуюИнформацию(ЭтаФорма);
	НастроитьПросмотрКонтактнойИнформации();
	ЗаполнитьФормуW8();
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленныеДокументыИзменитьЭлемент(Команда)
	ДанныеСтроки = Элементы.ПредоставленныеДокументы.ТекущиеДанные;
	ОткрытьТекущуюЗаписьПредоставленныхФорм(ДанныеСтроки, Объект.ЮридическиеФизическиеЛица);
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДанныеСтроки = Элементы.ПредоставленныеДокументы.ТекущиеДанные;
	ОткрытьТекущуюЗаписьПредоставленныхФорм(ДанныеСтроки, Объект.ЮридическиеФизическиеЛица);
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленныеДокументыДобавить(Команда)
	ОткрытьФорму("РегистрСведений.ПредоставленныеДокументы.ФормаЗаписи");
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленныеДокументыУдалить(Команда)
	ДанныеСтроки = Элементы.ПредоставленныеДокументы.ТекущиеДанные;
	Если ДанныеСтроки <> Неопределено Тогда
		Если Вопрос("Удалить запись о предоставленном документе?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ПредоставленныеДокументыУдалитьСервер(ДанныеСтроки.Период, Объект.ЮридическиеФизическиеЛица,
			Объект.Ссылка, ДанныеСтроки.ВидДокумента);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленныеДокументыСкопировать(Команда)
	ДанныеСтроки = Элементы.ПредоставленныеДокументы.ТекущиеДанные;
	Если ДанныеСтроки <> Неопределено Тогда
		ПараметрыЗаполнения = Новый Структура("Период, Лицо, Депонент,ВидДокумента,СрокДействия,"
			+ "ДатаПредоставления,Примечание,ПредоставленнаяФорма");
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДанныеСтроки);
		ПараметрыЗаполнения.Депонент = Объект.Ссылка;
		ПараметрыЗаполнения.Лицо = Объект.ЮридическиеФизическиеЛица;
		СтруктураЗаполнения =  Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);
		ОткрытьФорму("РегистрСведений.ПредоставленныеДокументы.ФормаЗаписи", СтруктураЗаполнения, , Новый УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

//#КонецОбласти 

//#КонецОбласти

#Область СчетаТипаC

&НаКлиенте
Процедура ИсторияСчетаТипаC(Команда)
	ЗначениеОтбора = Новый Структура("Клиент", Объект.Ссылка);
	ПараметрыОткрытия = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.КлиентыСУчетомНаСчетахТипаC.ФормаСписка", ПараметрыОткрытия);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСчетДляВыплатыКД(Команда)
	ЗначениеОтбора = Новый Структура("Клиент", Объект.Ссылка);
	ПараметрыОткрытия = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.СчетаДляВыплатыКД.ФормаСписка", ПараметрыОткрытия);
КонецПроцедуры

&НаКлиенте
Процедура ИмеетСчетаТипаCНаДатуПриИзменении(Элемент)
	//Модифицированность = Истина;
	ДанныеОНаличии = ДанныеОНаличииСчетаТипаC(ИмеетСчетаТипаCНаДату);
	ИмеетСчетаТипаC = ДанныеОНаличии.ФлагАктивности;	// BSLLS:LatinAndCyrillicSymbolInWord-off
	СчетДляВыплатыКД = ДанныеОНаличии.СчетДляВыплатыКД;
КонецПроцедуры

&НаСервере
Процедура ОтобразитьНаличиеСчетовТипаC()	// BSLLS:LatinAndCyrillicSymbolInWord-off
	ДанныеОНаличии = ДанныеОНаличииСчетаТипаC(ТекущаяДатаСеанса());
	ИмеетСчетаТипаCНаДату = ДанныеОНаличии.Дата;		// BSLLS:LatinAndCyrillicSymbolInWord-off
	ИмеетСчетаТипаC = ДанныеОНаличии.ФлагАктивности;	// BSLLS:LatinAndCyrillicSymbolInWord-off
	СчетДляВыплатыКД = ДанныеОНаличии.СчетДляВыплатыКД;
КонецПроцедуры

&НаСервере
Функция ДанныеОНаличииСчетаТипаC(ДатаДанных)	// BSLLS:LatinAndCyrillicSymbolInWord-off
	
	Результат = Новый Структура();
	Результат.Вставить("Дата", ДатаДанных);
	Результат.Вставить("ФлагАктивности", Ложь);
	Результат.Вставить("СчетДляВыплатыКД", Справочники.БанковскиеСчета.ПустаяСсылка());

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлиентыСУчетомНаСчетахТипаC.Период КАК Период,
	|	КлиентыСУчетомНаСчетахТипаC.ФлагАктивности КАК ФлагАктивности,
	|	СчетаДляВыплатыКД.Счет КАК СчетДляВыплатыКД
	|ИЗ
	|	РегистрСведений.КлиентыСУчетомНаСчетахТипаC.СрезПоследних(&ДатаДанных, Клиент = &Клиент) КАК КлиентыСУчетомНаСчетахТипаC
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаДляВыплатыКД.СрезПоследних(&ДатаДанных, Клиент = &Клиент) КАК СчетаДляВыплатыКД
	|		ПО КлиентыСУчетомНаСчетахТипаC.Клиент = СчетаДляВыплатыКД.Клиент
	|";
	Запрос.УстановитьПараметр("ДатаДанных", ДатаДанных);
	Запрос.УстановитьПараметр("Клиент", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Вставить("Дата", Выборка.Период);
		Результат.Вставить("ФлагАктивности", Выборка.ФлагАктивности);
		Результат.Вставить("СчетДляВыплатыКД", Выборка.СчетДляВыплатыКД);
	КонецЕсли;
	Возврат Результат
	
КонецФункции

#КонецОбласти

&НаСервереБезКонтекста
Процедура ПредоставленныеДокументыУдалитьСервер(Период, Лицо, Депонент, ВидДокумента) Экспорт
	Запись = РегистрыСведений.ПредоставленныеДокументы.СоздатьМенеджерЗаписи();
	Запись.Период = Период;
	Запись.Лицо = Лицо;
	Запись.Депонент = Депонент;
	Запись.ВидДокумента = ВидДокумента;
	Запись.Удалить();
КонецПроцедуры

// Обработка открытия предоставленного документа, выбранного в списке
//
// Параметры:
// ДанныеСтроки - ДанныеФормыСтруктура - строка выбранного предоставленного документа
// Лицо - СправочникСсылка.ЮридическиеЛица, СправочникСсылка.ФизическиеЛица - Юр/Физ лицо депонента
&НаКлиенте
Процедура ОткрытьТекущуюЗаписьПредоставленныхФорм(ДанныеСтроки, Лицо) Экспорт
	Если ДанныеСтроки <> Неопределено Тогда
		Если ТипЗнч(ДанныеСтроки.ВидДокумента) = Тип("СправочникСсылка.ВидыДокументовУдостоверяющихПолномочия") Тогда
			ПараметрыКлюча = Новый Массив;
			СтруктураПараметровКлюча = Новый Структура("Период,Лицо,ВидДокумента", ДанныеСтроки.Период, Лицо,
			ДанныеСтроки.ВидДокумента);
			Если Не ЭтоФормаW8IMY(ДанныеСтроки.ВидДокумента) Тогда
				СтруктураПараметровКлюча.Вставить("Депонент", Объект.Ссылка);
			КонецЕсли;
			ПараметрыКлюча.Добавить(СтруктураПараметровКлюча);
			КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.ПредоставленныеДокументы", ПараметрыКлюча);
			ОткрытьФорму("РегистрСведений.ПредоставленныеДокументы.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписи));
		Иначе
			Сообщить("Для данной формы нет записи в регистре ""Предоставленные документы""");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоФормаW8IMY(ВидДокумента)
	
	Возврат ВидДокумента = Справочники.ВидыДокументовУдостоверяющихПолномочия.ФормаW8IMY;
	
КонецФункции
