
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Разделы = РаскрытиеСпискаВладельцев.РазделыСводногоРаскрытия(Объект.Ссылка);
	Если Не ЗначениеЗаполнено(Разделы) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Запрос = Документы.ВыгрузкаРазделаРСВвВышестоящийДепозитарий.ЗапросСостоянийВыгрузкиРазделов(Объект.Ссылка, Разделы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = СводноеРаскрытие.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
		Если Выборка.ТехническаяОперация = Null Или Выборка.Статус = Перечисления.СтатусыДокументовФайловыйШлюз.ОшибкаФайловыйШлюз Тогда
			Строка.Выгружать = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СводноеРаскрытиеВыгружатьПриИзменении(Элемент)
	ДанныеСтроки = Элемент.Родитель.ТекущиеДанные;
	Если ДанныеСтроки.Выгружать И ЗначениеЗаполнено(ДанныеСтроки.Статус) 
		И ДанныеСтроки.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыДокументовФайловыйШлюз.ОшибкаФайловыйШлюз") Тогда
		Сообщение = "Выгрузка раздела находится в статусе "+ДанныеСтроки.Статус+".
		|Вы уверены, что раздел нужно выгрузить повторно?";
		Если Вопрос(Сообщение, РежимДиалогаВопрос.ДаНет, , , "Повторная выгрузка") = КодВозвратаДиалога.Нет Тогда
			ДанныеСтроки.Выгружать = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	Помеченные = СводноеРаскрытие.НайтиСтроки(Новый Структура("Выгружать", Истина));
	Если Помеченные.Количество() = 0 Тогда
		ПоказатьПредупреждение( , "Не выбраны разделы для выгрузки");
	ИначеЕсли МожноВыгружать(Помеченные) Тогда
		Разделы = Новый Массив;
		Для Каждого Строка Из Помеченные Цикл
			Разделы.Добавить(Строка.Раздел);
		КонецЦикла;
		Результат = РезультатВыгрузкиНаСервере(Объект.Ссылка, Разделы);
		Закрыть(Результат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция МожноВыгружать(Строки)
	РанееВыгруженные = "";
	Для Каждого Строка Из Строки Цикл
		Если ЗначениеЗаполнено(Строка.Статус) 
			И Строка.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыДокументовФайловыйШлюз.ОшибкаФайловыйШлюз") Тогда
			РанееВыгруженные = РанееВыгруженные + ?(ПустаяСтрока(РанееВыгруженные), "", ", ") + Строка.Раздел;
		КонецЕсли;
	КонецЦикла;
	Если ПустаяСтрока(РанееВыгруженные) Тогда
		Сообщение = "Выгрузить "+Строки.Количество()+" раздел"+?(Строки.Количество() = 1, "?", "а?");
	ИначеЕсли СтрЧислоВхождений(РанееВыгруженные, ",") = 0 Тогда
		Сообщение = "Раздел "+РанееВыгруженные+" уже выгружался, выгрузить его повторно?";
	Иначе
		Сообщение = "Разделы "+РанееВыгруженные+" уже выгружались, выгрузить их повторно?";
	КонецЕсли;
	Если Вопрос(Сообщение, РежимДиалогаВопрос.ДаНет, , , "Подвердите выгрузку") = КодВозвратаДиалога.Да Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция РезультатВыгрузкиНаСервере(Раскрытие, Разделы)
	Возврат РаскрытиеСпискаВладельцев.РезультатВыгрузкиРазделовРСВ(Раскрытие, Разделы);
КонецФункции

