
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РежимРасшифровки") Тогда
		Отчет.РежимРасшифровки = Параметры.РежимРасшифровки;
	Иначе
		Отчет.РежимРасшифровки = Ложь;
	КонецЕсли;
	
	УстановитьУсловноеОформлениеТипГруппировки();
	КлючТекущихПользовательскихНастроек = Новый УникальныйИдентификатор;
	Отчет.РаскрашиватьИзмерения = Истина;
	ЗаполнитьГруппировки();
	Отчет.ДатаНачала = Параметры.ДатаНачала;
	Отчет.ДатаОкончания = Параметры.ДатаОкончания;
	Отчет.Раздел = Параметры.Раздел;
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.Вариант);
	Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Параметры.ПользовательскиеНастройки);
	СохранитьНастройкиРазделаНаСервере();
	СкомпоноватьРезультат();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатВыбор(Элемент, Область, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область Сервис

&НаСервере
Процедура СохранитьНастройкиРазделаНаСервере()
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.СохранитьНастройкиРаздела(Отчет.КомпоновщикНастроек);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппировки()

	ПолеГруппировки = Отчет.Группировка.Добавить();
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = "Периоды.ПериодДень";
	ПолеГруппировки.Представление = "Период";
	ПолеГруппировки.ТипГруппировки = 0;

	ПолеГруппировки = Отчет.Группировка.Добавить();
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = "ЦБ";
	ПолеГруппировки.Представление = "Ценная бумага";
	ПолеГруппировки.ТипГруппировки = 0;

	ПолеГруппировки = Отчет.Группировка.Добавить();
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = "СчетДепоМХ";
	ПолеГруппировки.Представление = "Счет депо МХ";
	ПолеГруппировки.ТипГруппировки = 0;
	
	ПолеГруппировки = Отчет.Группировка.Добавить();
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = "РазделСчетаДепоМХ";
	ПолеГруппировки.Представление = "Раздел счета депо МХ";
	ПолеГруппировки.ТипГруппировки = 0;
	
	ПолеГруппировки = Отчет.Группировка.Добавить();
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = "СчетДепо";
	ПолеГруппировки.Представление = "Счет депо";
	ПолеГруппировки.ТипГруппировки = 0;
	
	ПолеГруппировки = Отчет.Группировка.Добавить();
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = "РазделСчетаДепо";
	ПолеГруппировки.Представление = "Раздел счета депо";
	ПолеГруппировки.ТипГруппировки = 0;
	
	Показатель = Отчет.Показатели.Добавить();
	Показатель.Использование = Истина;
	Показатель.Поле = "Количество";
	Показатель.Представление = "Количество";
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеТипГруппировки()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='Без групп'"));
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ГруппировкаТипГруппировки");
	
	Элемент = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.Группировка.ТипГруппировки");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = 0;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='С группами'"));
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ГруппировкаТипГруппировки");
	
	Элемент = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.Группировка.ТипГруппировки");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = 1;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='Только группы'"));
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ГруппировкаТипГруппировки");
	
	Элемент = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.Группировка.ТипГруппировки");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = 2;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
