#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьКомпоновщикиОтбора();
	Объект.ДатаПоз = ТекущаяДатаСеанса();
	Объект.КоличествоПортфелейВПакете = ?(Объект.КоличествоПортфелейВПакете = 0, 50, Объект.КоличествоПортфелейВПакете);
	
	об = РеквизитФормыВЗначение("Объект");
	Заголовок = "Версия v."+об.СведенияОВнешнейОбработке().Версия;

	АдресПродВИМ = "http://amapfront/PROD_AVC_FO-DL/ws/avancore_ws.1cws?wsdl";
	АдресПродБФ = "http://AMAPFRONT/PROD_BFAM_FO-DL/ws/avancore_ws.1cws?wsdl";
	
	Попытка
		ПараметрыПодключения = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПодключенияИзСтрокиСоединенияИнформационнойБазы(СтрокаСоединенияИнформационнойБазы());
		ИмяИБ = ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия;
	Исключение
	КонецПопытки;
	
	Если ИмяИБ="PROD_AVC_MO" Тогда
		Элементы.АдресWS.СписокВыбора.Добавить(АдресПродВИМ, АдресПродВИМ);	
	КонецЕсли;
	
	Если ИмяИБ="PROD_BFAM_MO" Тогда
		Элементы.АдресWS.СписокВыбора.Добавить(АдресПродБФ, АдресПродБФ);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборПоСчетамПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
	КомпоновщикОтбораПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикОтбораМандатовНастройкиОтборПриИзменении(Элемент)
	КомпоновщикОтбораПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикОтбораСчетовМандатаНастройкиОтборПриИзменении(Элемент)
	КомпоновщикОтбораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.ОтборМандат Тогда
		Если Не ЗначениеЗаполнено(Объект.УК) Тогда
			ПоказатьПредупреждение(, "Установлен отбор по мандатам. Требуется выбрать УК.");
			Возврат;	
		КонецЕсли;	
	КонецЕсли;
	
	Попытка
		ЗаполнитьНаСервере();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Опубликовать(Команда)
	ОчиститьНаСервере();
	ПоказатьЛог = Ложь;
	ОпубликоватьНаСервере();
	Если ПоказатьЛог Тогда
		ПолучитьТекстовыйЛог().Показать("Лог работы сервиса");	
	Иначе
		Сообщить("Успешно выполнено");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Функция ПолучитьТекстовыйЛог();
	Возврат Объект.ТекстовыйЛог;
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Отбор = СформироватьОтбор();
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Заполнить(Отбор, Объект.ДатаПоз);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикиОтбора()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	СхемаКомпоновкиДанныхОтбораМандатов = ОбработкаОбъект.ПолучитьМакет("СхамаНастройкиОтборовМандатов");
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанныхОтбораМандатов, Новый УникальныйИдентификатор);
	КомпоновщикОтбораМандатов.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	КомпоновщикОтбораМандатов.ЗагрузитьНастройки(СхемаКомпоновкиДанныхОтбораМандатов.НастройкиПоУмолчанию);

	СхемаКомпоновкиДанныхОтбораСчетовМандатов = ОбработкаОбъект.ПолучитьМакет("СхамаНастройкиОтборовСчетовМандатов");
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанныхОтбораСчетовМандатов, Новый УникальныйИдентификатор);
	КомпоновщикОтбораСчетовМандата.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	КомпоновщикОтбораСчетовМандата.ЗагрузитьНастройки(СхемаКомпоновкиДанныхОтбораСчетовМандатов.НастройкиПоУмолчанию);
	

КонецПроцедуры // ИнициализироватиьКомпоновщикиОтбора()
 
&НаКлиенте
Процедура УстановитьДоступностьЭлементов()

	Элементы.КомпоновщикОтбораМандатовНастройкиОтбор.Доступность = Ложь;
	Элементы.КомпоновщикОтбораСчетовМандатаНастройкиОтбор.Доступность = Ложь;
	
	Если НЕ ОтборПоСчетам Тогда
		Элементы.КомпоновщикОтбораМандатовНастройкиОтбор.Доступность = Истина;
	Иначе
		Элементы.КомпоновщикОтбораСчетовМандатаНастройкиОтбор.Доступность = Истина;
	КонецЕсли; 	

КонецПроцедуры // УстановитьДоступностьЭлементов()

&НаСервере
Функция СформироватьОтбор()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	РезультатКомпоновкиДанных = Новый ТаблицаЗначений;
	
	Если НЕ ОтборПоСчетам Тогда
		СхемаКомпоновкиДанных = ОбработкаОбъект.ПолучитьМакет("СхамаНастройкиОтборовМандатов");
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикОтбораМандатов.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		Ключ = "Мандаты";
	Иначе	
		СхемаКомпоновкиДанных = ОбработкаОбъект.ПолучитьМакет("СхамаНастройкиОтборовСчетовМандатов");
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикОтбораСчетовМандата.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		Ключ = "СчетаМандатов";
	КонецЕсли;                                       
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(РезультатКомпоновкиДанных);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Отбор = Новый Структура;
	
	если Ключ = "Мандаты" тогда
		
		запрос = новый запрос;
		запрос.Текст = "ВЫБРАТЬ
		               |	СчетаМандатов.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.СчетаМандатов КАК СчетаМандатов
		               |ГДЕ
		               |	1 = 1
		               |	И СчетаМандатов.ПометкаУдаления = ЛОЖЬ
		               |	И СчетаМандатов.Владелец В(&Владелец)
		               |	И СчетаМандатов.Наименование <> ""Счет мандата не определен""
		               |	И ЕСТЬNULL(СчетаМандатов.МестоХранения.ВидБанковскогоСчета, """") <> ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Депозитный)
		               |	И (СчетаМандатов.ВидСчетаМандата.Наименование = ""Брокерский""
		               |				И СчетаМандатов.Владелец.ТипМандата.Ссылка В (ЗНАЧЕНИЕ(Перечисление.ТипыМандата.V), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.Y), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.Q), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.H))
		               |			ИЛИ НЕ СчетаМандатов.Владелец.ТипМандата.Ссылка В (ЗНАЧЕНИЕ(Перечисление.ТипыМандата.V), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.Y), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.Q), ЗНАЧЕНИЕ(Перечисление.ТипыМандата.H)))";
		запрос.УстановитьПараметр("Владелец",РезультатКомпоновкиДанных.ВыгрузитьКолонку("Ссылка"));
		
		тзСч = запрос.Выполнить().Выгрузить();
		Если тзСч.Количество() > 0 Тогда
			Отбор.Вставить("СчетаМандатов", тзСч.ВыгрузитьКолонку("Ссылка"));
		Иначе
			Отбор.Вставить(Ключ, Новый Массив);
		КонецЕсли;
	
	иначе	
		Если РезультатКомпоновкиДанных.Количество() > 0 Тогда
			Отбор.Вставить(Ключ, РезультатКомпоновкиДанных.ВыгрузитьКолонку("Ссылка"));
		Иначе
			Отбор.Вставить(Ключ, Новый Массив);
		КонецЕсли; 
	
	конецесли;
	
	Возврат Отбор;

КонецФункции // СформироватьОтбор()

&НаСервере
Процедура КомпоновщикОтбораПриИзмененииНаСервере()
	Объект.ДенежныеСредства.Очистить();
	Объект.ЦенныеБумаги.Очистить();
КонецПроцедуры

&НаСервере
Процедура ОпубликоватьНаСервере()
	Объект.ТекстовыйЛог.Очистить();
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.вклОтладка = Отладка;
	ОбработкаОбъект.Опубликовать(ПересчитатьРыночнуюСтоимость, ПересчитатьКомплианс, Объект.ДатаПоз);
	ПоказатьЛог = ОбработкаОбъект.ЕстьОшибки или ОбработкаОбъект.вклОтладка;
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
	Объект.ТекстовыйЛог.Очистить();
	Отбор = СформироватьОтбор();
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ПоказатьЛог = ОбработкаОбъект.ЕстьОшибки;
	Если ПоказатьЛог Тогда
		ПолучитьТекстовыйЛог().Показать("Лог работы сервиса");	
	Иначе
		Сообщить("Успешно выполнено");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПланДвиженияДСНаСервере()
	
	Отбор = СформироватьОтбор();
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьПланДвиженияДС(Объект.ДатаПоз, Отбор);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПланДвиженияДС(Команда)
	ЗаполнитьПланДвиженияДСНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОпубликоватьПланДвиженияДСНаСервере(Отказ, ТекстОшибки)
	
	флЕстьОтбор = Ложь;
	
	Для каждого ЭлементОтбора Из КомпоновщикОтбораМандатов.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.Использование Тогда
			флЕстьОтбор = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если не флЕстьОтбор Тогда
		Для каждого ЭлементОтбора Из КомпоновщикОтбораСчетовМандата.Настройки.Отбор.Элементы Цикл
			Если ЭлементОтбора.Использование Тогда
				флЕстьОтбор = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Объект.ТекстовыйЛог.Очистить();
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОпубликоватьПланДвиженияДС(не флЕстьОтбор, ПересчитатьРыночнуюСтоимость, ПересчитатьКомплианс, Отказ, ТекстОшибки);
	ПоказатьЛог = ОбработкаОбъект.ЕстьОшибки;
КонецПроцедуры

&НаКлиенте
Процедура ОпубликоватьПланДвиженияДС(Команда)
	Отказ = Ложь;
	ТекстОшибки = "";
	ОпубликоватьПланДвиженияДСНаСервере(Отказ, ТекстОшибки);
	
	Если Отказ Тогда
		Сообщить("При публикации возникла ошибка: " + ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
 
