

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ТекОбъект;
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Заголовок = "v. " + ТекОбъект.СведенияОВнешнейОбработке().Версия;
	
	ДополнительнаяОбработкаСсылка = Неопределено;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Если Параметры.Свойство("ДополнительнаяОбработкаСсылка", ДополнительнаяОбработкаСсылка) Тогда
		Если ДополнительнаяОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка() Тогда
			ИмяОбработки = ОбработкаОбъект.Метаданные().Имя;
			ДополнительнаяОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ИмяОбработки);
		КонецЕсли;
	Иначе
		ИмяОбработки = ОбработкаОбъект.Метаданные().Имя;
		ДополнительнаяОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ИмяОбработки);
	КонецЕсли;
	
	Если ДополнительнаяОбработкаСсылка <> Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка() Тогда
		Настройки = ДополнительнаяОбработкаСсылка.ХранилищеНастроек.Получить();
		ОбработкаОбъект.УстановитьПользовательскиеНастройки(Настройки);
		
		ДопОбработка = ДополнительнаяОбработкаСсылка;
		ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СинхронизоватьНСИ(Команда)
	СинхронизоватьНСИНаСервере();
КонецПроцедуры

&НаСервере
Процедура СинхронизоватьНСИНаСервере()
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ВыполнитьСинхронизациюНСИ();
	ТекОбъект.УстановкаПризнакаОтправкиНаБрокерскийСчет();
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыборочнуюСинхронизацию(Команда)
	ВыполнитьВыборочнуюСинхронизациюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВыборочнуюСинхронизациюНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");                
	ТекОбъект.ВыполнитьВыборочнуюСинхронизацию();
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	ТабДок = СформироватьОтчетНаСервере();
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");                
	ТабДок = ТекОбъект.ОтчетПоСверке();
	
	Сверка.Очистить();
	Сверка.Вывести(ТабДок);
	
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
	Возврат ТабДок;
	
	
КонецФункции

&НаСервере
Процедура ПолучитьУведомленияНаСервере()
	ЕстьОшибки = Ложь;
	ЕстьПредупреждения = Ложь;
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ПолучитьУведомления(ЕстьОшибки, ЕстьПредупреждения);
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьУведомления(Команда)
	ПолучитьУведомленияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьПорученияНаСервере()
	ЕстьОшибки = Ложь;
	ЕстьПредупреждения = Ложь;
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.СоздатьПоручения(ЕстьОшибки, ЕстьПредупреждения);
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
	Если ЕстьОшибки = Ложь Тогда
		Сообщить("Создание поручений успешно выполнено");
	Иначе
		Сообщить("Есть ошибки при создании поручений");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоручения(Команда)
	СоздатьПорученияНаСервере();
КонецПроцедуры
