//////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьЭлементов();
	УстановитьЗначенияРеквизитов();
	СформироватьОписаниеПравила();
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойИсточникПриИзменении(Элемент)
	СформироватьОписаниеПравила();
КонецПроцедуры

&НаКлиенте
Процедура СуффиксПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
	УстановитьЗначенияРеквизитов();
	СформироватьОписаниеПравила();
КонецПроцедуры

&НаКлиенте
Процедура ФиксированныйСуффиксПриИзменении(Элемент)
	СформироватьОписаниеПравила();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПервыхСимволовТипаРазделаПриИзменении(Элемент)
	СформироватьОписаниеПравила();
КонецПроцедуры

&НаКлиенте
Процедура ДобавлятьПорядковыйНомерПриИзменении(Элемент)
	СформироватьОписаниеПравила();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДополнительныйИсточникПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
	УстановитьЗначенияРеквизитов();
	СформироватьОписаниеПравила();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныйИсточникПриИзменении(Элемент)
	СформироватьОписаниеПравила();
КонецПроцедуры

&НаКлиенте
Процедура ДопИсточникСуффиксПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
	УстановитьЗначенияРеквизитов();
	СформироватьОписаниеПравила();
КонецПроцедуры

&НаКлиенте
Процедура ДопИсточникФиксированныйСуффиксПриИзменении(Элемент)
	СформироватьОписаниеПравила();
КонецПроцедуры

&НаКлиенте
Процедура ДопИсточникКоличествоПервыхСимволовТипаРазделаПриИзменении(Элемент)
	СформироватьОписаниеПравила();
КонецПроцедуры

&НаКлиенте
Процедура ДопИсточникДобавлятьПорядковыйНомерПриИзменении(Элемент)
	СформироватьОписаниеПравила();
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура ОбновитьОписаниеПравила(Команда)
	СформироватьОписаниеПравила();
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

&НаКлиенте
Процедура СформироватьОписаниеПравила()
	ОписаниеПравила = СокрЛП(Объект.ОсновнойИсточник);
	Если Объект.Суффикс =
		ПредопределенноеЗначение("Перечисление.СуффиксыФормированияКодовРазделовСчетовДЕПО.Фиксированный") Тогда
		Если ЗначениеЗаполнено(Объект.ФиксированныйСуффикс) Тогда
			ОписаниеПравила = ОписаниеПравила + " + '" + Объект.ФиксированныйСуффикс + "'";
		КонецЕсли;
		
	ИначеЕсли Объект.Суффикс
		= ПредопределенноеЗначение("Перечисление.СуффиксыФормированияКодовРазделовСчетовДЕПО.ПервыеNСимволовТипаРаздела") Тогда
		Если Объект.КоличествоПервыхСимволовТипаРаздела > 0 Тогда
			ОписаниеПравила = ОписаниеПравила + " + первые " + Объект.КоличествоПервыхСимволовТипаРаздела
				+ " символов типа раздела";
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ДобавлятьПорядковыйНомер Тогда
		ОписаниеПравила = ОписаниеПравила + " + порядковый номер";
	КонецЕсли;
	
	Если Объект.ИспользоватьДополнительныйИсточникЕслиОсновнойПустой Тогда
		ОписаниеПравила = ОписаниеПравила + ". Если " + СокрЛП(Объект.ОсновнойИсточник) + " не заполнен, то "
			+ СокрЛП(Объект.ДополнительныйИсточник);
	
		Если Объект.ДопИсточникСуффикс =
			ПредопределенноеЗначение("Перечисление.СуффиксыФормированияКодовРазделовСчетовДЕПО.Фиксированный") Тогда
			
			Если ЗначениеЗаполнено(Объект.ДопИсточникФиксированныйСуффикс) Тогда
				ОписаниеПравила = ОписаниеПравила + " + '" + Объект.ДопИсточникФиксированныйСуффикс + "'";
			КонецЕсли;
			
		ИначеЕсли Объект.ДопИсточникСуффикс =
			ПредопределенноеЗначение("Перечисление.СуффиксыФормированияКодовРазделовСчетовДЕПО.ПервыеNСимволовТипаРаздела") Тогда
			
			Если Объект.ДопИсточникКоличествоПервыхСимволовТипаРаздела > 0 Тогда
				ОписаниеПравила = ОписаниеПравила + " + первые " + Объект.ДопИсточникКоличествоПервыхСимволовТипаРаздела
				+ " символов типа раздела";
			КонецЕсли;
		КонецЕсли;
		
		Если Объект.ДопИсточникДобавлятьПорядковыйНомер Тогда
			ОписаниеПравила = ОписаниеПравила + " + порядковый номер";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	Если Объект.Суффикс =
		ПредопределенноеЗначение("Перечисление.СуффиксыФормированияКодовРазделовСчетовДЕПО.Фиксированный") Тогда
		
		Элементы.ФиксированныйСуффикс.Видимость = Истина;
		Элементы.КоличествоПервыхСимволовТипаРаздела.Видимость = Ложь;
		
	ИначеЕсли Объект.Суффикс =
		ПредопределенноеЗначение("Перечисление.СуффиксыФормированияКодовРазделовСчетовДЕПО.ПервыеNСимволовТипаРаздела") Тогда
		
		Элементы.ФиксированныйСуффикс.Видимость = Ложь;
		Элементы.КоличествоПервыхСимволовТипаРаздела.Видимость = Истина;
		
	Иначе
		Элементы.ФиксированныйСуффикс.Видимость = Ложь;
		Элементы.КоличествоПервыхСимволовТипаРаздела.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ИспользоватьДополнительныйИсточникЕслиОсновнойПустой Тогда
		Если Объект.ДопИсточникСуффикс =
			ПредопределенноеЗначение("Перечисление.СуффиксыФормированияКодовРазделовСчетовДЕПО.Фиксированный") Тогда
			
			Элементы.ДопИсточникФиксированныйСуффикс.Видимость = Истина;
			Элементы.ДопИсточникКоличествоПервыхСимволовТипаРаздела.Видимость = Ложь;
			
		ИначеЕсли Объект.ДопИсточникСуффикс =
			ПредопределенноеЗначение("Перечисление.СуффиксыФормированияКодовРазделовСчетовДЕПО.ПервыеNСимволовТипаРаздела") Тогда
			
			Элементы.ДопИсточникФиксированныйСуффикс.Видимость = Ложь;
			Элементы.ДопИсточникКоличествоПервыхСимволовТипаРаздела.Видимость = Истина;
			
		Иначе
			Элементы.ДопИсточникФиксированныйСуффикс.Видимость = Ложь;
			Элементы.ДопИсточникКоличествоПервыхСимволовТипаРаздела.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;	
	Элементы.ГруппаДополнительныйИсточник.Доступность = Объект.ИспользоватьДополнительныйИсточникЕслиОсновнойПустой;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияРеквизитов()
	
	Если ТолькоПросмотр Тогда 
		Возврат;
	КонецЕсли;
	
	Если Объект.Суффикс =
		ПредопределенноеЗначение("Перечисление.СуффиксыФормированияКодовРазделовСчетовДЕПО.Фиксированный") Тогда
		Объект.КоличествоПервыхСимволовТипаРаздела = 0;
	ИначеЕсли Объект.Суффикс =
		ПредопределенноеЗначение("Перечисление.СуффиксыФормированияКодовРазделовСчетовДЕПО.ПервыеNСимволовТипаРаздела") Тогда
		Объект.ФиксированныйСуффикс = "";
	Иначе
		Объект.КоличествоПервыхСимволовТипаРаздела = 0;
		Объект.ФиксированныйСуффикс = "";
	КонецЕсли;
	
	Если Объект.ИспользоватьДополнительныйИсточникЕслиОсновнойПустой Тогда
		Если Объект.ДопИсточникСуффикс =
			ПредопределенноеЗначение("Перечисление.СуффиксыФормированияКодовРазделовСчетовДЕПО.Фиксированный") Тогда
			Объект.ДопИсточникКоличествоПервыхСимволовТипаРаздела = 0;
		ИначеЕсли Объект.ДопИсточникСуффикс =
			ПредопределенноеЗначение("Перечисление.СуффиксыФормированияКодовРазделовСчетовДЕПО.ПервыеNСимволовТипаРаздела") Тогда
			Объект.ДопИсточникФиксированныйСуффикс = "";
		Иначе
			Объект.ДопИсточникКоличествоПервыхСимволовТипаРаздела = 0;
			Объект.ДопИсточникФиксированныйСуффикс = "";
		КонецЕсли;
	Иначе
		Объект.ДополнительныйИсточник = ПредопределенноеЗначение("Перечисление.ИсточникиФормированияКодовРазделовСчетовДЕПО.ПустаяСсылка");
		Объект.ДопИсточникСуффикс = ПредопределенноеЗначение("Перечисление.СуффиксыФормированияКодовРазделовСчетовДЕПО.ПустаяСсылка");
		Объект.ДопИсточникФиксированныйСуффикс = "";
		Объект.ДопИсточникКоличествоПервыхСимволовТипаРаздела = 0;
		Объект.ДопИсточникДобавлятьПорядковыйНомер = Ложь;
	КонецЕсли;
	
КонецПроцедуры
