// IMDEV-8662, критерий отбора
// Описание: Оптимизация функции НайтиДокументы.
// Запрос разделен на два шага через временную таблицу ВТ_ДокументыПоОснованию
// с последующей фильтрацией по признаку ПометкаУдаления.
//
&ИзменениеИКонтроль("НайтиДокументы")
Функция FonProv_НайтиДокументы(Основание, ПометкаУдаления)

	Запрос = Новый Запрос;   

	Запрос.УстановитьПараметр("Основание", 			Основание);
	Запрос.УстановитьПараметр("ПометкаУдаления", 	ПометкаУдаления);
	#Удаление
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыПоБизнеспроцессам.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.ДокументыПоБизнеспроцессам(&Основание) КАК ДокументыПоБизнеспроцессам
	|ГДЕ
	|	&ОтборПометкаУдаления";
	#КонецУдаления
	#Вставка
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыПоБизнеспроцессам.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ДокументыПоОснованию
	|ИЗ
	|	КритерийОтбора.ДокументыПоБизнеспроцессам(&Основание) КАК ДокументыПоБизнеспроцессам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыПоБизнеспроцессам.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ДокументыПоОснованию КАК ДокументыПоБизнеспроцессам
	|ГДЕ
	|	&ОтборПометкаУдаления";
	#КонецВставки
	Если ПометкаУдаления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПометкаУдаления", "Истина");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПометкаУдаления",
		"ДокументыПоБизнеспроцессам.Ссылка.ПометкаУдаления = &ПометкаУдаления");
	КонецЕсли;	

	РезультатМассив = Новый Массив;

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат РезультатМассив;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		РезультатМассив.Добавить(Выборка.Ссылка);
	КонецЦикла;	

	Возврат РезультатМассив;

КонецФункции
