
&НаСервере
Процедура НазначитьУслугиНаСервере()
	РекОбъект = РеквизитФормыВЗначение("Объект");
	РекОбъект.УстановитьУслугиПоДоговору();
	ЗначениеВРеквизитФормы(РекОбъект, "Объект");
	УстановитьОтборПоВладельцуСписка(НазначенныеКомиссии, Объект.Договор);
КонецПроцедуры

&НаКлиенте
Процедура НазначитьУслуги(Команда)
	НазначитьУслугиНаСервере();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоВладельцуСписка(ДинСписок, Владелец = Неопределено)	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДинСписок
		, "ДоговорКонтрагента"
		, Владелец);
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборПоВладельцуСписка(НазначенныеКомиссии, Объект.Договор);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	УстановитьОтборПоВладельцуСписка(НазначенныеКомиссии, Объект.Договор);
КонецПроцедуры
