
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	АдресДвДанныхОтчета = ПоместитьВоВременноеХранилище(ТекущийОбъект.Отчет.Получить(), УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ДвДанные = ДвДанныеОтчета();
	ТекущийОбъект.Отчет = Новый ХранилищеЗначения(ДвДанные, Новый СжатиеДанных(9));
	
КонецПроцедуры
  
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Изменен реестр внешних отчетов", Объект.Ссылка);
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьОтчет(Команда)
	
  	ДвДанные = ДвДанныеОтчета();
	Если ТипЗнч(ДвДанные) <> Тип("ДвоичныеДанные") Тогда
		Предупреждение("Не задан отчет");	
		Возврат;
	КонецЕсли; 		
		
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	Фильтр = "Отчеты 1с8(*.epf)|*.epf";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Введите имя файла";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
	  	МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		ДвДанные.Записать(МассивФайлов[0]);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОтчет(Команда)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = "Отчеты 1с8(*.epf)|*.epf";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
	    МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		ДвДанные  = Новый ДвоичныеДанные(ДиалогОткрытияФайла.ПолноеИмяФайла); 
		АдресДвДанныхОтчета = ПоместитьВоВременноеХранилище(ДвДанные, УникальныйИдентификатор);
	Иначе
	    Предупреждение("Файл(ы) не выбран!");
	КонецЕсли;

КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДвДанныеОтчета()
	
	Результат = Неопределено;
	Если ЭтоАдресВременногоХранилища(АдресДвДанныхОтчета) Тогда
		Результат = ПолучитьИзВременногоХранилища(АдресДвДанныхОтчета);
		
	КонецЕсли; 
	Возврат Результат;
	
КонецФункции

//#КонецОбласти
