
// Добавляет с замещением новую запись в РС СостоянияДокументовВФайловомШлюзе.
//
// Параметры:
//  Период				 - Дата	 - период записи
//  Документ			 - ДокументСсылка.ТехническаяОперация	 - измерение "Документ"
//  СтатусПакета		 - ПеречислениеСсылка.СтатусыДокументовФайловыйШлюз	 - ресурс "Статус"
//  Пакет				 - ДокументСсылка.ИсходящийПакетВФайловыйШлюз, ДокументСсылка.ВходящийПакетИзФайловогоШлюза	 - ресурс "Пакет"
//  Комментарий			 - Строка	 - реквизит "Комментарий"
//  КоличествоИсполнения - Число	 - ресурс "КоличествоИсполнения"
//
Процедура ДобавитьЗапись(Период, Документ, СтатусПакета, Пакет = Неопределено, Комментарий = "", КоличествоИсполнения = 0) Экспорт
	
	НоваяЗаписьСостояние = РегистрыСведений.СостоянияДокументовВФайловомШлюзе.СоздатьМенеджерЗаписи();
	НоваяЗаписьСостояние.Период = Период;
	НоваяЗаписьСостояние.Документ = Документ;
	НоваяЗаписьСостояние.Статус = СтатусПакета;
	НоваяЗаписьСостояние.Пакет = Пакет;
	НоваяЗаписьСостояние.Комментарий = Комментарий;
	НоваяЗаписьСостояние.КоличествоИсполнения = КоличествоИсполнения;
	НоваяЗаписьСостояние.Записать();
	
КонецПроцедуры

// Возвращает текущий статус документа в файловом шлюзе
//
// Параметры:
//  Документ - ДокументСсылка.ТехническаяОперация	 - измерение "Документ"
// Возвращаемое значение:
//   - ПеречислениеСсылка.СтатусыДокументовФайловыйШлюз
Функция ТекущийСтатусДокумента(Документ) Экспорт
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.Выписка") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних(
		|			,
		|			Документ В
		|				(ВЫБРАТЬ
		|					ТехническаяОперация.Ссылка КАК Ссылка
		|				ИЗ
		|					Документ.ТехническаяОперация КАК ТехническаяОперация
		|				ГДЕ
		|					ТехническаяОперация.ДокументОснование = &Документ
		|					И НЕ ТехническаяОперация.ПометкаУдаления)) КАК СостоянияДокументовВФайловомШлюзеСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Период";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних(, Документ = &Документ) КАК СостоянияДокументовВФайловомШлюзеСрезПоследних";
	КонецЕсли;
	Запрос.УстановитьПараметр("Документ", Документ);
	РезультатЗапроса =  Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ТекущийСтатус = Выборка.Статус;
		КонецЕсли;
	Иначе
		ТекущийСтатус = Неопределено;
	КонецЕсли;
	
	Возврат ТекущийСтатус;
КонецФункции

