
&НаКлиенте
Процедура Заполнить(Команда)
	ОбновитьСписокВалютНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВалютНаСервере()
	ОбработкаЗагрузки = РеквизитФормыВЗначение("Объект");
	ОбработкаЗагрузки.ОбновитьСписокВалют();
	ЗначениеВРеквизитФормы(ОбработкаЗагрузки, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПериодЗагрузки.Вариант = ВариантСтандартногоПериода.Сегодня;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКурсы(Команда)
	ЗагрузитьКурсыНаСервере();
	ПоказатьОповещениеПользователя("Загрузка курсов валют", , РезультатВыполнения, БиблиотекаКартинок.Информация32);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсыНаСервере()
	ОбработкаЗагрузки = РеквизитФормыВЗначение("Объект");
	ОбработкаЗагрузки.НачДата = ПериодЗагрузки.ДатаНачала;
	ОбработкаЗагрузки.КонДата = ПериодЗагрузки.ДатаОкончания;
	ОбработкаЗагрузки.ЗагрузитьКурсыВалют();
	ОбработкаЗагрузки.ОбновитьСписокВалют();
	РезультатВыполнения = ОбработкаЗагрузки.СообщениеПоРезультатуВыполнения;
	ЗначениеВРеквизитФормы(ОбработкаЗагрузки, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметки(Команда)
	Для каждого СтрокаДанных Из Объект.СписокВалют Цикл
		СтрокаДанных.Загружать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	Для каждого СтрокаДанных Из Объект.СписокВалют Цикл
		СтрокаДанных.Загружать = Ложь;
	КонецЦикла;
КонецПроцедуры
