
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Макет = Справочники.КлассификаторСтранМира.ПолучитьМакет("КлассификаторСтранМира");

	Макет.Параметры.Расшифровка = Истина; // чтобы работала расшифровка

	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Макет);

	ТабличныйДокумент.ФиксацияСверху      = 3;

	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку     = Ложь;
	ТабличныйДокумент.ТолькоПросмотр      = Истина;

КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;

	// Получение значений полей выбранной строки.

	//ТабличныйДокумент = ЭлементыФормы.ПолеТабличногоДокумента;
	ТекущаяОбласть    = ТабличныйДокумент.ТекущаяОбласть;

	ОбластьКодЧисловой         = ТабличныйДокумент.Области.КодЧисловой;
	ОбластьАльфа2			   = ТабличныйДокумент.Области.КодАльфа2;
	ОбластьНаименованиеКраткое = ТабличныйДокумент.Области.НаименованиеКраткое;
	ОбластьНаименованиеПолное  = ТабличныйДокумент.Области.НаименованиеПолное;

	КодЧисловой         = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьКодЧисловой.        Лево, ТекущаяОбласть.Низ, ОбластьКодЧисловой.        Право).Текст;
	КодАльфа2           = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьАльфа2.             Лево, ТекущаяОбласть.Низ, ОбластьАльфа2.             Право).Текст;
	НаименованиеКраткое = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеКраткое.Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеКраткое.Право).Текст;
	НаименованиеПолное  = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеПолное. Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеПолное. Право).Текст;

	// Проверка наличия выбранного элемента.
	Ссылка = ПолучитьСсылку(КодЧисловой);

	Если НЕ Ссылка.Пустая() Тогда
		Вопрос = "В справочнике ""Классификатор стран мира"" уже существует элемент с кодом """ + КодЧисловой + """! Открыть существующий?";
		Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена, );

		Если      Ответ = КодВозвратаДиалога.Да Тогда
			Ссылка.ПолучитьФорму( , ВладелецФормы, ).Открыть();
			Возврат;

		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	// Создание нового элемента справочника.
	ФормаНовогоЭлемента = ПолучитьФорму("Справочник.КлассификаторСтранМира.Форма.ФормаЭлемента",,ВладелецФормы);

	ФормаНовогоЭлемента.Объект.Код                = КодЧисловой;
	ФормаНовогоЭлемента.Объект.КодАльфа2          = КодАльфа2;
	ФормаНовогоЭлемента.Объект.Наименование       = НаименованиеКраткое;
	ФормаНовогоЭлемента.Объект.НаименованиеПолное = НаименованиеПолное;

	ФормаНовогоЭлемента.Открыть();

КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьСсылку(КодЧисловой)
	
	Возврат Справочники.КлассификаторСтранМира.НайтиПоКоду(КодЧисловой);
	
КонецФункции

//#КонецОбласти