//#Область ОписаниеПеременных

&НаКлиенте
Перем мФормироватьНаименованиеПолноеАвтоматически;

//#КонецОбласти 

//#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьФлагФормироватьНаименованиеПолноеАвтоматически();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КонтактнаяИнформацияСервер.ПриСозданииНаСервере(ЭтаФорма);
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	НастроитьЭлементыПриСозданииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	КонтактнаяИнформацияСервер.ПриЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьОтборыДинамическихСписков(ЭтаФорма);
	УстановитьДоступностьДинамическихСписков();
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	СформироватьНаименованиеПолноеАвтоматически();
	
	 
	Элементы.НаименованиеПолное.СписокВыбора.Очистить(); 
	Элементы.НаименованиеПолное.СписокВыбора.Добавить(Объект.Наименование);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)
	УстановитьФлагФормироватьНаименованиеПолноеАвтоматически();
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыСчетаДепоМХ

&НаКлиенте
Процедура СчетаДепоМХПриАктивизацииСтроки(Элемент)
	УстановитьОтборРазделыСчетаДепо(ЭтаФорма, Элемент.ТекущаяСтрока);
	УстановитьСвойстваКнопкиУстановкиОсновногоСчетаДепо();
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыБанковскиеСчета

&НаКлиенте
Процедура БанковскиеСчетаПриАктивизацииСтроки(Элемент)
	УстановитьСвойстваКнопкиУстановкиОсновногоБанковскогоСчета();
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыБанковскиеСчета

&НаКлиенте
Процедура НаборКонтактнаяИнформацияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	КонтактнаяИнформацияКлиент.НачалоВыбораПредставления(ЭтаФорма);
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьОсновнойБанковскийСчет(Команда)	
	УстановитьОсновнойРеквизит(Элементы.БанковскиеСчета.ТекущиеДанные
		, Объект.ОсновнойБанковскийСчет);
	УстановитьСвойстваКнопкиУстановкиОсновногоБанковскогоСчета();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновнойСчетДепо(Команда)
	УстановитьОсновнойРеквизит(Элементы.СчетаДепоМХ.ТекущиеДанные
		, Объект.ОсновнойСчетДепо);
	УстановитьСвойстваКнопкиУстановкиОсновногоСчетаДепо();

КонецПроцедуры

&НаКлиенте
Процедура ПечатьАнкетыМХ(Команда)
		
	ТабДок = ПечатьАнкетыМХНаСервере();
	Если ТабДок.ВысотаТаблицы = 0 Тогда
		Возврат;		
	КонецЕсли; 	
	
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Истина;
	ТабДок.ТолькоПросмотр 		= Истина;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.Показать();
	
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

//#Область Сервис

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоНовый(Форма)
	Возврат НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка);	
КонецФункции 

&НаКлиенте
Процедура УстановитьОсновнойРеквизит(ДанныеСписка, ТекущийОсновнойРеквизит)
	
	Если ДанныеСписка = Неопределено Тогда
		Возврат;		
	КонецЕсли; 
	
	Если ТекущийОсновнойРеквизит = ДанныеСписка.Ссылка Тогда
		ТекущийОсновнойРеквизит = Неопределено;
	Иначе
		ТекущийОсновнойРеквизит = ДанныеСписка.Ссылка;		
	КонецЕсли; 
	
	Модифицированность = Истина;
	
КонецПроцедуры

//#КонецОбласти 

//#Область Диалог

//#Область НастройкиФормы

&НаСервере
Процедура НастроитьЭлементыПриСозданииНаСервере()
	
	УстановитьОтборРазделыСчетаДепо(ЭтаФорма);
	УстановитьОтборыДинамическихСписков(ЭтаФорма);
	УстановитьДоступностьДинамическихСписков();
	
КонецПроцедуры 

//#КонецОбласти 

//#Область СвойстваКнопокУстановкиОсновныхРеквизитов

&НаКлиенте
Процедура УстановитьСвойстваКнопкиУстановкиОсновногоБанковскогоСчета()
	УстановитьСвойстваКнопкиУстановкиОсновногоРеквизита(Элементы.БанковскиеСчетаУстановитьОсновнойБанковскийСчет
		, Элементы.БанковскиеСчета.ТекущиеДанные
		, Объект.ОсновнойБанковскийСчет);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвойстваКнопкиУстановкиОсновногоСчетаДепо()	
	УстановитьСвойстваКнопкиУстановкиОсновногоРеквизита(Элементы.СчетаДепоМХУстановитьОсновнойСчетДепо
		, Элементы.СчетаДепоМХ.ТекущиеДанные
		, Объект.ОсновнойСчетДепо);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвойстваКнопкиУстановкиОсновногоРеквизита(Кнопка, ДанныеСписка, ОсновнойРеквизит)
	
	Если ДанныеСписка = Неопределено Тогда
		Кнопка.Доступность = Ложь;
		Кнопка.Пометка = Ложь;
	Иначе
		Кнопка.Доступность = Истина;		
		Кнопка.Пометка = ДанныеСписка.Ссылка = ОсновнойРеквизит;		
	КонецЕсли; 
	
КонецПроцедуры

//#КонецОбласти 

//#Область ДинамическиеСписки

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборыДинамическихСписков(Форма)
	УстановитьОтборБанковскиеСчета(Форма);
	УстановитьОтборДоговоры(Форма);
	УстановитьОтборКодыЗагрузки(Форма);
	УстановитьОтборСчетаДепо(Форма);
КонецПроцедуры
 
&НаСервере
Процедура УстановитьДоступностьДинамическихСписков()
	
	ДоступностьЗакладок = НЕ ЭтоНовый(ЭтаФорма);
	
	Элементы.ГруппаКонтактыИСчета.Доступность = ДоступностьЗакладок;
	Элементы.ГруппаДоговоры.Доступность = ДоступностьЗакладок;
	Элементы.ГруппаУчетЦБ.Доступность = ДоступностьЗакладок;
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборБанковскиеСчета(Форма)
	ДинСписок = Форма.БанковскиеСчета;
	УстановитьОтборСписка(ДинСписок, Форма.Объект.Ссылка);		
КонецПроцедуры
 
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборДоговоры(Форма)
	ДинСписок = Форма.ДоговорыКонтрагентов;
	УстановитьОтборСписка(ДинСписок, Форма.Объект.Ссылка);		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборКодыЗагрузки(Форма)
	ДинСписок = Форма.КодыЗагрузки;
	УстановитьОтборСписка(ДинСписок, Форма.Объект.Ссылка);		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСчетаДепо(Форма)
	ДинСписок = Форма.СчетаДепоМХ;
	УстановитьОтборСписка(ДинСписок, Форма.Объект.Ссылка);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборРазделыСчетаДепо(Форма, Владелец = Неопределено)
	ДинСписок = Форма.РазделыСчетаДепоМХ;
	УстановитьОтборСписка(ДинСписок, Владелец, "Владелец");	
КонецПроцедуры
 
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(ДинСписок, ЗначениеПоля = Неопределено, ИмяПоля = "Владелец")	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДинСписок
		, ИмяПоля
		, ЗначениеПоля);
КонецПроцедуры 

//#КонецОбласти 

//#КонецОбласти

//#Область ВызовСервера

&НаСервере
Функция ПечатьАнкетыМХНаСервере()
	ТабДок = Новый ТабличныйДокумент;
	Макет = Справочники.МестаХранения.ПолучитьМакет("Печать");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	//установка параметров Заголовка
	Депозитарий = Константы.ОрганизацияПоУмолчанию.Получить();
	Если Депозитарий.Пустая() тогда
		Сообщить("Не выбрано значение организации, используемое по умолчанию!!!");
		Возврат ТабДок;
	КонецЕсли;
	Область.Параметры.Организация 	 = Депозитарий.НаименованиеПолное;
	ДанныеЛицензии					 = ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Депозитарий);	 
	Область.Параметры.ЛицензияНомер	 = "Лицензия № "+ДанныеЛицензии.НомерЛицензии + " от";
	Область.Параметры.ЛицензияДата	 = "" + ДанныеЛицензии.ДатаЛицензии + " г.";
		
	ТабДок.Вывести(Область);
	// Шапка
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Наименование 								= Объект.Наименование;
	Область.Параметры.НаименованиеПолное						= Объект.НаименованиеПолное;
	//передача параметров адресов
	Область.Параметры.ЮрАдрес									=  КонтактнаяИнформация.ПолучитьАдресИзКонтактнойИнформации(Объект.Ссылка,"Юридический");
	Область.Параметры.ПочтовыйАдрес								=  "";
	Область.Параметры.АдресМестонахождения						=  КонтактнаяИнформация.ПолучитьАдресИзКонтактнойИнформации(Объект.Ссылка, "Фактический");
	//передача параметров ИНН, основных и контактных лиц,телефон и адрес электронной почты
	Область.Параметры.ИНН 										= Объект.ИНН;
	Область.Параметры.ФИОруководителя 							= Объект.ФИОруководителя;
	Область.Параметры.КонтактныеЛица							= "";
	Область.Параметры.Телефоны									= "";
	Область.Параметры.АдресЭлектронойПочты						= "";
	
	ОсновнойБанковскийСчет = Объект.ОсновнойБанковскийСчет;
	
	//передача параметров банковских реквизитов
	Область.Параметры.ОсновнойБанковскийСчет 					= ОсновнойБанковскийСчет.Наименование;
	Область.Параметры.РасчетныйСчет								= ОсновнойБанковскийСчет.НомерСчета;
	Область.Параметры.НаименованиеБанка							= ОсновнойБанковскийСчет.Банк.Наименование;	
	Область.Параметры.КоррСчет									= ОсновнойБанковскийСчет.Банк.КоррСчет;
	Область.Параметры.БИК										= ОсновнойБанковскийСчет.Банк.Код;	
	
	//передача параметров регистрации и лицензирования
	Область.Параметры.НомерГосударственнойРегистрации 			= Объект.НомерГосударственнойРегистрации;
	Область.Параметры.ДатаГосударственнойРегистрации 			= Формат(Объект.ДатаГосударственнойРегистрации,"ДФ=dd.MM.yyyy");
	Область.Параметры.НаименованиеОрганаРегистрации 			= Объект.НаименованиеОрганаРегистрации;
	Область.Параметры.НомерЛицензииПрофУчастника 				= Объект.НомерЛицензииПрофУчастника;
	Область.Параметры.ДатаВыдачиЛицензии 						= Формат(Объект.ДатаВыдачиЛицензии,"ДФ=dd.MM.yyyy");
	Область.Параметры.ОрганВыдавшийЛицензию 					= Объект.ОрганВыдавшийЛицензию;
	ТабДок.Вывести(Область);

	//вывод таблицы счетов депо:
	Область = Макет.ПолучитьОбласть("ЗаголовокСчетаДепо");
	ТабДок.Вывести(Область);
	Область = Макет.ПолучитьОбласть("СтрокаСчета");
	Выборка = Справочники.СчетаДепоМХ.Выбрать(,Объект.Ссылка); 
	Пока Выборка.Следующий() Цикл
	
		Область.Параметры.НомерСчета				= Выборка.Код;
		Область.Параметры.ТипСчета					= Выборка.ТипСчета;
		Область.Параметры.НомерДатаДоговора			= Строка(Выборка.НомерДоговора)+" от "+ Строка(Выборка.ДатаДоговора);
		Область.Параметры.ДатаОткрСчета				= Выборка.ДатаОткрытияСчета;
		Область.Параметры.СостояниеСчета			= Выборка.СтатусСчетаДепо;
		Область.Параметры.ДатаЗакрытияСчета			= Выборка.ДатаЗакрытияСчета;
		ТабДок.Вывести(Область);
	
	КонецЦикла; 	

	Возврат ТабДок;
	
КонецФункции

//#КонецОбласти 

//#Область ФормированиеПолногоНаименования

// Процедура проверяет, необходимо ли формировать полное наименование автоматически или нет,
// и, если необходимо, формирует его.
//
&НаКлиенте
Процедура СформироватьНаименованиеПолноеАвтоматически()

	Если мФормироватьНаименованиеПолноеАвтоматически Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;

КонецПроцедуры // СформироватьНаименованиеПолноеАвтоматически()

// Процедура проверяет, совпадало ли ранее полное наименование с наименованием,
// и присваивает соответствующее значение переменной мФормироватьНаименованиеПолноеАвтоматически.
//
&НаКлиенте
Процедура УстановитьФлагФормироватьНаименованиеПолноеАвтоматически()

	мФормироватьНаименованиеПолноеАвтоматически = ПустаяСтрока(Объект.НаименованиеПолное) 
	 ИЛИ Объект.НаименованиеПолное = Объект.Наименование;
	 
КонецПроцедуры // УстановитьФлагФормироватьНаименованиеПолноеАвтоматически()

//#КонецОбласти 

//#КонецОбласти