

//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("ФизЛицо", Запись.ФизЛицо) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	МенеджерРегистра().УстановитьЗаголовокФормы(ЭтаФорма, Запись.ФизЛицо);
	ПрочитатьДанныеФизЛицаНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Модифицированность Тогда
		Если ЗавершениеРаботы Тогда
			ТекстПредупреждения = "Изменения не сохранены";
			Отказ = Истина;
		Иначе
			Ответ = Вопрос("Данные были изменены. Сохранить изменения перед выходом?", РежимДиалогаВопрос.ДаНетОтмена);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Записать();
				Закрыть();
			ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = Истина;
	Если НЕ Модифицированность Тогда
		Возврат;		
	КонецЕсли; 
	
	ЗаписатьНаСервере();		
	ФизическиеЛицаКлиент.ОповеститьПослеРедактирования(Запись.ФизЛицо, "ФИО");	
	Модифицированность = Ложь;	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВФорме(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	Отбор = новый Структура("ФизЛицо", Запись.ФизЛицо);
	ПараметрыФормы = Новый Структура("Отбор, НачальноеОтображениеСписка", Отбор, "Конец");
	ОткрытьФорму("РегистрСведений.ФИОФизЛиц.ФормаСписка",ПараметрыФормы);			
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНаСервере()
	МенЗаписи = МенеджерРегистра().СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенЗаписи, Запись);
	МенЗаписи.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеФизЛицаНаСервере()
	Отбор = Новый Структура("ФизЛицо", Запись.ФизЛицо);
	ТаблицаСреза = МенеджерРегистра().СрезПоследних(,Отбор);
	Если ЗначениеЗаполнено(ТаблицаСреза) Тогда
		Срез = ТаблицаСреза[0];
		ЗаполнитьЗначенияСвойств(Запись, Срез);
	Иначе
		Запись.Период = '19000101';		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция МенеджерРегистра()
	Возврат РегистрыСведений.ФИОФизЛиц;		
КонецФункции
 
//#КонецОбласти


