
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Документ", Отчет.Документ) Тогда
		ОбновитьОтчетНаСервере();
		Элементы.Документ.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьОтчет(Команда)
	ОбновитьОтчетНаСервере();
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОтчетНаСервере()

	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.СформироватьОтчет(Результат);

КонецПроцедуры

//#КонецОбласти

