#Область ПрограммныйИнтерфейс

// Ищет существующую, а если не находит создает новую карточку оферты по ценной бумаге и дате оферты
// Параметры:
//	ЦеннаяБумага - СправочникСсылка.ЦенныеБумаги
//	ДатаОферты - Дата
//
// Возвращаемое значение:
//	ДокументСсылка.КарточкаОферты
Функция НайденнаяИлиНоваяКарточкаОферты(ЦеннаяБумага, ДатаОферты) Экспорт
	КарточкаОферты = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КарточкаОферты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КарточкаОферты КАК КарточкаОферты
	|ГДЕ
	|	НЕ КарточкаОферты.ПометкаУдаления
	|	И КарточкаОферты.ДатаОферты = &ДатаОферты
	|	И КарточкаОферты.ЦеннаяБумага = &ЦеннаяБумага";
	Запрос.УстановитьПараметр("ДатаОферты", ДатаОферты);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		КарточкаОферты = Выборка.Ссылка;
	Иначе
		ДокументОбъект = Документы.КарточкаОферты.СоздатьДокумент();
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.ЦеннаяБумага = ЦеннаяБумага;
		ДокументОбъект.ДатаОферты = ДатаОферты;
		ДокументОбъект.Записать();
		КарточкаОферты = ДокументОбъект.Ссылка;
	КонецЕсли;
	
	Возврат КарточкаОферты;
КонецФункции

// По ценной бумаге и дате оферты находит корпоративное дейстие с видом КД - "Досрочное погашение
// облигаций по требованию владельца", если ничего не находит - возвращает неопрелено.
// Параметры:
//	ЦеннаяБумага - СправочникСсылка.ЦенныеБумаги
//	ДатаОферты - Дата
//
// Возвращаемое значение:
//	СправочникСсылка.КорпоративноеДействие - или Неопредлено если ничего не найдено
Функция КорпоративноеДействиеПоЦБиДатеОферты(ЦеннаяБумага, ДатаОферты) Экспорт
	КорпоративноеДействие = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КорпоративноеДействие_Новый.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый КАК КорпоративноеДействие_Новый
	|ГДЕ
	|	КорпоративноеДействие_Новый.ЦеннаяБумага1 = &ЦеннаяБумага
	|	И НАЧАЛОПЕРИОДА(КорпоративноеДействие_Новый.ДатаПроведенияСобрания, ДЕНЬ) = &ДатаОферты
	|	И КорпоративноеДействие_Новый.ВидКД = &BPUT
	|	И НЕ КорпоративноеДействие_Новый.ПометкаУдаления";
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	Запрос.УстановитьПараметр("ДатаОферты", НачалоДня(ДатаОферты) );
	Запрос.УстановитьПараметр("BPUT", Справочники.ВидыКорпоративныхДействий.ДосрочноеПогашениеОблигацийПоТребованиюВладельца);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		КорпоративноеДействие = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат КорпоративноеДействие;
КонецФункции

#КонецОбласти
