#Область ОбработчикиСобытий


// Процедура - При копировании
//
// Параметры:
//  ОбъектКопирования	 - ДокументОбъект.ИзменениеТарифногоПлана - Объект копирования
//
Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаОферты = Неопределено;
	КорпоративноеДействие = Неопределено;
	ДатаНачалаПриемаУведомлений = Неопределено;
	ДатаОкончанияПриемаУведомлений = Неопределено;
	ВремяВыставленияЗаявокНаПродажуНачало = Неопределено;
	ВремяВыставленияВстречныхЗаявокНачало = Неопределено;
	КарточкаОфертыОформлена = Неопределено;
	ОформлениеКарточкиОфертыИсполнитель = Неопределено;
	ОформлениеКарточкиОфертыДата = Неопределено;
	КарточкаОфертыПроверена = Неопределено;
	ПроверилКарточкуОфертыИсполнитель = Неопределено;
	ПроверилКарточкуОфертыДата = Неопределено;
	ЗаявкаАгентуНаПроверкуНаправлена = Неопределено;
	НаправлениеЗаявкаАгентуНаПроверкуИсполнитель = Неопределено;
	НаправлениеЗаявкаАгентуНаПроверкуДата = Неопределено;
	АгентСогласовалФормуЗаявки = Неопределено;
	СогласованиеФормыЗаявкиАгентомИсполнитель = Неопределено;
	СогласованиеФормыЗаявкиАгентомДата = Неопределено;
	ОригиналЗаявкиАгентуНаправлен = Неопределено;
	НаправлениеОригиналаЗаявкиАгентуИсполнитель = Неопределено;
	НаправлениеОригиналаЗаявкиАгентуДата = Неопределено;
	ПоступилаОтметкаОПолученииОригинала = Неопределено;
	ОтметкиОПолученииОригиналаИсполнитель = Неопределено;
	ОтметкаОПолученииОригиналаДата = Неопределено;
	СообщенияФОиКМНаправлены = Неопределено;
	НаправлениеСообщенийФОиКМИсполнитель = Неопределено;
	НаправлениеСообщенийФОиКМДата = Неопределено;
	ПроведенаПроверкаКД = Неопределено;
	ПроверкаКДИсполнитель = Неопределено;
	ПроверкаКДДата = Неопределено;
	
	Изменил = Справочники.Пользователи.ПустаяСсылка();
	Автор = Справочники.Пользователи.ПустаяСсылка();
	
КонецПроцедуры

// Процедура - Перед записью
//
// Параметры:
//  Отказ			 - Булево - Признак записи документа
//  РежимЗаписи		 - РежимЗаписиДокумента - Текущий режим записи
//  РежимПроведения	 - РежимПроведенияДокумента - Текущий режим проведения
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КорпоративноеДействие) Тогда
		КорпоративноеДействие = Документы.КарточкаОферты.КорпоративноеДействиеПоЦБиДатеОферты(ЦеннаяБумага, ДатаОферты);
	КонецЕсли;
	
	Если Не ЭтоНовый() Тогда
		Изменил = ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти