
// Добавляет с замещением новую запись в РС СостоянияДокументовВФайловомШлюзе.
//
// Параметры:
//  Период				 - Дата	 - период записи
//  Документ			 - ДокументСсылка.ТехническаяОперация	 - измерение "Документ"
//  СтатусПакета		 - ПеречислениеСсылка.СтатусыДокументовФайловыйШлюз	 - ресурс "Статус"
//  Пакет				 - ДокументСсылка.ИсходящийПакетВФайловыйШлюз, ДокументСсылка.ВходящийПакетИзФайловогоШлюза	 - ресурс "Пакет"
//  Комментарий			 - Строка	 - реквизит "Комментарий"
//  КоличествоИсполнения - Число	 - ресурс "КоличествоИсполнения"
//
Процедура ДобавитьЗапись(Период, Документ, СтатусПакета, Пакет = Неопределено, Комментарий = "", КоличествоИсполнения = 0) Экспорт
	
	НоваяЗаписьСостояние = РегистрыСведений.СостоянияДокументовВФайловомШлюзе.СоздатьМенеджерЗаписи();
	НоваяЗаписьСостояние.Период = Период;
	НоваяЗаписьСостояние.Документ = Документ;
	НоваяЗаписьСостояние.Статус = СтатусПакета;
	НоваяЗаписьСостояние.Пакет = Пакет;
	НоваяЗаписьСостояние.Комментарий = Комментарий;
	НоваяЗаписьСостояние.КоличествоИсполнения = КоличествоИсполнения;
	НоваяЗаписьСостояние.Записать();
	
КонецПроцедуры
