
#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьУведомлениеКОтправке(ПараметрыУведомления = Неопределено) Экспорт
	
	Если ПараметрыУведомления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьТемуПисьмаДляТестовойБазы(ПараметрыУведомления);
	
	НовыйУИД = Новый УникальныйИдентификатор;
	
	НовоеУведомление = РегистрыСведений.УведомленияКОтправке.СоздатьНаборЗаписей();
	НовоеУведомление.Отбор.ИДУведомления.Установить(НовыйУИД);
	
	НовоеУведомление.Прочитать();
	
	Если НовоеУведомление.Количество() = 0 Тогда
		НоваяЗапись = НовоеУведомление.Добавить();
		
		НоваяЗапись.ИДУведомления			= НовыйУИД;
		НоваяЗапись.ПараметрыУведомления	= Новый ХранилищеЗначения(ПараметрыУведомления);
	КонецЕсли;
	
	НоваяЗапись.ДатаОтправки = ТекущаяДатаСеанса();
	Если ТипЗнч(ПараметрыУведомления) = Тип("Соответствие") Тогда
		Настройка = ПараметрыУведомления["НастройкиОбмена"];
		Если ТипЗнч(Настройка) = Тип("СправочникСсылка.НастройкиОбменаДанными") Тогда
			НоваяЗапись.Отправитель = Справочники.НастройкиОбменаДанными.АктуальнаяУчетнаяЗаписьПриемаОтправкиСообщений(Настройка).Наименование;
			НоваяЗапись.Получатели = Настройка.АдресПолучателя;
		КонецЕсли;
		НоваяЗапись.Тема = ПараметрыУведомления["ТемаПисьма"];
		Если ТипЗнч(ПараметрыУведомления["Вложения"]) = Тип("Соответствие") Тогда
			Для Каждого Вложение Из ПараметрыУведомления["Вложения"] Цикл
				НоваяЗапись.ИменаВложений = НоваяЗапись.ИменаВложений + ?(ПустаяСтрока(НоваяЗапись.ИменаВложений), "", "; ") + Вложение.Ключ;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		НовоеУведомление.Записать();
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьТемуПисьмаДляТестовойБазы(ПараметрыУведомления)
	
	Если Привилегированный.ЭтоТестоваяБаза() Тогда
		ИмяСвойстваТемаПисьма = "ТемаПисьма";
		ЭтоТестоваяБаза = Истина;
		Если ПараметрыУведомления.Получить(ИмяСвойстваТемаПисьма) = Неопределено Тогда
			ПараметрыУведомления.Вставить(ИмяСвойстваТемаПисьма, УправлениеЭлектроннойПочтой.ТемаПисьмаСИсточником("", ЭтоТестоваяБаза));
		Иначе
			ПараметрыУведомления[ИмяСвойстваТемаПисьма] =
				УправлениеЭлектроннойПочтой.ТемаПисьмаСИсточником(ПараметрыУведомления[ИмяСвойстваТемаПисьма], ЭтоТестоваяБаза);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
