Перем ФормаДокументооборота Экспорт;
Перем Депозитарий;
Перем ДанныеЛицензии;
Перем мТекстыЗаголовков;

// Основной метод отчета. Формирует отчет и передаёт данные в ЭДО.
//
// Параметры:
//  ДокументРезультат	 - Табличный документ	 - В параметре возвращается результат формирования отчета.
//
Процедура СформироватьОтчет(ДокументРезультат) Экспорт
	
	Если Депозитарий.Пустая() Тогда
		Сообщить("Не выбрано значение организации, используемое по умолчанию!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаВыписки) Тогда
		Сообщить("Не указана дата выписки!");
		Возврат;
	КонецЕсли;
	
	// Если будет выгрузка в СЭД, нужно проверить на повторяющиеся номера документов
	Если ПоместитьВЭДО И НЕ Автоисполнение И НумераторыОбъектов.ЕстьПовторяющиесяНомераДокументов(Метаданные.Документы.Выписка, ДатаВыписки) Тогда
		Возврат;
	КонецЕсли;
	
	ВремяНачалаФормированияОтчета = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ДокументРезультат.Очистить();
	
	МассивВыписок		= ПолучитьМассивВыписок();
	ВвестиРазделитель	= Ложь;
	
	Если ЗначениеЗаполнено(ДатаФормированияОтчетов) Тогда
		ЗафиксироватьФормированиеОтчетовПоСПД(МассивВыписок);
	КонецЕсли;
	
	Для Каждого Выписка Из МассивВыписок Цикл
		Если ВвестиРазделитель Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ВвестиРазделитель = Истина;
		КонецЕсли;
		ТабличныйДокумент = СформироватьТабличныйДокументВыписки(Выписка);
		Если ПоместитьВЭДО Тогда
			ПоместитьВЭДО(Выписка, ТабличныйДокумент);
		КонецЕсли;
		ДокументРезультат.Вывести(ТабличныйДокумент);
	КонецЦикла;
	
	ДокументРезультат.АвтоМасштаб	= Истина;
	ДокументРезультат.Защита		= Ложь;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ФормированиеОтчетаОтчетОВыполненнойОперации_Новый", ВремяНачалаФормированияОтчета);
	
КонецПроцедуры

// Единообразный обработчик установки соединений для реализации цепочки взаимосвязанных обработок.
//
// Параметры:
//  Параметры	 - Структура	 - Опциональные параметры соединения для следующих обработок в цепочке.
//	* ИмяОбработки	 - Строка
//	* Параметры		 - Структура
//
Процедура ИнициироватьСоединение(Параметры = Неопределено) Экспорт
	Если ПустаяСтрока(ИмяОбработкиЭДО) Тогда
		ИмяОбработкиЭДО = "Документооборот";
	КонецЕсли;
	ВнешниеДанные.ИнициироватьСоединение(ФормаДокументооборота, ИмяОбработкиЭДО, Параметры);
КонецПроцедуры

Процедура ВывестиЗаголовок(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке, ВидОперацииПоВыписке)
	ИмяСекции			= "Заголовок";
	Область				= Макет.ПолучитьОбласть(ИмяСекции);
	ПараметрыОбласти	= Область.Параметры;

	УстановитьИнформациюОДепозитарии(ПараметрыОбласти, ИмяМакета, ОтчетНаАнглийскомЯзыке, ДатаВыписки,
		Выписка.СчетДепо.ВидСчетаДепо);
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыОбласти, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, Выписка.СчетДепо.ВидСчетаДепо);
	
	УстановитьТипОперации(ПараметрыОбласти, Выписка, ВидОперацииПоВыписке, ИмяМакета, ДатаВыписки, ОтчетНаАнглийскомЯзыке);

	Если ЗначениеЗаполнено(Выписка.ДокументОснование) Тогда
		УстановитьИнициатораОперации(ПараметрыОбласти, ИмяМакета, Выписка, ОтчетНаАнглийскомЯзыке);
		
		Если Найти(ИмяМакета, "Макет_2_10_") > 0 Тогда
			ПараметрыОбласти.НомерДепозитарногоДоговора = СокрЛП(Выписка.ОперацияЦБ.СчетДепо.Владелец.Код);
		КонецЕсли;
		
		УстановитьИнформациюОДепоненте(ПараметрыОбласти, ВидОперацииПоВыписке, ИмяМакета, Выписка, ДатаВыписки,
			ОтчетНаАнглийскомЯзыке);
	КонецЕсли;
	
	ТипОперацииЦБ = ТипЗнч(Выписка.ОперацияЦБ);
	
	ОбластьВыпискаОСостоянииЗаголовок = Неопределено;
	
	Если НЕ(ТипОперацииЦБ = Тип("ДокументСсылка.ОткрытиеСчетаДепо")
			ИЛИ ТипОперацииЦБ = Тип("ДокументСсылка.ЗакрытиеСчетаДепо")
			ИЛИ ТипОперацииЦБ = Тип("ДокументСсылка.ОткрытиеРазделаСчетаДепо") ) Тогда

		Если Выписка.ВидОтчета = Перечисления.ВидыОтчетов.ВыпискаОСостоянииСчетаДЕПО Тогда
			ИмяСекции = "ВыпискаОСостоянииЗаголовок";
			ОбластьВыпискаОСостоянииЗаголовок = Макет.ПолучитьОбласть(ИмяСекции);
			ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ОбластьВыпискаОСостоянииЗаголовок.Параметры,
				ИмяМакета, ИмяСекции, мТекстыЗаголовков, Выписка.СчетДепо.ВидСчетаДепо);
				
			// Дата
			ФормированиеПечатныхФорм.СформироватьДатуДДММГГ(ОбластьВыпискаОСостоянииЗаголовок.Параметры, "",
				Выписка.ДатаКонПериода);
			
			ПараметрыОбласти.ОтчетНомер	= "Выписка №";
			ПараметрыОбласти.ReportNo	= "Statement No.";
			ПараметрыОбласти.ТипОтчета	= "о состоянии счета ДЕПО";
			ПараметрыОбласти.ReportType	= "of Safekeeping Account";
		Иначе
			Если СтрНайти(ИмяМакета, "Макет_2_8_") > 0 Тогда
				Если ТипОперацииЦБ = Тип("ДокументСсылка.КонвертацияЦБ") Тогда
					ПараметрыОбласти.ВидОперации = "(" + ТипОперацииЦБ + ")";
				ИначеЕсли ТипОперацииЦБ = Тип("ДокументСсылка.ГлобальнаяОперация") Тогда
					ПараметрыОбласти.ВидОперации = "(" + Выписка.ОперацияЦБ.ТипКонвертации + ")";
				Иначе
					ПараметрыОбласти.ВидОперации = "";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ТабличныйДокумент.Вывести(Область);
	
	Если ОбластьВыпискаОСостоянииЗаголовок <> Неопределено Тогда
		ТабличныйДокумент.Вывести(ОбластьВыпискаОСостоянииЗаголовок);
	КонецЕсли;			
КонецПроцедуры

Процедура ВывестиПодвал(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке, ВидОперацииПоВыписке, ДопИнформацияПоПоручению)
	ИмяСекции			= "Подвал";
	Область				= Макет.ПолучитьОбласть(ИмяСекции);
	ПараметрыОбласти	= Область.Параметры;
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь; 
	Если НЕ ЗначениеЗаполнено(ТекПользователь) ИЛИ НЕ РольДоступна("ПравоПодписанияОтчетов") Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизаций.ПодписантОтчетовПоУмолчанию);
		ОтветственноеЛицо = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьПоследнее(ДатаВыписки, Отбор).ФизическоеЛицо;
	Иначе
		ОтветственноеЛицо	= ТекПользователь.ФизЛицо;
	КонецЕсли;
	
	// Получить факсимилье
	Если ВыводитьФаксимилеВОтчетах Тогда
		ФормированиеПечатныхФорм.ПолучитьФаксимилье(ОтветственноеЛицо, Область.Рисунки.Faksimilie.Картинка);
	Иначе
		Область.Рисунки.Faksimilie.Картинка	= Новый Картинка;
	КонецЕсли;

	ПараметрыОбласти.ФИО = Строка(?(ЗначениеЗаполнено(ОтветственноеЛицо), ОтветственноеЛицо,
		ПараметрыСеанса.ТекущийПользователь.ПолноеНаименование())); 	
	Если ОтчетНаАнглийскомЯзыке Тогда
		Если ДатаВыписки >= Константы.ДатаНачалаИспользованияМакетов2_12.Получить() Тогда
			ПараметрыОбласти.ФИО = ПараметрыОбласти.ФИО + " / " + ОбщегоНазначенияКлиентСервер.Транслит(
			ПараметрыОбласти.ФИО);
		Иначе
			ПараметрыОбласти.ФИО = ПараметрыОбласти.ФИО + " / " + ОбщегоНазначенияКлиентСервер.Транслит(
			?(ОтветственноеЛицо = Неопределено, ПараметрыСеанса.ТекущийПользователь.ПолноеНаименование(),
			ОтветственноеЛицо));
			
		КонецЕсли;
	КонецЕсли;
	
	ВидДокумента = "Поручение ";
	Если ЗначениеЗаполнено(Выписка.ДокументОснование) Тогда
		ПараметрыОбласти.Поручение = ВидДокумента + "№ " + СокрЛП(Выписка.ДокументОснование.Номер) + " от "
			+ Формат(Выписка.ДокументОснование.Дата,"ДЛФ=D")
			+ ОтчетНРДПоВНБСделкам(Выписка.ДокументОснование, ИмяМакета);
		Если ТипЗнч(Выписка.ДокументОснование) = Тип("ДокументСсылка.СлужебноеПоручение") Тогда
			РегНомерПоручения = СокрЛП(Выписка.ДокументОснование.Номер);
		Иначе
			РегНомерПоручения = СокрЛП(Выписка.ДокументОснование.ВходящийНомерПоручения);
		КонецЕсли;
	КонецЕсли;

	ФормированиеПечатныхФорм.СформироватьДатуДДММГГ(ПараметрыОбласти, "", Выписка.Дата);
	
	ЧасСтрокой = Формат(Час(Выписка.Дата), "ЧЦ=2;ЧВН=;ЧН=");
	ПараметрыОбласти.Час1 = Лев(ЧасСтрокой, 1);
	ПараметрыОбласти.Час2 = Прав(ЧасСтрокой, 1);
	
	МинутаСтрокой = Формат(Минута(Выписка.Дата), "ЧЦ=2;ЧВН=;ЧН=");
	ПараметрыОбласти.Минута1 = Лев(МинутаСтрокой, 1);
	ПараметрыОбласти.Минута2 = Прав(МинутаСтрокой, 1);
	
	Если ЗначениеЗаполнено(Выписка.ДокументОснование) Тогда
		Если ТипЗнч(Выписка.ДокументОснование) = Тип("ДокументСсылка.Поручение") Тогда
			ПараметрыОбласти.ДопИнформация = ДопИнформацияДляДокументаОснованияПоручение(Выписка, ВидОперацииПоВыписке)
				+ ДопИнформацияПоПоручению;
			
		ИначеЕсли ТипЗнч(Выписка.ДокументОснование) = Тип("ДокументСсылка.иц_СводноеПоручение")
					И Выписка.ДокументОснование.Биржа <> Справочники.Биржи.Внебирж Тогда
					
			ДопИнфо = "Отчет %НРД% от %ДатаВыписки%, отчет %НКЦ% от %ДатаВыписки%";
			ДопИнфо = СтрЗаменить(ДопИнфо, "%НРД%", СокрЛП(Константы.РасчетныйБанк.Получить().Наименование));
			ДопИнфо = СтрЗаменить(ДопИнфо, "%НКЦ%",	СокрЛП(Константы.КлиринговаяОрганизация.Получить().Наименование));
			ДопИнфо = СтрЗаменить(ДопИнфо, "%ДатаВыписки%", Формат(Выписка.ДокументОснование.ДатаИсполнения, "ДЛФ=Д"));
			ПараметрыОбласти.ДопИнформация = ДопИнфо;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОбласти.ДопИнформация) И ЗначениеЗаполнено(Выписка.ДопИнформация) Тогда
		ПараметрыОбласти.ДопИнформация = ПараметрыОбласти.ДопИнформация + "; ";
	КонецЕсли;
	
	ПараметрыОбласти.ДопИнформация = ПараметрыОбласти.ДопИнформация + Выписка.ДопИнформация;
	
	Если ЗначениеЗаполнено(Выписка.ОперацияЦБ)
		И (СтрНайти(ИмяМакета, "Макет_2_1_Версия04") > 0
			ИЛИ СтрНайти(ИмяМакета, "Макет_2_2_Версия03") > 0
			ИЛИ СтрНайти(ИмяМакета, "Макет_2_6_Версия03") > 0
			ИЛИ СтрНайти(ИмяМакета, "Макет_2_7_Версия03") > 0
			ИЛИ СтрНайти(ИмяМакета, "Макет_2_8_Версия03") > 0
			ИЛИ СтрНайти(ИмяМакета, "Макет_2_9_Версия03") > 0
			ИЛИ СтрНайти(ИмяМакета, "Макет_2_10_Версия02") > 0
			ИЛИ СтрНайти(ИмяМакета, "Макет_2_11_Версия02") > 0
			ИЛИ СтрНайти(ИмяМакета, "Макет_2_12_Версия01") > 0) Тогда
		ФормированиеПечатныхФорм.СформироватьДатуДДММГГ(ПараметрыОбласти, "Оп", Выписка.ОперацияЦБ.Дата);
	КонецЕсли;
	
	Если СтрНайти(ИмяМакета, "Макет_2_2_Версия03") > 0
		Или СтрНайти(ИмяМакета, "Макет_2_8_Версия03") > 0
		Или СтрНайти(ИмяМакета, "Макет_2_9_Версия03") > 0
		Или СтрНайти(ИмяМакета, "Макет_2_11_Версия02") > 0 Тогда
		Если ТипЗнч(Выписка.ОперацияЦБ) = Тип("ДокументСсылка.ОперацииЦБ") И ЗначениеЗаполнено(Выписка.ОперацияЦБ) Тогда
			ФормированиеПечатныхФорм.СформироватьДатуДДММГГ(ПараметрыОбласти, "Исп", Выписка.ОперацияЦБ.ДатаИсполненияВМестеРасчетов);
		ИначеЕсли ТипЗнч(Выписка.ДокументОснование) = Тип("ДокументСсылка.Поручение") И ЗначениеЗаполнено(Выписка.ДокументОснование) Тогда	
			Если ЗначениеЗаполнено(Выписка.ДокументОснование.ДатаИсполненияПорученияВМестеРасчетов) Тогда
				ФормированиеПечатныхФорм.СформироватьДатуДДММГГ(ПараметрыОбласти, "Исп", Выписка.ДокументОснование.ДатаИсполненияПорученияВМестеРасчетов);
			ИначеЕсли СтрНайти(ИмяМакета, "Макет_2_2_Версия03") > 0 Или СтрНайти(ИмяМакета, "Макет_2_9_Версия03") > 0 Тогда
				Область.УдалитьОбласть(Область.Область("ДатаИсполнения"), ТипСмещенияТабличногоДокумента.ПоВертикали);
			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить дату исполнения в месте расчетов по "+Выписка);
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Выписка.ДокументОснование)
		И ТипЗнч(Выписка.ОперацияЦБ) = Тип("ДокументСсылка.ОтменаПоручения") Тогда
		ПараметрыОбласти.Основание	= Выписка.ДокументОснование.ПричинаОтмены;
	КонецЕсли;
	
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыОбласти, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, Выписка.СчетДепо.ВидСчетаДепо);
		
	Если Выписка.СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетДЕПО Тогда
		ПараметрыОбласти.РеквизитыПриказа = РегистрыСведений.РеквизитыПриказовПриложенийКРДО.Реквизиты(ДатаВыписки);
	КонецЕсли;
	
	Если СтрНайти(ИмяМакета, "Макет_2_2_Версия03") > 0 Или СтрНайти(ИмяМакета, "Макет_2_7_Версия03") > 0 Тогда	
		ТабличныйДокумент.РазмерСтраницы = "A4"; 
		ТабличныйДокумент.АвтоМасштаб = Истина;
		Если Не ТабличныйДокумент.ПроверитьВывод(Область) Тогда
			ИменаЯчеек = "ДопИнформация";
			Если СтрНайти(ИмяМакета, "Макет_2_2_Версия03") > 0 И Выписка.СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ Тогда
				ИменаЯчеек = ИменаЯчеек + ", НаименованиеЦБ_НФИ";
			ИначеЕсли СтрНайти(ИмяМакета, "Макет_2_9_Версия03") > 0 Тогда
				ИменаЯчеек = ИменаЯчеек + ", ДокументыДепонента";
			Иначе
				ИменаЯчеек = ИменаЯчеек + ", НаименованиеЦБ";
			КонецЕсли;
			УменьшитьЩрифтЯчеек(ИменаЯчеек, Область, ТабличныйДокумент);
		КонецЕсли;
	КонецЕсли;
		
	ТабличныйДокумент.Вывести(Область);
КонецПроцедуры

Процедура УменьшитьЩрифтЯчеек(ИменаЯчеек, ВыводимаяОбласть, ТабличныйДокумент);
	Ячейки = Новый Структура(ИменаЯчеек);
	Области = Новый ТаблицаЗначений;
	Области.Колонки.Добавить("Область");
	Области.Колонки.Добавить("Текст");
	Области.Колонки.Добавить("Длина");
	Области.Колонки.Добавить("Шрифт");
	Области.Колонки.Добавить("МожноУменьшать");
	Для Каждого Ячейка Из Ячейки Цикл
		Область = ТабличныйДокумент.Области.Найти(Ячейка.Ключ);
		Если Область = Неопределено Тогда
			Область = ВыводимаяОбласть.Области.Найти(Ячейка.Ключ);
			Если Область = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена ячейка с именем '"+Ячейка.Ключ+"'!");
				Продолжить;
			ИначеЕсли Область.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр Тогда
				Текст = ВыводимаяОбласть.Параметры[Область.Параметр];
			Иначе
				Текст = Область.Текст;
			КонецЕсли;
		Иначе
			Текст = Область.Текст;
		КонецЕсли;
		Если ЗначениеЗаполнено(Текст) Тогда
			Строка = Области.Добавить();
			Строка.Область = Область;
			Строка.Текст = Текст;
			Строка.Длина = СтрДлина(Текст);
			Строка.Шрифт = Область.Шрифт;
			Строка.МожноУменьшать = Истина;
		КонецЕсли;
	КонецЦикла;
	Области.Сортировать("Длина Убыв");
	МинимальныйРазмерШрифта = 7;
	УместилосьНаСтраницу = Ложь;
	ЕстьЧтоУменьшать = Области.Количество() > 0;
	Пока Не УместилосьНаСтраницу И ЕстьЧтоУменьшать Цикл
		Если Области.Найти(Истина, "МожноУменьшать") = Неопределено Тогда
			Прервать;
		КонецЕсли;
		Для Каждого Строка Из Области Цикл
			Область = Строка.Область;
			Если Область.Шрифт.Размер > МинимальныйРазмерШрифта Тогда
				ИндексСтроки = Области.Индекс(Строка);
				Если ИндексСтроки < Области.Количество() - 1 Тогда
					КоличествоПовторов = Цел(Строка.Длина / Области[ИндексСтроки + 1].Длина);
				Иначе
					КоличествоПовторов = 1;
				КонецЕсли;
				Для Повтор = 1 По КоличествоПовторов Цикл
					Область.Шрифт = Новый Шрифт(Область.Шрифт, , Область.Шрифт.Размер-1);
					ТабличныйДокумент.АвтоМасштаб = Истина;
					УместилосьНаСтраницу = ТабличныйДокумент.ПроверитьВывод(ВыводимаяОбласть);
					Если УместилосьНаСтраницу Тогда
						Области.Очистить();
						Прервать;
					ИначеЕсли Область.Шрифт.Размер <= МинимальныйРазмерШрифта Тогда
						Строка.МожноУменьшать = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если Области.Количество() = 0 Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Если Не УместилосьНаСтраницу Тогда
		Для Каждого Строка Из Области Цикл
			Строка.Область.Шрифт = Строка.Шрифт;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
		
Функция СформироватьПредставлениеЦБ(ЦБ)
	Тип = "";
	Если ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Акция и ЦБ.ВидЦБ = Перечисления.ВидыАкций.Обыкновенная Тогда
		Тип = ", АО";
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Акция и ЦБ.ВидЦБ = Перечисления.ВидыАкций.Привилегированная Тогда
		Тип = ", АП";
	ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Облигация Тогда
		Тип = ", обл."
	КонецЕсли;
	
	Возврат Строка(ЦБ.Эмитент) + тип;
КонецФункции

Процедура ПоместитьВЭДО(Выписка, ТабличныйДокумент)
	
	Если ТипЗнч(Выписка.ОперацияЦБ) = Тип("ДокументСсылка.ОперацииЦБ") И (Выписка.ОперацияЦБ.ВидОперацииД = Справочники.ВидыОпераций.ПриемЦБНаОбслуживание ИЛИ Выписка.ОперацияЦБ.ВидОперацииД = Справочники.ВидыОпераций.СнятиеЦБсОбслуживания) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ВыгружатьПовторно И РегистрыСведений.РегистрацияДокументовВЭДО.ДокументВыгруженВЭДО(Выписка) Тогда
		Сообщение = Новый СообщениеПользователю();
    	Сообщение.Текст = "Документ уже был помещен в ЭДО ранее: "+Выписка;
    	Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	ТипыНаправленийПараметраADO = ВнешниеДанные.ИнициализацияТиповНаправленияПараметровADO();
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	ИнициироватьСоединение();
	ФормаДокументооборота.ПараметрыДокумента = Новый Структура("ПроцедураЗапроса, Клиент, ПолноеимяФайла, ИмяФайла, ДатаДокумента, ИдентификаторКлиента, НомерДоговора, Комментарий, РасширениеДокумента, СтатусДокумента, ВходящийНомер, ДатаПоступления, ИсходящийНомер, ДатаОтправления, ТипДокумента, ДатаОткрытия, ДатаЗакрытия, Параметр1, Параметр2, Параметр3");
	
	ИмяСформированногоФайла = ПолучитьИмяВременногоФайла("PDF");
	ТабличныйДокумент.Записать(ИмяСформированногоФайла, ТипФайлаТабличногоДокумента.PDF);
	
	ТаблицаПараметров = ВнешниеДанные.СоздатьТаблицуПараметров();
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "Client";
	НовыйПараметр.ЗначениеПараметра = СокрЛП(Выписка.ВладелецСчета);
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Входящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "OpenPeriod";
	НовыйПараметр.ЗначениеПараметра = Выписка.Дата;
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Входящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "ClosePeriod";
	НовыйПараметр.ЗначениеПараметра = Выписка.Дата;
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Входящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "Param1";
	НовыйПараметр.ЗначениеПараметра = СокрЛП(Выписка.ВидОтчета);
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Входящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "Param2";
	НовыйПараметр.ЗначениеПараметра = СокрЛП(Выписка.Номер);
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Входящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "Param3";
	НовыйПараметр.ЗначениеПараметра = Формат(Выписка.ДокументОснование.Дата,"ДФ='dd/MM/yyyy HH:mm:ss'");
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Входящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "FileName";
	НовыйПараметр.ЗначениеПараметра = "Отчет о выполненной операции";
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Входящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "DocumentDate";
	НовыйПараметр.ЗначениеПараметра = Выписка.Дата;
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Входящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "DocumentNumber";
	НовыйПараметр.ЗначениеПараметра = ?(ЗначениеЗаполнено(Выписка),Выписка.Номер,"");
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.ВходящийИсходящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "ClientId";
	НовыйПараметр.ЗначениеПараметра = УправлениеОтчетами.ПолучитьИдентификаторКлиента(Выписка.ВладелецСчета);
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Входящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "TypeId";
	Если ТипЗнч(Выписка.ОперацияЦБ) = Тип("ДокументСсылка.ОткрытиеСчетаДепо") ИЛИ ТипЗнч(Выписка.ОперацияЦБ) = Тип("ДокументСсылка.ЗакрытиеСчетаДепо") Тогда
		НовыйПараметр.ЗначениеПараметра = 7;
	Иначе
		НовыйПараметр.ЗначениеПараметра = 6;
	КонецЕсли;
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Входящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "FileExt";
	НовыйПараметр.ЗначениеПараметра = "pdf";
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Входящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "StatusId";
	НовыйПараметр.ЗначениеПараметра = 1;
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Входящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "ExportQuik";
	НовыйПараметр.ЗначениеПараметра = 0;
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Исходящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "ResultMessage";
	НовыйПараметр.ЗначениеПараметра = "";
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Исходящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "ErrorCode";
	НовыйПараметр.ЗначениеПараметра = 0;
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Исходящий;
	
	НовыйПараметр = ТаблицаПараметров.Добавить();
	НовыйПараметр.ИмяПараметра = "ScenariosCode";
	НовыйПараметр.ЗначениеПараметра = "BackOffice";
	НовыйПараметр.НаправлениеПараметра = ТипыНаправленийПараметраADO.Входящий;
	
	ВнешниеДанные.ДобавитьПараметрВТаблицу(ТаблицаПараметров, "NewDocId", 0, ТипыНаправленийПараметраADO.Исходящий);
	
	ФормаДокументооборота.ПараметрыДокумента = Новый Структура("ПроцедураЗапроса, ПолноеимяФайла, ТаблицаПараметров");
	ФормаДокументооборота.ПараметрыДокумента.ПроцедураЗапроса	= "CreateDocumentFrom1C";
	ФормаДокументооборота.ПараметрыДокумента.ПолноеИмяФайла		= ИмяСформированногоФайла;
	ФормаДокументооборота.ПараметрыДокумента.ТаблицаПараметров	= ТаблицаПараметров;
	ФормаДокументооборота.ПараметрыДокумента.Вставить("ВозвращатьСтатусЗагрузки", Истина); // Требование возврата статуса загрузки из обработки
	
	ФормаДокументооборота.ЗагрузкаДанных();
	
	Если Не ВыгружатьПовторно Тогда //  в тестовом режиме не меняем выписки
		ДокВыписка = Выписка.ПолучитьОбъект();
		ДокВыписка.ИсходящийНомер = Выписка.Номер;
		ДокВыписка.Записать(РежимЗаписиДокумента.Запись);
		
		// Регистрация успешной выгрузки документа
		Если ФормаДокументооборота.ПараметрыДокумента.Свойство("ДокументУспешноЗарегистрирован") И ФормаДокументооборота.ПараметрыДокумента.ДокументУспешноЗарегистрирован Тогда
			РегистрыСведений.РегистрацияДокументовВЭДО.РегистрироватьВыгрузкуДокументаВЭДО(Выписка, ТаблицаПараметров);
			Если Документы.Поручение.ЭтоПоручениеНаИнвентарнуюОперациюПоСделке(ДокВыписка.ДокументОснование) Тогда
				РегистрыСведений.СтатусыПорученийВСЭД.ЗарегистрироватьСтатусПоручения(ДокВыписка.ДокументОснование, Перечисления.СтатусыДокументовВСЭД.Загружено);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиСостояниеСчетаДепо(Выписка, Макет, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОстаткиЦБОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБОстатки.ЦБ КАК ЦеннаяБумага,
	|	ОстаткиЦБОстатки.КоличествоОстаток,
	|	ОстаткиЦБОстатки.СчетДепоМХ.Владелец КАК МХ,
	|	ОстаткиЦБОстатки.РазделСчетаДепоМХ,
	|	ОстаткиЦБОстатки.ЦБ.ДатаГосРег КАК ДатаГосРег,
	|	ОстаткиЦБОстатки.ЦБ.НомерРегистрации КАК РегНомер,
	|	НоминалЦБСрезПоследних.Сумма КАК Номинал,
	|	ВЫБОР
	|		КОГДА ОстаткиЦБОстатки.ЦБ.ВалютаНоминала.Наименование = ""SUR""
	|			ТОГДА ""RUR""
	|		ИНАЧЕ ОстаткиЦБОстатки.ЦБ.ВалютаНоминала.Наименование
	|	КОНЕЦ КАК ВалютаНоминала
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(&Период, СчетДепо = &СчетДепо) КАК ОстаткиЦБОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ.СрезПоследних КАК НоминалЦБСрезПоследних
	|		ПО ОстаткиЦБОстатки.ЦБ = НоминалЦБСрезПоследних.ЦеннаяБумага
	|ИТОГИ ПО
	|	РазделСчетаДепо");
	Запрос.УстановитьПараметр("Период", ДатаВыписки);
	Запрос.УстановитьПараметр("СчетДепо", Выписка.СчетДепо);
	ВыборкаПоРазделам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьСведенияОЦБ = Макет.ПолучитьОбласть("ОбластьСведенияОЦБ");
	ТабличныйДокумент.Вывести(ОбластьСведенияОЦБ);
	
	Пока ВыборкаПоРазделам.Следующий() Цикл
		
		ОбластьРаздел = Макет.ПолучитьОбласть("РазделСчетаЗаголовок");
		ОбластьРаздел.Параметры.НомерРазделаСчетаДепо = ВыборкаПоРазделам.РазделСчетаДепо.Код;
		ОбластьРаздел.Параметры.НаименованиеРазделаСчетаДепо = ВыборкаПоРазделам.РазделСчетаДепо;
		ТабличныйДокумент.Вывести(ОбластьРаздел);
		
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("СведенияОЦенныхБумагах");
		ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
		
		Выборка = ВыборкаПоРазделам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ОбластьСтрока = Макет.ПолучитьОбласть("ЦеннаяБумагаСтрока");
		Пока Выборка.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			ОбластьСтрока.Параметры.ЦеннаяБумага = СформироватьПредставлениеЦБ(Выборка.ЦеннаяБумага);
			ОбластьСтрока.Параметры.Номинал = Строка(Выборка.Номинал) + " " + Выборка.ВалютаНоминала;
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиОперациюЦБМакет_2_9(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке, ВидОперацииПоВыписке)
	// РеквизитыСчетаДЕПО СПИСАНИЕ
	ИмяСекции			= "РеквизитыСчетаДЕПО";
	Область				= Макет.ПолучитьОбласть(ИмяСекции);	
	ПараметрыОбласти	= Область.Параметры;
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыОбласти, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, Выписка.СчетДепо.ВидСчетаДепо);
	ПараметрыОбласти.СписаниеЗачисление = "списания";
	ПараметрыОбласти.НомерСчетаДЕПО = СокрЛП(Выписка.СчетДепо.Код); 
	ПараметрыОбласти.НаименованиеСчетаДЕПО = ?(СтрНайти(ИмяМакета, "Макет_2_9_Версия03") > 0,
		ТипСчета(Выписка.СчетДепо),
		ОбщегоНазначенияКлиентСервер.НаименованиеКлиента(Выписка.СчетДепо.Владелец, ОтчетНаАнглийскомЯзыке)); 
	
	Если Тип("ДокументСсылка.иц_СводноеПоручение") = ТипЗнч(Выписка.ДокументОснование) Тогда
		ПараметрыОбласти.НомерРаздела			= СокрЛП(Выписка.ОперацияЦБ.РазделСчетаДепо.Код);
		ПараметрыОбласти.НаименованиеРаздела	= СокрЛП(Выписка.ОперацияЦБ.РазделСчетаДепо.Наименование);
	Иначе
		Раздел = Выписка.ОперацияЦБ.РазделСчетаДепо;
		ПараметрыОбласти.НомерРаздела = СокрЛП(Раздел.Код);
		ПараметрыОбласти.НаименованиеРаздела = СокрЛП(Раздел.Наименование);
	КонецЕсли;
	
	ПараметрыОбласти.МестоХранения = СокрЛП(Выписка.ОперацияЦБ.МестоХранения.КодМестаХранения);
	ТабличныйДокумент.Вывести(Область);
	
	// РеквизитыСчетаДЕПО ЗАЧИСЛЕНИЕ
	ПараметрыОбласти.СписаниеЗачисление = "зачисления";
	ПараметрыОбласти.НомерСчетаДЕПО = СокрЛП(Выписка.ОперацияЦБ.СчетДепоПолучатель.Код); 
	ПараметрыОбласти.НаименованиеСчетаДЕПО = ?(СтрНайти(ИмяМакета, "Макет_2_9_Версия03") > 0,
		ТипСчета(Выписка.ОперацияЦБ.СчетДепоПолучатель),
		ОбщегоНазначенияКлиентСервер.НаименованиеКлиента(Выписка.ОперацияЦБ.СчетДепоПолучатель.Владелец, ОтчетНаАнглийскомЯзыке));
	
	ПараметрыОбласти.НомерРаздела			= СокрЛП(Выписка.ОперацияЦБ.РазделСчетаДепоПолучатель.Код);
	ПараметрыОбласти.НаименованиеРаздела	= СокрЛП(Выписка.ОперацияЦБ.РазделСчетаДепоПолучатель.Наименование);
	ПараметрыОбласти.МестоХранения = СокрЛП(Выписка.ОперацияЦБ.МестоХраненияПолучатель.КодМестаХранения);
	ТабличныйДокумент.Вывести(Область);
	
	// ОперацияПоСчету
	Если СтрНайти(ИмяМакета, "Макет_2_9_Версия03") > 0 И Выписка.СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ Тогда
		ИмяСекции = "ОперацияПоСчетуНФИ";
	Иначе
		ИмяСекции = "ОперацияПоСчету";
	КонецЕсли;
	Область				= Макет.ПолучитьОбласть(ИмяСекции);	
	ПараметрыОбласти	= Область.Параметры;
	// Параметры, общие для обеих секций
	ПараметрыОбласти.НаименованиеЦБ = ОбщегоНазначенияКлиентСервер.ПредставлениеЦБ(Выписка.ОперацияЦБ.ЦБ,
		ОтчетНаАнглийскомЯзыке);
	Попытка
		ПараметрыОбласти.ISIN = СокрЛП(Выписка.ОперацияЦБ.ЦБ.ISIN);
	Исключение
	КонецПопытки;
	ПараметрыОбласти.КоличествоЦБ = Выписка.ОперацияЦБ.Количество;
	Если ИмяСекции = "ОперацияПоСчету" Тогда
		ПараметрыОбласти.ВидЦБ = СокрЛП(Выписка.ОперацияЦБ.ЦБ.ТипЦБ) + " " + НРег(Выписка.ОперацияЦБ.ЦБ.ВидЦБ);
		ПараметрыОбласти.НомерГосРегистрации = СокрЛП(Выписка.ОперацияЦБ.ЦБ.НомерРегистрации);
		Номинал = РегистрыСведений.НоминалЦБ.ПолучитьПоследнее(Выписка.ОперацияЦБ.Дата,	Новый Структура("ЦеннаяБумага",
			Выписка.ОперацияЦБ.ЦБ));
		ПараметрыОбласти.НоминальнаяСтоимостьЦБ = Формат(?(Номинал.Сумма <> Неопределено, Номинал.Сумма, 0),
			"ЧДЦ=6; ЧРД=.") + " " + Справочники.Валюты.ПредставлениеВалюты(Выписка.ОперацияЦБ.ЦБ.ВалютаНоминала);
	КонецЕсли;
	ТабличныйДокумент.Вывести(Область);
КонецПроцедуры

Процедура ВывестиОперациюЦБМакет_2_12(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке, ВидОперацииПоВыписке)
	Если Выписка.ОперацияЦБ.ВидОперацииД = Справочники.ВидыОпераций.ПередачаВЗалог Тогда
		СчетДЕПОСписания			= Выписка.СчетДепо;
		СчетДЕПОЗачисления			= Выписка.ОперацияЦБ.СчетДепоПолучатель;
		
		НомерСчетаДЕПОСписания		= Выписка.СчетДепо.Код;
		НомерСчетаДЕПОЗачисления	= Выписка.ОперацияЦБ.СчетДепоПолучатель.Код;
		
		КлиентСписания				= Выписка.СчетДепо.Владелец;
		КлиентЗачисления			= Выписка.ОперацияЦБ.СчетДепоПолучатель.Владелец;
		
		РазделСписания				= Выписка.ОперацияЦБ.РазделСчетаДепо;
		РазделЗачисления			= Выписка.ОперацияЦБ.РазделСчетаДепоПолучатель;
		
		МестоХраненияСписания		= Выписка.ОперацияЦБ.МестоХранения.КодМестаХранения;
		МестоХраненияЗачисления		= Выписка.ОперацияЦБ.МестоХраненияПолучатель.КодМестаХранения;
		
	Иначе // Возврат из залога
		СчетДЕПОСписания			= Выписка.ОперацияЦБ.СчетДепоПолучатель;
		СчетДЕПОЗачисления			= Выписка.СчетДепо;
		
		НомерСчетаДЕПОСписания		= Выписка.ОперацияЦБ.СчетДепоПолучатель.Код;
		НомерСчетаДЕПОЗачисления	= Выписка.СчетДепо.Код;
		
		КлиентСписания				= Выписка.ОперацияЦБ.СчетДепоПолучатель.Владелец;
		КлиентЗачисления			= Выписка.СчетДепо.Владелец;
		
		РазделСписания				= Выписка.ОперацияЦБ.РазделСчетаДепоПолучатель;
		РазделЗачисления			= Выписка.ОперацияЦБ.РазделСчетаДепо;
		
		МестоХраненияСписания		= Выписка.ОперацияЦБ.МестоХраненияПолучатель.КодМестаХранения;
		МестоХраненияЗачисления		= Выписка.ОперацияЦБ.МестоХранения.КодМестаХранения;
	КонецЕсли;
	
	ИмяСекции			= "РеквизитыСчетаДЕПО";
	Область				= Макет.ПолучитьОбласть(ИмяСекции);	
	ПараметрыОбласти	= Область.Параметры;
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыОбласти, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, Выписка.СчетДепо.ВидСчетаДепо);
	// РеквизитыСчетаДЕПО СПИСАНИЕ
	ПараметрыОбласти.НаправлениеОперации	= "списания ценных бумаг";
	ПараметрыОбласти.НомерСчетаДЕПО			= СокрЛП(НомерСчетаДЕПОСписания);
	ПараметрыОбласти.НаименованиеСчетаДЕПО	= ТипСчета(СчетДЕПОСписания);
	ПараметрыОбласти.НомерРаздела			= СокрЛП(РазделСписания.Код);				
	ПараметрыОбласти.НаименованиеРаздела	= СокрЛП(РазделСписания.Наименование);			
	ПараметрыОбласти.МестоХранения			= СокрЛП(МестоХраненияСписания);
	ТабличныйДокумент.Вывести(Область);
	
	// РеквизитыСчетаДЕПО ЗАЧИСЛЕНИЕ
	ПараметрыОбласти.НаправлениеОперации	= "зачисления ценных бумаг";
	ПараметрыОбласти.НомерСчетаДЕПО			= СокрЛП(НомерСчетаДЕПОЗачисления);
	ПараметрыОбласти.НаименованиеСчетаДЕПО	= ТипСчета(СчетДЕПОЗачисления); 			
	ПараметрыОбласти.НомерРаздела			= СокрЛП(РазделЗачисления.Код);
	ПараметрыОбласти.НаименованиеРаздела	= СокрЛП(РазделЗачисления.Наименование);
	ПараметрыОбласти.МестоХранения			= СокрЛП(МестоХраненияЗачисления);
	ТабличныйДокумент.Вывести(Область);
	
	// ОперацияПоСчету
	Номинал = РегистрыСведений.НоминалЦБ.ПолучитьПоследнее(Выписка.ОперацияЦБ.Дата,	Новый Структура("ЦеннаяБумага",
		Выписка.ОперацияЦБ.ЦБ));
	ИмяСекции			= "ОперацияПоСчету";
	Область				= Макет.ПолучитьОбласть(ИмяСекции);	
	ПараметрыОбласти	= Область.Параметры;
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыОбласти, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, Выписка.СчетДепо.ВидСчетаДепо);
	ПараметрыОбласти.НаименованиеЦБ = ОбщегоНазначенияКлиентСервер.ПредставлениеЦБ(Выписка.ОперацияЦБ.ЦБ,
		ОтчетНаАнглийскомЯзыке);
	ПараметрыОбласти.ВидЦБ = СокрЛП(Выписка.ОперацияЦБ.ЦБ.ТипЦБ) + " " + НРег(Выписка.ОперацияЦБ.ЦБ.ВидЦБ);
	ПараметрыОбласти.НомерГосРегистрации = СокрЛП(Выписка.ОперацияЦБ.ЦБ.НомерРегистрации);
	Попытка
		ПараметрыОбласти.ISIN = СокрЛП(Выписка.ОперацияЦБ.ЦБ.ISIN);
	Исключение
	КонецПопытки;
	ПараметрыОбласти.НоминальнаяСтоимостьЦБ = Формат(?(Номинал.Сумма <> Неопределено, Номинал.Сумма, 0),
		"ЧДЦ=6; ЧРД=.") + " " + Справочники.Валюты.ПредставлениеВалюты(Выписка.ОперацияЦБ.ЦБ.ВалютаНоминала);
	ПараметрыОбласти.КоличествоЦБ = Выписка.ОперацияЦБ.Количество;
	ТабличныйДокумент.Вывести(Область);
КонецПроцедуры

Процедура ВывестиОперациюЦБ(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке, ВидОперацииПоВыписке)
	Если Найти(ИмяМакета, "Макет_2_9_") > 0 Тогда
		ВывестиОперациюЦБМакет_2_9(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке, ВидОперацииПоВыписке);
		
	ИначеЕсли Найти(ИмяМакета, "Макет_2_12_") > 0 Тогда
		ВывестиОперациюЦБМакет_2_12(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке, ВидОперацииПоВыписке);
		
	Иначе // Остальные макеты
		Если Найти(ИмяМакета, "Макет_2_2_") > 0 Тогда
			Если Тип("ДокументСсылка.Поручение") = ТипЗнч(Выписка.ДокументОснование)
				И ВидОперацииПоВыписке = Справочники.ВидыОпераций.Перевод
				И ЭтоПереводЗачисление(Выписка) Тогда
				
				НомерРазделаСчетаДЕПО			= Выписка.ОперацияЦБ.РазделСчетаДепоПолучатель.Код;
				НаименованиеРазделаСчетаДЕПО	= Выписка.ОперацияЦБ.РазделСчетаДепоПолучатель.Наименование;
			Иначе
				Если Выписка.ОперацияЦБ.РазделСчетаДепо.ТипРазделаСчетаДЕПО =
						Перечисления.ТипыРазделовСчетовДЕПО.БлокированоРасчеты Тогда
					// При снятии с депонирования создается раздел "Блокировано (расчеты)" и в операции указывается
					// именно он. Тогда для клиента нужно вывести раздел из оригинального поручения.
					НомерРазделаСчетаДЕПО			= Выписка.ОперацияЦБ.ДокументОснование.РазделСчетаДепо.Код;
					НаименованиеРазделаСчетаДЕПО	= Выписка.ОперацияЦБ.ДокументОснование.РазделСчетаДепо.Наименование;
				Иначе
					НомерРазделаСчетаДЕПО			= Выписка.ОперацияЦБ.РазделСчетаДепо.Код;
					НаименованиеРазделаСчетаДЕПО	= Выписка.ОперацияЦБ.РазделСчетаДепо.Наименование;
				КонецЕсли;
			КонецЕсли;
			
			ИмяСекции			= "ОперацияПоСчетуЗаголовок";
			Область				= Макет.ПолучитьОбласть(ИмяСекции);	
			ПараметрыОбласти	= Область.Параметры;
			ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыОбласти, ИмяМакета, ИмяСекции,
				мТекстыЗаголовков, Выписка.СчетДепо.ВидСчетаДепо);
			ПараметрыОбласти.НомерРазделаСчетаДЕПО			= СокрЛП(НомерРазделаСчетаДЕПО);
			ПараметрыОбласти.НаименованиеРазделаСчетаДЕПО	= СокрЛП(НаименованиеРазделаСчетаДЕПО);
			ПараметрыОбласти.МестоХранения					= СокрЛП(Выписка.ОперацияЦБ.МестоХранения.КодМестаХранения);
			ТабличныйДокумент.Вывести(Область);
		КонецЕсли;
		
		Если СтрНайти(ИмяМакета, "Макет_2_2_Версия03") > 0
			И Выписка.СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ Тогда
			ИмяСекции = "ОперацияПоСчетуНФИ";
		Иначе
			ИмяСекции = "ОперацияПоСчету";
		КонецЕсли;
		Область				= Макет.ПолучитьОбласть(ИмяСекции);	
		ПараметрыОбласти	= Область.Параметры;
		ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыОбласти, ИмяМакета, ИмяСекции,
			мТекстыЗаголовков, Выписка.СчетДепо.ВидСчетаДепо);
		// Параметры, общие для обеих секций
		ПараметрыОбласти.НаименованиеЦБ = ОбщегоНазначенияКлиентСервер.ПредставлениеЦБ(Выписка.ОперацияЦБ.ЦБ,
			ОтчетНаАнглийскомЯзыке);
		Попытка
			ПараметрыОбласти.ISIN = СокрЛП(Выписка.ОперацияЦБ.ЦБ.ISIN);
		Исключение
		КонецПопытки;
		ПараметрыОбласти.КоличествоЦБ = Выписка.ОперацияЦБ.Количество;
		
		Если ИмяСекции = "ОперацияПоСчету" Тогда
			ПараметрыОбласти.ВидЦБ = СокрЛП(Выписка.ОперацияЦБ.ЦБ.ТипЦБ) + " " + НРег(Выписка.ОперацияЦБ.ЦБ.ВидЦБ);
			Если ОтчетНаАнглийскомЯзыке Тогда
				ПараметрыОбласти.ВидЦБ = ПараметрыОбласти.ВидЦБ + " / " +
					ОбщегоНазначенияКлиентСервер.ПредставлениеТипаЦБ(Выписка.ОперацияЦБ.ЦБ, Истина);
			КонецЕсли;
			ПараметрыОбласти.НомерГосРегистрации = СокрЛП(Выписка.ОперацияЦБ.ЦБ.НомерРегистрации);
			Номинал = РегистрыСведений.НоминалЦБ.ПолучитьПоследнее(Выписка.ОперацияЦБ.Дата, Новый Структура("ЦеннаяБумага",
				Выписка.ОперацияЦБ.ЦБ));
			ПараметрыОбласти.НоминальнаяСтоимостьЦБ = Формат(?(Номинал.Сумма <> Неопределено, Номинал.Сумма, 0),
				"ЧДЦ=6; ЧРД=.") + " " + Справочники.Валюты.ПредставлениеВалюты(Выписка.ОперацияЦБ.ЦБ.ВалютаНоминала);
		КонецЕсли;
		ТабличныйДокумент.Вывести(Область);
	КонецЕсли;
КонецПроцедуры

Процедура ВывестиГлобальнуюОперацию(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке, ВидОперацииПоВыписке)
	Если Выписка.ОперацияЦБ.ВидГлобальнойОперации = Справочники.ВидыОпераций.Конвертация Тогда
		Если Выписка.ОперацияЦБ.ЦенныеБумаги.Количество()>0 Тогда
			ЦеннаяБумага = Выписка.ОперацияЦБ.ЦенныеБумаги[0].ЦеннаяБумага;
		Иначе
			ЦеннаяБумага = Выписка.ОперацияЦБ.ЦеннаяБумага;
		КонецЕсли;
		Количество = Выписка.ОперацияЦБ.ЦенныеБумаги.Итог("Количество");
		
	ИначеЕсли Найти(ИмяМакета, "Макет_2_11_") > 0 Тогда
		ЦеннаяБумага = Выписка.ОперацияЦБ.ЦеннаяБумагаБазовая;
		Количество = Выписка.ОперацияЦБ.ЦенныеБумаги.Итог("КоличествоБазовойЦБ");
		
	Иначе
		ЦеннаяБумага = Выписка.ОперацияЦБ.ЦеннаяБумага;
		Количество = Выписка.ОперацияЦБ.ЦенныеБумаги.Итог("Количество");
	КонецЕсли;
	
	Номинал = РегистрыСведений.НоминалЦБ.ПолучитьПоследнее(Выписка.ОперацияЦБ.Дата, Новый Структура("ЦеннаяБумага", ЦеннаяБумага));
	
	Если Найти(ИмяМакета, "Макет_2_2_") > 0 И Выписка.ОперацияЦБ.ЦенныеБумаги.Количество() > 0 Тогда
		РазделСчетаДепо		= Выписка.ОперацияЦБ.ЦенныеБумаги[0].РазделСчетаДепо;
		ИмяСекции			= "ОперацияПоСчетуЗаголовок";
		Область				= Макет.ПолучитьОбласть(ИмяСекции);
		ПараметрыОбласти	= Область.Параметры;
		ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыОбласти, ИмяМакета, ИмяСекции,
			мТекстыЗаголовков, Выписка.СчетДепо.ВидСчетаДепо);
		ПараметрыОбласти.НомерРазделаСчетаДЕПО = СокрЛП(РазделСчетаДепо.Код);
		ПараметрыОбласти.НаименованиеРазделаСчетаДЕПО = СокрЛП(РазделСчетаДепо.Наименование);	
		ПараметрыОбласти.МестоХранения = СокрЛП(Выписка.ОперацияЦБ.ЦенныеБумаги[0].СчетДепоМХ.Владелец.КодМестаХранения);
		ТабличныйДокумент.Вывести(Область);
	КонецЕсли;
	
	Если (СтрНайти(ИмяМакета, "Макет_2_11_Версия02") > 0 ИЛИ СтрНайти(ИмяМакета, "Макет_2_2_Версия03") > 0)
		И Выписка.СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ Тогда
		ИмяСекции = "ОперацияПоСчетуНФИ";
	Иначе
		ИмяСекции = "ОперацияПоСчету";
	КонецЕсли;
	Область				= Макет.ПолучитьОбласть(ИмяСекции);
	ПараметрыОбласти	= Область.Параметры;
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыОбласти, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, Выписка.СчетДепо.ВидСчетаДепо);
	// Параметры, общие для обеих секций
	ПараметрыОбласти.НаименованиеЦБ = ОбщегоНазначенияКлиентСервер.ПредставлениеЦБ(ЦеннаяБумага, ОтчетНаАнглийскомЯзыке);
	Попытка
		ПараметрыОбласти.ISIN = СокрЛП(ЦеннаяБумага.ISIN);
	Исключение
	КонецПопытки;
	ПараметрыОбласти.КоличествоЦБ = Количество;
	Если ИмяСекции = "ОперацияПоСчету" Тогда
		ПараметрыОбласти.НоминальнаяСтоимостьЦБ = Формат(?(Номинал.Сумма <> Неопределено, Номинал.Сумма, 0),
			"ЧДЦ=6; ЧРД=.") + " " + Справочники.Валюты.ПредставлениеВалюты(ЦеннаяБумага.ВалютаНоминала);
		ПараметрыОбласти.НомерГосРегистрации = СокрЛП(ЦеннаяБумага.НомерРегистрации);
		ПараметрыОбласти.ВидЦБ = СокрЛП(ЦеннаяБумага.ТипЦБ) + " " + НРег(ЦеннаяБумага.ВидЦБ);
		Если ОтчетНаАнглийскомЯзыке Тогда
			ПараметрыОбласти.ВидЦБ = ПараметрыОбласти.ВидЦБ + " / "
				+ ОбщегоНазначенияКлиентСервер.ПредставлениеТипаЦБ(ЦеннаяБумага, Истина);
		КонецЕсли;
	КонецЕсли;
	ТабличныйДокумент.Вывести(Область);
КонецПроцедуры

Процедура ВывестиБлокИнформацияОВыплатеДляМакетов2_7(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ВидОперацииПоВыписке,
	ДопИнформацияПоПоручениюВозврат)
	
	Если ЗначениеЗаполнено(Выписка.ДокументОснование)
		И ТипЗнч(Выписка.ДокументОснование) = Тип("ДокументСсылка.Поручение") Тогда
		Поручение = Выписка.ОперацияЦБ.ДокументОснование;
		ИспользоватьПрогрессивнуюШкалуНДФЛ = Документы.НачисленныйНалог.ИспользоватьРасчетНДФЛПоПрогрессивнойШкале(Поручение.Дата);
	Иначе
		Поручение = Документы.Поручение.ПустаяСсылка();
		ИспользоватьПрогрессивнуюШкалуНДФЛ = Ложь;
	Конецесли;
	
	ИмяСекции			= ?(ИспользоватьПрогрессивнуюШкалуНДФЛ, "ИнформацияОВыплатеПрогрессивныйНДФЛ", "ИнформацияОВыплате");
	Область				= Макет.ПолучитьОбласть(ИмяСекции);
	ПараметрыОбласти	= Область.Параметры;
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыОбласти, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, Выписка.СчетДепо.ВидСчетаДепо);
	
	ПараметрыОбласти.ДатаФиксации = Формат(Поручение.ДатаФиксации,"ДФ=dd.MM.yyyy");
	
	// Сразу вернем все строки по счету ДЕПО
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЦенныеБумаги.Количество) КАК Количество,
	|	СУММА(ЦенныеБумаги.Сумма) КАК ОбщаяСумма,
	|	СУММА(ЦенныеБумаги.СуммаНалога) КАК СуммаНалога,
	|	СУММА(ВЫБОР
	|			КОГДА ЦенныеБумаги.ЦеннаяБумага.ВидЦББанкаРоссии.ИностраннаяЦБ
	|				ТОГДА ЦенныеБумаги.СуммаКВыплатеПоИПД
	|			ИНАЧЕ ЦенныеБумаги.Сумма - ЦенныеБумаги.СуммаНалога
	|		КОНЕЦ) КАК СуммаКВыплате,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ЦенныеБумаги.Ссылка.ВыплатаНа1ЦБ) <> 0
	|			ТОГДА МАКСИМУМ(ЦенныеБумаги.Ссылка.ВыплатаНа1ЦБ)
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ЦенныеБумаги.Сумма) / СУММА(ЦенныеБумаги.Количество) КАК ЧИСЛО(21, 12))
	|	КОНЕЦ КАК РазмерВыплатыНа1,
	|	СУММА(ЦенныеБумаги.ДополнительныеУдержания) КАК ДополнительныеУдержания
	|ИЗ
	|	Документ.Поручение.ЦенныеБумагиСписываемые КАК ЦенныеБумаги
	|ГДЕ
	|	ЦенныеБумаги.Ссылка = &Поручение
	|	И ЦенныеБумаги.СчетДепо = &СчетДепо";
	Запрос.УстановитьПараметр("Поручение", Поручение);
	Запрос.УстановитьПараметр("СчетДепо", Выписка.СчетДепо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПараметрыОбласти.Заполнить(Выборка);
	КонецЕсли;
	ПараметрыОбласти.Валюта = Справочники.Валюты.ПредставлениеВалюты(Поручение.БанковскийСчет.ВалютаДенежныхСредств);
	
	Если ИспользоватьПрогрессивнуюШкалуНДФЛ Тогда
		Инфо = ИнформацияОВыплатеПрогрессивнаяШкалаНДФЛ(Поручение, Выписка.СчетДепо);
		ПараметрыОбласти.Заполнить(Инфо);
		ДопИнформацияПоПоручениюВозврат = Инфо.ДопИнформацияПоПоручению;
	КонецЕсли;	
	
	Если ВидОперацииПоВыписке = Справочники.ВидыОпераций.НачислениеДивидендов
		ИЛИ ВидОперацииПоВыписке = Справочники.ВидыОпераций.НачислениеДоходаПрочие Тогда
		ПараметрыОбласти.ЗначениеД1 = Поручение.КоэффициентД1;
		ПараметрыОбласти.ЗначениеД2 = Поручение.КоэффициентД2;
	КонецЕсли;
	
	Если СтрНайти(ИмяМакета, "Макет_2_7_Версия03") = 0 Тогда
		ПараметрыОбласти.Комментарий = Поручение.Комментарий;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Счета.Счет
	|ИЗ
	|	РегистрСведений.СчетаДляВыплатыДоходов.СрезПоследних(&Период, ФлагАктивности) КАК Счета
	|ГДЕ
	|	Счета.Счет.Владелец = &Владелец
	|	И Счета.Счет.ВалютаДенежныхСредств = &ВалютаДенежныхСредств";
	Запрос.УстановитьПараметр("Период", Выписка.Дата);
	Запрос.УстановитьПараметр("Владелец", Выписка.СчетДепо.Владелец);
	Запрос.УстановитьПараметр("ВалютаДенежныхСредств", Поручение.БанковскийСчет.ВалютаДенежныхСредств);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		ПараметрыОбласти.СчетИзЗаявления = "V";
		ПараметрыОбласти.ЕБС = "";
	Иначе
		ПараметрыОбласти.СчетИзЗаявления = "";
		ПараметрыОбласти.ЕБС = "V";
	КонецЕсли;
	ТабличныйДокумент.Вывести(Область);
КонецПроцедуры

Процедура ВывестиБлокиРеквизитовИОперацийДляМакетов2_8(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке)
	ОбластьРеквизитыСчетаДЕПО = Макет.ПолучитьОбласть("РеквизитыСчетаДЕПО");
	ОбластьОперацияПоСчету = Макет.ПолучитьОбласть("ОперацияПоСчету");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ПоручениеСписание.Ссылка.Инициатор) КАК МестоХранения,
	|	ВЫБОР
	|		КОГДА &ЭтоМакет_2_8_Версия03 ТОГДА ПРЕДСТАВЛЕНИЕ(ПоручениеСписание.СчетДепо.ТипСчетаДепо)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ПоручениеСписание.СчетДепо)
	|	КОНЕЦ КАК НаименованиеСчетаДЕПО,
	|	ПоручениеСписание.СчетДепо.Код КАК НомерСчетаДЕПО,
	|	ПоручениеСписание.РазделСчетаДепо.Наименование КАК НаименованиеРаздела,
	|	ПоручениеСписание.РазделСчетаДепо.Код КАК НомерРаздела,
	|	ПоручениеСписание.ЦеннаяБумага.Ссылка КАК ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА ПоручениеСписание.ЦеннаяБумага.ВалютаНоминала.Наименование = ""SUR""
	|			ТОГДА ""RUB""
	|		ИНАЧЕ ПоручениеСписание.ЦеннаяБумага.ВалютаНоминала.Наименование
	|	КОНЕЦ КАК ВалютаНоминалаНаименование,
	|	ПоручениеСписание.ЦеннаяБумага.НомерРегистрации КАК НомерГосРегистрации,
	|	ПоручениеСписание.ЦеннаяБумага.ISIN КАК ISIN,
	|	ПРЕДСТАВЛЕНИЕ(ПоручениеСписание.ЦеннаяБумага.ТипЦБ) КАК ТипЦБ,
	|	ПРЕДСТАВЛЕНИЕ(ПоручениеСписание.ЦеннаяБумага.ВидЦБ) КАК ВидЦБ,
	|	СУММА(ПоручениеСписание.Количество) КАК КоличествоЦБ,
	|	СУММА(ЕСТЬNULL(НоминалыЦБ.Сумма, 0)) КАК СуммаНоминала
	|ИЗ
	|	Документ.Поручение.Списание КАК ПоручениеСписание
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ.СрезПоследних(&ДатаДокументаОснования) КАК НоминалыЦБ
	|	ПО
	|		ПоручениеСписание.ЦеннаяБумага = НоминалыЦБ.ЦеннаяБумага
	|
	|ГДЕ
	|	ПоручениеСписание.СчетДепо = &СчетДепо
	|	И ПоручениеСписание.Ссылка = &ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоручениеСписание.Ссылка.Инициатор,
	|	ПоручениеСписание.СчетДепо,
	|	ПоручениеСписание.СчетДепо.Код,
	|	ПоручениеСписание.РазделСчетаДепо,
	|	ПоручениеСписание.РазделСчетаДепо.Код,
	|	ПоручениеСписание.ЦеннаяБумага.Ссылка,
	|	ПоручениеСписание.ЦеннаяБумага.ВалютаНоминала.Наименование,
	|	ПоручениеСписание.ЦеннаяБумага.НомерРегистрации,
	|	ПоручениеСписание.ЦеннаяБумага.ISIN,
	|	ПоручениеСписание.ЦеннаяБумага.ТипЦБ,
	|	ПоручениеСписание.ЦеннаяБумага.ВидЦБ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоручениеСписание.РазделСчетаДепо.Код,
	|	ПоручениеСписание.ЦеннаяБумага.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ПоручениеЗачисление.Ссылка.Инициатор) КАК МестоХранения,
	|	ВЫБОР
	|		КОГДА &ЭтоМакет_2_8_Версия03 ТОГДА ПРЕДСТАВЛЕНИЕ(ПоручениеЗачисление.СчетДепо.ТипСчетаДепо)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ПоручениеЗачисление.СчетДепо)
	|	КОНЕЦ КАК НаименованиеСчетаДЕПО,
	|	ПоручениеЗачисление.СчетДепо.Код КАК НомерСчетаДЕПО,
	|	ПоручениеЗачисление.РазделСчетаДепо.Наименование КАК НаименованиеРаздела,
	|	ПоручениеЗачисление.РазделСчетаДепо.Код КАК НомерРаздела,
	|	ПоручениеЗачисление.ЦеннаяБумага.Ссылка КАК ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА ПоручениеЗачисление.ЦеннаяБумага.ВалютаНоминала.Наименование = ""SUR""
	|			ТОГДА ""RUB""
	|		ИНАЧЕ ПоручениеЗачисление.ЦеннаяБумага.ВалютаНоминала.Наименование
	|	КОНЕЦ КАК ВалютаНоминалаНаименование,
	|	ПоручениеЗачисление.ЦеннаяБумага.НомерРегистрации КАК НомерГосРегистрации,
	|	ПоручениеЗачисление.ЦеннаяБумага.ISIN КАК ISIN,
	|	ПРЕДСТАВЛЕНИЕ(ПоручениеЗачисление.ЦеннаяБумага.ТипЦБ) КАК ТипЦБ,
	|	ПРЕДСТАВЛЕНИЕ(ПоручениеЗачисление.ЦеннаяБумага.ВидЦБ) КАК ВидЦБ,
	|	СУММА(ПоручениеЗачисление.Количество) КАК КоличествоЦБ,
	|	СУММА(ЕСТЬNULL(НоминалыЦБ.Сумма, 0)) КАК СуммаНоминала
	|ИЗ
	|	Документ.Поручение.Зачисление КАК ПоручениеЗачисление
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ.СрезПоследних(&ДатаДокументаОснования) КАК НоминалыЦБ
	|	ПО
	|		ПоручениеЗачисление.ЦеннаяБумага = НоминалыЦБ.ЦеннаяБумага
	|
	|ГДЕ
	|	ПоручениеЗачисление.СчетДепо = &СчетДепо
	|	И ПоручениеЗачисление.Ссылка = &ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоручениеЗачисление.Ссылка.Инициатор,
	|	ПоручениеЗачисление.СчетДепо,
	|	ПоручениеЗачисление.СчетДепо.Код,
	|	ПоручениеЗачисление.РазделСчетаДепо,
	|	ПоручениеЗачисление.РазделСчетаДепо.Код,
	|	ПоручениеЗачисление.ЦеннаяБумага.Ссылка,
	|	ПоручениеЗачисление.ЦеннаяБумага.ВалютаНоминала.Наименование,
	|	ПоручениеЗачисление.ЦеннаяБумага.НомерРегистрации,
	|	ПоручениеЗачисление.ЦеннаяБумага.ISIN,
	|	ПоручениеЗачисление.ЦеннаяБумага.ТипЦБ,
	|	ПоручениеЗачисление.ЦеннаяБумага.ВидЦБ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоручениеЗачисление.РазделСчетаДепо.Код,
	|	ПоручениеЗачисление.ЦеннаяБумага.Наименование
	|";
	Запрос.УстановитьПараметр("СчетДепо", Выписка.СчетДепо);
	Запрос.УстановитьПараметр("ДокументОснование",		Выписка.ДокументОснование);
	Запрос.УстановитьПараметр("ДатаДокументаОснования",	Выписка.ДокументОснование.Дата);
	Запрос.УстановитьПараметр("ЭтоМакет_2_8_Версия03",	(СтрНайти(ИмяМакета, "Макет_2_8_Версия03") > 0));
	
	РезПакет		= Запрос.ВыполнитьПакет();
	СписаниеРез		= РезПакет[0].Выбрать();
	ЗачислениеРез	= РезПакет[1].Выбрать();
	
	// Вывод блоков списания 
	Пока СписаниеРез.Следующий() Цикл
		ОбластьРеквизитыСчетаДЕПО.Параметры.Заполнить(СписаниеРез);
		ОбластьРеквизитыСчетаДЕПО.Параметры.СписаниеЗачисление = "списания";
		ТабличныйДокумент.Вывести(ОбластьРеквизитыСчетаДЕПО);
		
		ОбластьОперацияПоСчету.Параметры.Заполнить(СписаниеРез);
		ОбластьОперацияПоСчету.Параметры.СписаниеЗачисление = "списана";
		ОбластьОперацияПоСчету.Параметры.ВидЦБ = СписаниеРез.ТипЦБ + " " + НРег(СписаниеРез.ВидЦБ);
		ОбластьОперацияПоСчету.Параметры.НоминальнаяСтоимостьЦБ = Формат(СписаниеРез.СуммаНоминала, "ЧДЦ=6; ЧРД=.; ЧН=") + " "
			+ СписаниеРез.ВалютаНоминалаНаименование;
		ОбластьОперацияПоСчету.Параметры.НаименованиеЦБ =
			ОбщегоНазначенияКлиентСервер.ПредставлениеЦБ(СписаниеРез.ЦеннаяБумага, ОтчетНаАнглийскомЯзыке);
		ТабличныйДокумент.Вывести(ОбластьОперацияПоСчету);	
	КонецЦикла;
	
	// Вывод блоков зачисления 
	Пока ЗачислениеРез.Следующий() Цикл
		ОбластьРеквизитыСчетаДЕПО.Параметры.Заполнить(ЗачислениеРез);
		ОбластьРеквизитыСчетаДЕПО.Параметры.СписаниеЗачисление = "зачисления";
		ТабличныйДокумент.Вывести(ОбластьРеквизитыСчетаДЕПО);
		
		ОбластьОперацияПоСчету.Параметры.Заполнить(ЗачислениеРез);
		ОбластьОперацияПоСчету.Параметры.СписаниеЗачисление = "зачислена";
		ОбластьОперацияПоСчету.Параметры.ВидЦБ = ЗачислениеРез.ТипЦБ + " " + НРег(ЗачислениеРез.ВидЦБ);
		ОбластьОперацияПоСчету.Параметры.НоминальнаяСтоимостьЦБ = Формат(ЗачислениеРез.СуммаНоминала, "ЧДЦ=6; ЧРД=.; ЧН=") + " "
			+ ЗачислениеРез.ВалютаНоминалаНаименование;
		ОбластьОперацияПоСчету.Параметры.НаименованиеЦБ =
			ОбщегоНазначенияКлиентСервер.ПредставлениеЦБ(ЗачислениеРез.ЦеннаяБумага, ОтчетНаАнглийскомЯзыке);
		ТабличныйДокумент.Вывести(ОбластьОперацияПоСчету);	
	КонецЦикла;
КонецПроцедуры

Процедура ВывестиБлокКомментарийДляМакетов2_10(Выписка, Макет, ТабличныйДокумент)
	Если ЗначениеЗаполнено(Выписка.ДокументОснование)
		И ТипЗнч(Выписка.ДокументОснование) = Тип("ДокументСсылка.Поручение") Тогда
		Поручение = Выписка.ОперацияЦБ.ДокументОснование;
	Иначе
		Поручение = Документы.Поручение.ПустаяСсылка();
	Конецесли;
	
	ОбластьКомментарий = Макет.ПолучитьОбласть("Комментарий");
	ОбластьКомментарий.Параметры.Комментарий = Поручение.Комментарий;
	ТабличныйДокумент.Вывести(ОбластьКомментарий);	
КонецПроцедуры

Процедура ВывестиБлокИнформацияОВыплатеДляМакетов2_11(Выписка, Макет, ИмяМакета, ТабличныйДокумент)
	Если ЗначениеЗаполнено(Выписка.ДокументОснование)
		И ТипЗнч(Выписка.ДокументОснование) = Тип("ДокументСсылка.Поручение") Тогда
		Поручение = Выписка.ОперацияЦБ.ДокументОснование;
	Иначе
		Поручение = Документы.Поручение.ПустаяСсылка();
	Конецесли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЦенныеБумаги.ЦеннаяБумага.Наименование КАК НаименованиеЦБВыплаты,
	|	ЦенныеБумаги.ЦеннаяБумага.ТипЦБ КАК ТипЦБ,
	|	ЦенныеБумаги.ЦеннаяБумага.ВидЦБ КАК ВидЦБ,
	|	ЦенныеБумаги.ЦеннаяБумага.НомерРегистрации КАК НомерГосРегистрацииВыплаты,
	|	ЦенныеБумаги.ЦеннаяБумага.ISIN КАК ISINВыплаты,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ЦеннаяБумага.ВалютаНоминала.Наименование = ""SUR""
	|			ТОГДА ""RUB""
	|		ИНАЧЕ ЦенныеБумаги.ЦеннаяБумага.ВалютаНоминала.Наименование
	|	КОНЕЦ КАК ВалютаНоминала,
	|	ЦенныеБумаги.Ссылка.ДатаФиксации КАК ДатаФиксации,
	|	ЦенныеБумаги.Ссылка.ВыплатаНа1ЦБ КАК РазмерВыплатыНа1ЦБ,
	|	СУММА(ЦенныеБумаги.Количество) КАК Количество
	|ИЗ
	|	Документ.ГлобальнаяОперация.ЦенныеБумаги КАК ЦенныеБумаги
	|ГДЕ
	|	ЦенныеБумаги.Ссылка = &ГОперация
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумаги.Ссылка,
	|	ЦенныеБумаги.ЦеннаяБумага
	|";
	Запрос.УстановитьПараметр("ГОперация", Выписка.ОперацияЦБ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КоличествоЦБВыплаты	= Выборка.Количество;
		ЦеннаяБумагаВыплаты	= Выборка.ЦеннаяБумага;
	Иначе
		КоличествоЦБВыплаты	= 0;
		ЦеннаяБумагаВыплаты	= "";
	КонецЕсли;
	НоминалВыплаты = РегистрыСведений.НоминалЦБ.ПолучитьПоследнее(Выписка.ОперацияЦБ.Дата, Новый Структура(
		"ЦеннаяБумага", ЦеннаяБумагаВыплаты));
		
	ИмяСекции			= "ИнформацияОВыплате";
	Область				= Макет.ПолучитьОбласть(ИмяСекции);
	ПараметрыОбласти	= Область.Параметры;
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыОбласти, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, Выписка.СчетДепо.ВидСчетаДепо);
		
	ПараметрыОбласти.Заполнить(Выборка);
	ПараметрыОбласти.ВидЦБВыплаты = СокрЛП(Выборка.ТипЦБ) + " " + НРег(Выборка.ВидЦБ);
	ПараметрыОбласти.НоминальнаяСтоимостьЦБВыплаты = Формат(?(НоминалВыплаты.Сумма <> Неопределено,
		НоминалВыплаты.Сумма, 0),"ЧДЦ=6; ЧРД=.") + " " + Выборка.ВалютаНоминала;
	ПараметрыОбласти.КоличествоЦБВыплаты = КоличествоЦБВыплаты;
	
	ТабличныйДокумент.Вывести(Область);
КонецПроцедуры

Функция ИмяМакетаОтчета(ВидОперацииПоВыписке, ОтчетНаАнглийскомЯзыке)
	ИмяМакета = "";
	
	ОперацииМакетов_2_7 = Новый СписокЗначений;
	ОперацииМакетов_2_7.Добавить(Справочники.ВидыОпераций.НачислениеДивидендов);
	ОперацииМакетов_2_7.Добавить(Справочники.ВидыОпераций.НачислениеДоходаПрочие);
	ОперацииМакетов_2_7.Добавить(Справочники.ВидыОпераций.ПогашениеНКД);
	ОперацииМакетов_2_7.Добавить(Справочники.ВидыОпераций.ПогашениеЦБПолное);
	ОперацииМакетов_2_7.Добавить(Справочники.ВидыОпераций.ПогашениеЦБЧастичное);
	ОперацииМакетов_2_7.Добавить(Справочники.ВидыОпераций.Выкуп);
	
	ОперацииПеремещения = Новый СписокЗначений;
	ОперацииПеремещения.Добавить(Справочники.ВидыОпераций.Перемещение);
	ОперацииПеремещения.Добавить(Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо);
	
	Если ВидОперацииПоВыписке = Справочники.ВидыОпераций.ОткрытиеСчетаДепо
		ИЛИ ВидОперацииПоВыписке = Справочники.ВидыОпераций.ЗакрытиеСчетаДепо
		ИЛИ ВидОперацииПоВыписке = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо
		ИЛИ ВидОперацииПоВыписке = Справочники.ВидыОпераций.ЗакрытиеРазделаСчетаДепо Тогда
		
		ОтчетНаАнглийскомЯзыке	= Истина;
		ИмяМакета = "Макет_2_1_Версия04_2022";
		
	ИначеЕсли ВидОперацииПоВыписке = Справочники.ВидыОпераций.ОтменаПоручения Тогда
		ИмяМакета = "Макет_2_6_Версия03_2022";
	ИначеЕсли ОперацииМакетов_2_7.НайтиПоЗначению(ВидОперацииПоВыписке) <> Неопределено Тогда
		ИмяМакета = "Макет_2_7_Версия03_2022";
	ИначеЕсли ВидОперацииПоВыписке = Справочники.ВидыОпераций.Конвертация Тогда
		ИмяМакета = "Макет_2_8_Версия03_2022";
	ИначеЕсли ОперацииПеремещения.НайтиПоЗначению(ВидОперацииПоВыписке) <> Неопределено Тогда
		ИмяМакета = "Макет_2_9_Версия03_2022";
	ИначеЕсли ВидОперацииПоВыписке = Справочники.ВидыОпераций.ВидОперацииИзменениеАнкетныхДанных() Тогда
		ИмяМакета = "Макет_2_10_Версия02_2022";
	ИначеЕсли ВидОперацииПоВыписке = Справочники.ВидыОпераций.НачислениеДоходовЦБ Тогда
		ИмяМакета = "Макет_2_11_Версия02_2022";
	ИначеЕсли (ВидОперацииПоВыписке = Справочники.ВидыОпераций.ПередачаВЗалог
				ИЛИ ВидОперацииПоВыписке = Справочники.ВидыОпераций.ВозвратИзЗалога) Тогда
		ИмяМакета = "Макет_2_12_Версия01_2022";
	Иначе
		ИмяМакета = "Макет_2_2_Версия03_2022";
	КонецЕсли;
	
	Возврат ИмяМакета;
КонецФункции

Функция ВидОперацииПоВыписке(Выписка, Операция)
	ВидОперацииПоВыписке = Справочники.ВидыОпераций.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Операция) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("ВидОперацииД", Операция.Метаданные()) Тогда
			ВидОперацииПоВыписке = Операция.ВидОперацииД;
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитДокумента("ДокументОснование", Операция.Метаданные())
			И ЗначениеЗаполнено(Операция.ДокументОснование) Тогда
			Если ТипЗнч(Операция.ДокументОснование) = Тип("ДокументСсылка.СлужебноеПоручение") Тогда
				ВидОперацииПоВыписке = Операция.ДокументОснование.ВидСлужебногоПоручения;
			Иначе
				ВидОперацииПоВыписке = Операция.ДокументОснование.ВидОперацииД;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Выписка.ВидОтчета) Тогда
		ВидОперацииПоВыписке = Выписка.ВидОтчета;
	КонецЕсли;
	
	Возврат ВидОперацииПоВыписке;
КонецФункции

Функция НаименованиеВидаОперации(ВидОперацииПоВыписке, ВидСчетаДепо, ИмяМакета)
	Результат = "";
	Если (СтрНайти(ИмяМакета, "Макет_2_2_Версия03") > 0 ИЛИ СтрНайти(ИмяМакета, "Макет_2_9_Версия03") > 0)
		И ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ Тогда
		
		Результат = ?(ЗначениеЗаполнено(ВидОперацииПоВыписке.НаименованиеОперацииИФИ),
			СокрЛП(ВидОперацииПоВыписке.НаименованиеОперацииИФИ), СокрЛП(ВидОперацииПоВыписке.Наименование));
	Иначе
		Результат = СокрЛП(ВидОперацииПоВыписке.Наименование);
	КонецЕсли;
	Возврат Результат;
КонецФункции
		
Функция ВидОперации(Операция, Выписка, ВидОперацииПоВыписке, ОтчетНаАнглийскомЯзыке, ИмяМакета)
	ВидОперации	= Справочники.ВидыОпераций.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Операция) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("ВидОперацииД", Операция.Метаданные()) Тогда
			ВидОперации	= НаименованиеВидаОперации(ВидОперацииПоВыписке, Выписка.СчетДепо.ВидСчетаДепо, ИмяМакета)
				+ ?(ОтчетНаАнглийскомЯзыке И ЗначениеЗаполнено(Операция.ВидОперацииД.АнглийскоеНаименование),
					" / " + СокрЛП(ВидОперацииПоВыписке.АнглийскоеНаименование), "");
		Иначе
			ВидОперации	= НаименованиеВидаОперации(ВидОперацииПоВыписке, Выписка.СчетДепо.ВидСчетаДепо, ИмяМакета);
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Выписка.ВидОтчета) Тогда
		Если ОтчетНаАнглийскомЯзыке Тогда
			Если ВидОперацииПоВыписке = Перечисления.ВидыОтчетов.Выписка Тогда
				ВидОперации = СокрЛП(ВидОперацииПоВыписке) + " / Statement";
			ИначеЕсли ВидОперацииПоВыписке = Перечисления.ВидыОтчетов.ВыпискаОСостоянииСчетаДЕПО Тогда
				ВидОперации = СокрЛП(ВидОперацииПоВыписке) + " / Statement of safekeeping account";
			ИначеЕсли ВидОперацииПоВыписке = Перечисления.ВидыОтчетов.Отчет Тогда
				ВидОперации = СокрЛП(ВидОперацииПоВыписке) + " / Report";
			ИначеЕсли ВидОперацииПоВыписке = Перечисления.ВидыОтчетов.Уведомление Тогда
				ВидОперации = СокрЛП(ВидОперацииПоВыписке) + " / Notification";
			ИначеЕсли ВидОперацииПоВыписке = Перечисления.ВидыОтчетов.Другой Тогда
				ВидОперации = СокрЛП(ВидОперацииПоВыписке) + " / Other";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВидОперации;
КонецФункции

Функция СформироватьТабличныйДокументВыписки(Выписка)
	ТабличныйДокумент		= Новый ТабличныйДокумент;
	Операция				= Выписка.ОперацияЦБ;
	ВидОперацииПоВыписке	= ВидОперацииПоВыписке(Выписка, Операция);	
	ОтчетНаАнглийскомЯзыке	= (ТипЗнч(Выписка.ВладелецСчета) = Тип("СправочникСсылка.Контрагенты")
								И Выписка.ВладелецСчета.ОтчетыНаАнглийскомЯзыке);
	
	ИмяМакета	= ИмяМакетаОтчета(ВидОперацииПоВыписке, ОтчетНаАнглийскомЯзыке);
	Макет		= ПолучитьМакет(ИмяМакета);
	ВывестиЗаголовок(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке, ВидОперацииПоВыписке);
	
	Если Найти(ИмяМакета, "Макет_2_8_") > 0 Тогда
		ВывестиБлокиРеквизитовИОперацийДляМакетов2_8(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке);
		
	ИначеЕсли Найти(ИмяМакета, "Макет_2_10_") > 0 Тогда
		ВывестиБлокКомментарийДляМакетов2_10(Выписка, Макет, ТабличныйДокумент);
		
	ИначеЕсли Найти(ИмяМакета, "Макет_2_9_") > 0
				ИЛИ Найти(ИмяМакета, "Макет_2_12_") > 0 Тогда		
		
	Иначе
		ВывестиРеквизитыСчетаДЕПО(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ВидОперацииПоВыписке,
			ДатаВыписки, ОтчетНаАнглийскомЯзыке);
			
		Если ВидОперацииПоВыписке = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо 
			Или ВидОперацииПоВыписке = Справочники.ВидыОпераций.ЗакрытиеРазделаСчетаДепо Тогда	
			ВывестиРеквизитыРазделаСчетаДепо(Выписка, Макет, ИмяМакета, ТабличныйДокумент);
		КонецЕсли;
	КонецЕсли;
	
	Если ( ТипЗнч(Выписка.ОперацияЦБ) = Тип("ДокументСсылка.ОперацииЦБ")
		   ИЛИ ТипЗнч(Выписка.ОперацияЦБ) = Тип("ДокументСсылка.ГлобальнаяОперация")
		   ИЛИ Найти(ИмяМакета, "Макет_2_7_") > 0
		   ИЛИ Найти(ИмяМакета, "Макет_2_11_") > 0
		 )
		 И Найти(ИмяМакета, "Макет_2_8_") = 0 Тогда
		Если ТипЗнч(Выписка.ОперацияЦБ) = Тип("ДокументСсылка.ГлобальнаяОперация") Тогда
			ВывестиГлобальнуюОперацию(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке, ВидОперацииПоВыписке);
		ИначеЕсли ТипЗнч(Выписка.ОперацияЦБ) = Тип("ДокументСсылка.ОперацииЦБ") Тогда
			ВывестиОперациюЦБ(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке, ВидОперацииПоВыписке);
		КонецЕсли;
		
	ИначеЕсли Выписка.ВидОтчета = Перечисления.ВидыОтчетов.ВыпискаОСостоянииСчетаДЕПО Тогда
		ВывестиСостояниеСчетаДепо(Выписка, Макет, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке);
	КонецЕсли;
	
	ДопИнформацияПоПоручению = "";
	Если Найти(ИмяМакета, "Макет_2_7_") > 0 Тогда
		ВывестиБлокИнформацияОВыплатеДляМакетов2_7(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ВидОперацииПоВыписке, ДопИнформацияПоПоручению);
	
	ИначеЕсли Найти(ИмяМакета, "Макет_2_11_") > 0 Тогда
		ВывестиБлокИнформацияОВыплатеДляМакетов2_11(Выписка, Макет, ИмяМакета, ТабличныйДокумент);
	КонецЕсли; 
	
	ВывестиПодвал(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ОтчетНаАнглийскомЯзыке, ВидОперацииПоВыписке, ДопИнформацияПоПоручению);
	
	Возврат ТабличныйДокумент;
КонецФункции

Процедура УстановитьТипСчетаДепо(Тип, ИмяМакета, ПараметрыОбласти)
	
	ДатаВводаИНД = Константы.ДатаВводаИНД.Получить();
	
	Если Тип = Перечисления.ТипыСчетовДепо.Владельца Тогда
		Если СтрНайти(ИмяМакета, "Макет_2_1_Версия04") > 0 Тогда
			ПараметрыОбласти.Основной = "V";
		КонецЕсли;
		ПараметрыОбласти.Владельца = "V";
		
	ИначеЕсли Тип = Перечисления.ТипыСчетовДепо.ВладельцаТорговый Тогда
		ПараметрыОбласти.Владельца					= "V";
		ПараметрыОбласти.Торговый					= "V";
		ПараметрыОбласти.НаименованиеТорговогоСчета	= "Владельца торговый"
		
	ИначеЕсли Тип = Перечисления.ТипыСчетовДепо.ДоверительногоУправляющего Тогда
		Если СтрНайти(ИмяМакета, "Макет_2_1_Версия04") > 0 Тогда
			ПараметрыОбласти.Основной = "V";
		КонецЕсли;
		ПараметрыОбласти.ДУ = "V";
		
	ИначеЕсли Тип = Перечисления.ТипыСчетовДепо.Залогодержателя Тогда
		ПараметрыОбласти.Иной					= "V";
		ПараметрыОбласти.НаименованиеИногоСчета	= "Залогодержателя";
		
	ИначеЕсли Тип = Перечисления.ТипыСчетовДепо.НоминальногоДержателя Тогда
		
		Если СтрНайти(ИмяМакета, "Макет_2_1_Версия04") > 0 Тогда
			ПараметрыОбласти.Основной	= "V";
			ПараметрыОбласти.НомДержатель = "V";
		КонецЕсли;
		
	ИначеЕсли Тип = Перечисления.ТипыСчетовДепо.ИностранногоНоминальногоДержателя Тогда
		Если СтрНайти(ИмяМакета, "Макет_2_1_Версия04") > 0 Тогда
			ПараметрыОбласти.Основной	= "V";
			Если ДатаВыписки > ДатаВводаИНД Тогда 
				ПараметрыОбласти.ИНД		= "V";
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Тип = Перечисления.ТипыСчетовДепо.ИностранногоНоминальногоДержателяТорговый Тогда
		Если СтрНайти(ИмяМакета, "Макет_2_1_Версия04") > 0 Тогда
			ПараметрыОбласти.Торговый	= "V";
			Если ДатаВыписки > ДатаВводаИНД Тогда 
				ПараметрыОбласти.ИНД		= "V";
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Тип = Перечисления.ТипыСчетовДепо.ИностранногоУполномоченногоДержателя Тогда
		ПараметрыОбласти.ИУД = "V";
		
	ИначеЕсли Тип = Перечисления.ТипыСчетовДепо.ИностранногоУполномоченногоДержателяТорговый Тогда
		ПараметрыОбласти.ИУД		= "V";
		ПараметрыОбласти.Торговый	= "V";
		
	ИначеЕсли Тип = Перечисления.ТипыСчетовДепо.ДоверительногоУправляющегоТорговый Тогда
		ПараметрыОбласти.ДУ							= "V";
		ПараметрыОбласти.Торговый					= "V";
		ПараметрыОбласти.НаименованиеТорговогоСчета	= "Доверительного управляющего торговый"
		
	Иначе
		ПараметрыОбласти.Иной						= "V";
		ПараметрыОбласти.НаименованиеИногоСчета		= "Неустановленных лиц";
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьМассивВыписок()
	Если ЗначениеЗаполнено(Основание) Тогда
		ДатаВыписки		= Основание.Дата;
		МассивОпераций	= Новый Массив;
		МассивОпераций.Добавить(Основание);
		Возврат МассивОпераций;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОперацияЦБ) Тогда
		МассивВыписок = ПолучитьМассивВыписокПоОперации(ОперацияЦБ);
	Иначе 
		МассивВыписок = ПолучитьМассивВыписокПоТипуИДате(ТипОперации, ДатаВыписки);
	КонецЕсли;
	МассивВыписок = ОтборВыписокПоВидуОпераций(МассивВыписок);
	Возврат МассивВыписок;
КонецФункции

Функция ОтборВыписокПоВидуОпераций(МассивВыписок)
	Отбор = Новый Массив;
	
	Для Каждого Выписка Из МассивВыписок Цикл
		Вид = ВидОперацииПоВыписке(Выписка, Выписка.ОперацияЦБ);
		Если ТипЗнч(Вид) = Тип("СправочникСсылка.ВидыОпераций") Тогда
			Отбор.Добавить(Выписка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Отбор;
КонецФункции

Функция ПолучитьМассивВыписокПоОперации(ОперацияЦБ)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Выписка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Выписка КАК Выписка
	|ГДЕ
	|	Выписка.ОперацияЦБ = &ОперацияЦБ
	|	И Выписка.Проведен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Выписка.Дата,
	|	Выписка.Номер");
	Запрос.УстановитьПараметр("ОперацияЦБ", ОперацияЦБ);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

Функция ПолучитьМассивВыписокПоТипуИДате(ТипОперации, ДатаВыписки)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Выписка.Ссылка КАК Ссылка,
	|	Выписка.Дата КАК Дата,
	|	Выписка.Номер КАК Номер
	|ИЗ
	|	Документ.Выписка КАК Выписка
	|ГДЕ
	|	Выписка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Выписка.Проведен
	|	И НЕ Выписка.ДокументОснование ССЫЛКА Документ.иц_СводноеПоручение
	|	И Выписка.ОперацияЦБ <> ЗНАЧЕНИЕ(Документ.ОперацииЦБ.ПустаяСсылка)
	|	И НЕ Выписка.ОперацияЦБ = НЕОПРЕДЕЛЕНО
	|	И &УсловиеПоТипуОперацииЦБ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Выписка.Ссылка,
	|	Выписка.Дата,
	|	Выписка.Номер
	|ИЗ
	|	Документ.Выписка КАК Выписка
	|ГДЕ
	|	Выписка.Проведен
	|	И Выписка.ДокументОснование.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Выписка.ДокументОснование ССЫЛКА Документ.иц_СводноеПоручение
	|	И &УсловиеПоТипуОперацииЦБ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ДатаВыписки));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДатаВыписки));
	
	Если ЗначениеЗаполнено(ТипОперации) Тогда
		УсловиеПоТипуОперацииЦБ = "Выписка.ОперацияЦБ ССЫЛКА Документ." + ТипОперации;
	Иначе
		УсловиеПоТипуОперацииЦБ = "ИСТИНА";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоТипуОперацииЦБ", УсловиеПоТипуОперацииЦБ);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

Функция ЭтоПереводСписание(Выписка)
	Возврат Выписка.ОперацияЦБ.Депонент = Выписка.ВладелецСчета;
КонецФункции

Функция ЭтоПереводЗачисление(Выписка)
	Возврат Выписка.ОперацияЦБ.Получатель = Выписка.ВладелецСчета;
КонецФункции

Процедура УстановитьИнформациюОДепозитарии(ПараметрыОбластиЗаголовка, ИмяМакета, ОтчетНаАнглийскомЯзыке, ДатаВыписки, ВидСчетаДепо)
	Инфо = ФормированиеПечатныхФорм.ИнформацияОДепозитарии(ДатаВыписки, ВидСчетаДепо)
			+ Символы.ПС + Символы.ПС + ФормированиеПечатныхФорм.ИнформацияОДепозитарииНаАнглийском(ДатаВыписки, ВидСчетаДепо);
	ПараметрыОбластиЗаголовка.ИнформацияОДепозитарии = Инфо;
КонецПроцедуры

Процедура УстановитьТипОперации(ПараметрыОбласти, Выписка, ВидОперацииПоВыписке, ИмяМакета, ДатаВыписки, ОтчетНаАнглийскомЯзыке)
	Если Найти(ИмяМакета, "Макет_2_1_") > 0 Тогда
		ПараметрыОбласти.ТипОперации1 = ?(ВидОперацииПоВыписке = Справочники.ВидыОпераций.ОткрытиеСчетаДепо, "V", "");
		ПараметрыОбласти.ТипОперации2 = ?(ВидОперацииПоВыписке = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо, "V", "");
		Если ДатаВыписки >= '2016.09.19' Тогда
			ПараметрыОбласти.ТипОперации3 = ?(ВидОперацииПоВыписке = Справочники.ВидыОпераций.ЗакрытиеСчетаДепо, "V", "");
			ПараметрыОбласти.ТипОперации4 = ?(ВидОперацииПоВыписке = Справочники.ВидыОпераций.ЗакрытиеРазделаСчетаДепо, "V", "");
		КонецЕсли;
	Иначе	
		ПараметрыОбласти.ТипОперации = ВидОперации(Выписка.ОперацияЦБ, Выписка, ВидОперацииПоВыписке,
			ОтчетНаАнглийскомЯзыке, ИмяМакета);
	КонецЕсли;

	Если ВидОперацииПоВыписке = Справочники.ВидыОпераций.Перевод Тогда
		Если ЭтоПереводСписание(Выписка) Тогда
			НаправлениеПеревода = ?(ОтчетНаАнглийскомЯзыке, " (списание/withdrawal)", " (списание)");
			
		ИначеЕсли ЭтоПереводЗачисление(Выписка) Тогда
			НаправлениеПеревода = ?(ОтчетНаАнглийскомЯзыке, " (зачисление/entry)", " (зачисление)");
			
		Иначе
			НаправлениеПеревода = " Направление перевода не определено!";
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Невозможно определить направление перевода." + Символы.ПС
				+ "Владелец счета в " + Выписка + " не равен депоненту или получателю из " + Выписка.ОперацияЦБ;
			Сообщение.Сообщить();
		КонецЕсли;
		ПараметрыОбласти.ТипОперации = ПараметрыОбласти.ТипОперации + НаправлениеПеревода;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьИнициатораОперации(ПараметрыОбласти, ИмяМакета, Выписка, ОтчетНаАнглийскомЯзыке)
	Если Найти(ИмяМакета, "Макет_2_7_") = 0
			И Найти(ИмяМакета, "Макет_2_11_") = 0 Тогда
		Если ТипЗнч(Выписка.ДокументОснование) = Тип("ДокументСсылка.СлужебноеПоручение") Тогда
			ПараметрыОбласти.ИнициаторОперации = ОбщегоНазначенияКлиентСервер.НаименованиеОрганизации(
				Выписка.ДокументОснование.Организация, ОтчетНаАнглийскомЯзыке);
			
		ИначеЕсли ТипЗнч(Выписка.ДокументОснование.Инициатор) = Тип("СправочникСсылка.Контрагенты") Тогда
			ПараметрыОбласти.ИнициаторОперации = ОбщегоНазначенияКлиентСервер.НаименованиеКлиента(
				Выписка.ДокументОснование.Инициатор, ОтчетНаАнглийскомЯзыке);
			
		ИначеЕсли ТипЗнч(Выписка.ДокументОснование.Инициатор) = Тип("СправочникСсылка.МестаХранения") Тогда
			ПараметрыОбласти.ИнициаторОперации = Выписка.ДокументОснование.Инициатор.НаименованиеПолное;
			
		ИначеЕсли ТипЗнч(Выписка.ДокументОснование.Инициатор) = Тип("СправочникСсылка.Организации") Тогда
			ПараметрыОбласти.ИнициаторОперации = ОбщегоНазначенияКлиентСервер.НаименованиеОрганизации(
				Выписка.ДокументОснование.Инициатор, ОтчетНаАнглийскомЯзыке);
		Иначе
			ПараметрыОбласти.ИнициаторОперации = СокрЛП(Выписка.ДокументОснование.Инициатор);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьИнформациюОДепоненте(ПараметрыОбласти, ВидОперацииПоВыписке, ИмяМакета, Выписка, ДатаВыписки,
	ОтчетНаАнглийскомЯзыке)
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ВладелецСчета", Выписка.Метаданные()) Тогда
		Если ЗначениеЗаполнено(Выписка.ВладелецСчета) И ТипЗнч(Выписка.ВладелецСчета) = Тип("СправочникСсылка.Контрагенты") Тогда
			ПараметрыОбласти.НаименованиеДепонента = ОбщегоНазначенияКлиентСервер.НаименованиеЮрФизЛицаКлиента(
				Выписка.ВладелецСчета, ДатаВыписки, ОтчетНаАнглийскомЯзыке);
			ПараметрыОбласти.ДокументыДепонента = ОбщегоНазначенияКлиентСервер.ДокументКлиента(
				Выписка.ВладелецСчета, ДатаВыписки);
		Иначе
			ПараметрыОбласти.НаименованиеДепонента = "";
			ПараметрыОбласти.ДокументыДепонента = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ВывестиРеквизитыРазделаСчетаДепо(Выписка, Макет, ИмяМакета, ТабличныйДокумент)
	ИмяСекции = "РеквизитыРазделаСчетаДепо";
	ОбластьРеквизитыРазделаСчета= Макет.ПолучитьОбласть(ИмяСекции);
	ПараметрыОбласти			= ОбластьРеквизитыРазделаСчета.Параметры;
	
	Если ЗначениеЗаполнено(Выписка.ОперацияЦБ) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("РазделСчетаДЕПО", Выписка.ОперацияЦБ.Метаданные()) Тогда
			Если Не ТипЗнч(Выписка.ОперацияЦБ.РазделСчетаДЕПО) = Тип("Строка") Тогда
				ПараметрыОбласти.НомерРазделаСчетаДЕПО			= СокрЛП(Выписка.ОперацияЦБ.РазделСчетаДЕПО.Код);
				ПараметрыОбласти.НаименованиеРазделаСчетаДЕПО	= СокрЛП(Выписка.ОперацияЦБ.РазделСчетаДЕПО.Наименование);
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыОбласти, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, Выписка.СчетДепо.ВидСчетаДепо);
	ТабличныйДокумент.Вывести(ОбластьРеквизитыРазделаСчета);
КонецПроцедуры

Процедура ВывестиРеквизитыСчетаДЕПО(Выписка, Макет, ИмяМакета, ТабличныйДокумент, ВидОперацииПоВыписке,	ДатаВыписки,
	ОтчетНаАнглийскомЯзыке)
	
	Если (ВидОперацииПоВыписке = Справочники.ВидыОпераций.ОткрытиеСчетаДепо
			ИЛИ ВидОперацииПоВыписке = Справочники.ВидыОпераций.ЗакрытиеСчетаДепо
			ИЛИ ВидОперацииПоВыписке = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо
			ИЛИ ВидОперацииПоВыписке = Справочники.ВидыОпераций.ЗакрытиеРазделаСчетаДепо)
		И Выписка.СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ Тогда
		ИмяСекции = "РеквизитыСчетаДЕПО_ИФИ";
	Иначе
		ИмяСекции = "РеквизитыСчетаДЕПО";
	КонецЕсли;
	
	ОбластьРеквизитыСчета				= Макет.ПолучитьОбласть(ИмяСекции);
	ПараметрыОбласти					= ОбластьРеквизитыСчета.Параметры;
	ПараметрыОбласти.НомерСчетаДЕПО 	= СокрЛП(Выписка.СчетДепо.Код);
	
	Если ИмяСекции = "РеквизитыСчетаДЕПО" и СтрНайти(ИмяМакета, "Макет_2_1_Версия04") > 0 Тогда
		ДатаВводаБазовогоСтандарта = Константы.ДатаВводаБазовогоСтандарта.Получить();
		Если ДатаВыписки < ДатаВводаБазовогоСтандарта Тогда
			ОбластьНоминальногоДержателя = ОбластьРеквизитыСчета.Область("НоминальныйДержатель"); 
			ОбластьРеквизитыСчета.УдалитьОбласть(ОбластьНоминальногоДержателя, ТипСмещенияТабличногоДокумента.ПоВертикали);
		Иначе
			Если Выписка.СчетДепо.ТипСчетаДепо = Перечисления.ТипыСчетовДепо.НоминальногоДержателя
				ИЛИ Выписка.СчетДепо.ТипСчетаДепо = Перечисления.ТипыСчетовДепо.НоминальногоДержателяТорговый Тогда
				ПараметрыОбласти.НомДержатель = "V";
			КонецЕсли;
		КонецЕсли;
		ДатаВводаИНД = Константы.ДатаВводаИНД.Получить();
		Если ДатаВыписки < ДатаВводаИНД Тогда
			ОбластьИНД = ОбластьРеквизитыСчета.Область("ИНД"); 
			ОбластьРеквизитыСчета.УдалитьОбласть(ОбластьИНД, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		КонецЕсли;
	КонецЕсли;
	
	// Если это поручение типа 2.6, то заполним номер отменяемого поручения
	Если ВидОперацииПоВыписке = Справочники.ВидыОпераций.ОтменаПоручения Тогда
		ПараметрыОбласти.ОтменяемоеПоручение= "№ "
			+ СокрЛП(Выписка.ДокументОснование.ОтменяемоеПоручение.Номер) + " от "
			+ Формат(Выписка.ДокументОснование.ОтменяемоеПоручение.Дата, "ДЛФ=D");
	КонецЕсли;		
	
	Если ВидОперацииПоВыписке = Справочники.ВидыОпераций.ОткрытиеСчетаДепо
		ИЛИ ВидОперацииПоВыписке = Справочники.ВидыОпераций.ЗакрытиеСчетаДепо
		ИЛИ ВидОперацииПоВыписке = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо
		ИЛИ ВидОперацииПоВыписке = Справочники.ВидыОпераций.ЗакрытиеРазделаСчетаДепо Тогда
		
		// Дата открытия / закрытия счета
		ФормированиеПечатныхФорм.СформироватьДатуДДММГГ(ПараметрыОбласти, "", Выписка.ОперацияЦБ.Дата);
		Если Выписка.СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетДЕПО Тогда
			// Установим галки в зависимости от типа счета ДЕПО
			УстановитьТипСчетаДепо(Выписка.ОперацияЦБ.СчетДепо.ТипСчетаДепо, ИмяМакета, ПараметрыОбласти);
		КонецЕсли;
		
	Иначе
		Если СтрНайти(ИмяМакета, "Макет_2_2_Версия03") > 0 Тогда
			Если Выписка.СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ Тогда
				ПараметрыОбласти.НаименованиеСчетаДЕПО = "Для учета ИФИ";
			Иначе
				ПараметрыОбласти.НаименованиеСчетаДЕПО = ТипСчета(Выписка.СчетДепо);
			КонецЕсли;
			
		ИначеЕсли СтрНайти(ИмяМакета, "Макет_2_6_Версия03") > 0 
				ИЛИ СтрНайти(ИмяМакета, "Макет_2_7_Версия03") > 0
				ИЛИ СтрНайти(ИмяМакета, "Макет_2_11_Версия02") > 0 Тогда
			ПараметрыОбласти.НаименованиеСчетаДЕПО = ТипСчета(Выписка.СчетДепо);
		Иначе
			ПараметрыОбласти.НаименованиеСчетаДЕПО = ОбщегоНазначенияКлиентСервер.НаименованиеКлиента(
				Выписка.СчетДепо.Владелец, ОтчетНаАнглийскомЯзыке);
		КонецЕсли;

		Если Найти(ИмяМакета, "Макет_2_7_") > 0 Тогда
			
			Если ЗначениеЗаполнено(Выписка.ДокументОснование.СчетДепоМХДокумента) Тогда
				ПараметрыОбласти.МестоХранения = СокрЛП(Выписка.ДокументОснование.СчетДепоМХДокумента.Владелец.КодМестаХранения);
			КонецЕсли;
			
		ИначеЕсли Найти(ИмяМакета, "Макет_2_11_") > 0 Тогда
			ПараметрыОбласти.МестоХранения = СокрЛП(Выписка.ОперацияЦБ.ЦенныеБумаги[0].СчетДепоМХ.Владелец.КодМестаХранения);
		КонецЕсли;
	КонецЕсли;
	
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыОбласти, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, Выписка.СчетДепо.ВидСчетаДепо);
	ТабличныйДокумент.Вывести(ОбластьРеквизитыСчета);
КонецПроцедуры

Функция ТипСчета(СчетДепо)
	Результат = "";
	Если ТипЗнч(СчетДепо) = Тип("СправочникСсылка.СчетаДепо") Тогда
		Результат = СокрЛП(СчетДепо.ТипСчетаДепо);
		
	ИначеЕсли ТипЗнч(СчетДепо) = Тип("СправочникСсылка.СчетаДепоМХ") Тогда
		Результат = СокрЛП(СчетДепо.ТипСчета);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ОтчетНРДПоВНБСделкам(ДокументОснование, ИмяМакета)
	СтрокаОтчета = "";
	ДатаМакетов2_12 = Константы.ДатаНачалаИспользованияМакетов2_12.Получить();
	Если ЗначениеЗаполнено(ДатаМакетов2_12) И ДатаВыписки >= ДатаМакетов2_12
		И Найти(ИмяМакета, "Макет_2_2_") = 1
		И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Поручение")
		И (ДокументОснование.ВидОперацииД = Справочники.ВидыОпераций.Депонирование
			ИЛИ ДокументОснование.ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования)
		И ДокументОснование.Инициатор = Константы.ОрганизацияПоУмолчанию.Получить()	// Поручение возникло в результате сделки
		И Документы.Поручение.ЭтоПоручениеНаИнвентарнуюОперациюПоСделке(ДокументОснование) 
		Тогда
		СтрокаОтчета = ", отчет " + Константы.МестоХраненияПоУмолчанию.Получить() + " от "
			+ Формат(ДокументОснование.ДатаИсполненияПорученияВДепозитарииМХ, "ДЛФ=Д");
	КонецЕсли;
	
	Возврат СтрокаОтчета;
КонецФункции

Функция ДопИнформацияДляДокументаОснованияПоручение(Выписка, ВидОперацииПоВыписке)
	
	ДопИнформация = СокрЛП(Выписка.ДокументОснование.Комментарий);
	
	Если Выписка.СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ Тогда
		Если Найти(ДопИнформация, "Депо") > 0 Тогда
			ДопИнформация = "";	
		КонецЕсли;
	КонецЕсли;

	ИмяРеквизита = "БлокировочныйРазделСчетаДепо";
	Если Не (ОбщегоНазначения.ЕстьРеквизитДокумента(ИмяРеквизита, Выписка.ОперацияЦБ.Метаданные())
			И ЗначениеЗаполнено(Выписка.ОперацияЦБ[ИмяРеквизита])) Тогда
		ИмяРеквизита = "РазделСчетаДепо";
	КонецЕсли;
	
	// При снятии с депонирования создается раздел "Блокировано (расчеты)" и в операции указывается
	// именно он. Тогда для клиента выводится раздел из оригинального поручения, а в доп.информации
	// указываем блокировочный раздел.
	Если ВидОперацииПоВыписке = Справочники.ВидыОпераций.СнятиеСДепонирования
		И ОбщегоНазначения.ЕстьРеквизитДокумента(ИмяРеквизита, Выписка.ОперацияЦБ.Метаданные())
		И Выписка.ОперацияЦБ[ИмяРеквизита].ТипРазделаСчетаДЕПО =
			Перечисления.ТипыРазделовСчетовДЕПО.БлокированоРасчеты
		И Выписка.ОперацияЦБ.ДокументОснование.РазделСчетаДепо.ТипРазделаСчетаДЕПО <>
			Перечисления.ТипыРазделовСчетовДЕПО.БлокированоРасчеты Тогда
		
		Если ЗначениеЗаполнено(ДопИнформация) Тогда
			ДопИнформация = ДопИнформация + ?(Прав(ДопИнформация, 1) <> ".", ". ", " ");
		КонецЕсли;
		
		ДопИнформация = ДопИнформация
		+ "С предварительной блокировкой на разделе "
		+ СокрЛП(Выписка.ОперацияЦБ[ИмяРеквизита].Код) + " "
		+ СокрЛП(Выписка.ОперацияЦБ[ИмяРеквизита].Наименование);
	КонецЕсли;
	Возврат ДопИнформация;
	
КонецФункции

Процедура ЗафиксироватьФормированиеОтчетовПоСПД(МассивВыписок)
	
	Если ЗначениеЗаполнено(ТипОперации) И НЕ ТипОперации = "СводноеПоручение" Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьПереносДаты = Ложь;
	МассивВыписокПоСПД = Новый Массив;
	Для каждого Выписка из МассивВыписок Цикл 
		Если ТипЗнч(Выписка.ДокументОснование) = Тип("ДокументСсылка.иц_СводноеПоручение") И Выписка.Дата <> ДатаФормированияОтчетов Тогда
			МассивВыписокПоСПД.Добавить(Выписка);
			ВыполнитьПереносДаты = Истина;
		КонецЕсли;
	КонецЦикла;
	Если ВыполнитьПереносДаты Тогда
		ПеренестиВыпискиНаДатуФормирования(МассивВыписокПоСПД);
		ВыполнитьПеренумерациюВыписок(ДатаВыписки);
		Если НачалоДня(ДатаВыписки) <> НачалоДня(ДатаФормированияОтчетов) Тогда
			ВыполнитьПеренумерациюВыписок(ДатаФормированияОтчетов);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПеренестиВыпискиНаДатуФормирования(МассивВыписок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РегистрацияДокументовВЭДО.Документ КАК ДокументВЭДО
	|ИЗ
	|	РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияДокументовВЭДО
	|ГДЕ
	|	РегистрацияДокументовВЭДО.Документ В(&МассивВыписок)
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрацияДокументовВЭДО.Документ";
	Запрос.УстановитьПараметр("МассивВыписок", МассивВыписок);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВыгруженныеВЭДОДокументы = Новый ТаблицаЗначений;
		ВыгруженныеВЭДОДокументы.Колонки.Добавить("ДокументВЭДО");
	Иначе 
		ВыгруженныеВЭДОДокументы = Результат.Выгрузить();
	КонецЕсли;
		
	Для Каждого Выписка Из МассивВыписок Цикл
		Если ВыгруженныеВЭДОДокументы.Найти(Выписка, "ДокументВЭДО") = Неопределено Тогда
			ДокОбъект = Выписка.ПолучитьОбъект();
			ДокОбъект.Дата = ДатаФормированияОтчетов;
			ДокОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьПеренумерациюВыписок(ДатаПеренумерации)
	ОбработкаПеренумерации = Обработки.ПеренумерацияДокументов.Создать();
	ВыборкаРег = РегистрыСведений.РегистрацияДокументовКПеренумерации.Выбрать(НачалоДня(ДатаПеренумерации),КонецДня(ДатаПеренумерации));
	Пока ВыборкаРег.Следующий() Цикл
		Если ВыборкаРег.ИмяДокумента = "Выписка" Тогда
			ОбработкаПеренумерации.ПеренумероватьДокументы(ВыборкаРег);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ИнформацияОВыплатеПрогрессивнаяШкалаНДФЛ(Поручение, СчетДепо)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"//00////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(НачисленныйНалог.СуммаНалога + НачисленныйНалог.СуммаНалогаПоСтавке15СПревышения) КАК СуммаОбязательствПоУплатеНалога,
	|	СУММА(НачисленныйНалог.СуммаНалога) КАК СуммаОбязательств13Процентов,
	|	СУММА(НачисленныйНалог.СуммаНалогаПоСтавке15СПревышения) КАК СуммаОбязательств15Процентов,
	|	МАКСИМУМ(НачисленныйНалог.КурсВалюты) КАК КурсВалюты,
	|	МАКСИМУМ(НачисленныйНалог.КратностьВалюты) КАК КратностьВалюты
	|ИЗ
	|	Документ.НачисленныйНалог КАК НачисленныйНалог
	|ГДЕ
	|	НачисленныйНалог.Основание = &Поручение
	|	И НачисленныйНалог.СчетДепо = &СчетДепо
	|	И НачисленныйНалог.Проведен
	|;
	|
	|//01////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ПлатежнаяОперацияОплатаНалога.Сумма) КАК СуммаНалога
	|ИЗ
	|	Документ.ПлатежнаяОперация КАК ПлатежнаяОперацияОплатаНалога
	|ГДЕ
	|	ПлатежнаяОперацияОплатаНалога.Основание = &Поручение
	|	И ПлатежнаяОперацияОплатаНалога.СчетДепо = &СчетДепо
	|	И ПлатежнаяОперацияОплатаНалога.ВидОперации = &ОплатаНалога
	|	И ПлатежнаяОперацияОплатаНалога.Проведен
	|;
	|
	|//02////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЦенныеБумаги.НДФЛУдержан) КАК НДФЛУдержан,
	|	СУММА(ЦенныеБумаги.Сумма) КАК ОбщаяСумма,
	|	СУММА(ЦенныеБумаги.СуммаНалога) КАК СуммаНалога,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ЦенныеБумаги.ЦеннаяБумага.ТипЦБ = &Облигация
	|				И ЦенныеБумаги.ЦеннаяБумага.ВидЦБ = &ГосударственныеОблигации
	|				И ЦенныеБумаги.Ссылка.БанковскийСчет.ВалютаДенежныхСредств <> &Рубль
	|			ТОГДА Истина
	|		ИНАЧЕ Ложь
	|	КОНЕЦ) КАК ЭтоЕврооблигацииМинфина,
	|	МАКСИМУМ(ЦенныеБумаги.Ссылка.БанковскийСчет.ВалютаДенежныхСредств) КАК ВалютаДокумента
	|ИЗ
	|	Документ.Поручение.ЦенныеБумагиСписываемые КАК ЦенныеБумаги
	|ГДЕ
	|	ЦенныеБумаги.Ссылка = &Поручение
	|	И ЦенныеБумаги.СчетДепо = &СчетДепо";
	Запрос.УстановитьПараметр("Поручение", Поручение);
	Запрос.УстановитьПараметр("СчетДепо", СчетДепо);
	Запрос.УстановитьПараметр("Облигация", Перечисления.ТипыЦБ.Облигация);
	Запрос.УстановитьПараметр("ГосударственныеОблигации", Перечисления.ВидыОблигаций.Государственная);
	Запрос.УстановитьПараметр("Рубль", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ОплатаНалога", Перечисления.ВидыПлатежныхОпераций.ОплатаНалога);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Результат = Новый Структура;
	
	Результат.Вставить("СуммаОбязательствПоУплатеНалога", 0);
	КурсВалюты = 1;
	СуммаОбязательств13Процентов = 0;
	СуммаОбязательств15Процентов = 0;
	ВыборкаНачисленныйНалог = РезультатЗапроса[0].Выбрать();
	ВыборкаНачисленныйНалог.Следующий();
	Если ВыборкаНачисленныйНалог.СуммаОбязательствПоУплатеНалога <> Null Тогда
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаНачисленныйНалог);
		КурсВалюты = ВыборкаНачисленныйНалог.КурсВалюты /
			?(ВыборкаНачисленныйНалог.КратностьВалюты = 0, 1, ВыборкаНачисленныйНалог.КратностьВалюты);
		СуммаОбязательств13Процентов = ВыборкаНачисленныйНалог.СуммаОбязательств13Процентов;
		СуммаОбязательств15Процентов = ВыборкаНачисленныйНалог.СуммаОбязательств15Процентов;
	КонецЕсли;
	
	ВыборкаПлатежнойОперации = РезультатЗапроса[1].Выбрать();
	ВыборкаПлатежнойОперации.Следующий();
	
	НДФЛУдержан = Ложь;
	ОбщаяСумма = 0;
	СуммаНалога = 0;
	ЭтоЕврооблигацииМинфина = Ложь;
	ВалютаДокумента = Запрос.Параметры.Рубль;
	ВыборкаЦБПоручения = РезультатЗапроса[2].Выбрать();
	ВыборкаЦБПоручения.Следующий();
	Если ВыборкаЦБПоручения.НДФЛУдержан <> Null Тогда
		НДФЛУдержан = ВыборкаЦБПоручения.НДФЛУдержан;
		ОбщаяСумма = ВыборкаЦБПоручения.ОбщаяСумма;
		СуммаНалога = ВыборкаЦБПоручения.СуммаНалога;
		ЭтоЕврооблигацииМинфина = ВыборкаЦБПоручения.ЭтоЕврооблигацииМинфина;
		ВалютаДокумента = ВыборкаЦБПоручения.ВалютаДокумента;
	КонецЕсли;
	
	Если ЭтоЕврооблигацииМинфина Тогда
		Результат.Вставить("ВалютаНалога", Запрос.Параметры.Рубль);
	Иначе
		Результат.Вставить("ВалютаНалога", ВалютаДокумента);
	КонецЕсли;
	Результат.ВалютаНалога = Справочники.Валюты.ПредставлениеВалюты(Результат.ВалютаНалога);
	
	Если НДФЛУдержан Тогда
		Результат.Вставить("СуммаНалога", СуммаНалога);
	Иначе
		Результат.Вставить("СуммаНалога", 0);
		Если ВыборкаПлатежнойОперации.СуммаНалога <> Null Тогда
			Результат.Вставить("СуммаНалога", ВыборкаПлатежнойОперации.СуммаНалога);
		КонецЕсли;
	КонецЕсли;
	
	Если НДФЛУдержан Тогда
		СуммаКВыплате = ОбщаяСумма - СуммаНалога;
	ИначеЕсли ЭтоЕврооблигацииМинфина Тогда
		СуммаКВыплате = ОбщаяСумма;
	Иначе
		СуммаКВыплате = ОбщаяСумма - Результат.СуммаОбязательствПоУплатеНалога;
	КонецЕсли;
	Результат.Вставить("СуммаКВыплате", СуммаКВыплате);
	
	ВалютаКурсДопИнфо = Результат.ВалютаНалога;
	Если КурсВалюты <> 1 Тогда
		ВалютаКурсДопИнфо = ВалютаКурсДопИнфо + " (по курсу " + КурсВалюты + ")";
	КонецЕсли;
	
	ДопИнформация1 = "";
	Если ЭтоЕврооблигацииМинфина И Результат.СуммаОбязательствПоУплатеНалога <> 0 Тогда
		Если ВыборкаПлатежнойОперации.СуммаНалога = Null Тогда
			ДопИнформация1 = " Сумма налога в размере %1 %2 не была удержана налоговым агентом, "
				+ "у Вас возникла обязанность по уплате налога в бюджет.";
		Иначе
			ДопИнформация1 = " Сумма налога в размере %1 %2 была удержана с брокерского счета.";
		Конецесли;
		ДопИнформация1 = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ДопИнформация1,
			Формат(Результат.СуммаОбязательствПоУплатеНалога, "ЧДЦ=2"), ВалютаКурсДопИнфо);
	КонецЕсли;	
	
	ДопИнформация2 = "";
	Если СуммаОбязательств13Процентов <> 0 И СуммаОбязательств15Процентов <> 0 Тогда
		ДопИнформация2 = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			" Сумма налога по ставке %4 составляет %1 %3, сумма налога по ставке %5 составляет %2 %3.",
			Формат(СуммаОбязательств13Процентов, "ЧДЦ=2"),
			Формат(СуммаОбязательств15Процентов, "ЧДЦ=2"),
			ВалютаКурсДопИнфо, "13%", "15%");
	КонецЕсли;
	Результат.Вставить("ДопИнформацияПоПоручению", ДопИнформация1 + ДопИнформация2);
	
	Если ЭтоЕврооблигацииМинфина Тогда
		Результат.СуммаНалога = 0;
	Иначе
		Результат.СуммаОбязательствПоУплатеНалога = 0;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

Депозитарий			= Константы.ОрганизацияПоУмолчанию.Получить();
ДанныеЛицензии		= ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Депозитарий);
мТекстыЗаголовков	= ФормированиеПечатныхФорм.ТекстыЗаголовковОтчетов(ПолучитьМакет("Заголовки").ПолучитьТекст());

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
