#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Заполнить область
//
// Считывает данные из Табличного документа и заполняет ТЧ обработки и некоторые реквизиты обработки
//
// Параметры:
//  ТабличныйДокумент	 - ТабличныйДокумент - Табличный документ из формы обработки
//
Процедура ЗаполнитьОбласть(ТабличныйДокумент) Экспорт
	
	СоставПоручения.Очистить();
	
	ТекСтрока = 19;
	СпособХранения = Перечисления.СпособыХранения.Открытый;
	ПерваяИтерация = Истина;
	Пока ТекСтрока <= ТабличныйДокумент.ВысотаТаблицы Цикл
		
		ПерваяКолонка = ТабличныйДокумент.Область("R" + ТекСтрока + "C1").Текст;
		Если ПерваяКолонка = "" Тогда
			Прервать;
		КонецЕсли;
		
		ВидОперацииСтрокой = ТабличныйДокумент.Область("R" + ТекСтрока + "C1").Текст;
		Количество = Число(СтрЗаменить(ТабличныйДокумент.Область("R" + ТекСтрока + "C10").Текст, ",", ""));
		
		Если СтрНайти(НРег(ВидОперацииСтрокой), "зачисление") > 0 Тогда
			ВидОперации = Справочники.ВидыОпераций.Депонирование;
		Иначе
			ВидОперации = Справочники.ВидыОпераций.СнятиеСДепонирования;
		КонецЕсли;
		
		Если ПерваяИтерация Тогда
			СтрокаРазделСчетаДепо = ТабличныйДокумент.Область("R" + ТекСтрока + "C5").Текст;
			ЗаполнитьОсновныеРеквизиты(СтрокаРазделСчетаДепо);
			
			ПроверитьЗаполнениеРеквизитов();
			
			ПерваяИтерация = Ложь;
		КонецЕсли;
		
		СтрокаISIN = СокрЛП(ТабличныйДокумент.Область("R" + ТекСтрока + "C8").Текст);
		ЦеннаяБумага = Справочники.ЦенныеБумаги.ЦеннаяБумагаПоРегНомеруИISIN(СтрокаISIN, Неопределено);
		Если ЦеннаяБумага = Неопределено Тогда
			СтрокаГосНомер = СокрЛП(ТабличныйДокумент.Область("R" + ТекСтрока + "C9").Текст);
			ЦеннаяБумага = ПолучитьЦБПоГосНомеру(СтрокаГосНомер);
		КонецЕсли;
		
		СтрокаТЧ = СоставПоручения.Добавить();
		СтрокаТЧ.СчетДЕПОМХ = СчетДепоMX;
		СтрокаТЧ.РазделСчетаДЕПОМХ = РазделСчетаДепоMX;
		СтрокаТЧ.МестоХранения = МестоХранения;
		СтрокаТЧ.ЦеннаяБумага = ЦеннаяБумага;
		СтрокаТЧ.СчетДЕПО = СчетДепо;
		СтрокаТЧ.СпособХранения = СпособХранения;
		СтрокаТЧ.РазделСчетаДЕПО = РазделСчетаДепо;
		СтрокаТЧ.Депонент = Депонент;
		СтрокаТЧ.ВидОперацииД = ВидОперации;
		СтрокаТЧ.Количество = Количество;
		
		ТекСтрока = ТекСтрока + 1;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Прочитать на сервере
// 
// Считывает файл, заполняет табличный документ обработки, заполняет некоторые основные реквизиты
//
// Параметры:
//  Адрес				 - Строка - Полный путь к файлу xls
//  ТабличныйДокумент	 - ТабличныйДокумент - Табличный документ из формы обработки
//
Процедура ПрочитатьНаСервере(Адрес, ТабличныйДокумент) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	ТабличныйДокумент.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	ПериодСтрока = ТабличныйДокумент.Область("R15C8").Текст;
	ПериодНачало = СтрокуВДату(ПериодСтрока);
	ПериодКонец = КонецДня(ПериодНачало);
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ЗагрузкаСПД'"),
			УровеньЖурналаРегистрации.Ошибка, , , "Не удалось удалить временный файл. " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Функция - Новый документ
// Создает новый документ иц_СводноеПоручение и заполняет на основе реквизитов обработки
// 
// Возвращаемое значение:
//   - ДокументСсылка.иц_СводноеПоручение
//
Функция НовыйДокумент() Экспорт
	
	Документ = Документы.иц_СводноеПоручение.СоздатьДокумент();
	
	ЗаполнитьДокументОбъект(Документ);
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	Возврат Документ.Ссылка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтрокуВДату(СтрокаДата)
	Массив = СтрРазделить(СтрокаДата, ".");
	Возврат Дата(Массив[2], Массив[1], Массив[0]);
КонецФункции

Функция ПолучитьЦБПоГосНомеру(ГосНомер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦенныеБумаги.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|ГДЕ
	|	ЦенныеБумаги.НомерРегистрации = &ГосНомер";
	
	Запрос.УстановитьПараметр("ГосНомер", ГосНомер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьЗаполнениеРеквизитов()
	
	Если Не ЗначениеЗаполнено(РазделСчетаДепо) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел счета депо не заполнен.");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СчетДепо) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счет депо не заполнен.");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Депонент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Депонент не заполнен.");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РазделСчетаДепоMX) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел счета депо МХ не заполнен.");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СчетДепоMX) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счет депо МХ не заполнен.");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МестоХранения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Место хранения не заполнено.");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументОбъект(Документ)
	СекундДляРовнойМинуты = 59;
	Документ.Дата = ПериодКонец - СекундДляРовнойМинуты;
	
	Документ.ДатаИсполнения = КонецДня(ПериодКонец);
	Документ.ДатаФормированияОтчетов = ПериодКонец;
	
	Документ.НачалоПериода = ПериодНачало;
	Документ.ОкончаниеПериода = КонецДня(ПериодКонец);
	
	Документ.СоставПоручения.Загрузить(СоставПоручения.Выгрузить());
	Документ.СоставПоручения.Сортировать("ВидОперацииД");
	Если Документ.СоставПоручения.Количество() > 0 Тогда
		Документ.СчетДЕПО = СчетДепо;
	КонецЕсли;
	Документ.Инициатор = Инициатор;
	
	
КонецПроцедуры

Процедура ЗаполнитьОсновныеРеквизиты(КодРазделаСчетаДепо)
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РазделыСчетаДепо.Ссылка КАК РазделСчетаДепо,
	|	РазделыСчетаДепо.Владелец КАК СчетДепо,
	|	РазделыСчетаДепо.Владелец.Владелец КАК Депонент,
	|	РазделыСчетаДепо.РазделСчетаДепоМХ КАК РазделСчетаДепоMX,
	|	РазделыСчетаДепо.РазделСчетаДепоМХ.Владелец КАК СчетДепоMX,
	|	РазделыСчетаДепо.РазделСчетаДепоМХ.Владелец.Владелец КАК МестоХранения
	|ИЗ
	|	Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
	|ГДЕ
	|	РазделыСчетаДепо.Код = &КодРазделаСчетаДепо";
	
	Запрос.УстановитьПараметр("КодРазделаСчетаДепо", КодРазделаСчетаДепо);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		РазделСчетаДепо = Выборка.РазделСчетаДепо;
		СчетДепо = Выборка.СчетДепо;
		Депонент = Выборка.Депонент;
		РазделСчетаДепоMX = Выборка.РазделСчетаДепоMX;
		СчетДепоMX = Выборка.СчетДепоMX;
		МестоХранения = Выборка.МестоХранения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);

#КонецОбласти
