
#Область ПрограммныйИнтерфейс

// Функция получает значение лимита применения заданной ставки НДФЛ на указанную дату
//
// Параметры:
//  Дата - Дата - Дата для получения лимита
//  СтавкаНДФЛ - ПеречислениеСсылка.НДФЛСтавки - Ставка НДФЛ для получения лимита
// 
// Возвращаемое значение:
//  Число - Значение лимита
//
Функция ЛимитНаДату(Дата, СтавкаНДФЛ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛимитыПримененияСтавокНДФЛ.Лимит КАК Лимит
	|ИЗ
	|	РегистрСведений.ЛимитыПримененияСтавокНДФЛ.СрезПоследних(&Дата, СтавкаНДФЛ = &СтавкаНДФЛ) КАК ЛимитыПримененияСтавокНДФЛ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("СтавкаНДФЛ", СтавкаНДФЛ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Лимит = 0;
	Если Выборка.Следующий() Тогда
		Лимит = Выборка.Лимит;
	КонецЕсли;
	
	Возврат Лимит;
КонецФункции

// Процедура добавляет новую запись в регистр сведений с заданными значениями периода и лимита
//
// Параметры:
//  Период - Дата - Период
//  СтавкаНДФЛ - ПеречислениеСсылка.НДФЛСтавки - Ставка НДФЛ
//  Лимит - Число - Лимит
//
Процедура ДобавитьЗапись(Период, СтавкаНДФЛ, Лимит) Экспорт
	МенеджерЗаписи = РегистрыСведений.ЛимитыПримененияСтавокНДФЛ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Период;
	МенеджерЗаписи.СтавкаНДФЛ = СтавкаНДФЛ;
	МенеджерЗаписи.Лимит = Лимит;
	МенеджерЗаписи.Записать();
КонецПроцедуры

#КонецОбласти
