
//#Область ОписаниеПеременных

//#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДополнительнаяОбработкаСсылка = Неопределено;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Заголовок = "Начисление вознаграждения за управление: Розничное ДУ. Версия - " + ОбработкаОбъект.СведенияОВнешнейОбработке().Версия;
	
	Если Параметры.Свойство("ДополнительнаяОбработкаСсылка", ДополнительнаяОбработкаСсылка) Тогда
		Если ДополнительнаяОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка() Тогда
			ИмяОбработки = ОбработкаОбъект.Метаданные().Имя;
			ДополнительнаяОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ИмяОбработки);
		КонецЕсли;
	Иначе
		ИмяОбработки = ОбработкаОбъект.Метаданные().Имя;
		ДополнительнаяОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ИмяОбработки);
	КонецЕсли;
	
	Если ДополнительнаяОбработкаСсылка <> Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка() Тогда
		Настройки = ДополнительнаяОбработкаСсылка.ХранилищеНастроек.Получить();
		ОбработкаОбъект.УстановитьПользовательскиеНастройки(Настройки);
		ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДоговорыКНачислениюНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ДоговорыКНачислению();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыКНачислению(Команда)
	ДоговорыКНачислениюНаСервере();
КонецПроцедуры

&НаСервере
Процедура НачислитьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	// IMDEV-9153: ссылка доп.обработки нужна для параллельного запуска пачек в фоне.
	ДополнительнаяОбработкаСсылка = СсылкаДополнительнойОбработки(ОбработкаОбъект);
	ОбработкаОбъект.СоздатьНачисления(ДополнительнаяОбработкаСсылка);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Функция СсылкаДополнительнойОбработки(ОбработкаОбъект)
	ИмяОбработки = ОбработкаОбъект.Метаданные().Имя;
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ИмяОбработки);
КонецФункции

&НаКлиенте
Процедура Начислить(Команда)
	НачислитьНаСервере();
КонецПроцедуры

#КонецОбласти
