
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаВыписки 					= ТекущаяДата();
	Объект.НачПериода					= НачалоМесяца(Объект.ДатаВыписки);
	Объект.КонПериода					= КонецМесяца(Объект.ДатаВыписки);
	Объект.АдминистративныеОперации 	= Истина;
	Объект.ИнвентарныеОперации 			= Истина;
	Объект.ГлобальныеОперации 			= Истина;
	Объект.ИнформационныеОперации		= Истина;
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыпискаПриИзменении(Элемент)
	
	Если Объект.Выписка Тогда
		Элементы.ФормироватьНаДатуОперации.Доступность = Ложь;
	Иначе
		Элементы.ФормироватьНаДатуОперации.Доступность = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьНаДатуОперацииПриИзменении(Элемент)
	
	Если Объект.ФормироватьНаДатуОперации = Истина Тогда
		Элементы.Выписка.Доступность = Ложь;
		Элементы.ДатаВыписки.Доступность = Ложь;
	Иначе
		Элементы.Выписка.Доступность = Истина;
		Элементы.ДатаВыписки.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

//#КонецОбласти


//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьНажатие(Команда)
	
	КоличествоДокументов = КоличествоДокументов() - 1;
	Элементы.Индикатор.МаксимальноеЗначение = КоличествоДокументов;
	Для Счетчик = 0 По КоличествоДокументов Цикл
	    Индикатор = Счетчик;
		МассивТабличныхДокументов = ВыполнитьНаСервере(Счетчик);
		Для каждого ЭлементМассива Из  МассивТабличныхДокументов Цикл
			
			ЭлементМассива.ТабДок.Показать(ЭлементМассива.ОперацияЦб,,Ложь);
		
		КонецЦикла;
	КонецЦикла;
	                                 
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериода(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтаФорма);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период.ДатаНачала = Объект.НачПериода;
	Диалог.Период.ДатаОкончания = Объект.КонПериода;
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		Объект.НачПериода = Период.ДатаНачала;
		Объект.КонПериода = Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КоличествоДокументов()
	
	Возврат Метаданные.Документы.Количество();
	
КонецФункции

&НаСервере
Функция ВыполнитьНаСервере(НомерДокумента)
	ТекДокумент = Метаданные.Документы[НомерДокумента];
	НашОбъект = РеквизитФормыВЗначение("Объект");
	НужныйДокумент = ТекДокумент.Имя;
		Если Объект.АдминистративныеОперации 
		И  (НужныйДокумент = "ОткрытиеСчетаДепо" 
		ИЛИ НужныйДокумент = "ОткрытиеРазделаСчетаДепо"
		ИЛИ НужныйДокумент = "КорректировкаРеквизитовСчетаДепо"
		ИЛИ НужныйДокумент = "НазначениеПредставителяСчетаДепо"
		ИЛИ НужныйДокумент = "ОтменаПредставителяСчетаДепо"
		ИЛИ НужныйДокумент = "ЗакрытиеСчетаДепо" 
		ИЛИ НужныйДокумент = "ОтменаПоручения") Тогда
			МассивТабличныйДокументов = НашОбъект.НайденныеДокументы(НужныйДокумент);
		ИначеЕсли Объект.ИнвентарныеОперации 
		И  (НужныйДокумент = "ЦБВПути" ИЛИ НужныйДокумент = "ОперацииЦБ") Тогда
			МассивТабличныйДокументов = НашОбъект.НайденныеДокументы(НужныйДокумент);
		ИначеЕсли Объект.ГлобальныеОперации 
		И  (НужныйДокумент = "ВводДивидендов" 
		ИЛИ НужныйДокумент = "ПогашениеЦБ"
		ИЛИ НужныйДокумент = "КонвертацияЦБ"
		ИЛИ НужныйДокумент = "ПогашениеНКД"
		ИЛИ НужныйДокумент = "ПогашениеЦБПолное"
		ИЛИ НужныйДокумент = "ПогашениеЦБЧастичное"
		ИЛИ НужныйДокумент = "ГлобальнаяОперация"
		) Тогда
			МассивТабличныйДокументов = НашОбъект.НайденныеДокументы(НужныйДокумент);
		ИначеЕсли Объект.ИнформационныеОперации И НужныйДокумент = "ФормированиеРеестраВладельцев" Тогда	
			МассивТабличныйДокументов = НашОбъект.НайденныеДокументы(НужныйДокумент);
		КонецЕсли;
		
		Возврат ?(ТипЗнч(МассивТабличныйДокументов) = Тип("Массив") , МассивТабличныйДокументов, Новый Массив);
		
КонецФункции

//#КонецОбласти









