
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ВидПечатнойФормы = "Акт";
	ТабличныйДокумент = ПечатнаяФормаСервер(ПараметрКоманды, ВидПечатнойФормы);
	Если ТипЗнч(ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
		ТабличныйДокумент.Показать(ВидПечатнойФормы);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для печати!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПечатнаяФормаСервер(ДокументыДляПечати, ВидПечатнойФормы)
	
	Возврат Документы.УслугиДепозитария.Печать(ДокументыДляПечати, ВидПечатнойФормы);
	
КонецФункции

