#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПредставлениеЗаданияПоРассылке()
	Возврат "Регламентное задание по объекту ("+Наименование+")"+?(ВызываемыйОтчетОбработка	= "<!!!НЕ ОПРЕДЕЛЕН!!!>", "", " - "+ВызываемыйОтчетОбработка);
КонецФункции // ()
	 
Процедура ПередЗаписью(Отказ)
	// Вызывается непосредственно до записи объекта в базу данных
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	// Проверка на заполненность данных сервера / базы
	Если Не ЗначениеЗаполнено(КластерСерверов) ИЛИ Не ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнены данные кластера серверов или базы!!!", Отказ);
		Возврат;
	КонецЕсли;	
	// Создание регламентное задание (получение уникального идентификатора)
	УстановитьПривилегированныйРежим(Истина);
	//---
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентУИД);
	Если Задание = Неопределено И РегламентАктивен Тогда
		Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.РегламентныеЗаданияПоОбъектам);
		Задание.Использование	= РегламентАктивен;
		Задание.Наименование	= ПредставлениеЗаданияПоРассылке();
		Задание.Расписание		= ДополнительныеСвойства.Расписание;
		Задание.Записать();
		
	 	РегламентУИД = Задание.УникальныйИдентификатор;
	КонецЕсли;
	//---
	Если Не Задание = Неопределено Тогда
		Если ПометкаУдаления или Не РегламентАктивен Тогда
			Задание.Удалить();
		Иначе
			ЗаданиеИзменено = Ложь;
			// Установим признак активности регл. задания
			Если Задание.Использование <> РегламентАктивен Тогда
				Задание.Использование	= РегламентАктивен;
				ЗаданиеИзменено			= Истина;
			КонецЕсли;
			// Расписание устанавливается в форме элемента
			Если ДополнительныеСвойства.Свойство("Расписание") И ТипЗнч(ДополнительныеСвойства.Расписание) = Тип("РасписаниеРегламентногоЗадания") И Строка(ДополнительныеСвойства.Расписание) <> Строка(Задание.Расписание) Тогда
				Задание.Расписание		= ДополнительныеСвойства.Расписание;
				ЗаданиеИзменено			= Истина;
			КонецЕсли;
			// Сформируем представление задания
			НаименованиеЗадания = ПредставлениеЗаданияПоРассылке();
			Если Задание.Наименование <> НаименованиеЗадания Тогда
				Задание.Наименование	= НаименованиеЗадания;
				ЗаданиеИзменено			= Истина;
			КонецЕсли;
			// Заполним параметры задания
			Если Задание.Параметры.Количество() <> 1 ИЛИ Задание.Параметры[0] <> Ссылка Тогда
				ПараметрыЗадания = Новый Массив;
				ПараметрыЗадания.Добавить(Ссылка);
				Задание.Параметры	= ПараметрыЗадания;
				ЗаданиеИзменено		= Истина;
			КонецЕсли;
			// Если задание поменялось, то запишем
			Если ЗаданиеИзменено Тогда
				Задание.Записать();
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	//---
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентУИД);
	Если Задание <> Неопределено Тогда
		Задание.Удалить();
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	РегламентноеЗадание = Неопределено;
	РегламентУИД		= Новый УникальныйИдентификатор;
КонецПроцедуры

#КонецЕсли
