
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Дата = ТекущаяДатаСеанса();
	Объект.ВидИнициатора = 1;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура ЗакрытьРазделы(Команда)  
	
	Если Объект.РазделыСчетаДепо.Количество() = 0 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан список разделов счетов депо",,,"Объект.РазделыСчетаДепо");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата для закрытия разделов счетов депо",,,"Объект.Дата");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗакрытьРазделыЗавершение",ЭтотОбъект);
	ПоказатьВопрос(Оповещение,"Выполнить закрытие разделов счетов депо?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзЭксель(Команда)
	
	Если Объект.РазделыСчетаДепо.Количество() > 0 Тогда 
		Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзЭксельПродолжение",ЭтотОбъект);
		ПоказатьВопрос(Оповещение,"Список разделов счетов депо будет очищен. Продолжить?",РежимДиалогаВопрос.ДаНет);
	Иначе 
		ЗагрузитьИзЭксельПоказатьДиалогВыбораФайла();
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборРазделов(Команда)
	
	СтатусОткрыт = ПредопределенноеЗначение("Перечисление.СтатусыСчетовДепо.Открыт");
	СтруктураОтбор = Новый Структура("СтатусСчетаДепо",СтатусОткрыт);
	ПараметрыФормы = Новый Структура("Отбор,ЗакрыватьПриВыборе,МножественныйВыбор",СтруктураОтбор,Ложь,Ложь);
	ОткрытьФорму("Справочник.РазделыСчетаДепо.ФормаВыбора",ПараметрыФормы,Элементы.РазделыСчетаДепо,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РазделыСчетаДепоРазделСчетаДепоПриИзменении(Элемент)
	
	Если Элементы.РазделыСчетаДепо.ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ИД = Элементы.РазделыСчетаДепо.ТекущаяСтрока;
	ТекСтрока = Объект.РазделыСчетаДепо.НайтиПоИдентификатору(ИД);
	ТекСтрока.Комментарий = Неопределено;
	ТекСтрока.Ошибка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыСчетаДепоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НайденныеСтроки = Объект.РазделыСчетаДепо.НайтиСтроки(Новый Структура("РазделСчетаДепо",ВыбранноеЗначение));
	Если НайденныеСтроки.Количество() = 0 Тогда 
		НоваяСтрока = Объект.РазделыСчетаДепо.Добавить();
		НоваяСтрока.РазделСчетаДепо = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ДополнительныеПроцедурыИФункции

&НаКлиенте
Процедура ЗакрытьРазделыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ЗакрытьРазделыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьРазделыНаСервере()	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ТЗ.НомерСтроки КАК НомерСтроки,
	    |	ТЗ.РазделСчетаДепо КАК РазделСчетаДепо
	    |ПОМЕСТИТЬ ВТТЧ
	    |ИЗ
	    |	&ТЗ КАК ТЗ
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	РазделыСчетаДепо.Ссылка КАК РазделСчетаДепо,
	    |	РазделыСчетаДепо.Владелец.Владелец КАК Депонент,
	    |	РазделыСчетаДепоМХ.Ссылка КАК РазделСчетаДепоМХ,
	    |	РазделыСчетаДепо.ТипРазделаСчетаДЕПО КАК ТипРазделаСчетаДЕПО,
	    |	ДокПоручение.Ссылка КАК Поручение,
	    |	РазделыСчетаДепоМХ.Владелец КАК СчетДепоМХ,
	    |	РазделыСчетаДепо.Владелец КАК СчетДепо,
	    |	ВТТЧ.НомерСтроки КАК НомерСтроки
	    |ПОМЕСТИТЬ ВТПредварительноНаЗакрытие
	    |ИЗ
	    |	Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
	    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепоМХ КАК РазделыСчетаДепоМХ
	    |		ПО РазделыСчетаДепо.РазделСчетаДепоМХ = РазделыСчетаДепоМХ.Ссылка
	    |			И (РазделыСчетаДепоМХ.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Открыт))
	    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК ДокПоручение
	    |		ПО РазделыСчетаДепо.Владелец = ДокПоручение.СчетДепо
	    |			И РазделыСчетаДепо.Ссылка = ДокПоручение.РазделСчетаДепо
	    |			И (ДокПоручение.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ЗакрытиеРазделаСчетаДепо))
	    |			И (ДокПоручение.Проведен)
	    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТЧ КАК ВТТЧ
	    |		ПО (ВТТЧ.РазделСчетаДепо = РазделыСчетаДепо.Ссылка)
	    |ГДЕ
	    |	РазделыСчетаДепо.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Открыт)
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	РазделыСчетаДепо.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	    |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РазделыСчетаДепо.Ссылка) КАК КоличествоСсылок
	    |ПОМЕСТИТЬ ВТСчетчикИспользованияРазделаМХ
	    |ИЗ
	    |	Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
	    |ГДЕ
	    |	РазделыСчетаДепо.РазделСчетаДепоМХ <> ЗНАЧЕНИЕ(Справочник.РазделыСчетаДепоМХ.ПустаяСсылка)
	    |	И РазделыСчетаДепо.РазделСчетаДепоМХ В
	    |			(ВЫБРАТЬ
	    |				ВТПредварительноНаЗакрытие.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ
	    |			ИЗ
	    |				ВТПредварительноНаЗакрытие КАК ВТПредварительноНаЗакрытие)
	    |	И РазделыСчетаДепо.РазделСчетаДепоМХ.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Открыт)
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РазделыСчетаДепо.РазделСчетаДепоМХ
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	ВТПредварительноНаЗакрытие.РазделСчетаДепо КАК РазделСчетаДепо,
	    |	ВТПредварительноНаЗакрытие.Депонент КАК Депонент,
	    |	ВЫБОР
	    |		КОГДА ВТСчетчикИспользованияРазделаМХ.КоличествоСсылок = 1
	    |			ТОГДА ВТПредварительноНаЗакрытие.РазделСчетаДепоМХ
	    |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РазделыСчетаДепоМХ.ПустаяСсылка)
	    |	КОНЕЦ КАК РазделСчетаДепоМХ,
	    |	ВТПредварительноНаЗакрытие.ТипРазделаСчетаДЕПО КАК ТипРазделаСчетаДЕПО,
	    |	ВТПредварительноНаЗакрытие.Поручение КАК Поручение,
	    |	ВЫБОР
	    |		КОГДА ВТСчетчикИспользованияРазделаМХ.КоличествоСсылок = 1
	    |			ТОГДА ВТПредварительноНаЗакрытие.СчетДепоМХ
	    |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РазделыСчетаДепоМХ.ПустаяСсылка)
	    |	КОНЕЦ КАК СчетДепоМХ,
	    |	ВТПредварительноНаЗакрытие.СчетДепо КАК СчетДепо,
	    |	ВТПредварительноНаЗакрытие.НомерСтроки КАК НомерСтроки,
	    |	ВТПредварительноНаЗакрытие.Поручение КАК Поручение1
	    |ИЗ
	    |	ВТПредварительноНаЗакрытие КАК ВТПредварительноНаЗакрытие
	    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСчетчикИспользованияРазделаМХ КАК ВТСчетчикИспользованияРазделаМХ
	    |		ПО ВТПредварительноНаЗакрытие.РазделСчетаДепоМХ = ВТСчетчикИспользованияРазделаМХ.РазделСчетаДепоМХ";
	
	Запрос.УстановитьПараметр("ТЗ", Объект.РазделыСчетаДепо.Выгрузить());  		
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Если ЗначениеЗаполнено(Выборка.Поручение) Тогда 
			
			Объект.РазделыСчетаДепо[Выборка.НомерСтроки-1].Комментарий = "Поручение на закрытие раздела уже существует";
			Объект.РазделыСчетаДепо[Выборка.НомерСтроки-1].Ошибка = Истина; // Сбросить, если ранее была ошибка
			
		Иначе 
		
			ДокЗакрытияРаздела = Документы.Поручение.СоздатьДокумент();
			ДокЗакрытияРаздела.Дата					= Объект.Дата;
			ДокЗакрытияРаздела.ВидОперацииД			= Справочники.ВидыОпераций.ЗакрытиеРазделаСчетаДепо;
			ДокЗакрытияРаздела.Инициатор			= Константы.ОрганизацияПоУмолчанию.Получить();
			ДокЗакрытияРаздела.СчетДепо				= Выборка.СчетДепо;
			ДокЗакрытияРаздела.Депонент				= Выборка.Депонент;
			ДокЗакрытияРаздела.РазделСчетаДепо		= Выборка.РазделСчетаДепо;
			ДокЗакрытияРаздела.ТипРазделаСчетаДЕПО	= Выборка.ТипРазделаСчетаДЕПО;
			ДокЗакрытияРаздела.ВидИнициатора		= Объект.ВидИнициатора;
			
			Если ЗначениеЗаполнено(Выборка.СчетДепоМХ) И ЗначениеЗаполнено(Выборка.РазделСчетаДепоМХ) Тогда 
				ДокЗакрытияРаздела.ЗакрытьВМХ	= Истина;
				ДокЗакрытияРаздела.СчетДепоМХ	= Выборка.СчетДепоМХ;
			    ДокЗакрытияРаздела.РазделСчетаДепоМХ	= Выборка.РазделСчетаДепоМХ;
			КонецЕсли;			
			
			Попытка
				ДокЗакрытияРаздела.Записать(РежимЗаписиДокумента.Проведение);
				Объект.РазделыСчетаДепо[Выборка.НомерСтроки-1].Комментарий = ДокЗакрытияРаздела.Ссылка;
				Объект.РазделыСчетаДепо[Выборка.НомерСтроки-1].Ошибка = Ложь; // Сбросить, если ранее была ошибка
			Исключение	
				Объект.РазделыСчетаДепо[Выборка.НомерСтроки-1].Комментарий = "ОШИБКА: "+ОписаниеОшибки();
				Объект.РазделыСчетаДепо[Выборка.НомерСтроки-1].Ошибка = Истина;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзЭксельПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли; 
	
	ЗагрузитьИзЭксельПоказатьДиалогВыбораФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзЭксельПоказатьДиалогВыбораФайла()
	
	ПараметрыДиалога = 
		Новый ПараметрыДиалогаПомещенияФайлов("Выберите файл для загрузки",Ложь,"Файлы Excel(*.xls,*.xlsx)|*.xls;*.xlsx");
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзЭксельЗавершение",ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(Оповещение,,,,ПараметрыДиалога,УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзЭксельЗавершение(ОписаниеПомещенногоФайла,ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ЗагрузитьИзЭксельНаСервере(ОписаниеПомещенногоФайла.Адрес,ОписаниеПомещенногоФайла.СсылкаНаФайл.Расширение);	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзЭксельНаСервере(Адрес, Расширение)
	
	Объект.РазделыСчетаДепо.Очистить();
	
	ДД = ПолучитьИзВременногоХранилища(Адрес);
	ПолноеИмяФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДД.Записать(ПолноеИмяФайла);
		
	ТД = Новый ТабличныйДокумент;
	ТД.Прочитать(ПолноеИмяФайла);
	УдалитьФайлы(ПолноеИмяФайла);
	
	НомерПервойСтроки = 1;
	КолСтрок = ТД.ВысотаТаблицы;
	
	НомерКолонкиКодРазделаСчета = 1;
	
	Для НомерСтроки=НомерПервойСтроки По КолСтрок Цикл
	
		КодРазделаСчета = ТД.Область(НомерСтроки,НомерКолонкиКодРазделаСчета).Текст;
		НоваяСтрока = Объект.РазделыСчетаДепо.Добавить();
		НоваяСтрока.РазделСчетаДепо = Справочники.РазделыСчетаДепо.НайтиПоКоду(КодРазделаСчета);
	
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти

