#Область ПрограммныйИнтерфейс

// Возвращает актуальную ставку налога по коду дохода
//
// Параметры:
//  КорневойКод			 - СправочникСсылка.ДоходыНДФЛ	 - Ссылка на справочник кодов доходов
//  Резидент			 - Булево						 - Признак резидента
//  ЭтоФизическоеЛицо	 - Булево						 - Признак физического лица
// 
// Возвращаемое значение:
//   - Число - Ставка налога
//
Функция ПолучитьАктуальнуюСтавку(КорневойКод, Резидент, ЭтоФизическоеЛицо) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КорневойКод) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ЭтоФизическоеЛицо Тогда
		Возврат ?(Резидент, КорневойКод.РазмерСтавкиРезидента, КорневойКод.РазмерСтавкиНерезидента);
	Иначе
		Возврат ?(Резидент, КорневойКод.РазмерСтавкиРезидентаЮрЛица, КорневойКод.РазмерСтавкиНерезидентаЮрЛица);
	КонецЕсли;
КонецФункции

#КонецОбласти
