
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает тип режима торгов по наименованию
//
// Параметры:
//  Наименование - Строка	 - Наименование типа режима торгов
// 
// Возвращаемое значение:
//   - СправочникСсылка.ТипыРежимовТоргов - Ссылка на тип режима торгов
//
Функция ТипРежимаТорговПоНаименованию(Знач Наименование) Экспорт
	
	Наименование = СокрЛП(Наименование);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТипыРежимовТоргов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТипыРежимовТоргов КАК ТипыРежимовТоргов
	|ГДЕ
	|	НЕ ТипыРежимовТоргов.ПометкаУдаления
	|	И ТипыРежимовТоргов.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;
	
	Возврат Справочники.ТипыРежимовТоргов.ПустаяСсылка();
	
КонецФункции

#КонецОбласти