&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаФормирования = ТекущаяДата();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПолучитьНастройкиОтправки();
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Объект.НеттоПоручения.Очистить();
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.НайтиПоручения();
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	ОтправитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ИсполнитьПоручения();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПереключательВидимостиНастроекОтправкиНажатие(Элемент)
	Элементы.ГруппаНастройкиОтправки.Видимость = Не Элементы.ГруппаНастройкиОтправки.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДляОтправкиУведомленийПоПочтеПриИзменении(Элемент)
	
	НастройкаДляОтправкиУведомленийПоПочтеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НастройкаДляОтправкиУведомленийПоПочтеПриИзмененииНаСервере()
	Объект.АдресПолучателя = Объект.НастройкаДляОтправкиУведомленийПоПочте.АдресПолучателя;
КонецПроцедуры

&НаКлиенте
Процедура ВнешнийИсточникПриИзменении(Элемент)
	
	ВнешнийИсточникПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВнешнийИсточникПриИзмененииНаСервере()
	Объект.НастройкаДляОтправкиУведомленийПоПочте = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(Объект.ВнешнийИсточник).Настройка;
	НастройкаДляОтправкиУведомленийПоПочтеПриИзмененииНаСервере();
КонецПроцедуры

