#Область ПрограммныйИнтерфейс

// Получает пользователя ОС, аутентифицированного в текущем сеансе.
// Возвращаемое значение:
//   Строка - строка, идентифицирующую пользователя операционной системы при установленном свойстве АутентификацияОС 
//            (например \\domain\user)
Функция ПользовательОС() Экспорт

	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().ПользовательОС;

КонецФункции

// Выполняет действия при обнаружении перемещении базы
// Действия при перемещении базы не частая операция, актуальная для клиент-серверного варианта.
// Изначально для обновления прав на копиях баз для пользовательских сеансов.
Процедура ВыполнитьДействияПриПеремещенииБазы() Экспорт
	
	Если Не ЭтоПользовательскийСеанс() Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Возврат;
	КонецЕсли;
	
	
	ИмяСервера = ПараметрыСеанса.ТекущийКластерСерверов;
	ИмяИБ = ПараметрыСеанса.ТекущаяИнформационнаяБаза;
	СохраненноеИмяСервера = Константы.ТекущийСервер.Получить();
	СохраненноеИмяИБ = Константы.ТекущаяИБ.Получить();
	
	НетСохраненныхЗначений = Не ЗначениеЗаполнено(СохраненноеИмяИБ) Или Не ЗначениеЗаполнено(СохраненноеИмяСервера);
	Если НетСохраненныхЗначений Тогда
		ОбновитьДанныеПоТекущемуРасположениюБазы(ИмяСервера, ИмяИБ);
		Возврат;
	КонецЕсли;
	
	ИмяБазыИзменено = ВРег(СохраненноеИмяИБ) <> ВРег(ИмяИБ);
	ИмяСервераИзменено = ВРег(СохраненноеИмяСервера) <> ВРег(ИмяСервера);
	
	Если ИмяСервераИзменено Тогда
		IPСервераСовпадает = АдресСерверовСовпадает(СохраненноеИмяСервера, ИмяСервера);
	Иначе
		IPСервераСовпадает = Истина;
	КонецЕсли;
	

	БазаПеремещена = Не IPСервераСовпадает Или ИмяБазыИзменено;
	
	
	Если БазаПеремещена Тогда
		ПовыситьПраваПользователямВТестовойБазеПриПеремещении();
		ОбновитьДанныеПоТекущемуРасположениюБазы(ИмяСервера, ИмяИБ);
	КонецЕсли;
	
КонецПроцедуры

// Определяет является ли база боевой или нет
// 
// Возвращаемое значение:
//   Булево   - Истина - база тестовая, Ложь - база боевая
Функция ЭтоТестоваяБаза() Экспорт
	
	ЭтоТестоваяБаза	= Истина;
	ИмяСервера		= ПараметрыСеанса.ТекущийКластерСерверов;
	ИмяИБ			= ПараметрыСеанса.ТекущаяИнформационнаяБаза;
	
	НастройкиСреды = РегистрыСведений.НастройкиСред.НастройкиСреды(ИмяСервера, ИмяИБ);
	
	Если Не НастройкиСреды = Неопределено Тогда
		ЭтоТестоваяБаза = Не НастройкиСреды.Боевая;
	КонецЕсли;
	
	Возврат ЭтоТестоваяБаза;
	
КонецФункции

// Процедура запоминает дату запрета редактирования в одноименную константу
// Параметры:
//  ДатаЗапрета - Дата - Дата запрета редактирования
//  Комментарий - Строка - Комментарий вводимый вручную при установке Даты запрета из обработки
//
Процедура УстановитьДатуЗапретаРедактирования(ДатаЗапрета, Комментарий = Неопределено) Экспорт
	КонстантаДатаЗапрета = Константы.ДатаЗапретаРедактирования.СоздатьМенеджерЗначения();
	КонстантаДатаЗапрета.ДополнительныеСвойства.Вставить("Комментарий", Комментарий);
	КонстантаДатаЗапрета.Значение = ДатаЗапрета;
	КонстантаДатаЗапрета.Записать();
КонецПроцедуры

#КонецОбласти

// Определяет, является ли текущий сеанс тонким или толстым клиентом
//
// Возвращаемое значение:
//   Булево   - текущий сеанс является тонким или толстым клиентом
//
Функция ЭтоПользовательскийСеанс()

	ИмяПриложения = ПолучитьТекущийСеансИнформационнойБазы().ИмяПриложения;
	Если ВРег(Лев(ИмяПриложения, 4)) = "1CV8" Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;

КонецФункции

#Область СлужебныеПроцедурыИФункции

// Изменяет роли пользователей, которые имеют право-признак ПолныеПраваДляDEV, добавляя набор прав
Процедура ПовыситьПраваПользователямВТестовойБазеПриПеремещении()
	Если ЭтоТестоваяБаза() Тогда
		Обработки.ПовышениеПравДляРазработчиков.Создать().ПовыситьПраваПользователей();
	КонецЕсли;
КонецПроцедуры

// Выполняет установку констант
Процедура ОбновитьДанныеПоТекущемуРасположениюБазы(ИмяСервера, ИмяИБ)
	Константы.ТекущийСервер.Установить(ИмяСервера);
	Константы.ТекущаяИБ.Установить(ИмяИБ);
КонецПроцедуры

// Проверяет факт изменения серверов по адресу, а в случае несовпадения и по ip
// Параметры:
//  СохраненноеИмяСервера  - Строка - сохраненная в базе строка соединения с именами серверов,
//                  например "server1; server2"
//  ИмяСервера  - Строка - текущая строка соединения с именами серверов,
//                  например "server1; server2"
//
// Возвращаемое значение:
//   Булево   - Истина - адреса совпадают, Ложь - адреса не совпадают
Функция АдресСерверовСовпадает(СохраненноеИмяСервера, ИмяСервера)
	
	Разделитель = ",";
	Если СтрНайти(СохраненноеИмяСервера, ",") = 0 Тогда
		Разделитель = ";";
	КонецЕсли;
	СохраненныеСерверы = СтрРазделить(СохраненноеИмяСервера, Разделитель, Ложь);
	Для Счетчик = 0 По СохраненныеСерверы.ВГраница() Цикл
		// здесь может быть имя сервера в формате: [<протокол>://]<адрес_сервера>[:<порт>]
		СохраненныеСерверы[Счетчик] = КоннекторHTTP.РазобратьURL(СокрЛП(СохраненныеСерверы[Счетчик])).Сервер;
	КонецЦикла;
	НовыеСерверы = СтрРазделить(ИмяСервера, ";", Ложь);
	Для Счетчик = 0 По НовыеСерверы.ВГраница() Цикл
		НовыеСерверы[Счетчик] = КоннекторHTTP.РазобратьURL(СокрЛП(НовыеСерверы[Счетчик])).Сервер;
	КонецЦикла;

	Для Каждого СтарыйСервер Из СохраненныеСерверы Цикл
		Для Каждого НовыйСервер Из НовыеСерверы Цикл
			ИмяСервераСовпадает = ВРег(НовыйСервер) = ВРег(СтарыйСервер);
			Если ИмяСервераСовпадает Тогда
				// по крайней мере один из серверов тот же самый
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// ни один из серверов по имени не совпал - делаем запрос по IP.
	Текст = СтрШаблон("Сохраненные серверы строки соединения <%2> отличаются от строки соединения клиента <%1>. Уточняются IP серверов.",
		ИмяСервера, СохраненноеИмяСервера);
	ЗаписьЖурналаРегистрации("СравнитьIPСерверов", УровеньЖурналаРегистрации.Информация, , , Текст);
	Для Счетчик = 0 По СохраненныеСерверы.ВГраница() Цикл
		СохраненныеСерверы[Счетчик] = АдресIPПоИмениСервера(СохраненныеСерверы[Счетчик]);
	КонецЦикла;
	Для Счетчик = 0 По НовыеСерверы.ВГраница() Цикл
		НовыеСерверы[Счетчик] = АдресIPПоИмениСервера(НовыеСерверы[Счетчик]);
	КонецЦикла;
	
	Для Каждого СтарыйСервер Из СохраненныеСерверы Цикл
		Для Каждого НовыйСервер Из НовыеСерверы Цикл
			IPСервераСовпадает = ЗначениеЗаполнено(НовыйСервер) И ЗначениеЗаполнено(СтарыйСервер) И НовыйСервер = СтарыйСервер;
			Если IPСервераСовпадает Тогда
				// по крайней мере один из серверов тот же самый
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает ip-адрес сервера
// Параметры:
//  ИмяСервера  - Строка - адрес сервера, например "server1"
//
// Возвращаемое значение:
//  Строка - ip адреса, например "12.12.12.12"
Функция АдресIPПоИмениСервера(ИмяСервера)
	Адрес = "";
	Попытка
		wmi = ПолучитьCOMОбъект("winmgmts:{impersonationLevel=impersonate}!\\.\root\cimv2");
		Текст = СтрШаблон("Select * From Win32_PingStatus where Address = '%1' and ResolveAddressNames = True", ИмяСервера);
		oColPings = wmi.ExecQuery(Текст);
		Для Каждого objStatus Из oColPings Цикл 
			Если objStatus.StatusCode = 0 Тогда
				Адрес = objStatus.ProtocolAddress;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Исключение
		Текст = СтрШаблон("Не удалось получить IP-адрес для сервера <%1>", ИмяСервера);
		ЗаписьЖурналаРегистрации("АдресIPПоИмениСервера", УровеньЖурналаРегистрации.Информация, , , Текст);
	КонецПопытки;
	Возврат Адрес;
КонецФункции

#КонецОбласти