
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = СокрЛП(Объект.Владелец.Наименование);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КлиринговыйСчетПриИзменении(Элемент)
	КлиринговыйСчетПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КлиринговыйСчетПриИзмененииНаСервере()
	Объект.КлиринговаяОрганизация = Объект.КлиринговыйСчет.КлиринговаяОрганизация;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаименование(Элемент)
	Наименование = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Владелец, "Наименование");
	Объект.Наименование = СокрЛП(Наименование);
КонецПроцедуры

#КонецОбласти
