#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЖурналОтправлений(Команда)
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		
		Элементы.Список.Обновить();
		ПараметрыФормы = Новый Структура;
		Отбор = ОтборНаСервере(Элементы.Список.ТекущиеДанные.GUIDПлатежа);
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ИмяРегистра = "ЖурналИсходящихСообщенийKafka";
		ОткрытьФорму("РегистрСведений." + ИмяРегистра + ".ФормаСписка", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ОтборНаСервере(Знач GUIDПлатежа)
	
	Возврат Документы.ПлатежнаяОперация.ОтборПоРеквизитуОтправляемыйОбъектKafka(GUIDПлатежа);
	
КонецФункции

#КонецОбласти
