
&НаСервере
Функция ПодготовитьСтруктуруХранилища()
	 Значения = Новый Структура;
	 Значения.Вставить("Периодичность"    , Объект.Периодичность);
	 Возврат Значения;
Конецфункции

&НаКлиенте
Процедура Установить(Команда)
	 Заголовок = "Периодичность:"+ Объект.Периодичность;
	 ЗначениеВыбора = Новый Структура;
	 ЗначениеВыбора.Вставить("Значения", ПодготовитьСтруктуруХранилища());
	 ЗначениеВыбора.Вставить("ЗаголовокНастроек", Заголовок);
	 
	 ОповеститьОВыборе(ЗначениеВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Параметры.НастройкиАлгоритма)=Тип("Структура") тогда
		
		Настройки = Параметры.НастройкиАлгоритма;
		
		Если Настройки.Свойство("Значения") тогда
			
			Настройки.Значения.Свойство("Периодичность"    , Объект.Периодичность);
			Если НЕ ЗначениеЗаполнено(Объект.Периодичность) Тогда
				Объект.ТипПериода = Перечисления.Периодичность.Квартал;
			КонецЕсли;
			
		КонецЕсли;                                     
		
	КонецЕсли;
КонецПроцедуры

//Проверка расчета

&НаСервере
Процедура СчитатьНастройки()
	Настройки = Объект.НачислениеВознаграждения.ДоговорКонтрагента.НастройкиАлгоритма.Получить();
	
	Если Настройки.Свойство("Значения") тогда
			
		Настройки.Значения.Свойство("Периодичность"       , Объект.Периодичность);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Считать(Команда)
	СчитатьНастройки();
КонецПроцедуры

Процедура ЗаписатьНастройкиСервер()
	ОбъектДоговор = Объект.НачислениеВознаграждения.ДоговорКонтрагента.ПолучитьОбъект();
	ОбъектДоговор.НастройкиАлгоритма = Новый ХранилищеЗначения(Новый Структура("Значения,ЗаголовокНастроек", ПодготовитьСтруктуруХранилища(),Заголовок));
	ОбъектДоговор.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНастройкиСервер();
КонецПроцедуры


