Перем СправкаРасчетОбластьСтрока;
Перем Календарь;

Перем тзОшибки;
Перем ТаблицаКотировокПоОсновнымРынкам;
Перем ДанныеОПотоках;
Перем ЗначенияМедиан;

#Область МЕТОДЫ_БИБЛИОТЕКИ_СТАНДАРТНЫХ_ПОДСИСТЕМ

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.1.2.1");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.01";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Алгоритм определения справедливой стоимости для НПФ Атомфонд'");
	
	Команда.Идентификатор = "ФормаНастройки";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Истина;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти

#Область DevOps
Процедура ЗагрузитьНастройки(ПараметрыРегистрации) Экспорт
	
	
КонецПроцедуры
#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ТекущиеКотировкиПоПравилу(Мандат, Дата, Правило, СписокБирж,  СписокЦБ, ТекстОшибок) Экспорт

	ОтправитьЛог = Ложь;
	
	Макет	= ПолучитьМакет("СправкаРасчет");
	
	СправкаРасчет	= Новый ТабличныйДокумент;
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	
	СтруктураНастроек = НастройкиАлгоритма(Правило.НастройкиАлгоритма);
		
	МакетЛога = ПолучитьМакет("Лог");
	Лог = Новый ТабличныйДокумент;
	
	Шапка 	= МакетЛога.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Дата			= Дата;
	Лог.Вывести(Шапка);
	
	ЗаголовокТаблицы = МакетЛога.ПолучитьОбласть("ЗаголовокТаблицы");
	Лог.Вывести(ЗаголовокТаблицы);
	
	СтрокаТаблицыЛога = МакетЛога.ПолучитьОбласть("СтрокаТаблицы");	
	
	Календарь	= СтруктураНастроек.БиржевойКалендарь;
	// + FVasiliev IMDEV-8611 30.04.2026 
	//Календарь	= ?(Календарь.Пустая(), Справочники.ПроизводственныеКалендари.РегламентированныйКалендарь, Календарь);
	Календарь	= ?(НЕ ЗначениеЗаполнено(Календарь), Справочники.ПроизводственныеКалендари.РегламентированныйКалендарь, Календарь);
	// - FVasiliev IMDEV-8611 30.04.2026
	
	НачалоПериода = КалендарныеГрафики.ПолучитьСледующуюРабочуюДату(Календарь, Дата, -9);
	КонецПериода  = КалендарныеГрафики.ПолучитьПоследнийРабочийДеньПериода(Календарь, НачалоПериода, Дата);
	
	ТаблицаКотировокПоОсновнымРынкам = ПодготовитьДанныеДляРасчетаММБВ(НачалоПериода, КонецПериода, СписокЦБ, СтруктураНастроек);
	ТаблицаКотировокНРД = ПодготовитьДанныеДляРасчетаНРД(НачалоПериода, КонецПериода, СписокЦБ, СтруктураНастроек);
	// + FVasiliev IMDEV-8611 30.04.2026 
	ТаблицаКотировокОценщик = ПодготовитьДанныеДляРасчетаОценщик(КонецПериода, КонецПериода, СписокЦБ, СтруктураНастроек);
	СтруктураЦенПоСпредам = Неопределено;
	// - FVasiliev IMDEV-8611 30.04.2026
		
	ТаблицаКотировок = ТаблицаКотировокПоОсновнымРынкам.Скопировать();
	ТаблицаКотировок.Очистить();
	ТаблицаКотировок.Колонки.Добавить("ОпределяемаяКотировка", Новый ОписаниеТипов("Число"));
	ТаблицаКотировок.Колонки.Добавить("УровеньЦены", Новый ОписаниеТипов("Число"));
	ТаблицаКотировок.Колонки.Добавить("НаименованиеКотировки", Новый ОписаниеТипов("Строка"));
	ТаблицаКотировок.Колонки.Добавить("ДатаОпределения", Новый ОписаниеТипов("Дата"));
	
	// VTB-Borisov  - 06.07.2018 { 
	КотировкиНКД = ПодготовитьДанныеДляРасчетаНКД(Дата, СписокЦБ, СтруктураНастроек);
	// VTB-Borisov  - 06.07.2018 }
	
	СправкаРасчет.Вывести(ОбластьШапка);
	
	Для Каждого СтрокаСпискаЦБ Из СписокЦБ Цикл
		
		ТаблицаКотировокПоАктиву = ТаблицаКотировокПоОсновнымРынкам.Скопировать(Новый Структура("Актив", СтрокаСпискаЦБ));
		
		РеквизитыАктива	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаСпискаЦБ, "ВидАктива, Объект.ISIN");
		
		СправкаРасчетОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
		СправкаРасчетОбластьСтрока.Параметры.Актив		= СтрокаСпискаЦБ;
		СправкаРасчетОбластьСтрока.Параметры.ВидАктива	= РеквизитыАктива.ВидАктива;
		СправкаРасчетОбластьСтрока.Параметры.ИСИН		= РеквизитыАктива.ОбъектISIN;
		
		ЗаполненнаяСтрокаКотировок	= ТаблицаКотировок.Добавить();
		ЗаполненнаяСтрокаКотировок = ЦенаАктиваУровень1(СтруктураНастроек, СтрокаСпискаЦБ, КонецПериода, ТаблицаКотировокПоАктиву, ЗаполненнаяСтрокаКотировок);
		
		Если ЗаполненнаяСтрокаКотировок.ОпределяемаяКотировка = 0 Тогда
			// IMAPPS-11205 -->
			ЦенаАктиваУровень2(СтрокаСпискаЦБ, КонецПериода, СтруктураНастроек, ТаблицаКотировокНРД, ЗаполненнаяСтрокаКотировок, ТаблицаКотировокПоАктиву, Мандат);
			//ЦенаАктиваУровень2(СтрокаСпискаЦБ, КонецПериода, СтруктураНастроек, ТаблицаКотировокНРД, ЗаполненнаяСтрокаКотировок);
			// IMAPPS-11205 <--
		КонецЕсли;
		
	// + FVasiliev IMDEV-8611 30.04.2026 
		Если ЗаполненнаяСтрокаКотировок.ОпределяемаяКотировка = 0 Тогда
			ЦенаАктиваУровень3(СтрокаСпискаЦБ, КонецПериода, СтруктураНастроек, ТаблицаКотировокПоАктиву, ТаблицаКотировокОценщик, ТаблицаКотировокНРД, ЗаполненнаяСтрокаКотировок, СтруктураЦенПоСпредам)	
		КонецЕсли;	
	// - FVasiliev IMDEV-8611 30.04.2026
		
		Если ЗаполненнаяСтрокаКотировок <> Неопределено И ЗаполненнаяСтрокаКотировок.ОпределяемаяКотировка <> 0 Тогда
			
			// алгоритмы определения цены могли взять историческую котировку (определенную по глубине поиска), восстановим НКД на дату рассчета
			//КотировкаНКД = ТаблицаКотировокПоАктиву.НайтиСтроки(Новый Структура("Период", НачалоДня(Дата)));
			//Для Каждого СтрокаКотировки Из КотировкаНКД Цикл
			//	ЗаполненнаяСтрокаКотировок.НКД = СтрокаКотировки.НКД;
			//КонецЦикла;
			//НКД заполняем в конце
			ЗаполненнаяСтрокаКотировок.НКД = 0;
									
			СправкаРасчетОбластьСтрока.Параметры.УровеньЦены	= ЗаполненнаяСтрокаКотировок.УровеньЦены;
			
			СправкаРасчет.Вывести(СправкаРасчетОбластьСтрока);
			
		Иначе
			
			ОтправитьЛог = Истина;
			СтрокаТаблицыЛога.Параметры.Актив = СтрокаСпискаЦБ;
			СтрокаТаблицыЛога.Параметры.ISIN = РеквизитыАктива.ОбъектISIN;
			СтрокаТаблицыЛога.Параметры.УровеньЦены 	= 3;
			Лог.Вывести(СтрокаТаблицыЛога);
			// не расчитанные бумаги тоже выведем. чтобы было понятно
			СправкаРасчетОбластьСтрока.Параметры.УровеньЦены 	= 3;
			СправкаРасчетОбластьСтрока.Параметры.Котировка		= "-";
			СправкаРасчетОбластьСтрока.Параметры.ДатаОпределения= "-";
			СправкаРасчетОбластьСтрока.Параметры.Биржа			= "-";
			СправкаРасчетОбластьСтрока.Параметры.Графа 	= "";
			
			СправкаРасчетОбластьСтрока.Область(1,1,1,13).ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
			СправкаРасчет.Вывести(СправкаРасчетОбластьСтрока);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// IMAPPS-11205 -->
	Если ДанныеОПотоках.Количество() > 0 Тогда
		
		ОбластьШапка	= Макет.ПолучитьОбласть("ШапкаПотоки");		
		СправкаРасчет.Вывести(ОбластьШапка);
		
		Для каждого ТекПоток Из ДанныеОПотоках Цикл	
			Для каждого ТекСтрокаПотока Из ТекПоток.Значение.Поток Цикл
				
				ОбластьСтрока	= Макет.ПолучитьОбласть("СтрокаПотоки");		
				ОбластьСтрока.Параметры.Актив	= ТекПоток.Значение.Наименование;
				ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ТекСтрокаПотока);		
				СправкаРасчет.Вывести(ОбластьСтрока);
				
			КонецЦикла; 			
		КонецЦикла; 	
	КонецЕсли;
	// IMAPPS-11205 <--
	
	//Отправим лог по бумагам, по которым не смогли определить котировки первого уровня
	
	Если ОтправитьЛог и ЗначениеЗаполнено(СтруктураНастроек.ПочтовыйЛогин) и ЗначениеЗаполнено(СтруктураНастроек.EmailПолучателей) Тогда	
		
		Если тзОшибки.Количество()>0 тогда
			ШапкаОшибка 	= МакетЛога.ПолучитьОбласть("ШапкаОшибка");
			Лог.Вывести(ШапкаОшибка);
	
			Для каждого СтрОшибка  Из тзОшибки Цикл
				СтрокаОшибки 	= МакетЛога.ПолучитьОбласть("СтрокаОшибки");
				СтрокаОшибки.Параметры.Ошибка			= СтрОшибка.Ошибка;
				Лог.Вывести(СтрокаОшибки);
			КонецЦикла; 
		КонецЕсли;
		
		 ПараметрыПисьма = Новый Структура("Кому, Тема, Тело,Вложения");
		 ПараметрыПисьма.Тема = "Котировки по портфелю "+ Мандат+" за "+ Формат(Дата,"ДФ=dd.MM.yyyy");
		 ПараметрыПисьма.Кому = СтруктураНастроек.EmailПолучателей;

		 ПутьКФайлу = ПолучитьИмяВременногоФайла("XLS");
		 Лог.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.XLS);
		 		
		 Вложения = Новый Соответствие;
		 ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
		 АдресВложения = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		 Вложения.Вставить("Котировки по портфелю "+ Мандат+" за "+ Формат(Дата,"ДФ=dd.MM.yyyy")+".xls", АдресВложения);
		 
		 ПараметрыПисьма.Вложения = Вложения;
		 
		 ПараметрыПисьма.Тело =  "Котировки по портфелю "+ Мандат+" за "+ Дата;
		 Попытка
			 РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СтруктураНастроек.ПочтовыйЛогин, ПараметрыПисьма);
			 //РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыПисьма);
			 текстРассылки = "Рассылка завершена";
		 Исключение 
			 Сообщения = ПолучитьСообщенияПользователю(Истина);
		 КонецПопытки;
	КонецЕсли;
	
	СправкаРасчет.ОтображатьЗаголовки	= Ложь;
	СправкаРасчет.ОтображатьСетку		= Ложь;
	
	// дозаполним поля для документа
	ТаблицаКотировок.Колонки.Добавить("НоминалОблигации", Новый ОписаниеТипов("Число"));
	ТаблицаКотировок.Колонки.Добавить("КотировкаУУ", Новый ОписаниеТипов("Число"));
	ТаблицаКотировок.Колонки.Добавить("НаименованиеКотировкиУУ", Новый ОписаниеТипов("Строка"));
	ТаблицаКотировок.Колонки.Добавить("БиржаУУ", новый ОписаниеТипов("СправочникСсылка.Биржи"));
	ТаблицаКотировок.Колонки.Добавить("КотировкаВПроцентахУУ", Новый ОписаниеТипов("Число"));
	ТаблицаКотировок.Колонки.Добавить("КотировкаВПроцентахБУ", Новый ОписаниеТипов("Число"));
	ТаблицаКотировок.Колонки.Добавить("ВалютаУУ", новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаКотировок.Колонки.Добавить("ВалютаНКД", новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	Для каждого СтрокаКотировки Из ТаблицаКотировок Цикл
		СтрокаКотировки.НоминалОблигации = Справочники.Облигации.ПолучитьНоминальнуюСтоимость(СтрокаКотировки.Актив, Дата);
		СтрокаКотировки.КотировкаВПроцентахБУ = СтрокаКотировки.ОпределяемаяКотировка;
		Если СтрокаКотировки.НоминалОблигации <> 0 Тогда
			СтрокаКотировки.ОпределяемаяКотировка = СтрокаКотировки.ОпределяемаяКотировка*СтрокаКотировки.НоминалОблигации/100;
		КонецЕсли;
		СтрокаКотировки.КотировкаУУ = СтрокаКотировки.ОпределяемаяКотировка;
		СтрокаКотировки.НаименованиеКотировкиУУ = СтрокаКотировки.НаименованиеКотировки;
		СтрокаКотировки.КотировкаВПроцентахУУ = СтрокаКотировки.КотировкаВПроцентахБУ;
		СтрокаКотировки.БиржаУУ = СтрокаКотировки.Биржа;
		СтрокаКотировки.ВалютаУУ = СтрокаКотировки.Актив.ВалютаНоминальнойСтоимости;
		СтрокаКотировки.ВалютаНКД = СтрокаКотировки.Валюта;
		//СтрокаКотировки.ДатаОпределения = Дата;	
		
		// VTB-Borisov  - 06.07.2018 { 
		Если (СтрокаКотировки.НКД = 0) ИЛИ СтрокаКотировки.НКД = Неопределено Тогда
			мас = КотировкиНКД.НайтиСтроки(Новый Структура("Актив", СтрокаКотировки.Актив));
			Для каждого СтрокаНКД ИЗ мас Цикл
				Если СтрокаНКД.НКД <> 0 Тогда
					СтрокаКотировки.НКД = СтрокаНКД.НКД;
					СтрокаКотировки.ВалютаНКД = СтрокаНКД.Валюта;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// VTB-Borisov  - 06.07.2018 }
		
	КонецЦикла;
	
	
	Возврат Новый Структура("ТаблицаКотировок, СправкаРасчет", ТаблицаКотировок, СправкаРасчет);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СвойствоСтруктуры(Структура, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Если Структура.Свойство(ИмяСвойства) Тогда
		Возврат Структура[ИмяСвойства];
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
КонецФункции

Функция НастройкиАлгоритма(ХранилищеНастроек)
	
	СтруктураНастроек = Новый Структура("масИнБиржи,БиржевойКалендарь,ИмяКолонкиPX_LAST,ПочтовыйЛогин,EmailПолучателей,РасчетныйЦентрНРД, РасчетныйЦентрНРД2, Оценщик");

	//ХранилищеНастроек = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Алгоритм, "ХранилищеНастроек");
	Настройки = ХранилищеНастроек.Получить();
	
	СтруктураНастроек.Вставить("БиржаММВБ", Справочники.Биржи.ПустаяСсылка());
	
	Если ТипЗнч(Настройки) = Тип("Структура") Тогда
		
		СтруктураНастроек.масИнБиржи = СвойствоСтруктуры(Настройки, "масИнБиржи", новый Массив);
		СтруктураНастроек.БиржевойКалендарь = СвойствоСтруктуры(Настройки, "БиржевойКалендарь");
		
		СтруктураНастроек.ПочтовыйЛогин = СвойствоСтруктуры(Настройки, "ПочтовыйЛогин");
		СтруктураНастроек.EmailПолучателей = СвойствоСтруктуры(Настройки, "EmailПолучателей");
		
		СтруктураНастроек.БиржаММВБ = СвойствоСтруктуры(Настройки, "БиржаММВБ", СтруктураНастроек.БиржаММВБ);
		СтруктураНастроек.РасчетныйЦентрНРД = СвойствоСтруктуры(Настройки, "РасчетныйЦентрНРД", СтруктураНастроек.РасчетныйЦентрНРД);
		СтруктураНастроек.РасчетныйЦентрНРД2 = СвойствоСтруктуры(Настройки, "РасчетныйЦентрНРД2", СтруктураНастроек.РасчетныйЦентрНРД2);
		
		СтруктураНастроек.Оценщик = СвойствоСтруктуры(Настройки, "Оценщик", СтруктураНастроек.Оценщик);
	КонецЕсли;
	
	СтруктураНастроек.Вставить("ИмяКолонкиPX_LAST", "ПризнаваемаяКотировка");
	СтруктураНастроек.Вставить("ИмяКолонкиLAST_PRICE", "LASTPRICE");
	
	СтруктураНастроек.Вставить("ИмяКолонкиBID", "ЦенаСпроса");
	СтруктураНастроек.Вставить("ИмяКолонкиCLOSE", "ЦенаЗакрытия"); //ЦенаЗакрытия
	СтруктураНастроек.Вставить("ИмяКолонкиOFFER", "OFFER");
	
	Возврат СтруктураНастроек;

КонецФункции
	
Функция ПодготовитьДанныеДляРасчетаММБВ(НачалоПериода, КонецПериода, СписокЦБ, СтруктураНастроек)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", 	НачалоДня(КонецПериода));
	Запрос.УстановитьПараметр("СписокЦБ", 	СписокЦБ);
	Запрос.УстановитьПараметр("ММВБ",	СтруктураНастроек.БиржаММВБ);
	Запрос.УстановитьПараметр("НРД",	СтруктураНастроек.РасчетныйЦентрНРД);
	
	Запрос.Текст = ПолучитьТекстЗапросаТаблицаКотировокММВБ();
				   
	ОбщегоНазначенияМО.ДобавитьВЛогОтладки(Запрос, "Алгоритм.ОпределениеСправедливойСтоимости.МодульОбъекта:ПодготовитьДанныеДляРасчетаММБВ");
	
	Результат = Запрос.ВыполнитьПакет();	
	Котировки	=  Результат[0].Выгрузить();
	Котировки.Индексы.Добавить("Актив, Период");
	
	Возврат Котировки
	
КонецФункции

Функция ПодготовитьДанныеДляРасчетаНРД(НачалоПериода, КонецПериода, СписокЦБ, СтруктураНастроек)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", 	НачалоДня(КонецПериода));
	Запрос.УстановитьПараметр("СписокЦБ", 	СписокЦБ);
	Запрос.УстановитьПараметр("ММВБ",	СтруктураНастроек.БиржаММВБ);
	Запрос.УстановитьПараметр("НРД",	СтруктураНастроек.РасчетныйЦентрНРД);
	Запрос.УстановитьПараметр("НРД2",	СтруктураНастроек.РасчетныйЦентрНРД2);
	
	Запрос.Текст = ПолучитьТекстЗапросаСырыеКотировкиНРД();
	
	ОбщегоНазначенияМО.ДобавитьВЛогОтладки(Запрос, "Алгоритм.ОпределениеСправедливойСтоимости.МодульОбъекта:ПодготовитьДанныеДляРасчетаНРД");
	
	Результат = Запрос.ВыполнитьПакет();	
	Котировки	=  Результат[0].Выгрузить();
	
	//ДобавитьДопКолонкиВТаблицуКотировок(Котировки);
	
	Котировки.Индексы.Добавить("Актив, Период");
	
	Возврат Котировки
	
КонецФункции

// VTB-Borisov  - 09.07.2018 { 

Функция ПодготовитьДанныеДляРасчетаНКД(НаДату, СписокЦБ, СтруктураНастроек)
	
	СписокБиржи = новый Массив;
//	СписокБиржи.Добавить(СтруктураНастроек.БиржаBVAL);
	СписокБиржи.Добавить(СтруктураНастроек.БиржаММВБ);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоДня(НаДату));
	Запрос.УстановитьПараметр("КонецПериода", 	КонецДня(НаДату));
	Запрос.УстановитьПараметр("СписокЦБ", 		СписокЦБ);
	Запрос.УстановитьПараметр("СписокБиржи",	СписокБиржи);
	
	Запрос.Текст = ПолучитьТекстЗапросаНКД();
	
	ОбщегоНазначенияМО.ДобавитьВЛогОтладки(Запрос, "Алгоритм.ОпределениеСправедливойСтоимости.МодульОбъекта:ПодготовитьДанныеДляРасчетаНКД");
	
	Результат = Запрос.ВыполнитьПакет();	
	Котировки	=  Результат[0].Выгрузить();
	
	Котировки.Индексы.Добавить("Актив");
	
	Возврат Котировки
	
КонецФункции
// VTB-Borisov  - 09.07.2018 }

Функция ПолучитьТекстЗапросаТаблицаКотировокММВБ()
	
	Текст = "ВЫБРАТЬ
	        |	т.Период КАК Период,
	        |	т.Актив,
	        |	т.Биржа,
	        |	т.Валюта,
	        |	т.ПризнаваемаяКотировка,
	        |	т.УровеньКотировальногоЛиста,
	        |	т.ОбъемТоргов,
	        |	т.НКД,
	        |	т.OPENPERIOD,
	        |	т.OPEN,
	        |	т.ЦенаЗакрытия,
	        |	т.CLOSE,
	        |	т.LASTPRICE,
	        |	т.РыночнаяЦена2,
	        |	т.РыночнаяЦена3,
	        |	т.ЦенаСпроса,
	        |	т.OFFER,
	        |	т.NUMTRADES,
			|	т.МинимальнаяЦена,
			|	т.МаксимальнаяЦена,
			|	т.СредневзвешеннаяЦена
	        |ИЗ
	        |	РегистрСведений.КотировкиЦБНаБирже КАК т
	        |ГДЕ
	        |	т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	        |	И т.Актив В (&СписокЦБ)
	        |	И т.Биржа = &ММВБ
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Период";
				   
	Возврат Текст;
	
КонецФункции

Функция ПолучитьТекстЗапросаСырыеКотировкиНРД()
	
	Текст = "ВЫБРАТЬ
	        |	НАЧАЛОПЕРИОДА(КотировкиЦБНаБирже.Период, ДЕНЬ) КАК Период,
	        |	КотировкиЦБНаБирже.Регистратор,
	        |	КотировкиЦБНаБирже.Актив КАК Актив,
	        |	КотировкиЦБНаБирже.Биржа,
	        |	КотировкиЦБНаБирже.Валюта,
	        |	КотировкиЦБНаБирже.ПризнаваемаяКотировка,
			|	КотировкиЦБНаБирже.НомерМетодаРасчета
	        |ИЗ
	        |	РегистрСведений.КотировкиЦБНаБирже КАК КотировкиЦБНаБирже
	        |ГДЕ
	        |	НАЧАЛОПЕРИОДА(КотировкиЦБНаБирже.Период, ДЕНЬ) МЕЖДУ &НачалоПериода И &КонецПериода
	        |	И КотировкиЦБНаБирже.Актив В(&СписокЦБ)
	        |	И КотировкиЦБНаБирже.Биржа in (&НРД , &НРД2)
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Актив,
	        |	Период УБЫВ";
	
	Возврат Текст;
	
КонецФункции

// VTB-Borisov  - 09.07.2018 { 
Функция ПолучитьТекстЗапросаНКД()
	
	Текст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(т.Период, ДЕНЬ) КАК Период,
	|	т.Актив КАК Актив,
	|	т.Биржа,
	|	т.Валюта,
	|	т.НКД
	|ИЗ
	|	РегистрСведений.КотировкиЦБНаБирже КАК т
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(т.Период, ДЕНЬ) МЕЖДУ &НачалоПериода И &КонецПериода
	|	И т.Актив В(&СписокЦБ)
	|	И т.Биржа В(&СписокБиржи)";
	
	Возврат Текст;
	
КонецФункции
// VTB-Borisov  - 09.07.2018 }

Функция СформироватьСправкуРасчет()
	
КонецФункции

#КонецОбласти

Функция ОсновнойРынокАктивен(СтруктураНастроек, НаДату, СтрокаСпискаЦБ, ОсновнойРынок, ТаблицаКотировокПоОсновнымРынкамПоАктиву)
	
	ОсновнойРынокАктивен	= Ложь;
	АктивОбъект = СтрокаСпискаЦБ.Объект;
	
	КоличествоСделок = 0;
	ОбъемТоргов = 0;
	ОбъемТорговВпоследнийДень = 0;
	
	Для Каждого СтрокаТаблицаКотировокПоОсновнымРынкамПоАктиву Из ТаблицаКотировокПоОсновнымРынкамПоАктиву Цикл
		Если СтрокаТаблицаКотировокПоОсновнымРынкамПоАктиву.Биржа = ОсновнойРынок Тогда
			
			КоличествоСделок 	= КоличествоСделок + СтрокаТаблицаКотировокПоОсновнымРынкамПоАктиву.NUMTRADES;
			ОбъемТоргов 		= ОбъемТоргов + СтрокаТаблицаКотировокПоОсновнымРынкамПоАктиву.ОбъемТоргов;
			
			// IMAPPS-15948 ++
			Если СтрокаТаблицаКотировокПоОсновнымРынкамПоАктиву.Период = НаДату Тогда
				ОбъемТорговВпоследнийДень = СтрокаТаблицаКотировокПоОсновнымРынкамПоАктиву.ОбъемТоргов;
			КонецЕсли;
			// IMAPPS-15948 --
			
		КонецЕсли;
	КонецЦикла;
	
	// IMAPPS-15948 ++
	//ОсновнойРынокАктивен = (КоличествоСделок >= 10) И (ОбъемТоргов/10 >= 500000);
	ОсновнойРынокАктивен = (ОбъемТорговВпоследнийДень > 0) И (КоличествоСделок >= 10) И (ОбъемТоргов >= 500000);
	// IMAPPS-15948 --
	
	Возврат ОсновнойРынокАктивен;
	
КонецФункции

Функция ЦенаАктиваУровень1(СтруктураНастроек, СтрокаСпискаЦБ, Знач КонецПериода, ТаблицаКотировокПоАктиву, ЗаполненнаяСтрокаКотировок)
	
	ОпределяемаяКотировка 	= 0;
	ОсновнойРынокАктивен	= Ложь;
	АктивОбъект 			= СтрокаСпискаЦБ.Объект;
	
	Если ЗаполненнаяСтрокаКотировок.ОпределяемаяКотировка <> 0 Тогда Возврат ЗаполненнаяСтрокаКотировок; КонецЕсли;
	
	ОсновнойРынок = СтруктураНастроек.БиржаММВБ;
	ОсновнойРынокАктивен	= ОсновнойРынокАктивен(СтруктураНастроек, КонецПериода, СтрокаСпискаЦБ, ОсновнойРынок, ТаблицаКотировокПоАктиву);
	
	// + FVasiliev IMDEV-8611 30.04.2026 
	//Не проверяя активный рынок, если бумага куплена при первичном размещении, что определяется отсутсвием котировок, берем цену размещения
	Если ТаблицаКотировокПоАктиву.Количество() = 0 Тогда
		СтруктураР = ОпределитьЦенуПервичногоРазмещения(СтрокаСпискаЦБ, КонецПериода);
		ОпределяемаяКотировка = СтруктураР.Цена;
		ЗаполненнаяСтрокаКотировок.УровеньЦены = 1;
		
		//ЗаполнитьЗначенияСвойств(ЗаполненнаяСтрокаКотировок, СтрокаТаблицаКотировокПоАктиву);
		ЗаполненнаяСтрокаКотировок.Актив = СтрокаСпискаЦБ;
		ЗаполненнаяСтрокаКотировок.Биржа = ОсновнойРынок;
		ЗаполненнаяСтрокаКотировок.Валюта = СтруктураР.Валюта;
		ЗаполненнаяСтрокаКотировок.Период = КонецПериода;
		ЗаполненнаяСтрокаКотировок.НаименованиеКотировки = "Цена первичного размещения";
		ЗаполненнаяСтрокаКотировок.ОпределяемаяКотировка = ОпределяемаяКотировка;
		ЗаполненнаяСтрокаКотировок.ДатаОпределения 		 = СтруктураР.Дата;
		
		СправкаРасчетОбластьСтрока.Параметры.Графа 	= "Цена первичного размещения";
		СправкаРасчетОбластьСтрока.Параметры.Котировка			= ОпределяемаяКотировка;
		СправкаРасчетОбластьСтрока.Параметры.ДатаОпределения	= СтруктураР.Дата;
		СправкаРасчетОбластьСтрока.Параметры.Биржа = ОсновнойРынок;
	Иначе
	// - FVasiliev IMDEV-8611 30.04.2026
		Если ОсновнойРынокАктивен Тогда
			ЗаполненнаяСтрокаКотировок = КотировкаПоВыбПолю(СтруктураНастроек, СтрокаСпискаЦБ, КонецПериода, ТаблицаКотировокПоАктиву, ЗаполненнаяСтрокаКотировок);
			СправкаРасчетОбластьСтрока.Параметры.Биржа			= ОсновнойРынок;
		КонецЕсли;
		
		СправкаРасчетОбластьСтрока.Параметры.РынокАктивен	= ОсновнойРынокАктивен;
		
		Если ЗаполненнаяСтрокаКотировок.ОпределяемаяКотировка <> 0 И ОсновнойРынокАктивен Тогда  
			ЗаполненнаяСтрокаКотировок.УровеньЦены = 1;
		Иначе
			ЗаполненнаяСтрокаКотировок.ОпределяемаяКотировка = 0;
			ЗаполненнаяСтрокаКотировок.УровеньЦены = 0;
		КонецЕсли;
	// + FVasiliev IMDEV-8611 30.04.2026 
	КонецЕсли;	
	// - FVasiliev IMDEV-8611 30.04.2026
	
	Возврат ЗаполненнаяСтрокаКотировок;
	
КонецФункции

Процедура ЦенаАктиваУровень2(Актив, Дата, СтруктураНастроек, ТаблицаКотировокНРД, ЗаполненнаяСтрокаКотировок, ТаблицаКотировокПоАктиву, Мандат)
			
	ЦенаНРД = 0;
	ВерсияРасчетаНРД = "";
	DCF = 0;
	ОпределяемаяКотировка = 0;
	// + FVasiliev IMDEV-8611 07.05.2026 
	ЭтоРублеваяОблигация = (Актив.ВидАктива.ПринадлежитЭлементу(ПланыВидовХарактеристик.ВидыАктивов.Облигации)
	И Актив.ВалютаНоминальнойСтоимости = Справочники.Валюты.RUB);
	// - FVasiliev IMDEV-8611 07.05.2026
	
	Если ЗначениеЗаполнено(СтруктураНастроек.РасчетныйЦентрНРД2) Тогда
		НайденныеСтрокиНРД	= ТаблицаКотировокНРД.НайтиСтроки(Новый Структура("Актив, Период, Биржа", Актив, НачалоДня(Дата), СтруктураНастроек.РасчетныйЦентрНРД2));
		Для каждого НайденнаяСтрока из НайденныеСтрокиНРД Цикл
			
			// + FVasiliev IMDEV-8611 07.05.2026 
			Если ЭтоРублеваяОблигация И НайденнаяСтрока.НомерМетодаРасчета = 3 Тогда
				Продолжить;
			КонецЕсли;
			// - FVasiliev IMDEV-8611 07.05.2026
			
			ЦенаНРД 	= НайденнаяСтрока.ПризнаваемаяКотировка;
			
			Если ЦенаНРД <> 0 Тогда
				ВерсияРасчетаНРД = "в.2";
				СтрокаКотировокПоНРД	= НайденнаяСтрока;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если ЦенаНРД = 0 И ЗначениеЗаполнено(СтруктураНастроек.РасчетныйЦентрНРД) Тогда
		НайденныеСтрокиНРД	= ТаблицаКотировокНРД.НайтиСтроки(Новый Структура("Актив, Период, Биржа", Актив, НачалоДня(Дата), СтруктураНастроек.РасчетныйЦентрНРД));
		Для каждого НайденнаяСтрока из НайденныеСтрокиНРД Цикл
			
			// + FVasiliev IMDEV-8611 07.05.2026 
			Если ЭтоРублеваяОблигация И НайденнаяСтрока.НомерМетодаРасчета = 3 Тогда
				Продолжить;
			КонецЕсли;
			// - FVasiliev IMDEV-8611 07.05.2026
			
			ЦенаНРД 	= НайденнаяСтрока.ПризнаваемаяКотировка;
			
			Если ЦенаНРД <> 0 Тогда
				ВерсияРасчетаНРД = "в.1";
				СтрокаКотировокПоНРД	= НайденнаяСтрока;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	ОпределяемаяКотировка		= ЦенаНРД;
	
	Если ЦенаНРД <> 0 Тогда
		ДатаОпределения				= СтрокаКотировокПоНРД.Период;
		УровеньЦены					= 2;
		ИмяГрафы					= "НРД "+ВерсияРасчетаНРД;
		
		ЗаполнитьЗначенияСвойств(ЗаполненнаяСтрокаКотировок, СтрокаКотировокПоНРД);
		ЗаполненнаяСтрокаКотировок.ОпределяемаяКотировка	= ОпределяемаяКотировка;
		ЗаполненнаяСтрокаКотировок.ДатаОпределения			= ДатаОпределения;
		ЗаполненнаяСтрокаКотировок.УровеньЦены				= УровеньЦены;
		
		СправкаРасчетОбластьСтрока.Параметры.Биржа			= "Расчетный центр НРД ("+ВерсияРасчетаНРД+")";
		СправкаРасчетОбластьСтрока.Параметры.Котировка		= ОпределяемаяКотировка;
		СправкаРасчетОбластьСтрока.Параметры.ДатаОпределения= ДатаОпределения;
		
		СправкаРасчетОбластьСтрока.Параметры.Графа			= ИмяГрафы;
		СправкаРасчетОбластьСтрока.Параметры.УровеньЦены	= УровеньЦены;
		СправкаРасчетОбластьСтрока.Параметры.ЦенаНРД		= ОпределяемаяКотировка;
		
		Возврат
		// IMAPPS-11205 -->	
	Иначе   
		
		ВидАктива	= Актив.ВидАктива;	
	
		Если ВидАктива.ПринадлежитЭлементу(ПланыВидовХарактеристик.ВидыАктивов.Облигации) Тогда
			
			СтруктураЦенПоСпредам	= РасчетФинансовыхПоказателей.ЦенаОблигацииПоКредитномуСпредуРейтинговойГруппы(Актив, Мандат, Дата, Истина, Истина, ЭтотОбъект);
			
			Если СтруктураЦенПоСпредам.ДанныеРасчета.Количество() > 0 Тогда
				
				ДанныеОПотоках.Вставить(Актив, Новый Структура("Наименование, Поток", Актив.Наименование, СтруктураЦенПоСпредам.ДанныеРасчета.ДенежныйПоток));						
				ОпределяемаяКотировка		= 0;
				ДатаОпределения				= Дата(1, 1, 1);
				УровеньЦены					= 2;
				ИмяГрафы					= "";
				Биржа						= "";				
								
				СтрокаТаблицаКотировокПоАктиву	= ТаблицаКотировокПоАктиву.Найти(НачалоДня(Дата), "Период");
				
				Если СтрокаТаблицаКотировокПоАктиву = Неопределено Тогда
					Возврат ;
				КонецЕсли;
				
				PV = СтруктураЦенПоСпредам.ЦенаМедианаСпред; 
				
				ЦенаСпроса = СтрокаТаблицаКотировокПоАктиву[СтруктураНастроек.ИмяКолонкиBID];
				ЦенаПредложения = СтрокаТаблицаКотировокПоАктиву["OFFER"];
				
				Если PV < ЦенаСпроса Тогда
					ОпределяемаяКотировка		= ЦенаСпроса;
					ИмяГрафы					= "ЦенаСпроса";
					Биржа 						= СтрокаТаблицаКотировокПоАктиву.Биржа;
				ИначеЕсли PV > ЦенаПредложения Тогда
					ОпределяемаяКотировка		= ЦенаПредложения;
					ИмяГрафы					= "ЦенаПредложения";
					Биржа 						= СтрокаТаблицаКотировокПоАктиву.Биржа;
				ИначеЕсли PV >= ЦенаСпроса И PV <= ЦенаПредложения Тогда
					ОпределяемаяКотировка		= PV;
		        	ИмяГрафы					= "DCF по ставке";
					Биржа =                     "DCF по ставке"
				КонецЕсли;	
							
				ДатаОпределения			= Дата;
				УровеньЦены				= 2;
								
				ЗаполненнаяСтрокаКотировок.ОпределяемаяКотировка	= ОпределяемаяКотировка;
				ЗаполненнаяСтрокаКотировок.ДатаОпределения			= ДатаОпределения;
				ЗаполненнаяСтрокаКотировок.УровеньЦены				= УровеньЦены;
				ЗаполненнаяСтрокаКотировок.НаименованиеКотировки    = ИмяГрафы; 
				ЗаполненнаяСтрокаКотировок.период = Дата;
				ЗаполненнаяСтрокаКотировок.Актив = Актив;
				ЗаполненнаяСтрокаКотировок.Валюта  =  Актив.ВалютаНоминальнойСтоимости;
				
				ЗаполнитьЗначенияСвойств(СправкаРасчетОбластьСтрока.Параметры, СтруктураЦенПоСпредам.ДанныеРасчета);
				СправкаРасчетОбластьСтрока.Параметры.Биржа			= Биржа;
				СправкаРасчетОбластьСтрока.Параметры.Котировка		= ОпределяемаяКотировка;
				СправкаРасчетОбластьСтрока.Параметры.ДатаОпределения= ДатаОпределения;			
				СправкаРасчетОбластьСтрока.Параметры.Графа			= ИмяГрафы;
				СправкаРасчетОбластьСтрока.Параметры.УровеньЦены	= УровеньЦены;
				//СправкаРасчетОбластьСтрока.Параметры.DCF		= ОпределяемаяКотировка; //IMAPPS-23480
				//СправкаРасчетОбластьСтрока.Параметры.СтавкаДисконт = (СтруктураЦенПоСпредам.ДанныеРасчета.СтавкаКБД+СтруктураЦенПоСпредам.ДанныеРасчета.Медиана/10000)*100; //IMAPPS-23480
		
			КонецЕсли; 
			Возврат	
			
		// IMAPPS-15948 ++	
	//ИначеЕсли ВидАктива.ПринадлежитЭлементу(ПланыВидовХарактеристик.ВидыАктивов.Акции) и не Актив.Объект.Эмитент.НеРезидент Тогда
	//	
	//	ТаблицаКотировокПоАктиву.Сортировать();
	//	СтрокаТаблицаКотировокПоАктиву	= ТаблицаКотировокПоАктиву.Найти(НачалоДня(Дата), "Период");
	//
	//	ПредыдущаяЦена = СтрокаТаблицаКотировокПоАктиву[СтруктураНастроек.ИмяКолонкиПризнаваемаяКотировка];   					// наиболее поздняя определенная цена долевой ценной бумаги уровня 1 или 2
	//	РыночныйИндикаторНаДату = ;   																							// значение рыночного индикатора на дату определения справедливой стоимости
	//	РыночныйИндикаторНаПредыдущуюДату = ; 																					// значение рыночного индикатора на предыдущую дату определения справедливой стоимости
	//	
	//	ОпределяемаяКотировка = ПредыдущаяЦена * (РыночныйИндикаторНаДату/РыночныйИндикаторНаПредыдущуюДату);
	//	
	// 	ДатаОпределения			= Дата;
	//	УровеньЦены				= 2;
	//	ИмяГрафы				= "CAPM";
	//	
	//	ЗаполненнаяСтрокаКотировок.ОпределяемаяКотировка	= ОпределяемаяКотировка;
	//	ЗаполненнаяСтрокаКотировок.ДатаОпределения			= ДатаОпределения;
	//	ЗаполненнаяСтрокаКотировок.УровеньЦены				= УровеньЦены;
	//	ЗаполненнаяСтрокаКотировок.НаименованиеКотировки    = "ИмяГрафы"; 
	//	ЗаполненнаяСтрокаКотировок.период = Дата;
	//	ЗаполненнаяСтрокаКотировок.Актив = Актив;
	//	ЗаполненнаяСтрокаКотировок.Валюта  =  Актив.ВалютаНоминальнойСтоимости;
	//	
	//	ЗаполнитьЗначенияСвойств(СправкаРасчетОбластьСтрока.Параметры, СтруктураЦенПоСпредам.ДанныеРасчета);
	//	СправкаРасчетОбластьСтрока.Параметры.Биржа			= Биржа;
	//	СправкаРасчетОбластьСтрока.Параметры.Котировка		= ОпределяемаяКотировка;
	//	СправкаРасчетОбластьСтрока.Параметры.ДатаОпределения= ДатаОпределения;			
	//	СправкаРасчетОбластьСтрока.Параметры.Графа			= ИмяГрафы;
	//	СправкаРасчетОбластьСтрока.Параметры.УровеньЦены	= УровеньЦены;
	//	СправкаРасчетОбластьСтрока.Параметры.DCF		= ОпределяемаяКотировка;
				
	//КонецЕсли; 
	//		Возврат	
		КонецЕсли;
		// IMAPPS-11205 <--		

	КонецЕсли;
	
	Если ОпределяемаяКотировка = 0 Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Функция КотировкаПоВыбПолю(СтруктураНастроек, СтрокаСпискаЦБ, КонецПериода, ТаблицаКотировокПоАктиву, ЗаполненнаяСтрокаКотировок)
	
	СтрокаТаблицаКотировокПоАктиву	= ТаблицаКотировокПоАктиву.Найти(НачалоДня(КонецПериода), "Период");
	
	Если СтрокаТаблицаКотировокПоАктиву = Неопределено Тогда
		Возврат ЗаполненнаяСтрокаКотировок;
	КонецЕсли;
	
	ЦенаСпроса = СтрокаТаблицаКотировокПоАктиву[СтруктураНастроек.ИмяКолонкиBID];
	СредневзвешеннаяЦена = СтрокаТаблицаКотировокПоАктиву["СредневзвешеннаяЦена"];
	
	МинимальнаяЦена = СтрокаТаблицаКотировокПоАктиву["МинимальнаяЦена"];
	МаксимальнаяЦена = СтрокаТаблицаКотировокПоАктиву["МаксимальнаяЦена"];
	ЦенаOffer = СтрокаТаблицаКотировокПоАктиву["OFFER"];
	ЦенаClose = СтрокаТаблицаКотировокПоАктиву["Close"];
	//Сообщить(""  + СтрокаСпискаЦБ.Объект+ ", ЦенаСпроса " + ЦенаСпроса + ", МинимальнаяЦена " + МинимальнаяЦена + ", МаксимальнаяЦена " + МаксимальнаяЦена + ", ЦенаOffer " + ЦенаOffer + ", СредневзвешеннаяЦена " + СредневзвешеннаяЦена);
	
	Если ЦенаСпроса > 0 И МинимальнаяЦена <= ЦенаСпроса И ЦенаСпроса <= МаксимальнаяЦена Тогда
		ОпределяемаяКотировка = ЦенаСпроса;
		ВыбПоле = "ЦенаСпроса";
	ИначеЕсли 
		// IMAPPS-11205 -->
		СредневзвешеннаяЦена = 0 и МинимальнаяЦена = 0 и МаксимальнаяЦена = 0 Тогда
		Возврат ЗаполненнаяСтрокаКотировок;
	ИначеЕсли ЦенаСпроса <= СредневзвешеннаяЦена И СредневзвешеннаяЦена <= ЦенаOffer Тогда
		ОпределяемаяКотировка = СредневзвешеннаяЦена;
		ВыбПоле = "СредневзвешеннаяЦена";	
	ИначеЕсли  СредневзвешеннаяЦена <= ЦенаСпроса и ЦенаСпроса  <= ЦенаOffer Тогда
		ОпределяемаяКотировка = ЦенаСпроса;
		ВыбПоле = "ЦенаСпроса";
	ИначеЕсли  ЦенаСпроса  <= ЦенаOffer  и ЦенаOffer <= СредневзвешеннаяЦена Тогда 
		ОпределяемаяКотировка = ЦенаClose;
		ВыбПоле = "ЦенаЗакрытия";	
		//СредневзвешеннаяЦена > 0 Тогда
		//ОпределяемаяКотировка = СредневзвешеннаяЦена;
		//ВыбПоле = "СредневзвешеннаяЦена";
		// IMAPPS-11205 <--		
	Иначе
		Возврат ЗаполненнаяСтрокаКотировок;
	КонецЕсли;
		//Сообщить("" + ОпределяемаяКотировка);
		
	ЗаполнитьЗначенияСвойств(ЗаполненнаяСтрокаКотировок, СтрокаТаблицаКотировокПоАктиву);
	ЗаполненнаяСтрокаКотировок.НаименованиеКотировки = ВыбПоле;
	ЗаполненнаяСтрокаКотировок.ОпределяемаяКотировка = ОпределяемаяКотировка;
	ЗаполненнаяСтрокаКотировок.ДатаОпределения 		 = КонецПериода;
	
	СправкаРасчетОбластьСтрока.Параметры.Графа 	= ВыбПоле;
	СправкаРасчетОбластьСтрока.Параметры.Котировка			= ОпределяемаяКотировка;
	СправкаРасчетОбластьСтрока.Параметры.ДатаОпределения	= КонецПериода;
	СправкаРасчетОбластьСтрока.Параметры.BID 		= ЦенаСпроса;
	СправкаРасчетОбластьСтрока.Параметры.Min 		= МинимальнаяЦена;
	СправкаРасчетОбластьСтрока.Параметры.Max 		= МаксимальнаяЦена;
	СправкаРасчетОбластьСтрока.Параметры.WAP  		= СредневзвешеннаяЦена;
			
	Возврат ЗаполненнаяСтрокаКотировок;
	
КонецФункции

// FVasiliev IMDEV-8611 30.04.2026 
Процедура ЦенаАктиваУровень3(Актив, Дата, СтруктураНастроек, ТаблицаКотировокПоАктиву, ТаблицаКотировокОценщик, ТаблицаКотировокНРД, ЗаполненнаяСтрокаКотировок, СтруктураЦенПоСпредам)
			
	ЦенаОценщик = 0;
	ОпределяемаяКотировка = 0;
	ЦенаНРД = 0;
	
	Если ЗначениеЗаполнено(СтруктураНастроек.РасчетныйЦентрНРД2) Тогда
		НайденныеСтрокиНРД	= ТаблицаКотировокНРД.НайтиСтроки(Новый Структура("Актив, Период, Биржа, НомерМетодаРасчета", Актив, НачалоДня(Дата), СтруктураНастроек.РасчетныйЦентрНРД2, 3));
		Для каждого НайденнаяСтрока из НайденныеСтрокиНРД Цикл
			
			ЦенаНРД 	= НайденнаяСтрока.ПризнаваемаяКотировка;
			
			Если ЦенаНРД <> 0 Тогда
				ВерсияРасчетаНРД = "в.2";
				СтрокаКотировокПоНРД	= НайденнаяСтрока;
				
				ОсновнойРынок = СтруктураНастроек.РасчетныйЦентрНРД2;
				
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если ЦенаНРД <> 0 Тогда
		ОпределяемаяКотировка		= ЦенаНРД;
		Если ОпределяемаяКотировка = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ДатаОпределения				= СтрокаКотировокПоНРД.Период;
		УровеньЦены					= 3;
		ИмяГрафы					= "НРД";//+ВерсияРасчетаНРД;
			
		ЗаполнитьЗначенияСвойств(ЗаполненнаяСтрокаКотировок, СтрокаКотировокПоНРД);
		ЗаполненнаяСтрокаКотировок.ОпределяемаяКотировка	= ОпределяемаяКотировка;
		ЗаполненнаяСтрокаКотировок.ДатаОпределения			= ДатаОпределения;
		ЗаполненнаяСтрокаКотировок.УровеньЦены				= УровеньЦены;
		ЗаполненнаяСтрокаКотировок.НаименованиеКотировки 	= ИмяГрафы;
			
		СправкаРасчетОбластьСтрока.Параметры.Биржа			= "Расчетный центр НРД ("+ВерсияРасчетаНРД+")";
		СправкаРасчетОбластьСтрока.Параметры.Котировка		= ОпределяемаяКотировка;
		СправкаРасчетОбластьСтрока.Параметры.ДатаОпределения= ДатаОпределения;
		
		СправкаРасчетОбластьСтрока.Параметры.Графа			= ИмяГрафы;
		СправкаРасчетОбластьСтрока.Параметры.УровеньЦены	= УровеньЦены;
		СправкаРасчетОбластьСтрока.Параметры.ЦенаНРД		= ОпределяемаяКотировка;
			
		Возврат;
		
	КонецЕсли;	
	
	
	  		// IMAPPS-11191 -->
	   Если ЗаполненнаяСтрокаКотировок.ОпределяемаяКотировка = 0
		И СтруктураЦенПоСпредам <> Неопределено
		И СтруктураЦенПоСпредам.ЦенаМедианаСпред <> 0 Тогда
		
		СтрокаТаблицаКотировокПоАктиву	= ТаблицаКотировокПоАктиву.Найти(НачалоДня(Дата), "Период");

		ЦенаСпроса = СтрокаТаблицаКотировокПоАктиву["ЦенаСпроса"];
		ЦенаПредложения = СтрокаТаблицаКотировокПоАктиву["OFFER"];
		ЦенаЗакрытия = СтрокаТаблицаКотировокПоАктиву["ЦенаЗакрытия"];
		РыночнаяЦена2 = СтрокаТаблицаКотировокПоАктиву["РыночнаяЦена2"];
		МаксимальнаяЦена = СтрокаТаблицаКотировокПоАктиву["МаксимальнаяЦена"]; 	
		МинимальнаяЦена = СтрокаТаблицаКотировокПоАктиву["МинимальнаяЦена"];

		ТЗ_ДенежныйПоток = СтруктураЦенПоСпредам.ДанныеРасчета.ДенежныйПоток;
		
		//
		ТЗ_ДенежныйПоток.Очистить();
		СтрокаОблигации = Новый Структура;
		СтрокаОблигации.Вставить("Актив", Актив);
		СтрокаОблигации.Вставить("Объект", Актив.Объект);
		ДобавитьВыплатыКупонногоДохода(СтрокаОблигации, ТЗ_ДенежныйПоток, СтруктураЦенПоСпредам.ДанныеРасчета.Мандат, СтруктураЦенПоСпредам.ДанныеРасчета.Дата);
		ДобавитьВыплатыТела(СтрокаОблигации, ТЗ_ДенежныйПоток); 		
		//
		
		
		РасчетФинПоказателейДокумент = Документы.РасчетФинансовыхПоказателейОблигаций.СоздатьДокумент();
		РасчетФинПоказателейДокумент.Дата = СтруктураЦенПоСпредам.ДанныеРасчета.Дата;
		РасчетФинПоказателейДокумент.Портфель = СтруктураЦенПоСпредам.ДанныеРасчета.Мандат;
		СписокАктивов = Новый Массив;
		СписокАктивов.Добавить(Актив);
		ДанныеПоСписку	= РасчетФинПоказателейДокумент.ДанныеПоСпискуАктивов(СписокАктивов, СтруктураЦенПоСпредам.ДанныеРасчета.Дата);
		ДанныеАктиваДляЗаполненияПотока	= ДанныеПоСписку.Получить(Актив);
		Если ДанныеАктиваДляЗаполненияПотока <> Неопределено Тогда
			ПоследняяСС = ДанныеАктиваДляЗаполненияПотока.Котировка;
		ИНаче
			ПоследняяСС = 0;
		КонецЕсли;
		ОграничитьДенежныйПотокОфертой(Актив, ПоследняяСС, ТЗ_ДенежныйПоток, СтруктураЦенПоСпредам.ДанныеРасчета.Дата);
		
		ТЗ = ТЗ_ДенежныйПоток.Скопировать();
		ТЗ.Колонки.Добавить("КоличествоДней", новый ОписаниеТипов("Число"));
		ТЗ.Колонки.Добавить("СрокДоПогашения", новый ОписаниеТипов("Число"));
		ТЗ.Колонки.Добавить("КБД", новый ОписаниеТипов("Число"));
		ТЗ.Колонки.Добавить("DCF", новый ОписаниеТипов("Число"));
		ТЗ.Колонки.Добавить("КредитныйСпред", новый ОписаниеТипов("Число"));
		Знаменатель = 0;
		
		Рез = ПолучитьКредитныйРейтинг(Актив, Дата);
			Если Рез = "" Тогда
				КредитныйСпред = 0;
			Иначе 
				
				Если Рез = "МинСпред" Тогда		
					КредитныйСпред = ЗначенияМедиан.Получить(Справочники.УровниКредитногоРейтинга.A);
				ИначеЕсли Рез = "Медиана" Тогда		
					КредитныйСпред = ЗначенияМедиан.Получить(Справочники.УровниКредитногоРейтинга.B);
				Иначе
					КредитныйСпред = ЗначенияМедиан.Получить(Справочники.УровниКредитногоРейтинга.C);
				КонецЕсли;	
				КредитныйСпред = Окр(КредитныйСпред, 0);
				КредитныйСпред = КредитныйСпред/100;
				//КредитныйСпред = СтруктураЦенПоСпредам.ДанныеРасчета[Рез]/100;   
			КонецЕсли;

		Для Каждого Стр ИЗ ТЗ Цикл
			Стр.КоличествоДней = ?(стр.Дата - НачалоДня(Дата)<0, 0 ,(стр.Дата - НачалоДня(Дата))/(3600*24));
			Стр.СрокДоПогашения = ?(Стр.КоличествоДней>0, Стр.КоличествоДней, 0)/365;                                                
			Стр.КБД = Окр(СтавкаПоКривойБезрисковойДоходности(СтруктураЦенПоСпредам.ДанныеРасчета.Валюта, Дата, Стр.СрокДоПогашения, Актив)*100,2);
			Стр.КредитныйСпред = КредитныйСпред;   
			Стр.DCF = ?(Стр.КоличествоДней = 0, 0, (Стр.Тело + Стр.КупонныйДоход)/pow(1+(Стр.КБД + Стр.КредитныйСпред)/100, Стр.КоличествоДней/365)); //=(D44+G44)/((1+(L44+M44)/100)^(I44/365))
			Если Стр.СрокДоПогашения > 0 Тогда		
				Знаменатель = Знаменатель + Стр.Тело;
			КонецЕсли;
		КонецЦикла;
		
		PV = ТЗ.Итог("DCF")/Знаменатель*1000 - СтруктураЦенПоСпредам.ДанныеРасчета.Купон;
		PV = PV/10;
		
		Если PV > ЦенаПредложения И ЦенаПредложения <> 0 Тогда
			ОпределяемаяКотировка = ЦенаПредложения;
		ИначеЕсли PV < ЦенаСпроса Тогда 
			ОпределяемаяКотировка = ЦенаСпроса;
		Иначе
			ОпределяемаяКотировка = PV;
		КонецЕсли;
		
		ИмяГрафы				= "DCF по ставке";
		ДатаОпределения			= Дата;
		УровеньЦены				= 3;
		ПодУровеньЦены			= "3.C";
					
		ИмяБиржи	= "Расчетные данные";
			
		ЗаполненнаяСтрокаКотировок.ОпределяемаяКотировка	= ОпределяемаяКотировка;
		ЗаполненнаяСтрокаКотировок.ДатаОпределения			= ДатаОпределения;
		ЗаполненнаяСтрокаКотировок.УровеньЦены				= УровеньЦены;
		ЗаполненнаяСтрокаКотировок.НаименованиеКотировки	= ИмяГрафы; 
		ЗаполненнаяСтрокаКотировок.период					= ДатаОпределения;
		ЗаполненнаяСтрокаКотировок.Актив					= Актив;
		ЗаполненнаяСтрокаКотировок.Валюта					= Актив.ВалютаНоминальнойСтоимости;
		
		СправкаРасчетОбластьСтрока.Параметры.Биржа				= "DCF";
		СправкаРасчетОбластьСтрока.Параметры.Графа 				= ИмяГрафы;
		СправкаРасчетОбластьСтрока.Параметры.Котировка			= ОпределяемаяКотировка;
		СправкаРасчетОбластьСтрока.Параметры.ДатаОпределения	= ДатаОпределения;
		СправкаРасчетОбластьСтрока.Параметры.Bid 				= ЦенаСпроса;
		СправкаРасчетОбластьСтрока.Параметры.Offer 				= ЦенаПредложения;
			
	КонецЕсли;
// IMAPPS-11191 <--
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
		
	Если ЗначениеЗаполнено(СтруктураНастроек.Оценщик) Тогда
		НайденныеСтрокиНРД	= ТаблицаКотировокОценщик.НайтиСтроки(Новый Структура("Актив, Период, Биржа", Актив, НачалоДня(Дата), СтруктураНастроек.Оценщик));
		Для каждого НайденнаяСтрока из НайденныеСтрокиНРД Цикл
			
			ЦенаОценщик 	= НайденнаяСтрока.ПризнаваемаяКотировка;
			
			Если ЦенаОценщик <> 0 Тогда
				СтрокаКотировокПоОценке	= НайденнаяСтрока;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если ЦенаОценщик = 0 Тогда
		Возврат
	КонецЕсли;
	
	ОпределяемаяКотировка		= ЦенаОценщик;
	Если ОпределяемаяКотировка = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДатаОпределения				= СтрокаКотировокПоОценке.Период;
	УровеньЦены					= 3;
	ИмяГрафы					= "Оценщик";;
				
	ЗаполнитьЗначенияСвойств(ЗаполненнаяСтрокаКотировок, СтрокаКотировокПоОценке);
	ЗаполненнаяСтрокаКотировок.ОпределяемаяКотировка	= ОпределяемаяКотировка;
	ЗаполненнаяСтрокаКотировок.ДатаОпределения			= ДатаОпределения;
	ЗаполненнаяСтрокаКотировок.УровеньЦены				= УровеньЦены;
	ЗаполненнаяСтрокаКотировок.НаименованиеКотировки 	= ИмяГрафы;
	
	ЗаполненнаяСтрокаКотировок.НаименованиеКотировки 	= ИмяГрафы;
	ЗаполненнаяСтрокаКотировок.ОбъемТоргов 				= 0;
		
	СправкаРасчетОбластьСтрока.Параметры.Биржа			= "Оценщик";
	СправкаРасчетОбластьСтрока.Параметры.Котировка		= ОпределяемаяКотировка;
	СправкаРасчетОбластьСтрока.Параметры.ДатаОпределения= ДатаОпределения;
	
	СправкаРасчетОбластьСтрока.Параметры.Графа			= ИмяГрафы;
	СправкаРасчетОбластьСтрока.Параметры.УровеньЦены	= УровеньЦены;
	СправкаРасчетОбластьСтрока.Параметры.ЦенаНРД		= ОпределяемаяКотировка;
		
КонецПроцедуры

// FVasiliev IMDEV-8611 30.04.2026 
Функция ПодготовитьДанныеДляРасчетаОценщик(НачалоПериода, КонецПериода, СписокЦБ, СтруктураНастроек)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", 	НачалоДня(КонецПериода));
	Запрос.УстановитьПараметр("СписокЦБ", 		СписокЦБ);
	Запрос.УстановитьПараметр("ММВБ",			СтруктураНастроек.БиржаММВБ);
	Запрос.УстановитьПараметр("НРД",			СтруктураНастроек.РасчетныйЦентрНРД);
	Запрос.УстановитьПараметр("НРД2",			СтруктураНастроек.РасчетныйЦентрНРД2);
	Запрос.УстановитьПараметр("Оценщик",		СтруктураНастроек.Оценщик);
	
	Запрос.Текст = ПолучитьТекстЗапросаСырыеКотировкиОценщик();
	
	ОбщегоНазначенияМО.ДобавитьВЛогОтладки(Запрос, "Алгоритм.ОпределениеСправедливойСтоимости.МодульОбъекта:ПодготовитьДанныеДляРасчетаОценщик");
	
	Результат = Запрос.ВыполнитьПакет();	
	Котировки	=  Результат[0].Выгрузить();
	
	//ДобавитьДопКолонкиВТаблицуКотировок(Котировки);
	
	Котировки.Индексы.Добавить("Актив, Период");
	
	Возврат Котировки
	
КонецФункции

// FVasiliev IMDEV-8611 30.04.2026 
Процедура ДобавитьВыплатыКупонногоДохода(СтрокаОблигации, ДенежныйПоток, Портфель, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ОблигацииКупоны.ДатаВыплатыКупонногоДохода <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ОблигацииКупоны.ДатаВыплатыКупонногоДохода
		|		ИНАЧЕ ОблигацииКупоны.ДатаОкончанияКупонногоПериода
		|	КОНЕЦ КАК ДатаВыплатыКупонногоДохода,
		|	ОблигацииКупоны.ДатаОкончанияКупонногоПериода,
		|	ОблигацииКупоны.РазмерДоходаВПроцентах,
		|	ОблигацииКупоны.РазмерДоходаВРублях,
		|	ОблигацииКупоны.КолДнейВКупонномПериоде,
		|	ВЫБОР
		|		КОГДА ОблигацииКупоны.РазмерДоходаВРублях = 0
		|			ТОГДА Истина
		|		ИНАЧЕ ОблигацииКупоны.РасчетКупонаОтПроцента
		|	КОНЕЦ КАК РасчетКупонаОтПроцента,
		|	ОблигацииКупоны.ДатаНачалаКупонногоПериода
		|ИЗ
		|	Справочник.Облигации.Купоны КАК ОблигацииКупоны
		|ГДЕ
		|	ОблигацииКупоны.Ссылка = &Облигация
		|	И ВЫБОР
		|			КОГДА ОблигацииКупоны.ДатаВыплатыКупонногоДохода <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА ОблигацииКупоны.ДатаВыплатыКупонногоДохода
		|			ИНАЧЕ ОблигацииКупоны.ДатаОкончанияКупонногоПериода
		|		КОНЕЦ > &ДатаНачала
		|	И ОблигацииКупоны.ДатаОкончанияКупонногоПериода <= &ДатаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОблигацииКупоны.ДатаОкончанияКупонногоПериода";
	
	Запрос.УстановитьПараметр("ДатаНачала", Дата(1,1,1));
	Запрос.УстановитьПараметр("Облигация", СтрокаОблигации.Объект);
	Запрос.УстановитьПараметр("ДатаОкончания", '3999.12.31');
	
	Купоны = Запрос.Выполнить().Выгрузить();
	ОбщегоНазначенияМО.ДобавитьВЛогОтладки(Запрос, "Документ.РасчетЭСП.МодульОбъекта.ДобавитьВыплатыКупонногоДохода()");
	
	ДатаДенежногоПотокаКупона = "ДатаОкончанияКупонногоПериода";
	
	ПоследнийИзвестныйКупон 		= Неопределено;
	ПоследнийКупонныйДоход 			= 0;
	ПоследнийИзвесныйПроцентКупона 	= 0;
	Для Каждого Купон Из Купоны Цикл
		
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(ПланыВидовХарактеристик.ПараметрыПортфеля.ПравилаОкругленияКотировок);
		ЗначенияПараметров = РегистрыСведений.ЗначенияПараметровПортфеля.ЗначенияПараметровПортфеля(Портфель, МассивПараметров, Дата);
		
		ПараметрыПортфеля = Новый Структура;
		ПараметрыПортфеля.Вставить("ПравилаОкругленияКотировок", ЗначенияПараметров.Получить(ПланыВидовХарактеристик.ПараметрыПортфеля.ПравилаОкругленияКотировок));

		НКДЗаЕдиницу = Перечисления.МетодыРасчетаНКД.НКД_НаДату(СтрокаОблигации.Объект, Купон, Купон.ДатаОкончанияКупонногоПериода, ПараметрыПортфеля.ПравилаОкругленияКотировок);
		
		Если НКДЗаЕдиницу = 0 Тогда
			НКДЗаЕдиницу	= ПоследнийКупонныйДоход;
		КонецЕсли; 
		
		ДобавитьДенежныйПоток(СтрокаОблигации, ДенежныйПоток, Купон[ДатаДенежногоПотокаКупона], 0, НКДЗаЕдиницу);
		
		ПоследнийИзвестныйКупон 		= Купон;
		ПоследнийКупонныйДоход 			= НКДЗаЕдиницу;
		ПоследнийИзвесныйПроцентКупона 	= Купон.РазмерДоходаВПроцентах;
	КонецЦикла;
	
КонецПроцедуры

// FVasiliev IMDEV-8611 30.04.2026 
Процедура ДобавитьВыплатыТела(СтрокаОблигации, ДенежныйПоток)
	
	РеквизитыОблигации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаОблигации.Объект, "ДатаПогашения, Амортизационная, ВидАктива, ВалютаНоминальнойСтоимости, МетодРасчетаНКД");
	
	ДатаОкончания = РеквизитыОблигации.ДатаПогашения;
	НоминальнаяСтоимостьВДатуОкончания = Справочники.Облигации.ПолучитьНоминальнуюСтоимость(СтрокаОблигации.Объект, ДатаОкончания);
	ДобавитьДенежныйПоток(СтрокаОблигации, ДенежныйПоток, ДатаОкончания, НоминальнаяСтоимостьВДатуОкончания, 0);
	
	Если РеквизитыОблигации.Амортизационная Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОблигацииАмортизационныеВыплаты.ДатаПогашения КАК ДатаПогашения,
		|	ОблигацииАмортизационныеВыплаты.СуммаПогашения КАК СуммаПогашения
		|ИЗ
		|	Справочник.Облигации.АмортизационныеВыплаты КАК ОблигацииАмортизационныеВыплаты
		|ГДЕ
		|	ОблигацииАмортизационныеВыплаты.Ссылка = &Облигация
		|	И ОблигацииАмортизационныеВыплаты.ДатаПогашения > &ДатаНачала
		|	И ОблигацииАмортизационныеВыплаты.ДатаПогашения <= &ДатаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПогашения";
		
		Запрос.УстановитьПараметр("ДатаНачала", Дата(1,1,1));
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		Запрос.УстановитьПараметр("Облигация", СтрокаОблигации.Объект);
		
		ОбщегоНазначенияМО.ДобавитьВЛогОтладки(Запрос, "Документ.РасчетФинансовыхПоказателейОблигаций.МодульОбъекта.ДобавитьВыплатыТела()");
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДобавитьДенежныйПоток(СтрокаОблигации, ДенежныйПоток, Выборка.ДатаПогашения, Выборка.СуммаПогашения, 0);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

// FVasiliev IMDEV-8611 30.04.2026 
Процедура ОграничитьДенежныйПотокОфертой(Актив, ПоследняяСС, ДенежныйПоток, Дата)
		
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	               |	ОфертыОблигаций.Актив,
	      	               |	ОфертыОблигаций.ТипОферты,
	      	               |	ОфертыОблигаций.Период КАК Период,
	      	               |	ОфертыОблигаций.ЦенаОферты
	      	               |ИЗ
	      	               |	РегистрСведений.ОфертыОблигаций КАК ОфертыОблигаций
	      	               |ГДЕ
	      	               |	ОфертыОблигаций.Активность = ИСТИНА
	      	               |	И ОфертыОблигаций.Период >= &ДатаК
	      	               |	И ОфертыОблигаций.Актив = &Актив
	      	               |	И ВЫБОР
	      	               |			КОГДА ОфертыОблигаций.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОферт.CALL)
	      	               |				ТОГДА &СС >= ОфертыОблигаций.ЦенаОферты
	      	               |			ИНАЧЕ ИСТИНА
	      	               |		КОНЕЦ
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	ОфертыОблигаций.Период");
	
	Запрос.УстановитьПараметр("ДатаК", Дата);
	Запрос.УстановитьПараметр("Актив", Актив);
	Запрос.УстановитьПараметр("СС", ПоследняяСС);
	
	ОбщегоНазначенияМО.ДобавитьВЛогОтладки(Запрос, "РасчетЭСП.ОграничитьДенежныйПотокОфертой");
	
	Результат	= Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	Выборка	= Результат.Выбрать();
	Выборка.Следующий();
	
	КоличествоСтрокВПотоке	= ДенежныйПоток.Количество();
	
	Если КоличествоСтрокВПотоке <= 1 Тогда
		Возврат;
	КонецЕсли;
	ТекСтрока			= Неопределено;
	ПредыдущаяСтрока	= ДенежныйПоток.Получить(КоличествоСтрокВПотоке - 1);
	
	//vtb 11.01
	//ПоследнееТело		= ПредыдущаяСтрока.Тело;
	ПоследнееТело = Справочники.Облигации.ПолучитьНоминальнуюСтоимость(Актив.Объект,Выборка.Период);
	
	СтрокиКУдалению	= Новый Массив;
	СтрокиКУдалению.Добавить(ПредыдущаяСтрока);
	
	Сутки	= 24*60*60;
	ДенежныйПоток.Сортировать("Дата Возр");
	Для Счетчик = 1 По КоличествоСтрокВПотоке Цикл//обратный цикл
		
		Если Счетчик = 1 Тогда
			Продолжить;
		КонецЕсли; 
		
		ТекСтрока	= ДенежныйПоток.Получить(КоличествоСтрокВПотоке - Счетчик);
		
		ДанныеНайдены = ЛожЬ;
		
		Если ПредыдущаяСтрока.Дата >= Выборка.Период И ТекСтрока.Дата <= Выборка.Период Тогда
			ДанныеНайдены = Истина;
			ТекСтрока.Тело = ПоследнееТело;
			Прервать;
		КонецЕсли; 
		
		ПредыдущаяСтрока	= ТекСтрока;
		СтрокиКУдалению.Добавить(ПредыдущаяСтрока);
		
	КонецЦикла; 	
	
	Если ДанныеНайдены Тогда
		Для каждого СтрокаУдаления Из СтрокиКУдалению Цикл
			Попытка
				ДенежныйПоток.Удалить(СтрокаУдаления);
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// FVasiliev IMDEV-8611 30.04.2026 
Функция ПолучитьКредитныйРейтинг(Актив, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РейтингиПоВыпускам.Агентство КАК Агентство,
		|	РейтингиПоВыпускам.Рейтинг КАК Рейтинг,
		|	1 КАК Приоритет,
		|	""Выпуск"" КАК Вид,
		|	РейтингиПоВыпускам.ШкалаРейтингов КАК ШкалаРейтингов
		|ПОМЕСТИТЬ Рейтинги
		|ИЗ
		|	РегистрСведений.РейтингиПоВыпускам КАК РейтингиПоВыпускам
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(РейтингиПоВыпускам.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаК, ДЕНЬ)
		|	И НЕ РейтингиПоВыпускам.Рейтинг.Наименование В (""WD"", ""NR"")
		|	И РейтингиПоВыпускам.Актив = &Актив
		|	И РейтингиПоВыпускам.ШкалаРейтингов.ВалютаШкалы = &ВалютаШкалы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РейтингиПоЭмитентам.Агентство,
		|	РейтингиПоЭмитентам.Рейтинг,
		|	2,
		|	""Эмитент"",
		|	РейтингиПоЭмитентам.ШкалаРейтингов
		|ИЗ
		|	РегистрСведений.РейтингиПоЭмитентам КАК РейтингиПоЭмитентам
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(РейтингиПоЭмитентам.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаК, ДЕНЬ)
		|	И НЕ РейтингиПоЭмитентам.Рейтинг.Наименование В (""WD"", ""NR"")
		|	И РейтингиПоЭмитентам.Эмитент = &Эмитент
		|	И РейтингиПоЭмитентам.ШкалаРейтингов.ВалютаШкалы = &ВалютаШкалы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Рейтинги.Агентство КАК Агентство,
		|	Рейтинги.Рейтинг КАК Рейтинг,
		|	Рейтинги.Приоритет КАК Приоритет,
		|	СопоставлениеРейтинговСрезПоследних.УровеньКредитногоРейтинга КАК УровеньКредитногоРейтинга,
		|	СопоставлениеРейтинговСрезПоследних.УровеньКредитногоРейтинга.Приоритет КАК УровеньКредитногоРейтингаПриоритет
		|ИЗ
		|	РегистрСведений.СопоставлениеРейтингов.СрезПоследних(&ДатаК, Сценарий = &Сценарий) КАК СопоставлениеРейтинговСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Рейтинги КАК Рейтинги
		|		ПО СопоставлениеРейтинговСрезПоследних.Агентство = Рейтинги.Агентство
		|			И СопоставлениеРейтинговСрезПоследних.Рейтинг = Рейтинги.Рейтинг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УровниКредитногоРейтинга КАК УровниКредитногоРейтинга
		|		ПО СопоставлениеРейтинговСрезПоследних.УровеньКредитногоРейтинга = УровниКредитногоРейтинга.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет,
		|	УровеньКредитногоРейтингаПриоритет УБЫВ";
	
	Запрос.УстановитьПараметр("Актив", Актив);
	Запрос.УстановитьПараметр("ВалютаШкалы", Перечисления.ВалютыШкалы.НациональнаяВалюта);
	Запрос.УстановитьПараметр("ДатаК", Дата);
	Запрос.УстановитьПараметр("Сценарий", Справочники.Сценарий.НайтиПоНаименованию("Альянс"));
	Запрос.УстановитьПараметр("Эмитент", Актив.Объект.Эмитент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ВыборкаДетальныеЗаписи.УровеньКредитногоРейтинга.Наименование = "A" Тогда
		Возврат "МинСпред";		
	ИначеЕсли ВыборкаДетальныеЗаписи.УровеньКредитногоРейтинга.Наименование = "B" Тогда
		Возврат "Медиана";		
	Иначе
		Возврат "МаксСпред";	
	КонецЕсли;

КонецФункции

// FVasiliev IMDEV-8611 30.04.2026 
Функция СтавкаПоКривойБезрисковойДоходности(Валюта, Дата, Дюрация, Актив) Экспорт
	
	Ставка	= 0;
	
	Если Валюта.Пустая() Тогда
		Возврат Ставка;
	КонецЕсли; 
	
	Отказ	= Ложь;
	
	Контекст	= КонтекстРасчета(Валюта, Дата, Отказ);
	
	Если Отказ Тогда
		Возврат 0;
	КонецЕсли; 
	
	ФормулаРасчета	= ОбщегоНазначения.ПолучитьЗначениеРеквизита(Валюта, "ФормулаРасчетаПоКривойДоходности");
	
	НеВыполненРасчетПоФормулеПользователя	= Истина;
	
	Если СокрЛП(ФормулаРасчета) <> "" Тогда
		
		Попытка
			Выполнить(ФормулаРасчета);
			
			НеВыполненРасчетПоФормулеПользователя	= Ложь;
		Исключение
			НеВыполненРасчетПоФормулеПользователя	= Истина;
		КонецПопытки;
		
	КонецЕсли; 
	
	Если Дюрация = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Если НеВыполненРасчетПоФормулеПользователя Тогда
		Ставка = РасчетПоВнутреннейФормуле(Контекст, Дюрация, Актив);
	КонецЕсли;
	
	Возврат Ставка;
	
КонецФункции

// FVasiliev IMDEV-8611 30.04.2026 
Функция ПолучитьТекстЗапросаСырыеКотировкиОценщик()
	
	Текст = "ВЫБРАТЬ
	        |	НАЧАЛОПЕРИОДА(КотировкиЦБНаБирже.Период, ДЕНЬ) КАК Период,
	        |	КотировкиЦБНаБирже.Регистратор,
	        |	КотировкиЦБНаБирже.Актив КАК Актив,
	        |	КотировкиЦБНаБирже.Биржа,
	        |	КотировкиЦБНаБирже.Валюта,
	        |	КотировкиЦБНаБирже.ПризнаваемаяКотировка
	        |ИЗ
	        |	РегистрСведений.КотировкиЦБНаБирже КАК КотировкиЦБНаБирже
	        |ГДЕ
	        |	НАЧАЛОПЕРИОДА(КотировкиЦБНаБирже.Период, ДЕНЬ) МЕЖДУ &НачалоПериода И &КонецПериода
	        |	И КотировкиЦБНаБирже.Актив В(&СписокЦБ)
	        |	И КотировкиЦБНаБирже.Биржа = &Оценщик
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Актив,
	        |	Период УБЫВ";
	
	Возврат Текст;
	
КонецФункции

// FVasiliev IMDEV-8611 30.04.2026 
Процедура ДобавитьДенежныйПоток(СтрокаОблигации, ДенежныйПоток, ДатаПотока, Тело, НКД);
	
	Если ТипЗнч(ДатаПотока) <> Тип("Дата") Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = ДенежныйПоток.НайтиСтроки(Новый Структура("Дата", ДатаПотока));
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = ДенежныйПоток.Добавить();
		НоваяСтрока.Актив 			= СтрокаОблигации.Актив;
		НоваяСтрока.Дата 			= ДатаПотока;
		НоваяСтрока.Тело 			= Тело;
		НоваяСтрока.КупонныйДоход 	= НКД;
		НоваяСтрока.Итого 			= НоваяСтрока.КупонныйДоход;
	Иначе
		НоваяСтрока = НайденныеСтроки[0];
		НоваяСтрока.Тело 			= НоваяСтрока.Тело + Тело;
		НоваяСтрока.КупонныйДоход 	= НоваяСтрока.КупонныйДоход + НКД;
		НоваяСтрока.Итого 			= НоваяСтрока.КупонныйДоход;
		
	КонецЕсли;
	
КонецПроцедуры

// FVasiliev IMDEV-8611 30.04.2026 
Функция КонтекстРасчета(Валюта, Дата, Отказ)
	
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ПараметрыКривойБезрисковойДоходностиСрезПоследних.betta0,
	      	               |	ПараметрыКривойБезрисковойДоходностиСрезПоследних.betta1,
	      	               |	ПараметрыКривойБезрисковойДоходностиСрезПоследних.betta2,
	      	               |	ПараметрыКривойБезрисковойДоходностиСрезПоследних.tetta,
	      	               |	ПараметрыКривойБезрисковойДоходностиСрезПоследних.g1,
	      	               |	ПараметрыКривойБезрисковойДоходностиСрезПоследних.g2,
	      	               |	ПараметрыКривойБезрисковойДоходностиСрезПоследних.g3,
	      	               |	ПараметрыКривойБезрисковойДоходностиСрезПоследних.g4,
	      	               |	ПараметрыКривойБезрисковойДоходностиСрезПоследних.g5,
	      	               |	ПараметрыКривойБезрисковойДоходностиСрезПоследних.g6,
	      	               |	ПараметрыКривойБезрисковойДоходностиСрезПоследних.g7,
	      	               |	ПараметрыКривойБезрисковойДоходностиСрезПоследних.g8,
	      	               |	ПараметрыКривойБезрисковойДоходностиСрезПоследних.g9
	      	               |ИЗ
	      	               |	РегистрСведений.ПараметрыКривойБезрисковойДоходности.СрезПоследних(&ДатаК, Валюта = &Валюта) КАК ПараметрыКривойБезрисковойДоходностиСрезПоследних");
						   
	Запрос.УстановитьПараметр("ДатаК", Дата);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Выборка	= Запрос.Выполнить().Выбрать();
	
	Контекст	= Новый Структура;
	
	Если Выборка.Следующий() Тогда
		
		Для каждого Ресурс Из Метаданные.РегистрыСведений.ПараметрыКривойБезрисковойДоходности.Ресурсы Цикл
			
			Контекст.Вставить(Ресурс.Имя, Выборка[Ресурс.Имя]);
			
		КонецЦикла; 
		
		ДобавитьФиксированныеПараметры(Контекст);
		
	Иначе
		
		Отказ	= Истина;
		
	КонецЕсли; 
	
	Возврат Контекст;
	
КонецФункции

// FVasiliev IMDEV-8611 30.04.2026 
Функция РасчетПоВнутреннейФормуле(Контекст, Dur, Актив)
	
	betta0	= Контекст.betta0;
	betta1	= Контекст.betta1;
	betta2	= Контекст.betta2;
	
	b1	= Контекст.b1;
	b2	= Контекст.b2;
	b3	= Контекст.b3;
	b4	= Контекст.b4;
	b5	= Контекст.b5;
	b6	= Контекст.b6;
	b7	= Контекст.b7;
	b8	= Контекст.b8;
	b9	= Контекст.b9;
	
	tetta	= Контекст.tetta;
	
	a1	= Контекст.a1;
	a2	= Контекст.a2;
	a3	= Контекст.a3;
	a4	= Контекст.a4;
	a5	= Контекст.a5;
	a6	= Контекст.a6;
	a7	= Контекст.a7;
	a8	= Контекст.a8;
	a9	= Контекст.a9;
	
	g1	= Контекст.g1;
	g2	= Контекст.g2;
	g3	= Контекст.g3;
	g4	= Контекст.g4;
	g5	= Контекст.g5;
	g6	= Контекст.g6;
	g7	= Контекст.g7;
	g8	= Контекст.g8;
	g9	= Контекст.g9;
	
	
	Попытка 
		Часть1	= betta0+(betta1+betta2)*(tetta/Dur)*(1-EXP(-Dur/tetta));
	Исключение 
		Сообщить("Актив: " + Актив + " дюрация " + Dur + " tetta " + tetta);
	КонецПопытки;
	
	Часть2	= betta2*EXP(-Dur/tetta);
	Часть3	= g1*EXP(-(Pow((Dur-a1),2))/Pow(b1,2));
	Часть4	= g2*EXP(-(Pow((Dur-a2),2))/Pow(b2,2));
	Часть5	= g3*EXP(-(Pow((Dur-a3),2))/Pow(b3,2));
	Часть6	= g4*EXP(-(Pow((Dur-a4),2))/Pow(b4,2));
	Часть7	= g5*Exp(-(Pow((Dur-a5),2))/Pow(b5,2));
	Часть8	= g6*Exp(-(Pow((Dur-a6),2))/Pow(b6,2));
	Часть9	= g7*Exp(-(Pow((Dur-a7),2))/Pow(b7,2));
	Часть10	= g8*Exp(-(Pow((Dur-a8),2))/Pow(b8,2));
	Часть11	= g9*Exp(-(Pow((Dur-a9),2))/Pow(b9,2));
	
	Ставка = EXP((Часть1-Часть2+Часть3+Часть4+Часть5+Часть6+Часть7+Часть8+Часть9+Часть10+Часть11)/10000)-1;
	
	Возврат Ставка;
	
КонецФункции

// FVasiliev IMDEV-8611 30.04.2026 
Процедура ДобавитьФиксированныеПараметры(Контекст)
	
	Контекст.Вставить("a1", 0);
	Контекст.Вставить("a2", 0.6);
	
	к = 1.6;
	т = Контекст.a2;
	
	Для инд = 2 по 8 Цикл
		т = т + Контекст.a2 * pow(к, инд-1);
		
		Контекст.Вставить("a"+Строка(инд+1), т);
	КонецЦикла;
	
	т = Контекст.a2;
	Контекст.Вставить("b1", т);
	
	Для инд = 1 по 8 Цикл
		т = т * к;
		Контекст.Вставить("b"+Строка(инд+1), т);
	КонецЦикла;
	
КонецПроцедуры

// FVasiliev IMDEV-8611 30.04.2026 
Функция ОпределитьЦенуПервичногоРазмещения(Актив, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СделкаСЦеннымиБумагами.Цена / СделкаСЦеннымиБумагами.Актив.Объект.НоминальнаяСтоимость * 100 КАК Цена,
		|	СделкаСЦеннымиБумагами.Валюта,
		|	СделкаСЦеннымиБумагами.Дата
		|ИЗ
		|	Документ.СделкаСЦеннымиБумагами КАК СделкаСЦеннымиБумагами
		|ГДЕ
		|	СделкаСЦеннымиБумагами.Актив = &Актив
		|	И СделкаСЦеннымиБумагами.Дата <= &Дата
		|	И СделкаСЦеннымиБумагами.Проведен
		|	И СделкаСЦеннымиБумагами.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделка.Продажа)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СделкаСЦеннымиБумагами.Дата
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Актив", Актив);
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Структура;
	Если Выборка.Следующий() Тогда // При первичном приобретении бумаги котировку (цену) в процентах сначала определяем из документа покупки (т.к. возможна покупка на аукционе),
		Результат.Вставить("Цена", Выборка.Цена);
		Результат.Вставить("Валюта", Выборка.Валюта);
		Результат.Вставить("Дата", Выборка.Дата);
	Иначе //  иначе берем номинальную стоимость из актива.
		Результат.Вставить("Цена", 100); //Актив.Объект.НоминальнаяСтоимость);
		Результат.Вставить("Валюта", Актив.ВалютаНоминальнойСтоимости);
		Результат.Вставить("Дата", Дата);
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции	

тзОшибки = новый ТаблицаЗначений;
тзОшибки.Колонки.Добавить("Ошибка");
ДанныеОПотоках	= Новый Соответствие;
