
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает строку, перекодированную в нужную кодировку
//
// Параметры:
//  СтрокаДляПерекодирования - Строка	 - Исходная строка
//  НужнаяКодировка			 - Строка	 - Устанавливаемый тип кодировки см. ТекстовыйДокумент.УстановитьТипФайла
// 
// Возвращаемое значение:
//   - Строка - Перекодированная строка
//
Функция ПерекодированиеСтроки(СтрокаДляПерекодирования, НужнаяКодировка = "windows-1251") Экспорт
	
	ПерекодированныйТекст = Новый ТекстовыйДокумент;
	ПерекодированныйТекст.УстановитьТипФайла(НужнаяКодировка);
	ПерекодированныйТекст.УстановитьТекст(СтрокаДляПерекодирования);
	
	// Возвращает перекодированную строку
	Возврат ПерекодированныйТекст.ПолучитьТекст();
	
КонецФункции

#КонецОбласти

