Функция ПолучитьСообщенияЗапрос(ВнешнийИсточник)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.Идентификатор КАК Идентификатор,
	|	ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.Сообщение КАК Сообщение
	|ИЗ
	|	РегистрСведений.ОшибкиОнлайнЗагрузкиИзВнешнихИсточников КАК ОшибкиОнлайнЗагрузкиИзВнешнихИсточников
	|ГДЕ
	|	ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.ВнешнийИсточник = &ВнешнийИсточник";
	Запрос.УстановитьПараметр("ВнешнийИсточник", ВнешнийИсточник);
	Возврат Запрос.Выполнить();	
КонецФункции
Функция ПолучитьСообщения(ВнешнийИсточник) Экспорт
	Возврат ПолучитьСообщенияЗапрос(ВнешнийИсточник).Выбрать();
КонецФункции
Функция ПолучитьСообщенияТаблица(ВнешнийИсточник) Экспорт
	Возврат ПолучитьСообщенияЗапрос(ВнешнийИсточник).Выгрузить();
КонецФункции

Функция ПолучитьНаборСОтбором(ВнешнийИсточник,Идентификатор)
	Набор = РегистрыСведений.ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.СоздатьНаборЗаписей();
	Набор.Отбор.ВнешнийИсточник.Установить(ВнешнийИсточник,Истина);
	Набор.Отбор.Идентификатор.Установить(Идентификатор,Истина);
	Возврат Набор;
КонецФункции

Функция Добавить(ВнешнийИсточник,Сообщение) Экспорт
	Идентификатор = Строка(Новый УникальныйИдентификатор);
	Набор = ПолучитьНаборСОтбором(ВнешнийИсточник, Идентификатор);
	Эл = Набор.Добавить();
	Эл.ВнешнийИсточник = ВнешнийИсточник;
	Эл.Идентификатор = Идентификатор;
	Эл.Сообщение = Сообщение;
	Набор.Записать();
	
	Возврат Идентификатор;
КонецФункции

Процедура Удалить(ВнешнийИсточник,Идентификатор) Экспорт
	Набор = ПолучитьНаборСОтбором(ВнешнийИсточник, Идентификатор);
	Набор.Записать();
КонецПроцедуры

Процедура УдалитьСообщенияВТаблице(ВнешнийИсточник,Сообщения) Экспорт
	Инд = 0;
	Колич = Сообщения.Количество();
	Пока Инд<Колич Цикл
		Стр = Сообщения[Инд];
		Если Стр.Удалить И ЗначениеЗаполнено(Стр.Идентификатор) Тогда
			РегистрыСведений.ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.Удалить(ВнешнийИсточник,Стр.Идентификатор);
			Колич = Колич-1;
			Сообщения.Удалить(Стр);
		Иначе
			Инд = Инд+1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Процедура ВыполнитьРассылкуУведомленийОНаличииОшибок() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.ВнешнийИсточник.Наименование КАК ВнешнийИсточник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.Идентификатор) КАК КоличествоСообщений
	|ИЗ
	|	РегистрСведений.ОшибкиОнлайнЗагрузкиИзВнешнихИсточников КАК ОшибкиОнлайнЗагрузкиИзВнешнихИсточников
	|
	|СГРУППИРОВАТЬ ПО
	|	ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.ВнешнийИсточник,
	|	ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.ВнешнийИсточник.Наименование";
	ТекстСообщения = "";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = ТекстСообщения+Символы.ПС+Выборка.ВнешнийИсточник+": "+Выборка.КоличествоСообщений+" сообщений";
	КонецЦикла;
	Если ТекстСообщения<>"" Тогда
		
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОНаличииОшибокЗагрузкиИзВИ;
		НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
		Если Не ЗначениеЗаполнено(НастройкиОбмена) Тогда
			ВызватьИсключение "Не удалось отправить уведомление о наличии ошибок: не заполнены параметры внешнего источника '"+ВнешнийИсточник+"'";
		КонецЕсли;
		
		ТекстСообщения = "Обнаружены необработанные ошибки загрузки из следующих внешних источников:"+ТекстСообщения;
		
		ПараметрыУведомления = Новый Соответствие;
		ПараметрыУведомления.Вставить("НастройкиОбмена"		, НастройкиОбмена);
		ПараметрыУведомления.Вставить("ТемаПисьма"			, "Необработанные ошибки загрузки");
		ПараметрыУведомления.Вставить("ТекстПисьма"			, ТекстСообщения);
		ПараметрыУведомления.Вставить("ТипТекстаПисьма"		, ТипТекстаПочтовогоСообщения.ПростойТекст);
		ПараметрыУведомления.Вставить("Кодировка"			, "UTF-8");
		ПараметрыУведомления.Вставить("Важность"			, ВажностьИнтернетПочтовогоСообщения.Обычная);
    	ПараметрыУведомления.Вставить("Вложения");
	    
		РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
	КонецЕсли;
КонецПроцедуры