&НаСервере
Процедура ЗаполнитьНаСервере()
	Модуль = РеквизитФормыВЗначение("Объект");
	Модуль.Заполнить();
	
	ЗначениеВРеквизитФормы(Модуль, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
	Модуль = РеквизитФормыВЗначение("Объект");
	Модуль.СформироватьMV(,, Истина, Неопределено);
КонецФункции // СформироватьНаСервере()

&НаКлиенте
Процедура Сформировать(Команда)
	Если НЕ ЭтаФорма.Объект.ПоВсем И ЭтаФорма.Объект.Мандаты.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны мандаты!");
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПутьДляСохраненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если СокрЛП(Объект.ПутьДляСохранения) <> "" Тогда
		Диалог.Каталог = Объект.ПутьДляСохранения;
	КонецЕсли;
	
	Если Диалог.Выбрать() Тогда
		Объект.ПутьДляСохранения = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СохранениеОбъектов(Ключ, ТабОбъекта);
	ИмяФайла = СформироватьИмяФайла(Ключ);
	
	Попытка
		ТабОбъекта.Записать(Объект.ПутьДляСохранения + "\" + ИмяФайла,"windows-1251");
	Исключение
		Предупреждение(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ОписаниеОшибки();
КонецФункции

&НаСервере
Функция СформироватьИмяФайла(Ключ)
	Если Ключ = "Акции"  Тогда
		//e.g. AVANKOR.Equity.Trades.31JUL2015.csv
		ИмяФайла = "AVANCORE.Equity.Trades." + Врег(Формат(Объект.ДатаОтчета, "Л=en; ДФ=ddMMMyyyy"))+".csv"; 	
	ИначеЕсли Ключ = "Облигации"  Тогда
		ИмяФайла = "AVANCORE.Bond.Trades." + Врег(Формат(Объект.ДатаОтчета, "Л=en; ДФ=ddMMMyyyy"))+".csv"; 	
	КонецЕсли; 
	
	
	ИмяФайла = СтрЗаменить(ИмяФайла, """", "_");
	ИмяФайла = СтрЗаменить(ИмяФайла, "/", "_");
	ИмяФайла = СтрЗаменить(ИмяФайла, "\", "_");
	ИмяФайла = СтрЗаменить(ИмяФайла, "'", "_");
	ИмяФайла = СтрЗаменить(ИмяФайла, ":", "_");
	//ИмяФайла = СтрЗаменить(ИмяФайла, ".", "");
	ИмяФайла = СтрЗаменить(ИмяФайла, "^", "");
	ИмяФайла = СтрЗаменить(ИмяФайла, "&", "");
	ИмяФайла = СтрЗаменить(ИмяФайла, Символ(160), "");
	
	Возврат ИмяФайла;
КонецФункции


&НаСервере
Процедура СформироватьWAPНаСервере()
	Модуль = РеквизитФормыВЗначение("Объект");
	Модуль.СформироватьWAP(,,, Истина, Ложь);
	Модуль.СформироватьWAP(,,, Истина, Истина);
КонецПроцедуры // СформироватьWAPНаСервере()

&НаКлиенте
Процедура СформироватьWAP(Команда)
	Если НЕ ЭтаФорма.Объект.ПоВсем И ЭтаФорма.Объект.Мандаты.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны мандаты!");
		Возврат;
	КонецЕсли;
	
	СформироватьWAPНаСервере();
КонецПроцедуры


&НаСервере
Процедура СформироватьУстановкуССНаСервере()
	Модуль = РеквизитФормыВЗначение("Объект");
	Модуль.СформироватьУстановкуСС();
КонецПроцедуры


&НаКлиенте
Процедура СформироватьУстановкуСС(Команда)
	СформироватьУстановкуССНаСервере();
КонецПроцедуры


&НаСервере
Процедура СформироватьРасчетФинансовыхПоказателейОблигацийНаСервере()
	Модуль = РеквизитФормыВЗначение("Объект");
	Модуль.СформироватьРасчетФинПоказателей();
КонецПроцедуры


&НаКлиенте
Процедура СформироватьРасчетФинансовыхПоказателейОблигаций(Команда)
	СформироватьРасчетФинансовыхПоказателейОблигацийНаСервере();
КонецПроцедуры // СформироватьРасчетФинансовыхПоказателейОблигаций()

&НаКлиенте
Процедура УправлениеФормой()
	Если ЭтаФорма.Объект.ИспользоватьКалендарь Тогда
		ЭтаФорма.Элементы.Календарь.Доступность = Истина;
	Иначе
		ЭтаФорма.Элементы.Календарь.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры // УправлениеФормой()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ИспользоватьКалендарьПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры // ИспользоватьКалендарьПриИзменении()