#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьДанныеПользователей();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьПраваДляПользователей(Команда)
	ПрименитьПраваДляПользователейНаСервере();
	ОбновитьДанныеПользователей();
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьЗащитуОтОпасныхДействийДляАдминистратора(Команда)
	ОтключитьЗащитуОтОпасныхДействийДляАдминистратораНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрименитьПраваДляПользователейНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПрименитьПраваДляПользователей();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПользователей()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОбновитьДанныеПользователей();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ОтключитьЗащитуОтОпасныхДействийДляАдминистратораНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОтключитьЗащитуОтОпасныхДействийДляАдминистратора();
КонецПроцедуры

#КонецОбласти
