
//Функция ЗарегистрироватьКлиента(Клиент)
//	Возврат "ОК";
//КонецФункции

//Функция ЗарегистрироватьИзменения(ВидОперации, КодЗагрузки, КодБиржи, НомерДоговора, УникальныйИдентификатор, ТипВладельца)
//	
//	СсылкаНаКодЗагрузки = Справочники.КодыЗагрузки.ПолучитьСсылку(УникальныйИдентификатор);
//	
//	Если ВидОперации = "Обновить" Тогда
//		
//		Элемент = СсылкаНаКодЗагрузки.ПолучитьОбъект();
//		
//		Если Элемент = Неопределено Тогда
//			Элемент = Справочники.КодыЗагрузки.СоздатьЭлемент();
//			Элемент.УстановитьСсылкуНового(СсылкаНаКодЗагрузки);
//		КонецЕсли;
//		
//		Элемент.Код = КодЗагрузки;
//		
//		Элемент.Владелец = ОпределитьВладельца(НомерДоговора, ТипВладельца);
//		Если Элемент.Владелец = Неопределено Тогда
//			Возврат "";
//		КонецЕсли; 
//		
//		Если КодБиржи = "1" Тогда
//			Элемент.Биржа = Справочники.Биржи.MICEX;
//		ИначеЕсли КодБиржи = "Клиенты" Тогда
//			Элемент.Биржа = Справочники.КлассификаторыЗагрузки.Клиенты;
//		КонецЕсли;
//		
//		Элемент.Записать();
//		
//	ИначеЕсли ВидОперации = "Удалить" Тогда
//		
//		Объект = СсылкаНаКодЗагрузки.ПолучитьОбъект();
//		Если Объект <> Неопределено Тогда
//			Объект.Удалить();
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Возврат "ОК";
//	
//КонецФункции

//Функция ОпределитьВладельца(НомерДоговора, ТипВладельца)
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("НомерДоговора", НомерДоговора);
//	Если ТипВладельца = "Контрагенты" Тогда
//		
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ДоговорыКонтрагентов.Владелец КАК Ссылка
//		|ИЗ
//		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//		|ГДЕ
//		|	ДоговорыКонтрагентов.Код = &НомерДоговора";
//		
//	ИначеЕсли ТипВладельца = "Портфели" Тогда
//		
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	СчетаДепо.Ссылка КАК Ссылка
//		|ИЗ
//		|	Справочник.СчетаДепо КАК СчетаДепо
//		|ГДЕ
//		|	СчетаДепо.Код = &НомерДоговора";
//		
//	Иначе
//		
//		ВызватьИсключение "Неверное значение параметра ТипВладельца: "+ТипВладельца;
//		
//	КонецЕсли;
//	
//	Результат = Запрос.Выполнить();
//	Если Не Результат.Пустой() Тогда
//		Выборка = Результат.Выбрать();
//		Выборка.Следующий();
//		Возврат Выборка.Ссылка
//	Иначе
//		ТекстОшибки = "Пустой результат поиска по номеру: "+НомерДоговора;
//		ЗаписьЖурналаРегистрации("Обмен данными", УровеньЖурналаРегистрации.Ошибка, , , "При обмене данными возникла ошибка: невозможно определить владельца (тип "+ТипВладельца+") по номеру договора "+НомерДоговора);
//		Возврат Неопределено;
//	КонецЕсли;
//	
//КонецФункции // ОпределитьВладельцаПоНомеруДоговора()

Функция GetList(Date, ISIN, RegistrationNumber)
	
	ЗаписьЖурналаРегистрации("Веб-сервис", УровеньЖурналаРегистрации.Информация,,, "Вызов GetList(" + Date + ", " + ISIN + ", " + RegistrationNumber + ")");
	
	РезультатЗапроса = ПолучитьРезультатЗапросаПоОстаткамЦБ(Date, ISIN, RegistrationNumber);
	
	МассивИдентификаторов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Код");
	
	ПространствоИмен = "http://www.vtbcapital-broker.com/depo/corp-events";
	СписокТип = ФабрикаXDTO.Тип(ПространствоИмен, "ClientIdsType");
	СписокИдентификаторов = ФабрикаXDTO.Создать(СписокТип);
	
	Для каждого Идентификатор Из МассивИдентификаторов Цикл
		
		СписокИдентификаторов.ClientId.Add(СокрЛП(Идентификатор));
		
	КонецЦикла;
	
	Возврат СписокИдентификаторов;
	
КонецФункции

Функция ПолучитьРезультатЗапросаПоОстаткамЦБ(Дата, ISIN, НомерРегистрации)
	
	Запрос = Новый Запрос(ТекстЗапросаПоОстаткам());
	Запрос.УстановитьПараметр("Дата", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ISIN", ?(ЗначениеЗаполнено(ISIN), ISIN, ""));
	Запрос.УстановитьПараметр("НомерРегистрации", ?(ЗначениеЗаполнено(НомерРегистрации), НомерРегистрации, ""));
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ТекстЗапросаПоОстаткам()
	
	Возврат
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиЦБОстатки.СчетДепо.Владелец,
	|	КодыЗагрузки.Код КАК Код
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&Дата,
	|			(ЦБ.ISIN = &ISIN
	|				ИЛИ &ISIN = """")
	|				И (ЦБ.НомерРегистрации = &НомерРегистрации
	|					ИЛИ &НомерРегистрации = """")) КАК ОстаткиЦБОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ОстаткиЦБОстатки.СчетДепо.Владелец = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.Клиенты))
	|ГДЕ
	|	ОстаткиЦБОстатки.КоличествоОстаток <> 0";
	
КонецФункции
