
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбщегоНазначения.ПроверкаЗаполненностиРеквизитов1(Контрагент) Тогда
	
		Отказ = Истина;
	    Возврат;
		
	КонецЕсли; 
	
	СтруктураТариф = Новый Структура("Тариф,Валюта,ТипТарифа"); 
	
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		
		СтруктураТариф.Тариф       = ТекСтрокаУслуги.Тариф;
		СтруктураТариф.ТипТарифа   = ТекСтрокаУслуги.ТипТарифа;
		СтруктураТариф.Валюта      = ТекСтрокаУслуги.Валюта;
		
		//Проверка существования услуги.
		Если НЕ ТекСтрокаУслуги.Услуга.Пустая() Тогда
						
		    Если  (Не СтруктураТариф.Тариф= Неопределено)
				И (Не СтруктураТариф.Тариф = 0)
				И (Не СтруктураТариф.ТипТарифа= Неопределено) Тогда             
				
			Движение = Движения.УслугиДепозитария.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Инициатор = Договор;
			Движение.Услуга = ТекСтрокаУслуги.Услуга;
			Движение.МестоХранения = ТекСтрокаУслуги.МестоХранения;
			Движение.Валюта = ТекСтрокаУслуги.Валюта;
			Движение.ТипТарифа = ТекСтрокаУслуги.ТипТарифа;
			Движение.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118;
			Движение.Выгодоприобретатель = ТекСтрокаУслуги.Выгодоприобретатель;
			
			Движение.Тариф = ТекСтрокаУслуги.Тариф;
			Движение.СуммаВВалюте = ТекСтрокаУслуги.СуммаКомиссии;
			Движение.Сумма = Конвертации.КонвертацияВалюты(Дата,Движение.СуммаВВалюте,Движение.Валюта,Ложь);
			Движение.СуммаНДС = РасчетТарифов.РТ_РасчетНДС(Движение.СтавкаНДС,Движение.Сумма);
			Движение.СуммаВсего = Движение.Сумма;
			Движение.Сумма = Движение.СуммаВсего - Движение.СуммаНДС;
			
			Иначе
				
				Сообщить("Не определен тариф услуги депозитария - " + ТекСтрокаУслуги.Услуга
				+ Символы.ПС+ " Услуга депозитария не рассчитана.");
				
			КонецЕсли; 		
			
		Иначе
			
			Сообщить("Услуга Открытие счета депо - не определена в справочнике /Услуги тарифного плана/."
			+ Символы.ПС+ " Услуга депозитария не рассчитана.");
			     			
		КонецЕсли; 		
		
	КонецЦикла;
	
	РегистрыСведений.ОснованияУслугДепозитария.СнятьПризнакНачислитьКомиссиюДепоУОснований(Ссылка);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	СуммаВсего = Услуги.Итог("СуммаКомиссии");

	УстановитьНовыйНомер();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//процедуры печати
#Если Клиент Тогда
// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	СтруктураПечатныхФорм = Новый Структура;
	Возврат СтруктураПечатныхФорм;
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
КонецПроцедуры

#КонецЕсли

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	РегистрыСведений.ОснованияУслугДепозитария.УстановитьПризнакНачислитьКомиссиюДепоУОснований(Ссылка);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ОснованияУслугДепозитария.УстановитьПризнакНачислитьКомиссиюДепоУОснований(Ссылка);
	
КонецПроцедуры




