
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПолучитьПараметрыВнешнихИсточников();
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьУведомления(Команда)
	
	ПодготовитьУведомленияНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПодготовитьУведомленияНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПодготовитьУведомленияОИсполненииОперацииЦБ();
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");

КонецПроцедуры

&НаКлиенте
Процедура СформироватьУведомления(Команда)
	
	СформироватьУведомленияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьУведомленияНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СформироватьПодготовленныеУведомления();
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");

КонецПроцедуры


