Перем Прокси Экспорт; // Прокси "PersonalDataService"
Перем ПространствоИмен Экспорт; // URIПространстваИмен "PersonalDataService"
Перем мИмяСобытия;
Перем мИмяСобытияУведомлениеОКД;

Процедура ИнициироватьСоединение(Параметры = Неопределено) Экспорт
	Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
	ПространствоИмен = Прокси.ТочкаПодключения.Интерфейс.URIПространстваИмен;
КонецПроцедуры

Функция НовыеПараметрыМетода(ИмяМетода) Экспорт
	ИнициироватьСоединение();
	ТипПараметра = Прокси.ФабрикаXDTO.Тип(ПространствоИмен, ИмяМетода);
	Возврат Прокси.ФабрикаXDTO.Создать(ТипПараметра);
КонецФункции

Процедура ПроверитьЗаполнениеПараметров(ПараметрыМетода) Экспорт
	ПараметрыМетода.Тип().Проверить(ПараметрыМетода);
КонецПроцедуры

Функция РезультатОтправкиУведомленияПоВыкупам(ТаблицаОпций, РезультатЗапросаПоКлиентам,
	РезультатЗапросаПоДокументуКД, ЗаголовокСообщения, ТекстСообщения, УникальныйИдентификатор) Экспорт
	
	ВыборкаДокументов = РезультатЗапросаПоДокументуКД.Выбрать();
	ВыборкаДокументов.Следующий();
	
	ВыборкаКлиентов = РезультатЗапросаПоКлиентам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Попытка	
		Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
		ПространствоИмен = Прокси.ТочкаПодключения.Интерфейс.URIПространстваИмен;
		Фабрика = Прокси.ФабрикаXDTO;
			
		СтруктураКоллекции	= ВебСервисыСервер.СтруктураДляСозданияКоллекции("ArrayOfCorporateActionBidsOption1",
			"CorporateActionBidsOption1", Неопределено);
		КоллекцияОпций		= ВебСервисыСервер.СоздатьИЗаполнитьКоллекциюОбъектаXDTO(Фабрика, ТаблицаОпций, ПространствоИмен,
			СтруктураКоллекции);
			
		СтруктураКоллекции	= ВебСервисыСервер.СтруктураДляСозданияКоллекции("ArrayOfCorporateActionClientSecurity1",
			"CorporateActionClientSecurity1", Неопределено);
		СтруктураКоллекции	= ВебСервисыСервер.СтруктураДляСозданияКоллекции("ArrayOfCorporateActionClient1",
			"CorporateActionClient1", СтруктураКоллекции, "CorporateActionClientSecurityCollection");
		КоллекцияКлиентов	= ВебСервисыСервер.СоздатьИЗаполнитьКоллекциюОбъектаXDTO(Фабрика, ВыборкаКлиентов, ПространствоИмен,
			СтруктураКоллекции);
		
		ТипОсновнойКоллекции = Фабрика.Тип(ПространствоИмен, "CreateCorporateActionBids");
		
		ЭкземплярCorporateActionBid = Фабрика.Создать(ТипОсновнойКоллекции);
		ЗаполнитьЗначенияСвойств(ЭкземплярCorporateActionBid, ВыборкаДокументов); 
		ЭкземплярCorporateActionBid.Установить("optionsCollection", КоллекцияОпций);
		ЭкземплярCorporateActionBid.Установить("clientsCollection", КоллекцияКлиентов);
		
		ЭкземплярCorporateActionBid.emailSubject		= ЗаголовокСообщения;
		ЭкземплярCorporateActionBid.emailBody			= ТекстСообщения;
		ЭкземплярCorporateActionBid.externalMessageId	= УникальныйИдентификатор;
		Если Не ЗначениеЗаполнено(ЭкземплярCorporateActionBid.cutOffDate) Тогда
			ЭкземплярCorporateActionBid.cutOffDate = ТекущаяДатаСеанса();
		КонецЕсли;
		
		ТипОсновнойКоллекции.Проверить(ЭкземплярCorporateActionBid);
		Прокси.CreateCorporateActionBids(ЭкземплярCorporateActionBid);
		
		ОпубликованоУспешно = Истина;
		
	Исключение
		ОпубликованоУспешно = Ложь;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(мИмяСобытияУведомлениеОКД, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
	КонецПопытки;
	
	Возврат ОпубликованоУспешно;
	
КонецФункции

Функция РезультатОтправкиУведомленияПоСобраниям(РезультатЗапросаПоКлиентам, РезультатЗапросаПоВопросам,
	РезультатЗапросаПоДокументуКД, ЗаголовокСообщения, ТекстСообщения, УникальныйИдентификатор) Экспорт
	
	ВыборкаДокументов = РезультатЗапросаПоДокументуКД.Выбрать();
	ВыборкаДокументов.Следующий();
	
	ВыборкаВопросов = РезультатЗапросаПоВопросам.Выбрать();
	ВыборкаКлиентов = РезультатЗапросаПоКлиентам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивИменXDTO = Новый Массив;
	МассивИменXDTO.Добавить("ArrayOfCorporateActionMeetResolution1");         
	МассивИменXDTO.Добавить("CorporateActionMeetResolution1");
	МассивИменXDTO.Добавить("ArrayOfCorporateActionMeetResolutionVote1");              
	МассивИменXDTO.Добавить("CorporateActionMeetResolutionVote1");         
	МассивИменXDTO.Добавить("ArrayOfCorporateActionMeetResolutionDetail1");              
	МассивИменXDTO.Добавить("CorporateActionMeetResolutionDetail1");         
									 
	Попытка
		Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
		ПространствоИмен = Прокси.ТочкаПодключения.Интерфейс.URIПространстваИмен;
		Фабрика = Прокси.ФабрикаXDTO;
		
		ТипыПространстваИмен = Новый Структура;
		Для Каждого ИмяОбъектаXDTO Из МассивИменXDTO Цикл
			ТипыПространстваИмен.Вставить(ИмяОбъектаXDTO, Фабрика.Тип(ПространствоИмен, ИмяОбъектаXDTO));
		КонецЦикла;
		
		КоллекцияВопросов = Фабрика.Создать(ТипыПространстваИмен.ArrayOfCorporateActionMeetResolution1);
		ТекущийНомерВопроса = "";
		ЭкземплярResolution = Неопределено;
		КоллекцияДеталей = Неопределено;
		Пока ВыборкаВопросов.Следующий() Цикл
			НомерВопроса = ВыборкаВопросов.Number;
			Если ВыборкаВопросов.CumulativeVoting
				И ЗначениеЗаполнено(ТекущийНомерВопроса)
				И Найти(НомерВопроса, ТекущийНомерВопроса + ".") > 0
				И ЭкземплярResolution <> Неопределено Тогда
				ЭкземплярDetails = Фабрика.Создать(ТипыПространстваИмен.CorporateActionMeetResolutionDetail1);
				ЗаполнитьЗначенияСвойств(ЭкземплярDetails, ВыборкаВопросов);
				КоллекцияДеталей.CorporateActionMeetResolutionDetail1.Добавить(ЭкземплярDetails);
				ЭкземплярResolution.Установить("CorporateActionMeetResolutionDetailCollection", КоллекцияДеталей);
			Иначе 
				ЭкземплярResolution = Фабрика.Создать(ТипыПространстваИмен.CorporateActionMeetResolution1);
				ЗаполнитьЗначенияСвойств(ЭкземплярResolution, ВыборкаВопросов);
				КоллекцияВопросов.CorporateActionMeetResolution1.Добавить(ЭкземплярResolution);
				Если ВыборкаВопросов.CumulativeVoting Тогда
					ТекущийНомерВопроса = НомерВопроса;
					КоллекцияДеталей = Фабрика.Создать(ТипыПространстваИмен.ArrayOfCorporateActionMeetResolutionDetail1);
				КонецЕсли;
				КоллекцияРаскрытияСписка = Фабрика.Создать(ТипыПространстваИмен.ArrayOfCorporateActionMeetResolutionVote1);
				Пока ВыборкаКлиентов.Следующий() Цикл
					ЭкземплярClientVote = Фабрика.Создать(ТипыПространстваИмен.CorporateActionMeetResolutionVote1);
					ЗаполнитьЗначенияСвойств(ЭкземплярClientVote, ВыборкаКлиентов);
					ЭкземплярClientVote.VoteMultiplier = ВыборкаВопросов.VoteMultiplier;
					Если ВыборкаВопросов.ForInformationOnly Тогда
						ЭкземплярClientVote.VoteNb = 0;
					КонецЕсли;
					КоллекцияРаскрытияСписка.CorporateActionMeetResolutionVote1.Добавить(ЭкземплярClientVote);
				КонецЦикла;
				ВыборкаКлиентов.Сбросить();
				ЭкземплярResolution.Установить("CorporateActionMeetResolutionVoteCollection", КоллекцияРаскрытияСписка);
			КонецЕсли;
		КонецЦикла;
		
		СтруктураКоллекции = ВебСервисыСервер.СтруктураДляСозданияКоллекции("ArrayOfCorporateActionClientSecurity1", "CorporateActionClientSecurity1", Неопределено);
		СтруктураКоллекции = ВебСервисыСервер.СтруктураДляСозданияКоллекции("ArrayOfCorporateActionClient1", "CorporateActionClient1", СтруктураКоллекции, "CorporateActionClientSecurityCollection");
		КоллекцияКлиентов = ВебСервисыСервер.СоздатьИЗаполнитьКоллекциюОбъектаXDTO(Фабрика, ВыборкаКлиентов, ПространствоИмен, СтруктураКоллекции);
		
		ТипОсновнойКоллекции = Фабрика.Тип(ПространствоИмен, "CreateCorporateActionMeet");
		
		ЭкземплярCorporateActionMeet = Фабрика.Создать(ТипОсновнойКоллекции);
		ЗаполнитьЗначенияСвойств(ЭкземплярCorporateActionMeet, ВыборкаДокументов); 
		ЭкземплярCorporateActionMeet.Установить("resolutionsCollection", КоллекцияВопросов);
		ЭкземплярCorporateActionMeet.Установить("clientsCollection", КоллекцияКлиентов);
		
		ЭкземплярCorporateActionMeet.emailSubject		= ЗаголовокСообщения;
		ЭкземплярCorporateActionMeet.emailBody			= ТекстСообщения;
		ЭкземплярCorporateActionMeet.externalMessageId	= УникальныйИдентификатор;
		
		ТипОсновнойКоллекции.Проверить(ЭкземплярCorporateActionMeet);
		Прокси.CreateCorporateActionMeet(ЭкземплярCorporateActionMeet);
		
		ОпубликованоУспешно = Истина;
		
	Исключение
		ОпубликованоУспешно = Ложь;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(мИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
	КонецПопытки;
	
	Возврат ОпубликованоУспешно;
	
КонецФункции

Функция РезультатСохраненияКорпоративногоДействияWTRC(ТаблицаКлиентов, ТаблицаРазделов, ПараметрыWebСервиса,
	УникальныйИдентификатор) Экспорт
	
	Попытка	
		Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
		ПространствоИмен = Прокси.ТочкаПодключения.Интерфейс.URIПространстваИмен;
		Фабрика = Прокси.ФабрикаXDTO;
			
		СтруктураКоллекции = ВебСервисыСервер.СтруктураДляСозданияКоллекции("ArrayOfCorporateActionClientSecurity1",
			"CorporateActionClientSecurity1", Неопределено);
		СтруктураКоллекции = ВебСервисыСервер.СтруктураДляСозданияКоллекции("ArrayOfCorporateActionClient1",
			"CorporateActionClient1", СтруктураКоллекции, "CorporateActionClientSecurityCollection");
		КоллекцияКлиентов = ВебСервисыСервер.СоздатьИЗаполнитьКоллекциюОбъектаXDTO(Фабрика,
			ТаблицаКлиентов, ПространствоИмен, СтруктураКоллекции);
		
		СтруктураКоллекции = ВебСервисыСервер.СтруктураДляСозданияКоллекции("ArrayOfClientWtrc",
			"ClientWtrc", Неопределено);
		КоллекцияРазделов = ВебСервисыСервер.СоздатьИЗаполнитьКоллекциюОбъектаXDTO(Фабрика,
			ТаблицаРазделов, ПространствоИмен, СтруктураКоллекции);
			
		ТипОсновнойКоллекции = Фабрика.Тип(ПространствоИмен, "CreateCorporateActionWtrc");
		
		ЭкземплярCorporateActionWtrc = Фабрика.Создать(ТипОсновнойКоллекции);
		ЭкземплярCorporateActionWtrc.Установить("clientsCollection", КоллекцияКлиентов);
		ЭкземплярCorporateActionWtrc.Установить("depoAccountSectionCollection", КоллекцияРазделов);		
		ЭкземплярCorporateActionWtrc.reference		= СокрЛП(ПараметрыWebСервиса.РеференсКД);
		ЭкземплярCorporateActionWtrc.issuerName		= СокрЛП(ПараметрыWebСервиса.НаименованиеЭмитента);
		ЭкземплярCorporateActionWtrc.information	= "";	// Дополнительная информация (особые условия)
		ЭкземплярCorporateActionWtrc.deadLineDateCorporateAction= ПараметрыWebСервиса.ДатаОкончанияПриемаПоручений1_10;
		ЭкземплярCorporateActionWtrc.deadLineDateInstruction	= ПараметрыWebСервиса.ДатаОкончанияПриемаПоручений1_5;
		ЭкземплярCorporateActionWtrc.emailSubject	= ПараметрыWebСервиса.ЗаголовокСообщения;
		ЭкземплярCorporateActionWtrc.emailBody		= ПараметрыWebСервиса.ТекстСообщения;
		ЭкземплярCorporateActionWtrc.secName 		= ПараметрыWebСервиса.НаименованиеЦБ;
		ЭкземплярCorporateActionWtrc.externalMessageId = УникальныйИдентификатор;
		
		ТипОсновнойКоллекции.Проверить(ЭкземплярCorporateActionWtrc);
		Прокси.CreateCorporateActionWtrc(ЭкземплярCorporateActionWtrc);
		
		ОпубликованоУспешно = Истина;
		
	Исключение
		ОпубликованоУспешно = Ложь;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = "Ошибка при вызове Web-сервиса CreateCorporateActionWtrc. "
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(мИмяСобытияУведомлениеОКД, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
	КонецПопытки;
	
	Возврат ОпубликованоУспешно;
	
КонецФункции

Функция РезультатДобавленияКлиентаВСуществующееКорпоративноеДействиеWTRC(ПараметрыWebСервиса,
	УникальныйИдентификатор) Экспорт
	
	Для Каждого СтрокаДанных Из ПараметрыWebСервиса.Данные Цикл
		Попытка	
			Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
			ПространствоИмен = Прокси.ТочкаПодключения.Интерфейс.URIПространстваИмен;
			Фабрика = Прокси.ФабрикаXDTO;
				
			ТипЭкземпляра = Фабрика.Тип(ПространствоИмен, "CorporateActionClient1");
			ЭкземплярCorporateActionClient1 = Фабрика.Создать(ТипЭкземпляра);
			ЭкземплярCorporateActionClient1.ClientId = СтрокаДанных.ClientId;
			СтруктураКоллекции = ВебСервисыСервер.СтруктураДляСозданияКоллекции("ArrayOfCorporateActionClientSecurity1",
			"CorporateActionClientSecurity1", Неопределено);
			КоллекцияЦБКлиентов = ВебСервисыСервер.СоздатьИЗаполнитьКоллекциюОбъектаXDTO(Фабрика,
											СтрокаДанных, ПространствоИмен, СтруктураКоллекции);
			ЭкземплярCorporateActionClient1.Установить("CorporateActionClientSecurityCollection", КоллекцияЦБКлиентов);
			
			ТипЭкземпляра = Фабрика.Тип(ПространствоИмен, "ClientWtrc");
			ЭкземплярClientWtrc = Фабрика.Создать(ТипЭкземпляра);
			ЗаполнитьЗначенияСвойств(ЭкземплярClientWtrc, СтрокаДанных,
				"ClientId, DepoAccountFrom, DepoSectionFrom, DepoAccountTo, DepoSectionTo");
			
			ТипОсновнойКоллекции = Фабрика.Тип(ПространствоИмен, "AddClientToCorporateActionWtrc");
			
			ЭкземплярAddClientToCorporateActionWtrc = Фабрика.Создать(ТипОсновнойКоллекции);
			ЭкземплярAddClientToCorporateActionWtrc.clientProfile	= ЭкземплярCorporateActionClient1;
			ЭкземплярAddClientToCorporateActionWtrc.depoProfile		= ЭкземплярClientWtrc;
			ЭкземплярAddClientToCorporateActionWtrc.reference		= СокрЛП(ПараметрыWebСервиса.РеференсКД);
			ЭкземплярAddClientToCorporateActionWtrc.deadLineDateInstruction	= ПараметрыWebСервиса.ДатаОкончанияПриемаПоручений1_5;
			ЭкземплярAddClientToCorporateActionWtrc.emailSubject	= ПараметрыWebСервиса.ЗаголовокСообщения;
			ЭкземплярAddClientToCorporateActionWtrc.emailBody		= ПараметрыWebСервиса.ТекстСообщения;
			ЭкземплярAddClientToCorporateActionWtrc.secName 		= ПараметрыWebСервиса.НаименованиеЦБ;
			ЭкземплярAddClientToCorporateActionWtrc.externalMessageId = УникальныйИдентификатор;
			
			ТипОсновнойКоллекции.Проверить(ЭкземплярAddClientToCorporateActionWtrc);
			Прокси.AddClientToCorporateActionWtrc(ЭкземплярAddClientToCorporateActionWtrc);
			
			ОпубликованоУспешно = Истина;
			
		Исключение
			ОпубликованоУспешно = Ложь;
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставлениеОшибки = "Ошибка при вызове Web-сервиса AddClientToCorporateActionWtrc. "
				+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации(мИмяСобытияУведомлениеОКД, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
		КонецПопытки;
	КонецЦикла;

	Возврат ОпубликованоУспешно;
	
КонецФункции

Функция РезультатОтправкиУведомленияПоВозвратуЧастиНалога(ТаблицаКлиентов, РезультатЗапросаПоДокументуКД,
	ЗаголовокСообщения, ТекстСообщения, УникальныйИдентификатор, ВидКД) Экспорт

	ВыборкаДокументов = РезультатЗапросаПоДокументуКД.Выбрать();
	ВыборкаДокументов.Следующий();
	
	Попытка	
		Прокси				= ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
		ПространствоИмен	= Прокси.ТочкаПодключения.Интерфейс.URIПространстваИмен;
		Фабрика				= Прокси.ФабрикаXDTO;
			
		СтруктураКоллекции	= ВебСервисыСервер.СтруктураДляСозданияКоллекции("ArrayOfCorporateActionClientSecurity1",
			"CorporateActionClientSecurity1", Неопределено);
		СтруктураКоллекции	= ВебСервисыСервер.СтруктураДляСозданияКоллекции("ArrayOfCorporateActionClient1",
			"CorporateActionClient1", СтруктураКоллекции, "CorporateActionClientSecurityCollection");
		КоллекцияКлиентов	= ВебСервисыСервер.СоздатьИЗаполнитьКоллекциюОбъектаXDTO(Фабрика, ТаблицаКлиентов,
			ПространствоИмен, СтруктураКоллекции);
		
		ТипОсновнойКоллекции = Фабрика.Тип(ПространствоИмен, "CreateCorporateActionTrec");		
		ЭкземплярCorporateActionTrec = Фабрика.Создать(ТипОсновнойКоллекции);
		ЗаполнитьЗначенияСвойств(ЭкземплярCorporateActionTrec, ВыборкаДокументов); 
		ЭкземплярCorporateActionTrec.Установить("clientsCollection", КоллекцияКлиентов);
		
		ЭкземплярCorporateActionTrec.emailSubject		= ЗаголовокСообщения;
		ЭкземплярCorporateActionTrec.emailBody			= ТекстСообщения;
		ЭкземплярCorporateActionTrec.externalMessageId	= УникальныйИдентификатор;
		ЭкземплярCorporateActionTrec.type 				= ВидКД;
		
		ТипОсновнойКоллекции.Проверить(ЭкземплярCorporateActionTrec);
		Прокси.CreateCorporateActionTrec(ЭкземплярCorporateActionTrec);
		
		ОпубликованоУспешно = Истина;
		
	Исключение
		ОпубликованоУспешно = Ложь;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(мИмяСобытияУведомлениеОКД, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
	КонецПопытки;
	
	Возврат ОпубликованоУспешно;
	
КонецФункции

// Вызывает метод ws для отправки информационного уведомления в кабинет клиента и на e-mail клиента
//
// Параметры:
//	ИдентификаторыКлиентов - массив строк, содержащий коды загрузки контрагентов по классификатору "Клиенты"
//	ЗаголовокСообщения - строка, тема сообщения эл.почты
//	ТекстСообщения - строка, тело сообщения эл.почты
//	УникальныйИдентификатор - строка, УИД документа
Функция РезультатОтправкиУведомленияИнформационного(ИдентификаторыКлиентов,	ЗаголовокСообщения, ТекстСообщения,
	УникальныйИдентификатор) Экспорт

	Попытка
		Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
		ПространствоИмен = Прокси.ТочкаПодключения.Интерфейс.URIПространстваИмен;
		Фабрика = Прокси.ФабрикаXDTO;
		
		ТипОсновнойКоллекции = Фабрика.Тип(ПространствоИмен, "SendEmailAboutCorporateActionToClients");
		ЭкземплярSendEmail = Фабрика.Создать(ТипОсновнойКоллекции);
		
		ТипСпискаКлиентов = Фабрика.Тип(ПространствоИмен, "ArrayOfString");
		МассивИД = Фабрика.Создать(ТипСпискаКлиентов);
		
		Для Каждого Ид Из ИдентификаторыКлиентов Цикл
			МассивИД.string.Добавить(СокрЛП(Ид));
		КонецЦикла;
		
		ЭкземплярSendEmail.clientsCollection	= МассивИД;
		ЭкземплярSendEmail.emailSubject			= ЗаголовокСообщения;
		ЭкземплярSendEmail.emailBody			= ТекстСообщения;
		ЭкземплярSendEmail.externalMessageId	= УникальныйИдентификатор;
		
		ТипОсновнойКоллекции.Проверить(ЭкземплярSendEmail);
		Прокси.SendEmailAboutCorporateActionToClients(ЭкземплярSendEmail);
		
		ОпубликованоУспешно = Истина;
		
	Исключение
		ОпубликованоУспешно = Ложь;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(мИмяСобытияУведомлениеОКД, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
	КонецПопытки;
	
	Возврат ОпубликованоУспешно;
	
КонецФункции

Функция РезультатОтправкиИнформационногоПисьмаКлиентам(ИдентификаторыКлиентов, ЗаголовокСообщения, ТекстСообщения) Экспорт

	Попытка
		Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
		ПространствоИмен = Прокси.ТочкаПодключения.Интерфейс.URIПространстваИмен;
		Фабрика = Прокси.ФабрикаXDTO;
		
		ТипОсновнойКоллекции = Фабрика.Тип(ПространствоИмен, "SendEmailToClients");
		ЭкземплярSendEmail = Фабрика.Создать(ТипОсновнойКоллекции);
		
		ТипСпискаКлиентов = Фабрика.Тип(ПространствоИмен, "ArrayOfString");
		МассивИД = Фабрика.Создать(ТипСпискаКлиентов);
		
		Для Каждого Ид Из ИдентификаторыКлиентов Цикл
			МассивИД.string.Добавить(СокрЛП(Ид));
		КонецЦикла;
		
		ЭкземплярSendEmail.clientIdList	= МассивИД;
		ЭкземплярSendEmail.Subject		= ЗаголовокСообщения;
		ЭкземплярSendEmail.Body			= ТекстСообщения;
		
		ТипОсновнойКоллекции.Проверить(ЭкземплярSendEmail);
		Прокси.SendEmailToClients(ЭкземплярSendEmail);
		
		ОпубликованоУспешно = Истина;
		
	Исключение
		ОпубликованоУспешно = Ложь;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(мИмяСобытияУведомлениеОКД, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
	КонецПопытки;
	
	Возврат ОпубликованоУспешно;
	
КонецФункции

// Возвращает статусы доставки уведомлений о КД из веб-сервиса или Неопределено в случае ошибки
//
// Параметры:
//	ДанныеУведомлений - таблица значений с колонками:
//		УникальныйИдентификатор - строка, УИД документа УведомлениеКлиентам
//		ИдентификаторыКлиентов - массив строк, содержащих код загрузки контрагента по классификатору "Клиенты"
//
// Возвращаемое значение:
//	Неопределено в случае ошибки
//	Иначе таблица значений с колонками:
//		GUID - строка, УИД документа УведомлениеКлиентам
//		ClientID - строка, содержащая код загрузки контрагента по классификатору "Клиенты"
//		Успешно - булево, Истина, если по данному документу и клиенту уведомление было доставлено, иначе Ложь
//
Функция СтатусыДоставкиУведомленийОКД(ДанныеУведомлений) Экспорт
	СтатусыДоставки = Новый ТаблицаЗначений;
	СтатусыДоставки.Колонки.Добавить("GUID");
	СтатусыДоставки.Колонки.Добавить("ClientId");
	СтатусыДоставки.Колонки.Добавить("Успешно");

	Попытка	
		Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
		ПространствоИмен = Прокси.ТочкаПодключения.Интерфейс.URIПространстваИмен;
		Фабрика = Прокси.ФабрикаXDTO;
		
		ТипЗапроса = Фабрика.Тип(ПространствоИмен, "CorpActionMessageRequest");
		КоллекцияУведомлений = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "ArrayOfCorpActionMessageRequest"));	
		
		Для Каждого Уведомление Из ДанныеУведомлений Цикл
			ЭкземплярЗапроса = Фабрика.Создать(ТипЗапроса); 
			ЭкземплярЗапроса.ExternalMessageId = Уведомление.УникальныйИдентификатор;
			
			ЭкземплярМассиваСтрок = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "ArrayOfString"));
			Для Каждого ClientID Из Уведомление.ИдентификаторыКлиентов Цикл
				ЭкземплярМассиваСтрок.String.Добавить(ClientID);
			КонецЦикла;
			
			ЭкземплярЗапроса.Установить("ClientIdList", ЭкземплярМассиваСтрок);
			КоллекцияУведомлений["CorpActionMessageRequest"].Добавить(ЭкземплярЗапроса);	
		КонецЦикла;
		
		ОтветВебСервиса = Прокси.CheckDeliveryForCorporateActions(КоллекцияУведомлений);
		
		Для Каждого ОбъектXDTO Из ОтветВебСервиса.CorpActionMessageResponse Цикл
			Если ОбъектXDTO.MessageNotFound Тогда
				ТекстОшибки = "Уведомление по УИД " + ОбъектXDTO.ExternalMessageId + " не найдено в СУДК";
				ЗаписьЖурналаРегистрации("Проверка доставки уведомлений в кабинет клиента",
					УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			Иначе 
				Для Каждого CorpActionMessageResponseDetail Из ОбъектXDTO.ClientsList.CorpActionMessageResponseDetail Цикл
					НоваяСтрока = СтатусыДоставки.Добавить();
					НоваяСтрока.GUID = ОбъектXDTO.ExternalMessageId;
					НоваяСтрока.ClientId = CorpActionMessageResponseDetail.ClientId;
					НоваяСтрока.Успешно = CorpActionMessageResponseDetail.IsDelivery;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	Исключение
		СтатусыДоставки = Неопределено;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации("Вызов внешнего веб-сервиса CheckDeliveryForCorporateActions",
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
	КонецПопытки;

	Возврат СтатусыДоставки;
	
КонецФункции

// Возвращает уведомления о КД в СУДК, отсутствующие в базе 1С веб-сервиса или Неопределено в случае ошибки
//
// Параметры:
//	ДанныеУведомлений - таблица значений с колонками:
//		УникальныйИдентификатор - строка, УИД документа УведомлениеКлиентам
//		ИдентификаторыКлиентов - массив строк, содержащих код загрузки контрагента по классификатору "Клиенты"
//
// Возвращаемое значение:
//	Неопределено в случае ошибки
//	Иначе таблица значений с колонками:
//		GUID - строка, УИД документа УведомлениеКлиентам
//		ClientID - строка, содержащая код загрузки контрагента по классификатору "Клиенты"
//
Функция УведомленияКДОтстутствующиеВ1С(ДанныеУведомлений, НачалоПериода, КонецПериода) Экспорт
	ОтсутствующиеУведомления = Новый ТаблицаЗначений;
	ОтсутствующиеУведомления.Колонки.Добавить("GUID");
	ОтсутствующиеУведомления.Колонки.Добавить("ClientId");

	Попытка	
		Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
		ПространствоИмен = Прокси.ТочкаПодключения.Интерфейс.URIПространстваИмен;
		Фабрика = Прокси.ФабрикаXDTO;
		
		ТипОсновнойКоллекции = Фабрика.Тип(ПространствоИмен, "CheckMissingMessagesForCorporateActions");
		ТипЗапроса = Фабрика.Тип(ПространствоИмен, "CorpActionMessageRequest");
		
		КоллекцияУведомлений = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "ArrayOfCorpActionMessageRequest"));	
		
		Для Каждого Уведомление Из ДанныеУведомлений Цикл
			ЭкземплярЗапроса = Фабрика.Создать(ТипЗапроса); 
			ЭкземплярЗапроса.ExternalMessageId = Уведомление.УникальныйИдентификатор;
			
			ЭкземплярМассиваСтрок = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "ArrayOfString"));
			Для Каждого ClientID Из Уведомление.ИдентификаторыКлиентов Цикл
				ЭкземплярМассиваСтрок.String.Добавить(ClientID);
			КонецЦикла;
			
			ЭкземплярЗапроса.Установить("ClientIdList", ЭкземплярМассиваСтрок);
			КоллекцияУведомлений["CorpActionMessageRequest"].Добавить(ЭкземплярЗапроса);	
		КонецЦикла;
		
		ЭкземплярCheckMissingMessages = Фабрика.Создать(ТипОсновнойКоллекции);
		ЭкземплярCheckMissingMessages.Установить("actualMessages", КоллекцияУведомлений);
		ЭкземплярCheckMissingMessages.beginDate = НачалоПериода; 
		ЭкземплярCheckMissingMessages.endDate = КонецПериода; 
		
		ТипОсновнойКоллекции.Проверить(ЭкземплярCheckMissingMessages);
		
		ОтветВебСервиса = Прокси.CheckMissingMessagesForCorporateActions(КоллекцияУведомлений,
			ЭкземплярCheckMissingMessages.beginDate, ЭкземплярCheckMissingMessages.endDate);
		
		Для Каждого ОбъектXDTO Из ОтветВебСервиса.CorpActionMessageResponse Цикл
			Для Каждого CorpActionMessageResponseDetail Из ОбъектXDTO.ClientsList.CorpActionMessageResponseDetail Цикл
				НоваяСтрока = ОтсутствующиеУведомления.Добавить();
				НоваяСтрока.GUID = ОбъектXDTO.ExternalMessageId;
				НоваяСтрока.ClientId = CorpActionMessageResponseDetail.ClientId;
			КонецЦикла;
		КонецЦикла;
		
	Исключение
		ОтсутствующиеУведомления = Неопределено;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации("Вызов внешнего веб-сервиса CheckMissingMessagesForCorporateActions",
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
	КонецПопытки;

	Возврат ОтсутствующиеУведомления;
	
КонецФункции

// Возвращает таблицу с данными о всех созданных в кабинете клиента (КК) заявлениях на участие в оферте,
// которые подписаны клиентом, но еще не были загруженны в 1С ДЕПО
// Возвращаемое значение:
//	ТаблицаЗначений - со следующими колонками:
//							DocumentNumber - номер в СЭД
//							ClientId - идентификатор клиента в СУДК (строка(9))
//							ISIN - ISIN ЦБ
//							RegNumber - государственный регистрационный номер ЦБ
//							StockBondsCount - число ЦБ к оферте
//							OfferDate - дата оферты
//							DocumentId - ID заявки
//							CreatedAt - дата создания заявки в кабинете клиента 
Функция НовыеЗаявленияНаУчастиеВОферте() Экспорт
	
	Заявления = Документы.ЗаявлениеНаУчастиеВОферте.НоваяТаблицаДляЗаявленийИзКабинетаКлиента();
	
	Попытка
		Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
		ПространствоИмен 		= Прокси.ТочкаПодключения.Интерфейс.URIПространстваИмен;
		WSМетодТип 				= Прокси.ФабрикаXDTO.Тип(ПространствоИмен, "GetSignedOfferRequests");
		ПараметрыМетода = Прокси.ФабрикаXDTO.Создать(WSМетодТип);
		
		ОтветВебСервиса = Прокси.GetSignedOfferRequests(ПараметрыМетода);
		
		Для Каждого ОбъектXDTO Из ОтветВебСервиса.GetSignedOfferRequestsResult.OfferRequestResult Цикл
			НоваяСтрокаТЗ = Заявления.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, ОбъектXDTO);
		КонецЦикла;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки);
		ЗаписьЖурналаРегистрации("Вызов внешнего веб-сервиса для получения из КК новых заявлений на участие в оферте",
									УровеньЖурналаРегистрации.Ошибка, Метаданные(), , ПодробноеПредставлениеОшибки);
	КонецПопытки;
	
	Возврат Заявления;
	
КонецФункции

// Возвращает таблицу с данными о всех имеющихся в кабинете клиента (КК) подписанных заявлениях на участие в оферте
// за указанный период.
// Параметры:
//	ДатаНачала - дата
//	ДатаОкончания - дата
// Возвращаемое значение:
//	ТаблицаЗначений - со следующими колонками:
//							DocumentNumber - номер в СЭД
//							ClientId - идентификатор клиента в СУДК (строка(9))
//							ISIN - ISIN ЦБ
//							RegNumber - государственный регистрационный номер ЦБ
//							StockBondsCount - число ЦБ к оферте
//							OfferDate - дата оферты
//							DocumentId - ID заявки
//							Exported1C - завка была выгружена в 1С
//							CreatedAt - дата создания заявки в кабинете клиента
Функция ЗаявленияНаУчастиеВОфертеЗаПериод(ДатаНачала, ДатаОкончания) Экспорт
	
	Заявления = Документы.ЗаявлениеНаУчастиеВОферте.НоваяТаблицаДляЗаявленийИзКабинетаКлиента();
	
	Попытка
		Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
		
		ОтветВебСервиса = Прокси.GetSignedOfferRequestsByPeriod(ДатаНачала, ДатаОкончания);
		
		Для Каждого ОбъектXDTO Из ОтветВебСервиса.OfferRequestResult Цикл
			НоваяСтрокаТЗ = Заявления.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, ОбъектXDTO);
		КонецЦикла;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки);
		ЗаписьЖурналаРегистрации("Вызов внешнего веб-сервиса для получения из КК заявлений на участие в оферте за период",
									УровеньЖурналаРегистрации.Ошибка, Метаданные(), , ПодробноеПредставлениеОшибки);
	КонецПопытки;
	
	Возврат Заявления;
	
КонецФункции

// Сообщает СУДК какие заявления были успешно загружены в 1С ДЕПО
// Параметры:
//	ЗагруженныеЗаявления - Массив - массив DocumentId, представляющих собой целые числа
Процедура СообщитьСУДКЧтоЗаявленияНаУчастиеВОфертеЗагружены(ЗагруженныеЗаявления) Экспорт
	
	Попытка
		Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
		ПространствоИмен = Прокси.ТочкаПодключения.Интерфейс.URIПространстваИмен;
		Фабрика = Прокси.ФабрикаXDTO;
		WSМетодТип = Фабрика.Тип(ПространствоИмен, "SetOfferRequestExported1C");
		ПараметрыМетода = Прокси.ФабрикаXDTO.Создать(WSМетодТип);
		ТипArrayOfInt = Фабрика.Тип(ПространствоИмен, "ArrayOfInt");
		documentIds = Фабрика.Создать(ТипArrayOfInt);
		Для Каждого id Из ЗагруженныеЗаявления Цикл
			documentIds.Int.Добавить(id);
		КонецЦикла;
		ПараметрыМетода.documentIds = documentIds;
		
		Прокси.SetOfferRequestExported1C(ПараметрыМетода);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации("Вызов внешнего веб-сервиса для получения из КК новых заявлений на участие в оферте",
									УровеньЖурналаРегистрации.Ошибка, Метаданные(), , ПодробноеПредставлениеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мИмяСобытия = "Вызов внешнего веб-сервиса для загрузки поручений на участие в КД";
мИмяСобытияУведомлениеОКД = "Вызов внешнего веб-сервиса для отправки уведомления о КД";
ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
