Процедура ВыполнениеЗагрузкиПоСтандартнойСхеме() Экспорт
	//-------------------------------------------------------
	СписокФайловДляОбработки	= Новый Массив;
	//-------------------------------------------------------
	НеБылоОшибки					= Истина;
	ОписаниеОшибки					= "";
	//-------------------------------------------------------
	ПапкаСФайлами					= РаботаСФайлами.СоздатьВременныйКаталог(ОписаниеОшибки);
	УдалятьКаталогФайловПриОшибке	= Истина;
	//-------------------------------------------------------
	ИмяФайла						= "Estimation" + Формат(ДатаЗагрузки, "ДФ='ММгг'") + ".zip";
	//-------------------------------------------------------
	Если ПапкаСФайлами = Неопределено Тогда
		#Если Клиент Тогда
			// Если выполняем на клиенте, то материмся на экран
			Предупреждение(ОписаниеОшибки);
		#Иначе
			// На сервере делаем запись в ЖР
			ЗаписьЖурналаРегистрации("Загрузка оценки стоимости ЦБ из НРД", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		#КонецЕсли
		//---
		Если УдалятьКаталогФайловПриОшибке Тогда
			РаботаСФайлами.УдалитьКаталог(ПапкаСФайлами, ОписаниеОшибки);	
		КонецЕсли;	
		//---
		Возврат;
	КонецЕсли; 
	//-------------------------------------------------------
	
	Если ЭтотОбъект.ВариантЗагрузки = 0 Тогда
		ЗагрузитьФайл(ЭтотОбъект.ПутьКФайлуЗагрузки,ИмяФайла, ПапкаСФайлами, НеБылоОшибки, ОписаниеОшибки);
	Иначе
		СкачатьФайл(ИмяФайла, ПапкаСФайлами, НеБылоОшибки, ОписаниеОшибки);
	КонецЕсли;
	
	//-------------------------------------------------------
	Если Не НеБылоОшибки Тогда
		#Если Клиент Тогда
			// Если выполняем на клиенте, то материмся на экран
			Предупреждение(ОписаниеОшибки);
		#Иначе
			// На сервере делаем запись в ЖР
			ЗаписьЖурналаРегистрации("Загрузка оценки стоимости ЦБ из НРД", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		#КонецЕсли
		//---
		Если УдалятьКаталогФайловПриОшибке Тогда
			РаботаСФайлами.УдалитьКаталог(ПапкаСФайлами, ОписаниеОшибки);	
		КонецЕсли;	
		//---
		Возврат;
	КонецЕсли; 
	//-------------------------------------------------------
	СписокФайловДляОбработки.Добавить(ИмяФайла);
	//-------------------------------------------------------
	Загрузить(ПапкаСФайлами, ИмяФайла, НеБылоОшибки, СписокФайловДляОбработки);
	//-------------------------------------------------------
	НеБылоОшибки	= РаботаСФайлами.УдалитьФайлыВУказаннойПапке(ПапкаСФайлами, СписокФайловДляОбработки, ОписаниеОшибки);
	//-------------------------------------------------------
	Если Не НеБылоОшибки Тогда
		#Если Клиент Тогда
			// Если выполняем на клиенте, то материмся на экран
			Предупреждение(ОписаниеОшибки);
		#Иначе
			// На сервере делаем запись в ЖР
			ЗаписьЖурналаРегистрации("Загрузка оценки стоимости ЦБ из НРД", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		#КонецЕсли
		
		Если УдалятьКаталогФайловПриОшибке Тогда
			РаботаСФайлами.УдалитьКаталог(ПапкаСФайлами, ОписаниеОшибки);	
		КонецЕсли;	
		
		Возврат;
	Иначе
		РаботаСФайлами.УдалитьКаталог(ПапкаСФайлами, ОписаниеОшибки);	
	КонецЕсли; 
КонецПроцедуры

Процедура Загрузить(ПапкаСФайлами, ИмяФайла, НеБылоОшибки, СписокФайловДляОбработки) Экспорт 
	//-------------------------------------------------------
	// Распаковываем скопированный архив и обрабатываем нужные файлы
	Попытка
		АрхивZIP	= Новый ЧтениеZipФайла(ПапкаСФайлами+ИмяФайла);
		АрхивZIP.ИзвлечьВсе(ПапкаСФайлами, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
		// Обходим список файлов архива и дополняем список файлов которые потом будем очищать
		АрхивZIPЭлементы	= АрхивZIP.Элементы;
		Для сч = 0 По АрхивZIPЭлементы.Количество()-1 Цикл
			СписокФайловДляОбработки.Добавить(АрхивZIPЭлементы.Получить(сч).Имя);
		КонецЦикла; 
		//-------------------------------------------------------
		АрхивZIP.Закрыть();
	Исключение
		#Если Клиент Тогда
			ПоказатьОповещениеПользователя(,
			ПолучитьНавигационнуюСсылку(Обработки.ЗагрузкаОценкиСтоимостиЦБИзНРД.ПолучитьФорму()),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			БиблиотекаКартинок.Ошибка32);
		#КонецЕсли
		ЗаписьЖурналаРегистрации(
		"Загрузка оценки стоимости ЦБ из НРД", 
		УровеньЖурналаРегистрации.Ошибка, 
		Метаданные.Обработки.ЗагрузкаОценкиСтоимостиЦБИзНРД,, 
		КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		НеБылоОшибки	= Ложь;
		
		Возврат;
	КонецПопытки;
	//-------------------------------------------------------
	Файлы = НайтиФайлы(ПапкаСФайлами, "*.dbf");
	Если Не (Файлы.Количество() > 0) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяDBF = Лев(Файлы[0].Имя, 8) + ".dbf";
	
	// Файлы DBF могут быть с именем не более 8 символов (иначе не откроются),
	// поэтому обрезаем лишние символы в названии
	ПереместитьФайл(Файлы[0].ПолноеИмя, Файлы[0].Путь + ИмяDBF);
	
	СписокФайловДляОбработки.Добавить(ИмяDBF);
	
	ЗагрузитьТаблицуОценокИзФайлаDBF(Файлы[0].Путь + ИмяDBF);
	ЗаполнитьКотировкиИзТаблицы(ОценкаСтоимостиЦБ);
КонецПроцедуры

// Загрузка оценок ценных бумаг из НРД в таблицу на форме
Процедура ЗагрузитьТаблицуОценокИзФайлаDBF(ИмяФайла) Экспорт
	
	ОценкаСтоимостиЦБ.Очистить();
	
	БазаDBF = Новый XBase(ИмяФайла,, Истина);
	БазаDBF.Кодировка = КодировкаXBase.OEM;
	Если БазаDBF.Открыта() Тогда
		БазаDBF.Первая();
		Пока НЕ БазаDBF.ВКонце() Цикл
			SECURITY = СокрЛП(БазаDBF.SECURITY);
			Если (ЗагрузитьЗаМесяц ИЛИ БазаDBF.DATE = ДатаЗагрузки) И (Найти(SECURITY, "/DR") = 0) Тогда
				НоваяСтрока = ОценкаСтоимостиЦБ.Добавить();
				НоваяСтрока.КодНРД = SECURITY;
				//НоваяСтрока.НаименованиеЦБ = СокрЛП(БазаDBF.S_NAME);
				НоваяСтрока.ДатаОценки = БазаDBF.DATE;
				НоваяСтрока.РыночнаяЦена = БазаDBF.ESTIMAT;
			КонецЕсли;
			БазаDBF.Следующая()
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Заполнение котировок ценных бумаг из заполненной таблицы
Процедура ЗаполнитьКотировкиИзТаблицы(ТаблицаИсточник) Экспорт
	
	//////////////////////////////////////////////////////////////////////
	// Создаем пакет запросов
	//////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"////////////////////////////////////////////////////////////
	|// Создаем временную таблицу
	|////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	КодНРД,
	|	ДатаОценки,
	|	РыночнаяЦена
	|ПОМЕСТИТЬ
	|	ТаблицаОценокСтоимостиЦБ
	|ИЗ
	|	&ТЗ КАК ТЗ;
	|
	|////////////////////////////////////////////////////////////
	|// Ищем ценные бумаги без кода НРД, но с кодом ММВБ
	|////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаОценокСтоимостиЦБ.КодНРД,
	|	КодыЗагрузкиММВБ.Владелец КАК ЦеннаяБумага,
	|	КодыЗагрузкиММВБ.Ссылка КАК КодЗагрузки
	|ИЗ
	|	ТаблицаОценокСтоимостиЦБ КАК ТаблицаОценокСтоимостиЦБ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиММВБ
	|	ПО ТаблицаОценокСтоимостиЦБ.КодНРД = КодыЗагрузкиММВБ.Код
	|	И КодыЗагрузкиММВБ.Биржа = ЗНАЧЕНИЕ(Справочник.Биржи.MICEX)
	|	И КодыЗагрузкиММВБ.Владелец ССЫЛКА Справочник.ЦенныеБумаги
	|	И НЕ КодыЗагрузкиММВБ.ПометкаУдаления
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиНДЦ
	|	ПО ТаблицаОценокСтоимостиЦБ.КодНРД = КодыЗагрузкиНДЦ.Код
	|	И КодыЗагрузкиНДЦ.Биржа = &НДЦ
	|	И КодыЗагрузкиНДЦ.Владелец ССЫЛКА Справочник.ЦенныеБумаги
	|	И НЕ КодыЗагрузкиНДЦ.ПометкаУдаления
	|ГДЕ
	|	КодыЗагрузкиНДЦ.Ссылка IS NULL
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОценокСтоимостиЦБ.КодНРД,
	|	КодыЗагрузкиММВБ.Владелец,
	|	КодыЗагрузкиММВБ.Ссылка;
	|
	|////////////////////////////////////////////////////////////
	|// Ищем коды НРД с битыми ссылками
	|////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаОценокСтоимостиЦБ.КодНРД,
	|	КодыЗагрузкиНДЦ.Владелец КАК ЦеннаяБумага,
	|	КодыЗагрузкиНДЦ.Ссылка КАК КодЗагрузки
	|ИЗ
	|	ТаблицаОценокСтоимостиЦБ КАК ТаблицаОценокСтоимостиЦБ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиНДЦ
	|	ПО ТаблицаОценокСтоимостиЦБ.КодНРД = КодыЗагрузкиНДЦ.Код
	|	И КодыЗагрузкиНДЦ.Биржа = &НДЦ
	|	И КодыЗагрузкиНДЦ.Владелец ССЫЛКА Справочник.ЦенныеБумаги
	|	И НЕ КодыЗагрузкиНДЦ.ПометкаУдаления
	|ГДЕ
	|	КодыЗагрузкиНДЦ.Владелец.Ссылка IS NULL И НЕ КодыЗагрузкиНДЦ.Владелец = ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОценокСтоимостиЦБ.КодНРД,
	|	КодыЗагрузкиНДЦ.Владелец,
	|	КодыЗагрузкиНДЦ.Ссылка;
	|
	|////////////////////////////////////////////////////////////
	|// Ищем бумаги в справочнике по кодам загрузки НРД
	|////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаОценокСтоимостиЦБ.ДатаОценки,
	|	МАКСИМУМ(ТаблицаОценокСтоимостиЦБ.РыночнаяЦена),
	|	КодыЗагрузки.Владелец КАК ЦеннаяБумага
	|ИЗ
	|	ТаблицаОценокСтоимостиЦБ КАК ТаблицаОценокСтоимостиЦБ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|	ПО ТаблицаОценокСтоимостиЦБ.КодНРД = КодыЗагрузки.Код
	|	И КодыЗагрузки.Биржа = &НДЦ
	|	И КодыЗагрузки.Владелец ССЫЛКА Справочник.ЦенныеБумаги
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|ГДЕ
	|	НЕ (КодыЗагрузки.Владелец.Ссылка IS NULL И НЕ КодыЗагрузки.Владелец = ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка))
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОценокСтоимостиЦБ.ДатаОценки,
	|	КодыЗагрузки.Владелец
	|ИТОГИ ПО
	|	ТаблицаОценокСтоимостиЦБ.ДатаОценки";
	Запрос.УстановитьПараметр("ТЗ", ТаблицаИсточник);
	Запрос.УстановитьПараметр("НДЦ", Справочники.КлассификаторыЗагрузки.НДЦ());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	
	//////////////////////////////////////////////////////////////////////
	// КОНТРОЛЬ ОШИБОК (если будет мешать - можно закомментить)
	//////////////////////////////////////////////////////////////////////
	
	#Если Клиент Тогда
		Состояние("Выполняется контроль ошибок в базе");
	#КонецЕсли
	
	// Контроль ошибок - ищем ЦБ без кода НРД,
	// а заодно коды загрузки ММВБ без владельца
	ВыборкаКодыММВБ = РезультатЗапроса[1].Выбрать();
	Пока ВыборкаКодыММВБ.Следующий() Цикл
		Если ВыборкаКодыММВБ.ЦеннаяБумага.ПолучитьОбъект() = Неопределено Тогда
			#Если Клиент Тогда
				Сообщить("Код загрузки ММВБ "  + СокрЛП(ВыборкаКодыММВБ.КодНРД) + 
				" не имеет владельца - ценной бумаги (битая ссылка)!", СтатусСообщения.Внимание);
			#КонецЕсли
			ЗаписьЖурналаРегистрации(
			"Код загрузки с битой ссылкой!", 
			УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.КодыЗагрузки,
			ВыборкаКодыММВБ.КодЗагрузки, 
			"Код загрузки ММВБ "  + СокрЛП(ВыборкаКодыММВБ.КодНРД) + 
			" не имеет владельца - ценной бумаги (битая ссылка)!");
			Продолжить;
		Иначе
			#Если Клиент Тогда
				Сообщить("Ценная бумага "  + СокрЛП(ВыборкаКодыММВБ.ЦеннаяБумага.Наименование) + 
				" не имеет кода загрузки НРД(НДЦ) " + СокрЛП(ВыборкаКодыММВБ.КодНРД) + 
				", но имеет такой код ММВБ!", 
				СтатусСообщения.Внимание);
			#КонецЕсли
			ЗаписьЖурналаРегистрации(
			"Ценная бумага не имеет кода НРД(НДЦ)!", 
			УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.ЦенныеБумаги,
			ВыборкаКодыММВБ.ЦеннаяБумага, 
			"Ценная бумага "  + СокрЛП(ВыборкаКодыММВБ.ЦеннаяБумага.Наименование) + 
			" не имеет кода загрузки НРД(НДЦ) " + СокрЛП(ВыборкаКодыММВБ.КодНРД) + 
			", но имеет такой код ММВБ!");
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	// Контроль ошибок - ищем коды НРД с битыми ссылками
	ВыборкаКодыНРД = РезультатЗапроса[2].Выбрать();
	Пока ВыборкаКодыНРД.Следующий() Цикл
		#Если Клиент Тогда
			Сообщить("Код загрузки НРД(НДЦ) "  + СокрЛП(ВыборкаКодыНРД.КодНРД) + 
			" не имеет владельца - ценной бумаги (битая ссылка)!", СтатусСообщения.Внимание);
		#КонецЕсли
		ЗаписьЖурналаРегистрации(
		"Код загрузки с битой ссылкой!", 
		УровеньЖурналаРегистрации.Ошибка, 
		Метаданные.Справочники.КодыЗагрузки,
		ВыборкаКодыНРД.КодЗагрузки, 
		"Код загрузки НРД(НДЦ) "  + СокрЛП(ВыборкаКодыНРД.КодНРД) + 
		" не имеет владельца - ценной бумаги (битая ссылка)!");
	КонецЦикла;
	
	//////////////////////////////////////////////////////////////////////
	// ЗАГРУЗКА КОТИРОВОК
	//////////////////////////////////////////////////////////////////////
	
	// По коду НРД ищем ценные бумаги
	ВыборкаПоДатамКотировок = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	МестоХраненияНРД = Справочники.МестаХранения.НайтиПоКоду("НРД");
	РежимТорговРыночный = Справочники.РежимыТоргов.Рыночный;
	
	Пока ВыборкаПоДатамКотировок.Следующий() Цикл
		
		ДатаОценки = ВыборкаПоДатамКотировок.ДатаОценки;
		
		ЗаписиКотировокЦБ = РегистрыСведений.Котировки.СоздатьНаборЗаписей();
		ЗаписиКотировокЦБ.Отбор.Период.Установить(ДатаОценки);
		ЗаписиКотировокЦБ.Отбор.Биржа.Установить(МестоХраненияНРД);
		// т.к. пустой режим торгов запрещен - ставим Рыночный
		ЗаписиКотировокЦБ.Отбор.РежимТоргов.Установить(Справочники.РежимыТоргов.Рыночный);
		
		ЗаписиКотировокЦБ.Очистить();
		
		#Если Клиент Тогда
			Состояние("Загрузка котировок - за " + Формат(ДатаОценки, "ДЛФ=DD"));
		#КонецЕсли
		
		ВыборкаКотировки = ВыборкаПоДатамКотировок.Выбрать();
		
		Пока ВыборкаКотировки.Следующий() Цикл
			
			// Добавляем запись в регистр котировок
			ЗаписьКотировкиЦБ = ЗаписиКотировокЦБ.Добавить();
			ЗаписьКотировкиЦБ.Период = ДатаОценки;
			ЗаписьКотировкиЦБ.Биржа = МестоХраненияНРД;
			ЗаписьКотировкиЦБ.ЦеннаяБумага = ВыборкаКотировки.ЦеннаяБумага;
			ЗаписьКотировкиЦБ.РежимТоргов = РежимТорговРыночный;
			ЗаписьКотировкиЦБ.РыночнаяЦена	= ВыборкаКотировки.РыночнаяЦена;
			
		КонецЦикла;
		
		ЗаписьЖурналаРегистрации("ЗагрузкаОценкиСтоимостиЦБИзНРД", УровеньЖурналаРегистрации.Информация,,, "Запись котировок за " + Формат(ДатаОценки, "ДФ=dd.MM.yyyy"));
		ЗаписиКотировокЦБ.Записать(Истина);
		
	КонецЦикла;
	
	// Красиво всё логируем
	#Если Клиент Тогда
		ПоказатьОповещениеПользователя(,
		ПолучитьНавигационнуюСсылку(Обработки.ЗагрузкаОценкиСтоимостиЦБИзНРД.ПолучитьФорму()),
		"Котировки обновлены",
		БиблиотекаКартинок.Информация32);
	#КонецЕсли
	ЗаписьЖурналаРегистрации(
	"Загрузка оценки стоимости ЦБ из НРД", 
	УровеньЖурналаРегистрации.Информация, 
	Метаданные.Обработки.ЗагрузкаОценкиСтоимостиЦБИзНРД,, 
	"Котировки обновлены");
	
КонецПроцедуры // ЗаполнитьКотировкиИзТаблицы()

Процедура СкачатьФайл(ИмяФайла, ПапкаСФайлами, НеБылоОшибки = Истина, ОписаниеОшибки = "") Экспорт
	Перем HTTP;
	
	СерверИсточник	= "";
	// Подключаемся к серверу
	ПараметрыИсточника	= ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.ВебСервисНРД);
	ПараметрыИсточника.Свойство("Сервер", СерверИсточник);
	
	Если СерверИсточник = Неопределено Тогда
		НеБылоОшибки	= Ложь;
		ОписаниеОшибки	= "Не удалось получить параметры источника";
		Возврат;
	КонецЕсли;	
	
	#Если Клиент Тогда
		Состояние("Получение файла с " + СерверИсточник);
	#КонецЕсли
	// Файл всех котировок за месяц хранится по адресу:
	// http://www.nsd.ru/common/files/estimation/EstimationMMYY.zip
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("zip");
	Адрес = "estimation/" + ИмяФайла;
	
	ОбработкаПолученияФайлов = Обработки.ПолучениеФайловИзИнтернета.Создать();
	УдачнаяЗагрузка = Ложь;
	
	Попытка
		УдачнаяЗагрузка = ОбработкаПолученияФайлов.ЗапроситьФайлыССервера(СерверИсточник, Адрес, ИмяВременногоФайла, HTTP);
	Исключение
		ЗаписьЖурналаРегистрации("Загрузка оценки стоимости ЦБ из НРД",  УровеньЖурналаРегистрации.Ошибка, Метаданные.Обработки.ЗагрузкаОценкиСтоимостиЦБИзНРД,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если УдачнаяЗагрузка Тогда
		ПереместитьФайл(ИмяВременногоФайла, ПапкаСФайлами + ИмяФайла);
	Иначе
		// Оповещаем об ошибке пользователя
		#Если Клиент Тогда
			ПоказатьОповещениеПользователя(,
			ПолучитьНавигационнуюСсылку(Обработки.ЗагрузкаОценкиСтоимостиЦБИзНРД.ПолучитьФорму()),
			"Неудачная попытка соединения с " + СерверИсточник,
			БиблиотекаКартинок.Ошибка32);
		#КонецЕсли
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузитьФайл(ПутьКФайлу,ИмяФайла, ПапкаСФайлами, НеБылоОшибки = Истина, ОписаниеОшибки = "") Экспорт
	
	ПутьКФайлу = СокрЛП(ПутьКФайлуЗагрузки) + "\" + ИмяФайла;
	
	ПереместитьФайл(ПутьКФайлу, ПапкаСФайлами + ИмяФайла);
	
КонецПроцедуры 

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
