
#Область ОбработчикиСобытийФормы

// BSLLS:CognitiveComplexity-off

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИмяНастроекСервиса") И ЗначениеЗаполнено(Параметры.ИмяНастроекСервиса) Тогда
		ИмяНастроекСервиса = Параметры.ИмяНастроекСервиса;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Настройки	= MarketData.НастройкиСервисаAPI(ИмяНастроекСервиса);
	
	// Период загрузки
	Если Настройки.Свойство("ТипПериодаЗагрузкиКотировок") Тогда
		ТипПериодаЗагрузкиКотировок = Настройки.ТипПериодаЗагрузкиКотировок;
	Иначе
		ТипПериодаЗагрузкиКотировок = Перечисления.ПериодыДней.ПредыдущийДень;
	КонецЕсли;
	
	// Не процентные поля котировок
	Если Настройки.Свойство("НеПроцентныеПоля") Тогда
		НеПроцентныеПоля = Настройки.НеПроцентныеПоля;
	Иначе
		НеПроцентныеПоля = "vol,val";
	КонецЕсли;
	
	// Не процентные поля котировок
	Если Настройки.Свойство("КромеЦенныхБумагRU") Тогда
		КромеЦенныхБумагRU = Настройки.КромеЦенныхБумагRU;
	Иначе
		КромеЦенныхБумагRU = Ложь;
	КонецЕсли;
	
	// Ограничение на количество ценных бумаг
	Если Настройки.Свойство("ОграничениеПоКоличествуISIN") Тогда
		ОграничениеПоКоличествуISIN = Настройки.ОграничениеПоКоличествуISIN;
	Иначе
		ОграничениеПоКоличествуISIN = 0;
	КонецЕсли;
	
	// Биржа
	Если Настройки.Свойство("ЗагружатьКотировкиПоПервичнойБирже") Тогда
		ЗагружатьКотировкиПоПервичнойБирже = Настройки.ЗагружатьКотировкиПоПервичнойБирже;
	Иначе
		ЗагружатьКотировкиПоПервичнойБирже = Ложь;
	КонецЕсли;
	
	// Прочий поиск площадок
	Если Настройки.Свойство("ОбязательныйВыборПлощадкиСогласноСортировке") Тогда
		ОбязательныйВыборПлощадкиСогласноСортировке = Настройки.ОбязательныйВыборПлощадкиСогласноСортировке;
	Иначе
		ОбязательныйВыборПлощадкиСогласноСортировке = Ложь;
	КонецЕсли;
	Если Настройки.Свойство("ОбязательныйВыборПлощадкиПолеСортировки") Тогда
		ОбязательныйВыборПлощадкиПолеСортировки = Настройки.ОбязательныйВыборПлощадкиПолеСортировки;
	Иначе
		ОбязательныйВыборПлощадкиПолеСортировки = "";
	КонецЕсли;
	
	// Список выбора полей котировок
	MarketData.ДопустимыеГрафыКотировок(ИменаГрафКотировок);
	Для Каждого ИмяГрафыКотировки Из ИменаГрафКотировок Цикл
		Элементы.ПоляКотировокКолонкаКотировки.СписокВыбора.Добавить(ИмяГрафыКотировки.Значение,
			ИмяГрафыКотировки.Представление);
		Элементы.ПоляКотировокСПБКолонкаКотировки.СписокВыбора.Добавить(ИмяГрафыКотировки.Значение,
			ИмяГрафыКотировки.Представление);
		Элементы.ПоляКотировокНРДКолонкаКотировки.СписокВыбора.Добавить(ИмяГрафыКотировки.Значение,
			ИмяГрафыКотировки.Представление);
	КонецЦикла;
	
	НастроитьТабличныеЧасти(Настройки);
	
	ОбновитьСписокРегламентныхЗаданий();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТорговыеПлощадкиКотировки

// ТОРГОВЫЕ ПЛОЩАДКИ НРД (КОТИРОВКИ)

&НаКлиенте
Процедура ПоляКотировокНРДКолонкаКотировкиПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ТорговыеПлощадкиНРД_Котировки_Поля.ТекущиеДанные;
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденноеЗначение = ИменаГрафКотировок.НайтиПоЗначению(СтрокаТЧ.КолонкаКотировки);
	Если НайденноеЗначение = Неопределено Тогда
		СтрокаТЧ.КолонкаКотировкиСиноним = "";
	Иначе
		СтрокаТЧ.КолонкаКотировкиСиноним = НайденноеЗначение.Представление;
	КонецЕсли;
	
КонецПроцедуры

// ТОРГОВЫЕ ПЛОЩАДКИ СПБ (КОТИРОВКИ)

&НаКлиенте
Процедура ПоляКотировокСПБКолонкаКотировкиПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ТорговыеПлощадкиСПБ_Котировки_Поля.ТекущиеДанные;
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденноеЗначение = ИменаГрафКотировок.НайтиПоЗначению(СтрокаТЧ.КолонкаКотировки);
	Если НайденноеЗначение = Неопределено Тогда
		СтрокаТЧ.КолонкаКотировкиСиноним = "";
	Иначе
		СтрокаТЧ.КолонкаКотировкиСиноним = НайденноеЗначение.Представление;
	КонецЕсли;
	
КонецПроцедуры

// ПРОЧИЕ ТОРГОВЫЕ ПЛОЩАДКИ (КОТИРОВКИ)

&НаКлиенте
Процедура ПоляКотировокКолонкаКотировкиПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ПрочиеТорговыеПлощадки_Котировки_Поля.ТекущиеДанные;
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденноеЗначение = ИменаГрафКотировок.НайтиПоЗначению(СтрокаТЧ.КолонкаКотировки);
	Если НайденноеЗначение = Неопределено Тогда
		СтрокаТЧ.КолонкаКотировкиСиноним = "";
	Иначе
		СтрокаТЧ.КолонкаКотировкиСиноним = НайденноеЗначение.Представление;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокРегламентныхЗаданий

&НаКлиенте
Процедура СписокРегламентныхЗаданийПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока = Элементы.СписокРегламентныхЗаданий.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТекущиеДанные = СписокРегламентныхЗаданий.НайтиПоИдентификатору(ТекущаяСтрока);
	Если ТекущиеДанные <> Неопределено Тогда
		СвойстваПоследнегоВыполненного = ПолучитьСвойстваПоследнегоВыполненного(ТекущиеДанные.Идентификатор);
		ТекущиеДанные.Состояние = СвойстваПоследнегоВыполненного.Состояние;
		ТекущиеДанные.Выполнялось = СвойстваПоследнегоВыполненного.Выполнялось;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокРегламентныхЗаданийПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ВыделенныеСтроки = Элементы.СписокРегламентныхЗаданий.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() > 0 Тогда
		
		Строка = СписокРегламентныхЗаданий.НайтиПоИдентификатору(ВыделенныеСтроки.Получить(0));
		
		СтруктураПараметров = Новый Структура;
		Ид = Строка.Идентификатор;
		СтруктураПараметров.Вставить("ИдентификаторЗадания", Ид);
		
		ОписаниеОповещенияОЗакрытии =
			Новый ОписаниеОповещения("СписокРегламентныхЗаданийПередНачаломИзмененияЗавершение", ЭтотОбъект);
		
		ОткрытьФорму(ПолучитьПолноеИмяФормы("ДиалогРегламентногоЗадания"), СтруктураПараметров,
			ЭтотОбъект, , , , ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокРегламентныхЗаданийПередНачаломИзмененияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия <> Неопределено Тогда
		ОбновитьСписокРегламентныхЗаданий();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Отказ = Ложь;
	ПроверитьВозможностьСохраненияНастроекПередЗаписьюНаСервере(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	СохранитьНастройкиНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВозможностьСохраненияНастроекПередЗаписьюНаСервере(Отказ)
	
	// 1. Проверяем заполнение полей котировок
	Для Индекс = 0 По ПрочиеТорговыеПлощадки_Котировки_Поля.Количество() - 1 Цикл
		СтрокаПолейКотировок = ПрочиеТорговыеПлощадки_Котировки_Поля.Получить(Индекс);
		Если Не ЗначениеЗаполнено(СтрокаПолейКотировок.КолонкаКотировки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено значение колонки котировки", ,
				"ПрочиеТорговыеПлощадки_Котировки_Поля[" + Индекс + "].КолонкаКотировки", , Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	СтруктураНастроек = Новый Структура();
	СтруктураНастроек.Вставить("ТЗ_ТорговыеПлощадкиСПБ",
		XMLСтрока(Новый ХранилищеЗначения(ТорговыеПлощадкиСПБ_Котировки.Выгрузить())));
	СтруктураНастроек.Вставить("ТЗ_ПоляКотировокСПБ",
		XMLСтрока(Новый ХранилищеЗначения(ТорговыеПлощадкиСПБ_Котировки_Поля.Выгрузить())));
	СтруктураНастроек.Вставить("ТЗ_ПрочиеТорговыеПлощадки",
		XMLСтрока(Новый ХранилищеЗначения(ПрочиеТорговыеПлощадки_Котировки.Выгрузить())));
	СтруктураНастроек.Вставить("ТЗ_ПоляКотировок",
		XMLСтрока(Новый ХранилищеЗначения(ПрочиеТорговыеПлощадки_Котировки_Поля.Выгрузить())));
	СтруктураНастроек.Вставить("ТЗ_ТорговыеПлощадкиНРД",
		XMLСтрока(Новый ХранилищеЗначения(ТорговыеПлощадкиНРД_Котировки.Выгрузить())));
	СтруктураНастроек.Вставить("ТЗ_ПоляКотировокНРД",
		XMLСтрока(Новый ХранилищеЗначения(ТорговыеПлощадкиНРД_Котировки_Поля.Выгрузить())));
	
	СтруктураНастроек.Вставить("ТипПериодаЗагрузкиКотировок"					, ТипПериодаЗагрузкиКотировок);
	СтруктураНастроек.Вставить("НеПроцентныеПоля"								, НеПроцентныеПоля);
	СтруктураНастроек.Вставить("КромеЦенныхБумагRU"								, КромеЦенныхБумагRU);
	СтруктураНастроек.Вставить("ОграничениеПоКоличествуISIN"					, ОграничениеПоКоличествуISIN);
	СтруктураНастроек.Вставить("ЗагружатьКотировкиПоПервичнойБирже"				, ЗагружатьКотировкиПоПервичнойБирже);
	СтруктураНастроек.Вставить("ОбязательныйВыборПлощадкиПолеСортировки"		, ОбязательныйВыборПлощадкиПолеСортировки);
	СтруктураНастроек.Вставить("ОбязательныйВыборПлощадкиСогласноСортировке"	, ОбязательныйВыборПлощадкиСогласноСортировке);
	
	MarketData.УстановитьНастройкиСервиса(ИмяНастроекСервиса, СтруктураНастроек);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ГлобальнаяНастройкаПроксиАдрес(Команда)
	
	ПараметрыГлобальныеРедактирование("ПроксиСерверАдрес");
	
КонецПроцедуры

&НаКлиенте
Процедура ГлобальнаяНастройкаПроксиПорт(Команда)
	
	ПараметрыГлобальныеРедактирование("ПроксиСерверПорт");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТорговуюПлощадкуИзКлассификатора(Команда)
	
	ПараметрыФормыНастроек = Новый Структура;
	ПараметрыФормыНастроек.Вставить("ИмяНастроекСервиса", ИмяНастроекСервиса);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодобратьТорговуюПлощадкуИзКлассификатораЗавершение", ЭтотОбъект);
	ИмяФормыОткрытия = "Обработка.СервисыMarketDataAPI.Форма.ВыборПрочейТорговойПлощадки";
	ОткрытьФорму(ИмяФормыОткрытия, ПараметрыФормыНастроек, ЭтотОбъект, УникальныйИдентификатор, , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТорговуюПлощадкуИзКлассификатораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементРезультата Из Результат Цикл
		
		ПараметрыПоиска = Новый Структура("Идентификатор", ЭлементРезультата.Идентификатор);
		НайденныеСтроки = ПрочиеТорговыеПлощадки_Котировки.НайтиСтроки(ПараметрыПоиска);
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ПрочиеТорговыеПлощадки_Котировки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементРезультата);
		Если ИмяНастроекСервиса = "НастройкиCBonds" Тогда
			НоваяСтрока.Биржа = ПредопределенноеЗначение("Справочник.ИнформационноАналитическиеСистемы.CBonds");
		Иначе
			НоваяСтрока.Биржа = ПредопределенноеЗначение("Справочник.ИнформационноАналитическиеСистемы.Интерфакс");
		КонецЕсли;
		Модифицированность = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПолеКотировкиИзКлассификатора(Команда)
	
	ПараметрыФормыНастроек = Новый Структура;
	ПараметрыФормыНастроек.Вставить("ИмяНастроекСервиса", ИмяНастроекСервиса);
	Если ИмяНастроекСервиса = "НастройкиCBonds" Тогда
		ПараметрыФормыНастроек.Вставить("ВидАктива", "Облигации");
	Иначе
		ПараметрыФормыНастроек.Вставить("ВидАктива", "");
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодобратьПолеКотировкиИзКлассификатораЗавершение", ЭтотОбъект);
	ИмяФормыОткрытия = "Обработка.СервисыMarketDataAPI.Форма.ВыборПолейПрочейТорговойПлощадки";
	ОткрытьФорму(ИмяФормыОткрытия, ПараметрыФормыНастроек, ЭтотОбъект, УникальныйИдентификатор, , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПолеКотировкиИзКлассификатораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ПрочиеТорговыеПлощадки_Котировки.ТекущиеДанные;
	Если ТекДанные = Неопределено Или Не ЗначениеЗаполнено(ТекДанные.Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные.Биржа) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрана Биржа.");
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементРезультата Из Результат Цикл
		
		Отбор = Новый Структура("Идентификатор, ИдентификаторБиржи",
			ЭлементРезультата.Идентификатор, 0);
		Если ПрочиеТорговыеПлощадки_Котировки_Поля.НайтиСтроки(Отбор).Количество() = 0 Тогда
			
			НоваяСтрока = ПрочиеТорговыеПлощадки_Котировки_Поля.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементРезультата);
			НоваяСтрока.ИдентификаторБиржи = 0;
			
			Модифицированность = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ПрочиеТорговыеПлощадки_Котировки_Поля.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТорговуюПлощадкуСПБИзКлассификатора(Команда)
	
	ПараметрыФормыНастроек = Новый Структура;
	ПараметрыФормыНастроек.Вставить("ИмяНастроекСервиса", ИмяНастроекСервиса);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодобратьТорговуюПлощадкуСПБИзКлассификатораЗавершение", ЭтотОбъект);
	ИмяФормыОткрытия = "Обработка.СервисыMarketDataAPI.Форма.ВыборПрочейТорговойПлощадки";
	ОткрытьФорму(ИмяФормыОткрытия, ПараметрыФормыНастроек, ЭтотОбъект, УникальныйИдентификатор, , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТорговуюПлощадкуСПБИзКлассификатораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементРезультата Из Результат Цикл
		
		ПараметрыПоиска = Новый Структура("Идентификатор", ЭлементРезультата.Идентификатор);
		НайденныеСтроки = ТорговыеПлощадкиСПБ_Котировки.НайтиСтроки(ПараметрыПоиска);
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТорговыеПлощадкиСПБ_Котировки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементРезультата);
		Если ИмяНастроекСервиса = "НастройкиCBonds" Тогда
			НоваяСтрока.Биржа = ПредопределенноеЗначение("Справочник.ИнформационноАналитическиеСистемы.CBonds");
		Иначе
			НоваяСтрока.Биржа = ПредопределенноеЗначение("Справочник.Биржи.GPBEX");
		КонецЕсли;
		Модифицированность = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПолеКотировкиСПБИзКлассификатора(Команда)
	
	ПараметрыФормыНастроек = Новый Структура;
	ПараметрыФормыНастроек.Вставить("ИмяНастроекСервиса", ИмяНастроекСервиса);
	Если ИмяНастроекСервиса = "НастройкиCBonds" Тогда
		ПараметрыФормыНастроек.Вставить("ВидАктива", "Облигации");
	Иначе
		ПараметрыФормыНастроек.Вставить("ВидАктива", "");
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодобратьПолеКотировкиСПБИзКлассификатораЗавершение", ЭтотОбъект);
	ИмяФормыОткрытия = "Обработка.СервисыMarketDataAPI.Форма.ВыборПолейПрочейТорговойПлощадки";
	ОткрытьФорму(ИмяФормыОткрытия, ПараметрыФормыНастроек, ЭтотОбъект, УникальныйИдентификатор, , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПолеКотировкиСПБИзКлассификатораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ТорговыеПлощадкиСПБ_Котировки.ТекущиеДанные;
	Если ТекДанные = Неопределено Или Не ЗначениеЗаполнено(ТекДанные.Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные.Биржа) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрана Биржа.");
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементРезультата Из Результат Цикл
		
		Отбор = Новый Структура("Идентификатор, ИдентификаторБиржи",
			ЭлементРезультата.Идентификатор, 0);
		Если ТорговыеПлощадкиСПБ_Котировки_Поля.НайтиСтроки(Отбор).Количество() = 0 Тогда
			
			НоваяСтрока = ТорговыеПлощадкиСПБ_Котировки_Поля.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементРезультата);
			НоваяСтрока.ИдентификаторБиржи = 0;
			
			Модифицированность = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ТорговыеПлощадкиСПБ_Котировки_Поля.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПолеКотировкиНРДИзКлассификатора(Команда)
	
	ПараметрыФормыНастроек = Новый Структура;
	ПараметрыФормыНастроек.Вставить("ИмяНастроекСервиса", ИмяНастроекСервиса);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодобратьПолеКотировкиНРДИзКлассификатораЗавершение", ЭтотОбъект);
	ИмяФормыОткрытия = "Обработка.СервисыMarketDataAPI.Форма.ВыборПолейПрочейТорговойПлощадки";
	ОткрытьФорму(ИмяФормыОткрытия, ПараметрыФормыНастроек, ЭтотОбъект, УникальныйИдентификатор, , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПолеКотировкиНРДИзКлассификатораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементРезультата Из Результат Цикл
		
		Отбор = Новый Структура("Идентификатор, ИдентификаторБиржи",
			ЭлементРезультата.Идентификатор, "0");
		Если ТорговыеПлощадкиНРД_Котировки_Поля.НайтиСтроки(Отбор).Количество() = 0 Тогда
			
			НоваяСтрока = ТорговыеПлощадкиНРД_Котировки_Поля.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементРезультата);
			НоваяСтрока.ИдентификаторБиржи = "0";
			
			Модифицированность = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ТорговыеПлощадкиНРД_Котировки_Поля.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРегламентныеЗадания(Команда)
	ОбновитьСписокРегламентныхЗаданий();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеРегламентногоЗадания(Команда)
	ВыделенныеСтроки = Элементы.СписокРегламентныхЗаданий.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() > 0 Тогда
		
		Строка = СписокРегламентныхЗаданий.НайтиПоИдентификатору(ВыделенныеСтроки.Получить(0));
		Расписание = ПолучитьРасписаниеРегламентногоЗадания(Строка.Идентификатор);
		Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
		ОписаниеОповещенияОЗакрытии =
			Новый ОписаниеОповещения("ДиалогРасписанияРегламентногоЗаданияОткрытьЗавершение", ЭтотОбъект);
		
		Диалог.Показать(ОписаниеОповещенияОЗакрытии);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДиалогРасписанияРегламентногоЗаданияОткрытьЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	Если Расписание <> Неопределено Тогда
		ВыделенныеСтроки = Элементы.СписокРегламентныхЗаданий.ВыделенныеСтроки;
		Если ВыделенныеСтроки.Количество() > 0 Тогда
			Строка = СписокРегламентныхЗаданий.НайтиПоИдентификатору(ВыделенныеСтроки.Получить(0));
			УстановитьРасписаниеРегламентногоЗадания(Строка.Идентификатор, Строка.Наименование, Расписание, Строка.Метаданные);
			Строка.Расписание = Расписание;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТестДоступностиНРД(Команда)
	
	ТестДоступностиНРДНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеФормой()
	
	Если ИмяНастроекСервиса = "НастройкиИнтерфакс" Тогда
		
		Элементы.СтраницаНастройкиТорговыхПлощадокСПБ.Видимость		 = Истина;
		Элементы.СтраницаНастройкиПрочихТорговыхПлощадок.Видимость	 = Истина;
		Элементы.НеПроцентныеПоля.Видимость							 = Истина;
		Элементы.СтраницаНастройкиТорговыхПлощадокНРД.Видимость		 = Ложь;
		Элементы.ГруппаГлобальнаяНастройкаБиржа.Видимость			 = Ложь;
		
		Элементы.СтраницаНастройкиТорговыхПлощадокСПБ.Заголовок		 = "Торговые площадки СПБ";
		Элементы.СтрТорговыеПлощадкиСПБ_Котировки.Заголовок			 = "Котировки СПБ";
		Элементы.СтраницаТорговыеПлощадкиСПБ.Заголовок				 = "Торговые площадки СПБ (по убыванию приоритета)";
		
	КонецЕсли;
	Если ИмяНастроекСервиса = "НастройкиНРД" Тогда
		
		Элементы.СтраницаНастройкиТорговыхПлощадокСПБ.Видимость		 = Ложь;
		Элементы.СтраницаНастройкиПрочихТорговыхПлощадок.Видимость	 = Ложь;
		Элементы.НеПроцентныеПоля.Видимость							 = Ложь;
		Элементы.СтраницаНастройкиТорговыхПлощадокНРД.Видимость		 = Истина;
		Элементы.ГруппаГлобальнаяНастройкаБиржа.Видимость			 = Истина;
		
	КонецЕсли;
	Если ИмяНастроекСервиса = "НастройкиCBonds" Тогда
		
		Элементы.СтраницаНастройкиТорговыхПлощадокСПБ.Видимость		 = Истина;
		Элементы.СтраницаНастройкиПрочихТорговыхПлощадок.Видимость	 = Истина;
		Элементы.НеПроцентныеПоля.Видимость							 = Истина;
		Элементы.СтраницаНастройкиТорговыхПлощадокНРД.Видимость		 = Ложь;
		Элементы.ГруппаГлобальнаяНастройкаБиржа.Видимость			 = Ложь;
		
		Элементы.СтраницаНастройкиТорговыхПлощадокСПБ.Заголовок		 = "Торговые площадки [индикативные котировки]";
		Элементы.СтрТорговыеПлощадкиСПБ_Котировки.Заголовок			 = "Котировки [индикативные]";
		Элементы.СтраницаТорговыеПлощадкиСПБ.Заголовок				 = "Торговые площадки [индикативные котировки] (по убыванию приоритета)";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьТабличныеЧасти(Настройки)
	
	ТипХранилище = Тип("ХранилищеЗначения");
	
	Если Настройки.Свойство("ТЗ_ТорговыеПлощадкиСПБ") И ЗначениеЗаполнено(Настройки.ТЗ_ТорговыеПлощадкиСПБ) Тогда
		ТЗ_ТорговыеПлощадкиСПБ = XMLЗначение(ТипХранилище, Настройки.ТЗ_ТорговыеПлощадкиСПБ).Получить();
		ТорговыеПлощадкиСПБ_Котировки.Загрузить(ТЗ_ТорговыеПлощадкиСПБ);
	КонецЕсли;
	
	Если Настройки.Свойство("ТЗ_ПоляКотировокСПБ") И ЗначениеЗаполнено(Настройки.ТЗ_ПоляКотировокСПБ) Тогда
		ТЗ_ПоляКотировокСПБ = XMLЗначение(ТипХранилище, Настройки.ТЗ_ПоляКотировокСПБ).Получить();
		ТорговыеПлощадкиСПБ_Котировки_Поля.Загрузить(ТЗ_ПоляКотировокСПБ);
	КонецЕсли;
	
	Если Настройки.Свойство("ТЗ_ПрочиеТорговыеПлощадки") И ЗначениеЗаполнено(Настройки.ТЗ_ПрочиеТорговыеПлощадки) Тогда
		ТЗ_ПрочиеТорговыеПлощадки = XMLЗначение(ТипХранилище, Настройки.ТЗ_ПрочиеТорговыеПлощадки).Получить();
		ПрочиеТорговыеПлощадки_Котировки.Загрузить(ТЗ_ПрочиеТорговыеПлощадки);
	КонецЕсли;
	
	Если Настройки.Свойство("ТЗ_ПоляКотировок") И ЗначениеЗаполнено(Настройки.ТЗ_ПоляКотировок) Тогда
		ТЗ_ПоляКотировок = XMLЗначение(ТипХранилище, Настройки.ТЗ_ПоляКотировок).Получить();
		ПрочиеТорговыеПлощадки_Котировки_Поля.Загрузить(ТЗ_ПоляКотировок);
	КонецЕсли;
	
	Если Настройки.Свойство("ТЗ_ТорговыеПлощадкиНРД") И ЗначениеЗаполнено(Настройки.ТЗ_ТорговыеПлощадкиНРД) Тогда
		ТЗ_ТорговыеПлощадкиНРД = XMLЗначение(ТипХранилище, Настройки.ТЗ_ТорговыеПлощадкиНРД).Получить();
		ТорговыеПлощадкиНРД_Котировки.Загрузить(ТЗ_ТорговыеПлощадкиНРД);
	КонецЕсли;
	
	Если Настройки.Свойство("ТЗ_ПоляКотировокНРД") И ЗначениеЗаполнено(Настройки.ТЗ_ПоляКотировокНРД) Тогда
		ТЗ_ПоляКотировокНРД = XMLЗначение(ТипХранилище, Настройки.ТЗ_ПоляКотировокНРД).Получить();
		ТорговыеПлощадкиНРД_Котировки_Поля.Загрузить(ТЗ_ПоляКотировокНРД);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыГлобальныеРедактирование(ИмяПараметра)
	
	#Если ВебКлиент Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'В веб-клиенте редактирование невозможно.'"));
		Возврат;
	#КонецЕсли
	
	МассивСтруктураЗаписи = Новый Массив;
	СтруктураЗаписи = Новый Структура("ИмяПараметра", ИмяПараметра);
	МассивСтруктураЗаписи.Добавить(СтруктураЗаписи);
	КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.ПараметрыГлобальные", МассивСтруктураЗаписи);
	ПараметрыФормы = Новый Структура("Ключ", КлючЗаписи);
	ОткрытьФорму("РегистрСведений.ПараметрыГлобальные.ФормаЗаписи", ПараметрыФормы);
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции_РегламентныеЗадания

&НаКлиенте
Функция ПолучитьПолноеИмяФормы(ИмяПодчиненнойФормы)
	
	Возврат Лев(ИмяФормы, СтрНайти(ИмяФормы, ".Форма.") + 6 ) + ИмяПодчиненнойФормы; // BSLLS:MagicNumber-off
	
КонецФункции

&НаСервере
Функция ПолучитьРасписаниеРегламентногоЗадания(УникальныйНомерЗадания)
	ОбъектЗадания = ПолучитьОбъектРегламентногоЗадания(УникальныйНомерЗадания);
	Если ОбъектЗадания = Неопределено Тогда
		Возврат Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Возврат ОбъектЗадания.Расписание;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСвойстваПоследнегоВыполненного(ИдентификаторРегламентногоЗадания, РегламентноеВходящее = Неопределено)
	Результат = Новый Структура("Выполнялось, Состояние");
	Если РегламентноеВходящее = Неопределено Тогда
		Регламентное = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегламентногоЗадания);
	Иначе
		Регламентное = РегламентноеВходящее;
	КонецЕсли;
	Если Регламентное <> Неопределено Тогда
		Попытка
			ПоследнееЗадание = Регламентное.ПоследнееЗадание;
		Исключение
			ПоследнееЗадание = Неопределено;
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Возврат Результат;
		КонецПопытки;
		
		Если ПоследнееЗадание <> Неопределено Тогда
			Результат.Выполнялось = Строка(ПоследнееЗадание.Начало);
			Результат.Состояние = Строка(ПоследнееЗадание.Состояние);
		КонецЕсли;
		
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ОбновитьСписокРегламентныхЗаданий()
	
	Перем ТекущийИдентификатор;
	
	ТекущаяСтрока = Элементы.СписокРегламентныхЗаданий.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекСтрока = СписокРегламентныхЗаданий.НайтиПоИдентификатору(ТекущаяСтрока);
		ТекущийИдентификатор = ТекСтрока.Идентификатор;
	КонецЕсли;
	
	Идентификаторы = Новый Массив;
	
	ВыделенныеСтроки = Элементы.СписокРегламентныхЗаданий.ВыделенныеСтроки;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		ТекСтрока = СписокРегламентныхЗаданий.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Идентификаторы.Добавить(ТекСтрока.Идентификатор);
	КонецЦикла;
	
	СписокРегламентныхЗаданий.Очистить();
	
	Если ИмяНастроекСервиса = "НастройкиИнтерфакс" Тогда
		РегламентноеЗадание = Метаданные.РегламентныеЗадания.СервисыИнтерфакса;
	ИначеЕсли ИмяНастроекСервиса = "НастройкиНРД" Тогда
		РегламентноеЗадание = Метаданные.РегламентныеЗадания.СервисыНРД;
	ИначеЕсли ИмяНастроекСервиса = "НастройкиCBonds" Тогда
		РегламентноеЗадание = Метаданные.РегламентныеЗадания.СервисыCBonds;
	Иначе
		Возврат;
	КонецЕсли;
	Отбор = Новый Структура("Метаданные", РегламентноеЗадание);
	Попытка
		Регламентные = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки;
	
	Для Каждого Регламентное Из Регламентные Цикл
		НоваяСтрока = СписокРегламентныхЗаданий.Добавить();
		НоваяСтрока.Метаданные = Регламентное.Метаданные.Представление();
		НоваяСтрока.Наименование = Регламентное.Наименование;
		НоваяСтрока.Ключ = Регламентное.Ключ;
		НоваяСтрока.Расписание = Регламентное.Расписание;
		НоваяСтрока.Пользователь = Регламентное.ИмяПользователя;
		НоваяСтрока.Предопределенное = Регламентное.Предопределенное;
		НоваяСтрока.Использование = Регламентное.Использование;
		НоваяСтрока.Идентификатор = Регламентное.УникальныйИдентификатор;
		НоваяСтрока.Метод = Регламентное.Метаданные.ИмяМетода;
		
		СвойстваПоследнегоВыполненного = ПолучитьСвойстваПоследнегоВыполненного(НоваяСтрока.Идентификатор, Регламентное);
		НоваяСтрока.Состояние = СвойстваПоследнегоВыполненного.Состояние;
		НоваяСтрока.Выполнялось = СвойстваПоследнегоВыполненного.Выполнялось;
		
	КонецЦикла;
	
	СписокРегламентныхЗаданий.Сортировать("Метаданные");
	
	Если ТекущийИдентификатор <> Неопределено Тогда
		Строки = СписокРегламентныхЗаданий.НайтиСтроки(Новый Структура("Идентификатор", ТекущийИдентификатор));
		Если Строки.Количество() > 0 Тогда
			Элементы.СписокРегламентныхЗаданий.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	Если Идентификаторы.Количество() > 0 Тогда
		ВыделенныеСтроки.Очистить();
	КонецЕсли;
	
	Для Каждого Идентификатор Из Идентификаторы Цикл
		Строки = СписокРегламентныхЗаданий.НайтиСтроки(Новый Структура("Идентификатор", Идентификатор));
		Если Строки.Количество() > 0 Тогда
			ВыделенныеСтроки.Добавить(Строки[0].ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция УстановитьРасписаниеРегламентногоЗадания(Идентификатор, Наименование, Расписание, ИмяЗадания)
	ОбъектЗадания = ПолучитьОбъектРегламентногоЗадания(Идентификатор);
	Если ОбъектЗадания = Неопределено Тогда
		РедОбъектЗадания = РегламентныеЗадания.СоздатьРегламентноеЗадание(ИмяЗадания);
		РедОбъектЗадания.Наименование = Наименование;
		РедОбъектЗадания.Использование = Истина;
	Иначе
		РедОбъектЗадания = ОбъектЗадания;
	КонецЕсли;
	
	РедОбъектЗадания.Расписание = Расписание;
	Попытка
		РедОбъектЗадания.Записать();
	Исключение
		ВызватьИсключение "Произошла ошибка при сохранении расписания выполнения обменов.
		|Возможно данные расписания были изменены. Закройте форму настройки и повторите попытку изменения расписания еще раз.
		|Подробное описание ошибки: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

&НаСервере
Функция ПолучитьОбъектРегламентногоЗадания(УникальныйНомерЗадания)
	
	Попытка
		
		Если Не ПустаяСтрока(УникальныйНомерЗадания) Тогда
			УникальныйИдентификаторЗадания = Новый УникальныйИдентификатор(УникальныйНомерЗадания);
			ТекущееРегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(УникальныйИдентификаторЗадания);
		Иначе
			ТекущееРегламентноеЗадание = Неопределено;
		КонецЕсли;
		
	Исключение
		ТекущееРегламентноеЗадание = Неопределено;
	КонецПопытки;
	
	Возврат ТекущееРегламентноеЗадание;
	
КонецФункции

&НаСервере
Процедура ТестДоступностиНРДНаСервере()
	
	НастройкиСоединения = NSDAPI.ПараметрыИсточника();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Accept", "application/json");
	
	Запрос = Новый HTTPЗапрос();
	Запрос.Заголовки = Заголовки;
	Запрос.АдресРесурса = НастройкиСоединения.HTTPСервисАдресРесурса
		+ "?apikey=" + НастройкиСоединения.HTTPСервисПароль
		+ "&filter={%22isin%22:%22MHY8565N3002%22}&limit=1";
	
	Если НастройкиСоединения.ПроксиСерверИспользовать Тогда
		ПроксиСервер = Новый ИнтернетПрокси;
		ПроксиСервер.Установить("https", НастройкиСоединения.ПроксиСерверАдрес, НастройкиСоединения.ПроксиСерверПорт);
		Соединение = Новый HTTPСоединение("nsddata.ru", 443, , , ПроксиСервер, 10, Новый ЗащищенноеСоединениеOpenSSL());
	Иначе
		Соединение = Новый HTTPСоединение("nsddata.ru", 443, , , , 10, Новый ЗащищенноеСоединениеOpenSSL());
	КонецЕсли;
	
	Ответ = Соединение.Получить(Запрос);
	КодСостояния = Ответ.КодСостояния;
	СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();
	КодСостояния200 = 200;
	
	Если КодСостояния = КодСостояния200 Тогда
		ОтветJSON = Новый ЧтениеJSON;
		ОтветJSON.УстановитьСтроку(СтрокаОтвета);
		РезультатЧтения = ПрочитатьJSON(ОтветJSON);
		ОтветJSON.Закрыть();
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Успех: " + КодСостояния);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка: " + КодСостояния);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
