
Процедура ЗаполнитьДанныеСчетаАмериканскихЦБWTRC()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТЗ.НомерСтроки КАК НомерСтроки,
	|	ТЗ.ISIN КАК ISIN,
	|	ТЗ.LEIКодСубброкера КАК LEIКодСубброкера,
	|	ТЗ.АдресМестонахожденияРегистрацииАдрес КАК АдресМестонахожденияРегистрацииАдрес,
	|	ТЗ.АдресМестонахожденияРегистрацииИндекс КАК АдресМестонахожденияРегистрацииИндекс,
	|	ТЗ.АдресМестонахожденияРегистрацииСтрана КАК АдресМестонахожденияРегистрацииСтрана,
	|	ТЗ.АдресПочтовыйАдрес КАК АдресПочтовыйАдрес,
	|	ТЗ.АдресПочтовыйИндекс КАК АдресПочтовыйИндекс,
	|	ТЗ.АдресПочтовыйСтрана КАК АдресПочтовыйСтрана,
	|	ТЗ.ГражданствоФЛ КАК ГражданствоФЛ,
	|	ТЗ.ДатаРожденияФЛ КАК ДатаРожденияФЛ,
	|	ТЗ.ДоговорСубброкера КАК ДоговорСубброкера,
	|	ТЗ.ДокументВладельцаДатаВыдачи КАК ДокументВладельцаДатаВыдачи,
	|	ТЗ.ДокументВладельцаНомер КАК ДокументВладельцаНомер,
	|	ТЗ.ДокументВладельцаОрганВыдачи КАК ДокументВладельцаОрганВыдачи,
	|	ТЗ.ДокументВладельцаСерия КАК ДокументВладельцаСерия,
	|	ТЗ.ДокументВладельцаТип КАК ДокументВладельцаТип,
	|	ТЗ.КодЗагрузкиЦБ КАК КодЗагрузкиЦБ,
	|	ТЗ.КодКлиента КАК КодКлиента,
	|	ТЗ.КодСубброкера КАК КодСубброкера,
	|	ТЗ.КодСубклиента КАК КодСубклиента,
	|	ТЗ.Количество КАК Количество,
	|	ТЗ.НаличиеНалоговыхЛьгот КАК НаличиеНалоговыхЛьгот,
	|	ТЗ.НалоговаяСтавка КАК НалоговаяСтавка,
	|	ТЗ.НомерСчетаДепоКлиента КАК НомерСчетаДепоКлиента,
	|	ТЗ.ПолноеНаименованиеЛица КАК ПолноеНаименованиеЛица,
	|	ТЗ.ПолноеНаименованиеЮЛФЛСубклиента КАК ПолноеНаименованиеЮЛФЛСубклиента,
	|	ТЗ.ПризнакЮЛФЛ КАК ПризнакЮЛФЛ,
	|	ТЗ.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ТЗ.СтатусНалогоплательщика КАК СтатусНалогоплательщика,
	|	ТЗ.Субброкер КАК Субброкер,
	|	ТЗ.Субклиент КАК Субклиент,
	|	ТЗ.СчетДепо КАК СчетДепо,
	|	ТЗ.ТипСчета КАК ТипСчета,
	|	ТЗ.ЦеннаяБумага КАК ЦеннаяБумага
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.НомерСтроки КАК НомерСтроки,
	|	ТЗ.ISIN КАК ISIN,
	|	ТЗ.LEIКодСубброкера КАК LEIКодСубброкера,
	|	ТЗ.АдресМестонахожденияРегистрацииАдрес КАК АдресМестонахожденияРегистрацииАдрес,
	|	ТЗ.АдресМестонахожденияРегистрацииИндекс КАК АдресМестонахожденияРегистрацииИндекс,
	|	ТЗ.АдресМестонахожденияРегистрацииСтрана КАК АдресМестонахожденияРегистрацииСтрана,
	|	ТЗ.АдресПочтовыйАдрес КАК АдресПочтовыйАдрес,
	|	ТЗ.АдресПочтовыйИндекс КАК АдресПочтовыйИндекс,
	|	ТЗ.АдресПочтовыйСтрана КАК АдресПочтовыйСтрана,
	|	ТЗ.ГражданствоФЛ КАК ГражданствоФЛ,
	|	ТЗ.ДатаРожденияФЛ КАК ДатаРожденияФЛ,
	|	ТЗ.ДоговорСубброкера КАК ДоговорСубброкера,
	|	ТЗ.ДокументВладельцаДатаВыдачи КАК ДокументВладельцаДатаВыдачи,
	|	ТЗ.ДокументВладельцаНомер КАК ДокументВладельцаНомер,
	|	ТЗ.ДокументВладельцаОрганВыдачи КАК ДокументВладельцаОрганВыдачи,
	|	ТЗ.ДокументВладельцаСерия КАК ДокументВладельцаСерия,
	|	ТЗ.ДокументВладельцаТип КАК ДокументВладельцаТип,
	|	ТЗ.КодЗагрузкиЦБ КАК КодЗагрузкиЦБ,
	|	ТЗ.КодКлиента КАК КодКлиента,
	|	ТЗ.КодСубброкера КАК КодСубброкера,
	|	ТЗ.КодСубклиента КАК КодСубклиента,
	|	ТЗ.Количество КАК Количество,
	|	ТЗ.НаличиеНалоговыхЛьгот КАК НаличиеНалоговыхЛьгот,
	|	ТЗ.НалоговаяСтавка КАК НалоговаяСтавка,
	|	ТЗ.НомерСчетаДепоКлиента КАК НомерСчетаДепоКлиента,
	|	ТЗ.ПолноеНаименованиеЛица КАК ПолноеНаименованиеЛица,
	|	ТЗ.ПолноеНаименованиеЮЛФЛСубклиента КАК ПолноеНаименованиеЮЛФЛСубклиента,
	|	ТЗ.ПризнакЮЛФЛ КАК ПризнакЮЛФЛ,
	|	ТЗ.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ТЗ.СтатусНалогоплательщика КАК СтатусНалогоплательщика,
	|	ТЗ.Субброкер КАК Субброкер,
	|	ТЗ.СчетДепо КАК СчетДепо,
	|	ТЗ.ТипСчета КАК ТипСчета,
	|	&ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ТЗ.РазделСчетаДепо КАК Справочник.РазделыСчетаДепо).РазделСубклиента
	|			ТОГДА ВЫРАЗИТЬ(ТЗ.РазделСчетаДепо КАК Справочник.РазделыСчетаДепо).Субклиент
	|		ИНАЧЕ ТЗ.ПолноеНаименованиеЛица
	|	КОНЕЦ КАК Субклиент
	|ИЗ
	|	ТЗ КАК ТЗ");
	
	Запрос.УстановитьПараметр("ТЗ",	ЭтотОбъект.Подтверждения.Выгрузить());
	Запрос.УстановитьПараметр("ЦеннаяБумага",	ЭтотОбъект.ЦеннаяБумага);
	ТаблицаПодтверждений    = Запрос.Выполнить().Выгрузить();	
	ЭтотОбъект.Подтверждения.Загрузить(ТаблицаПодтверждений);
	
КонецПроцедуры

Процедура ДополнитьПодтвержденияСсылкамиНаОбъекты() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТЗ.НомерСчетаДепоКлиента КАК НомерСчетаДепоКлиента,
	|	ТЗ.КодСубброкера КАК КодСубброкера,
	|	ТЗ.КодСубклиента КАК КодСубклиента,
	|	ТЗ.КодЗагрузкиЦБ КАК КодЗагрузкиЦБ,
	|	ТЗ.Количество КАК Количество,
	|	ТЗ.СчетДепо КАК СчетДепо,
	|	ТЗ.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ТЗ.СтатусНалогоплательщика КАК СтатусНалогоплательщика,
	|	ТЗ.НаличиеНалоговыхЛьгот КАК НаличиеНалоговыхЛьгот,
	|	ТЗ.КодКлиента КАК КодКлиента,
	|	ТЗ.ТипСчета КАК ТипСчета,
	|	ТЗ.НалоговаяСтавка КАК НалоговаяСтавка,
	|	ТЗ.ПолноеНаименованиеЛица КАК ПолноеНаименованиеЛица,
	|	ТЗ.АдресМестонахожденияРегистрацииСтрана КАК АдресМестонахожденияРегистрацииСтрана,
	|	ТЗ.АдресМестонахожденияРегистрацииИндекс КАК АдресМестонахожденияРегистрацииИндекс,
	|	ТЗ.АдресМестонахожденияРегистрацииАдрес КАК АдресМестонахожденияРегистрацииАдрес,
	|	ТЗ.ПризнакЮЛФЛ КАК ПризнакЮЛФЛ,
	|	ТЗ.ДокументВладельцаТип КАК ДокументВладельцаТип,
	|	ТЗ.ДокументВладельцаНомер КАК ДокументВладельцаНомер,
	|	ТЗ.ДокументВладельцаСерия КАК ДокументВладельцаСерия,
	|	ТЗ.ДокументВладельцаДатаВыдачи КАК ДокументВладельцаДатаВыдачи,
	|	ТЗ.ДокументВладельцаОрганВыдачи КАК ДокументВладельцаОрганВыдачи,
	|	ТЗ.ДатаРожденияФЛ КАК ДатаРожденияФЛ,
	|	ТЗ.ГражданствоФЛ КАК ГражданствоФЛ,
	|	ТЗ.ПолноеНаименованиеЮЛФЛСубклиента КАК ПолноеНаименованиеЮЛФЛСубклиента,
	|	ТЗ.АдресПочтовыйСтрана КАК АдресПочтовыйСтрана,
	|	ТЗ.АдресПочтовыйИндекс КАК АдресПочтовыйИндекс,
	|	ТЗ.АдресПочтовыйАдрес КАК АдресПочтовыйАдрес,
	|	ТЗ.LEIКодСубброкера КАК LEIКодСубброкера,
	|	ТЗ.ISIN КАК ISIN
	|ПОМЕСТИТЬ втДанныеФайла
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеФайла.КодСубброкера КАК КодСубброкера,
	|	ДанныеФайла.КодСубклиента КАК КодСубклиента,
	|	ДанныеФайла.КодЗагрузкиЦБ КАК КодЗагрузкиЦБ,
	|	ДанныеФайла.Количество КАК Количество,
	|	ДанныеФайла.СчетДепо КАК СчетДепо,
	|	ДанныеФайла.СтатусНалогоплательщика КАК СтатусНалогоплательщика,
	|	ДанныеФайла.НаличиеНалоговыхЛьгот КАК НаличиеНалоговыхЛьгот,
	|	ДанныеФайла.НалоговаяСтавка КАК НалоговаяСтавка,
	|	ЕСТЬNULL(Контрагенты.Ссылка, ВЫРАЗИТЬ(ДанныеФайла.СчетДепо КАК Справочник.СчетаДепо).Владелец) КАК Субброкер,
	|	ЕСТЬNULL(Договоры.Ссылка, ЕСТЬNULL(ДоговорыОбщегоРаздела.Ссылка, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))) КАК ДоговорСубброкера,
	|	ДоговорыОбщегоРаздела.Ссылка КАК ДоговорОбщегоРаздела,
	|	ЕСТЬNULL(Субклиенты.Ссылка, ДанныеФайла.ПолноеНаименованиеЛица) КАК Субклиент,
	|	КодыЗагрузкиЦБ.Владелец КАК ЦеннаяБумага,
	|	ДанныеФайла.КодКлиента КАК КодКлиента,
	|	ДанныеФайла.ТипСчета КАК ТипСчета,
	|	ДанныеФайла.НалоговаяСтавка КАК НалоговаяСтавка1,
	|	ДанныеФайла.ПолноеНаименованиеЛица КАК ПолноеНаименованиеЛица,
	|	ДанныеФайла.АдресМестонахожденияРегистрацииСтрана КАК АдресМестонахожденияРегистрацииСтрана,
	|	ДанныеФайла.АдресМестонахожденияРегистрацииИндекс КАК АдресМестонахожденияРегистрацииИндекс,
	|	ДанныеФайла.АдресМестонахожденияРегистрацииАдрес КАК АдресМестонахожденияРегистрацииАдрес,
	|	ДанныеФайла.ПризнакЮЛФЛ КАК ПризнакЮЛФЛ,
	|	ДанныеФайла.ДокументВладельцаТип КАК ДокументВладельцаТип,
	|	ДанныеФайла.ДокументВладельцаНомер КАК ДокументВладельцаНомер,
	|	ДанныеФайла.ДокументВладельцаСерия КАК ДокументВладельцаСерия,
	|	ДанныеФайла.ДокументВладельцаДатаВыдачи КАК ДокументВладельцаДатаВыдачи,
	|	ДанныеФайла.ДокументВладельцаОрганВыдачи КАК ДокументВладельцаОрганВыдачи,
	|	ДанныеФайла.ДатаРожденияФЛ КАК ДатаРожденияФЛ,
	|	ДанныеФайла.ГражданствоФЛ КАК ГражданствоФЛ,
	|	ДанныеФайла.ПолноеНаименованиеЮЛФЛСубклиента КАК ПолноеНаименованиеЮЛФЛСубклиента,
	|	ДанныеФайла.АдресПочтовыйСтрана КАК АдресПочтовыйСтрана,
	|	ДанныеФайла.АдресПочтовыйИндекс КАК АдресПочтовыйИндекс,
	|	ДанныеФайла.АдресПочтовыйАдрес КАК АдресПочтовыйАдрес,
	|	ДанныеФайла.LEIКодСубброкера КАК LEIКодСубброкера,
	|	ДанныеФайла.ISIN КАК ISIN,
	|	ДанныеФайла.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ДанныеФайла.НомерСчетаДепоКлиента КАК НомерСчетаДепоКлиента
	|ПОМЕСТИТЬ втСопоставленныеДанные
	|ИЗ
	|	втДанныеФайла КАК ДанныеФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (Контрагенты.Код = ДанныеФайла.КодСубброкера)
	|			И (Контрагенты.LEI = &КодLEI)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО (Договоры.Код = ДанныеФайла.КодСубброкера)
	|			И (Договоры.Владелец = Контрагенты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Субклиенты КАК Субклиенты
	|		ПО (ВЫРАЗИТЬ(ДанныеФайла.РазделСчетаДепо КАК Справочник.РазделыСчетаДепо).Субклиент = Субклиенты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиЦБ
	|		ПО (КодыЗагрузкиЦБ.Код = ДанныеФайла.КодЗагрузкиЦБ)
	|			И (КодыЗагрузкиЦБ.Владелец ССЫЛКА Справочник.ЦенныеБумаги)
	|			И ((ВЫРАЗИТЬ(КодыЗагрузкиЦБ.Биржа КАК Справочник.КлассификаторыЗагрузки)) = &НДЦ)
	|			И (КодыЗагрузкиЦБ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузкиЦБ.ДатаОкончанияДействия > &ДатаСреза)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыОбщегоРаздела
	|		ПО (ВЫРАЗИТЬ(ДанныеФайла.СчетДепо КАК Справочник.СчетаДепо).Владелец.Код = ДоговорыОбщегоРаздела.Код)
	|			И (НЕ ДоговорыОбщегоРаздела.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА втСопоставленныеДанные.КодСубброкера = """"
	|			ТОГДА ВЫРАЗИТЬ(втСопоставленныеДанные.Субброкер КАК Справочник.Контрагенты).Код
	|		ИНАЧЕ втСопоставленныеДанные.КодСубброкера
	|	КОНЕЦ КАК КодСубброкера,
	|	втСопоставленныеДанные.КодСубклиента КАК КодСубклиента,
	|	втСопоставленныеДанные.КодЗагрузкиЦБ КАК КодЗагрузкиЦБ,
	|	втСопоставленныеДанные.Количество КАК Количество,
	|	втСопоставленныеДанные.СчетДепо КАК СчетДепо,
	|	втСопоставленныеДанные.РазделСчетаДепо КАК РазделСчетаДепо,
	|	втСопоставленныеДанные.СтатусНалогоплательщика КАК СтатусНалогоплательщика,
	|	втСопоставленныеДанные.НаличиеНалоговыхЛьгот КАК НаличиеНалоговыхЛьгот,
	|	втСопоставленныеДанные.НалоговаяСтавка КАК НалоговаяСтавка,
	|	втСопоставленныеДанные.Субброкер КАК Субброкер,
	|	втСопоставленныеДанные.ДоговорСубброкера КАК ДоговорСубброкера,
	|	втСопоставленныеДанные.Субклиент КАК Субклиент,
	|	втСопоставленныеДанные.ЦеннаяБумага КАК ЦеннаяБумага,
	|	втСопоставленныеДанные.КодКлиента КАК КодКлиента,
	|	втСопоставленныеДанные.ТипСчета КАК ТипСчета,
	|	втСопоставленныеДанные.НалоговаяСтавка1 КАК НалоговаяСтавка1,
	|	втСопоставленныеДанные.ПолноеНаименованиеЛица КАК ПолноеНаименованиеЛица,
	|	втСопоставленныеДанные.АдресМестонахожденияРегистрацииСтрана КАК АдресМестонахожденияРегистрацииСтрана,
	|	втСопоставленныеДанные.АдресМестонахожденияРегистрацииИндекс КАК АдресМестонахожденияРегистрацииИндекс,
	|	втСопоставленныеДанные.АдресМестонахожденияРегистрацииАдрес КАК АдресМестонахожденияРегистрацииАдрес,
	|	втСопоставленныеДанные.ПризнакЮЛФЛ КАК ПризнакЮЛФЛ,
	|	втСопоставленныеДанные.ДокументВладельцаТип КАК ДокументВладельцаТип,
	|	втСопоставленныеДанные.ДокументВладельцаНомер КАК ДокументВладельцаНомер,
	|	втСопоставленныеДанные.ДокументВладельцаСерия КАК ДокументВладельцаСерия,
	|	втСопоставленныеДанные.ДокументВладельцаДатаВыдачи КАК ДокументВладельцаДатаВыдачи,
	|	втСопоставленныеДанные.ДокументВладельцаОрганВыдачи КАК ДокументВладельцаОрганВыдачи,
	|	втСопоставленныеДанные.ДатаРожденияФЛ КАК ДатаРожденияФЛ,
	|	втСопоставленныеДанные.ГражданствоФЛ КАК ГражданствоФЛ,
	|	втСопоставленныеДанные.ПолноеНаименованиеЮЛФЛСубклиента КАК ПолноеНаименованиеЮЛФЛСубклиента,
	|	втСопоставленныеДанные.АдресПочтовыйСтрана КАК АдресПочтовыйСтрана,
	|	втСопоставленныеДанные.АдресПочтовыйИндекс КАК АдресПочтовыйИндекс,
	|	втСопоставленныеДанные.АдресПочтовыйАдрес КАК АдресПочтовыйАдрес,
	|	втСопоставленныеДанные.LEIКодСубброкера КАК LEIКодСубброкера,
	|	втСопоставленныеДанные.ISIN КАК ISIN,
	|	втСопоставленныеДанные.НомерСчетаДепоКлиента КАК НомерСчетаДепоКлиента
	|ИЗ
	|	втСопоставленныеДанные КАК втСопоставленныеДанные
	|
	|УПОРЯДОЧИТЬ ПО
	|	Субброкер,
	|	Субклиент");
	Запрос.УстановитьПараметр("ТЗ",			ЭтотОбъект.Подтверждения.Выгрузить());
	Запрос.УстановитьПараметр("КодLEI",		ЭтотОбъект.КодLEIСубброкера);
	Запрос.УстановитьПараметр("ДатаСреза",	ТекущаяДата());
	Запрос.УстановитьПараметр("НДЦ",		Константы.КлассификаторЗагрузкиНДЦ.Получить());
	Запрос.УстановитьПараметр("ЦБ",			ЭтотОбъект.ДокументРаскрытия.ЦеннаяБумага1);
	Запрос.УстановитьПараметр("СчетДепоМХ",	ЭтотОбъект.ДокументРаскрытия.СчетДЕПО);

	ТаблицаПодтверждений    = Запрос.Выполнить().Выгрузить();	
	ЭтотОбъект.Подтверждения.Загрузить(ТаблицаПодтверждений);
	
	Если АмериканскаяЦБ И КодВидаКД = "WTRC" Тогда 
		ЗаполнитьДанныеСчетаАмериканскихЦБWTRC();		
	КонецЕсли;	
КонецПроцедуры

// Процедура - Загрузить данные подтверждения
//
// Параметры:
//  Адрес			 - Строка									 - адрес файла раскрытия во временном хранилище
//  ОтветСубброкера	 - ДокументСсылка.ОтветСубброкераНаРаскрытие - не обязательный, возвращает ссылку на созданный документ ответа субброкера
//  СообщениеКлиенту - Строка									 - не обязательный, возвращает текст сообщения об ошибке заполнения файла
//
Процедура ЗагрузитьДанныеПодтверждения(Адрес, ОтветСубброкера = Неопределено, СообщениеКлиенту = "") Экспорт
	НачатьТранзакцию();
	
	Если Подтверждения.Количество() > 0 Тогда
		ТекущаяДата = ТекущаяДатаСеанса();                                   
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидКД,"Код") = "DSCL" Тогда
			ДокументКД = ДокументРаскрытия;
		Иначе 
			ДокументКД = ДокументРаскрытия.КарточкаКД;
		КонецЕсли;
		РегистрыСведений.ПодтвержденияСубброкераПоРСВ.УдалитьЗаписи(ДокументКД,
				Подтверждения[0].ДоговорСубброкера);
		Для Каждого Подтверждение Из Подтверждения Цикл
			ПоляПодтверждения = Новый Структура("ДоговорСубброкера, СчетДепо, Субклиент, ЦеннаяБумага, Количество,
				|СтатусНалогоплательщика, НаличиеНалоговыхЛьгот, НалоговаяСтавка");
			ЗаполнитьЗначенияСвойств(ПоляПодтверждения, Подтверждение);
			ПоляПодтверждения.Вставить("ДатаПолученияОтветаНД", ТекущаяДата);
			РегистрыСведений.ПодтвержденияСубброкераПоРСВ.ДобавитьЗапись(ДокументКД, ПоляПодтверждения);
		КонецЦикла;
	КонецЕсли;
	
	Если WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкераДляДокумента(ДокументРаскрытия) Тогда
		ДокЗапрос = ЗапросНаРСВ.ПолучитьОбъект();
		ДокЗапрос.Статус = Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ПолученОтвет;
		ДокЗапрос.Записать();
		
		Если НЕ ЗначениеЗаполнено(ОтветСубброкера) Тогда
			ОтветСубброкера = НовыйОтветСубброкераНаРаскрытие(Адрес, Перечисления.СтатусыДокументаОтветСубброкераНаРаскрытие.Загружен);
		КонецЕсли;
		ДокРСВ = ДокументРаскрытия.ПолучитьОбъект();
		ДокРСВ.ТребуетсяРаскрытиеПоСубклиентам = ДокРСВ.ЕстьСубброкерВСпискеВладельцев();
		
		Если КодВидаКД = "WTRC" Тогда 
			ДокРСВ.ЗаполнитьСписокВладельцев();
			ПроверитьСоответствиеОтветаСубброкераПоРСВ(ОтветСубброкера.Ссылка, СообщениеКлиенту);
			Если АмериканскаяЦБ Тогда 
				ПроверитьСоответствиеКодовКлиентаДепозитарнымКодамПредоставленныхДокументов(ДокРСВ, ОтветСубброкера);
				Если ДокРСВ.СводноеРаскрытие.Количество() Тогда // сводное раскрытие хранится в РСВ
					ДокРСВ.ЗаполнитьСводноеРаскрытие();
				КонецЕсли;
			КонецЕсли;
		Иначе 
			МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
			ДокРСВ.ДанныеСпискаВладельцев(МенеджерВременныхТаблиц);
			ДокРСВ.ДополнитьСписокВладельцевПоОтветамСубброкераНаРСВ(МенеджерВременныхТаблиц);
			ПроверитьСоответствиеОтветаСубброкераПоРСВ(ОтветСубброкера.Ссылка, СообщениеКлиенту);
		КонецЕсли;
		
		Если ПолученыПодтвержденияПоВсемСубброкерам(ДокРСВ) Тогда
			ДокРСВ.Статус = Перечисления.СтатусыРаскрытияСписковВладельцев.ПолученОтветНДПоРаскрытию;
		КонецЕсли;
		ДокРСВ.ДополнительныеСвойства.Вставить("СтатусДокументаИзменен",Ложь);
		ДокРСВ.Записать(РежимЗаписиДокумента.Запись);
		
	Иначе
		ДокРСВ = ДокументРаскрытия.ПолучитьОбъект();
		ДокРСВ.ЗаполнитьСписокВладельцев();
		Если ПолученыПодтвержденияПоВсемСубброкерам(ДокРСВ) Тогда
			ДокРСВ.Статус = Перечисления.СтатусыРаскрытияСписковВладельцев.ПолученОтветНДПоРаскрытию;
		КонецЕсли;
		ДокРСВ.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура ПодобратьДокументРСВ() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РСВ.Ссылка КАК ДокументРаскрытия
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев.СписокВладельцев КАК РСВ
	|ГДЕ
	|	(РСВ.Ссылка.ВидКорпоративногоДействия = &ВидКД
	|			ИЛИ РСВ.Ссылка.СвязанныйВидКД1 = &ВидКД)
	|	И (РСВ.Ссылка.КДРеференс = &РеференсКД
	|			ИЛИ РСВ.Ссылка.СвязанныйРеференсКД1 = &РеференсКД)
	|	И РСВ.СчетДепо = &СчетДепо
	|	И РСВ.СчетДепо.Владелец.LEI = &КодLEI
	|	И РСВ.Клиент.Субброкер
	|
	|СГРУППИРОВАТЬ ПО
	|	РСВ.Ссылка");
	Запрос.УстановитьПараметр("ВидКД",		ВидКД);
	Запрос.УстановитьПараметр("СчетДепо",	СчетДепо);
	Запрос.УстановитьПараметр("КодLEI",		КодLEIСубброкера);
	Запрос.УстановитьПараметр("РеференсКД",	РеференсКД);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументРаскрытия = Выборка.ДокументРаскрытия;
	Иначе
		ДокументРаскрытия = Документы.РаскрытиеСпискаВладельцев.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

Процедура ПодобратьДокументЗапросаНаРСВ(Номер = "") Экспорт
	
	ЗапросНаРСВ = Документы.ЗапросСубброкеруНаРаскрытие.ПустаяСсылка();
	Если Не ЗначениеЗаполнено(ДокументРаскрытия) Тогда
		Возврат;
	КонецЕсли;
	
	Клиент = Справочники.Контрагенты.ПустаяСсылка();
	Для Каждого СтрокаПодтверждения Из Подтверждения Цикл 
		Если ЗначениеЗаполнено(СтрокаПодтверждения.Субброкер) Тогда
			Клиент = СтрокаПодтверждения.Субброкер;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ISIN = "";
	Если ЗначениеЗаполнено(ЦеннаяБумага) Тогда
		ISIN = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦеннаяБумага, "ISIN");
	Иначе
		Для Каждого СтрокаПодтверждения Из Подтверждения Цикл 
			Если ЗначениеЗаполнено(СтрокаПодтверждения.ISIN) Тогда
				ISIN = СтрокаПодтверждения.ISIN;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда  
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Ссылка КАК ЗапросНаРСВ
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие.ДанныеСубброкера КАК ЗапросСубброкеруНаРаскрытиеДанныеСубброкера
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Ссылка.Клиент = &Клиент
	|	И ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Ссылка.Статус В(&СтатусыОтправлено)
	|	И ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Ссылка.РеференсКД = &РеференсКД
	|	И ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Ссылка.ISIN = &ISIN
	|	И &ОтборПоНомеру
	|	И ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Ссылка.РСВ = &РСВ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Ссылка.Дата УБЫВ");
	
	СтатусыОтправлено = Новый Массив();
	СтатусыОтправлено.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Отправлен);
	СтатусыОтправлено.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ОтправленПовторно);
    СтатусыОтправлено.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ПолученОтвет);
	Запрос.УстановитьПараметр("РСВ", ДокументРаскрытия);
	Запрос.УстановитьПараметр("РеференсКД", ДокументРаскрытия.КДРеференс);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("СтатусыОтправлено", СтатусыОтправлено);
	Запрос.УстановитьПараметр("ISIN", ISIN);
	Если ЗначениеЗаполнено(Номер) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ОтборПоНомеру",
			"И ЗапросСубброкеруНаРаскрытиеДанныеСубброкера.Ссылка.Номер = &Номер");
		Запрос.УстановитьПараметр("Номер",	Номер);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ОтборПоНомеру", "");
	КонецЕсли;
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	Иначе
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		ЗапросНаРСВ = Выборка.ЗапросНаРСВ;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолученыПодтвержденияПоВсемСубброкерам(ДокОбъект)
	ДоговорыДокумента = ДокОбъект.СписокВладельцев.Выгрузить(, "Договор");
	ДоговорыДокумента.Свернуть("Договор");
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидКД,"Код") = "DSCL" Тогда
		ДокументКД = ДокументРаскрытия;
	Иначе 
		ДокументКД = ДокументРаскрытия.КарточкаКД;
	КонецЕсли;
	Возврат РегистрыСведений.ПодтвержденияСубброкераПоРСВ.ПолученыПодтвержденияПоВсемСубброкерам(
		ДокументКД, ДоговорыДокумента);
КонецФункции

Функция НовыйОтветСубброкераНаРаскрытие(Адрес, Статус, Комментарий = "")
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтветСубброкераНаРаскрытие.Ссылка
	|ИЗ
	|	Документ.ОтветСубброкераНаРаскрытие КАК ОтветСубброкераНаРаскрытие
	|ГДЕ
	|	НЕ ОтветСубброкераНаРаскрытие.ПометкаУдаления
	|	И ОтветСубброкераНаРаскрытие.ЗапросНаРСВ = &ЗапросНаРСВ";
	Запрос.УстановитьПараметр("ЗапросНаРСВ", ЗапросНаРСВ);
	ПовторноеРаскрытие = Не Запрос.Выполнить().Пустой();
	
	ОтветСубброкера = Документы.ОтветСубброкераНаРаскрытие.СоздатьДокумент();
	ОтветСубброкера.Дата = ТекущаяДатаСеанса();
	ОтветСубброкера.ЗапросНаРСВ = ЗапросНаРСВ;
	ОтветСубброкера.ДатаОтправкиЗапроса = ЗапросНаРСВ.ДатаВремяОтправкиЗапроса;
	ОтветСубброкера.СпособЗагрузки = Перечисления.СпособыЗагрузкиОтветовНаЗапросыРСВ.ЗагруженЧерезExcel;
	ОтветСубброкера.ФорматФайла = ФорматФайла;
	ОтветСубброкера.Статус = Статус;
	ОтветСубброкера.ВидКД = ВидКД;
	ОтветСубброкера.КДРеференс = РеференсКД;
	ОтветСубброкера.КорпоративноеДействие = ДокументРаскрытия.КарточкаКД;
	ОтветСубброкера.РаскрытиеСпискаВладельцев = ДокументРаскрытия;
	ОтветСубброкера.ПовторноеРаскрытие = ПовторноеРаскрытие;
	ОтветСубброкера.НомерДокументаСубброкера = НомерДокумента;
	ОтветСубброкера.ДатаДокументаСубброкера = ДатаДокумента;
	Для Каждого Стр Из Подтверждения Цикл
		НоваяСтрока = ОтветСубброкера.ДанныеСубброкера.Добавить();
		НоваяСтрока.НомерСчетаДепоКлиента = Стр.НомерСчетаДепоКлиента;
		НоваяСтрока.КодКлиента = Стр.КодКлиента;
		НоваяСтрока.ТипСчета = Стр.ТипСчета;
		НоваяСтрока.ПолноеНаименованиеЛица = Стр.ПолноеНаименованиеЛица;
		НоваяСтрока.АдресМестонахожденияРегистрацииСтрана = Стр.АдресМестонахожденияРегистрацииСтрана;
		НоваяСтрока.АдресМестонахожденияРегистрацииИндекс = Стр.АдресМестонахожденияРегистрацииИндекс;
		НоваяСтрока.АдресМестонахожденияРегистрацииАдрес = Стр.АдресМестонахожденияРегистрацииАдрес;
		НоваяСтрока.ПризнакЮЛФЛ = Стр.ПризнакЮЛФЛ;
		НоваяСтрока.ДокументВладельцаТип = Стр.ДокументВладельцаТип;
		НоваяСтрока.ДокументВладельцаНомер = Стр.ДокументВладельцаНомер;
		НоваяСтрока.ДокументВладельцаСерия = Стр.ДокументВладельцаСерия;
		НоваяСтрока.ДокументВладельцаДатаВыдачи = Стр.ДокументВладельцаДатаВыдачи;
		НоваяСтрока.ДокументВладельцаОрганВыдачи = Стр.ДокументВладельцаОрганВыдачи;
		НоваяСтрока.ДатаРожденияФЛ = Стр.ДатаРожденияФЛ;
		НоваяСтрока.ГражданствоФЛ = Стр.ГражданствоФЛ;
		НоваяСтрока.ПолноеНаименованиеЮЛФЛСубклиента = Стр.ПолноеНаименованиеЮЛФЛСубклиента;
		НоваяСтрока.АдресПочтовыйСтрана = Стр.АдресПочтовыйСтрана;
		НоваяСтрока.АдресПочтовыйИндекс = Стр.АдресПочтовыйИндекс;
		НоваяСтрока.АдресПочтовыйАдрес = Стр.АдресПочтовыйАдрес;
		НоваяСтрока.СтатусНалогоплательщика = Стр.СтатусНалогоплательщика;
		НоваяСтрока.НаличиеНалоговыхЛьгот = Стр.НаличиеНалоговыхЛьгот;
		НоваяСтрока.ЗаявленнаяНалоговаяСтавка = Стр.НалоговаяСтавка;
		НоваяСтрока.LEIКодСубброкера = Стр.LEIКодСубброкера;
		НоваяСтрока.КодНРД = Стр.КодЗагрузкиЦБ;
		НоваяСтрока.ISIN = Стр.ISIN;
		НоваяСтрока.Количество = Стр.Количество;
		
		НоваяСтрока.Клиент = Стр.Субброкер;
		НоваяСтрока.Договор = Стр.ДоговорСубброкера;
		НоваяСтрока.СчетДепо = Стр.СчетДепо;
		НоваяСтрока.РазделСчетаДепо = Стр.РазделСчетаДепо;
		НоваяСтрока.ЦеннаяБумага = Стр.ЦеннаяБумага;
		НоваяСтрока.Выгодоприобретатель = Стр.Субклиент;

	КонецЦикла;
	ОтветСубброкера.Записать();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ: " + ОтветСубброкера.Ссылка);
	
	
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда 
		ВыбФайл = Новый Файл(ПолноеИмяФайла);
		НовыйФайл = Справочники.Файлы.СоздатьЭлемент();
		НовыйФайл.Объект = ОтветСубброкера.Ссылка;
		НовыйФайл.Ответственный = Пользователи.ТекущийПользователь();
		НовыйФайл.ДатаСоздания = ТекущаяДатаСеанса();
		НовыйФайл.ИмяФайла = ВыбФайл.Имя;
		НовыйФайл.Наименование = ВыбФайл.Имя;
		НовыйФайл.РасширениеФайла = ВыбФайл.Расширение;
		НовыйФайл.ДополнительныйПризнакФайла = Перечисления.ДополнительныеПризнакиФайлов.Прочее;
		НовыйФайл.Данные = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Адрес));
		НовыйФайл.Записать();
	КонецЕсли;
	
	Возврат ОтветСубброкера;
	
КонецФункции

Процедура ПроверитьСоответствиеОтветаСубброкераПоРСВ(ОтветСубброкера, СообщениеКлиенту)
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	Поручение.КоличествоЦБ КАК КоличествоЦБ,
	|	Поручение.Дата КАК Дата,
	|	Поручение.Депонент КАК Депонент,
	|	Поручение.СчетДепо КАК СчетДепо,
	|	Поручение.ЦБ КАК ЦБ,
	|	Поручение.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ПорученияПоКД
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтветСубброкераНаРаскрытие КАК ОтветСубброкераНаРаскрытие
	|		ПО Поручение.КарточкаКД = ОтветСубброкераНаРаскрытие.КорпоративноеДействие
	|ГДЕ
	|	Поручение.ВидОперацииД = &ВидОперацииУчастие
	|	И ОтветСубброкераНаРаскрытие.Ссылка = &ОтветНаРСВ
	|	И Поручение.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПорученияПоКД.КоличествоЦБ КАК КоличествоЦБ,
	|	ПорученияПоКД.Дата КАК Дата,
	|	ПорученияПоКД.Депонент КАК Депонент,
	|	ПорученияПоКД.СчетДепо КАК СчетДепо,
	|	ПорученияПоКД.ЦБ КАК ЦеннаяБумага,
	|	ПорученияПоКД.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДанныеПоручений
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ПорученияПоКД.Дата) КАК Дата,
	|		ПорученияПоКД.Депонент КАК Депонент,
	|		ПорученияПоКД.СчетДепо КАК СчетДепо,
	|		ПорученияПоКД.ЦБ КАК ЦБ
	|	ИЗ
	|		ПорученияПоКД КАК ПорученияПоКД
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПорученияПоКД.Депонент,
	|		ПорученияПоКД.СчетДепо,
	|		ПорученияПоКД.ЦБ) КАК МаксДатаПоручения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорученияПоКД КАК ПорученияПоКД
	|		ПО МаксДатаПоручения.Дата = ПорученияПоКД.Дата
	|			И МаксДатаПоручения.Депонент = ПорученияПоКД.Депонент
	|			И МаксДатаПоручения.СчетДепо = ПорученияПоКД.СчетДепо
	|			И МаксДатаПоручения.ЦБ = ПорученияПоКД.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.СчетДепо.Владелец КАК Клиент,
	|	Договоры.Ссылка КАК Договор,
	|	Остатки.СчетДепо КАК СчетДепо,
	|	Остатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ВЫБОР
	|		КОГДА Остатки.СчетДепо.Владелец.Субброкер
	|				И Остатки.РазделСчетаДепо.РазделСубклиента
	|			ТОГДА Остатки.РазделСчетаДепо.Субклиент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Субклиенты.ПустаяСсылка)
	|	КОНЕЦ КАК Выгодоприобретатель,
	|	Остатки.КоличествоОстаток КАК Количество,
	|	Остатки.ЦБ КАК ЦеннаяБумага
	|ПОМЕСТИТЬ ДанныеВТБКБ
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБМестоРасчетов.Остатки(
	|			&ДатаОстатков,
	|			ЦБ В (&ЦеннаяБумага)
	|				И СчетДепоМХ = &СчетДепоМХ) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО Остатки.СчетДепо.Владелец = Договоры.Владелец
	|			И (НЕ Договоры.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветСубброкераНаРаскрытиеДанныеСубброкера.Клиент КАК Клиент,
	|	ОтветСубброкераНаРаскрытиеДанныеСубброкера.Договор КАК Договор,
	|	ОтветСубброкераНаРаскрытиеДанныеСубброкера.СчетДепо КАК СчетДепо,
	|	ОтветСубброкераНаРаскрытиеДанныеСубброкера.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОтветСубброкераНаРаскрытиеДанныеСубброкера.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ОтветСубброкераНаРаскрытиеДанныеСубброкера.Выгодоприобретатель) = ТИП(СТРОКА)
	|			ТОГДА """"
	|		ИНАЧЕ ОтветСубброкераНаРаскрытиеДанныеСубброкера.Выгодоприобретатель
	|	КОНЕЦ КАК Выгодоприобретатель,
	|	СУММА(ОтветСубброкераНаРаскрытиеДанныеСубброкера.Количество) КАК Количество
	|ПОМЕСТИТЬ ДанныеОтветаНаРСВ
	|ИЗ
	|	Документ.ОтветСубброкераНаРаскрытие.ДанныеСубброкера КАК ОтветСубброкераНаРаскрытиеДанныеСубброкера
	|ГДЕ
	|	ОтветСубброкераНаРаскрытиеДанныеСубброкера.Ссылка = &ОтветНаРСВ
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтветСубброкераНаРаскрытиеДанныеСубброкера.Клиент,
	|	ОтветСубброкераНаРаскрытиеДанныеСубброкера.РазделСчетаДепо,
	|	ОтветСубброкераНаРаскрытиеДанныеСубброкера.ЦеннаяБумага,
	|	ОтветСубброкераНаРаскрытиеДанныеСубброкера.Договор,
	|	ОтветСубброкераНаРаскрытиеДанныеСубброкера.СчетДепо,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ОтветСубброкераНаРаскрытиеДанныеСубброкера.Выгодоприобретатель) = ТИП(СТРОКА)
	|			ТОГДА """"
	|		ИНАЧЕ ОтветСубброкераНаРаскрытиеДанныеСубброкера.Выгодоприобретатель
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеВТБКБ.Клиент КАК Клиент,
	|	ЕСТЬNULL(ДанныеВТБКБ.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
	|	ДанныеВТБКБ.СчетДепо КАК СчетДепо,
	|	ДанныеВТБКБ.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ДанныеВТБКБ.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ДанныеВТБКБ.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ДанныеВТБКБ.Количество КАК КоличествоРСВ,
	|	0 КАК КоличествоОтветыНаРСВ,
	|	ДанныеВТБКБ.Количество КАК КоличествоНесоответствие,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ДанныеВТБКБ.СчетДепо КАК Справочник.СчетаДепо).ТипСчетаДепо В (&ТипыСчетовИНД)
	|			ТОГДА ""ИНД""
	|		ИНАЧЕ ""НД""
	|	КОНЕЦ КАК ТипСчетаДепо
	|ПОМЕСТИТЬ СравнениеДанныхРСВИОтветаНаРСВ
	|ИЗ
	|	ДанныеВТБКБ КАК ДанныеВТБКБ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОтветаНаРСВ.Клиент,
	|	ЕСТЬNULL(ДанныеОтветаНаРСВ.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)),
	|	ДанныеОтветаНаРСВ.СчетДепо,
	|	ДанныеОтветаНаРСВ.РазделСчетаДепо,
	|	ДанныеОтветаНаРСВ.ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА ДанныеОтветаНаРСВ.СчетДепо.ТипСчетаДепо В (&ТипыСчетовИНД)
	|				И ТИПЗНАЧЕНИЯ(ДанныеОтветаНаРСВ.Выгодоприобретатель) = ТИП(Справочник.Субклиенты)
	|			ТОГДА ДанныеОтветаНаРСВ.Выгодоприобретатель
	|		КОГДА ДанныеОтветаНаРСВ.Выгодоприобретатель ССЫЛКА Справочник.Субклиенты
	|			ТОГДА ДанныеОтветаНаРСВ.Выгодоприобретатель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Субклиенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	0,
	|	ДанныеОтветаНаРСВ.Количество,
	|	-ДанныеОтветаНаРСВ.Количество,
	|	ВЫБОР
	|		КОГДА ДанныеОтветаНаРСВ.СчетДепо.ТипСчетаДепо В (&ТипыСчетовИНД)
	|			ТОГДА ""ИНД""
	|		ИНАЧЕ ""НД""
	|	КОНЕЦ
	|ИЗ
	|	ДанныеОтветаНаРСВ КАК ДанныеОтветаНаРСВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОтветаНаРСВГруппировка.Клиент КАК Клиент,
	|	ДанныеОтветаНаРСВГруппировка.СчетДепо КАК СчетДепо,
	|	ДанныеОтветаНаРСВГруппировка.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ДанныеОтветаНаРСВГруппировка.Количество - ДанныеПоручений.КоличествоЦБ КАК РазницаКоличествоОтветКоличествоПоручение,
	|	ДанныеПоручений.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СравнениеДанныхОтветДанныхПоручения
	|ИЗ
	|	ДанныеПоручений КАК ДанныеПоручений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДанныеОтветаНаРСВ.Клиент КАК Клиент,
	|			ДанныеОтветаНаРСВ.СчетДепо КАК СчетДепо,
	|			ДанныеОтветаНаРСВ.ЦеннаяБумага КАК ЦеннаяБумага,
	|			СУММА(ДанныеОтветаНаРСВ.Количество) КАК Количество
	|		ИЗ
	|			ДанныеОтветаНаРСВ КАК ДанныеОтветаНаРСВ
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДанныеОтветаНаРСВ.СчетДепо,
	|			ДанныеОтветаНаРСВ.ЦеннаяБумага,
	|			ДанныеОтветаНаРСВ.Клиент) КАК ДанныеОтветаНаРСВГруппировка
	|		ПО ДанныеПоручений.Депонент = ДанныеОтветаНаРСВГруппировка.Клиент
	|			И ДанныеПоручений.ЦеннаяБумага = ДанныеОтветаНаРСВГруппировка.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СравнениеДанныхРСВИОтветаНаРСВ.Клиент КАК Клиент,
	|	СравнениеДанныхРСВИОтветаНаРСВ.Договор КАК Договор,
	|	СравнениеДанныхРСВИОтветаНаРСВ.СчетДепо КАК СчетДепо,
	|	СравнениеДанныхРСВИОтветаНаРСВ.РазделСчетаДепо КАК РазделСчетаДепо,
	|	СравнениеДанныхРСВИОтветаНаРСВ.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СравнениеДанныхРСВИОтветаНаРСВ.Выгодоприобретатель КАК Выгодоприобретатель,
	|	СУММА(СравнениеДанныхРСВИОтветаНаРСВ.КоличествоРСВ) КАК КоличествоРСВ,
	|	СУММА(СравнениеДанныхРСВИОтветаНаРСВ.КоличествоОтветыНаРСВ) КАК КоличествоОтветыНаРСВ,
	|	СУММА(СравнениеДанныхРСВИОтветаНаРСВ.КоличествоНесоответствие) КАК КоличествоНесоответствие,
	|	СравнениеДанныхРСВИОтветаНаРСВ.ТипСчетаДепо КАК ТипСчетаДепо
	|ИЗ
	|	ДанныеОтветаНаРСВ КАК ДанныеОтветаНаРСВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СравнениеДанныхРСВИОтветаНаРСВ КАК СравнениеДанныхРСВИОтветаНаРСВ
	|		ПО ДанныеОтветаНаРСВ.Клиент = СравнениеДанныхРСВИОтветаНаРСВ.Клиент
	|			И ДанныеОтветаНаРСВ.РазделСчетаДепо = СравнениеДанныхРСВИОтветаНаРСВ.РазделСчетаДепо
	|
	|СГРУППИРОВАТЬ ПО
	|	СравнениеДанныхРСВИОтветаНаРСВ.Клиент,
	|	СравнениеДанныхРСВИОтветаНаРСВ.Договор,
	|	СравнениеДанныхРСВИОтветаНаРСВ.ТипСчетаДепо,
	|	СравнениеДанныхРСВИОтветаНаРСВ.СчетДепо,
	|	СравнениеДанныхРСВИОтветаНаРСВ.ЦеннаяБумага,
	|	СравнениеДанныхРСВИОтветаНаРСВ.Выгодоприобретатель,
	|	СравнениеДанныхРСВИОтветаНаРСВ.РазделСчетаДепо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СравнениеДанныхОтветДанныхПоручения.РазницаКоличествоОтветКоличествоПоручение, 0) КАК КоличествоНесоответствиеПоручение,
	|	ДанныеОтветаНаРСВ.Клиент КАК Клиент,
	|	ДанныеОтветаНаРСВ.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СравнениеДанныхОтветДанныхПоручения.Ссылка КАК Поручение,
	|	ДанныеОтветаНаРСВ.Договор КАК Договор,
	|	ДанныеОтветаНаРСВ.СчетДепо КАК СчетДепо,
	|	ДанныеОтветаНаРСВ.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ДанныеОтветаНаРСВ.Выгодоприобретатель КАК Выгодоприобретатель
	|ИЗ
	|	ДанныеОтветаНаРСВ КАК ДанныеОтветаНаРСВ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СравнениеДанныхОтветДанныхПоручения КАК СравнениеДанныхОтветДанныхПоручения
	|		ПО ДанныеОтветаНаРСВ.Клиент = СравнениеДанныхОтветДанныхПоручения.Клиент
	|			И ДанныеОтветаНаРСВ.ЦеннаяБумага = СравнениеДанныхОтветДанныхПоручения.ЦеннаяБумага";
	Запрос.УстановитьПараметр("РСВ", ДокументРаскрытия);
	Запрос.УстановитьПараметр("ЗапросНаРСВ", ЗапросНаРСВ);
	Запрос.УстановитьПараметр("ОтветНаРСВ", ОтветСубброкера);
	Запрос.УстановитьПараметр("ТипыСчетовИНД", БизнесПроцессы.ОбработкаWTRCСообщения.ТипыСчетовИНД());
	
	РеквизитыРСВ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРаскрытия, "ДатаФиксации, СчетДЕПО"); 
	Если РеквизитыРСВ.ДатаФиксации > ТекущаяДатаСеанса() Тогда
		ДатаОстатков	= ТекущаяДатаСеанса();
	Иначе
		ДатаОстатков	= КонецДня(РеквизитыРСВ.ДатаФиксации);
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("СчетДепоМХ"	, РеквизитыРСВ.СчетДЕПО);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	Запрос.УстановитьПараметр("ВидОперацииУчастие", Справочники.ВидыОпераций.УчастиеВКД);
	
	ДокОтветСубброкера = ОтветСубброкера.ПолучитьОбъект();
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	//Проверка на соответствие количеству в поручениях
	РезультатРасхожденияПоручения = РезультатыЗапроса[7];
	
	Выборка = РезультатРасхожденияПоручения.Выбрать();
	Пока Выборка.Следующий() Цикл
		Отбор = Новый Структура("Клиент, Договор, СчетДепо,РазделСчетаДепо, ЦеннаяБумага");
		Если ЗначениеЗаполнено(Выборка.Выгодоприобретатель) Тогда
			Отбор.Вставить("Выгодоприобретатель");
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);
		НайденныеСтроки = ДокОтветСубброкера.ДанныеСубброкера.НайтиСтроки(Отбор);
		Для Каждого Стр Из НайденныеСтроки Цикл
			
			Если Выборка.КоличествоНесоответствиеПоручение <> 0 Тогда
				Стр.ЕстьРасхожденияПоРСВ = Истина;
				Разделитель = ?(ЗначениеЗаполнено(Стр.ПричинаРасхождения), Символы.ПС, "");
				Стр.ПричинаРасхождения = Стр.ПричинаРасхождения + Разделитель + "Количество в поручении " + Выборка.Поручение 
				+ " отличается на " + Выборка.КоличествоНесоответствиеПоручение;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	//Проверка на остатки
	ЕстьПоручения = НЕ РезультатРасхожденияПоручения.Пустой();
	РезультатРасхожденияОстатки = РезультатыЗапроса[6];
	
	Выборка = РезультатРасхожденияОстатки.Выбрать();
	Пока Выборка.Следующий() Цикл
		Отбор = Новый Структура("Клиент, Договор, СчетДепо,РазделСчетаДепо, ЦеннаяБумага");
		Если ЗначениеЗаполнено(Выборка.Выгодоприобретатель) Тогда
			Отбор.Вставить("Выгодоприобретатель");
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);
		НайденныеСтроки = ДокОтветСубброкера.ДанныеСубброкера.НайтиСтроки(Отбор);
		Для Каждого Стр Из НайденныеСтроки Цикл
			Если ЕстьПоручения И  Выборка.КоличествоНесоответствие < 0 // для случая когда поручение превышает остаток
				ИЛИ НЕ ЕстьПоручения И Выборка.КоличествоНесоответствие <> 0 Тогда
				Стр.ЕстьРасхожденияПоРСВ = Истина;
				Разделитель = ?(ЗначениеЗаполнено(Стр.ПричинаРасхождения), Символы.ПС, "");
				Стр.ПричинаРасхождения = Стр.ПричинаРасхождения + Разделитель + "Количество в РСВ отличается на " + Выборка.КоличествоНесоответствие;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЕстьРасхождения = ДокОтветСубброкера.ДанныеСубброкера.Найти(Истина, "ЕстьРасхожденияПоРСВ") <> Неопределено;
	
	Если ЕстьРасхождения Тогда
		
		ДокОтветСубброкера.Статус = Перечисления.СтатусыДокументаОтветСубброкераНаРаскрытие.ЕстьРасхождения;
		ТекстПисьма = "В рамках КД %1 КД референс %2 в ответе субброкера %3 %4 от %5 есть расхождения." + Символы.ПС + "%6";
		Отбор = Новый Структура("ЕстьРасхожденияПоРСВ", Истина);
		СтрокиРасхождений = ДокОтветСубброкера.ДанныеСубброкера.НайтиСтроки(Отбор);
		СообщенияОРасхождении = Новый Массив;
		Для Каждого ТекСтрока Из СтрокиРасхождений Цикл
			
			СообщенияОРасхождении.Добавить("Расхождение (Клиент: " + ТекСтрока.Клиент + " / Договор: " + ТекСтрока.Договор 
											+ " / СчетДепо: " + ТекСтрока.СчетДепо + " / РазделСчетаДепо: " 
											+ ТекСтрока.РазделСчетаДепо + " / ЦеннаяБумага: " + ТекСтрока.ЦеннаяБумага + "): " 
											+ ТекСтрока.ПричинаРасхождения);
			
		КонецЦикла;
		СообщенияОРасхождении = СтрСоединить(СообщенияОРасхождении, Символы.ПС);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщенияОРасхождении);
		ТекстПисьма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПисьма, ВидКД.Код, РеференсКД, 
					ОтветСубброкера.ДанныеСубброкера[0].Клиент, ОтветСубброкера.ДанныеСубброкера[0].Договор, 
					ОтветСубброкера.Дата, СообщенияОРасхождении);
		ПВХ = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОРасхожденияхВОтветеНаРСВ;
		НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПВХ).Настройка;
		
		Если НастройкиОбмена = Неопределено Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Не заданы параметры внешнего источника %1. Сообщение о расхождении не отправлено.",ПВХ.Наименование);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Иначе 
			ПараметрыУведомления = Новый Соответствие;
			ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
			ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
			ПараметрыУведомления.Вставить("ТемаПисьма",			"Расхождение в ответе субброкера на раскрытие");
			ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
			ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
			ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
			РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
		КонецЕсли;
	Иначе
		ДокОтветСубброкера.Статус = Перечисления.СтатусыДокументаОтветСубброкераНаРаскрытие.НетРасхождений;
	КонецЕсли;
	
	ДокОтветСубброкера.Записать();
	
КонецПроцедуры

Процедура ДополнитьПодтвержденияСсылкамиНаОбъекты__БезДокументовЗапросов() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТЗ.КодСубброкера КАК КодСубброкера,
	|	ТЗ.КодСубклиента КАК КодСубклиента,
	|	ТЗ.КодЗагрузкиЦБ КАК КодЗагрузкиЦБ,
	|	ТЗ.Количество КАК Количество,
	|	ТЗ.СчетДепо КАК СчетДепо,
	|	ТЗ.СтатусНалогоплательщика КАК СтатусНалогоплательщика,
	|	ТЗ.НаличиеНалоговыхЛьгот КАК НаличиеНалоговыхЛьгот,
	|	ТЗ.НалоговаяСтавка КАК НалоговаяСтавка
	|ПОМЕСТИТЬ втДанныеФайла
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеФайла.КодСубброкера КАК КодСубброкера,
	|	ДанныеФайла.КодСубклиента КАК КодСубклиента,
	|	ДанныеФайла.КодЗагрузкиЦБ КАК КодЗагрузкиЦБ,
	|	ДанныеФайла.Количество КАК Количество,
	|	ДанныеФайла.СчетДепо КАК СчетДепо,
	|	ДанныеФайла.СтатусНалогоплательщика КАК СтатусНалогоплательщика,
	|	ДанныеФайла.НаличиеНалоговыхЛьгот КАК НаличиеНалоговыхЛьгот,
	|	ДанныеФайла.НалоговаяСтавка КАК НалоговаяСтавка,
	|	Контрагенты.Ссылка КАК Субброкер,
	|	Договоры.Ссылка КАК ДоговорСубброкера,
	|	Субклиенты.Ссылка КАК Субклиент,
	|	КодыЗагрузкиЦБ.Владелец КАК ЦеннаяБумага
	|ИЗ
	|	втДанныеФайла КАК ДанныеФайла
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|	ПО
	|		Контрагенты.Код = ДанныеФайла.КодСубброкера
	|		И Контрагенты.Субброкер
	|		И Контрагенты.LEI = &КодLEI
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|	ПО
	|		Договоры.Код = ДанныеФайла.КодСубброкера
	|		И Договоры.Владелец = Контрагенты.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Субклиенты КАК Субклиенты
	|	ПО
	|		Субклиенты.Код = ДанныеФайла.КодСубклиента
	|		И Субклиенты.Владелец = Контрагенты.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиЦБ
	|	ПО
	|		КодыЗагрузкиЦБ.Код = ДанныеФайла.КодЗагрузкиЦБ
	|		И КодыЗагрузкиЦБ.Владелец ССЫЛКА Справочник.ЦенныеБумаги
	|		И ВЫРАЗИТЬ(КодыЗагрузкиЦБ.Биржа КАК Справочник.КлассификаторыЗагрузки) = &НДЦ
	|		И (КодыЗагрузкиЦБ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ КодыЗагрузкиЦБ.ДатаОкончанияДействия > &ДатаСреза)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагенты.Ссылка.Наименование,
	|	Субклиенты.Ссылка.Наименование
	|");
	Запрос.УстановитьПараметр("ТЗ",			ЭтотОбъект.Подтверждения.Выгрузить());
	Запрос.УстановитьПараметр("КодLEI",		ЭтотОбъект.КодLEIСубброкера);
	Запрос.УстановитьПараметр("ДатаСреза",	ТекущаяДата());
	Запрос.УстановитьПараметр("НДЦ",		Константы.КлассификаторЗагрузкиНДЦ.Получить());
	ТаблицаПодтверждений = Запрос.Выполнить().Выгрузить();
	ЭтотОбъект.Подтверждения.Загрузить(ТаблицаПодтверждений);
КонецПроцедуры

Процедура ПроверитьСоответствиеКодовКлиентаДепозитарнымКодамПредоставленныхДокументов(РаскрытиеСпискаВладельцев, ОтветСубброкера)
	
	Отбор = Новый Структура("ОтветНаРСВ", ОтветСубброкера.Ссылка);
	СтрокиСпискаВладельцев = РаскрытиеСпискаВладельцев.СписокВладельцев.НайтиСтроки(Отбор);
	Для Каждого СтрокаСписка Из СтрокиСпискаВладельцев Цикл 
		Если ТипЗнч(СтрокаСписка.Выгодоприобретатель) = Тип("Строка") Тогда
			ТекстСообщенияОбОшибке = "Не удалось сопоставить субклиента """ + СтрокаСписка.Выгодоприобретатель + """ по депозитарному коду субклиента!";
			ЗаписьЖурналаРегистрации("Загрузка подтверждений субброкеров по РСВ", УровеньЖурналаРегистрации.Предупреждение,Метаданные(),ОтветСубброкера.Ссылка, ТекстСообщенияОбОшибке);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке);	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
	
ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
