
Функция ПризнакиПоКоду(Знач КодПризнака) Экспорт
	Признаки = Неопределено;
	КодПризнака = СокрЛП(КодПризнака);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Признаки.ТипКорпоративногоДействия КАК ТипКорпоративногоДействия,
	|	Признаки.ПризнакОбязательностиКД КАК ПризнакОбязательностиКД
	|ИЗ
	|	Справочник.ПризнакиОбязательностиКорпоративныхДействий КАК Признаки
	|ГДЕ
	|	Признаки.Код = &КодПризнака
	|	И НЕ Признаки.ПометкаУдаления");
	КоличествоПробелов = Метаданные.Справочники.ПризнакиОбязательностиКорпоративныхДействий.ДлинаКода - СтрДлина(КодПризнака);
	Запрос.УстановитьПараметр("КодПризнака", КодПризнака + СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(" ", КоличествоПробелов));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Признаки = Новый Структура("ТипКорпоративногоДействия, ПризнакОбязательностиКД",
			Выборка.ТипКорпоративногоДействия, Выборка.ПризнакОбязательностиКД);
	КонецЕсли;
	Возврат Признаки;
КонецФункции
