
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
//#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ЭтотОбъект.ДатаНачала > ЭтотОбъект.ДатаОкончания И ЭтотОбъект.ДатаОкончания <> '00010101000000' Тогда
		Сообщить("Дата начала периода не может быть больше даты конца периода");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

//#КонецОбласти 

#КонецЕсли

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
