// Регламентная перенумерация документов в конце дня.
//
Процедура ПеренумерацияДокументов() Экспорт
	
	НачалоПериода = НачалоДня(ТекущаяДата());
	КонецПериода = КонецДня(ТекущаяДата());
	НумераторыОбъектов.ПеренумероватьДокументыЗаПериод(НачалоПериода, КонецПериода);
	
КонецПроцедуры // ПеренумерацияДокументов()

Функция ДатаЗагрузкиПоДатеЗапуска(ДатаЗапуска)
	
	ДвадцатыйЧас = 20;
	СекундВЧасе = 3600;
	Если ДатаЗапуска >= (НачалоДня(ДатаЗапуска) + ДвадцатыйЧас * СекундВЧасе) Тогда
		ДатаЗагрузки = ДатаЗапуска;
	Иначе
		ДатаЗагрузки = НачалоДня(ДатаЗапуска) - 1;
	КонецЕсли;
	
	Возврат ДатаЗагрузки;
	
КонецФункции

// Процедура - Загрузка котировок
//
// Параметры:
//  Действие - Строка - Название алгоритма загрузки
//
Процедура ЗагрузкаКотировок(Действие) Экспорт
	
	Если Действие = "ФайлММВБ" Тогда
		
		ДатаЗагрузки = ДатаЗагрузкиПоДатеЗапуска(ТекущаяДатаСеанса());
		Если Не ОбщегоНазначения.РабочийДень(ДатаЗагрузки) Тогда
			Возврат;
		КонецЕсли;
		
		Загрузчик = Обработки.ЗагрузкаКотировок.Создать();
		Загрузчик.ПериодЗагрузки = Новый СтандартныйПериод(ДатаЗагрузки, ДатаЗагрузки);
		
		ВнешнийИсточникХранилищеБиржевыхФайловММВБ = ПланыВидовХарактеристик.ВнешниеИсточники.ХранилищеБиржевыхФайловММВБ;
		КаталогДанных = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточникХранилищеБиржевыхФайловММВБ).Папка;
		КаталогДанных = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогДанных);
		Загрузчик.КаталогДанных = РаботаСФайлами.ПолучитьАбсолютныйПуть(КаталогДанных);
		
		Загрузчик.ВыполнитьЗагрузку(Действие, Загрузчик.ПериодЗагрузки);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Отправить сообщение о загрузке получателям
//
// Параметры:
//  Настройка		 - СправочникСсылка.НастройкиОбменаДанными	 - см. Функция АктуальнаяУчетнаяЗаписьПриемаОтправкиСообщений
//  ТемаСообщения	 - Строка									 - Тема сообщения
//  ТекстСообщения	 - Строка									 - Текст сообщения
//
Процедура ОтправитьСообщениеОЗагрузкеПолучателям(Настройка, ТемаСообщения, ТекстСообщения) Экспорт
	
	Если Не ЗначениеЗаполнено(Настройка) Тогда
		Возврат;
	КонецЕсли;
	
	АктуальнаяУчетнаяЗапись = Справочники.НастройкиОбменаДанными.АктуальнаяУчетнаяЗаписьПриемаОтправкиСообщений(Настройка);
	УправлениеЭлектроннойПочтой.ИнтернетПисьмо(АктуальнаяУчетнаяЗапись, ТемаСообщения, Настройка.АдресПолучателя, ТекстСообщения);
	
КонецПроцедуры

Процедура ЗагрузитьНеторговыеПоручения() Экспорт
	Загрузчик = Обработки.ЗагрузкаНеторговыхПоручений_Новая.Создать();
	Загрузчик.ПолучитьТаблицуПорученийЗаПериод(ТекущаяДата() - 57600, ТекущаяДата());
	Загрузчик.ПроверитьПоставщикаВПоручениях();
	Загрузчик.ЗагрузитьНеторговыеПоручения();
КонецПроцедуры

Процедура ЗагрузкаКД(Депозитарий = Неопределено, ДатаЗагрузки = Неопределено) Экспорт
	Если Депозитарий = Неопределено Тогда
		Депозитарий = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияПоУмолчанию");
	КонецЕсли;
	Обработка = Обработки.ЗагрузкаКДИзДепозитария.Создать();
	Обработка.ВышестоящийДепозитарий = Депозитарий;
	Если ДатаЗагрузки = Неопределено Тогда
		ДатаЗагрузки = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	ШестьСуток = 6;
	Обработка.ПериодНачало = ДатаЗагрузки - ОбщегоНазначенияПовтИсп.СекундВСутках(ШестьСуток);
	Обработка.ПериодКонец = ДатаЗагрузки;
	Обработка.ЗагрузитьДокументыКДИзФайлов();
КонецПроцедуры

Процедура ЗагрузкаРаскрытияСпискаВладельцев() Экспорт
	
	ИсточникЗагрузки = Константы.ВнешнийИсточникДляЗагрузкиРаскрытияСписков.Получить();
	
	ДатаНачала = НачалоДня(ТекущаяДата());
	ДатаОкончания = КонецДня(ТекущаяДата());
	
	Если ИсточникЗагрузки = ПланыВидовХарактеристик.ВнешниеИсточники.Луч Тогда
		РаскрытиеСпискаВладельцев.ЗагрузитьФайлыРаскрытияСписковИзЛуча(ДатаНачала, ДатаОкончания);     
	ИначеЕсли ИсточникЗагрузки = ПланыВидовХарактеристик.ВнешниеИсточники.ШлюзНРД Тогда 
		РаскрытиеСпискаВладельцев.ЗагрузитьФайлыРаскрытияСписковИзШлюза(ДатаНачала, ДатаОкончания);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузкаДанныхОКлиентахДляWEB() Экспорт
	
	ПараметрыИсточника = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.КаталогДанныхОКлиентахДляWEB);
	
	Если ПараметрыИсточника.Папка = "" Тогда 
		ЗаписьЖурналаРегистрации("РегламентноеЗадание.ВыгрузкаДанныхОКлиентахДляWEB"
									,УровеньЖурналаРегистрации.Ошибка
									,,,"Не указан путь к каталогу выгрузки! " + ОписаниеОшибки());
		Возврат;
	КонецЕсли;
	
	ОбработкаВыгрузки = Обработки.ВыгрузкаДанныхОКлиентахДляWEB.Создать();
	ОбработкаВыгрузки.ДатаЗапроса = ТекущаяДата();
	ОбработкаВыгрузки.КаталогВыгрузки = ПараметрыИсточника.Папка;
	ОбработкаВыгрузки.Сформировать(Истина); // режим выгрузки в файл
	
КонецПроцедуры

////////////////////////////////////////////////////////////////
// Регламентное задание "Пересчет итогов регистров накопления"

Процедура ПересчетИтоговРегистровНакопления() Экспорт

	НаДату = НачалоМесяца(ТекущаяДата())-1;	
	ПересчетРегистров(РегистрыНакопления, НаДату, Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки);
	
КонецПроцедуры

Процедура ПересчетРегистров(МенеджерРегистров, НаДату, ОграничениеПоВидуРегистра = Неопределено)
	
	Для Каждого МенеджерРегистра ИЗ МенеджерРегистров Цикл
		
		МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗнч(МенеджерРегистра));
		
		Если ОграничениеПоВидуРегистра = Неопределено Или МетаданныеРегистра.ВидРегистра = ОграничениеПоВидуРегистра Тогда
			
			Если МенеджерРегистра.ПолучитьИспользованиеИтогов() Тогда
			
				Если МенеджерРегистра.ПолучитьПериодРассчитанныхИтогов() < НаДату Тогда
					МенеджерРегистра.УстановитьПериодРассчитанныхИтогов(НаДату);
				Иначе
					МенеджерРегистра.ПересчитатьИтоги();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////
// Регламентное задание "Загрузка ценных бумаг из НРД"

Процедура ЗагрузкаЦенныхБумаг() Экспорт

	ЗагрузкаЦенныхБумагИзНРД();

КонецПроцедуры


Процедура ЗагрузкаЦенныхБумагИзНРД() 
	Обработка = Обработки.ЗагрузкаЦенныхБумагИзНРД.Создать();
	Обработка.ДатаНач = ТекущаяДата();
	Обработка.ДатаКон = ТекущаяДата();
	Обработка.ВыполнитьЗагрузкуЗаПериод(Обработка.ДатаНач, Обработка.ДатаКон);
КонецПроцедуры

////////////////////////////////////////////////////////////////
// Регламентное задание "Формирование уведомлений клиентам"

Процедура ФормированиеУведомленийКлиентам() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДокументыДляФормированияУведомлений.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.ДокументыДляФормированияУведомлений КАК ДокументыДляФормированияУведомлений");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Документы.КорпоративноеДействие_Новый.НовыйДокументУведомлениеКлиента(Выборка.Документ);
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////
// Регламентное задание "Обработка WTRC-сообщения"

Процедура ОбработкаWTRCСообщения() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОбработкаWTRCСообщения.Ссылка КАК Задача
	|ИЗ
	|	Задача.ОбработкаWTRCСообщения КАК ОбработкаWTRCСообщения
	|ГДЕ
	|	НЕ ОбработкаWTRCСообщения.Выполнена
	|	И НЕ ОбработкаWTRCСообщения.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбработкаWTRCСообщения.Дата");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗадачаОбъект = Выборка.Задача.ПолучитьОбъект();
		ЗадачаОбъект.ВыполнитьЗадачу();
	КонецЦикла;
КонецПроцедуры

Процедура ФормированиеУведомленийTrec() Экспорт
	
	Документы.ЗапросСубброкеруНаРаскрытие.СоздатьИОтправитьЗапросыСубброкеруНаРаскрытиеTrecПослеНаступленияДатыФиксации();
	Документы.ЗапросСубброкеруНаРаскрытие.СоздатьИОтправитьЗапросыСубброкеруНаРаскрытиеTrecПриИзмененииОстатков();
	
КонецПроцедуры
