
// Формирует табличные документы для каждого раздела отчета.
// 
// Возвращаемое значение:
//  Структура - соответствие разделов отчета и сформированных табличных документов
//
Функция РезультатФормированияОтчета() Экспорт
	
	ТабличныеДокументы = Новый Структура;
	НачалоПериода = НачалоМесяца(Дата);
	КонецПериода = КонецДня(Дата);
	
	ЗапросДанныеРазделов = ЗапросДанныеРазделов(НачалоПериода, КонецПериода);
	ДанныеРазделов = ЗапросДанныеРазделов.ВыполнитьПакет();
	
	ДобавитьРазделВТабличныйДокумент(ТабличныеДокументы, ДанныеРазделов, "КлиентскиеСделкиФонд", "ФондовыйРынок");
	ДобавитьРазделВТабличныйДокумент(ТабличныеДокументы, ДанныеРазделов, "СобственныеСделкиФонд", "ФондовыйРынок");
	ДобавитьРазделВТабличныйДокумент(ТабличныеДокументы, ДанныеРазделов, "КлиентскиеСделкиВал", "ВалютныйРынок");
	ДобавитьРазделВТабличныйДокумент(ТабличныеДокументы, ДанныеРазделов, "СобственныеСделкиВал", "ВалютныйРынок");
	
	ДобавитьРазделОстаткиИОборотыВТабличныйДокумент(ТабличныеДокументы, ДанныеРазделов, "ОбязательстваПоКомиссиямС");
	ДобавитьРазделОстаткиИОборотыВТабличныйДокумент(ТабличныеДокументы, ДанныеРазделов, "ОбязательстваПоКомиссиямБез");
	ДобавитьРазделОстаткиИОборотыВТабличныйДокумент(ТабличныеДокументы, ДанныеРазделов, "ОбязательстваПоРасходамС");
	ДобавитьРазделОстаткиИОборотыВТабличныйДокумент(ТабличныеДокументы, ДанныеРазделов, "ОбязательстваПоРасходамБез");
	ДобавитьРазделОстаткиИОборотыВТабличныйДокумент(ТабличныеДокументы, ДанныеРазделов, "СобственныеАктивыНаФОРТС", "Ценная бумага", "Количество", "К");
	
	Возврат ТабличныеДокументы;
	
КонецФункции

// Возвращает выборку записей из массива результатов запроса для указанного раздела
//
// Параметры:
//  ДанныеРазделов	 - Массив - Результаты запроса по разделам
//  ИмяРаздела		 - Строка - Имя раздела
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса или Неопределено- данные указанного раздела
//
Функция ДанныеРазделаПоИмени(ДанныеРазделов, ИмяРаздела)
	
	Если ИмяРаздела = "КлиентскиеСделкиФонд" Тогда 
		Возврат ДанныеРазделов[1].Выбрать();
	ИначеЕсли ИмяРаздела = "СобственныеСделкиФонд" Тогда 
		Возврат ДанныеРазделов[2].Выбрать();
	ИначеЕсли ИмяРаздела = "КлиентскиеСделкиВал" Тогда 
		Возврат ДанныеРазделов[4].Выбрать();
	ИначеЕсли ИмяРаздела = "СобственныеСделкиВал" Тогда 
		Возврат ДанныеРазделов[5].Выбрать();
	ИначеЕсли ИмяРаздела = "ОбязательстваПоКомиссиямС" Тогда 
		Возврат ДанныеРазделов[6].Выбрать();
	ИначеЕсли ИмяРаздела = "ОбязательстваПоКомиссиямБез" Тогда 
		Возврат ДанныеРазделов[7].Выбрать();
	ИначеЕсли ИмяРаздела = "ОбязательстваПоРасходамС" Тогда 
		Возврат ДанныеРазделов[8].Выбрать();
	ИначеЕсли ИмяРаздела = "ОбязательстваПоРасходамБез" Тогда 
		Возврат ДанныеРазделов[9].Выбрать();
	ИначеЕсли ИмяРаздела = "СобственныеАктивыНаФОРТС" Тогда 
		Возврат ДанныеРазделов[10].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Формирует текст запроса и получает данные разделов из БД
//
// Параметры:
//  НачалоПериода	 - Дата - Начало периода отчета
//  КонецПериода	 - Дата - Окончание периода отчета
// 
// Возвращаемое значение:
//  Массив - Результаты выполнения запроса
//
Функция ЗапросДанныеРазделов(НачалоПериода, КонецПериода) Экспорт 
	
	НачалоПериодаФондаВалюта = РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("12201.НачалоПериодаФондаВалюта");
	КодыРежимовТорговДляИсключенияСтрока =
		РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("12972.КодыРежимовТорговИсключаемыеИзРазделаФондовыйРынокСобственныеСделки");
	КодыРежимовТорговДляИсключения = СтрРазделить(КодыРежимовТорговДляИсключенияСтрока, ",", Ложь);
	
	Разделитель = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаФондовыйРынок() + Разделитель
				 + ТекстЗапросаВалютныйРынок() + Разделитель
				 + ТекстЗапросаОстаткиИОбороты("ВидыЗатратОбязательстваПоКомиссиям", "ПредоставленоПравоПользованияДСДа") + Разделитель
				 + ТекстЗапросаОстаткиИОбороты("ВидыЗатратОбязательстваПоКомиссиям", "ПредоставленоПравоПользованияДСНет") + Разделитель
				 + ТекстЗапросаОстаткиИОбороты("ВидыЗатратОбязательстваПоРасходам", "ПредоставленоПравоПользованияДСДа") + Разделитель
				 + ТекстЗапросаОстаткиИОбороты("ВидыЗатратОбязательстваПоРасходам", "ПредоставленоПравоПользованияДСНет") + Разделитель
				 + ТекстЗапросаСобственныеАктивыНаФОРТС();
				 
	Запрос.УстановитьПараметр("НачалоПериодаФондаВалюта", НачалоПериодаФондаВалюта);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ТипДеятельностиБрокерская", Перечисления.ТипыДеятельности.Б);
	Запрос.УстановитьПараметр("ТипДеятельностиДилерская", Перечисления.ТипыДеятельности.Д);
	Запрос.УстановитьПараметр("ТипыСделок", ТипыСделок());
	Запрос.УстановитьПараметр("ВидыЗатратОбязательстваПоКомиссиям", ВидыЗатратОбязательстваПоКомиссиям());
	Запрос.УстановитьПараметр("ВидыЗатратОбязательстваПоРасходам", ВидыЗатратОбязательстваПоРасходам());
	Запрос.УстановитьПараметр("ДепозитарийFORTS", Справочники.МестаХранения.МестоХраненияFORTS());
	Запрос.УстановитьПараметр("ВидВалютнойСделкиSwap", Перечисления.ВидыВалютныхСделок.Swap);
	Запрос.УстановитьПараметр("ТипСделкиSwap", Перечисления.ТипыСделокПоручение.Swap);
	Запрос.УстановитьПараметр("ТипСделкиSpot", Перечисления.ТипыСделокПоручение.Spot);
	Запрос.УстановитьПараметр("СостоянияЗавершенныхСделок", СостоянияЗавершенныхСделок());
	Запрос.УстановитьПараметр("КодыРежимовТорговДляИсключения", КодыРежимовТорговДляИсключения);
	
	Возврат Запрос;
	
КонецФункции

Функция СостоянияЗавершенныхСделок()
	
	Состояния = Новый СписокЗначений;
	Состояния.Добавить(Перечисления.СостоянияСделок.Завершена);
	Состояния.Добавить(Перечисления.СостоянияСделок.Отменена);
	Состояния.Добавить(Перечисления.СостоянияСделок.Расторгнута);
			
	Возврат Состояния;
	
КонецФункции

// Формирует список типов клиентских сделок
// 
// Возвращаемое значение:
//  СписокЗначений - Список типов клиентских сделок
//
Функция ТипыСделок()
	
	ТипыСделок = Новый СписокЗначений;
	ТипыСделок.Добавить(Перечисления.ТипыСделокПоручение.Сделка);
	ТипыСделок.Добавить(Перечисления.ТипыСделокПоручение.РЕПО);
	ТипыСделок.Добавить(Перечисления.ТипыСделокПоручение.СделкаСПаями);
	
	Возврат ТипыСделок;
	
КонецФункции

// Формирует список видов затрат для отбора обязательств по комиссиям
// 
// Возвращаемое значение:
//  СписокЗначений - Список видов затрат
//
Функция ВидыЗатратОбязательстваПоКомиссиям()
	
	ВидыЗатрат = Новый СписокЗначений;
	ВидыЗатрат.Добавить(Перечисления.ТипыУслугБиржевые.Вознаграждение);
	ВидыЗатрат.Добавить(Перечисления.ТипыУслугБиржевые.Депозитарная);
	ВидыЗатрат.Добавить(Перечисления.ТипыУслугБиржевые.РКО);
	ВидыЗатрат.Добавить(Перечисления.ТипыУслугБиржевые.ВознаграждениеУЦ);
	ВидыЗатрат.Добавить(Перечисления.ТипыУслугБиржевые.КомпенсацияНедостаточностиГО);
	ВидыЗатрат.Добавить(Перечисления.ТипыУслугБиржевые.КомиссияКВозмещению);
	ВидыЗатрат.Добавить(Перечисления.ТипыУслугБиржевые.Прочие);
	ВидыЗатрат.Добавить(Перечисления.ТипыУслугБиржевые.МаржинальноеВознаграждение);
	ВидыЗатрат.Добавить(Перечисления.ТипыУслугБиржевые.Займы);
	
	Возврат ВидыЗатрат;
	
КонецФункции

// Формирует список видов затрат для отбора обязательств по расходам
// 
// Возвращаемое значение:
//  СписокЗначений - Список видов затрат
//
Функция ВидыЗатратОбязательстваПоРасходам()
	
	ВидыЗатрат = Новый СписокЗначений;
	ВидыЗатрат.Добавить(Перечисления.ТипыУслугБиржевые.СтороннегоБрокера);
	ВидыЗатрат.Добавить(Перечисления.ТипыУслугБиржевые.Налог);
	
	Возврат ВидыЗатрат;
	
КонецФункции

// Формирует текст запроса для выбора биржевых сделок (клиентских и собственных)
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ТекстЗапросаФондовыйРынок()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	БиржеваяСделка.Дата КАК ДатаВремяСделки,
	|	БиржеваяСделка.Номер КАК НомерСделки,
	|	БиржеваяСделка.ВидСделки КАК НаправлениеСделки,
	|	БиржеваяСделка.Биржа КАК Биржа,
	|	БиржеваяСделка.Портфель КАК Портфель,
	|	БиржеваяСделка.РежимТоргов КАК РежимТоргов,
	|	БиржеваяСделка.Сумма КАК СуммаСделки,
	|	БиржеваяСделка.ВалютаСделки КАК ВалютаСделки,
	|	БиржеваяСделка.ТипДеятельности КАК ТипДеятельности,
	|	БиржеваяСделка.ЦеннаяБумага КАК ЦеннаяБумага,
	|	БиржеваяСделка.ЦеннаяБумага.ISIN КАК ISIN,
	|	БиржеваяСделка.Клиент КАК Клиент,
	|	БиржеваяСделка.ПерваяСделка КАК ПерваяСделка,
	|	БиржеваяСделка.ИдентификаторЗагрузки КАК ИдентификаторСделки,
	|	ВЫРАЗИТЬ(БиржеваяСделка.Поручение КАК Документ.ПоручениеКлиента) КАК ПоручениеКлиента,
	|	ВЫРАЗИТЬ(БиржеваяСделка.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	БиржеваяСделка.БанковскийСчет КАК БанковскийСчет,
	|	БиржеваяСделка.ДатаОплатыПлановая КАК ДатаОплатыПлан,
	|	СостоянияСделкиСрезПоследних.ДатаОплаты КАК ДатаОплатыФакт,
	|	БиржеваяСделка.ДатаПеререгистрацииПлановая КАК ДатаПеререгистрацииПлан,
	|	СостоянияСделкиСрезПоследних.ДатаПеререгистрации КАК ДатаПеререгистрацииФакт,
	|	БиржеваяСделка.Депозитарий КАК Депозитарий,
	|	БиржеваяСделка.ДепозитарийКонтрагента КАК ДепозитарийКонтрагента,
	|	БиржеваяСделка.ДоговорСКлиентом КАК Договор,
	|	БиржеваяСделка.Количество КАК Количество,
	|	БиржеваяСделка.Контрагент КАК Контрагент,
	|	БиржеваяСделка.ПроцентРЕПО КАК ПроцентРЕПО,
	|	БиржеваяСделка.СуммаНКД КАК СуммаНКД,
	|	БиржеваяСделка.Цена КАК Цена,
	|	БиржеваяСделка.ВтораяЧастьДатаРасчетов КАК ВтораяЧастьДатаРасчетов,
	|	БиржеваяСделка.ВтораяЧастьСуммаНКД КАК ВтораяЧастьСуммаНКД,
	|	БиржеваяСделка.ВтораяЧастьЦена КАК ВтораяЧастьЦена,
	|	БиржеваяСделка.ТипСделкиРЕПО КАК ТипСделкиРЕПО,
	|	БиржеваяСделка.СпособРасчета КАК СпособРасчета,
	|	ВЫРАЗИТЬ(БиржеваяСделка.УсловиеОпределенияСуммы КАК СТРОКА(1000)) КАК УсловиеОпределенияСуммы
	|ПОМЕСТИТЬ ВТ_Сделки
	|ИЗ
	|	Документ.БиржеваяСделка КАК БиржеваяСделка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСделки.СрезПоследних(&КонецПериода, ) КАК СостоянияСделкиСрезПоследних
	|		ПО БиржеваяСделка.Ссылка = СостоянияСделкиСрезПоследних.Сделка
	|ГДЕ
	|	БиржеваяСделка.Дата МЕЖДУ &НачалоПериодаФондаВалюта И &КонецПериода
	|	И БиржеваяСделка.ТипДеятельности В (&ТипДеятельностиБрокерская, &ТипДеятельностиДилерская)
	|	И (БиржеваяСделка.ДатаОплатыПлановая > &КонецПериода
	|			ИЛИ БиржеваяСделка.ДатаПеререгистрацииПлановая > &КонецПериода)
	|	И НЕ СостоянияСделкиСрезПоследних.СостояниеСделки В (&СостоянияЗавершенныхСделок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БиржеваяСделка.Дата,
	|	БиржеваяСделка.Номер,
	|	БиржеваяСделка.ВидСделки,
	|	БиржеваяСделка.Биржа,
	|	БиржеваяСделка.Портфель,
	|	БиржеваяСделка.РежимТоргов,
	|	БиржеваяСделка.Сумма,
	|	БиржеваяСделка.ВалютаСделки,
	|	БиржеваяСделка.ТипДеятельности,
	|	БиржеваяСделка.ЦеннаяБумага,
	|	БиржеваяСделка.ЦеннаяБумага.ISIN,
	|	БиржеваяСделка.Клиент,
	|	БиржеваяСделка.ПерваяСделка,
	|	БиржеваяСделка.ИдентификаторЗагрузки,
	|	ВЫРАЗИТЬ(БиржеваяСделка.Поручение КАК Документ.ПоручениеКлиента),
	|	ВЫРАЗИТЬ(БиржеваяСделка.Комментарий КАК СТРОКА(1000)),
	|	БиржеваяСделка.БанковскийСчет,
	|	БиржеваяСделка.ДатаОплатыПлановая,
	|	СостоянияСделкиСрезПоследних.ДатаОплаты,
	|	БиржеваяСделка.ДатаПеререгистрацииПлановая,
	|	СостоянияСделкиСрезПоследних.ДатаПеререгистрации,
	|	БиржеваяСделка.Депозитарий,
	|	БиржеваяСделка.ДепозитарийКонтрагента,
	|	БиржеваяСделка.ДоговорСКлиентом,
	|	БиржеваяСделка.Количество,
	|	БиржеваяСделка.Контрагент,
	|	БиржеваяСделка.ПроцентРЕПО,
	|	БиржеваяСделка.СуммаНКД,
	|	БиржеваяСделка.Цена,
	|	БиржеваяСделка.ВтораяЧастьДатаРасчетов,
	|	БиржеваяСделка.ВтораяЧастьСуммаНКД,
	|	БиржеваяСделка.ВтораяЧастьЦена,
	|	БиржеваяСделка.ТипСделкиРЕПО,
	|	БиржеваяСделка.СпособРасчета,
	|	ВЫРАЗИТЬ(БиржеваяСделка.УсловиеОпределенияСуммы КАК СТРОКА(1000))
	|ИЗ
	|	Документ.БиржеваяСделка КАК БиржеваяСделка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСделки.СрезПоследних(&КонецПериода, ) КАК СостоянияСделкиСрезПоследних
	|		ПО БиржеваяСделка.Ссылка = СостоянияСделкиСрезПоследних.Сделка
	|ГДЕ
	|	БиржеваяСделка.Дата МЕЖДУ &НачалоПериодаФондаВалюта И &КонецПериода
	|	И БиржеваяСделка.ТипДеятельности В (&ТипДеятельностиБрокерская, &ТипДеятельностиДилерская)
	|	И (БиржеваяСделка.ДатаОплатыПлановая <= &КонецПериода
	|			ИЛИ БиржеваяСделка.ДатаПеререгистрацииПлановая <= &КонецПериода)
	|	И (СостоянияСделкиСрезПоследних.ДатаОплаты = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ СостоянияСделкиСрезПоследних.ДатаОплаты > &КонецПериода)
	|	И НЕ СостоянияСделкиСрезПоследних.СостояниеСделки В (&СостоянияЗавершенныхСделок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Сделки.ДатаВремяСделки КАК ДатаВремяСделки,
	|	ВТ_Сделки.НомерСделки КАК НомерСделки,
	|	ВТ_Сделки.НаправлениеСделки КАК НаправлениеСделки,
	|	ВТ_Сделки.Биржа КАК Биржа,
	|	ВТ_Сделки.Портфель КАК Портфель,
	|	ВТ_Сделки.РежимТоргов КАК РежимТоргов,
	|	ВТ_Сделки.СуммаСделки КАК СуммаСделки,
	|	ВТ_Сделки.ВалютаСделки КАК ВалютаСделки,
	|	ВТ_Сделки.ТипДеятельности КАК ТипДеятельности,
	|	ВТ_Сделки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_Сделки.ISIN КАК ISIN,
	|	ВТ_Сделки.Клиент КАК Клиент,
	|	ВТ_Сделки.ПерваяСделка КАК ПерваяСделка,
	|	ВТ_Сделки.ИдентификаторСделки КАК ИдентификаторСделки,
	|	ВТ_Сделки.ПоручениеКлиента КАК ПоручениеКлиента,
	|	ВТ_Сделки.Комментарий КАК Комментарий,
	|	ВТ_Сделки.БанковскийСчет КАК БанковскийСчет,
	|	ВТ_Сделки.ДатаОплатыПлан КАК ДатаОплатыПлан,
	|	ВТ_Сделки.ДатаОплатыФакт КАК ДатаОплатыФакт,
	|	ВТ_Сделки.ДатаПеререгистрацииПлан КАК ДатаПеререгистрацииПлан,
	|	ВТ_Сделки.ДатаПеререгистрацииФакт КАК ДатаПеререгистрацииФакт,
	|	ВТ_Сделки.Депозитарий КАК Депозитарий,
	|	ВТ_Сделки.ДепозитарийКонтрагента КАК ДепозитарийКонтрагента,
	|	ВТ_Сделки.Договор КАК Договор,
	|	ВТ_Сделки.Количество КАК Количество,
	|	ВТ_Сделки.Контрагент КАК Контрагент,
	|	ВТ_Сделки.ПроцентРЕПО КАК ПроцентРЕПО,
	|	ВТ_Сделки.СуммаНКД КАК СуммаНКД,
	|	ВТ_Сделки.Цена КАК Цена,
	|	ВТ_Сделки.ВтораяЧастьДатаРасчетов КАК ВтораяЧастьДатаРасчетов,
	|	ВТ_Сделки.ВтораяЧастьСуммаНКД КАК ВтораяЧастьСуммаНКД,
	|	ВТ_Сделки.ВтораяЧастьЦена КАК ВтораяЧастьЦена,
	|	ВТ_Сделки.ТипСделкиРЕПО КАК ТипСделкиРЕПО,
	|	ВТ_Сделки.СпособРасчета КАК СпособРасчета
	|ИЗ
	|	ВТ_Сделки КАК ВТ_Сделки
	|ГДЕ
	|	ВТ_Сделки.ТипДеятельности = &ТипДеятельностиБрокерская
	|	И ВТ_Сделки.Клиент.ПредоставленоПравоПользованияДС
	|	И (ВТ_Сделки.РежимТоргов.ПереносПозицииБиржей
	|			ИЛИ ВТ_Сделки.ПоручениеКлиента.ТипСделки В (&ТипыСделок))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВремяСделки,
	|	НомерСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Сделки.ДатаВремяСделки КАК ДатаВремяСделки,
	|	ВТ_Сделки.НомерСделки КАК НомерСделки,
	|	ВТ_Сделки.НаправлениеСделки КАК НаправлениеСделки,
	|	ВТ_Сделки.Биржа КАК Биржа,
	|	ВТ_Сделки.Портфель КАК Портфель,
	|	ВТ_Сделки.РежимТоргов КАК РежимТоргов,
	|	ВТ_Сделки.СуммаСделки КАК СуммаСделки,
	|	ВТ_Сделки.ВалютаСделки КАК ВалютаСделки,
	|	ВТ_Сделки.ТипДеятельности КАК ТипДеятельности,
	|	ВТ_Сделки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_Сделки.ISIN КАК ISIN,
	|	ВТ_Сделки.Клиент КАК Клиент,
	|	ВТ_Сделки.ПерваяСделка КАК ПерваяСделка,
	|	ВТ_Сделки.ИдентификаторСделки КАК ИдентификаторСделки,
	|	ВТ_Сделки.ПоручениеКлиента КАК ПоручениеКлиента,
	|	ВТ_Сделки.Комментарий КАК Комментарий,
	|	ВТ_Сделки.БанковскийСчет КАК БанковскийСчет,
	|	ВТ_Сделки.ДатаОплатыПлан КАК ДатаОплатыПлан,
	|	ВТ_Сделки.ДатаОплатыФакт КАК ДатаОплатыФакт,
	|	ВТ_Сделки.ДатаПеререгистрацииПлан КАК ДатаПеререгистрацииПлан,
	|	ВТ_Сделки.ДатаПеререгистрацииФакт КАК ДатаПеререгистрацииФакт,
	|	ВТ_Сделки.Депозитарий КАК Депозитарий,
	|	ВТ_Сделки.ДепозитарийКонтрагента КАК ДепозитарийКонтрагента,
	|	ВТ_Сделки.Договор КАК Договор,
	|	ВТ_Сделки.Количество КАК Количество,
	|	ВТ_Сделки.Контрагент КАК Контрагент,
	|	ВТ_Сделки.ПроцентРЕПО КАК ПроцентРЕПО,
	|	ВТ_Сделки.СуммаНКД КАК СуммаНКД,
	|	ВТ_Сделки.Цена КАК Цена,
	|	ВТ_Сделки.ВтораяЧастьДатаРасчетов КАК ВтораяЧастьДатаРасчетов,
	|	ВТ_Сделки.ВтораяЧастьСуммаНКД КАК ВтораяЧастьСуммаНКД,
	|	ВТ_Сделки.ВтораяЧастьЦена КАК ВтораяЧастьЦена,
	|	ВТ_Сделки.ТипСделкиРЕПО КАК ТипСделкиРЕПО,
	|	ВТ_Сделки.СпособРасчета КАК СпособРасчета
	|ИЗ
	|	ВТ_Сделки КАК ВТ_Сделки
	|ГДЕ
	|	ВТ_Сделки.ТипДеятельности = &ТипДеятельностиДилерская
	|	И НЕ ВТ_Сделки.РежимТоргов.Код В (&КодыРежимовТорговДляИсключения)
	|	И (ВТ_Сделки.СуммаСделки <> 0
	|			ИЛИ ВТ_Сделки.УсловиеОпределенияСуммы <> """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВремяСделки,
	|	НомерСделки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует текст запроса для выбора валютных сделок (клиентских и собственных)
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ТекстЗапросаВалютныйРынок()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВалютнаяСделка.Дата КАК ДатаВремяСделки,
	|	ВалютнаяСделка.Номер КАК НомерСделки,
	|	ВалютнаяСделка.ТипДеятельности КАК ТипДеятельности,
	|	ВалютнаяСделка.ВидСделки КАК НаправлениеСделки,
	|	ВЫБОР
	|		КОГДА ВалютнаяСделка.ТипДеятельности = &ТипДеятельностиДилерская
	|			ТОГДА ВЫБОР
	|					КОГДА ВалютнаяСделка.ЦеннаяБумага.ВидЦБ = &ВидВалютнойСделкиSwap
	|						ТОГДА &ТипСделкиSwap
	|					ИНАЧЕ &ТипСделкиSpot
	|				КОНЕЦ
	|		ИНАЧЕ ВалютнаяСделка.Поручение.ТипСделки
	|	КОНЕЦ КАК ТипСделки,
	|	ВалютнаяСделка.Биржа КАК Биржа,
	|	ВалютнаяСделка.Клиент КАК Клиент,
	|	ВалютнаяСделка.ДоговорСКлиентом КАК Договор,
	|	ВалютнаяСделка.Контрагент КАК Контрагент,
	|	ВалютнаяСделка.РежимТоргов КАК РежимТоргов,
	|	ВалютнаяСделка.БанковскийСчет КАК БанковскийСчет,
	|	ВалютнаяСделка.ЦеннаяБумага КАК ИдентификаторАктива,
	|	ВалютнаяСделка.ВалютаСделки КАК ВалютаЛота,
	|	ВалютнаяСделка.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ВалютнаяСделка.БазовыйАктив КАК ВалютнаяПара,
	|	ВалютнаяСделка.Количество КАК Количество,
	|	ВалютнаяСделка.Цена КАК Цена,
	|	ВалютнаяСделка.Сумма КАК СуммаСделки,
	|	ВалютнаяСделка.Портфель КАК Портфель,
	|	ВалютнаяСделка.Поручение КАК Поручение,
	|	ВалютнаяСделка.ПерваяСделка КАК ПерваяСделка,
	|	ВалютнаяСделка.ИдентификаторЗагрузки КАК ИдентификаторСделки,
	|	ВалютнаяСделка.СпособРасчета КАК СпособРасчета,
	|	ВалютнаяСделка.СекцияБиржи КАК СекцияБиржи,
	|	АтрибутыСделок577П.ФормаРасчетов КАК ФормаРасчетов,
	|	СостоянияВалютнойСделкиСрезПоследних.ДатаОплатыВВалютеЛота КАК ДатаОплатыВВалютеЛота,
	|	ВалютнаяСделка.ДатаОплатыВВалютеЛотаПлановая КАК ДатаОплатыВВалютеЛотаПлан,
	|	СостоянияВалютнойСделкиСрезПоследних.ДатаОплатыВВалютеРасчетов КАК ДатаОплатыВВалютеРасчетов,
	|	ВалютнаяСделка.ДатаОплатыВВалютеРасчетовПлановая КАК ДатаОплатыВВалютеРасчетовПлан
	|ПОМЕСТИТЬ ВТ_СделкиВалютные
	|ИЗ
	|	Документ.ВалютнаяСделка КАК ВалютнаяСделка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВалютнойСделки.СрезПоследних(&КонецПериода, ) КАК СостоянияВалютнойСделкиСрезПоследних
	|		ПО ВалютнаяСделка.Ссылка = СостоянияВалютнойСделкиСрезПоследних.Сделка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АтрибутыСделок577П КАК АтрибутыСделок577П
	|		ПО ВалютнаяСделка.Ссылка = АтрибутыСделок577П.Основание
	|ГДЕ
	|	ВалютнаяСделка.Дата МЕЖДУ &НачалоПериодаФондаВалюта И &КонецПериода
	|	И ВалютнаяСделка.ТипДеятельности В (&ТипДеятельностиБрокерская, &ТипДеятельностиДилерская)
	|	И ВалютнаяСделка.ДатаОплатыВВалютеЛотаПлановая > &КонецПериода
	|	И ВалютнаяСделка.ДатаОплатыВВалютеРасчетовПлановая > &КонецПериода
	|	И НЕ СостоянияВалютнойСделкиСрезПоследних.СостояниеСделки В (&СостоянияЗавершенныхСделок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВалютнаяСделка.Дата,
	|	ВалютнаяСделка.Номер,
	|	ВалютнаяСделка.ТипДеятельности,
	|	ВалютнаяСделка.ВидСделки,
	|	ВЫБОР
	|		КОГДА ВалютнаяСделка.ТипДеятельности = &ТипДеятельностиДилерская
	|			ТОГДА ВЫБОР
	|					КОГДА ВалютнаяСделка.ЦеннаяБумага.ВидЦБ = &ВидВалютнойСделкиSwap
	|						ТОГДА &ТипСделкиSwap
	|					ИНАЧЕ &ТипСделкиSpot
	|				КОНЕЦ
	|		ИНАЧЕ ВалютнаяСделка.Поручение.ТипСделки
	|	КОНЕЦ,
	|	ВалютнаяСделка.Биржа,
	|	ВалютнаяСделка.Клиент,
	|	ВалютнаяСделка.ДоговорСКлиентом,
	|	ВалютнаяСделка.Контрагент,
	|	ВалютнаяСделка.РежимТоргов,
	|	ВалютнаяСделка.БанковскийСчет,
	|	ВалютнаяСделка.ЦеннаяБумага,
	|	ВалютнаяСделка.ВалютаСделки,
	|	ВалютнаяСделка.ВалютаРасчетов,
	|	ВалютнаяСделка.БазовыйАктив,
	|	ВалютнаяСделка.Количество,
	|	ВалютнаяСделка.Цена,
	|	ВалютнаяСделка.Сумма,
	|	ВалютнаяСделка.Портфель,
	|	ВалютнаяСделка.Поручение,
	|	ВалютнаяСделка.ПерваяСделка,
	|	ВалютнаяСделка.ИдентификаторЗагрузки,
	|	ВалютнаяСделка.СпособРасчета,
	|	ВалютнаяСделка.СекцияБиржи,
	|	АтрибутыСделок577П.ФормаРасчетов,
	|	СостоянияВалютнойСделкиСрезПоследних.ДатаОплатыВВалютеЛота,
	|	ВалютнаяСделка.ДатаОплатыВВалютеЛотаПлановая,
	|	СостоянияВалютнойСделкиСрезПоследних.ДатаОплатыВВалютеРасчетов,
	|	ВалютнаяСделка.ДатаОплатыВВалютеРасчетовПлановая
	|ИЗ
	|	Документ.ВалютнаяСделка КАК ВалютнаяСделка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВалютнойСделки.СрезПоследних(&КонецПериода, ) КАК СостоянияВалютнойСделкиСрезПоследних
	|		ПО ВалютнаяСделка.Ссылка = СостоянияВалютнойСделкиСрезПоследних.Сделка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АтрибутыСделок577П КАК АтрибутыСделок577П
	|		ПО ВалютнаяСделка.Ссылка = АтрибутыСделок577П.Основание
	|ГДЕ
	|	ВалютнаяСделка.Дата МЕЖДУ &НачалоПериодаФондаВалюта И &КонецПериода
	|	И ВалютнаяСделка.ТипДеятельности В (&ТипДеятельностиБрокерская, &ТипДеятельностиДилерская)
	|	И ВалютнаяСделка.ДатаОплатыВВалютеЛотаПлановая <= &КонецПериода
	|	И ВалютнаяСделка.ДатаОплатыВВалютеРасчетовПлановая <= &КонецПериода
	|	И (СостоянияВалютнойСделкиСрезПоследних.ДатаОплатыВВалютеЛота = ДАТАВРЕМЯ(1, 1, 1)
	|				И СостоянияВалютнойСделкиСрезПоследних.ДатаОплатыВВалютеРасчетов = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ СостоянияВалютнойСделкиСрезПоследних.ДатаОплатыВВалютеЛота > &КонецПериода
	|				И СостоянияВалютнойСделкиСрезПоследних.ДатаОплатыВВалютеРасчетов > &КонецПериода)
	|	И НЕ СостоянияВалютнойСделкиСрезПоследних.СостояниеСделки В (&СостоянияЗавершенныхСделок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СделкиВалютные.ДатаВремяСделки КАК ДатаВремяСделки,
	|	ВТ_СделкиВалютные.НомерСделки КАК НомерСделки,
	|	ВТ_СделкиВалютные.ТипДеятельности КАК ТипДеятельности,
	|	ВТ_СделкиВалютные.НаправлениеСделки КАК НаправлениеСделки,
	|	ВТ_СделкиВалютные.ТипСделки КАК ТипСделки,
	|	ВТ_СделкиВалютные.Биржа КАК Биржа,
	|	ВТ_СделкиВалютные.Клиент КАК Клиент,
	|	ВТ_СделкиВалютные.Договор КАК Договор,
	|	ВТ_СделкиВалютные.Контрагент КАК Контрагент,
	|	ВТ_СделкиВалютные.РежимТоргов КАК РежимТоргов,
	|	ВТ_СделкиВалютные.БанковскийСчет КАК БанковскийСчет,
	|	ВТ_СделкиВалютные.ИдентификаторАктива КАК ИдентификаторАктива,
	|	ВТ_СделкиВалютные.ВалютаЛота КАК ВалютаЛота,
	|	ВТ_СделкиВалютные.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ВТ_СделкиВалютные.ВалютнаяПара КАК ВалютнаяПара,
	|	ВТ_СделкиВалютные.Количество КАК Количество,
	|	ВТ_СделкиВалютные.Цена КАК Цена,
	|	ВТ_СделкиВалютные.СуммаСделки КАК СуммаСделки,
	|	ВТ_СделкиВалютные.Портфель КАК Портфель,
	|	ВТ_СделкиВалютные.Поручение КАК Поручение,
	|	ВТ_СделкиВалютные.ПерваяСделка КАК ПерваяСделка,
	|	ВТ_СделкиВалютные.ИдентификаторСделки КАК ИдентификаторСделки,
	|	ВТ_СделкиВалютные.СпособРасчета КАК СпособРасчета,
	|	ВТ_СделкиВалютные.СекцияБиржи КАК СекцияБиржи,
	|	ВТ_СделкиВалютные.ФормаРасчетов КАК ФормаРасчетов,
	|	ВТ_СделкиВалютные.ДатаОплатыВВалютеЛота КАК ДатаОплатыВВалютеЛота,
	|	ВТ_СделкиВалютные.ДатаОплатыВВалютеЛотаПлан КАК ДатаОплатыВВалютеЛотаПлан,
	|	ВТ_СделкиВалютные.ДатаОплатыВВалютеРасчетов КАК ДатаОплатыВВалютеРасчетов,
	|	ВТ_СделкиВалютные.ДатаОплатыВВалютеРасчетовПлан КАК ДатаОплатыВВалютеРасчетовПлан
	|ИЗ
	|	ВТ_СделкиВалютные КАК ВТ_СделкиВалютные
	|ГДЕ
	|	ВТ_СделкиВалютные.ТипДеятельности = &ТипДеятельностиБрокерская
	|	И ВТ_СделкиВалютные.Клиент.ПредоставленоПравоПользованияДС
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВремяСделки,
	|	НомерСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СделкиВалютные.ДатаВремяСделки КАК ДатаВремяСделки,
	|	ВТ_СделкиВалютные.НомерСделки КАК НомерСделки,
	|	ВТ_СделкиВалютные.ТипДеятельности КАК ТипДеятельности,
	|	ВТ_СделкиВалютные.НаправлениеСделки КАК НаправлениеСделки,
	|	ВТ_СделкиВалютные.ТипСделки КАК ТипСделки,
	|	ВТ_СделкиВалютные.Биржа КАК Биржа,
	|	ВТ_СделкиВалютные.Клиент КАК Клиент,
	|	ВТ_СделкиВалютные.Договор КАК Договор,
	|	ВТ_СделкиВалютные.Контрагент КАК Контрагент,
	|	ВТ_СделкиВалютные.РежимТоргов КАК РежимТоргов,
	|	ВТ_СделкиВалютные.БанковскийСчет КАК БанковскийСчет,
	|	ВТ_СделкиВалютные.ИдентификаторАктива КАК ИдентификаторАктива,
	|	ВТ_СделкиВалютные.ВалютаЛота КАК ВалютаЛота,
	|	ВТ_СделкиВалютные.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ВТ_СделкиВалютные.ВалютнаяПара КАК ВалютнаяПара,
	|	ВТ_СделкиВалютные.Количество КАК Количество,
	|	ВТ_СделкиВалютные.Цена КАК Цена,
	|	ВТ_СделкиВалютные.СуммаСделки КАК СуммаСделки,
	|	ВТ_СделкиВалютные.Портфель КАК Портфель,
	|	ВТ_СделкиВалютные.Поручение КАК Поручение,
	|	ВТ_СделкиВалютные.ПерваяСделка КАК ПерваяСделка,
	|	ВТ_СделкиВалютные.ИдентификаторСделки КАК ИдентификаторСделки,
	|	ВТ_СделкиВалютные.СпособРасчета КАК СпособРасчета,
	|	ВТ_СделкиВалютные.СекцияБиржи КАК СекцияБиржи,
	|	ВТ_СделкиВалютные.ФормаРасчетов КАК ФормаРасчетов,
	|	ВТ_СделкиВалютные.ДатаОплатыВВалютеЛота КАК ДатаОплатыВВалютеЛота,
	|	ВТ_СделкиВалютные.ДатаОплатыВВалютеЛотаПлан КАК ДатаОплатыВВалютеЛотаПлан,
	|	ВТ_СделкиВалютные.ДатаОплатыВВалютеРасчетов КАК ДатаОплатыВВалютеРасчетов,
	|	ВТ_СделкиВалютные.ДатаОплатыВВалютеРасчетовПлан КАК ДатаОплатыВВалютеРасчетовПлан
	|ИЗ
	|	ВТ_СделкиВалютные КАК ВТ_СделкиВалютные
	|ГДЕ
	|	ВТ_СделкиВалютные.ТипДеятельности = &ТипДеятельностиДилерская
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВремяСделки,
	|	НомерСделки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует текст запроса к регистру ДенежныеСредстваВПутиБ
//
// Параметры:
//  ИмяПараметра1	 - Строка - Имя параметра, содержащего список видов затрат
//  ИмяПараметра2	 - Строка - Имя параметра, отвечающего за использование денежных средств клиента
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ТекстЗапросаОстаткиИОбороты(ВидыЗатрат, ПредоставленоПравоПользованияДС)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредстваВПутиБОстаткиИОбороты.Валюта КАК Измерение,
	|	ДенежныеСредстваВПутиБОстаткиИОбороты.ВалютнаяСуммаНачальныйОстаток КАК НачальныйОстаток,
	|	ДенежныеСредстваВПутиБОстаткиИОбороты.ВалютнаяСуммаПриход КАК Приход,
	|	ДенежныеСредстваВПутиБОстаткиИОбороты.ВалютнаяСуммаРасход КАК Расход,
	|	ДенежныеСредстваВПутиБОстаткиИОбороты.ВалютнаяСуммаКонечныйОстаток КАК КонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПутиБ.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			ВидЗатрат В (&ВидыЗатрат)
	|				И &ПредоставленоПравоПользованияДС) КАК ДенежныеСредстваВПутиБОстаткиИОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Измерение
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВидыЗатрат", ВидыЗатрат);
	Если ПредоставленоПравоПользованияДС = "ПредоставленоПравоПользованияДСНет" Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПредоставленоПравоПользованияДС", "НЕ Договор.Владелец.ПредоставленоПравоПользованияДС");
	Иначе 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПредоставленоПравоПользованияДС", "Договор.Владелец.ПредоставленоПравоПользованияДС");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует текст запроса к регистру ЦенныеБумагиД
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ТекстЗапросаСобственныеАктивыНаФОРТС()
	
	Возврат
	"ВЫБРАТЬ
	|	ЦенныеБумагиДОстаткиИОбороты.Депозитарий КАК Измерение,
	|	ЦенныеБумагиДОстаткиИОбороты.ЦеннаяБумага КАК Измерение2,
	|	ЦенныеБумагиДОстаткиИОбороты.КоличествоНачальныйОстаток КАК НачальныйОстаток,
	|	ЦенныеБумагиДОстаткиИОбороты.КоличествоПриход КАК Приход,
	|	ЦенныеБумагиДОстаткиИОбороты.КоличествоРасход КАК Расход,
	|	ЦенныеБумагиДОстаткиИОбороты.КоличествоКонечныйОстаток КАК КонечныйОстаток
	|ИЗ	
	// БИА: разделение регистров (партии, количество) -->
	//|	РегистрНакопления.ЦенныеБумагиД.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Депозитарий = &ДепозитарийFORTS) КАК ЦенныеБумагиДОстаткиИОбороты	
	|	РегистрНакопления.ЦенныеБумагиДКоличество.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Депозитарий = &ДепозитарийFORTS) КАК ЦенныеБумагиДОстаткиИОбороты	
	// БИА <--
	|
	|УПОРЯДОЧИТЬ ПО
	|	Измерение,
	|	Измерение2
	|ИТОГИ
	|	СУММА(НачальныйОстаток),
	|	СУММА(Приход),
	|	СУММА(Расход),
	|	СУММА(КонечныйОстаток)
	|ПО
	|	Измерение
	|АВТОУПОРЯДОЧИВАНИЕ";
	
КонецФункции

// Заполняет табличный документ данными раздела (для Фондового и Валютного рынков)
//
// Параметры:
//  ТабличныеДокументы	 - Структура - соответствие разделов отчета и сформированных табличных документов
//  ДанныеРазделов		 - Массив	 - Результаты запроса по разделам
//  ИмяРаздела			 - Строка	 - Имя раздела
//  ИмяМакета			 - Строка	 - Макет, который необходимо использовать при формировании табличного документа
//
Процедура ДобавитьРазделВТабличныйДокумент(ТабличныеДокументы, ДанныеРазделов, ИмяРаздела, ИмяМакета)
	
	ТабДок = Новый ТабличныйДокумент;
	ДанныеРаздела = ДанныеРазделаПоИмени(ДанныеРазделов, ИмяРаздела);
	
	Если ДанныеРаздела = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Макет = ПолучитьМакет(ИмяМакета);
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОбластьШапка);
	Пока ДанныеРаздела.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ДанныеРаздела,, "Количество, Цена");
		
		СоставЧисла = ИнформацияОЧисле(ДанныеРаздела.Количество);
		Если СоставЧисла.ЦелаяЧастьДлина > 15 Тогда 
			КоличествоВОтчет = ДанныеРаздела.Количество;
			Точность = 6;
		Иначе
			Точность = Мин(15-СоставЧисла.ЦелаяЧастьДлина, 6);
			КоличествоВОтчет = Окр(ДанныеРаздела.Количество, Точность);
		КонецЕсли;
		
		ОбластьСтрока.Параметры.Количество = Формат(КоличествоВОтчет, "ЧДЦ="+Точность);
		
		Если ИмяМакета = "ФондовыйРынок" Тогда 
			МаксимальнаяТочность = 12;
		Иначе 
			МаксимальнаяТочность = 10;
		КонецЕсли;
		СоставЧисла = ИнформацияОЧисле(ДанныеРаздела.Цена);
		Если СоставЧисла.ЦелаяЧастьДлина > 15 Тогда 
			ЦенаВОтчет = ДанныеРаздела.Цена;
			Точность = МаксимальнаяТочность;
		Иначе
			Точность = Мин(15-СоставЧисла.ЦелаяЧастьДлина, МаксимальнаяТочность);
			ЦенаВОтчет = Окр(ДанныеРаздела.Цена, Точность);
		КонецЕсли;
		
		ОбластьСтрока.Параметры.Цена = Формат(ЦенаВОтчет, "ЧДЦ="+Точность);
		
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ТабДок.ФиксацияСверху = 1;
	
	ТабличныеДокументы.Вставить(ИмяРаздела, ТабДок);
	
КонецПроцедуры

// Получает длину целой и дробной части числа
//
// Параметры:
//  Число	 - Число - Число, которое требуется проанализировать
// 
// Возвращаемое значение:
//  Структура - Информация о длине целой и дробной части числа
//
Функция ИнформацияОЧисле(Число)
	
	ЧислоСтр = СтрЗаменить(Строка(Число), " ", "");
	ЧислоСтр = СтрЗаменить(Строка(ЧислоСтр), Символы.НПП, "");
	
	Разделитель = СтрНайти(ЧислоСтр, ",");
	Если Разделитель = 0 Тогда 
		ЦелаяЧастьСтр = ЧислоСтр;
		ДробнаяЧастьСтр = "";
	Иначе 
		ЦелаяЧастьСтр = Лев(ЧислоСтр, Разделитель-1);
		ДробнаяЧастьСтр = Сред(ЧислоСтр, Разделитель+1);
	КонецЕсли;
	
	Информация = Новый Структура("ЦелаяЧастьДлина, ДробнаяЧастьДлина", 0,0);
	Информация.ЦелаяЧастьДлина = СтрДлина(ЦелаяЧастьСтр);
	Информация.ДробнаяЧастьДлина = СтрДлина(ДробнаяЧастьСтр);
	
	Возврат Информация;
	
КонецФункции

// Заполняет табличный документ данными раздела (для макета ОстаткиИОбороты)
//
// Параметры:
//  ТабличныеДокументы	 - Структура - соответствие разделов отчета и сформированных табличных документов
//  ДанныеРазделов		 - Массив	 - Результаты запроса по разделам
//  ИмяРаздела			 - Строка	 - Имя раздела
//  Измерение			 - Строка	 - Имя группировки в шапке таблицы
//  Показатель			 - Строка	 - Имя показателя в шапке таблицы
//  Постфикс			 - Строка	 - Используется для изменения имени используемой области макета
//
Процедура ДобавитьРазделОстаткиИОборотыВТабличныйДокумент(ТабличныеДокументы, ДанныеРазделов, ИмяРаздела, Измерение = "Валюта", Показатель = "Валютная сумма", Постфикс = "")
	
	ТабДок = Новый ТабличныйДокумент;
	ДанныеРаздела = ДанныеРазделаПоИмени(ДанныеРазделов, ИмяРаздела);
	
	Если ДанныеРаздела = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Макет = ПолучитьМакет("ОстаткиИОбороты");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка" + Постфикс);
	ОбластьСтрокаДетали = Макет.ПолучитьОбласть("СтрокаДетали" + Постфикс);
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал" + Постфикс);
	
	ОбластьШапка.Параметры.Измерение = Измерение;
	ОбластьШапка.Параметры.Показатель = Показатель;
	ТабДок.Вывести(ОбластьШапка);
	
	НачальныйОстатокИтог = 0;
	ПриходИтог = 0;
	РасходИтог = 0;
	КонечныйОстатокИтог = 0;
	Пока ДанныеРаздела.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ДанныеРаздела);
		ТабДок.Вывести(ОбластьСтрока);
		
		ДетальныеЗаписи = ДанныеРаздела.Выбрать();
		Пока ДетальныеЗаписи.Следующий() Цикл 
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаДетали.Параметры, ДетальныеЗаписи,, "Измерение");
			ОбластьСтрокаДетали.Параметры.Измерение = ДетальныеЗаписи.Измерение2;
			ТабДок.Вывести(ОбластьСтрокаДетали);
		КонецЦикла;
		
		НачальныйОстатокИтог = НачальныйОстатокИтог + ДанныеРаздела.НачальныйОстаток;
		ПриходИтог = ПриходИтог + ДанныеРаздела.Приход;
		РасходИтог = РасходИтог + ДанныеРаздела.Расход;
		КонечныйОстатокИтог= КонечныйОстатокИтог + ДанныеРаздела.КонечныйОстаток;
	КонецЦикла;
	ОбластьПодвал.Параметры.НачальныйОстатокИтог = НачальныйОстатокИтог;
	ОбластьПодвал.Параметры.ПриходИтог = ПриходИтог;
	ОбластьПодвал.Параметры.РасходИтог = РасходИтог;
	ОбластьПодвал.Параметры.КонечныйОстатокИтог = КонечныйОстатокИтог;
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабличныеДокументы.Вставить(ИмяРаздела, ТабДок);
	
КонецПроцедуры
