//////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МестоХраненияНРД = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияПоУмолчанию");
	МестоХраненияБЭБ = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияБЭБ");
	МестоХраненияРДЦ = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияРДЦ");
	
	Элементы.ВышестоящийДепозитарий.СписокВыбора.Добавить(МестоХраненияНРД);
	Элементы.ВышестоящийДепозитарий.СписокВыбора.Добавить(МестоХраненияБЭБ);
	Элементы.ВышестоящийДепозитарий.СписокВыбора.Добавить(МестоХраненияРДЦ);
	Объект.ВышестоящийДепозитарий = МестоХраненияНРД;
	Объект.СчетДЕПО_ПоУмолчанию = СчетДЕПОПоУмолчанию(Объект.ВышестоящийДепозитарий);
	Объект.ПериодНачало			= ТекущаяДата();
	Объект.ПериодКонец			= ТекущаяДата();
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ШлюзНРД;
	ПараметрыИсточника = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник);
	Если Не ЗначениеЗаполнено(Объект.ПутьККаталогу) Тогда
		Если ЗначениеЗаполнено(ПараметрыИсточника.Папка) Тогда
			Объект.ПутьККаталогу = ПараметрыИсточника.Папка;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Внимание! Не настроен внешний источник """ + ВнешнийИсточник + """!";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ИмяОбработкиНРД") Тогда
		ИмяОбработкиНРД = Параметры.ИмяОбработкиНРД;
		Если Параметры.Свойство("ПараметрыОбработкиНРД") Тогда
			ПараметрыОбработкиНРД = Параметры.ПараметрыОбработкиНРД;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура ВыборПериода(Команда)
	Диалог	= Новый ДиалогРедактированияСтандартногоПериода();
	
	Диалог.Период.ДатаНачала	= Объект.ПериодНачало;
	Диалог.Период.ДатаОкончания	= ?(Объект.ПериодНачало='0001-01-01', Объект.ПериодКонец, НачалоДня(Объект.ПериодНачало));
	Диалог.Период.Вариант		= ВариантСтандартногоПериода.ПроизвольныйПериод;
	
	Если Диалог.Редактировать() Тогда
		Объект.ПериодНачало	= НачалоДня(Диалог.Период.ДатаНачала);
		Объект.ПериодКонец	= КонецДня(Диалог.Период.ДатаОкончания);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	СформироватьДокументыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьФайлыИОбработать(Команда)
	Если Объект.ПериодНачало > Объект.ПериодКонец Тогда
		ПоказатьПредупреждение(, "Некорректно задан период!");
		Возврат;
	КонецЕсли;
	ОбработатьФайлыСервер();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсе(Команда)
	Для Каждого Строка Из Объект.ДанныеКорпоративныхДействий Цикл
		Строка.Обрабатывать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого Строка Из Объект.ДанныеКорпоративныхДействий Цикл
		Строка.Обрабатывать = Ложь;
	КонецЦикла;
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ВышестоящийДепозитарийПриИзменении(Элемент)
	Объект.СчетДЕПО_ПоУмолчанию = СчетДЕПОПоУмолчанию(Объект.ВышестоящийДепозитарий);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКорпоративныхДействийСчетДЕПОПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДанныеКорпоративныхДействий.ТекущиеДанные;
	ТекущаяСтрока.КДРеференс = СокрЛП(ТекущаяСтрока.КДРеференсВходящий) + КраткийКодСчетаДепо(ТекущаяСтрока.СчетДЕПО);
	ТекущаяСтрока.ДокументКД = КДПоВходящемуРеференсуИСчетуДепо(ТекущаяСтрока.КДРеференсВходящий, ТекущаяСтрока.СчетДЕПО);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКорпоративныхДействийКДРеференсВходящийПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДанныеКорпоративныхДействий.ТекущиеДанные;
	ТекущаяСтрока.КДРеференс = СокрЛП(ТекущаяСтрока.КДРеференсВходящий) + КраткийКодСчетаДепо(ТекущаяСтрока.СчетДЕПО);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

&НаСервере
Процедура ОбработатьФайлыСервер()
	Обработка = РеквизитФормыВЗначение("Объект");
	ЭтоЗагрузкаТестовыхXML = ЗначениеЗаполнено(Параметры.ТестовыеXML);
	
	Если ЭтоЗагрузкаТестовыхXML Тогда
		Обработка.ПутьККаталогу = ВременныйКаталогТестовыхXML();
	Иначе
		Обработка.УстановитьПутьККаталогу();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Обработка.ПутьККаталогу) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяОбработкиНРД) Тогда
		Обработка.ИнициироватьСоединение(Новый Структура("ИмяОбработки, Параметры",
			ИмяОбработкиНРД, ПараметрыОбработкиНРД));
	КонецЕсли;
	
	Обработка.ПрочитатьФайлы();
	ЗначениеВРеквизитФормы(Обработка, "Объект");
	
	Если ЭтоЗагрузкаТестовыхXML Тогда
		УдалитьФайлы(Объект.ПутьККаталогу);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВременныйКаталогТестовыхXML()
	
	//Этот каталог после загрузки файла будет удален. Получим уникальное имя
	ВременныйКаталог = ПолучитьИмяВременногоФайла(); 
	
	Если Объект.ВышестоящийДепозитарий = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияПоУмолчанию") Тогда
		
		ПутьКаталогаInbox = ВременныйКаталог + "\Inbox\";
		СоздатьКаталог(ПутьКаталогаInbox);
		
		НомерАрхива = 1;
		
		Для Каждого ТестовыйXML Из Параметры.ТестовыеXML Цикл
			
			ИмяКаталогаQ = "Q" + Формат(НомерАрхива, "ЧЦ=7; ЧВН=; ЧГ=");
			ПутьКаталогаQ = ПутьКаталогаInbox + ИмяКаталогаQ + "\";
			СоздатьКаталог(ПутьКаталогаQ);   

			ЗаписьТекста = Новый ЗаписьТекста(ПутьКаталогаQ + ИмяКаталогаQ + ".xml", "Windows-1251");
			ЗаписьТекста.Записать(ТестовыйXML);
			ЗаписьТекста.Закрыть();
			
			ЗаписьZIP = Новый ЗаписьZipФайла(ПутьКаталогаQ + ИмяКаталогаQ + ".zip");  	
			ЗаписьZIP.Добавить(ПутьКаталогаQ + ИмяКаталогаQ + ".xml");
			ЗаписьZIP.Записать(); 
			
			УдалитьФайлы(ПутьКаталогаQ + ИмяКаталогаQ + ".xml");
		
			НомерАрхива = НомерАрхива + 1;
			
		КонецЦикла;
		
	ИначеЕсли Объект.ВышестоящийДепозитарий = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияБЭБ")
		Или Объект.ВышестоящийДепозитарий = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияРДЦ") Тогда
		ПутьКаталогаInbox = ВременныйКаталог + "\" + Формат(Объект.ПериодНачало, "ДФ=yyyy_MM_dd") + "\";
		СоздатьКаталог(ПутьКаталогаInbox);
		
		НомерФайла = 1;
		Для Каждого ТестовыйXML Из Параметры.ТестовыеXML Цикл
			ЗаписьТекста = Новый ЗаписьТекста(ПутьКаталогаInbox + "corp_" + НомерФайла + ".xml", "Windows-1251");
			ЗаписьТекста.Записать(ТестовыйXML);
			ЗаписьТекста.Закрыть();
			
			НомерФайла = НомерФайла + 1;
		КонецЦикла;
	Иначе
		
		//Чтобы отобразилась ошибка в вызывающей функции
		ВременныйКаталог = "";
		
	КонецЕсли;
	
	Возврат ВременныйКаталог;
	
КонецФункции


&НаСервере
Процедура СформироватьДокументыСервер()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.СформироватьДокументы();
	ЭтоЗагрузкаТестовыхXML = ЗначениеЗаполнено(Параметры.ТестовыеXML);
	Если Не ЭтоЗагрузкаТестовыхXML Тогда
		Обработка.ПеренестиВАрхив(Новый Массив);
	КонецЕсли;
	ЗначениеВРеквизитФормы(Обработка,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКорпоративныхДействийПриАктивизацииСтроки(Элемент)
	Если Не Элемент.ТекущиеДанные = Неопределено Тогда 
		ВхНомер = Элемент.ТекущиеДанные.ВходящийДокументНомер;
		ОтборПоВходящемуНомеру = Новый ФиксированнаяСтруктура("ВходящийДокументНомер", ВхНомер);
		Элементы.ВопросыКГолосованию.ОтборСтрок = ОтборПоВходящемуНомеру;
		Элементы.ИнформацияПоВариантамУчастия.ОтборСтрок = ОтборПоВходящемуНомеру;
		ЗаполнитьРеквизитЦенныеБумагиНаСервере(Элемент.ТекущиеДанные.КлючЦенныеБумаги);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитЦенныеБумагиНаСервере(КлючЦенныеБумаги)
	мРеквизитЦенныеБумаги = РеквизитФормыВЗначение("РеквизитЦенныеБумаги");
	мРеквизитЦенныеБумаги.Очистить();
	Отбор = Новый Структура("КлючДанныеКорпоративныхДействий", КлючЦенныеБумаги);
	Строки = Объект.ЦенныеБумаги.НайтиСтроки(Отбор);
	Для Каждого СтрокаЦБ Из Строки Цикл
		НоваяСтрокаЦБ = мРеквизитЦенныеБумаги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаЦБ, СтрокаЦБ);
	КонецЦикла;
	мРеквизитЦенныеБумаги.Сортировать("ДтКт Убыв");
	ЗначениеВРеквизитФормы(мРеквизитЦенныеБумаги, "РеквизитЦенныеБумаги");
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКорпоративныхДействийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ДанныеКорпоративныхДействийДокументРаскрытия" Тогда
		ОткрытьЗначение(Элементы.ДанныеКорпоративныхДействий.ДанныеСтроки(ВыбраннаяСтрока).ДокументКД);
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция СчетДЕПОПоУмолчанию(ВышестоящийДепозитарий)
	Возврат ВышестоящийДепозитарий.ОсновнойСчетДепо;
КонецФункции

&НаСервереБезКонтекста
Функция КраткийКодСчетаДепо(СчетДЕПО)
	
	КраткийКод = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДЕПО, "КраткийКод");
	Возврат СокрЛП(КраткийКод);
	
КонецФункции

&НаСервереБезКонтекста
Функция КДПоВходящемуРеференсуИСчетуДепо(КДРеференсВходящий, СчетДЕПО)
	
	Возврат Документы.КорпоративноеДействие_Новый.КДПоВходящемуРеференсуИСчетуДепо(КДРеференсВходящий, СчетДЕПО);
	
КонецФункции