
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьСообщенияКлиентам();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОшибкиОтправки = РезультатОтправкиСообщений();
	Если ЗначениеЗаполнено(ОшибкиОтправки) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(ОшибкиОтправки);
	КонецЕсли
КонецПроцедуры

&НаСервере
Функция РезультатОтправкиСообщений()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.РезультатОтправкиСообщений();
КонецФункции
