&НаСервере
Функция ВыгрузитьВ_ФШНаСервере(ОписаниеОшибки)
	ОписаниеОшибки = "";
	Обр = РеквизитФормыВЗначение("Объект");
	УКБезВыгодоприобретателей = "";
	СообщениеВФШНРД = Обр.ВыгрузитьРаскрытиеСписка_FCDR_17_02(ОписаниеОшибки, УКБезВыгодоприобретателей);
	Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Ошибка = Обр.РезультатФормированияПакета_ФШ(СообщениеВФШНРД,УКБезВыгодоприобретателей);
		Если Ошибка<>Неопределено Тогда
			ОписаниеОшибки = Ошибка.СообщениеПользователю;
		КонецЕсли;
		
	КонецЕсли;
КонецФункции
&НаКлиенте
Процедура ВыгрузитьВ_ФШ(Команда)
	Если Вопрос("Отправить раскрытие в файловый шлюз?",РежимДиалогаВопрос.ОКОтмена)=КодВозвратаДиалога.ОК Тогда
		ОписаниеОшибки = "";
		ВыгрузитьВ_ФШНаСервере(ОписаниеОшибки);
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки;
			Сообщение.Сообщить();
		Иначе
			Предупреждение("Раскрытие отправлено в файловый шлюз");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СообщитьЕстьКлиентыБезВыгодоприобретателей(УКБезВыгодоприобретателей)
	Если НЕ ПустаяСтрока(УКБезВыгодоприобретателей) Тогда
		Сообщение = Новый СообщениеПользователю;
		ЗаголовокСообщения = "Найдены Управляющие компании без Выгодоприобретателей";
		Сообщение.Текст = ЗаголовокСообщения + ":" + УКБезВыгодоприобретателей;
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРаскрытиеВФайлПоУмолчаниюFCDRНаСервере(СообщениеВНРД,ОписаниеОшибки)
	Обр = РеквизитФормыВЗначение("Объект");
	Ошибка = Обр.ВыгрузитьВФайлПоУмолчанию(СообщениеВНРД);
	Если Ошибка<>Неопределено Тогда
		ОписаниеОшибки = Ошибка.СообщениеПользователю;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВыгрузитьВФайлПоУмолчаниюНаСервере(ОписаниеОшибки, УКБезВыгодоприобретателей)
	ОписаниеОшибки = "";
	Обр = РеквизитФормыВЗначение("Объект");
	СообщениеВНРД = Обр.ВыгрузитьРаскрытиеСписка_FCDR_17_02(ОписаниеОшибки, УКБезВыгодоприобретателей);
	Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Если НЕ ЗначениеЗаполнено(УКБезВыгодоприобретателей) Тогда
			ЗаписатьРаскрытиеВФайлПоУмолчаниюFCDRНаСервере(СообщениеВНРД, ОписаниеОшибки);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	Возврат СообщениеВНРД;
КонецФункции
&НаСервере
Функция ВыгрузитьВФайлНаСервере(ОписаниеОшибки,УКБезВыгодоприобретателей)
	ОписаниеОшибки = "";
	Обр = РеквизитФормыВЗначение("Объект");
	Возврат Обр.ВыгрузитьРаскрытиеСписка_FCDR_17_02(ОписаниеОшибки,УКБезВыгодоприобретателей);
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	ОписаниеОшибки = "";
	УКБезВыгодоприобретателей = "";
	Если ЗначениеЗаполнено(СокрЛП(ФайлРаскрытия)) Тогда
		СообщениеВФШНРД = ВыгрузитьВФайлНаСервере(ОписаниеОшибки, УКБезВыгодоприобретателей);
		СообщитьЕстьКлиентыБезВыгодоприобретателей(УКБезВыгодоприобретателей);			
		Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) И ПустаяСтрока(УКБезВыгодоприобретателей) Тогда
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.ОткрытьФайл(ФайлРаскрытия, "windows-1251");
			ЗаписьXML.ЗаписатьБезОбработки(СообщениеВФШНРД.ТекстДокумента);
			ЗаписьXML.Закрыть();
			Предупреждение("Файл сформирован");
		КонецЕсли;
	Иначе
		СообщениеВНРД = ВыгрузитьВФайлПоУмолчаниюНаСервере(ОписаниеОшибки, УКБезВыгодоприобретателей);
		СообщитьЕстьКлиентыБезВыгодоприобретателей(УКБезВыгодоприобретателей);
		Если СообщениеВНРД <> Неопределено Тогда
			Предупреждение("Файл сформирован");
		КонецЕсли;
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки;
		Сообщение.Сообщить();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ФорматИсходящегоНомера(Знач Номер, Префикс = "D") Экспорт
	Поз = Найти("0123456789-", Лев(Номер, 1));
	Пока Поз = 0 Цикл
		Номер = Сред(Номер, 2);
		Поз = Найти("0123456789-", Лев(Номер, 1));
	КонецЦикла; 
		
	Возврат Префикс + Номер;
КонецФункции // ФорматИсходящегоНомера()

&НаСервере
Процедура ЗагрузитьВходящийДокмуентНаСервере(ТекстДокумента,СообщениеОбОшибке)
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ЗагрузитьВходящийДокументИзТекста(ТекстДокумента, СообщениеОбОшибке);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВходящийДокумент(Команда)
	Если НЕ ЗначениеЗаполнено(СокрЛП(ФайлВходящегоДокумента)) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "ФайлЗапроса";
		Сообщение.Текст = "Выберите файл входящего документа";
		Сообщение.Сообщить();
		СообщениеОбОшибке = "Выберите файл";
	Иначе
		СообщениеОбОшибке = "";
		Текст = Новый ЧтениеТекста(ФайлВходящегоДокумента,"windows-1251");
		ТекстЗапроса = Текст.Прочитать();
		ЗагрузитьВходящийДокмуентНаСервере(ТекстЗапроса,СообщениеОбОшибке);
		Если СообщениеОбОшибке<>"" Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка загрузки файла "+ФайлВходящегоДокумента+Символы.ПС+СообщениеОбОшибке;
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогЗагрузкиЗапросаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файлы запроса (xml)|*.xml|Все файлы|*.*";
	
	Если Диалог.Выбрать() Тогда
		ФайлВходящегоДокумента = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФайлРаскрытияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = "Файлы раскрытия (xml)|*.xml|Все файлы|*.*";
	
	Если Диалог.Выбрать() Тогда
		ФайлРаскрытия = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры
