
Функция ДепонентыСПоручениями1_10(КД) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Депоненты.Депонент КАК Депонент,
	|	Договоры.Ссылка КАК Договор,
	|	Депоненты.РазделСчета.Владелец КАК СчетДепо,
	|	Депоненты.РазделСчета КАК РазделСчетаДепо,
	|	ВЫБОР
	|		КОГДА Депоненты.Депонент.Субброкер
	|				И Депоненты.РазделСчета.РазделСубклиента
	|			ТОГДА Депоненты.РазделСчета.Субклиент
	|		ИНАЧЕ &СубклиентПустаяСсылка
	|	КОНЕЦ КАК Выгодоприобретатель,
	|	Депоненты.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Депоненты.Количество КАК Количество
	|ПОМЕСТИТЬ втДепонентыБП
	|ИЗ
	|	БизнесПроцесс.ОбработкаWTRCСообщения.Депоненты КАК Депоненты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО (Договоры.Владелец = Депоненты.Депонент)
	|			И (НЕ Договоры.ПометкаУдаления)
	|ГДЕ
	|	Депоненты.Ссылка.КД = &КД
	|	И НЕ Депоненты.Ссылка.ПометкаУдаления
	|	И Депоненты.РазделСчета.ТипРазделаСчетаДЕПО <> &Налоговый
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Поручение.Депонент КАК Депонент,
	|	Поручение.КоличествоЦБ КАК КоличествоЦБ
	|ПОМЕСТИТЬ втПорученияНаУчастие
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.КарточкаКД = &КД
	|	И НЕ Поручение.ПометкаУдаления
	|	И ВЫРАЗИТЬ(Поручение.ВидОперацииД КАК Справочник.ВидыОпераций) = &ВидПорученияУчастиеВКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДепонентыБП.Депонент КАК Клиент,
	|	ДепонентыБП.Депонент.Субброкер КАК Субброкер,
	|	ДепонентыБП.Договор КАК Договор,
	|	ДепонентыБП.СчетДепо КАК СчетДепо,
	|	ДепонентыБП.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ДепонентыБП.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ДепонентыБП.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(ДепонентыБП.Количество) КАК Количество,
	|	ПорученияНаУчастие.КоличествоЦБ КАК КоличествоВПоручении
	|ИЗ
	|	втДепонентыБП КАК ДепонентыБП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПорученияНаУчастие КАК ПорученияНаУчастие
	|		ПО ДепонентыБП.Депонент = ПорученияНаУчастие.Депонент
	|
	|СГРУППИРОВАТЬ ПО
	|	ДепонентыБП.Депонент,
	|	ДепонентыБП.Депонент.Субброкер,
	|	ДепонентыБП.Договор,
	|	ДепонентыБП.СчетДепо,
	|	ДепонентыБП.РазделСчетаДепо,
	|	ДепонентыБП.Выгодоприобретатель,
	|	ДепонентыБП.ЦеннаяБумага,
	|	ПорученияНаУчастие.КоличествоЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Поручение.Ссылка КАК Поручение
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.КарточкаКД = &КД
	|	И НЕ Поручение.ПометкаУдаления
	|	И ВЫРАЗИТЬ(Поручение.ВидОперацииД КАК Справочник.ВидыОпераций) = &ВидПорученияУчастиеВКД");
	
	Запрос.УстановитьПараметр("Налоговый",				Перечисления.ТипыРазделовСчетовДЕПО.Налоговый);
	Запрос.УстановитьПараметр("КД",						КД);
	Запрос.УстановитьПараметр("ВидПорученияУчастиеВКД",	Справочники.ВидыОпераций.УчастиеВКД);
	Запрос.УстановитьПараметр("СубклиентПустаяСсылка", Справочники.Субклиенты.ПустаяСсылка());
	
	Результат = Запрос.ВыполнитьПакет();
	Возврат Новый Структура("Депоненты, Поручения", Результат[2].Выгрузить(), Результат[3].Выгрузить());
КонецФункции

Функция ДепонентыСПоручениями1_10TREC(КорпоративноеДействиеСсылка, МенеджерВременныхТаблиц) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗапросСубброкеруНаРаскрытие.Клиент КАК Клиент,
	|	МАКСИМУМ(ЗапросСубброкеруНаРаскрытие.ДатаВремяОтправкиЗапроса) КАК ДатаВремяОтправкиЗапроса
	|ПОМЕСТИТЬ ДатыПоследнихОтправленныхЗапросов
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.КД = &КорпоративноеДействиеСсылка
	|	И ЗапросСубброкеруНаРаскрытие.Статус В(&СтатусОтправленОтправленПовторно)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапросСубброкеруНаРаскрытие.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыПоследнихОтправленныхЗапросов.Клиент КАК Клиент,
	|	МАКСИМУМ(ЗапросСубброкеруНаРаскрытие.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ ПоследниеОтправленныеЗапросы
	|ИЗ
	|	ДатыПоследнихОтправленныхЗапросов КАК ДатыПоследнихОтправленныхЗапросов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|		ПО ДатыПоследнихОтправленныхЗапросов.Клиент = ЗапросСубброкеруНаРаскрытие.Клиент
	|			И ДатыПоследнихОтправленныхЗапросов.ДатаВремяОтправкиЗапроса = ЗапросСубброкеруНаРаскрытие.ДатаВремяОтправкиЗапроса
	|			И (ЗапросСубброкеруНаРаскрытие.КД = &КорпоративноеДействиеСсылка)
	|			И (ЗапросСубброкеруНаРаскрытие.Статус В (&СтатусОтправленОтправленПовторно))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыПоследнихОтправленныхЗапросов.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорпоративноеДействие_Новый.СчетДЕПО КАК СчетДЕПО,
	|	КорпоративноеДействие_Новый.ЦеннаяБумага1 КАК ЦеннаяБумага1,
	|	КорпоративноеДействие_Новый.ЦеннаяБумага2 КАК ЦеннаяБумага2
	|ПОМЕСТИТЬ КорпоративноеДействие
	|ИЗ
	|	Документ.КорпоративноеДействие_Новый КАК КорпоративноеДействие_Новый
	|ГДЕ
	|	КорпоративноеДействие_Новый.Ссылка = &КорпоративноеДействиеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Поручение.Депонент КАК Депонент,
	|	Поручение.КоличествоЦБ КАК КоличествоЦБ
	|ПОМЕСТИТЬ ДепонентыПорученияНаУчастие
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.КарточкаКД = &КорпоративноеДействиеСсылка
	|	И НЕ Поручение.ПометкаУдаления
	|	И ВЫРАЗИТЬ(Поручение.ВидОперацииД КАК Справочник.ВидыОпераций) = &ВидПорученияУчастиеВКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.СчетДепо.Владелец КАК Клиент,
	|	ВЫБОР
	|		КОГДА Остатки.СчетДепо.Владелец.Субброкер
	|				И Остатки.РазделСчетаДепо.РазделСубклиента
	|			ТОГДА Остатки.РазделСчетаДепо.Субклиент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Субклиенты.ПустаяСсылка)
	|	КОНЕЦ КАК Выгодоприобретатель,
	|	Остатки.СчетДепо.Владелец.Субброкер КАК Субброкер,
	|	Остатки.СчетДепо.Владелец.Наименование КАК КлиентНаименование,
	|	Остатки.СчетДепо КАК СчетДепо,
	|	Договоры.Ссылка КАК Договор,
	|	Остатки.ЦБ КАК ЦеннаяБумага,
	|	Остатки.КоличествоОстаток КАК Количество,
	|	Остатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ДепонентыПорученияНаУчастие.КоличествоЦБ КАК КоличествоВПоручении
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБМестоРасчетов.Остатки(
	|			&Дата,
	|			ЦБ В
	|					(ВЫБРАТЬ
	|						КорпоративноеДействие.ЦеннаяБумага1
	|					ИЗ
	|						КорпоративноеДействие
	|			
	|					ОБЪЕДИНИТЬ ВСЕ
	|			
	|					ВЫБРАТЬ
	|						КорпоративноеДействие.ЦеннаяБумага2
	|					ИЗ
	|						КорпоративноеДействие)
	|				И СчетДепоМХ В
	|					(ВЫБРАТЬ
	|						КорпоративноеДействие.СчетДЕПО
	|					ИЗ
	|						КорпоративноеДействие)) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО Остатки.СчетДепо.Владелец = Договоры.Владелец
	|			И (НЕ Договоры.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДепонентыПорученияНаУчастие КАК ДепонентыПорученияНаУчастие
	|		ПО Остатки.СчетДепо.Владелец = ДепонентыПорученияНаУчастие.Депонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОстатки.Клиент КАК Клиент,
	|	втОстатки.Выгодоприобретатель КАК Выгодоприобретатель,
	|	втОстатки.Субброкер КАК Субброкер,
	|	втОстатки.КлиентНаименование КАК КлиентНаименование,
	|	втОстатки.СчетДепо КАК СчетДепо,
	|	втОстатки.Договор КАК Договор,
	|	втОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	втОстатки.Количество КАК Количество,
	|	втОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ПоследниеОтправленныеЗапросы.Ссылка КАК ЗапросНаРСВ,
	|	ПоследниеОтправленныеЗапросы.Ссылка.ДатаВремяОтправкиЗапроса КАК ДатаОтправкиЗапросаНД,
	|	втОстатки.КоличествоВПоручении КАК КоличествоВПоручении
	|ИЗ
	|	втОстатки КАК втОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеОтправленныеЗапросы КАК ПоследниеОтправленныеЗапросы
	|		ПО втОстатки.Клиент = ПоследниеОтправленныеЗапросы.Клиент");
	
	ДатаОстатков = ТекущаяДатаСеанса();
	Если КорпоративноеДействиеСсылка.ДатаФиксации < ДатаОстатков Тогда 
		ДатаОстатков = КонецДня(ДатаОстатков);	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", ДатаОстатков);
	Запрос.УстановитьПараметр("КорпоративноеДействиеСсылка",						КорпоративноеДействиеСсылка);
	Запрос.УстановитьПараметр("ВидПорученияУчастиеВКД",	Справочники.ВидыОпераций.УчастиеВКД);
	СтатусОтправленОтправленПовторно = Новый Массив();
	СтатусОтправленОтправленПовторно.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Отправлен);
	СтатусОтправленОтправленПовторно.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ОтправленПовторно);
	СтатусОтправленОтправленПовторно.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ПолученОтвет);
	Запрос.УстановитьПараметр("СтатусОтправленОтправленПовторно",	СтатусОтправленОтправленПовторно);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции


Процедура ОтправитьЗапросНаРаскрытиеПоСубклиентам(ПараметрКоманды) Экспорт
	
	Для Каждого ДокументРСВ Из ПараметрКоманды Цикл
		ИспользоватьРегистрациюЗапросовСубброкера = WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкераДляДокумента(ДокументРСВ);
		ДатаРегистрацииЗапросовСубброкера = Константы.ДатаРегистрацииЗапросовСубброкера.Получить();
		Если ДокументРСВ.Дата > ДатаРегистрацииЗапросовСубброкера И ЗначениеЗаполнено(ДатаРегистрацииЗапросовСубброкера) Тогда
			Отказ = Ложь;
			Тестирование = Ложь;
			Документы.ЗапросСубброкеруНаРаскрытие.ОтправитьЗапросСубброкеруНаРаскрытие(ПараметрКоманды, Отказ, Тестирование);		
		Иначе
			МВТ = Новый МенеджерВременныхТаблиц;
			ДобавитьИсточникДляРаскрытияИзРСВ(МВТ, ДокументРСВ);
			Если ИспользоватьРегистрациюЗапросовСубброкера Тогда 
				Данные = WTRCСообщенияQI.ДанныеДляЗаполненияЗапросовНаРаскрытиеПоСубклиентам(МВТ, ДокументРСВ.ДатаФиксации);
			Иначе 
				Данные = WTRCСообщенияQI.ДанныеДляЗаполненияЗапросовНаРаскрытиеПоСубклиентам_БезДокументовЗапросов(МВТ, ДокументРСВ.ДатаФиксации);	
			КонецЕсли;
			Субброкеры = Данные.Скопировать(, "КодСубброкера");
			Субброкеры.Свернуть("КодСубброкера");
			Для Каждого Субброкер Из Субброкеры Цикл
				ДанныеПоСубброкеру = Данные.НайтиСтроки(Новый Структура("КодСубброкера", Субброкер.КодСубброкера)); 
				ФайлРасшифровки = WTRCСообщенияQI.ФайлРасшифровкиЗапросаНаРаскрытиеПоСубклиентамЦБНеСША(ДанныеПоСубброкеру, ИспользоватьРегистрациюЗапросовСубброкера);
				ФайлЗапроса = WTRCСообщенияQI.ФайлЗапросаНаРаскрытиеПоСубклиентамПриложение2_5(ДанныеПоСубброкеру);
				Успешно = РезультатОтправкиЗапросаПоЭлПочте(ДанныеПоСубброкеру[0], ФайлЗапроса, ФайлРасшифровки);
				Если Успешно Тогда
					НачатьТранзакцию();
					СоздатьДокументИсходящий(ДанныеПоСубброкеру[0]);
					РСВОбъект = ДокументРСВ.ПолучитьОбъект();
					РСВОбъект.Статус = Перечисления.СтатусыРаскрытияСписковВладельцев.ОтправленЗапросНаРаскрытиеНД;
					РСВОбъект.Записать(РежимЗаписиДокумента.Запись);
					ЗафиксироватьТранзакцию();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправитьУведомлениеОРаскрытииСпискаВладельцевЦБ(ДокументСсылка, ОбработкаВебСервисы = Неопределено) Экспорт
	Если ЗначениеЗаполнено(ДокументСсылка)
		И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РаскрытиеСпискаВладельцев") Тогда
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.ОтправитьУведомлениеОРаскрытииСпискаВладельцевЦБ(ОбработкаВебСервисы);
	КонецЕсли;
КонецПроцедуры

Процедура ПодготовитьУведомлениеОРаскрытииСпискаВладельцевЦБ(ДокументСсылка) Экспорт
	Если ЗначениеЗаполнено(ДокументСсылка)
		И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РаскрытиеСпискаВладельцев") Тогда
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.ПодготовитьУведомлениеОРаскрытииСпискаВладельцевЦБ();
	КонецЕсли;
КонецПроцедуры

//#Область ФункцииРаскрытияПоСубклиентам

Процедура ДобавитьИсточникДляРаскрытияИзРСВ(МВТ, ДокументРСВ) Экспорт
	
	РСВ = ДокументРСВ.ПолучитьОбъект();
	ДанныеСпискаВладельцев = РСВ.ДанныеСпискаВладельцев(МВТ);
	Если ДанныеСпискаВладельцев.Колонки.Найти("Выгодоприобретатель") = Неопределено Тогда
		ДанныеСпискаВладельцев.Колонки.Добавить("Выгодоприобретатель", Новый ОписаниеТипов("СправочникСсылка.Субклиенты"));
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеСпискаВладельцев.Клиент КАК Клиент,
	|	ВЫРАЗИТЬ(ДанныеСпискаВладельцев.СчетДепо КАК Справочник.СчетаДепо) КАК СчетДепо,
	|	ДанныеСпискаВладельцев.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ДанныеСпискаВладельцев.Количество КАК Количество,
	|	ДанныеСпискаВладельцев.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ДанныеСпискаВладельцев.ЦеннаяБумага КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втДанныеСпискаВладельцев
	|ИЗ
	|	&ДанныеСпискаВладельцев КАК ДанныеСпискаВладельцев
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеСпискаВладельцев.Клиент КАК Субброкер,
	|	втДанныеСпискаВладельцев.СчетДепо КАК СчетДепо,
	|	втДанныеСпискаВладельцев.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ВЫБОР
	|		КОГДА РаскрытиеСпискаВладельцев.СвязанныйРеференсКД1 <> """"
	|			ТОГДА РаскрытиеСпискаВладельцев.СвязанныйРеференсКД1
	|		ИНАЧЕ РаскрытиеСпискаВладельцев.КДРеференс
	|	КОНЕЦ КАК КДРеференс,
	|	ВЫБОР
	|		КОГДА РаскрытиеСпискаВладельцев.СвязанныйРеференсКД1 <> """"
	|			ТОГДА РаскрытиеСпискаВладельцев.СвязанныйВидКД1.Наименование
	|		ИНАЧЕ РаскрытиеСпискаВладельцев.ВидКорпоративногоДействия.Наименование
	|	КОНЕЦ КАК ТипКД,
	|	ВЫБОР
	|		КОГДА РаскрытиеСпискаВладельцев.СвязанныйРеференсКД1 <> """"
	|			ТОГДА РаскрытиеСпискаВладельцев.СвязанныйВидКД1.Код
	|		ИНАЧЕ РаскрытиеСпискаВладельцев.ВидКорпоративногоДействия.Код
	|	КОНЕЦ КАК КодТипаКД,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА РаскрытиеСпискаВладельцев.Ссылка.СвязанныйРеференсКД1 <> """"
	|					ТОГДА РаскрытиеСпискаВладельцев.Ссылка.СвязанныйВидКД1.ТипКорпоративныхДействий
	|				ИНАЧЕ РаскрытиеСпискаВладельцев.Ссылка.ВидКорпоративногоДействия.ТипКорпоративныхДействий
	|			КОНЕЦ = &Доход
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВидКДВыплатаДоходов,
	|	ВЫБОР
	|		КОГДА РаскрытиеСпискаВладельцев.СвязанныйРеференсКД1 <> """"
	|			ТОГДА РаскрытиеСпискаВладельцев.СвязанныйВидКД1.КодДохода
	|		ИНАЧЕ РаскрытиеСпискаВладельцев.ВидКорпоративногоДействия.КодДохода
	|	КОНЕЦ КАК КодДоходовНДФЛ,
	|	ИСТИНА КАК ЗаполнятьЗаявленнуюНалоговуюСтавку,
	|	РаскрытиеСпискаВладельцев.ДатаФиксации КАК ДатаФиксации,
	|	втДанныеСпискаВладельцев.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВЫРАЗИТЬ(втДанныеСпискаВладельцев.ЦеннаяБумага КАК Справочник.ЦенныеБумаги).НаименованиеВыпуска КАК НаименованиеВыпуска,
	|	втДанныеСпискаВладельцев.Выгодоприобретатель КАК Субклиент,
	|	ВЫБОР
	|		КОГДА втДанныеСпискаВладельцев.СчетДепо В (&ТипыСчетовНД)
	|			ТОГДА ""02""
	|		КОГДА втДанныеСпискаВладельцев.СчетДепо В (&ТипыСчетовИНД)
	|			ТОГДА ""20""
	|		ИНАЧЕ ""01""
	|	КОНЕЦ КАК ТипСчета,
	|	втДанныеСпискаВладельцев.Количество КАК Количество,
	|	РаскрытиеСпискаВладельцев.Дата КАК ДатаДокументаРаскрытия,
	|	РаскрытиеСпискаВладельцев.Организация КАК Организация,
	|	РаскрытиеСпискаВладельцев.Организация.Наименование КАК НаименованиеЮЛОрганизации,
	|	РаскрытиеСпискаВладельцев.ДатаОкончанияПриемаИнструкцийВТБКБ КАК ДатаОкончанияПриемаИнструкцийВТБКБ,
	|	ИСТИНА КАК ВыводитьСтрокиТаблицы,
	|	РаскрытиеСпискаВладельцев.Дата КАК ДатаДокументаЗапроса
	|ПОМЕСТИТЬ втИсточникДляРаскрытия
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДанныеСпискаВладельцев КАК втДанныеСпискаВладельцев
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВЫРАЗИТЬ(втДанныеСпискаВладельцев.Клиент КАК Справочник.Контрагенты).Субброкер
	|	И РаскрытиеСпискаВладельцев.Ссылка = &ДокументРСВ";
	Запрос.УстановитьПараметр("ДокументРСВ", ДокументРСВ);
	Запрос.УстановитьПараметр("Доход", Перечисления.ТипыКорпоративныхДействий.Доход);
	Запрос.УстановитьПараметр("ДанныеСпискаВладельцев", ДанныеСпискаВладельцев);
	Запрос.УстановитьПараметр("ТипыСчетовНД", БизнесПроцессы.ОбработкаWTRCСообщения.ТипыСчетовНД());
	Запрос.УстановитьПараметр("ТипыСчетовИНД", БизнесПроцессы.ОбработкаWTRCСообщения.ТипыСчетовИНД());
	Запрос.Выполнить();
	
КонецПроцедуры

Функция РезультатОтправкиЗапросаПоЭлПочте(ДанныеПоСубброкеру, ФайлЗапроса, ФайлРасшифровки) Экспорт 
	// Подготовка данных письма
	ТемаТекстПисьма = "Запрос на раскрытие списка владельцев ценных бумаг.";		
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ДанныеПоСубброкеру.ВнешнийИсточник).Настройка;
	
	Если НастройкиОбмена = Неопределено Тогда
		ТекстОшибки = "Не заданы параметры внешнего источника контрагента/субброкера. Подробности см. в журнале регистрации.";
		#Если Клиент Тогда
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки);
		#КонецЕсли
		ИмяСобытия = "Отправка запроса на раскрытие по субклиентам по эл.почте";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, ДанныеПоСубброкеру.Субброкер, ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
	СписокВложений = Новый Соответствие;
	СписокВложений.Вставить("Приложение 02.5. Запрос на раскрытие списка владельцев ценных бумаг.pdf", Новый ДвоичныеДанные(ФайлЗапроса));
	СписокВложений.Вставить("Раскрытие списка владельцев.xlsx", Новый ДвоичныеДанные(ФайлРасшифровки));
	// Удалить файлы из временного хранилища
	УдалитьФайлы(ФайлЗапроса);
	УдалитьФайлы(ФайлРасшифровки);
	
	// Сформируем уведомление
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("Вложения",			СписокВложений);
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаТекстПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТемаТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);				
	Возврат Истина;
КонецФункции

Процедура СоздатьДокументИсходящий(ДанныеПоСубброкеру) Экспорт 
	ДокОбъект = Документы.Исходящий.СоздатьДокумент();
	ДокОбъект.Дата = ТекущаяДата();
	ДокОбъект.НаименованиеДокументаИлиКомплекта = "Запрос на раскрытие списка владельцев ценных бумаг";
	ДокОбъект.Депонент = ДанныеПоСубброкеру.Субброкер;
	ДокОбъект.Адресат = ДанныеПоСубброкеру.ПолноеНаименованиеЮЛСубброкера;
	ДокОбъект.ЦеннаяБумага = ДанныеПоСубброкеру.ЦеннаяБумага;
	ДокОбъект.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	ДокОбъект.Комментарий = "В электронном виде";
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

//#КонецОбласти

&НаСервере
Процедура ПрисоединитьФайлКЗапросуНаРСВ(ЗапросНаРСВ, ПрисоединяемыйФайл, ИмяФайла, Расширение) Экспорт 
	
	НовыйФайл = Справочники.Файлы.СоздатьЭлемент();
	НовыйФайл.Объект = ЗапросНаРСВ;
	НовыйФайл.Ответственный = Пользователи.ТекущийПользователь();
	НовыйФайл.ДатаСоздания = ТекущаяДатаСеанса();
	НовыйФайл.ИмяФайла = ИмяФайла;
	НовыйФайл.Наименование = ИмяФайла;
	НовыйФайл.РасширениеФайла = Расширение;
	НовыйФайл.ДополнительныйПризнакФайла = Перечисления.ДополнительныеПризнакиФайлов.Прочее;
	НовыйФайл.Данные = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ПрисоединяемыйФайл));
	НовыйФайл.Записать();

КонецПроцедуры

&НаСервере
Процедура СформироватьЗапросыСубброкеруНаРаскрытие(ПараметрКоманды, СозданыеДокументы = Неопределено) Экспорт
		
	Для Каждого ДокументРСВ Из ПараметрКоманды Цикл
		ДатаРегистрацииЗапросовСубброкера = Константы.ДатаРегистрацииЗапросовСубброкера.Получить();
		Если Не (ДокументРСВ.Дата > ДатаРегистрацииЗапросовСубброкера И ЗначениеЗаполнено(ДатаРегистрацииЗапросовСубброкера)) Тогда
			Продолжить;
		КонецЕсли;
		
		ТипКД = ДокументРСВ.ВидКорпоративногоДействия.ТипКорпоративныхДействий;
		
		МВТ = Новый МенеджерВременныхТаблиц;
		Документы.РаскрытиеСпискаВладельцев.ДобавитьИсточникДляРаскрытияИзРСВ(МВТ, ДокументРСВ);
		Данные = WTRCСообщенияQI.ДанныеДляЗаполненияЗапросовНаРаскрытиеПоСубклиентам(МВТ, ДокументРСВ.ДатаФиксации);	
		ЗапросыНаРаскрытие = Данные.Скопировать(, "КодСубброкера, НД, ИНД, ЦеннаяБумага");
		ЗапросыНаРаскрытие.Свернуть("КодСубброкера, НД, ИНД, ЦеннаяБумага");
		Для Каждого Запрос Из ЗапросыНаРаскрытие Цикл
			Если Не Запрос.НД И Не Запрос.ИНД
					Или ТипКД = Перечисления.ТипыКорпоративныхДействий.Доход И Не Запрос.ИНД Тогда
				Продолжить;
			КонецЕсли;
			Отбор = Новый Структура("КодСубброкера, ЦеннаяБумага", Запрос.КодСубброкера, Запрос.ЦеннаяБумага);
			ДанныеЗапроса = Данные.НайтиСтроки(Отбор);
			ЗапросНаРаскрытие = НовыйДокументЗапросНаРСВ(ДокументРСВ, ДанныеЗапроса);
			Если ТипЗнч(СозданыеДокументы) = Тип("Массив") Тогда 
				СозданыеДокументы.Добавить(ЗапросНаРаскрытие);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НовыйДокументЗапросНаРСВ(ДокументРСВ, ДанныеЗапроса)
	ДокЗапросНаРСВ = Документы.ЗапросСубброкеруНаРаскрытие.СоздатьДокумент();
	ДокЗапросНаРСВ.Дата = ТекущаяДатаСеанса();
	ДокЗапросНаРСВ.Клиент = ДанныеЗапроса[0].Субброкер;
	ДокЗапросНаРСВ.КодLEI = ДанныеЗапроса[0].LEIКодСубброкера;
	ДокЗапросНаРСВ.СчетДЕПО = ДанныеЗапроса[0].СчетДепо;
	ДокЗапросНаРСВ.РеференсКД = ДокументРСВ.КДРеференс;
	ДокЗапросНаРСВ.ВидКД = ДокументРСВ.ВидКорпоративногоДействия;
	ДокЗапросНаРСВ.КодТипаКорпоративногоДействия = ДокументРСВ.ВидКорпоративногоДействия.Код;
	ДокЗапросНаРСВ.КД = ДокументРСВ.КарточкаКД;
	ДокЗапросНаРСВ.РеференсКДСвязанный = ДокументРСВ.СвязанныйРеференсКД1;
	ДокЗапросНаРСВ.ВидКДСвязанный = ДокументРСВ.СвязанныйВидКД1;
	ДокЗапросНаРСВ.РСВ = ДокументРСВ;
	ДокЗапросНаРСВ.ДатаСпискаЛиц = ДокументРСВ.ДатаФиксации;
	ДокЗапросНаРСВ.ПолноеНаименованиеЭмитента = ДокументРСВ.Эмитент.НаименованиеПолное;
	РеквизитыЦБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗапроса[0].ЦеннаяБумага, "ISIN,НомерРегистрации");
	ДокЗапросНаРСВ.ISIN = РеквизитыЦБ.ISIN;
	ДокЗапросНаРСВ.ГосРегНомерВыпуска = РеквизитыЦБ.НомерРегистрации;
	ДокЗапросНаРСВ.ДатаВремяОтправкиЗапроса = ДокЗапросНаРСВ.Дата;
	ДокЗапросНаРСВ.ПовторныйЗапрос = СуществуетЗапросНаРаскрытие(ДокументРСВ, ДанныеЗапроса[0].Субброкер,
		ДанныеЗапроса[0].ЦеннаяБумага);
 	ДокЗапросНаРСВ.Статус = Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Сформирован;	
	Уведомление = WTRCСообщенияQI.УведомлениеЗапросСубброкеруНаРаскрытие(ДокументРСВ.Ссылка, ДанныеЗапроса[0].ЦеннаяБумага);
	
	Если ЗначениеЗаполнено(Уведомление) Тогда 
		ДокЗапросНаРСВ.ЗаголовокСообщения = Уведомление.Тема;
		ДокЗапросНаРСВ.ТелоСообщения = Уведомление.Тело;
	КонецЕсли;
	Для Каждого Стр Из ДанныеЗапроса Цикл
		НоваяСтрока = ДокЗапросНаРСВ.ДанныеСубброкера.Добавить();
		
		Если Стр.РазделСчетаДепо.РазделСубклиента Тогда  
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		Иначе 
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр, "ISIN, LEIКодСубброкера, КодКлиента, КодНРД, Количество, РазделСчетаДепо");
		КонецЕсли;
		
		НоваяСтрока.Выгодоприобретатель = Стр.Субклиент;
		НоваяСтрока.ПолноеНаименованиеЛица = Стр.ПолноеНаименованиеЮЛФЛСубклиента;
	КонецЦикла;
	ДокЗапросНаРСВ.Записать();	
	ДокументРСВОбъект = ДокументРСВ.ПолучитьОбъект();
	ДокументРСВОбъект.ЗаполнитьСписокВладельцев();
	
	Возврат ДокЗапросНаРСВ.Ссылка;
	
КонецФункции

&НаСервере
Функция СуществуетЗапросНаРаскрытие(ДокументРСВ, Клиент, ЦеннаяБумага)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗапросСубброкеруНаРаскрытие.Ссылка
	|ИЗ
	|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|	ПО ЦенныеБумаги.Ссылка = &ЦеннаяБумага 
	|ГДЕ
	|	ЗапросСубброкеруНаРаскрытие.РСВ = &РСВ
	|	И ЗапросСубброкеруНаРаскрытие.Клиент = &Клиент
	|	И НЕ ЗапросСубброкеруНаРаскрытие.ПометкаУдаления
	|	И ЗапросСубброкеруНаРаскрытие.ISIN = ЦенныеБумаги.ISIN
	|	И ЗапросСубброкеруНаРаскрытие.ГосРегНомерВыпуска = ЦенныеБумаги.НомерРегистрации
	|";
	Запрос.УстановитьПараметр("РСВ", ДокументРСВ);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

// Процедура - Дополнить список владельцев запросами субброкера
// Дополняет список владельцев запросами субброкера в связанных с КД документах РСВ, если они не заблокированы пользователем
// 
// Параметры:
//  КорпоративноеДействиеСсылка	 - ДокументСсылка.КорпоративноеДействие_Новый
//
Процедура ДополнитьСписокВладельцевЗапросамиСубброкера(КорпоративноеДействиеСсылка) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РаскрытиеСпискаВладельцев.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев КАК РаскрытиеСпискаВладельцев
	|ГДЕ
	|	РаскрытиеСпискаВладельцев.ПометкаУдаления = ЛОЖЬ
	|	И РаскрытиеСпискаВладельцев.КарточкаКД = &КарточкаКД");
	
	Запрос.УстановитьПараметр("КарточкаКД", КорпоративноеДействиеСсылка);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	РСВОбъект = Выборка.Ссылка.ПолучитьОбъект();
	
	Попытка
		РСВОбъект.Заблокировать();
	Исключение		
		Возврат;
	КонецПопытки;
	
	РСВОбъект.ДополнитьСписокВладельцевЗапросамиСубброкера();
	РСВОбъект.Записать();
	
КонецПроцедуры

// Создает раскрытие списка владельцев по корпоративному действию, если раскрытие списка владельцев уже создано обновляет в нем список владельцев
//
// Параметры:
//  Основание - ДокументСсылка.КорпоративноеДействие_Новый	- ссылка на корпоративное действие
//
Процедура СоздатьИлиОбновитьРаскрытиеСпискаВладельцев(Основание) Экспорт 
	
	РаскрытиеСпискаВладельцевСсылка =  Документы.РаскрытиеСпискаВладельцев.НайтиПоРеквизиту("КарточкаКД",Основание);
	Если ЗначениеЗаполнено(РаскрытиеСпискаВладельцевСсылка) Тогда
		РаскрытиеСпискаВладельцевОбъект = РаскрытиеСпискаВладельцевСсылка.ПолучитьОбъект();
		РаскрытиеСпискаВладельцевОбъект.ЗаполнитьСписокВладельцев();
		Попытка
			РаскрытиеСпискаВладельцевОбъект.Записать();
		Исключение
			ИмяСобытия = "Обновление документа раскрытие списка владельцев";
			Комментарий = "Не удалось записать документ раскрытия списка владельцев, по причине: " + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.РаскрытиеСпискаВладельцев, РаскрытиеСпискаВладельцевСсылка, Комментарий);							
		КонецПопытки;	
	Иначе 
		РаскрытиеСпискаВладельцевОбъект = Документы.РаскрытиеСпискаВладельцев.СоздатьДокумент();
		РаскрытиеСпискаВладельцевОбъект.УстановитьСсылкуНового(Документы.РаскрытиеСпискаВладельцев.ПолучитьСсылку());
		РаскрытиеСпискаВладельцевОбъект.Дата = ТекущаяДатаСеанса();
		РаскрытиеСпискаВладельцевОбъект.УстановитьНовыйНомер();
		РаскрытиеСпискаВладельцевОбъект.Заполнить(Основание);
		Попытка
			РаскрытиеСпискаВладельцевОбъект.Записать();
		Исключение
			ИмяСобытия = "Создание документа раскрытие списка владельцев";
			Комментарий = "Не удалось создать документ раскрытия списка владельцев по корпоративному действию, по причине: " + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.РаскрытиеСпискаВладельцев, Основание, Комментарий);							
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает BizMsgIdr соединенный с префиксом
//
// Параметры:
//  BizMsgIdr	 - Строка - BizMsgIdr
//  Префикс		 - Строка - Префикс
// 
// Возвращаемое значение:
//  Строка - BizMsgIdr соединенный с префиксом
//
Функция BizMsgIdr_СПрефиксом(BizMsgIdr, Префикс) Экспорт
	Возврат BizMsgIdr + "-" + Префикс;
КонецФункции

// Функция удаляет суффиксы HL/ML/TL из переданного референса КД
//
// Параметры:
//  КДРеференс	 - Строка - референс КД
// 
// Возвращаемое значение:
//  Строка - референс КД без суффикса
//
Функция КДРеференсБезСуффикса(КДРеференс) Экспорт
	ЗначениеРеференса = СтрЗаменить(КДРеференс, "HL", "");
	ЗначениеРеференса = СтрЗаменить(ЗначениеРеференса, "ML", "");
	ЗначениеРеференса = СтрЗаменить(ЗначениеРеференса, "TL", "");
	Возврат СокрЛП(ЗначениеРеференса);
КонецФункции

// Функция возвращает данные с контактами переданного юрлица клиента
//
// Параметры:
//  Клиент		 - СправочникСсылка.Контрагенты - клиент
//  ЮрФизЛицо	 - СправочникСсылка.ЮридическиеЛица - юрлицо клиента
//  ТипЛица		 - Перечисления.ЮрФизЛицо - тип лица (ФизЛицо/ЮрЛицо)
// 
// Возвращаемое значение:
//  Структура:
//        * АдресНеРФ - Булево
//        * Страна - СправочникСсылка.КлассификаторСтранМира
//        * Индекс - Строка
//        * ПредставлениеАдреса - Строка
//
Функция Контакты(Клиент, ЮрФизЛицо, ТипЛица) Экспорт
	Контакты = Новый Структура("АдресНеРФ, Страна, Индекс");
	Контакты.Вставить("ПредставлениеАдреса", "");
	
	ВидКИ = ?(ТипЛица = Перечисления.ЮрФизЛицо.ФизЛицо, Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица,
				Справочники.ВидыКонтактнойИнформации.ФактАдресЮрЛица);
	КонтактыЮрФизЛица = РегистрыСведений.КонтактнаяИнформация.СрезПоследних(,
		Новый Структура("Вид, Тип, Объект", ВидКИ, Перечисления.ТипыКонтактнойИнформации.Адрес, ЮрФизЛицо));
		
	ВидКИ = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	КонтактыКлиента = РегистрыСведений.КонтактнаяИнформация.СрезПоследних(,
		Новый Структура("Вид, Тип, Объект", ВидКИ, Перечисления.ТипыКонтактнойИнформации.Адрес, Клиент));
		
	МассивКИ = Новый Массив;
	МассивКИ.Добавить(КонтактыЮрФизЛица);
	МассивКИ.Добавить(КонтактыКлиента);
	
	Для Каждого КИ Из МассивКИ Цикл
		Если КИ.Количество() > 0 Тогда
			Контакты.ПредставлениеАдреса = СокрЛП(КИ[0].Представление);
			Контакты.АдресНеРФ = Не КИ[0].ЭтоРоссийскийАдрес;
			Если Контакты.АдресНеРФ Тогда
				Контакты.Страна	= Справочники.КлассификаторСтранМира.НайтиПоНаименованию(КИ[0].Поле1, Истина);
			Иначе	
				Контакты.Индекс	= СокрЛП(КИ[0].Поле1);
				Контакты.Страна	= Справочники.КлассификаторСтранМира.РОССИЯ;
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Контакты.ПредставлениеАдреса) Тогда
		РеквизитыКлиента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Клиент, "Код, Наименование");
		ТекстОшибки = СтрШаблон("Заполните адрес депонента %1 - %2. Выгрузка РСВ невозможна",
			СокрЛП(РеквизитыКлиента.Код), РеквизитыКлиента.Наименование);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат Контакты;
КонецФункции

// Функция разбивает строку адреса на строки не более 70 символов
// и возвращает их в виде массива строк
//
// Параметры:
//  Адрес	 - Строка - Исходная строка адреса
// 
// Возвращаемое значение:
//  Массив - массив строк адреса
//
Функция РазделенныйАдрес(Адрес) Экспорт
	
	РазделенныйАдресФиксированный = Новый Массив;
	РазделенныйАдрес = Новый Массив;
	РазделеннаяСтрокаАдреса = "";
	ДопустимаяДлинаСтроки = 70;
	
	СтрокиАдреса = СтрРазделить(Адрес, ",");
	Для Каждого СтрокаАдреса Из СтрокиАдреса Цикл
		ДлинаСтрокиДляВыгрузки = СтрДлина(РазделеннаяСтрокаАдреса) + СтрДлина(СтрокаАдреса) + 1;
		Если ДлинаСтрокиДляВыгрузки <= ДопустимаяДлинаСтроки Тогда
			РазделеннаяСтрокаАдреса = ?(ЗначениеЗаполнено(РазделеннаяСтрокаАдреса), РазделеннаяСтрокаАдреса + "," + СтрокаАдреса, СтрокаАдреса);
		Иначе
			ДлинаСтрокиДляВыгрузки = СтрДлина(РазделеннаяСтрокаАдреса);
			РазделеннаяСтрокаАдреса = ?(ДлинаСтрокиДляВыгрузки < ДопустимаяДлинаСтроки, РазделеннаяСтрокаАдреса + ",", РазделеннаяСтрокаАдреса);
			РазделенныйАдрес.Добавить(РазделеннаяСтрокаАдреса);
			
			СтрокаАдреса = ?(ДлинаСтрокиДляВыгрузки < ДопустимаяДлинаСтроки, СтрокаАдреса, "," + СтрокаАдреса);
			РазделеннаяСтрокаАдреса = СтрокаАдреса;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(РазделеннаяСтрокаАдреса) Тогда
		РазделенныйАдрес.Добавить(РазделеннаяСтрокаАдреса);
	КонецЕсли;
	
	МаксимальноеКоличествоАдресов = 5;
	ТекущееКоличествоАдресов = РазделенныйАдрес.Количество();
	КоличествоАдресов = ?(ТекущееКоличествоАдресов > МаксимальноеКоличествоАдресов, МаксимальноеКоличествоАдресов, ТекущееКоличествоАдресов); 
	Для Индекс = 0 По КоличествоАдресов - 1 Цикл
		РазделенныйАдресФиксированный.Добавить(РазделенныйАдрес.Получить(Индекс));
	КонецЦикла;
	
	Возврат РазделенныйАдресФиксированный;
	
КонецФункции

// Функция возвращает данные по документу физлица
//
// Параметры:
//  ФизЛицо		 - СправочникСсылка.ФизическиеЛица - физлицо
//  ДатаЗапроса	 - Дата - дата, на которую необходимо получить данные
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - данные по документу физлица
//
Функция ПолучитьДанныеПоДокументуФизЛица(ФизЛицо, ДатаЗапроса) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПДФЛ.ДокументВид КАК ДокументВид,
	|	ПДФЛ.ДокументСерия КАК ДокументСерия,
	|	ПДФЛ.ДокументНомер КАК ДокументНомер,
	|	ПДФЛ.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	|	ПДФЛ.ДокументКемВыдан КАК ДокументКемВыдан,
	|	ПДФЛ.ДокументКодПодразделения КАК ДокументКодПодразделения,
	|	ПДФЛ.ДокументВид.КодНРД КАК ДокументВидКодНРД
	|ИЗ
	|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаЗапроса, ФизЛицо = &ФизЛицо) КАК ПДФЛ");
	
	Запрос.УстановитьПараметр("ДатаЗапроса"	, ДатаЗапроса);
	Запрос.УстановитьПараметр("ФизЛицо"		, ФизЛицо);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка;
	КонецЕсли;
	
КонецФункции

// Процедура делает запись в РС ЭтапыКД по документам РСВ и КД
// Записи с одинаковыми КД+ДокументКД необходимо делать со сдвигом периода на СдвигПоВремениСек
//
// Параметры:
//  ДокументСсылка		 - ДокументСсылка.РаскрытиеСпискаВладельцев - ссылка на документ РСВ
//  BizMsgIdr			 - Строка - BizMsgIdr
//  СдвигПоВремениСек	 - Число - количество секунд для сдвига даты для периода
//
Процедура ЗарегистрироватьЭтапКД(ДокументСсылка, BizMsgIdr, СдвигПоВремениСек = 0) Экспорт
	
	Если ДокументСсылка.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.ISO20022
		И Не ЗначениеЗаполнено(ДокументСсылка.КарточкаКД) Тогда
		Возврат; // "Карточка КД" пишется в измерение КД только для вида загрузки ISO
	КонецЕсли;
	
	Этап 			= Справочники.ЭтапыКД.ИнструкцияДляУчастияВСобрании;
	ТипУведомления 	= "NEWM";
	
	ТипУведомления = Справочники.ТипыУведомления.НайтиПоКоду(ТипУведомления);
	Если Этап.Пустая() Тогда
		ЗаписьЖурналаРегистрации("Выгрузка 'Раскрытия списка владельцев'",
					УровеньЖурналаРегистрации.Ошибка, , ДокументСсылка,
					"Не найден тип уведомления " + ТипУведомления + ". Этап КД не выполнен");
		Возврат;
	КонецЕсли;
	
	ЗаписьЭтапаКД = РегистрыСведений.ЭтапыКД.СоздатьМенеджерЗаписи();
	Если ДокументСсылка.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.ISO20022 Тогда
		ЗаписьЭтапаКД.КД = ДокументСсылка.КарточкаКД;
	ИначеЕсли ДокументСсылка.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.PARTAD Тогда
		ЗаписьЭтапаКД.КД = ДокументСсылка;
	Иначе
		Возврат;
	КонецЕсли;
	ЗаписьЭтапаКД.ДокументКД 		= ДокументСсылка;
	ЗаписьЭтапаКД.Активность 		= Истина;
	ЗаписьЭтапаКД.Период 			= ДокументСсылка.Дата + СдвигПоВремениСек;
	ЗаписьЭтапаКД.ЭтапКД 			= Этап;
	ЗаписьЭтапаКД.КодОтчета 		= Этап.Код;
	ЗаписьЭтапаКД.НомерСообщения 	= BizMsgIdr;
	ЗаписьЭтапаКД.ТипУведомления	= ТипУведомления;
	ЗаписьЭтапаКД.Исходящее			= Истина;
	ЗаписьЭтапаКД.Записать();
	
	// Изменить статус документа раскрытия
	Если ДокументСсылка.Статус <> Перечисления.СтатусыРаскрытияСписковВладельцев.Выгружено Тогда
		мОбъект = ДокументСсылка.ПолучитьОбъект();
		мОбъект.Статус = Перечисления.СтатусыРаскрытияСписковВладельцев.Выгружено;
		мОбъект.Записать();
	КонецЕсли;

КонецПроцедуры

// Функция возвращает запрос для получения списка кодов загрузки ЦБ
//
// Параметры:
//  Дата	 - Дата - Текущая дата
// 
// Возвращаемое значение:
//  Запрос - объект запроса
//
Функция ЗапросДляСпискаКодовЗагрузкиЦБ(Дата) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КодыЗагрузки.Код КАК Код
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	НЕ КодыЗагрузки.ПометкаУдаления
	|	И КодыЗагрузки.Владелец = &Владелец
	|	И КодыЗагрузки.Биржа = &Биржа
	|	И ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(КодыЗагрузки.ДатаОкончанияДействия, ДЕНЬ) = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА НАЧАЛОПЕРИОДА(КодыЗагрузки.ДатаОкончанияДействия, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ");

	Запрос.УстановитьПараметр("Биржа"	, Справочники.КлассификаторыЗагрузки.НДЦ());
	Запрос.УстановитьПараметр("Дата"	, Дата);
	Возврат Запрос;
КонецФункции

// Функция возвращает визуализацию раскрытия в виде текста html для формата раскрытия ISO 20022
//
// Параметры:
//  СтрокаДанных	 - Строка - текст xml с данными для визуализации
// 
// Возвращаемое значение:
//  Строка - визуализация раскрытия в виде текста html
//
Функция ВизуализацияHTML_ISO(СтрокаДанных) Экспорт
	Макет = ПолучитьМакет("ПреобразованиеXSL_ISO20022").ПолучитьТекст();
	Преобразование = Новый ПреобразованиеXSL;
	Преобразование.ЗагрузитьИзСтроки(Макет);
	Возврат Преобразование.ПреобразоватьИзСтроки(СтрокаДанных);
КонецФункции

// Возвращает признак того, что инициатор РСВ работает через транзитные W-пакеты
//
// Параметры:
//  ДокументРСВ	 - ДокументСсылка.РаскрытиеСпискаВладельцев	 - ссылка на документ раскрытия
// 
// Возвращаемое значение:
//   - Булево - Истина, если отправлять транзитный W-пакет
//
Функция ЭтоТранзитЧерезСЭДНРД(ДокументРСВ) Экспорт
	
	Если ТипЗнч(ДокументРСВ) <> Тип("ДокументСсылка.РаскрытиеСпискаВладельцев") Тогда
		Возврат Ложь;
	КонецЕсли;
	ИнициаторРСВ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРСВ, "Инициатор");
	Если ТипЗнч(ИнициаторРСВ) = Тип("СправочникСсылка.МестаХранения") Тогда
		ИнициаторТранзитЧерезСЭДНРД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИнициаторРСВ, "ТранзитЧерезСЭДНРД");
		Возврат ИнициаторТранзитЧерезСЭДНРД;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Возвращает структуру с значениями параметров макет-шаблона ИсходящийШаблонТранзитWINF
//
// Параметры:
//  ДокументРСВ			 - ДокументСсылка.РаскрытиеСпискаВладельцев	 - Ссылка на документ раскрытия
//  ТехническаяОперация	 - ДокументСсылка.ТехническаяОперация		 - Ссылка на техническую операцию
//  ИмяКаталога			 - Строка									 - Имя каталога
//  ИмяФайлаXML			 - Строка									 - Имя основного файла (без расширения)
// 
// Возвращаемое значение:
//   - Структура - формирует и заполняет структуру [ORIGINATOR][RECIPIENT][GUID][DATE][TIME][DOC][NAME][FILE]
//
Функция ПараметрыТранзитаWINF(ДокументРСВ, ТехническаяОперация, ИмяКаталога, ИмяФайлаXML)
	
	ПараметрыТранзита = Новый Структура;
	КлассификаторНРД = Справочники.КлассификаторыЗагрузки.НДЦ();
	РеквизитыРСВ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРСВ, "Организация,ДатаФиксации,Инициатор,Номер");
	ORIGINATOR = Справочники.Организации.КодЗагрузки(РеквизитыРСВ.Организация, КлассификаторНРД, РеквизитыРСВ.ДатаФиксации);
	ПараметрыТранзита.Вставить("ORIGINATOR", СокрЛП(ORIGINATOR));
	RECIPIENT = Справочники.КодыЗагрузки.НайтиПоВладельцуИБирже(РеквизитыРСВ.Инициатор, КлассификаторНРД);
	ПараметрыТранзита.Вставить("RECIPIENT", СокрЛП(RECIPIENT));
	GUID = XMLСтрока(ТехническаяОперация);
	ПараметрыТранзита.Вставить("GUID", GUID);
	DATE = Формат(ТехническаяОперация.Дата, "ДФ=dd.MM.yyyy");
	ПараметрыТранзита.Вставить("DATE", DATE);
	TIME = Формат(ТехническаяОперация.Дата, "ДФ=HH:mm:ss");
	ПараметрыТранзита.Вставить("TIME", TIME);
	DOC = СтрЗаменить(ОбщегоНазначенияКлиентСервер.Транслит(СокрЛП(РеквизитыРСВ.Номер)), "-", "");
	ПараметрыТранзита.Вставить("DOC", DOC);
	NAME = ИмяФайлаXML;
	ПараметрыТранзита.Вставить("NAME", NAME);
	FILE = ИмяФайлаXML + ".xml";
	ПараметрыТранзита.Вставить("FILE", FILE);
	
	Возврат ПараметрыТранзита;
	
КонецФункции

// Возвращает тело файла транзита WINF
//
// Параметры:
//  ДокументРСВ			 - ДокументСсылка.РаскрытиеСпискаВладельцев	 - Ссылка на документ раскрытия
//  ТехническаяОперация	 - ДокументСсылка.ТехническаяОперация		 - Ссылка на техническую операцию
//  ИмяКаталога			 - Строка									 - Имя каталога
//  ИмяФайлаXML			 - Строка									 - Имя основного файла
// 
// Возвращаемое значение:
//   - Строка - текст файла
//
Функция ТекстСообщенияТранзитаWINF(ДокументРСВ, ТехническаяОперация, ИмяКаталога, ИмяФайлаXML) Экспорт
	
	СтруктураПараметров = ПараметрыТранзитаWINF(ДокументРСВ, ТехническаяОперация, ИмяКаталога, ИмяФайлаXML);
	ТекстСообщения = ПолучитьМакет("ИсходящийШаблонТранзитWINF").ПолучитьТекст();
	Для Каждого Элемент Из СтруктураПараметров Цикл
		КлючПоиска = "[" + Элемент.Ключ + "]";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, КлючПоиска, Элемент.Значение);
	КонецЦикла;
	
	Возврат ТекстСообщения;
	
КонецФункции


