
//#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("УстановитьВидимостьПриИзмененииКомментарийДействия", 1, Ложь);
	ПодключитьОбработчикОжидания("СформироватьЗаголовок", 1, Ложь);
	ПодключитьОбработчикОжидания("УстановитьМаксимальноеЗначение", 1, Ложь);

	Если МаксимальноеЗначение <> 0 Тогда
		Элементы.Значение.МаксимальноеЗначение = МаксимальноеЗначение;
	КонецЕсли;
	
	СформироватьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	Если МаксимальноеЗначение <> 0 Тогда
		Элементы.Значение.МаксимальноеЗначение = МаксимальноеЗначение;
	КонецЕсли;
	
	СформироватьЗаголовок();

КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьМаксимальноеЗначение() Экспорт
	
	Если МаксимальноеЗначение <> 0 Тогда
		Элементы.Значение.МаксимальноеЗначение = МаксимальноеЗначение;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовок() Экспорт
	
	Заголовок = НаименованиеОбработкиДанных;
	
КонецПроцедуры

&НаКлиенте         
Процедура УстановитьВидимостьПриИзмененииКомментарийДействия() Экспорт 
	
	Элементы.КомментарийДействия.Видимость = НЕ ПустаяСтрока(СокрЛП(КомментарийОбработкиДанных));
	
КонецПроцедуры

//#КонецОбласти

