////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС

Процедура ИнициироватьСоединение(Параметры = Неопределено) Экспорт
КонецПроцедуры

// BSLLS:LatinAndCyrillicSymbolInWord-off

Функция ВременныеФайлыНРД(ПутьККаталогу) Экспорт
	Файлы = Новый Массив;
	Каталог = ПутьККаталогу + "\inbox";
	КаталогНазначения = КаталогВременныхФайлов();	// Извлечь xml-файлы во временный каталог пользователя
	
	ФайлВходящие = Новый Файл(Каталог);
	Если Не ФайлВходящие.Существует() Тогда
		СоздатьКаталог(Каталог);
	КонецЕсли;
	
	// Найти все каталоги с именем, начинающимся на "Q"
	КаталогиQ = НайтиФайлы(Каталог, "Q*");
	Для Каждого КаталогQ Из КаталогиQ Цикл
		Если Не КаталогQ.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		// Найти zip-файл
		ПолноеИмяФайлаZIP = НайтиZIPФайл(КаталогQ);
		Если ЗначениеЗаполнено(ПолноеИмяФайлаZIP) Тогда
			ИмяФайлаXML = ИмяФайлаКаталога(ПолноеИмяФайлаZIP, КаталогНазначения);
			
			ВременныйФайл = Новый Файл(КаталогНазначения + ИмяФайлаXML);
			Если ИмяФайлаXML = "" Или Не ВременныйФайл.Существует() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В архиве " + ПолноеИмяФайлаZIP
				+ " нет xml-файлов или не удалось извлечь xml-файл из архива в папку " + КаталогНазначения + ИмяФайлаXML);
				Продолжить;
			КонецЕсли;
			
			НовоеИмяФайлаXML = ПолучитьИмяВременногоФайла("xml");
			ПереместитьФайл(КаталогНазначения + ИмяФайлаXML, НовоеИмяФайлаXML);
			
			ОписаниеФайла = Новый Структура("ИмяВременногоФайлаXML, ИсходноеИмяФайла, Каталог", НовоеИмяФайлаXML, ПолноеИмяФайлаZIP, КаталогQ);
			Файлы.Добавить(ОписаниеФайла);
		КонецЕсли;
	КонецЦикла;
	
	КаталогиW = НайтиФайлы(Каталог, "W*");
	КаталогиКвитанцийКУдалению = Новый Массив;
	ПрочитатьКаталогиW(КаталогиW, Файлы, КаталогиКвитанцийКУдалению);
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Файлы", Файлы);
	СтруктураВозврата.Вставить("КаталогиКвитанцийКУдалению", КаталогиКвитанцийКУдалению);
	
	Возврат СтруктураВозврата;
КонецФункции

Функция ИмяФайлаКаталога(ПолноеИмяФайлаZIP, КаталогНазначения)
	
	ИмяФайлаXML = "";
	ЧтениеФайлаZip = Новый ЧтениеZipФайла(ПолноеИмяФайлаZIP);
	Для Каждого ЭлементФайлаZip Из ЧтениеФайлаZip Цикл
		Если ЭлементФайлаZip.Расширение = "xml" Тогда
			Попытка
				ЧтениеФайлаZip.Извлечь(ЭлементФайлаZip, КаталогНазначения,
					РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
			Исключение
				ИмяСобытия	= "Чтение 'Q - файлов'";
				ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				УровеньОшибки = УровеньЖурналаРегистрации.Предупреждение;
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньОшибки, Метаданные(), , ТекстОшибки);
			КонецПопытки;
			ИмяФайлаXML = ЭлементФайлаZip.Имя;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИмяФайлаXML;
	
КонецФункции

Процедура ПрочитатьКаталогиW(КаталогиW, Файлы, КаталогиКвитанцийКУдалению)
	
	Для Каждого КаталогW Из КаталогиW Цикл
		Если Не КаталогW.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		ФайлWinf = Новый Файл(КаталогW.ПолноеИмя + "\winf.xml");
		Если ФайлWinf.Существует() Тогда
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.ОткрытьФайл(ФайлWinf.ПолноеИмя);
			ЧтениеXML.ПерейтиКСодержимому();
			Если Не ЧтениеXML.ЛокальноеИмя = "COVERING_LETTER" Тогда
				ЧтениеXML.Закрыть();
				Продолжить;
			КонецЕсли;
			КлючевыеОперации = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
			КлючевыеОперацииСвойства = КлючевыеОперации.Свойства();
			ПакетНеТестовый = КлючевыеОперацииСвойства.Получить("PROCESSING_MODE") <> Неопределено
				И КлючевыеОперации.PROCESSING_MODE = "LIVE";
			ПакетТранзитный = КлючевыеОперацииСвойства.Получить("TRANSIT") <> Неопределено
				И КлючевыеОперации.TRANSIT = "YES";
			ОбработатьКлючевыеОперацииИСвойства(КлючевыеОперацииСвойства, КлючевыеОперации, КаталогW, ПакетНеТестовый, ПакетТранзитный,
				Файлы, КаталогиКвитанцийКУдалению);
			ЧтениеXML.Закрыть();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьКлючевыеОперацииИСвойства(КлючевыеОперацииСвойства, КлючевыеОперации, КаталогW, ПакетНеТестовый, ПакетТранзитный,
	Файлы, КаталогиКвитанцийКУдалению)
	
	ЭтоКвитанция = Ложь;
	ЭтоВходящийПакет = Ложь;
	ВалидныйПакет = ПакетКОбработке(КлючевыеОперацииСвойства, КлючевыеОперации, ПакетНеТестовый, ПакетТранзитный,
		ЭтоКвитанция, ЭтоВходящийПакет);
	Если Не ВалидныйПакет Тогда
		Возврат;
	КонецЕсли;
	
	СтатусКвитанции = "";
	ДоставленоУспешно = Неопределено;
	Если ЭтоКвитанция Тогда
		СтатусКвитанции = СтатусКвитанции(СтатусКвитанции, КлючевыеОперации.SERVICE_MARKS, ДоставленоУспешно);
	КонецЕсли;
	ПринудительноАрхивироватьКаталог = Ложь;
	ИмяРегистратора = "";
	ПринудительноАрхивироватьКаталог = Ложь;
	Если КлючевыеОперацииСвойства.Получить("DOC") <> Неопределено Тогда
		Если ТипЗнч(КлючевыеОперации.DOC) = Тип("ОбъектXDTO") Тогда
			КлючевыеОперацииDOC = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КлючевыеОперации.DOC);
		Иначе
			КлючевыеОперацииDOC = КлючевыеОперации.DOC;
		КонецЕсли;
		Для Каждого ВложениеDoc Из КлючевыеОперацииDOC Цикл
			Если ЭтоКвитанция Тогда
				СтатусКвитанции = СтатусКвитанции(СтатусКвитанции, ВложениеDoc);
			Иначе
				ОбработатьВложениеDoc(ВложениеDoc, Файлы, КаталогW, ПакетНеТестовый, ПакетТранзитный,
					ПринудительноАрхивироватьКаталог, ИмяРегистратора);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ЭтоКвитанция Тогда
		ОбработатьКвитанцию(СтатусКвитанции, КлючевыеОперации.SERVICE_MARKS, КлючевыеОперации.STATE, ДоставленоУспешно);
	КонецЕсли;
	Если ЭтоКвитанция Или ПринудительноАрхивироватьКаталог Тогда
		ИнформацияДляАрхивации = Новый Структура;
		ИнформацияДляАрхивации.Вставить("КаталогW", КаталогW);
		ИнформацияДляАрхивации.Вставить("ИмяРегистратора", ИмяРегистратора);
		КаталогиКвитанцийКУдалению.Добавить(ИнформацияДляАрхивации);
	КонецЕсли;
	
КонецПроцедуры

Функция ПакетКОбработке(КлючевыеОперацииСвойства, КлючевыеОперации, ПакетНеТестовый, ПакетТранзитный,
	ЭтоКвитанция, ЭтоВходящийПакет)
	
	ЭтоКвитанция = ПакетНеТестовый И ПакетТранзитный И КлючевыеОперацииСвойства.Получить("SERVICE_MARKS") <> Неопределено
		И КлючевыеОперацииСвойства.Получить("STATE") <> Неопределено
		И (КлючевыеОперации.STATE = "NDC_TO_ORIG" Или КлючевыеОперации.STATE = "RECIP_TO_NDC");
	ЭтоВходящийПакет = ПакетНеТестовый И ПакетТранзитный И КлючевыеОперацииСвойства.Получить("SERVICE_MARKS") <> Неопределено
		И КлючевыеОперацииСвойства.Получить("STATE") <> Неопределено
		И КлючевыеОперации.STATE = "NDC_TO_RECIP";
	
	ВалидныйПакет = ЭтоКвитанция Или ЭтоВходящийПакет;
	Возврат ВалидныйПакет;
	
КонецФункции

Функция СтатусКвитанции(ТекущийСтатус, ТегСтатуса, ДоставленоУспешно = Неопределено)
	
	Статус = "";
	СтатусNDC = "";
	Если ТегСтатуса.Свойства().Получить("NDC_CHECKING") <> Неопределено Тогда
		ТегСтатусNDC = ТегСтатуса.NDC_CHECKING;
		Если ТегСтатусNDC.Свойства().Получить("CHECKING") <> Неопределено Тогда
			СтатусNDC = ТегСтатусNDC.CHECKING.RESULT;
			Если СтатусNDC = "ERROR" Тогда
				Статус = ОписаниеОшибкиСтатусаКвитанции(Статус, ТегСтатусNDC.CHECKING, "NDC");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	СтатусRECIPIENT = "";
	Если ТегСтатуса.Свойства().Получить("RECIPIENT_CHECKING") <> Неопределено Тогда
		ТегСтатусRECIPIENT = ТегСтатуса.RECIPIENT_CHECKING;
		Если ТегСтатусRECIPIENT.Свойства().Получить("CHECKING") <> Неопределено Тогда
			СтатусRECIPIENT = ТегСтатусRECIPIENT.CHECKING.RESULT;
			Если СтатусRECIPIENT = "ERROR" Тогда
				Статус = ОписаниеОшибкиСтатусаКвитанции(Статус, ТегСтатусRECIPIENT.CHECKING, "RECIPIENT");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Статус = ТекущийСтатус + ?(ЗначениеЗаполнено(ТекущийСтатус) И ЗначениеЗаполнено(Статус), "; ", "") + Статус;
	
	ДоставленоУспешно = (СтатусNDC = "SUCCESS" И СтатусRECIPIENT = "SUCCESS");
	
	Возврат Статус;
	
КонецФункции

Функция ОписаниеОшибкиСтатусаКвитанции(Статус, ТегСтатуса, ИсточникОшибки)
	
	ОписаниеОшибки = "";
	Если ТегСтатуса.Свойства().Получить("CAPTION") <> Неопределено Тогда
		ОписаниеОшибки = "[" + ИсточникОшибки + "]:" + ТегСтатуса.CAPTION;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОписаниеОшибки = "Неопределенная ошибка пакета";
	КонецЕсли;
	
	Возврат ?(ЗначениеЗаполнено(Статус), "; " + ОписаниеОшибки, ОписаниеОшибки);
	
КонецФункции

Процедура ОбработатьКвитанцию(Знач СтатусКвитанции, SERVICE_MARKS, STATE, ДоставленоУспешно)
	
	ГУИД = SERVICE_MARKS.LETTER_ID;
	ДокументСсылка = Документы.ТехническаяОперация.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	ТекстЗапросаПроверкиСуществованияСсылки =
	"ВЫБРАТЬ ПЕРВЫЕ 1 
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.ДокументОснование КАК ДокументОснование
	|ИЗ Документ.ТехническаяОперация КАК Документ
	|ГДЕ
	|	Документ.Ссылка = &ДокументСсылка";
	Запрос = Новый Запрос(ТекстЗапросаПроверкиСуществованияСсылки);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ТехническаяОперация = ДокументСсылка;
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДокументОснование = Выборка.ДокументОснование;
	Иначе
		ТехническаяОперация = Неопределено;
		ДокументОснование = Неопределено;
		ОписаниеОшибки = "Не найдена техническая операция по GUID: ГУИД";
		СтатусКвитанции = ?(ЗначениеЗаполнено(СтатусКвитанции), "; " + ОписаниеОшибки, ОписаниеОшибки);
	КонецЕсли;
	СтатусКвитанцииВДокументы(СтатусКвитанции, ТехническаяОперация, ГУИД, STATE);
		
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Выписка") Тогда
		// ДоставленоУспешно может иметь значение Неопределено или Булево
		Если СтатусКвитанции = "" И ДоставленоУспешно = Истина Тогда
			СтатусДоставлено = Перечисления.СтатусыДокументовФайловыйШлюз.ПринятоКИсполнению;
			РегистрыСведений.СостоянияДокументовВФайловомШлюзе.ДобавитьЗапись(ТекущаяДатаСеанса(), ТехническаяОперация, СтатусДоставлено);
		КонецЕсли;
		Если СтатусКвитанции <> "" Тогда
			СтатусОшибка = Перечисления.СтатусыДокументовФайловыйШлюз.НеПринятоКИсполнению;
			РегистрыСведений.СостоянияДокументовВФайловомШлюзе.ДобавитьЗапись(ТекущаяДатаСеанса(), ТехническаяОперация, СтатусОшибка);
			Документы.ТехническаяОперация.ОтправитьУведомлениеОбОшибкеДоставкиВыписки(ТехническаяОперация, СтатусКвитанции);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СтатусКвитанцииВДокументы(Знач СтатусКвитанции, ТехническаяОперация, ГУИД, STATE)
	
	Если ТехническаяОперация <> Неопределено Тогда
		ТегНачала = " {*";
		ТегКонца = "*}";
		Комментарий = ТехническаяОперация.Комментарий;
		Начало = СтрНайти(Комментарий, ТегНачала);
		Конец = СтрНайти(Комментарий, ТегКонца);
		Если Начало > 0 И Конец > 0 Тогда
			Комментарий = Лев(Комментарий, Начало - 1) + Сред(Комментарий, Конец + СтрДлина(ТегКонца));
		КонецЕсли;
		Если СтатусКвитанции = "" Тогда
			ИнформацияВКомментарий = STATE + ":УСПЕШНО ДОСТАВЛЕНО";
		Иначе
			ИнформацияВКомментарий = STATE + ":ОШИБКА ДОСТАВКИ " + СтатусКвитанции;
		КонецЕсли;
		ИнформацияВКомментарий = ТегНачала + ИнформацияВКомментарий + ТегКонца;
		Комментарий = Комментарий + ИнформацияВКомментарий;
		ТехническаяОперацияОбъект = ТехническаяОперация.ПолучитьОбъект();
		ТехническаяОперацияОбъект.Комментарий = Комментарий;
		ТехническаяОперацияОбъект.Записать();
		Если СтатусКвитанции <> "" Тогда
			РСВОбъект = ТехническаяОперация.ДокументОснование.ПолучитьОбъект();
			РСВОбъект.Статус = Перечисления.СтатусыРаскрытияСписковВладельцев.Ошибка;
			РСВОбъект.Записать();
		КонецЕсли;
	Иначе
		ИмяСобытия	= "Загрузка 'Корпоративных действий'";
		Сообщение	= Новый СообщениеПользователю();
		ТекстСообщения = "Не удалось найти техническую операцию по GUID: " + ГУИД;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, Метаданные(), ГУИД, ТекстСообщения);
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьВложениеDoc(ВложениеDoc, Файлы, КаталогW, ПакетНеТестовый, ПакетТранзитный,
								ПринудительноАрхивироватьКаталог, ИмяРегистратора)
	
	ДокументСвойства = ВложениеDoc.Свойства();
	ДокументТипизирован = ДокументСвойства.Получить("DOC_TYPE") <> Неопределено
		И ВложениеDoc.DOC_TYPE = "TRZT_PRM";
	ДокументЯвляетсяРаскрытием = ДокументСвойства.Получить("IDENT_CODE") <> Неопределено
		И (ВложениеDoc.IDENT_CODE = "5RESTR59" Или ВложениеDoc.IDENT_CODE = "5RESTR60");
	ДокументЯвляетсяВыпиской = ДокументСвойства.Получить("IDENT_CODE") <> Неопределено И ВложениеDoc.IDENT_CODE = "5RESTR03";
	ПакетВалиден = ПакетНеТестовый И ПакетТранзитный И ДокументТипизирован
		И (ДокументЯвляетсяРаскрытием Или ДокументЯвляетсяВыпиской);
	
	Если ПакетВалиден Тогда
		ИмяФайлаXML = ВложениеDoc.ORIGINAL_FILE_NAME;
		ФайлXML = Новый Файл(КаталогW.ПолноеИмя + "\" + ИмяФайлаXML);
		Если ИмяФайлаXML = "" ИЛИ НЕ ФайлXML.Существует() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В Папке " + КаталогW.ПолноеИмя
			+ " нет xml-файлов или не удалось извлечь xml-файл" + ФайлXML.ПолноеИмя);
		Иначе
			НовоеИмяФайлаXML = ПолучитьИмяВременногоФайла("xml");
			КопироватьФайл(ФайлXML.ПолноеИмя, НовоеИмяФайлаXML);
			
			ОписаниеФайла = Новый Структура("ИмяВременногоФайлаXML, ИсходноеИмяФайла, Каталог", НовоеИмяФайлаXML, ФайлXML.ПолноеИмя, КаталогW);
			Файлы.Добавить(ОписаниеФайла);
			
			ИмяРегистратора = ИмяРегистратораИзВыписки(ДокументЯвляетсяВыпиской, НовоеИмяФайлаXML);
		КонецЕсли;
	КонецЕсли;
	ПринудительноАрхивироватьКаталог = ПакетВалиден;
	
КонецПроцедуры

Функция ИмяРегистратораИзВыписки(ДокументЯвляетсяВыпиской, ИмяВременногоФайлаВыписки)
	
	ИмяРегистратора = "";
	Если ДокументЯвляетсяВыпиской Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ИмяВременногоФайлаВыписки, , , "windows-1251");
		Если ЧтениеXML.Прочитать() Тогда
			ПространствоИмен = "FCDR_2017_02(2019v3)";
			ТипXDTO = ФабрикаXDTO.Тип(ПространствоИмен, "STATEMENT_OF_HOLDINGS");
			ОтчетНРД = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипXDTO);
			НомерГосударственнойРегистрации = СокрЛП(ОтчетНРД.REGISTRAR.PARTY_DTLS.OGRN);
			Если ЗначениеЗаполнено(НомерГосударственнойРегистрации) Тогда
				МХ = Справочники.МестаХранения.НайтиПоРеквизиту("НомерГосударственнойРегистрации", НомерГосударственнойРегистрации);
			КонецЕсли;
			Если ЗначениеЗаполнено(МХ) Тогда
				ИмяРегистратора = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(СокрЛП(МХ.Наименование), "_");
			Иначе
				ИмяРегистратора = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ОтчетНРД.registrar.party_dtls.name, "_");
			КонецЕсли;
		КонецЕсли;
		ЧтениеXML.Закрыть();
	КонецЕсли;
	
	Возврат ИмяРегистратора;
	
КонецФункции

// BSLLS:LatinAndCyrillicSymbolInWord-on

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ

// Возвращает полное имя первого найденного zip-файла в дереве каталогов, начиная с указанного каталога
Функция НайтиZIPФайл(Каталог)
	Файлы = НайтиФайлы(Каталог.ПолноеИмя, "*.*");
	Для Каждого Файл Из Файлы Цикл
		Если Файл.ЭтоФайл() И ВРЕГ(Файл.Расширение) = ВРЕГ(".zip") Тогда
			Возврат Файл.ПолноеИмя;
		КонецЕсли;
		
		Если Файл.ЭтоКаталог() Тогда
			ИмяФайла = НайтиZIPФайл(Файл);
			Если ЗначениеЗаполнено(ИмяФайла) Тогда
				Возврат ИмяФайла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат "";
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
