
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ОбновитьПолныйАдрес();
	ЗаполнитьСписокВыбораСокращений();
	
КонецПроцедуры     

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗаполнитьКодыУровней();
	ОбновитьПолныйАдрес();
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьКодыУровней()
	
	НовыйКодРегионаВКоде           = Цел(Запись.Код / КонтактнаяИнформация.МаскаРегиона());
	НовыйКодРайонаВКоде            = Цел(Запись.Код / КонтактнаяИнформация.МаскаРайона()) % 1000;
	НовыйКодГородаВКоде            = Цел(Запись.Код / КонтактнаяИнформация.МаскаГорода()) % 1000;
	НовыйКодНаселенногоПунктаВКоде = Цел(Запись.Код / КонтактнаяИнформация.МаскаНасПункта()) % 1000;
	НовыйКодУлицыВКоде             = Цел(Запись.Код / КонтактнаяИнформация.МаскаУлицы())% 10000;
	
	Модифицировали = Ложь;
	
	Если Запись.КодРегионаВКоде <> НовыйКодРегионаВКоде Тогда
		Запись.КодРегионаВКоде = НовыйКодРегионаВКоде;
		Модифицировали = Истина;
	КонецЕсли;
		
	Если Запись.КодРайонаВКоде <> НовыйКодРайонаВКоде Тогда
		Запись.КодРайонаВКоде = НовыйКодРайонаВКоде;
		Модифицировали = Истина;
	КонецЕсли;
	
	Если Запись.КодГородаВКоде <> НовыйКодГородаВКоде Тогда
		Модифицировали = Истина;
		Запись.КодГородаВКоде = НовыйКодГородаВКоде;
	КонецЕсли;
	
	Если Запись.КодНаселенногоПунктаВКоде <> НовыйКодНаселенногоПунктаВКоде Тогда
		Запись.КодНаселенногоПунктаВКоде = НовыйКодНаселенногоПунктаВКоде;
		Модифицировали = Истина;
	КонецЕсли;
	
	Если Запись.КодУлицыВКоде <> НовыйКодУлицыВКоде Тогда
		Запись.КодУлицыВКоде = НовыйКодУлицыВКоде;
		Модифицировали = Истина;
	КонецЕсли;
	
	Возврат Модифицировали;
	
КонецФункции

&НаСервере
Процедура ОбновитьПолныйАдрес()	
	ПолныйАдрес = КонтактнаяИнформация.ПолучитьПолноеНазвание(Запись.Код);	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСписокВыбораСокращений()
	
		
КонецПроцедуры	

&НаКлиенте
Процедура СокращениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокСокращений = КонтактнаяИнформация.ПолучитьСписокСокращений(Запись.Наименование, Запись.ТипАдресногоЭлемента);	
	Если СписокСокращений <> Неопределено Тогда
		ЭлементСокращения = ВыбратьИзСписка(СписокСокращений, Элемент);
		Если ЭлементСокращения <> Неопределено Тогда
			Запись.Сокращение = СокрЛП(ЭлементСокращения.Значение);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры




	 
	 