

Функция ПолучитьРезультатЗапросаПоДивидендам(Ссылка, ВидДвижения)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка										КАК Ссылка,
	|	Ссылка.Дата									КАК Период,
	|	Ссылка.ЦеннаяБумага 						КАК ЦеннаяБумага,
	|	Депонент									КАК Депонент,
	|	Количество									КАК Количество,
	|	Сумма										КАК Сумма,
	|	Ссылка.ЦеннаяБумага.ВалютаНоминала			КАК ВалютаНоминала,
	|	Ссылка.БанковскийСчет						КАК БанковскийСчет,
	|	&ВидДвижения								КАК ВидДвижения,
	|	Ссылка.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта
	|ИЗ
	|	Документ.ВводДивидендов.ТаблицаДивиденды
	|ГДЕ
	|	Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвижения);
	
	Возврат Запрос.Выполнить();

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Изменяем задолженность по дивидендам
	РезультатЗапроса = ПолучитьРезультатЗапросаПоДивидендам(Ссылка, ВидДвиженияНакопления.Расход);
	Записи = РезультатЗапроса.Выгрузить();
	Движения.ДивидендыИКупоны.Загрузить(Записи);
	
	// Изменяем остатки по ДС
	РезультатЗапроса = ПолучитьРезультатЗапросаПоДивидендам(Ссылка, ВидДвиженияНакопления.Приход);
	Записи = РезультатЗапроса.Выгрузить();
	Движения.ДенежныеСредства.Загрузить(Записи);
	
	СформироватьВыписки();
		
КонецПроцедуры

Процедура СформироватьВыписки()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Дивиденды.ЦеннаяБумага				КАК ЦеннаяБумага,
	|	Дивиденды.ЦеннаяБумага.Эмитент		КАК Эмитент,
	|	Дивиденды.Депонент					КАК Депонент,
	|	Дивиденды.Количество				КАК Количество,
	|	Дивиденды.Сумма						КАК Сумма,
	|	Выписка.Ссылка						КАК Выписка,
	|	Дивиденды.СчетДепо					КАК СчетДепо,
	|	Дивиденды.Ссылка.ДокументОснование	КАК ДокументОснование
	|ИЗ
	|	Документ.ВводДивидендов.ТаблицаДивиденды КАК Дивиденды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка КАК Выписка
	|		ПО Дивиденды.Ссылка = Выписка.ОперацияЦБ
	|			И Дивиденды.Депонент = Выписка.ВладелецСчета
	|			И Дивиденды.СчетДепо = Выписка.СчетДепо
	|ГДЕ
	|	Дивиденды.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Выписка) Тогда
			ВыпискаОбъект = Выборка.Выписка.ПолучитьОбъект();
		Иначе
			ВыпискаОбъект = Документы.Выписка.СоздатьДокумент();
			ВыпискаОбъект.Дата = Дата;
		КонецЕсли;
		
		ВыпискаОбъект.ВидОтчета			= Перечисления.ВидыОтчетов.Отчет;
		ВыпискаОбъект.ОперацияЦБ		= Ссылка;
		ВыпискаОбъект.ДокументОснование = Выборка.ДокументОснование;
		ВыпискаОбъект.ВладелецСчета		= Выборка.Депонент;
		ВыпискаОбъект.ЭмитентВыписка	= Выборка.Эмитент;
		ВыпискаОбъект.СчетДепо			= Выборка.СчетДепо;	// Почему раньше не заполнялось???!!? А в запросе JOIN есть
		
		ВыпискаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаДивиденды.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одного депонента");  
		Отказ = Истина;			
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(СуммаИПД) Тогда
		Сообщить("Не указана сумма ИПД");  
		Отказ = Истина;			
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ЦеннаяБумага) Тогда
		Сообщить("Не выбрана ценная бумага");  
		Отказ = Истина;			
	КонецЕсли;	
	
	УстановитьНовыйНомер();
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Если ПроверкаНаСозданныеДокументыНаОснованииТекущего(Основание) Тогда
	//	
	//	Проверка = Истина;
	//	Сообщить("На основании данного поручения уже есть введенный документ!!!");
	//	Возврат;
	//	
	//КонецЕсли;
	
	Если Основание.ВидОперацииД = Справочники.ВидыОпераций.НачислениеДивидендов Тогда 
		
		Дата				= ОбщегоНазначения.ДатаДокумента(Основание);
		ДатаЗакрытияРеестра	= ОбщегоНазначения.ДатаДокумента(Основание);
		Инициатор			= Основание.Инициатор;
		ДокументОснование 	= Основание.Ссылка;			
		Комментарий			= "Поручение № " + Основание.Номер + " от " + Основание.Дата;
		ЦеннаяБумага		= Основание.ЦБ;
		
	Иначе
			
		Проверка = Истина;
		ДокументОснование 	= Документы.Поручение.ПустаяСсылка();			
		Сообщить("На основании данного вида поручения нельзя создать документ ""Ввод дивидендов"". 
				  |Вид операции должен быть ""НачислениеДивидендов""!");
		Возврат;	
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

#Если Клиент Тогда
	
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	СтруктураПечатныхФорм = Новый Структура;
	Возврат СтруктураПечатныхФорм;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
КонецПроцедуры

#КонецЕсли


 
