
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьЭлементыПриСозданииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСсылка = Элемент.ТекущаяСтрока Тогда
		Возврат;
	КонецЕсли;
	ТекСсылка = Элемент.ТекущаяСтрока;
	УстановитьОтборСчетаДепо(ЭтотОбъект);
	Если Не ДляМестаХраненияЗаданыСчетаДепоМХ(ТекСсылка) Тогда
		// Если нет ни одного счета депо МХ с владельцем данным местом хранения, то активизации строки в списке СчетаДепоМХ
		// не произойдет и фильтр в списке разделов счетов депо не поменяется, поэтому установим его принудительно.
		УстановитьОтборРазделыСчетаДепо(ЭтотОбъект, ПустойСчетДепоМХ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСчетаДепоМХ

&НаКлиенте
Процедура СчетаДепоМХПриАктивизацииСтроки(Элемент)
	УстановитьОтборРазделыСчетаДепо(ЭтотОбъект, Элемент.ТекущаяСтрока);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьЭлементыПриСозданииНаСервере()
	УстановитьОтборРазделыСчетаДепо(ЭтотОбъект);
	УстановитьОтборСчетаДепо(ЭтотОбъект);
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСчетаДепо(Форма)
	ДинСписок = Форма.СчетаДепоМХ;
	УстановитьОтборСписка(ДинСписок, Форма.ТекСсылка);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборРазделыСчетаДепо(Форма, Владелец = Неопределено)
	ДинСписок = Форма.РазделыСчетаДепоМХ;
	УстановитьОтборСписка(ДинСписок, Владелец, "Владелец");
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(ДинСписок, ЗначениеПоля = Неопределено, ИмяПоля = "Владелец")
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДинСписок
		, ИмяПоля
		, ЗначениеПоля);
КонецПроцедуры
	
&НаСервереБезКонтекста
Функция ДляМестаХраненияЗаданыСчетаДепоМХ(МестоХранения)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле
	|ИЗ
	|	Справочник.СчетаДепоМХ КАК СчетаДепоМХ
	|ГДЕ
	|	СчетаДепоМХ.Владелец = &МестоХранения";
	Запрос.УстановитьПараметр("МестоХранения", МестоХранения);
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();
КонецФункции

#КонецОбласти
