
#Область ОписаниеПеременных

&НаСервере
Перем мТекущийОбъектНаСервере; 	// Реквизит формы "Отчет", преобразованный в объект прикладного типа
Перем Депозитарий; 				// Организация по-умолчанию
Перем ДевятьЧасов;				// Время по-умолчанию

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ТекущийОбъект());
	
	ИнициализироватьНаСервере();
	
	Элементы.Результат.РежимМасштабированияПросмотра = РежимМасштабированияПросмотра.Обычный;
	
	Если Не ИспользоватьСводныеОтчеты() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Формирование сводных отчетов запрещено параметром");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаФормированияОтчетовПриИзменении(Элемент)
	ДатаФормированияОтчетовПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаФормированияОтчетовПриИзмененииНаСервере()
	Если НачалоДня(Объект.ДатаФормированияОтчетов) = Объект.ДатаФормированияОтчетов Тогда
		 Объект.ДатаФормированияОтчетов = Объект.ДатаФормированияОтчетов + ДевятьЧасов;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаОперацийПриИзменении(Элемент)
	ДатаОперацийПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаОперацийПриИзмененииНаСервере()
	ИнициализироватьНаСервере("ДатаОперацийПриИзменении");
КонецПроцедуры

&НаКлиенте
Процедура ИнформационнаяВыпискаПриИзменении(Элемент)
	ИнформационнаяВыпискаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИнформационнаяВыпискаПриИзмененииНаСервере()
	ИнициализироватьНаСервере();
	Если ЗначениеЗаполнено(Объект.ИнформационнаяВыписка) Тогда
		Объект.ДокументОперацииСводногоОтчета
			= Обработки.ФормированиеОтчетовОСовершенныхОперациях.ОперацияПоВыписке(Объект.ИнформационнаяВыписка);
		Объект.ДатаОпераций				 = Объект.ДокументОперацииСводногоОтчета.Дата;
		Объект.ДатаФормированияОтчетов	 = Объект.ИнформационнаяВыписка.Дата;
	Иначе
		Объект.ДокументОперацииСводногоОтчета = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьВЭДОПриИзменении(Элемент)
	Объект.ВыводитьФаксимилеВОтчетах = Не Объект.ПоместитьВЭДО;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыКЭДО

&НаКлиенте
Процедура ДокументыКЭДОПриАктивизацииСтроки(Элемент)
	
	ДокументыКЭДОАктивацияСтрокиНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
	ОчиститьОтчетНаСервере();
	
	ДокументыКЭДОАктивацияСтрокиНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПечатнуюФорму(Команда)
	
	ОчиститьОтчетНаСервере();
	
	ДокументыКЭДОАктивацияСтрокиНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ИспользоватьСводныеОтчеты()
	
	Возврат ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("83.ФормированиеСводныхОтчетовОСовершенныхОперациях", Ложь);
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыгрузкаВЭДО()
	
	Возврат ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("83.СводныеОтчетыВЭДОилиВKafka", 0) = 0;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьНаСервере(Фильтр = "")
	
	Объект.Операции.Очистить();
	Объект.ДокументыКЭДО.Очистить();
	Результат.Очистить();
	
	Если Фильтр = "ДатаОперацийПриИзменении" Тогда
		ДатаОпераций = ОбщегоНазначения.ДобавитьРабочийДень(Объект.ДатаОпераций, 1);
		Объект.ДатаФормированияОтчетов = НачалоДня(ДатаОпераций) + ДевятьЧасов;
		Объект.ИнформационнаяВыписка = Документы.Выписка.ПустаяСсылка();
		Объект.ДокументОперацииСводногоОтчета = Неопределено;
	Иначе
		Объект.ДатаФормированияОтчетов = НачалоДня(ТекущаяДатаСеанса()) + ДевятьЧасов;
		Объект.ДатаОпераций = ОбщегоНазначения.ПредыдущийРабочийДень(Объект.ДатаФормированияОтчетов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекущийОбъект()
	
	Если мТекущийОбъектНаСервере = Неопределено Тогда
		мТекущийОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат мТекущийОбъектНаСервере;
	
КонецФункции

&НаСервере
Функция ИмяОбъекта()
	
	Возврат "Объект." + ТекущийОбъект().Метаданные().Имя;
	
КонецФункции

&НаСервере
Процедура СформироватьНаСервере() Экспорт
	
	Если Депозитарий.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрано значение организации, используемое по умолчанию!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаФормированияОтчетов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата формирования отчетов!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаОпераций) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата выборки операций!");
		Возврат;
	КонецЕсли;
	
	ВремяНачалаФормирования = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ВключаяОтправленныеВЭДО = ЗначениеЗаполнено(Объект.ИнформационнаяВыписка);
	
	ТекущийОбъект().Сформировать(
		ВключаяОтправленныеВЭДО,
		Объект.ПоместитьВЭДО,
		Объект.ВыводитьФаксимилеВОтчетах,
		Объект.СчетДепоОтбор,
		Объект.ИнформационнаяВыписка,
		Объект.ДокументОперацииСводногоОтчета);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект(), "Объект");
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени(ИмяОбъекта(), ВремяНачалаФормирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКЭДОАктивацияСтрокиНаКлиенте()
	
	ИдентификаторСтроки = Элементы.ДокументыКЭДО.ТекущаяСтрока;
	
	Если Не ИдентификаторСтроки = Неопределено Тогда
		
		ТекДанные = Элементы.ДокументыКЭДО.ТекущиеДанные;
		
		ОтобразитьОтчетНаКлиенте(ТекДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьОтчетНаСервере()
	
	Результат.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОтчетНаКлиенте(ТекДанные)
	
	Если ТипЗнч(ТекДанные.Документ) = Тип("ДокументСсылка.Выписка") Тогда
		ТаблицаОпераций = Объект.Операции;
	Иначе
		Если ТекДанные.ActionType = "UPD" Тогда
			ТаблицаОпераций = СводнаяТаблицаОперацийUPD(ТекДанные.Документ, ТекДанные.ЭДО);
		Иначе
			ТаблицаОпераций = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Описатель = ДокументыКЭДОПриАктивизацииСтрокиНаСервере(
		ТекДанные.Документ,
		ТаблицаОпераций,
		Объект.ПоместитьВЭДО,
		Объект.ВыводитьФаксимилеВОтчетах,
		ЭтотОбъект.УникальныйИдентификатор);
	
	Если Описатель.Свойство("Ошибка") Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Описатель.Ошибка;
		Сообщение.Сообщить();
	Иначе
		Результат = Описатель.ТабДок;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СводнаяТаблицаОперацийUPD(ДокументОперации, ЭДО)
	
	СводнаяТаблицаUPD = Объект.ОперацииUPD;
	СводнаяТаблицаUPD.Очистить();
	
	Для Каждого ОперацияВДокументе Из ДокументОперации.Операции Цикл
		НоваяОперацияUPD = СводнаяТаблицаUPD.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяОперацияUPD, ОперацияВДокументе);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДокументОперации.ИсходящийНомер) И Не ЭДО Тогда
		ПараметрыОтбора = Новый Структура("СводныйОтчетОСовершенныхОперациях", ДокументОперации);
		НовыеОперации = Объект.Операции.НайтиСтроки(ПараметрыОтбора);
		Для Каждого ОперацияВДокументе Из НовыеОперации Цикл
			НоваяОперацияUPD = СводнаяТаблицаUPD.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяОперацияUPD, ОперацияВДокументе);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СводнаяТаблицаUPD;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДокументыКЭДОПриАктивизацииСтрокиНаСервере(
	ДокументКЭДО,
	ТаблицаОпераций,
	НеобходимоПоместитьВЭДО,
	ФаксимилеВОтчетах,
	УникальныйИдентификатор)
	
	ПоказатьПечатьИПодписьВДокументе = ФаксимилеВОтчетах И (ВыгрузкаВЭДО() Или Не НеобходимоПоместитьВЭДО);
	
	Адрес = Документы.СводныйОтчетОСовершенныхОперациях.АдресПечатнойФормы(
		ДокументКЭДО,
		ТаблицаОпераций,
		ПоказатьПечатьИПодписьВДокументе,
		УникальныйИдентификатор);
		
	Описатель = ПолучитьИзВременногоХранилища(Адрес);
	Возврат Описатель;
	
КонецФункции

#КонецОбласти

#Область Инициализация

Депозитарий			= ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ОрганизацияПоУмолчанию");
ДевятьЧасов 		= 32400;

#КонецОбласти
