#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущаяДата = ТекущаяДатаСеанса();
	Объект.НачалоПериода = ТекущаяДата;
	Объект.КонецПериода = ТекущаяДата;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьВBackQort(Команда)
	Если ПроверитьЗаполнение() Тогда
		ВыгрузитьНаСервереВBackQort();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписокЦБИзExcel(Команда)
	РаботаСДиалогамиКлиент.ЗагрузитьВТабличнуюЧастьСписокЦБИзExcel(Объект.ЦенныеБумаги, "ЦеннаяБумага", ЭтотОбъект);
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыгрузитьНаСервереВBackQort()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьВBackQort();
КонецПроцедуры

#КонецОбласти