
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИмяНастроекСервиса") И ЗначениеЗаполнено(Параметры.ИмяНастроекСервиса) Тогда
		ИмяНастроекСервиса = Параметры.ИмяНастроекСервиса;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДеревоТорговыхПлощадок();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьИЗакрытьКоманда(Команда)
	ВыбратьИЗакрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоТорговыхПлощадок()
	
	Отказ							 = Ложь;
	ТекстОтказа						 = "";
	ИдентификаторыТорговыхПлощадок	 = Новый Соответствие();
	ТЗ_ДанныеПоТорговымПлощадкам = MarketData.ТаблицаТорговыхПлощадок(ИмяНастроекСервиса, ИдентификаторыТорговыхПлощадок, Отказ, ТекстОтказа);
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОтказа);
		Возврат;
	КонецЕсли;
	
	Дерево = РеквизитФормыВЗначение("ТорговыеПлощадки");
	Для Каждого ТекСтрока Из ТЗ_ДанныеПоТорговымПлощадкам Цикл
		
		Если ТекСтрока.id_parent = 0 Тогда
			Если ТЗ_ДанныеПоТорговымПлощадкам.Найти(ТекСтрока.id, "id_parent") = Неопределено Тогда
				ПредставлениеРодителя = "Прочие";
			Иначе
				ПредставлениеРодителя = ТекСтрока.fullname_rus;
			КонецЕсли;
		Иначе
			ПредставлениеРодителя = ИдентификаторыТорговыхПлощадок.Получить(ТекСтрока.id_parent);
		КонецЕсли;
		
		СтрокаРодителя = СтрокаРодителя(Дерево, ПредставлениеРодителя);
		
		СтрокаТорговойПлощадки = СтрокаРодителя.Строки.Добавить();
		СтрокаТорговойПлощадки.Идентификатор 		= ТекСтрока.id;
		СтрокаТорговойПлощадки.КраткоеНаименование 	= ТекСтрока.shortname_rus;
		СтрокаТорговойПлощадки.ПолноеНаименование 	= ТекСтрока.fullname_rus;
		
	КонецЦикла;
	Дерево.Строки.Сортировать("КраткоеНаименование");
	ЗначениеВРеквизитФормы(Дерево, "ТорговыеПлощадки");
	
КонецПроцедуры

&НаСервере
Функция СтрокаРодителя(Дерево, ПредставлениеРодителя)
	Результат = Дерево.Строки.Найти(ПредставлениеРодителя, "КраткоеНаименование");
	Если Результат = Неопределено Тогда
		Результат = Дерево.Строки.Добавить();
		Результат.КраткоеНаименование = ПредставлениеРодителя;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ТорговыеПлощадкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗакрыть()
	
	ВыделенныеСтроки = Элементы.ТорговыеПлощадки.ВыделенныеСтроки;
	ВыбранныеДанные = ВыбранныеДанные(ВыделенныеСтроки);
	Если ЗначениеЗаполнено(ВыбранныеДанные) Тогда
		Закрыть(ВыбранныеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыбранныеДанные(ИдентификаторыВыделенныхСтрок)
	
	Результат = Новый Массив;
	Для Каждого Идентификатор Из ИдентификаторыВыделенныхСтрок Цикл
		Строка = ТорговыеПлощадки.НайтиПоИдентификатору(Идентификатор);
		Если Не ЗначениеЗаполнено(Строка.Идентификатор) Тогда
			Продолжить;
		КонецЕсли;
		ЭлементРезультата = Новый Структура("Идентификатор, КраткоеНаименование, ПолноеНаименование");
		ЗаполнитьЗначенияСвойств(ЭлементРезультата, Строка);
		Результат.Добавить(ЭлементРезультата);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти