
&После("ПриЗаписи")
Процедура NDFL_ПриЗаписи(Отказ)
	
	Если Дата>=Дата("20210101") Тогда
		Если ЭтотОбъект.Клиент.КлиентДУ Тогда
		 	УзелОбмена = ПланыОбмена.ОбменНДФЛ.НайтиПоКоду("NDFL_PIF");
			Если УзелОбмена<>ПланыОбмена.ОбменНДФЛ.ПустаяСсылка() Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	НачислениеНДФЛПоУправляющейКомпанииУдержания.Ссылка КАК Ссылка
					|ИЗ
					|	Документ.НачислениеНДФЛПоУправляющейКомпании.Удержания КАК НачислениеНДФЛПоУправляющейКомпанииУдержания
					|ГДЕ
					|	НачислениеНДФЛПоУправляющейКомпанииУдержания.Портфель ССЫЛКА Справочник.ПортфелиСтороннихСистем
					|	И НачислениеНДФЛПоУправляющейКомпанииУдержания.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ВыборкаДетальныеЗаписи.Ссылка);	
				КонецЕсли;
				
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
