
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - Булево - Признак отказа от создания формы
//  СтандартнаяОбработка - Булево - Признак выполнения стандартной (системной) обработки события
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Копирование = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	
	Если Копирование Тогда
		
		Запись.Основание = Неопределено;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.Основание) И ТипЗнч(Запись.Основание) <> Тип("Строка") Тогда
		
		ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Перед записью
//
// Параметры:
//  Отказ			 - Булево - Признак отказа от записи объекта
//  ПараметрыЗаписи	 - 	 - 
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Запись.Основание) И ТипЗнч(Запись.Основание) <> Тип("Строка") Тогда
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
