
#Область ОписаниеПеременных

&НаСервере
Перем мТекущийОбъектНаСервере; // Реквизит формы "Отчет", преобразованный в объект прикладного типа

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ТекущийОбъект());
	
	ИнициализироватьНаСервере("РДЦ");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КлючУникальности = Новый УникальныйИдентификатор;
	
	ИнициализироватьНаКлиенте(Отчет.ИсточникВыписок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СохранитьНастройкиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФайлВыпискиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РасширениеФайла = Отчет.ПризнакРасширенияФайла;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.ПолноеИмяФайла = Отчет.ФайлВыписки;
	Диалог.Заголовок = "Выберите файл выписки " + Отчет.ИсточникВыписок;
	Диалог.Фильтр = "*." + РасширениеФайла + "|*." + РасширениеФайла;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.ПредварительныйПросмотр = Ложь;
	
	ВозвращаемоеЗначение = Диалог.Выбрать();
	Если ВозвращаемоеЗначение Тогда
		Отчет.ФайлВыписки = Диалог.ПолноеИмяФайла;
		ПолучитьОстаткиИзВыпискиНаКлиенте(Отчет.ФайлВыписки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог с выписками " + Отчет.ИсточникВыписок;
	Диалог.Каталог = Отчет.КаталогВыписок;
	Диалог.ПредварительныйПросмотр = Ложь;
	
	ВозвращаемоеЗначение = Диалог.Выбрать();
	Если ВозвращаемоеЗначение Тогда
		Отчет.КаталогВыписок = РаботаСФайлами.ПолучитьАбсолютныйПуть(Диалог.Каталог);
		СохранитьНастройкиНаСервере();
	КонецЕсли;
	
	ПолучитьФайлыВыпискиНаСервере(Отчет.КаталогВыписок, Отчет.ИсточникВыписок);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьФайлыВыпискиНаСервере(КаталогВыписок, ИмяИсточникаВыписки)
	
	Если ЗначениеЗаполнено(КаталогВыписок) Тогда
		
		ТекущийОбъект().ПолучитьФайлыВыписки(КаталогВыписок, ИмяИсточникаВыписки);
		
		ЗначениеВРеквизитФормы(ТекущийОбъект(), "Отчет");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникВыписокПриИзменении(Элемент)
	
	ИнициализироватьНаСервере(Отчет.ИсточникВыписок);
	
	ИнициализироватьНаКлиенте(Отчет.ИсточникВыписок);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлыВыписок

&НаКлиенте
Процедура ФайлыВыписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Отчет.ФайлВыписки = Отчет.ФайлыВыписок.НайтиПоИдентификатору(ВыбраннаяСтрока).ИмяФайла;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЧтенияДанныхВыписки;
	
	ПолучитьОстаткиИзВыпискиНаКлиенте(Отчет.ФайлВыписки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПолучитьОстаткиИзВыпискиНаСервере(Адрес, ИмяИсточникаВыписки)
	
	Результат.Очистить();
	
	ТекущийОбъект().ПолучитьОстаткиИзВыписки(Адрес, ИмяИсточникаВыписки);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект(), "Отчет");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОстаткиИзВыписки(Команда)
	
	ПолучитьОстаткиИзВыпискиНаКлиенте(Отчет.ФайлВыписки);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЧтенияВыпискиПоУмолчанию(Команда)
	
	ИнициализацияПоУмолчаниюНаСервере(Отчет.ИсточникВыписок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьКаталогВыписок(Команда)
	
	ПолучитьФайлыВыпискиНаСервере(Отчет.КаталогВыписок, Отчет.ИсточникВыписок);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьНаСервере(ИмяИсточникаВыписки)
	
	ИнициализацияПоУмолчаниюНаСервере(ИмяИсточникаВыписки);
	
	Отчет.ФайлВыписки = "";
	Отчет.ДанныеПоОстаткам.Очистить();
	Результат.Очистить();
	ПараметрПериод = ФункцииОтчетовКлиентСервер.ПолучитьПараметр(Отчет.КомпоновщикНастроек, "Период");
	ПараметрПериод.Значение = Дата(1, 1, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьНаКлиенте(ИмяИсточникаВыписки)
	
	Заголовок = ИмяОтчета() + " [" + ИмяИсточникаВыписки + "]";
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПоискВыписок;
	
	ВосстановитьНастройкиНаСервере();
	ПолучитьФайлыВыпискиНаСервере(Отчет.КаталогВыписок, ИмяИсточникаВыписки);
	
КонецПроцедуры

&НаСервере
Функция ИмяОтчета()
	
	Возврат "Отчет." + ТекущийОбъект().Метаданные().Имя;
	
КонецФункции

&НаСервере
Функция ТекущийОбъект()
	
	Если мТекущийОбъектНаСервере = Неопределено Тогда
		мТекущийОбъектНаСервере = РеквизитФормыВЗначение("Отчет");
	КонецЕсли;
	
	Возврат мТекущийОбъектНаСервере;
	
КонецФункции

&НаСервере
Процедура ИнициализацияПоУмолчаниюНаСервере(ИмяИсточникаВыписки)
	
	ИмяОтчета = ИмяОтчета();
	
	ТекущийОбъект().ИнициализацияПоУмолчанию(ИмяОтчета, ИмяИсточникаВыписки);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект(), "Отчет");
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	ИмяОтчета = ИмяОтчета();
	
	ТекущийОбъект().СохранитьНастройки(ИмяОтчета, Отчет.ИсточникВыписок);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиНаСервере()
	
	ИмяОтчета = ИмяОтчета();
	
	ТекущийОбъект().ВосстановитьНастройки(ИмяОтчета, Отчет.ИсточникВыписок);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект(), "Отчет");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОстаткиИзВыпискиНаКлиенте(ИмяФайлаВыписки)
	
	ФайлВыписки = РаботаСФайлами.ПолучитьАбсолютныйПуть(ИмяФайлаВыписки);
	
	Если Не ОбщегоНазначенияКлиентСервер.ФайлСуществует(ФайлВыписки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл: [ " + ФайлВыписки + " ] не существует!");
		Возврат;
	КонецЕсли;
	
	Попытка
		Файл = Новый ДвоичныеДанные(ФайлВыписки);
		Адрес = ПоместитьВоВременноеХранилище(Файл, УникальныйИдентификатор);
		ПолучитьОстаткиИзВыпискиНаСервере(Адрес, Отчет.ИсточникВыписок);
	Исключение
		МенеджерОшибок = Новый МенеджерОбработкиОшибок;
		ТекстСообщения = МенеджерОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не могу прочитать файл. Произошла ошибка!: " + ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
