
&НаКлиенте
Процедура ВыборПериода(Команда)
	
	НастройкаПериода = Новый СтандартныйПериод(Отчет.ДатаНачала, Отчет.ДатаОкончания);
	НастройкаПериода.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода(); 
	ДиалогРедактирования.Период = НастройкаПериода; 
	Если ДиалогРедактирования.Редактировать() Тогда 
		Отчет.ДатаНачала	= ДиалогРедактирования.Период.ДатаНачала;
		Отчет.ДатаОкончания	= ДиалогРедактирования.Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры
