#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мИмяФайлаЗип = "bnk.exe";  
	мИмяФайлаБИК = "bnkseek.txt"; 
	мИмяФайлаРег = "Reg.txt"; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДеревоИзмененныхБанковКомандаПометок(Команда)
	
	Если Команда.Имя = "ДеревоИзмененныхБанковПометитьВсе" Тогда
		НовоеЗначение = Истина;
	ИначеЕсли Команда.Имя = "ДеревоИзмененныхБанковСнятьВсе" Тогда 
		НовоеЗначение = Ложь;
	КонецЕсли;
	
	Для Каждого ТекущиеСтроки Из ДеревоИзмененныхБанков.ПолучитьЭлементы() Цикл
		ТекущиеСтроки.Загрузка = НовоеЗначение;
		Для каждого ТекущаяСтрока из ТекущиеСтроки.ПолучитьЭлементы() Цикл
			ТекущаяСтрока.Загрузка = НовоеЗначение;
		КонецЦикла;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоИзмененныхБанковПринятьИзменения(Команда)
	
	// Из-за того что загрузка в справочник всех банков предусмотрена в одной транзакции, а выполнить все серверные вызовы по загрузке по одному банку в рамках одной транзакции невозможно, поэтому от прогресса в форме индикации пришлось отказаться
	ФормаИндикации = ПолучитьФорму("ОбщаяФорма.ХодВыполненияОбработкиДанных");
	ФормаИндикации.НаименованиеОбработкиДанных = "Загрузка классификатора банков";
	ФормаИндикации.КомментарийОбработкиДанных  = "Выполняется принятие изменений";
	//ФормаИндикации.КомментарийЗначения         = "Записано:";
	ФормаИндикации.Открыть();

	ПринятьИзмененияСервер();
	
	ФормаИндикации.Закрыть();

	Предупреждение("Изменения загружены.");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКлассификатор(Команда)
	ДеревоБанков.ПолучитьЭлементы().Очистить();
	Если Объект.ВариантЗагрузки = 0 Тогда
		ПолучитьЗагрузчикИТС();
	Иначе
		ПолучитьФайлРБК();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСправочник(Команда)
	
	ДеревоИзмененныхБанков.ПолучитьЭлементы().Очистить();
	
	ФормаИндикации = ПолучитьФорму("ОбщаяФорма.ХодВыполненияОбработкиДанных");
	ФормаИндикации.НаименованиеОбработкиДанных = "Загрузка классификатора банков";
	ФормаИндикации.КомментарийОбработкиДанных  = "Выполняется заполнение справочника";
	ФормаИндикации.КомментарийЗначения  = "Заполнено:";
	ФормаИндикации.Открыть();

	ФлагЗагрузки = ЗаполнитьСправочникСервер();
	
	ФормаИндикации.Закрыть();
	
	Если ДеревоИзмененныхБанков.ПолучитьЭлементы().Количество() > 0 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаКонфликты;
	Иначе
		Если ФлагЗагрузки Тогда
			Предупреждение("Загрузка банков завершена.");
		Иначе
			Предупреждение("В списке нет выбранных банков для заполнения.");
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
	
&НаСервере
Функция ЗаполнитьСправочникСервер()
	НачатьТранзакцию();
	СпрБанки = Справочники.Банки;
	тДеревоБанков = РеквизитФормыВЗначение("ДеревоБанков", Тип("ДеревоЗначений"));
	тДеревоИзмененныхБанков = РеквизитФормыВЗначение("ДеревоИзмененныхБанков", Тип("ДеревоЗначений"));

	КоличествоСтрокДерева = тДеревоБанков.Строки.Количество();
	СчетчикЦикла = 0;
	ФлагЗагрузки = Ложь;
	Для Каждого ТекСтрРег Из тДеревоБанков.Строки Цикл
		СчетчикЦикла = СчетчикЦикла + 1;
		//ФормаИндикации.Значение = СчетчикЦикла / КоличествоСтрокДерева * 100;
		
		ТекОКАТО  = ТекСтрРег.КодРегиона;
		ТекРегион = ТекСтрРег.Наименование;
		ФлСозданияГруппы = 0;
		Для Каждого ТекСтрБанка Из ТекСтрРег.Строки Цикл
			Если Не ТекСтрБанка.Загрузка Тогда
				Продолжить;
			КонецЕсли;	
			
			БИК          = СокрЛП(ТекСтрБанка.КодРегиона);
			КоррСчет     = СокрЛП(ТекСтрБанка.КоррСчет);
			Наименование = СокрЛП(ТекСтрБанка.Наименование);
			ТипБанка     = СокрЛП(ТекСтрБанка.ТипБанка);
			Индекс       = СокрЛП(ТекСтрБанка.Индекс);
			Город        = СокрЛП(ТекСтрБанка.Город);
			Адрес        = СокрЛП(ТекСтрБанка.Адрес);
			Телефоны     = СокрЛП(ТекСтрБанка.Телефон);

			ВыбЭл = СпрБанки.НайтиПоКоду(БИК);
			Если ВыбЭл = СпрБанки.ПустаяСсылка() Тогда
				РодительЭл = СпрБанки.НайтиПоКоду(ТекОКАТО);
				Если РодительЭл = СпрБанки.ПустаяСсылка() Тогда
					НоваяГр              = СпрБанки.СоздатьГруппу();
					НоваяГр.Код          = ТекОКАТО;
					НоваяГр.Наименование = ТекРегион;
					НоваяГр.Записать();
					РодительЭл = НоваяГр.Ссылка;
				КонецЕсли;	
				НовыйЭл = СпрБанки.СоздатьЭлемент();
				НовыйЭл.Родитель     = РодительЭл;
				НовыйЭл.Код          = БИК;
				НовыйЭл.Наименование = Наименование;
				НовыйЭл.КоррСчет     = КоррСчет;
				НовыйЭл.Город        = Город;
				НовыйЭл.Адрес        = Индекс+", "+Адрес;
				НовыйЭл.Телефоны     = Телефоны;
				НовыйЭл.Записать();
			Иначе	
				ФлИзменения = 1000000;
                ФлИзменения = ?(СокрЛП(ВыбЭл.Код)          <> СокрЛП(БИК),ФлИзменения+100000,ФлИзменения);
                ФлИзменения = ?(СокрЛП(ВыбЭл.Наименование) <> СокрЛП(Наименование),ФлИзменения+10000,ФлИзменения);
                ФлИзменения = ?(СокрЛП(ВыбЭл.Город)        <> СокрЛП(Город),ФлИзменения+1000,ФлИзменения);
                ФлИзменения = ?(СокрЛП(ВыбЭл.КоррСчет)     <> СокрЛП(КоррСчет),ФлИзменения+100,ФлИзменения);
                ФлИзменения = ?(СокрЛП(ВыбЭл.Адрес)        <> СокрЛП(Индекс+", "+Адрес),ФлИзменения+10,ФлИзменения);
                ФлИзменения = ?(СокрЛП(ВыбЭл.Телефоны)     <> СокрЛП(Телефоны),ФлИзменения+1,ФлИзменения);
				
				Если ФлИзменения > 1000000 Тогда
					ФлИзменения = Строка(ФлИзменения);
					ФлИзменения = СтрЗаменить(ФлИзменения,Символы.НПП,"");
					Если ФлСозданияГруппы = 0 Тогда
						тНоваяСтрокаРегиона = тДеревоИзмененныхБанков.Строки.Добавить();
						тНоваяСтрокаРегиона.КодРегиона   = ТекОКАТО;
						тНоваяСтрокаРегиона.Наименование = ТекРегион;
						тНоваяСтрокаРегиона.Загрузка     = Истина;
						ФлСозданияГруппы = 1;
						НоваяСтрокаРегиона = ДеревоИзмененныхБанков.ПолучитьЭлементы().Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаРегиона, тНоваяСтрокаРегиона);
					КонецЕсли;	

					тНоваяСтрокаБанка              = тНоваяСтрокаРегиона.Строки.Добавить();
					тНоваяСтрокаБанка.Наименование = Наименование;
					тНоваяСтрокаБанка.Загрузка     = Истина;
					НоваяСтрокаБанка = НоваяСтрокаРегиона.ПолучитьЭлементы().Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаБанка, тНоваяСтрокаБанка);

					тНоваяСтрокаРеквизита = тНоваяСтрокаБанка.Строки.Добавить();
					тНоваяСтрокаРеквизита.Наименование = "БИК";
					тНоваяСтрокаРеквизита.ЗнКлассификатора      = БИК;
					тНоваяСтрокаРеквизита.ЗнБазы                = ВыбЭл.Код;
					тНоваяСтрокаРеквизита.ИзмененРеквизит = ?(Сред(ФлИзменения,2,1)="1",Истина,Ложь);
					тНоваяСтрокаРеквизита.НеИмеетПодчиненных = Истина;
					НоваяСтрокаРеквизита = НоваяСтрокаБанка.ПолучитьЭлементы().Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаРеквизита, тНоваяСтрокаРеквизита);

					тНоваяСтрокаРеквизита = тНоваяСтрокаБанка.Строки.Добавить();
					тНоваяСтрокаРеквизита.Наименование = "Наименование";
					тНоваяСтрокаРеквизита.ЗнКлассификатора      = Наименование;
					тНоваяСтрокаРеквизита.ЗнБазы                = ВыбЭл.Наименование;
					тНоваяСтрокаРеквизита.ИзмененРеквизит = ?(Сред(ФлИзменения,3,1)="1",Истина,Ложь);
					тНоваяСтрокаРеквизита.НеИмеетПодчиненных = Истина;
					НоваяСтрокаРеквизита = НоваяСтрокаБанка.ПолучитьЭлементы().Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаРеквизита, тНоваяСтрокаРеквизита);

					Для каждого ТекРек из Метаданные.Справочники.Банки.Реквизиты Цикл
						ИмяРек = СокрЛП(ТекРек.Имя);
						Если ИмяРек = "Город" Тогда
							ЗнКлас = Вычислить("Город");
							СинРек = "Город";
							НомЦиф = 4;
						ИначеЕсли ИмяРек = "КоррСчет" Тогда
							ЗнКлас = Вычислить("КоррСчет");
							СинРек = "Корр. счет";
							НомЦиф = 5;
						ИначеЕсли ИмяРек = "Адрес" Тогда
							ЗнКлас = Вычислить("Индекс+"", ""+Адрес");
							СинРек = "Адрес";
							НомЦиф = 6;
						ИначеЕсли ИмяРек = "Телефоны" Тогда
							ЗнКлас = Вычислить("Телефоны");
							СинРек = "Телефоны";
							НомЦиф = 7;
						КонецЕсли;	
						
						тНоваяСтрокаРеквизита = тНоваяСтрокаБанка.Строки.Добавить();
						тНоваяСтрокаРеквизита.Наименование = СинРек;
						тНоваяСтрокаРеквизита.ЗнКлассификатора = ЗнКлас;
						тНоваяСтрокаРеквизита.ЗнБазы           = ВыбЭл[ИмяРек];
						тНоваяСтрокаРеквизита.ИзмененРеквизит  = ?(Сред(ФлИзменения,НомЦиф,1)="1",Истина,Ложь);
						тНоваяСтрокаРеквизита.НеИмеетПодчиненных = Истина;
						НоваяСтрокаРеквизита = НоваяСтрокаБанка.ПолучитьЭлементы().Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаРеквизита, тНоваяСтрокаРеквизита);
					КонецЦикла;	
				КонецЕсли;	
			КонецЕсли;	
			ФлагЗагрузки = Истина;
		КонецЦикла;	
	КонецЦикла;	
	
	ЗафиксироватьТранзакцию();
	Возврат ФлагЗагрузки;
	
КонецФункции

&НаСервере
Процедура ПринятьИзмененияСервер()
	НачатьТранзакцию();
	СпрБанки = Справочники.Банки;
	тДеревоИзмененныхБанков = РеквизитФормыВЗначение("ДеревоИзмененныхБанков", Тип("ДеревоЗначений"));

	КоличествоСтрокУровня = тДеревоИзмененныхБанков.Строки.Количество();
	Для Каждого ТекСтрРег Из тДеревоИзмененныхБанков.Строки Цикл
		ТекОКАТО  = СокрЛП(ТекСтрРег.КодРегиона);
		ТекРегион = СокрЛП(ТекСтрРег.Наименование);
		ФлСозданияГруппы = 0;
		Для Каждого ТекСтрБанка Из ТекСтрРег.Строки Цикл
			Если Не ТекСтрБанка.Загрузка Тогда
				Продолжить;
			КонецЕсли;	
			ТекущаяСтрока = ТекСтрБанка.Строки.Индекс(ТекСтрРег) + 1;
			//ФормаИндикации.Значение = ТекущаяСтрока/КоличествоСтрокУровня * 100;
			
			Для Каждого ТекСтрРеквизита Из ТекСтрБанка.Строки Цикл
				НаимРек = СокрЛП(ТекСтрРеквизита.Наименование);
				Если НаимРек = "БИК" Тогда
					БИК = СокрЛП(ТекСтрРеквизита.ЗнКлассификатора);
				ИначеЕсли НаимРек = "Наименование" Тогда
					Наименование = СокрЛП(ТекСтрРеквизита.ЗнКлассификатора);
				ИначеЕсли НаимРек = "Корр. счет" Тогда
					КоррСчет = СокрЛП(ТекСтрРеквизита.ЗнКлассификатора);
				ИначеЕсли НаимРек = "Город" Тогда
					Город = СокрЛП(ТекСтрРеквизита.ЗнКлассификатора);
				ИначеЕсли НаимРек = "Адрес" Тогда
					Адрес = СокрЛП(ТекСтрРеквизита.ЗнКлассификатора);
				ИначеЕсли НаимРек = "Телефоны" Тогда
					Телефоны = СокрЛП(ТекСтрРеквизита.ЗнКлассификатора);
				КонецЕсли;	
			КонецЦикла;

			
			ВыбЭл = СпрБанки.НайтиПоКоду(БИК);
			Если ВыбЭл <> СпрБанки.ПустаяСсылка() Тогда
				РодительЭл = СпрБанки.НайтиПоКоду(ТекОКАТО);
				Если РодительЭл = СпрБанки.ПустаяСсылка() Тогда
					НоваяГр              = СпрБанки.СоздатьГруппу();
					НоваяГр.Код          = ТекОКАТО;
					НоваяГр.Наименование = ТекРегион;
					НоваяГр.Записать();
					РодительЭл = НоваяГр.Ссылка;
				КонецЕсли;	
				ИзмЭл = ВыбЭл.ПолучитьОбъект();
				ИзмЭл.Родитель     = РодительЭл;
				ИзмЭл.Код          = БИК;
				ИзмЭл.Наименование = Наименование;
				ИзмЭл.КоррСчет     = КоррСчет;
				ИзмЭл.Город        = Город;
				ИзмЭл.Адрес        = Адрес;
				ИзмЭл.Телефоны     = Телефоны;
				ИзмЭл.Записать();
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;	

	ЗафиксироватьТранзакцию();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ДеревоБанковЗагрузкаПриИзменении(Элемент)
	УстановитьФлагЗагрузкиПодчиненныхСтрок(Элемент.Родитель);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоИзмененныхБанковЗагрузкаПриИзменении(Элемент)
	УстановитьФлагЗагрузкиПодчиненныхСтрок(Элемент.Родитель);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагЗагрузкиПодчиненныхСтрок(Элемент)
	ЗагрузкаТекущейСтроки = Элемент.ТекущиеДанные.Загрузка;
	Если Элемент.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		ПодчиненныеСтроки = Элемент.ТекущиеДанные.ПолучитьЭлементы();
		Для каждого Строка из ПодчиненныеСтроки Цикл
			Строка.Загрузка = ЗагрузкаТекущейСтроки;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБанковПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекДанные = Элемент.ТекущиеДанные;
	
	Элементы.НадписьДопРеквизитов.Заголовок = СтрШаблон(
		"Тип банка:   %1
		|Корреспондентский счет:   %2
		|Адрес:   %3, %4, %5
		|Телефоны:   %6", СокрЛП(ТекДанные.ТипБанка), СокрЛП(ТекДанные.КоррСчет), СокрЛП(ТекДанные.Город), СокрЛП(ТекДанные.Индекс), СокрЛП(ТекДанные.Адрес), СокрЛП(ТекДанные.Телефон));
КонецПроцедуры

#КонецОбласти

// Определяет по коду типа города строку типа города
//
// Параметры
//  Стр - Строка - код типа населенного пункта
//
// Возвращаемое значение
//  сокращенную строку типа населенного пункта
//
&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьТипГорода(Стр)
	
	Если Стр = "1" Тогда
		Возврат "Г.";       // ГОРОД
	ИначеЕсли Стр = "2" Тогда
		Возврат "П.";       // ПОСЕЛОК
	ИначеЕсли Стр = "3" Тогда
		Возврат "С.";       // СЕЛО
	ИначеЕсли Стр = "4" Тогда
		Возврат "ПГТ.";     // ПОСЕЛОК ГОРОДСКОГО ТИПА
	ИначеЕсли Стр = "5" Тогда
		Возврат "СТ-ЦА.";   // СТАНИЦА
	ИначеЕсли Стр = "6" Тогда
		Возврат "АУЛ.";     // АУЛ
	ИначеЕсли Стр = "7" Тогда
		Возврат "РП.";      //  РАБОЧИЙ ПОСЕЛОК 
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции  // ОпределитьТипГорода()

// Определяет по коду типа банка строку типа банка
//
// Параметры
//  Стр - Строка - код типа банка
//
// Возвращаемое значение
//  сокращенную строку типа банка
//
&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьТипБанка(Стр)
	
	Если Стр = "00" Тогда
		Возврат "ГРКЦ ";    
	ИначеЕсли Стр = "10" Тогда
		Возврат "РКЦ ";    
	ИначеЕсли Стр = "20" Тогда
		Возврат "Б ";    
	ИначеЕсли Стр = "21" Тогда
		Возврат "КБ ";    
	ИначеЕсли Стр = "22" Тогда
		Возврат "СБ ";    
	ИначеЕсли Стр = "23" Тогда
		Возврат "АКБ ";    
	ИначеЕсли Стр = "24" Тогда
		Возврат "ЧКБ ";    
	ИначеЕсли Стр = "25" Тогда
		Возврат "КОПБ ";    
	ИначеЕсли Стр = "26" Тогда
		Возврат "АПБ ";    
	ИначеЕсли Стр = "30" Тогда
		Возврат "ФБ ";    
	ИначеЕсли Стр = "31" Тогда
		Возврат "ФКБ ";    
	ИначеЕсли Стр = "32" Тогда
		Возврат "Отд. ";    
	ИначеЕсли Стр = "33" Тогда
		Возврат "ФАКБ ";    
	ИначеЕсли Стр = "34" Тогда
		Возврат "ФЧКБ ";    
	ИначеЕсли Стр = "35" Тогда
		Возврат "ФКОБ ";    
	ИначеЕсли Стр = "36" Тогда
		Возврат "Отд. ";    
	ИначеЕсли Стр = "40" Тогда
		Возврат "ПУ ";    
	ИначеЕсли Стр = "50" Тогда
		Возврат "ЦХ ";    
	ИначеЕсли Стр = "70" Тогда
		Возврат "КУ ";    
	ИначеЕсли Стр = "71" Тогда
		Возврат "КЛ ";    
	ИначеЕсли Стр = "72" Тогда
		Возврат "ОРЦБ ";    
	ИначеЕсли Стр = "98" Тогда
		Возврат "ИСКЛ ";    
	ИначеЕсли Стр = "99" Тогда
		Возврат "ОТЗВ ";    
	ИначеЕсли Стр = "90" Тогда
		Возврат "ЛИКВ ";    
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции  // ОпределитьТипБанка()

// Производит загрузку банков с РБК
//
// Параметры
//  ВремКаталог - Строка - путь к временному каталогу
//
&НаКлиенте
Процедура ЗагрузитьКлассификаторСРБК()
	
	ФормаИндикации = ПолучитьФорму("ОбщаяФорма.ХодВыполненияОбработкиДанных");
	ФормаИндикации.НаименованиеОбработкиДанных = "Загрузка классификатора банков";
	ФормаИндикации.КомментарийОбработкиДанных  = "Загружаются данные из классификатора";
	ФормаИндикации.КомментарийЗначения         = "Загружено:";
	ФормаИндикации.Открыть();
	
	КолСтрок = ЗагрузитьКлассификаторСРБКШаг1(ФормаИндикации);
	Состояние("Выполняется загрузка классификатора");
	ФормаИндикации.ОбновитьОтображениеДанных();
	ЭтаФорма.ОбновитьОтображениеДанных();
	
	Для НомерСтроки = 1 По КолСтрок Цикл
		ЗагрузитьКлассификаторСРБКШаг3(НомерСтроки);
		ФормаИндикации.Значение = НомерСтроки;
		ФормаИндикации.ОбновитьОтображениеДанных();
	КонецЦикла;
	ФормаИндикации.Закрыть();
	
КонецПроцедуры
	
&НаКлиенте
Функция ЗагрузитьКлассификаторСРБКШаг1(ФормаИндикации)
	ФайлБИК = Новый Файл(ВремКаталог+"\"+мИмяФайлаБИК);
	ФайлРег = Новый Файл(ВремКаталог+"\"+мИмяФайлаРег);
	
    Разделитель = Символы.Таб;
	СпРегионов = Новый СписокЗначений;
	мТекстКлассификатора = Новый ТекстовыйДокумент();
	мТекстКлассификатора.Прочитать(ВремКаталог + "\" + мИмяФайлаРег);
	КолСтрок = мТекстКлассификатора.КоличествоСтрок();
	ФормаИндикации.МаксимальноеЗначение = КолСтрок;
	Для к = 1 по КолСтрок Цикл
		ФормаИндикации.Значение = Окр(100 * к / КолСтрок, 2);
		ФормаИндикации.ОбновитьОтображениеДанных();
		Стр = мТекстКлассификатора.ПолучитьСтроку(к);

		Если (Лев(Стр,2) = "//") или (ПустаяСтрока(Стр)) Тогда
			Продолжить;
		КонецЕсли;
		НомПоля = 1;
		Пока (ПустаяСтрока(Стр) = 0) Цикл	//	пока не обработали всю шапку
	        Поз = Найти(Стр,Разделитель);
			Если Поз = 0 Тогда	//	не нашли
				НазваниеОдногоПоля = Стр;
				Стр = "";
			Иначе
				//	вырезаем очередное поля
				НазваниеОдногоПоля = Лев(Стр,Поз-1);
				Стр = Прав(Стр,СтрДлина(Стр)-Поз);
			КонецЕсли;

			НазваниеОдногоПоля = СокрЛП(НазваниеОдногоПоля);
			//	добавляем входное поле в таблицу
			Если НомПоля = 1 Тогда
				Симвл1 = СокрЛП(НазваниеОдногоПоля);
			ИначеЕсли НомПоля = 2 Тогда
				Симвл2 = СокрЛП(НазваниеОдногоПоля);
			КонецЕсли; 

			НомПоля = НомПоля + 1;
			Если НомПоля > 2 Тогда 
				Прервать;  // Завершить просмотр строки, т.к. обработаны все необходимые поля, но есть еще что-то.
			КонецЕсли; 
		КонецЦикла;	
		
		СпРегионов.Добавить(Симвл1,Симвл2);
	КонецЦикла;	
	
	мТекстКлассификатора.Прочитать(ВремКаталог + "\" + мИмяФайлаБИК);
	АдресТекстаКлассификатора = ПоместитьВоВременноеХранилище(мТекстКлассификатора.ПолучитьТекст(), Новый УникальныйИдентификатор);
	Возврат мТекстКлассификатора.КоличествоСтрок();
	
КонецФункции
	

&НаСервере
Процедура ЗагрузитьКлассификаторСРБКШаг3(НомерСтроки)
    Разделитель = Символы.Таб;
	мТекстКлассификатора = ПолучитьИзВременногоХранилища(АдресТекстаКлассификатора);
	тДеревоБанков = РеквизитФормыВЗначение("ДеревоБанков", Тип("ДеревоЗначений"));
	
	к = НомерСтроки;
	
	Стр = СтрПолучитьСтроку(мТекстКлассификатора, к);
	Стр = СокрЛП(Стр);

	Если ПустаяСтрока(Стр) Тогда
		Возврат;
	КонецЕсли;
	
	ЗнТипБанка = "";
	ЗнПункт = "";
	ЗнТипПункта = "";
	ЗнНаименование = "";
	ЗнПризнакКода = "";
	ЗнБИК = "";
	ЗнКорСчет = "";
	
	НомПоля = 1;
	Пока (ПустаяСтрока(Стр) = 0) Цикл	//	пока не обработали всю шапку
        Поз = Найти(Стр,Разделитель);
		Если Поз = 0 Тогда	//	не нашли
			НазваниеОдногоПоля = Стр;
			Стр = "";
		Иначе
			//	вырезаем очередное поля
			НазваниеОдногоПоля = Лев(Стр,Поз-1);
			Стр = Прав(Стр,СтрДлина(Стр)-Поз);
		КонецЕсли;

		НазваниеОдногоПоля = СокрЛП(НазваниеОдногоПоля);
		//	добавляем входное поле в таблицу
		Если НомПоля = 1 Тогда
			ЗнТипБанка = ОпределитьТипБанка(СокрЛП(НазваниеОдногоПоля));
		ИначеЕсли НомПоля = 2 Тогда
			ЗнПункт = СокрЛП(НазваниеОдногоПоля);
		ИначеЕсли НомПоля = 3 Тогда
			ЗнТипПункта = ОпределитьТипГорода(СокрЛП(НазваниеОдногоПоля));
		ИначеЕсли НомПоля = 4 Тогда
			ЗнНаименование = СокрЛП(НазваниеОдногоПоля);
		ИначеЕсли НомПоля = 5 Тогда
			ЗнПризнакКода = СокрЛП(НазваниеОдногоПоля);
		ИначеЕсли НомПоля = 6 Тогда
			ЗнБИК = СокрЛП(НазваниеОдногоПоля);
		ИначеЕсли НомПоля = 7 Тогда
			ЗнКорСчет = СокрЛП(НазваниеОдногоПоля);
		КонецЕсли; 
		НомПоля = НомПоля + 1;
		Если НомПоля > 7 Тогда 
			Прервать;  // Завершить просмотр строки, т.к. обработаны все необходимые поля, но есть еще что-то.
		КонецЕсли; 
	КонецЦикла;	


	КодРег          = Сред(ЗнБИК,3,2);
	НайденныйРегион = СпРегионов.НайтиПоЗначению(КодРег);
	Если НайденныйРегион = Неопределено Тогда
		Возврат;
	КонецЕсли;

	тСтрокаРегиона = тДеревоБанков.Строки.Найти(КодРег,"КодРегиона",Ложь);
	Если тСтрокаРегиона = Неопределено Тогда
		тСтрокаРегиона              = тДеревоБанков.Строки.Добавить();
		тСтрокаРегиона.КодРегиона   = НайденныйРегион.Значение;
		тСтрокаРегиона.Наименование = НайденныйРегион.Представление;
		тСтрокаРегиона.Загрузка     = Ложь;
		СтрокаРегиона = ДеревоБанков.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРегиона, тСтрокаРегиона);
	Иначе	
		СтрокаРегиона = ДеревоБанков.ПолучитьЭлементы()[тДеревоБанков.Строки.Индекс(тСтрокаРегиона)];
	КонецЕсли;	
	
	тСтрокаБанка              = тСтрокаРегиона.Строки.Добавить();
	тСтрокаБанка.Наименование = ЗнНаименование;
	тСтрокаБанка.КодРегиона   = ЗнБИК;
	тСтрокаБанка.ТипБанка     = ЗнТипБанка;
	тСтрокаБанка.КоррСчет     = ЗнКорСчет;
	тСтрокаБанка.Индекс       = "";
	тСтрокаБанка.Город        = ЗнТипПункта+" "+ЗнПункт;
	тСтрокаБанка.Адрес        = "";
	тСтрокаБанка.Телефон      = "";
	тСтрокаБанка.Загрузка = Ложь;
	СтрокаБанка = СтрокаРегиона.ПолучитьЭлементы().Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаБанка, тСтрокаБанка);
	
КонецПроцедуры // ЗагрузитьКлассификаторСРБК()

// Получает файл загрузки с РБК
// 
// Параметры
//  Нет.
//  
&НаКлиенте
Процедура ПолучитьФайлРБК()
	ВремКаталог = КаталогВременныхФайлов() + "tempBik";
	ВремКаталогФС = Новый Файл(ВремКаталог);
	Если НЕ ВремКаталогФС.Существует() Тогда
		СоздатьКаталог(ВремКаталог);
	КонецЕсли;
	УдалитьФайлы(ВремКаталог,"*.*");
	
	СерверИсточник = "cbrates.rbc.ru";
	НТТР = Новый HTTPСоединение(СерверИсточник);
	
	Адрес = "bnk/bnk.exe";
	Попытка
		НТТР.Получить(Адрес, ВремКаталог + "\" + мИмяФайлаЗип);
	Исключение
		Сообщить("Неудачная попытка соединения.");
		Возврат;
	КонецПопытки;
	
	ИмяБатФайла = "" + ВремКаталог + "\RbkZip.bat";
	БатФайл     = Новый ТекстовыйДокумент();
	БатФайл.Очистить();
	БатФайл.ДобавитьСтроку(Лев(ВремКаталог,2));
	БатФайл.ДобавитьСтроку("cd """ + Сред(ВремКаталог,3) + """");
	БатФайл.ДобавитьСтроку("""" + ВремКаталог + "\" + мИмяФайлаЗип + """");
	БатФайл.Записать(ИмяБатФайла,КодировкаТекста.ANSI);
	КомандаСистемы(""""+ ИмяБатФайла + """");

	ФайлБИК = Новый Файл(ВремКаталог + "\" + мИмяФайлаБИК);
	ФайлРЕГ = Новый Файл(ВремКаталог + "\" + мИмяФайлаРег);
	
	НачальнаяДата = ТекущаяДата();
	Пока (НЕ (ФайлБИК.Существует() И ФайлРЕГ.Существует())) И ((ТекущаяДата() - НачальнаяДата) < 10) Цикл
	КонецЦикла;
	
	ФайлыПодготовлены = (ФайлБИК.Существует() И ФайлРЕГ.Существует());
	Если ФайлыПодготовлены Тогда
		ЗагрузитьКлассификаторСРБК();
		ПослеОбработкиФайлаРБК();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеОбработкиФайлаРБК()
	УдалитьФайлы(ВремКаталог,мИмяФайлаЗип);
	УдалитьФайлы(ВремКаталог,мИмяФайлаБИК);
	УдалитьФайлы(ВремКаталог,мИмяФайлаРег);
	УдалитьФайлы(ВремКаталог,"RbkZip.bat");
КонецПроцедуры

// Получает обработку загрузки с ИТС и запускает ее
// 
// Параметры
//  Нет.
//  
&НаКлиенте
Процедура ПолучитьЗагрузчикИТС()
	
	// Загрузка классификатора с диска ИТС
	КаталогИТС  = "";
	ФайлИТС     = "";
	ПолнФайлБИК = "";

	Для Индекс = 68 По 90 Цикл      
	//Для Индекс = 67 По 90 Цикл      
		ОбработкаБИК = Новый Файл(Символ(Индекс) + ":\1CITS\EXE\EXTDB\BIKr5.epf");
		//ОбработкаБИК = Новый Файл(Символ(Индекс) + ":\BIK.epf");
		ФлДиска      = Истина;
		Попытка
			ЕстьФайл = ОбработкаБИК.Существует();
		Исключение
			ФлДиска  = Ложь;
		КонецПопытки;	

		Если ФлДиска Тогда
			Если ЕстьФайл Тогда
				ПолнФайлБИК = Символ(Индекс) + ":\1CITS\EXE\EXTDB\BIKr5.epf";
				//ПолнФайлБИК = Символ(Индекс) + ":\BIK.epf";
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ПустаяСтрока(ПолнФайлБИК) Тогда
		ФормаИндикации = ПолучитьФорму("ОбщаяФорма.ХодВыполненияОбработкиДанных");
		ФормаИндикации.НаименованиеОбработкиДанных = "Загрузка классификатора банков";
		ФормаИндикации.КомментарийОбработкиДанных  = "Загружаются данные из классификатора";
		ФормаИндикации.КомментарийЗначения  = "Загружено:";
		ФормаИндикации.МаксимальноеЗначение = 100;
		ФормаИндикации.Открыть();

		ВнешнийЗагрузчикПолучитьФайлИТС(ПолнФайлБИК);
		ФормаИндикации.Закрыть();
	Иначе
		Предупреждение("Не найдена обработка загрузки. Либо не вставлен
						|диск ИТС, либо на диске ИТС нет обработки.");
	КонецЕсли;

КонецПроцедуры // ПолучитьЗагрузчикИТС()

&НаСервере
Процедура ВнешнийЗагрузчикПолучитьФайлИТС(ПолноеИмяФайлаВнешнейОбработки)
	ПараметрыЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
	ПараметрыЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
	ВнешнийЗагрузчик = ВнешниеОбработки.Создать(ПолноеИмяФайлаВнешнейОбработки, Ложь, );
	тДеревоБанков = РеквизитФормыВЗначение("ДеревоБанков", Тип("ДеревоЗначений"));
	ВнешнийЗагрузчик.ПолучитьФайлИТС(тДеревоБанков);
	ЗначениеВРеквизитФормы(тДеревоБанков, "ДеревоБанков");
КонецПроцедуры

