
&НаСервере
Процедура ВТБ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	ВТБ_DevOps.ДобавитьКомандыНаФормуДопОбработок(ЭтаФорма,Элементы);	
КонецПроцедуры


#Область ВТБ_DevOps

&НаКлиенте
Процедура СохранитьНастройкиВТекст(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
    Диалог.Заголовок = "Выберите файл для выгрузки настроек ...";
	Фильтр = НСтр("ru = 'Текст'; en = 'Text'") + "(*.txt)|*.txt";
	Диалог.Фильтр = Фильтр;
    Если Диалог.Выбрать() Тогда
        Путь = Диалог.ПолноеИмяФайла; // выбираем созданный нами файлик для записи в него данных из 1с в формате xml        
        АдресВременногоХранилища = "";
		Текст = Новый ЗаписьТекста(Путь, КодировкаТекста.UTF8, Символы.ПС);
		Текст.Закрыть();
		ПоместитьФайл(АдресВременногоХранилища, Путь,,Ложь,УникальныйИдентификатор); // помещаем наш файл во временное хранилище (для его передачи на сервер)        
		Адрес = ВыгрузитьНастройкиНаСервере(АдресВременногоХранилища,Элементы.Список.ТекущаяСтрока.УникальныйИдентификатор()); //ВыгрузитьВXMLНаСервере(АдресВременногоХранилища);
       
		ДвоичныеДанные_ = ПолучитьИзВременногоХранилища(Адрес);  // по адресу временного хранилища получаем двоичные данные
		ДвоичныеДанные_.Записать(Путь); // перезаписываем наш файлик на клиенте
	КонецЕсли; 
КонецПроцедуры  

&НаКлиенте
Процедура ЗагрузитьНастройкиИЗТекст(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Заголовок = "Выберите файл для выгрузки настроек ...";
	Фильтр = НСтр("ru = 'Текст'; en = 'Text'") + "(*.txt)|*.txt";
	Диалог.Фильтр = Фильтр;
    Если Диалог.Выбрать() Тогда
        Путь = Диалог.ПолноеИмяФайла; // выбираем созданный нами файлик для записи в него данных из 1с в формате xml        
        АдресВременногоХранилища = "";
			
		ПоместитьФайл(АдресВременногоХранилища, Путь,,Ложь, ЭтаФорма.УникальныйИдентификатор); // помещаем наш файл во временное хранилище (для его передачи на сервер)
		
		ИмяФайлаБезРасширения  = СтрЗаменить(Диалог.ПолноеИмяФайла, ".txt", "");
		//ИмпортироватьНастройки(АдресВременногоХранилища,  Прав(ИмяФайлаБезРасширения, 36));
		ИмпортироватьНастройки(АдресВременногоХранилища,  Элементы.Список.ТекущаяСтрока.УникальныйИдентификатор());
	КонецЕсли;
	Оповестить("ОбновитьДанные",Элементы.Список.ТекущаяСтрока,"Загрузчик");

КонецПроцедуры

&НаСервере
Функция ВыгрузитьНастройкиНаСервере(АдресВременногоХранилища,Guid)
//	Сообщить(Guid);
	Возврат ВТБ_DevOps.ВыгрузитьНастройкиНаСервере(АдресВременногоХранилища,Guid)
КонецФункции


&НаСервере
Процедура ИмпортироватьНастройки(АдресВременногоХранилища, GuidОбъекта = "")
	ВТБ_DevOps.ИмпортироватьНастройки(АдресВременногоХранилища, GuidОбъекта,"РУЧНОЙ");
КонецПроцедуры  
#КонецОбласти
