
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ОткрытьВходящийПакетФайловогоШлюза.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьВходящийПакетФайловогоШлюза(Команда)
		
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		ОткрытьФорму("Документ.ВходящийПакетИзФайловогоШлюза.ФормаОбъекта", Новый Структура("Ключ", Объект.ДокументОснование));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
