
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	НачДата = ТекущаяДатаНаСервере();
	Если Не ВвестиДату(НачДата, "Введите любую дату из года расчета", ЧастиДаты.Дата) Тогда
		Возврат;
	КонецЕсли;
	НачДата = НачалоГода(НачДата);
	КонДата = КонецГода(НачДата);
	ТекДата = НачДата;
	ЗаполнитьНаСервере(ТекДата, КонДата);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере(ТекДата, КонДата)
	ЧислоСекундВСутках = ОбщегоНазначенияПовтИсп.СекундВСутках();
	
	НомерДняНеделиПятница = 5;
	Пока ТекДата <= КонДата Цикл
		РегКалендарь = РегистрыСведений.Календарь.СоздатьМенеджерЗаписи();
		РегКалендарь.Период = ТекДата;
		ЭтоВыходной = (ДеньНедели(ТекДата) > НомерДняНеделиПятница);
		РегКалендарь.Значение = ЭтоВыходной;
		РегКалендарь.ЗначениеЦБРФ = ЭтоВыходной;
		ТекДата = ТекДата + ЧислоСекундВСутках;
		РегКалендарь.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущаяДатаНаСервере()
	Возврат ТекущаяДатаСеанса();
КонецФункции

#КонецОбласти