// Загружает ценные бумаги из НРД (файлы SIR) за период в регистр сведений ИсторияИзмененияПараметровЦБ
// Возвращает Истина, если загрузка за весь период завершилась успешно, иначе Ложь
Функция ВыполнитьЗагрузкуЗаПериод(ДатаНач, ДатаКон, КаталогДанныхИсточник = "", КаталогДанныхПриемник = "") Экспорт
	Ошибки = Ложь;
	ДатаЗагрузки = НачалоДня(ДатаНач);
	Пока ДатаЗагрузки <= НачалоДня(ДатаКон) Цикл
		ИмяАрхиваДляПереноса = "";
		ЗагрузкаУспешна = ВыполнитьЗагрузку(ДатаЗагрузки, КаталогДанныхИсточник, КаталогДанныхПриемник, ИмяАрхиваДляПереноса);
		
		Если ЗагрузкаУспешна Тогда
			СоздатьОбновитьВходящий(ДатаЗагрузки, ИмяАрхиваДляПереноса);
		КонецЕсли;
		
		Ошибки = Ошибки ИЛИ НЕ ЗагрузкаУспешна;
		ДатаЗагрузки = ДатаЗагрузки + 24*3600;
	КонецЦикла;
	Возврат НЕ Ошибки;
КонецФункции

// Загружает ценные бумаги из НРД (файлы SIR) за один день в регистр сведений ИсторияИзмененияПараметровЦБ
// В Параметре ИмяАрхиваДляПереноса возвращается имя загруженного файла.
// Возвращает Истина, если загрузка завершилась успешно, иначе Ложь
Функция ВыполнитьЗагрузку(ДатаЗагрузки, КаталогДанныхИсточник, КаталогДанныхПриемник, ИмяАрхиваДляПереноса)
	
	Купоны.Очистить();
	
	// Инициируем переменную (булево), где будем отслеживать наличие ошибок во время загрузки
	Ошибка = Ложь;
	
	Если Не ЗначениеЗаполнено(КаталогДанныхИсточник) Тогда
		// Получим параметры источника данных
		Параметры = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.ФайлЦБНДЦ);
		КаталогДанныхИсточник = Параметры.Папка;
	КонецЕсли; 	
	
	// Формируем маску архива для копирования
	// Пример: SIR-NSD_Standart_A_v1_0_2015_01_20_01_04_10.zip
	МаскаПоискаФайлаТекст		= "SIR-NSD_";
	МаскаПоискаФайлаПоДате		= "_"+Формат(Год(ДатаЗагрузки), "ЧЦ=4; ЧВН=; ЧГ=0")+"_"+Формат(Месяц(ДатаЗагрузки), "ЧЦ=2; ЧВН=; ЧГ=0")+"_"+Формат(День(ДатаЗагрузки), "ЧЦ=2; ЧВН=; ЧГ=0");
	МаскаПоискаФайлаРасширение	= ".zip";
	МаскаПоискаФайлаПолная		= МаскаПоискаФайлаТекст+"*"+МаскаПоискаФайлаПоДате+"*"+МаскаПоискаФайлаРасширение;
	
	НайденныеФайлы	= НайтиФайлы(КаталогДанныхИсточник, МаскаПоискаФайлаПолная);
	
	Если НайденныеФайлы.Количество() > 0 Тогда
		ИмяАрхиваДляПереноса = НайденныеФайлы[0].Имя;
	Иначе
		// Не нашли архив - выводим ошибку и прекращаем
		#Если Клиент Тогда
			Сообщение = Новый СообщениеПользователю();
	    	Сообщение.Текст = "Не найден файл архива за "+Формат(ДатаЗагрузки, "ДЛФ=Д")+" для переноса в локальную папку!";
			Сообщение.Сообщить();
		#Иначе
			ЗаписьЖурналаРегистрации("Загрузка ЦБ НРД", УровеньЖурналаРегистрации.Ошибка, , , "Не найден файл архива для переноса в локальную папку!");
		#КонецЕсли
	 	Возврат Ложь;
	КонецЕсли;
	
	// Формируем список файлов для переноса в локальную папку временных файлов перед обработкой
	СписокФайловДляОбработки = Новый Массив;	
	СписокФайловДляОбработки.Добавить(ИмяАрхиваДляПереноса);
	
	ОписаниеОшибки					= "";
	УдалятьКаталогФайловПриОшибке	= Ложь;
	
	Если НЕ ЗначениеЗаполнено(КаталогДанныхПриемник) Тогда
		КаталогДанныхПриемник			= РаботаСФайлами.СоздатьВременныйКаталог(ОписаниеОшибки);
		УдалятьКаталогФайловПриОшибке	= Истина;
		
		Если КаталогДанныхПриемник = Неопределено Тогда
			#Если Клиент Тогда
				Сообщение = Новый СообщениеПользователю();
		    	Сообщение.Текст = ОписаниеОшибки;
				Сообщение.Сообщить();
			#Иначе
				ЗаписьЖурналаРегистрации("Загрузка ЦБ НРД", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
			#КонецЕсли
		 	Возврат Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	Ошибка = НЕ РаботаСФайлами.УдалитьФайлыВУказаннойПапке(КаталогДанныхПриемник, СписокФайловДляОбработки, ОписаниеОшибки);
	Если Ошибка Тогда
		#Если Клиент Тогда
			Сообщение = Новый СообщениеПользователю();
	    	Сообщение.Текст = ОписаниеОшибки;
			Сообщение.Сообщить();
		#Иначе
			ЗаписьЖурналаРегистрации("Загрузка ЦБ НРД", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		#КонецЕсли
		
		Если УдалятьКаталогФайловПриОшибке Тогда
			РаботаСФайлами.УдалитьКаталог(КаталогДанныхПриемник, ОписаниеОшибки);	
		КонецЕсли;		
	 	Возврат Ложь;
	КонецЕсли; 
	
	Ошибка = НЕ РаботаСФайлами.СкопироватьФайлыВЛокальныйTEMP(КаталогДанныхИсточник, СписокФайловДляОбработки, КаталогДанныхПриемник, ОписаниеОшибки);
	Если Ошибка Тогда
		ОписаниеОшибки = ОписаниеОшибки + " : " + КаталогДанныхПриемник;
		#Если Клиент Тогда
			Сообщение = Новый СообщениеПользователю();
	    	Сообщение.Текст = ОписаниеОшибки;
			Сообщение.Сообщить();
		#Иначе
			ЗаписьЖурналаРегистрации("Загрузка ЦБ НРД", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		#КонецЕсли
		
		Если УдалятьКаталогФайловПриОшибке Тогда
			РаботаСФайлами.УдалитьКаталог(КаталогДанныхПриемник, ОписаниеОшибки);	
		КонецЕсли;		
	 	Возврат Ложь;
	КонецЕсли; 
	
	// Распаковываем скопированный архив и обрабатываем нужные файлы
	Попытка
		АрхивZIP = Новый ЧтениеZipФайла(КаталогДанныхПриемник+"\"+ИмяАрхиваДляПереноса);
		АрхивZIP.ИзвлечьВсе(КаталогДанныхПриемник, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
		
		// Обходим список файлов архива и дополняем список файлов которые потом будем очищать
		АрхивZIPЭлементы = АрхивZIP.Элементы;
		Для сч = 0 По АрхивZIPЭлементы.Количество()-1 Цикл
			СписокФайловДляОбработки.Добавить(АрхивZIPЭлементы.Получить(сч).Имя);
		КонецЦикла; 
		
		АрхивZIP.Закрыть();
	Исключение
		Ошибка = Истина;
		ОписаниеОшибки = "Не удалось извлечь файлы из архива "+КаталогДанныхПриемник+"\"+ИмяАрхиваДляПереноса+" в каталог "+КаталогДанныхПриемник;
	КонецПопытки;
	
	Если Ошибка Тогда
		#Если Клиент Тогда
			Сообщение = Новый СообщениеПользователю();
	    	Сообщение.Текст = ОписаниеОшибки;
			Сообщение.Сообщить();
		#Иначе
			ЗаписьЖурналаРегистрации("Загрузка ЦБ НРД", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		#КонецЕсли
		
		РаботаСФайлами.УдалитьФайлыВУказаннойПапке(КаталогДанныхПриемник, СписокФайловДляОбработки, ОписаниеОшибки);
		
		Если УдалятьКаталогФайловПриОшибке Тогда
			РаботаСФайлами.УдалитьКаталог(КаталогДанныхПриемник, ОписаниеОшибки);	
		КонецЕсли;		
		Возврат Ложь;
	КонецЕсли; 
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Загружаем данные из файлов SIR
	ЗагрузитьСправочныеТаблицы(КаталогДанныхПриемник, МенеджерВременныхТаблиц);
	
	ЗаполнитьИнформациюПоЮридическимЛицам(МенеджерВременныхТаблиц);
	
	// Получим вспомогательные данные из БД, загрузим во временные таблицы
	ЗагрузитьБумагиПринятыеНаОбслуживание(МенеджерВременныхТаблиц, ДатаЗагрузки);
	ЗагрузитьВалюты(МенеджерВременныхТаблиц);
	
	ПараметрыЦБСрезПоследних = РегистрыСведений.ИсторияИзмененияПараметровЦБ.СрезПоследних(ДатаЗагрузки);
	ПараметрыЦБСрезПоследних.Индексы.Добавить("ЦеннаяБумага");
	
	// Список полей из запроса, которые сравниваются и записываются в регистр
	ПоляСравненияАкцийОблигаций = Новый Массив;
	ПоляСравненияАкцийОблигаций.Добавить("ПолноеНаименованиеЭмитента");
	ПоляСравненияАкцийОблигаций.Добавить("КраткоеНаименованиеЭмитента");
	ПоляСравненияАкцийОблигаций.Добавить("ДатаВнесенияВЕГРЮЛ");
	ПоляСравненияАкцийОблигаций.Добавить("ОГРН");
	ПоляСравненияАкцийОблигаций.Добавить("ИНН");
	ПоляСравненияАкцийОблигаций.Добавить("TIN");
	ПоляСравненияАкцийОблигаций.Добавить("РегНомер");
	ПоляСравненияАкцийОблигаций.Добавить("НаименованиеВыпускаЦБ");
	ПоляСравненияАкцийОблигаций.Добавить("ВидЦБ");
	ПоляСравненияАкцийОблигаций.Добавить("ТипЦБ");
	ПоляСравненияАкцийОблигаций.Добавить("ISIN");
	ПоляСравненияАкцийОблигаций.Добавить("CFI");
	ПоляСравненияАкцийОблигаций.Добавить("НомерРегистрации");
	ПоляСравненияАкцийОблигаций.Добавить("ДатаРегистрации");
	ПоляСравненияАкцийОблигаций.Добавить("СуммаНоминала");
	ПоляСравненияАкцийОблигаций.Добавить("ВалютаНоминала");
	ПоляСравненияАкцийОблигаций.Добавить("ОбъемРазмещения");
	
	ПоляСравненияДР = Новый Массив;
	ПоляСравненияДР.Добавить("ПолноеНаименованиеЭмитента");
	ПоляСравненияДР.Добавить("КраткоеНаименованиеЭмитента");
	ПоляСравненияДР.Добавить("ДатаВнесенияВЕГРЮЛ");
	ПоляСравненияДР.Добавить("ОГРН");
	ПоляСравненияДР.Добавить("ИНН");
	ПоляСравненияДР.Добавить("TIN");
	ПоляСравненияДР.Добавить("РегНомер");
	ПоляСравненияДР.Добавить("НаименованиеВыпускаЦБ");
	ПоляСравненияДР.Добавить("ВидЦБ");
	ПоляСравненияДР.Добавить("ТипЦБ");
	ПоляСравненияДР.Добавить("ISIN");
	ПоляСравненияДР.Добавить("CFI");
	
	ПоляСравненияПаев = Новый Массив;
	ПоляСравненияПаев.Добавить("ПолноеНаименованиеЭмитента");
	ПоляСравненияПаев.Добавить("КраткоеНаименованиеЭмитента");
	ПоляСравненияПаев.Добавить("ДатаВнесенияВЕГРЮЛ");
	ПоляСравненияПаев.Добавить("ОГРН");
	ПоляСравненияПаев.Добавить("ИНН");
	ПоляСравненияПаев.Добавить("TIN");
	ПоляСравненияПаев.Добавить("РегНомер");
	ПоляСравненияПаев.Добавить("НаименованиеВыпускаЦБ");
	ПоляСравненияПаев.Добавить("ВидЦБ");
	ПоляСравненияПаев.Добавить("ТипЦБ");
	ПоляСравненияПаев.Добавить("ISIN");
	ПоляСравненияПаев.Добавить("CFI");
	ПоляСравненияПаев.Добавить("НомерРегистрации");
	ПоляСравненияПаев.Добавить("ДатаРегистрации");
	
	ЗагрузитьАкции(КаталогДанныхПриемник, МенеджерВременныхТаблиц, ПараметрыЦБСрезПоследних, ДатаЗагрузки, ПоляСравненияАкцийОблигаций);
	ЗагрузитьОблигации(КаталогДанныхПриемник, МенеджерВременныхТаблиц, ПараметрыЦБСрезПоследних, ДатаЗагрузки, ПоляСравненияАкцийОблигаций);
	ЗагрузитьДепозитарныеРасписки(КаталогДанныхПриемник, МенеджерВременныхТаблиц, ПараметрыЦБСрезПоследних, ДатаЗагрузки, ПоляСравненияДР);
	ЗагрузитьПаи(КаталогДанныхПриемник, МенеджерВременныхТаблиц, ПараметрыЦБСрезПоследних, ДатаЗагрузки, ПоляСравненияПаев);
	
	// Загрузка закончена. Удалим файлы из временного каталога.
	РаботаСФайлами.УдалитьФайлыВУказаннойПапке(КаталогДанныхПриемник, СписокФайловДляОбработки, ОписаниеОшибки);
	Если УдалятьКаталогФайловПриОшибке Тогда
		РаботаСФайлами.УдалитьКаталог(КаталогДанныхПриемник, ОписаниеОшибки);	
	КонецЕсли;
	КаталогДанныхПриемник = "";
	Возврат Истина;
КонецФункции

Процедура СоздатьОбновитьВходящий(ДатаЗагрузки, ИмяАрхиваДляПереноса)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Входящий.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Входящий КАК Входящий
	|ГДЕ
	|	Входящий.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И Входящий.Проведен
	|	И Входящий.ИсходящийНомер ПОДОБНО &ИсходящийНомер
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	Документ.Входящий";
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаЗагрузки));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаЗагрузки));
	Запрос.УстановитьПараметр("ИсходящийНомер", "SIR-NSD_%");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документы.Входящий.СоздатьДокумент();
	КонецЕсли;
	ДокументОбъект.Дата = Дата(Год(ДатаЗагрузки), Месяц(ДатаЗагрузки), День(ДатаЗагрузки), 7, 15, 0);
	ДокументОбъект.ДатаОтправления = ДатаЗагрузки;
	ДокументОбъект.Депонент = Константы.ОрганизацияПоУмолчанию.Получить();
	ДокументОбъект.Исполнитель = Константы.ПользовательРобот.Получить();
	ДокументОбъект.ИсходящийНомер = СтрЗаменить(ИмяАрхиваДляПереноса, ".zip", "");
	ДокументОбъект.Комментарий = "Договор № 2929/ДПИ об оказании услуг по предоставлению информации от 13/11/2015";
	ДокументОбъект.ЛицоНаправившееДокумент = "НКО АО НРД";
	ДокументОбъект.НаименованиеДокументаИлиКомплекта = "Обновление справочника ценных бумаг";
	ДокументОбъект.РучнойВвод = Ложь;
	ДокументОбъект.ЦеннаяБумага = Справочники.ЦенныеБумаги.ПустаяСсылка();
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

Процедура ЗагрузитьСправочныеТаблицы(КаталогДанныхПриемник, МенеджерВременныхТаблиц)
	СтруктураСМассивом = ПолучитьСтруктуруСМассивомИзФайла(КаталогДанныхПриемник + "share_categories.xml");
	ЗагрузитьКатегорииАкцийИзМассиваВоВременнуюТаблицу(СтруктураСМассивом.Массив, МенеджерВременныхТаблиц);
		
	СтруктураСМассивом = ПолучитьСтруктуруСМассивомИзФайла(КаталогДанныхПриемник + "companies.xml");
	ЗагрузитьЭмитентыИзМассиваВоВременнуюТаблицу(СтруктураСМассивом.Массив, МенеджерВременныхТаблиц);	
КонецПроцедуры

Процедура ЗаполнитьИнформациюПоЮридическимЛицам(МенеджерВременныхТаблиц)
	
	ВидОбъекта = Перечисления.ВидыОбъектовКонтактнойИнформации.ЮридическиеЛица;
	ТипАдрес = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ТипТелефон = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ТипАдресЭлектроннойПочты = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапросаПоЮридическимЛицам();
    Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("ТипАдрес", ТипАдрес);
	Запрос.УстановитьПараметр("ТипТелефон", ТипТелефон);
	Запрос.УстановитьПараметр("ТипАдресЭлектроннойПочты", ТипАдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ВидЮридическийАдрес", КонтактнаяИнформация.ВидыКонтактнойИнформации(ВидОбъекта, ТипАдрес, "Юридический")[0]);
	Запрос.УстановитьПараметр("ВидФактическийАдрес", КонтактнаяИнформация.ВидыКонтактнойИнформации(ВидОбъекта, ТипАдрес, "Фактический")[0]);
    Запрос.УстановитьПараметр("ВидТелефон", КонтактнаяИнформация.ВидыКонтактнойИнформации(ВидОбъекта, ТипТелефон, "Телефон")[0]);
	Запрос.УстановитьПараметр("ВидФакс", КонтактнаяИнформация.ВидыКонтактнойИнформации(ВидОбъекта, ТипТелефон, "Факс")[0]);
	Запрос.УстановитьПараметр("ВидАдресЭлектроннойПочты", КонтактнаяИнформация.ВидыКонтактнойИнформации(ВидОбъекта, ТипАдресЭлектроннойПочты, "mail")[0]);
	
	Результат = Запрос.ВыполнитьПакет();
 	ОбновитьСправочникЮридическиеЛица(Результат[1]);	
	СоздатьЗаписьКонтактнаяИнформация(Результат[3]);
	
КонецПроцедуры

Функция ТекстЗапросаПоЮридическимЛицам()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЮридическиеЛица.Ссылка КАК Ссылка,
	|	ЮридическиеЛица.ДатаВнесенияВЕГРЮЛ КАК ДатаВнесенияВЕГРЮЛ,
	|	РегистраторыЦенныхБумаг.РегистраторЦБ КАК РегистраторЦБ,
	|	ЕСТЬNULL(Эмитенты.egrul_date, ДАТАВРЕМЯ(1, 1, 1)) КАК egrul_date,
	|	ЕСТЬNULL(Эмитенты.address, """") КАК address,
	|	ЕСТЬNULL(Эмитенты.post_address, """") КАК post_address,
	|	ЕСТЬNULL(Эмитенты.phone, """") КАК phone,
	|	ЕСТЬNULL(Эмитенты.fax, """") КАК fax,
	|	ЕСТЬNULL(Эмитенты.e_mail, """") КАК e_mail
	|ПОМЕСТИТЬ втЮридическиеЛица
	|ИЗ
	|	Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ЮридическиеЛица.Ссылка = КодыЗагрузки.Владелец
	|			И НЕ КодыЗагрузки.ПометкаУдаления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЭмитенты КАК Эмитенты
	|		ПО (ЮридическиеЛица.ИНН = Эмитенты.inn И ЮридическиеЛица.КПП = Эмитенты.kpp 
	|			И ЮридическиеЛица.ИНН <> """" И ЮридическиеЛица.КПП <> """")
	|				ИЛИ КодыЗагрузки.Код = Эмитенты.cmp_code_nsd
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистраторыЦенныхБумаг КАК РегистраторыЦенныхБумаг
	|		ПО ЮридическиеЛица.Ссылка = РегистраторыЦенныхБумаг.РегистраторЦБ 
	|ГДЕ
	|	НЕ ЮридическиеЛица.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЮридическиеЛица.Ссылка	
	|;
	|
	|///////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЮридическиеЛица.Ссылка КАК ЮридическоеЛицо,
	|	ЮридическиеЛица.egrul_date КАК ДатаВнесенияВЕГРЮЛ
	|ИЗ
	|	втЮридическиеЛица КАК ЮридическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ЮридическиеЛица.Ссылка = Контрагенты.ЮридическиеФизическиеЛица
	|			И Контрагенты.Родитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.Эмитенты)
	|			И НЕ Контрагенты.ПометкаУдаления 
	|ГДЕ
	|	ЮридическиеЛица.ДатаВнесенияВЕГРЮЛ <> ЮридическиеЛица.egrul_date
	|	И ЮридическиеЛица.egrul_date <> ДАТАВРЕМЯ(1, 1, 1)
	|	И Контрагенты.Ссылка ЕСТЬ NULL
	|;
	|
	|///////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект КАК Объект,
	|	КонтактнаяИнформация.Тип КАК Тип,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Представление КАК Представление
	|ПОМЕСТИТЬ втКонтактнаяИнформация
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			&ДатаКон,
	|			Объект В (ВЫБРАТЬ Ссылка ИЗ втЮридическиеЛица ГДЕ РегистраторЦБ IS NOT NULL)
	|				И Тип В (&ТипАдрес, &ТипТелефон, &ТипАдресЭлектроннойПочты)
	|				И Вид В (&ВидЮридическийАдрес, &ВидФактическийАдрес, &ВидТелефон, &ВидФакс, &ВидАдресЭлектроннойПочты)) КАК КонтактнаяИнформация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид	
	|;
	|
	|///////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЮридическиеЛица.Ссылка КАК Объект,
	|	&ТипАдрес КАК Тип,
	|	&ВидЮридическийАдрес КАК Вид,
	|	ЮридическиеЛица.address КАК Представление
	|ИЗ
	|	втЮридическиеЛица КАК ЮридическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ЮридическиеЛица.Ссылка = КонтактнаяИнформация.Объект
	|			И КонтактнаяИнформация.Тип = &ТипАдрес
	|			И КонтактнаяИнформация.Вид = &ВидЮридическийАдрес
	|ГДЕ
	|	ЮридическиеЛица.РегистраторЦБ IS NOT NULL
	|	И ЮридическиеЛица.address <> ЕСТЬNULL(КонтактнаяИнформация.Представление, """")
	|	И ЮридическиеЛица.address <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЮридическиеЛица.Ссылка КАК Объект,
	|	&ТипАдрес КАК Тип,
	|	&ВидФактическийАдрес КАК Вид,
	|	ЮридическиеЛица.post_address КАК Представление
	|ИЗ
	|	втЮридическиеЛица КАК ЮридическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ЮридическиеЛица.Ссылка = КонтактнаяИнформация.Объект
	|			И КонтактнаяИнформация.Тип = &ТипАдрес
	|			И КонтактнаяИнформация.Вид = &ВидФактическийАдрес
	|ГДЕ
	|	ЮридическиеЛица.РегистраторЦБ IS NOT NULL
	|	И ЮридическиеЛица.post_address <> ЕСТЬNULL(КонтактнаяИнформация.Представление, """")
	|	И ЮридическиеЛица.post_address <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЮридическиеЛица.Ссылка КАК Объект,
	|	&ТипТелефон КАК Тип,
	|	&ВидТелефон КАК Вид,
	|	ЮридическиеЛица.phone КАК Представление
	|ИЗ
	|	втЮридическиеЛица КАК ЮридическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ЮридическиеЛица.Ссылка = КонтактнаяИнформация.Объект
	|			И КонтактнаяИнформация.Тип = &ТипТелефон
	|			И КонтактнаяИнформация.Вид = &ВидТелефон
	|ГДЕ
	|	ЮридическиеЛица.РегистраторЦБ IS NOT NULL
	|	И ЮридическиеЛица.phone <> ЕСТЬNULL(КонтактнаяИнформация.Представление, """")
	|	И ЮридическиеЛица.phone <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЮридическиеЛица.Ссылка КАК Объект,
	|	&ТипТелефон КАК Тип,
	|	&ВидФакс КАК Вид,
	|	ЮридическиеЛица.fax КАК Представление
	|ИЗ
	|	втЮридическиеЛица КАК ЮридическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ЮридическиеЛица.Ссылка = КонтактнаяИнформация.Объект
	|			И КонтактнаяИнформация.Тип = &ТипТелефон
	|			И КонтактнаяИнформация.Вид = &ВидФакс
	|ГДЕ
	|	ЮридическиеЛица.РегистраторЦБ IS NOT NULL
	|	И ЮридическиеЛица.fax <> ЕСТЬNULL(КонтактнаяИнформация.Представление, """")
	|	И ЮридическиеЛица.fax <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЮридическиеЛица.Ссылка КАК Объект,
	|	&ТипАдресЭлектроннойПочты КАК Тип,
	|	&ВидАдресЭлектроннойПочты КАК Вид,
	|	ЮридическиеЛица.e_mail КАК Представление
	|ИЗ
	|	втЮридическиеЛица КАК ЮридическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ЮридическиеЛица.Ссылка = КонтактнаяИнформация.Объект
	|			И КонтактнаяИнформация.Тип = &ТипАдресЭлектроннойПочты
	|			И КонтактнаяИнформация.Вид = &ВидАдресЭлектроннойПочты
	|ГДЕ
	|	ЮридическиеЛица.РегистраторЦБ IS NOT NULL
	|	И ЮридическиеЛица.e_mail <> ЕСТЬNULL(КонтактнаяИнформация.Представление, """")
	|	И ЮридическиеЛица.e_mail <> """"";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ОбновитьСправочникЮридическиеЛица(РезультатЗапроса)
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЮридическоеЛицо = Выборка.ЮридическоеЛицо.ПолучитьОбъект();
		ЮридическоеЛицо.ДатаВнесенияВЕГРЮЛ = Выборка.ДатаВнесенияВЕГРЮЛ;
		ЮридическоеЛицо.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьЗаписьКонтактнаяИнформация(РезультатЗапроса)
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Вид) Тогда
			МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ДатаКон;
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
				МенеджерЗаписи.Поле1 = Выборка.Объект.Страна;
			КонецЕсли;		
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьАкции(КаталогДанныхПриемник, МенеджерВременныхТаблиц, ПараметрыЦБСрезПоследних, ДатаЗагрузки,
	ПоляСравнения)
	
	СтруктураСМассивом = ПолучитьСтруктуруСМассивомИзФайла(КаталогДанныхПриемник + "shares.xml");
	ЗагрузитьАкцииИзСтруктурыСМассивомВоВременнуюТаблицу(СтруктураСМассивом, МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Акции.code_nsd									КАК КодНСД,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.full_name, """"))	КАК ПолноеНаименованиеЭмитента,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.short_name, """"))	КАК КраткоеНаименованиеЭмитента,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.egrul_date, ДАТАВРЕМЯ(1,1,1))) КАК ДатаВнесенияВЕГРЮЛ,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.ogrn, """")) 		КАК ОГРН,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.inn, """")) 			КАК ИНН,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.tin, """")) 			КАК TIN,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.state_reg_num, """")) КАК РегНомер,
	|	МАКСИМУМ(ЕСТЬNULL(Акции.issue_name_full, """"))	КАК НаименованиеВыпускаЦБ,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА КатегорииАкций.share_category_name = ""обыкновенные""
	|			ТОГДА &ВидАкцийОбыкновенная
	|		КОГДА КатегорииАкций.share_category_name = ""привилегированные""
	|			ТОГДА &ВидАкцийПривилегированная
	|		ИНАЧЕ &ВидАкцийПоУмолчанию
	|	КОНЕЦ)											КАК ВидЦБ,
	|	МАКСИМУМ(ЕСТЬNULL(Акции.isin, """"))			КАК ISIN,
	|	МАКСИМУМ(ЕСТЬNULL(Акции.cfi, """"))				КАК CFI,
	|	МАКСИМУМ(ЕСТЬNULL(Акции.state_reg_number, """"))			КАК НомерРегистрации,
	|	МАКСИМУМ(ЕСТЬNULL(Акции.state_reg_date, ДАТАВРЕМЯ(1,1,1)))	КАК ДатаРегистрации,
	|	МАКСИМУМ(ЕСТЬNULL(Акции.face_value, 0))						КАК СуммаНоминала,
	|	МАКСИМУМ(ЕСТЬNULL(Валюты.Валюта, &ВалютаПоУмолчанию))		КАК ВалютаНоминала,
	|	МАКСИМУМ(ЕСТЬNULL(Акции.issued_size, 0))					КАК ОбъемРазмещения
	|ПОМЕСТИТЬ втАкцииПолныеДанные
	|ИЗ
	|	втАкции КАК Акции
	|	ЛЕВОЕ СОЕДИНЕНИЕ втЭмитенты КАК Эмитенты
	|	ПО
	|		Акции.issuer = Эмитенты.cmp_code_nsd
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКатегорииАкций КАК КатегорииАкций
	|	ПО
	|		Акции.share_category_id = КатегорииАкций.share_category_id
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ втВалюты КАК Валюты
	|	ПО
	|		Акции.currency_code = Валюты.Наименование
	|
	|СГРУППИРОВАТЬ ПО
	|	Акции.code_nsd
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодНСД
	|;
	|
	|///////////////////////////////////////////////////////////////
	|// Оставляем по одному коду загрузки (КодНСД) на ЦБ
	|ВЫБРАТЬ
	|	ЦенныеБумаги.ЦБ							КАК ЦБ,
	|	МАКСИМУМ(ЕСТЬNULL(Акции.КодНСД, """"))	КАК КодНСД
	|ПОМЕСТИТЬ втАкцииСКодомЗагрузки
	|ИЗ
	|	втБумагиПринятыеНаОбслуживание КАК ЦенныеБумаги
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАкцииПолныеДанные КАК Акции
	|	ПО
	|		ЦенныеБумаги.КодЗагрузкиНДЦ = Акции.КодНСД
	|ГДЕ
	|	ЦенныеБумаги.ТипЦБ = &ТипЦБАкция
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумаги.ЦБ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодНСД
	|;
	|
	|///////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумаги.ЦБ						КАК ЦеннаяБумага,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).Код				КАК ЦеннаяБумагаКод,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).Наименование		КАК ЦеннаяБумагаНаименование,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).ISIN				КАК ЦеннаяБумагаISIN,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).ТипЦБ				КАК ТипЦБ,
	|	Акции.ПолноеНаименованиеЭмитента	КАК ПолноеНаименованиеЭмитента,
	|	Акции.КраткоеНаименованиеЭмитента	КАК КраткоеНаименованиеЭмитента,
	|	Акции.ДатаВнесенияВЕГРЮЛ			КАК ДатаВнесенияВЕГРЮЛ,
	|	Акции.ОГРН 							КАК ОГРН,
	|	Акции.ИНН 							КАК ИНН,
	|	Акции.TIN							КАК TIN,
	|	Акции.РегНомер 						КАК РегНомер,
	|	Акции.НаименованиеВыпускаЦБ			КАК НаименованиеВыпускаЦБ,
	|	Акции.ВидЦБ							КАК ВидЦБ,
	|	Акции.ISIN							КАК ISIN,
	|	Акции.CFI							КАК CFI,
	|	Акции.НомерРегистрации				КАК НомерРегистрации,
	|	Акции.ДатаРегистрации				КАК ДатаРегистрации,
	|	Акции.СуммаНоминала					КАК СуммаНоминала,
	|	Акции.ВалютаНоминала				КАК ВалютаНоминала,
	|	Акции.ОбъемРазмещения				КАК ОбъемРазмещения,
	|	ВЫБОР
	|		КОГДА Акции.ПолноеНаименованиеЭмитента ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОтсутствуетВSIR
	|
	|ИЗ
	|	втАкцииСКодомЗагрузки КАК ЦенныеБумаги
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАкцииПолныеДанные КАК Акции
	|	ПО
	|		ЦенныеБумаги.КодНСД = Акции.КодНСД
	|";
	Запрос.УстановитьПараметр("ВидАкцийОбыкновенная", Перечисления.ВидыАкций.Обыкновенная);
	Запрос.УстановитьПараметр("ВидАкцийПривилегированная", Перечисления.ВидыАкций.Привилегированная);
	Запрос.УстановитьПараметр("ВидАкцийПоУмолчанию", Перечисления.ВидыАкций.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВалютаПоУмолчанию", Справочники.Валюты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипЦБАкция", Перечисления.ТипыЦБ.Акция);
	
	РезультатЗапроса = Запрос.Выполнить();
	ОбновитьРегистрПараметрыЦБ(РезультатЗапроса, ПараметрыЦБСрезПоследних, ДатаЗагрузки, ПоляСравнения);
КонецПроцедуры

Процедура ЗагрузитьБумагиПринятыеНаОбслуживание(МенеджерВременныхТаблиц, ДатаЗагрузки)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КодыЗагрузки.Владелец КАК ЦеннаяБумага,
	|	КодыЗагрузки.Код КАК КодНДЦ
	|ПОМЕСТИТЬ втДействующиеКодыЗагрузкиНДЦдляЦБ
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	КодыЗагрузки.Владелец ССЫЛКА Справочник.ЦенныеБумаги
	|	И КодыЗагрузки.Биржа ССЫЛКА Справочник.КлассификаторыЗагрузки
	|	И ВЫРАЗИТЬ(КодыЗагрузки.Биржа КАК Справочник.КлассификаторыЗагрузки).Код = &КодНДЦ
	|	И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1,1,1)
	|		ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ДатаЗагрузки)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////
	|// Для одной ЦБ может быть несколько действующих кодов НДЦ
	|ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка КАК ЦБ,
	|	ЦенныеБумаги.ТипЦБ КАК ТипЦБ,
	|	ЕСТЬNULL(КодыЗагрузки.КодНДЦ, """") КАК КодЗагрузкиНДЦ
	|ПОМЕСТИТЬ втБумагиПринятыеНаОбслуживание
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|	ЛЕВОЕ СОЕДИНЕНИЕ втДействующиеКодыЗагрузкиНДЦдляЦБ КАК КодыЗагрузки
	|	ПО
	|		ЦенныеБумаги.Ссылка = КодыЗагрузки.ЦеннаяБумага
	|
	|ГДЕ
	|	НЕ ЦенныеБумаги.ПометкаУдаления
	|	И ЦенныеБумаги.ДатаПриемаНаОбслуживание <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ЦенныеБумаги.ДатаПриемаНаОбслуживание <= &ДатаЗагрузки
	|	И (ЦенныеБумаги.ДатаСнятияСОбслуживания = ДАТАВРЕМЯ(1, 1, 1)
	|		ИЛИ ЦенныеБумаги.ДатаСнятияСОбслуживания >= &ДатаЗагрузки)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипЦБ,
	|	КодЗагрузкиНДЦ
	|;
	|УНИЧТОЖИТЬ втДействующиеКодыЗагрузкиНДЦдляЦБ;
	|";
	Запрос.УстановитьПараметр("КодНДЦ", "НДЦ");
	Запрос.УстановитьПараметр("ДатаЗагрузки", ДатаЗагрузки);
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗагрузитьОблигации(КаталогДанныхПриемник, МенеджерВременныхТаблиц, ПараметрыЦБСрезПоследних, ДатаЗагрузки,
	ПоляСравнения)
	
	СтруктураСМассивом = ПолучитьСтруктуруСМассивомИзФайла(КаталогДанныхПриемник + "bonds.xml");
	ЗагрузитьОблигацииИзСтруктурыСМассивомВоВременнуюТаблицу(СтруктураСМассивом, МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Облигации.code_nsd								КАК КодНСД,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.full_name, """"))	КАК ПолноеНаименованиеЭмитента,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.short_name, """"))	КАК КраткоеНаименованиеЭмитента,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.egrul_date, ДАТАВРЕМЯ(1,1,1))) КАК ДатаВнесенияВЕГРЮЛ,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.ogrn, """")) 		КАК ОГРН,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.inn, """")) 			КАК ИНН,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.tin, """")) 			КАК TIN,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.state_reg_num, """")) КАК РегНомер,
	|	МАКСИМУМ(ЕСТЬNULL(Облигации.issue_name_full, """"))	КАК НаименованиеВыпускаЦБ,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Облигации.sec_type_br_code В (&КодыГосударственныхМуниципальныхОблигаций)
	|			ТОГДА &ВидОблигацииГосударственная
	|		КОГДА Облигации.sec_type_br_code В (&КодыКорпоративныхОблигаций)
	|			ТОГДА &ВидОблигацииКорпоративная
	|		ИНАЧЕ &ВидОблигацииПоУмолчанию
	|	КОНЕЦ)											КАК ВидЦБ,
	|	МАКСИМУМ(ЕСТЬNULL(Облигации.isin, """"))		КАК ISIN,
	|	МАКСИМУМ(ЕСТЬNULL(Облигации.cfi, """"))			КАК CFI,
	|	МАКСИМУМ(ЕСТЬNULL(Облигации.state_reg_number, """"))			КАК НомерРегистрации,
	|	МАКСИМУМ(ЕСТЬNULL(Облигации.state_reg_date, ДАТАВРЕМЯ(1,1,1)))	КАК ДатаРегистрации,
	|	МАКСИМУМ(ЕСТЬNULL(Облигации.face_value, 0))						КАК СуммаНоминала,
	|	МАКСИМУМ(ЕСТЬNULL(Валюты.Валюта, &ВалютаПоУмолчанию))			КАК ВалютаНоминала,
	|	МАКСИМУМ(ЕСТЬNULL(Облигации.issued_size, 0))					КАК ОбъемРазмещения
	|ПОМЕСТИТЬ втОблигацииПолныеДанные
	|ИЗ
	|	втОблигации КАК Облигации
	|	ЛЕВОЕ СОЕДИНЕНИЕ втЭмитенты КАК Эмитенты
	|	ПО
	|		Облигации.issuer = Эмитенты.cmp_code_nsd
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ втВалюты КАК Валюты
	|	ПО
	|		Облигации.currency_code = Валюты.Наименование
	|
	|СГРУППИРОВАТЬ ПО
	|	Облигации.code_nsd
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодНСД
	|;
	|
	|///////////////////////////////////////////////////////////////
	|// Оставляем по одному коду загрузки (КодНСД) на ЦБ
	|ВЫБРАТЬ
	|	ЦенныеБумаги.ЦБ								КАК ЦБ,
	|	МАКСИМУМ(ЕСТЬNULL(Облигации.КодНСД, """"))	КАК КодНСД
	|ПОМЕСТИТЬ втОблигацииСКодомЗагрузки
	|ИЗ
	|	втБумагиПринятыеНаОбслуживание КАК ЦенныеБумаги
	|	ЛЕВОЕ СОЕДИНЕНИЕ втОблигацииПолныеДанные КАК Облигации
	|	ПО
	|		ЦенныеБумаги.КодЗагрузкиНДЦ = Облигации.КодНСД
	|ГДЕ
	|	ЦенныеБумаги.ТипЦБ = &ТипЦБОблигация
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумаги.ЦБ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодНСД
	|;
	|
	|///////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумаги.ЦБ							КАК ЦеннаяБумага,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).Код				КАК ЦеннаяБумагаКод,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).Наименование		КАК ЦеннаяБумагаНаименование,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).ISIN				КАК ЦеннаяБумагаISIN,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).ТипЦБ				КАК ТипЦБ,
	|	Облигации.ПолноеНаименованиеЭмитента	КАК ПолноеНаименованиеЭмитента,
	|	Облигации.КраткоеНаименованиеЭмитента	КАК КраткоеНаименованиеЭмитента,
	|	Облигации.ДатаВнесенияВЕГРЮЛ			КАК ДатаВнесенияВЕГРЮЛ,
	|	Облигации.ОГРН 							КАК ОГРН,
	|	Облигации.ИНН 							КАК ИНН,
	|	Облигации.TIN							КАК TIN,
	|	Облигации.РегНомер 						КАК РегНомер,
	|	Облигации.НаименованиеВыпускаЦБ			КАК НаименованиеВыпускаЦБ,
	|	Облигации.ВидЦБ							КАК ВидЦБ,
	|	Облигации.ISIN							КАК ISIN,
	|	Облигации.CFI							КАК CFI,
	|	Облигации.НомерРегистрации				КАК НомерРегистрации,
	|	Облигации.ДатаРегистрации				КАК ДатаРегистрации,
	|	Облигации.СуммаНоминала					КАК СуммаНоминала,
	|	Облигации.ВалютаНоминала				КАК ВалютаНоминала,
	|	Облигации.ОбъемРазмещения				КАК ОбъемРазмещения,
	|	ВЫБОР
	|		КОГДА Облигации.ПолноеНаименованиеЭмитента ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОтсутствуетВSIR
	|
	|ИЗ
	|	втОблигацииСКодомЗагрузки КАК ЦенныеБумаги
	|	ЛЕВОЕ СОЕДИНЕНИЕ втОблигацииПолныеДанные КАК Облигации
	|	ПО
	|		ЦенныеБумаги.КодНСД = Облигации.КодНСД
	|";
	
	КодыГосОблигаций = Новый Массив;
	КодыГосОблигаций.Добавить("BON1");	// Облигации федеральных органов исполнительной власти и облигации Банка России
	КодыГосОблигаций.Добавить("BON2");	// Облигации органов исполнительной власти субъектов Российской Федерации и муниципальных образований
	Запрос.УстановитьПараметр("КодыГосударственныхМуниципальныхОблигаций", КодыГосОблигаций);
	Запрос.УстановитьПараметр("ВидОблигацииГосударственная", Перечисления.ВидыОблигаций.Государственная);
	
	КодыКорпОблигаций = Новый Массив;
	КодыКорпОблигаций.Добавить("BON3");	// Облигации кредитных организаций-резидентов
	КодыКорпОблигаций.Добавить("BON4");	// Облигации прочих резидентов
	КодыКорпОблигаций.Добавить("BON5");	// Облигации иностранных государств и облигации иностранных центральных банков
	КодыКорпОблигаций.Добавить("BON6");	// Облигации банков-нерезидентов
	КодыКорпОблигаций.Добавить("BON7");	// Облигации прочих нерезидентов
	Запрос.УстановитьПараметр("КодыКорпоративныхОблигаций", КодыКорпОблигаций);
	Запрос.УстановитьПараметр("ВидОблигацииКорпоративная", Перечисления.ВидыОблигаций.Корпоративная);
	
	Запрос.УстановитьПараметр("ВидОблигацииПоУмолчанию", Перечисления.ВидыОблигаций.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВалютаПоУмолчанию", Справочники.Валюты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипЦБОблигация", Перечисления.ТипыЦБ.Облигация);
	
	ОбновитьРегистрПараметрыЦБ(Запрос.Выполнить(), ПараметрыЦБСрезПоследних, ДатаЗагрузки, ПоляСравнения);
КонецПроцедуры

Процедура ОбновитьРегистрПараметрыЦБ(РезультатЗапроса, ПараметрыЦБСрезПоследних, ДатаЗагрузки, ПоляСравнения)
	СписокСвойств = "";	// Для заполнения записи регистра из выборки запроса
	Для Каждого Элемент из ПоляСравнения Цикл
		СписокСвойств = СписокСвойств + ?(ЗначениеЗаполнено(СписокСвойств), ",", "") + Элемент;
	КонецЦикла;
	
	ОписаниеОшибки = "";
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОтсутствуетВSIR Тогда
		    ОписаниеОшибки = ОписаниеОшибки
				+ "" + Выборка.ТипЦБ
				+ " Код: " + Выборка.ЦеннаяБумагаКод
				+ " ISIN: " + Выборка.ЦеннаяБумагаISIN
				+ " Наименование: " + Выборка.ЦеннаяБумагаНаименование
				+ Символы.ПС;
			Продолжить;
		КонецЕсли;
		
		НайденнаяСтрока = ПараметрыЦБСрезПоследних.Найти(Выборка.ЦеннаяБумага, "ЦеннаяБумага");
		Если НайденнаяСтрока = Неопределено ИЛИ НЕ ВсеЗначенияРавны(Выборка, НайденнаяСтрока, ПоляСравнения) Тогда
			НаборЗаписей = РегистрыСведений.ИсторияИзмененияПараметровЦБ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЦеннаяБумага.Установить(Выборка.ЦеннаяБумага);
			НаборЗаписей.Отбор.Период.Установить(ДатаЗагрузки);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ЦеннаяБумага = Выборка.ЦеннаяБумага;
				НоваяЗапись.Период = ДатаЗагрузки;
			Иначе
				НоваяЗапись = НаборЗаписей[0];
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка, СписокСвойств);
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОписаниеОшибки = "Ценные бумаги на " + Формат(ДатаЗагрузки, "ДЛФ=Д")
				+ " приняты на обслуживание в базе Депозитария, но отсутствуют в SIR:" + Символы.ПС
				+ ОписаниеОшибки;
		#Если Клиент Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = ОписаниеОшибки;
   			Сообщение.Сообщить();
		#Иначе
			ЗаписьЖурналаРегистрации("Загрузка ЦБ НРД", УровеньЖурналаРегистрации.Предупреждение,,, ОписаниеОшибки);
		#КонецЕсли
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузитьДепозитарныеРасписки(КаталогДанныхПриемник, МенеджерВременныхТаблиц, ПараметрыЦБСрезПоследних,
	ДатаЗагрузки, ПоляСравнения)
	
	СтруктураСМассивом = ПолучитьСтруктуруСМассивомИзФайла(КаталогДанныхПриемник + "dep_receipts.xml");
	ЗагрузитьДепозитарныеРаспискиИзСтруктурыСМассивомВоВременнуюТаблицу(СтруктураСМассивом, МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДР.code_nsd										КАК КодНСД,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.full_name, """"))	КАК ПолноеНаименованиеЭмитента,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.short_name, """"))	КАК КраткоеНаименованиеЭмитента,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.egrul_date, ДАТАВРЕМЯ(1,1,1))) КАК ДатаВнесенияВЕГРЮЛ,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.ogrn, """")) 		КАК ОГРН,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.inn, """")) 			КАК ИНН,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.tin, """")) 			КАК TIN,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.state_reg_num, """")) КАК РегНомер,
	|	МАКСИМУМ(ЕСТЬNULL(ДР.dr_name_full, """"))		КАК НаименованиеВыпускаЦБ,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДР.dr_category_mn = &КодАДР
	|			ТОГДА &ВидДРАмериканскаяДепозитарнаяРасписка
	|		КОГДА ДР.dr_category_mn = &КодГДР
	|			ТОГДА &ВидДРГлобальнаяДепозитарнаяРасписка
	|		КОГДА ДР.dr_category_mn = &КодЕДР
	|			ТОГДА &ВидДРЕвропейскаяДепозитарнаяРасписка
	|		КОГДА ДР.dr_category_mn = &КодРДР
	|			ТОГДА &ВидДРРоссийскаяДепозитарнаяРасписка
	|		ИНАЧЕ &ВидДРПоУмолчанию
	|	КОНЕЦ)									КАК ВидЦБ,
	|	МАКСИМУМ(ЕСТЬNULL(ДР.isin, """"))		КАК ISIN,
	|	МАКСИМУМ(ЕСТЬNULL(ДР.cfi, """"))		КАК CFI
	|ПОМЕСТИТЬ втДепозитарныеРаспискиПолныеДанные
	|ИЗ
	|	втДепозитарныеРасписки КАК ДР
	|	ЛЕВОЕ СОЕДИНЕНИЕ втЭмитенты КАК Эмитенты
	|	ПО
	|		ДР.dr_issuer = Эмитенты.cmp_code_nsd
	|
	|СГРУППИРОВАТЬ ПО
	|	ДР.code_nsd
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодНСД
	|;
	|
	|///////////////////////////////////////////////////////////////
	|// Оставляем по одному коду загрузки (КодНСД) на ЦБ
	|ВЫБРАТЬ
	|	ЦенныеБумаги.ЦБ							КАК ЦБ,
	|	МАКСИМУМ(ЕСТЬNULL(ДР.КодНСД, """"))	КАК КодНСД
	|ПОМЕСТИТЬ втДРСКодомЗагрузки
	|ИЗ
	|	втБумагиПринятыеНаОбслуживание КАК ЦенныеБумаги
	|	ЛЕВОЕ СОЕДИНЕНИЕ втДепозитарныеРаспискиПолныеДанные КАК ДР
	|	ПО
	|		ЦенныеБумаги.КодЗагрузкиНДЦ = ДР.КодНСД
	|ГДЕ
	|	ЦенныеБумаги.ТипЦБ = &ТипЦБДепозитарнаяРасписка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумаги.ЦБ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодНСД
	|;
	|
	|///////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумаги.ЦБ					КАК ЦеннаяБумага,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).Код				КАК ЦеннаяБумагаКод,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).Наименование		КАК ЦеннаяБумагаНаименование,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).ISIN				КАК ЦеннаяБумагаISIN,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).ТипЦБ				КАК ТипЦБ,
	|	ДР.ПолноеНаименованиеЭмитента	КАК ПолноеНаименованиеЭмитента,
	|	ДР.КраткоеНаименованиеЭмитента	КАК КраткоеНаименованиеЭмитента,
	|	ДР.ДатаВнесенияВЕГРЮЛ			КАК ДатаВнесенияВЕГРЮЛ,
	|	ДР.ОГРН 						КАК ОГРН,
	|	ДР.ИНН 							КАК ИНН,
	|	ДР.TIN							КАК TIN,
	|	ДР.РегНомер 					КАК РегНомер,
	|	ДР.НаименованиеВыпускаЦБ		КАК НаименованиеВыпускаЦБ,
	|	ДР.ВидЦБ						КАК ВидЦБ,
	|	ДР.ISIN							КАК ISIN,
	|	ДР.CFI							КАК CFI,
	|	ВЫБОР
	|		КОГДА ДР.ПолноеНаименованиеЭмитента ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОтсутствуетВSIR
	|
	|ИЗ
	|	втДРСКодомЗагрузки КАК ЦенныеБумаги
	|	ЛЕВОЕ СОЕДИНЕНИЕ втДепозитарныеРаспискиПолныеДанные КАК ДР
	|	ПО
	|		ЦенныеБумаги.КодНСД = ДР.КодНСД
	|";
	
	Запрос.УстановитьПараметр("КодАДР", "ADR");
	Запрос.УстановитьПараметр("ВидДРАмериканскаяДепозитарнаяРасписка", Перечисления.ВидыДепозитарныхРасписок.АмериканскаяДепозитарнаяРасписка);
	Запрос.УстановитьПараметр("КодГДР", "GDR");
	Запрос.УстановитьПараметр("ВидДРГлобальнаяДепозитарнаяРасписка", Перечисления.ВидыДепозитарныхРасписок.ГлобальнаяДепозитарнаяРасписка);
	Запрос.УстановитьПараметр("КодЕДР", "EDR");
	Запрос.УстановитьПараметр("ВидДРЕвропейскаяДепозитарнаяРасписка", Перечисления.ВидыДепозитарныхРасписок.ЕвропейскаяДепозитарнаяРасписка);
	Запрос.УстановитьПараметр("КодРДР", "RDR");
	Запрос.УстановитьПараметр("ВидДРРоссийскаяДепозитарнаяРасписка", Перечисления.ВидыДепозитарныхРасписок.РоссийскаяДепозитарнаяРасписка);
	Запрос.УстановитьПараметр("ВидДРПоУмолчанию", Перечисления.ВидыДепозитарныхРасписок.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("ТипЦБДепозитарнаяРасписка", Перечисления.ТипыЦБ.ДепозитарнаяРасписка);
	
	ОбновитьРегистрПараметрыЦБ(Запрос.Выполнить(), ПараметрыЦБСрезПоследних, ДатаЗагрузки, ПоляСравнения);
КонецПроцедуры

Процедура ЗагрузитьПаи(КаталогДанныхПриемник, МенеджерВременныхТаблиц, ПараметрыЦБСрезПоследних, ДатаЗагрузки,
	ПоляСравнения)
	
	СтруктураСМассивом = ПолучитьСтруктуруСМассивомИзФайла(КаталогДанныхПриемник + "units.xml");
	ЗагрузитьПаиИзСтруктурыСМассивомВоВременнуюТаблицу(СтруктураСМассивом, МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Паи.code_nsd											КАК КодНСД,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.full_name, """"))			КАК ПолноеНаименованиеЭмитента,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.short_name, """"))			КАК КраткоеНаименованиеЭмитента,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.egrul_date, ДАТАВРЕМЯ(1,1,1))) КАК ДатаВнесенияВЕГРЮЛ,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.ogrn, """")) 				КАК ОГРН,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.inn, """")) 					КАК ИНН,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.tin, """")) 					КАК TIN,
	|	МАКСИМУМ(ЕСТЬNULL(Эмитенты.state_reg_num, """")) 		КАК РегНомер,
	|	МАКСИМУМ(ЕСТЬNULL(Паи.unit_name_full, """"))			КАК НаименованиеВыпускаЦБ,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА НаименованияПаев.pif_type_mn = ""ОПИФ""
	|			ТОГДА &ВидПаевОткрытый
	|		КОГДА НаименованияПаев.pif_type_mn = ""ЗПИФ""
	|			ТОГДА &ВидПаевЗакрытый
	|		КОГДА НаименованияПаев.pif_type_mn = ""ИПИФ""
	|			ТОГДА &ВидПаевИнтервальный
	|		ИНАЧЕ &ВидПаевПоУмолчанию
	|	КОНЕЦ)								КАК ВидЦБ,
	|	МАКСИМУМ(ЕСТЬNULL(Паи.isin, """"))	КАК ISIN,
	|	МАКСИМУМ(ЕСТЬNULL(Паи.cfi, """"))	КАК CFI,
	|	МАКСИМУМ(ЕСТЬNULL(Паи.state_reg_number_rule, """"))				КАК НомерРегистрации,
	|	МАКСИМУМ(ЕСТЬNULL(Паи.state_reg_date_rule, ДАТАВРЕМЯ(1,1,1)))	КАК ДатаРегистрации
	|ПОМЕСТИТЬ втПаиПолныеДанные
	|ИЗ
	|	втПаи КАК Паи
	|	ЛЕВОЕ СОЕДИНЕНИЕ втЭмитенты КАК НаименованияПаев
	|	ПО
	|		Паи.fund = НаименованияПаев.cmp_code_nsd
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ втЭмитенты КАК Эмитенты
	|	ПО
	|		Паи.managing = Эмитенты.cmp_code_nsd
	|
	|СГРУППИРОВАТЬ ПО
	|	Паи.code_nsd
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодНСД
	|;
	|
	|///////////////////////////////////////////////////////////////
	|// Оставляем по одному коду загрузки (КодНСД) на ЦБ
	|ВЫБРАТЬ
	|	ЦенныеБумаги.ЦБ							КАК ЦБ,
	|	МАКСИМУМ(ЕСТЬNULL(Паи.КодНСД, """"))	КАК КодНСД
	|ПОМЕСТИТЬ втПаиСКодомЗагрузки
	|ИЗ
	|	втБумагиПринятыеНаОбслуживание КАК ЦенныеБумаги
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПаиПолныеДанные КАК Паи
	|	ПО
	|		ЦенныеБумаги.КодЗагрузкиНДЦ = Паи.КодНСД
	|ГДЕ
	|	ЦенныеБумаги.ТипЦБ = &ТипЦБПай
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумаги.ЦБ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодНСД
	|;
	|
	|///////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумаги.ЦБ															КАК ЦеннаяБумага,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).Код				КАК ЦеннаяБумагаКод,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).Наименование		КАК ЦеннаяБумагаНаименование,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).ISIN				КАК ЦеннаяБумагаISIN,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.ЦБ КАК Справочник.ЦенныеБумаги).ТипЦБ				КАК ТипЦБ,
	|	Паи.ПолноеНаименованиеЭмитента	КАК ПолноеНаименованиеЭмитента,
	|	Паи.КраткоеНаименованиеЭмитента	КАК КраткоеНаименованиеЭмитента,
	|	Паи.ДатаВнесенияВЕГРЮЛ			КАК ДатаВнесенияВЕГРЮЛ,
	|	Паи.ОГРН 						КАК ОГРН,
	|	Паи.ИНН 						КАК ИНН,
	|	Паи.TIN							КАК TIN,
	|	Паи.РегНомер 					КАК РегНомер,
	|	Паи.НаименованиеВыпускаЦБ		КАК НаименованиеВыпускаЦБ,
	|	Паи.ВидЦБ						КАК ВидЦБ,
	|	Паи.ISIN						КАК ISIN,
	|	Паи.CFI							КАК CFI,
	|	Паи.НомерРегистрации			КАК НомерРегистрации,
	|	Паи.ДатаРегистрации				КАК ДатаРегистрации,
	|	ВЫБОР
	|		КОГДА Паи.ПолноеНаименованиеЭмитента ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОтсутствуетВSIR
	|
	|ИЗ
	|	втПаиСКодомЗагрузки КАК ЦенныеБумаги
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПаиПолныеДанные КАК Паи
	|	ПО
	|		ЦенныеБумаги.КодНСД = Паи.КодНСД
	|";
	Запрос.УстановитьПараметр("ВидПаевОткрытый", Перечисления.ВидыПаев.Открытый);
	Запрос.УстановитьПараметр("ВидПаевЗакрытый", Перечисления.ВидыПаев.Закрытый);
	Запрос.УстановитьПараметр("ВидПаевИнтервальный", Перечисления.ВидыПаев.Интервальный);
	Запрос.УстановитьПараметр("ВидПаевПоУмолчанию", Перечисления.ВидыПаев.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипЦБПай", Перечисления.ТипыЦБ.Пай);
	
	ОбновитьРегистрПараметрыЦБ(Запрос.Выполнить(), ПараметрыЦБСрезПоследних, ДатаЗагрузки, ПоляСравнения);
КонецПроцедуры

Функция ПолучитьСтруктуруСМассивомИзФайла(ИмяФайла)
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	
	ЧтениеXML.Прочитать();
	ЧтениеXML.Прочитать();
	ОбъектЗаголовок = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	ДатаЗагрузки = XMLЗначение(Тип("Дата"), ОбъектЗаголовок.created_at);
	
	МассивОбъектов = Новый Массив;
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
		Возврат Новый Структура("ДатаЗагрузки,Массив", ДатаЗагрузки, МассивОбъектов);
	КонецЕсли;
	
	Пока Истина Цикл
		
		Объект = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
		Если Объект.Свойства().Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		МассивОбъектов.Добавить(Объект);
		
		ОчиститьПустоеСвойствоXDTO(Объект, "full_name_en");
		ОчиститьПустоеСвойствоXDTO(Объект, "short_name_en");
		ОчиститьПустоеСвойствоXDTO(Объект, "common_name_full_en");
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	Возврат Новый Структура("ДатаЗагрузки,Массив", ДатаЗагрузки, МассивОбъектов);
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ВРЕМЕННЫХ ТАБЛИЦ

Процедура ЗагрузитьАкцииИзСтруктурыСМассивомВоВременнуюТаблицу(СтруктураСМассивом, МенеджерВременныхТаблиц)
	
	Таблица = СоздатьТаблицуЗначенийАкций();
	
	Для Каждого ЭлементДанных Из СтруктураСМассивом.Массив Цикл
		
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементДанных);
		
		Если ЭлементДанных.Свойства().Получить("state_reg_date") <> Неопределено Тогда
			НоваяСтрока.state_reg_date = XMLЗначение(Тип("Дата"), ЭлементДанных.state_reg_date);
		КонецЕсли;
		
		Если ЭлементДанных.Свойства().Получить("codes") <> Неопределено
			И ТипЗнч(ЭлементДанных.codes) = Тип("ОбъектXDTO") Тогда
			
			Если ТипЗнч(ЭлементДанных.codes.code) = Тип("ОбъектXDTO") Тогда
				
				Если ЭлементДанных.codes.code.code_type_mn = "MICEX_FOND" Тогда 
					НоваяСтрока.MicexCodeForExport = ЭлементДанных.codes.code.code;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ЭлементДанных.codes.code) = Тип("СписокXDTO") Тогда
				
				Для каждого Элемент Из ЭлементДанных.codes.code Цикл 
					
					Если Элемент.code_type_mn = "MICEX_FOND" Тогда
						НоваяСтрока.MicexCodeForExport = Элемент.code;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТЗ.code_nsd КАК code_nsd,
	|	ТЗ.isin КАК isin,
	|	ТЗ.cfi,
	|	ТЗ.issuer КАК issuer,
	|	ТЗ.issue_name_full,
	|	ТЗ.state_reg_number КАК state_reg_number,
	|	ТЗ.reg_organ,
	|	ТЗ.currency_code,
	|	ТЗ.registrar,
	|	ТЗ.micex_list,
	|	ТЗ.share_category_id,
	|	ТЗ.sec_type_id,
	|	ТЗ.sec_form_id,
	|	ТЗ.sec_type_br_code,
	|	ТЗ.state_reg_date КАК state_reg_date,
	|	ТЗ.sec_state_id,
	|	ТЗ.face_value,
	|	ТЗ.issue_size_planned,
	|	ТЗ.issued_size,
	|	ТЗ.origin_issued_size,
	|	ТЗ.for_qualified_investors,
	|	ТЗ.MicexCodeForExport,
	|	&ДатаЗагрузки КАК ДатаЗагрузки
	|ПОМЕСТИТЬ втАкции
	|ИЗ
	|	&Таблица КАК ТЗ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	code_nsd,
	|	isin,
	|	issuer,
	|	state_reg_number,
	|	state_reg_date");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("ДатаЗагрузки", СтруктураСМассивом.ДатаЗагрузки);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗагрузитьОблигацииИзСтруктурыСМассивомВоВременнуюТаблицу(СтруктураСМассивом, МенеджерВременныхТаблиц)

	Таблица = СоздатьТаблицуЗначенийОблигаций();
	
	Для Каждого ЭлементДанных Из СтруктураСМассивом.Массив Цикл
		
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементДанных);
		
		ЗаполнитьXMLЗначениеСвойстваДаты(НоваяСтрока, ЭлементДанных, "state_reg_date");
		ЗаполнитьXMLЗначениеСвойстваДаты(НоваяСтрока, ЭлементДанных, "expiry_date_calc");
		ЗаполнитьXMLЗначениеСвойстваДаты(НоваяСтрока, ЭлементДанных, "expiry_date_plan");
		ЗаполнитьXMLЗначениеСвойстваДаты(НоваяСтрока, ЭлементДанных, "start_placement_date");
		ЗаполнитьXMLЗначениеСвойстваДаты(НоваяСтрока, ЭлементДанных, "end_placement_date");
		
		Если ЭлементДанных.Свойства().Получить("codes") <> Неопределено И ТипЗнч(ЭлементДанных.codes) = Тип("ОбъектXDTO") Тогда
			Если ТипЗнч(ЭлементДанных.codes.code) = Тип("ОбъектXDTO") Тогда
				Если ЭлементДанных.codes.code.code_type_mn = "MICEX_FOND" Тогда 
					НоваяСтрока.MicexCodeForExport = ЭлементДанных.codes.code.code;
				КонецЕсли;
			ИначеЕсли ТипЗнч(ЭлементДанных.codes.code) = Тип("СписокXDTO") Тогда
				Для каждого Элемент Из ЭлементДанных.codes.code Цикл 
					Если Элемент.code_type_mn = "MICEX_FOND" Тогда
						НоваяСтрока.MicexCodeForExport = Элемент.code;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭлементДанных.Свойства().Получить("coupons") <> Неопределено И ТипЗнч(ЭлементДанных.coupons) = Тип("ОбъектXDTO") Тогда
			coupon = ЭлементДанных.coupons.coupon;
			Если ТипЗнч(coupon) = Тип("СписокXDTO") Тогда
				Для каждого Элемент Из coupon Цикл 
					ПрочитатьКупон(Элемент, НоваяСтрока.code_nsd);
				КонецЦикла;
			ИначеЕсли ТипЗнч(coupon) = Тип("ОбъектXDTO") Тогда
				ПрочитатьКупон(coupon, НоваяСтрока.code_nsd);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Купоны.Сортировать("code_nsd,coupon_number");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТЗ.code_nsd,
	|	ТЗ.isin,
	|	ТЗ.cfi,
	|	ТЗ.issuer,
	|	ТЗ.sec_type_id,
	|	ТЗ.sec_form_id,
	|	ТЗ.sec_type_br_code,
	|	ТЗ.issue_name_full,
	|	ТЗ.issue_number,
	|	ТЗ.start_placement_date,
	|	ТЗ.end_placement_date,
	|	ТЗ.placement_type_id,
	|	ТЗ.maturity_value,
	|	ТЗ.expiry_date_calc,
	|	ТЗ.expiry_date_plan,
	|	ТЗ.rate_type_id,
	|	ТЗ.coupons_number,
	|	ТЗ.live_period,
	|	ТЗ.cp_type_id,
	|	ТЗ.coupon_period_base_id,
	|	ТЗ.depositary,
	|	ТЗ.state_reg_number,
	|	ТЗ.state_reg_date,
	|	ТЗ.reg_organ,
	|	ТЗ.currency_code,
	|	ТЗ.registrar,
	|	ТЗ.micex_list,
	|	ТЗ.sec_state_id,
	|	ТЗ.face_value,
	|	ТЗ.issue_size_planned,
	|	ТЗ.issued_size,
	|	ТЗ.origin_issued_size,
	|	ТЗ.for_qualified_investors,
	|	ТЗ.MicexCodeForExport,
	|	&ДатаЗагрузки КАК ДатаЗагрузки
	|ПОМЕСТИТЬ втОблигации
	|ИЗ
	|	&Таблица КАК ТЗ");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("ДатаЗагрузки", СтруктураСМассивом.ДатаЗагрузки);
	РезультатЗапроса = Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗагрузитьДепозитарныеРаспискиИзСтруктурыСМассивомВоВременнуюТаблицу(СтруктураСМассивом, МенеджерВременныхТаблиц)
	Таблица = СоздатьТаблицуЗначенийДепозитарныхРасписок();
	
	Для Каждого ЭлементДанных Из СтруктураСМассивом.Массив Цикл
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементДанных);
		
		Если ЭлементДанных.Свойства().Получить("codes") <> Неопределено И ТипЗнч(ЭлементДанных.codes) = Тип("ОбъектXDTO") Тогда
			Если ТипЗнч(ЭлементДанных.codes.code) = Тип("ОбъектXDTO") Тогда
				Если ЭлементДанных.codes.code.code_type_mn = "MICEX_FOND" Тогда 
					НоваяСтрока.MicexCodeForExport = ЭлементДанных.codes.code.code;
				КонецЕсли;
			ИначеЕсли ТипЗнч(ЭлементДанных.codes.code) = Тип("СписокXDTO") Тогда
				Для каждого Элемент Из ЭлементДанных.codes.code Цикл 
					Если Элемент.code_type_mn = "MICEX_FOND" Тогда
						НоваяСтрока.MicexCodeForExport = Элемент.code;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТЗ.code_nsd КАК code_nsd,
	|	ТЗ.isin КАК isin,
	|	ТЗ.cfi,
	|	ТЗ.dr_issuer КАК dr_issuer,
	|	ТЗ.dr_category_mn КАК dr_category_mn,
	|	ТЗ.sec_form_id,
	|	ТЗ.sec_type_br_code,
	|	ТЗ.dr_name_full,
	|	ТЗ.sec_state_id,
	|	ТЗ.repres_fi_isin,
	|	ТЗ.ratio_numerator,
	|	ТЗ.ratio_denominator,
	|	ТЗ.issuer_base_sec,
	|	ТЗ.for_qualified_investors,
	|	ТЗ.MicexCodeForExport,&ДатаЗагрузки КАК ДатаЗагрузки
	|ПОМЕСТИТЬ втДепозитарныеРасписки
	|ИЗ
	|	&Таблица КАК ТЗ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	code_nsd,
	|	isin,
	|	dr_issuer");
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("ДатаЗагрузки", СтруктураСМассивом.ДатаЗагрузки);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗагрузитьПаиИзСтруктурыСМассивомВоВременнуюТаблицу(СтруктураСМассивом, МенеджерВременныхТаблиц)
	Таблица = СоздатьТаблицуЗначенийПаев();
	
	Для Каждого ЭлементДанных Из СтруктураСМассивом.Массив Цикл
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементДанных);
		
		Если ЭлементДанных.Свойства().Получить("state_reg_date_rule") <> Неопределено Тогда
			НоваяСтрока.state_reg_date_rule = XMLЗначение(Тип("Дата"), ЭлементДанных.state_reg_date_rule);
		КонецЕсли;
		
		Если ЭлементДанных.Свойства().Получить("codes") <> Неопределено
			И ТипЗнч(ЭлементДанных.codes) = Тип("ОбъектXDTO") Тогда
			
			Если ТипЗнч(ЭлементДанных.codes.code) = Тип("ОбъектXDTO") Тогда
				Если ЭлементДанных.codes.code.code_type_mn = "MICEX_FOND" Тогда 
					НоваяСтрока.MicexCodeForExport = ЭлементДанных.codes.code.code;
				КонецЕсли;
			ИначеЕсли ТипЗнч(ЭлементДанных.codes.code) = Тип("СписокXDTO") Тогда
				Для каждого Элемент Из ЭлементДанных.codes.code Цикл 
					Если Элемент.code_type_mn = "MICEX_FOND" Тогда
						НоваяСтрока.MicexCodeForExport = Элемент.code;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТЗ.code_nsd КАК code_nsd,
	|	ТЗ.isin КАК isin,
	|	ТЗ.cfi,
	|	ТЗ.fund,
	|	ТЗ.managing,
	|	ТЗ.sec_type_br_code,
	|	ТЗ.unit_name_full,
	|	ТЗ.state_reg_number_rule,
	|	ТЗ.state_reg_date_rule,
	|	ТЗ.company_state_mn,
	|	ТЗ.registrar,
	|	ТЗ.fraction,
	|	ТЗ.micex_list,
	|	ТЗ.for_qualified_investors,
	|	ТЗ.MicexCodeForExport,
	|	&ДатаЗагрузки КАК ДатаЗагрузки
	|ПОМЕСТИТЬ втПаи
	|ИЗ
	|	&Таблица КАК ТЗ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	code_nsd,
	|	isin,
	|	ТЗ.fund,
	|	ТЗ.managing,
	|	ТЗ.state_reg_number_rule,
	|	ТЗ.state_reg_date_rule");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("ДатаЗагрузки", СтруктураСМассивом.ДатаЗагрузки);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗагрузитьКатегорииАкцийИзМассиваВоВременнуюТаблицу(Массив, МенеджерВременныхТаблиц)
	Таблица = СоздатьТаблицуЗначенийКатегорийАкций();
	Для Каждого ЭлементДанных Из Массив Цикл
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементДанных);
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТЗ.share_category_id,
	|	ТЗ.share_category_name,
	|	ТЗ.share_category_name_en
	|ПОМЕСТИТЬ втКатегорииАкций
	|ИЗ
	|	&Таблица КАК ТЗ");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗагрузитьЭмитентыИзМассиваВоВременнуюТаблицу(Массив, МенеджерВременныхТаблиц)
	Таблица = СоздатьТаблицуЗначенийЭмитентов();
	
	Для Каждого ЭлементДанных Из Массив Цикл
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементДанных);
		
		Если ЭлементДанных.Свойства().Получить("state_reg_date") <> Неопределено Тогда
			НоваяСтрока.state_reg_date = XMLЗначение(Тип("Дата"), ЭлементДанных.state_reg_date);
		КонецЕсли;
		
		Если ЭлементДанных.Свойства().Получить("egrul_date") <> Неопределено Тогда
			НоваяСтрока.egrul_date = XMLЗначение(Тип("Дата"), ЭлементДанных.egrul_date);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТЗ.cmp_code_nsd КАК cmp_code_nsd,
	|	ТЗ.full_name,
	|	ТЗ.short_name,
	|	ТЗ.full_name_en,
	|	ТЗ.inn,
	|	ТЗ.comp_type_id,
	|	ТЗ.kpp,
	|	ТЗ.credit_cmp,
	|	ТЗ.is_bank_4_non_resident,
	|	ТЗ.okpo,
	|	ТЗ.state_reg_num,
	|	ТЗ.state_reg_date,
	|	ТЗ.ogrn,
	|	ТЗ.egrul_date,
	|	ТЗ.egrul_organ_name,
	|	ТЗ.country,
	|	ТЗ.market_id,
	|	ТЗ.fio_head,
	|	ТЗ.address,
	|	ТЗ.post_address,
	|	ТЗ.phone,
	|	ТЗ.fax,
	|	ТЗ.e_mail,
	|	ТЗ.www,
	|	ТЗ.pif_type_mn,
	|	ТЗ.tin,
	|	ТЗ.tax_number
	|ПОМЕСТИТЬ втЭмитенты
	|ИЗ
	|	&Таблица КАК ТЗ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	cmp_code_nsd,
	|	ТЗ.pif_type_mn");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.Выполнить();
КонецПроцедуры

Процедура ЗагрузитьВалюты(МенеджерВременныхТаблиц)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Валюты.Ссылка КАК Валюта,
	|	ВЫБОР
	|		КОГДА Валюты.Наименование = ""SUR""
	|			ТОГДА ""RUB""
	|		ИНАЧЕ Валюты.Наименование
	|	КОНЕЦ КАК Наименование
	|ПОМЕСТИТЬ втВалюты
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Наименование
	|;";
	Запрос.Выполнить();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТАБЛИЦЫ ЗНАЧЕНИЙ

Функция СоздатьТаблицуЗначенийЭмитентов()
	ТипСтрока	= Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная));
	ТипЧисло	= Новый ОписаниеТипов("Число");
	ТипДата		= Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	
	Таблица = Новый ТаблицаЗначений;
	Колонки = Таблица.Колонки;
	Колонки.Добавить("cmp_code_nsd",			ТипСтрока);
	Колонки.Добавить("full_name",				ТипСтрока);
	Колонки.Добавить("short_name",				ТипСтрока);
	Колонки.Добавить("short_name_en",			ТипСтрока);
	Колонки.Добавить("common_name_full_en",		ТипСтрока);
	Колонки.Добавить("full_name_en",			ТипСтрока);
	Колонки.Добавить("inn",						ТипСтрока);
	Колонки.Добавить("comp_type_id",			ТипЧисло);
	Колонки.Добавить("kpp",						ТипСтрока);
	Колонки.Добавить("credit_cmp",				ТипСтрока);
	Колонки.Добавить("is_bank_4_non_resident",	ТипСтрока);
	Колонки.Добавить("okpo",					ТипСтрока);
	Колонки.Добавить("state_reg_num",			ТипСтрока);
	Колонки.Добавить("state_reg_date",			ТипДата);
	Колонки.Добавить("ogrn",					ТипСтрока);
	Колонки.Добавить("egrul_date",				ТипДата);
	Колонки.Добавить("egrul_organ_name",		ТипСтрока);
	Колонки.Добавить("country",					ТипСтрока);
	Колонки.Добавить("market_id",				ТипЧисло);
	Колонки.Добавить("fio_head",				ТипСтрока);
	Колонки.Добавить("position_head",			ТипСтрока);
	Колонки.Добавить("address",					ТипСтрока);
	Колонки.Добавить("post_address",			ТипСтрока);
	Колонки.Добавить("phone",					ТипСтрока);
	Колонки.Добавить("fax",						ТипСтрока);
	Колонки.Добавить("e_mail",					ТипСтрока);
	Колонки.Добавить("pif_type_mn",				ТипСтрока);
	Колонки.Добавить("www",						ТипСтрока);
	Колонки.Добавить("tin",						ТипСтрока);
	Колонки.Добавить("tax_number",				ТипСтрока);
	
	Возврат Таблица;
КонецФункции 

Функция СоздатьТаблицуЗначенийАкций()
	ТипСтрока	= Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная));
	ТипЧисло	= Новый ОписаниеТипов("Число");
	ТипДата		= Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	Таблица = Новый ТаблицаЗначений;
	Колонки = Таблица.Колонки;
	Колонки.Добавить("code_nsd",				ТипСтрока);
	Колонки.Добавить("isin",					ТипСтрока);
	Колонки.Добавить("cfi",						ТипСтрока);
	Колонки.Добавить("issuer",					ТипСтрока);
	Колонки.Добавить("share_category_id",		ТипЧисло);
	Колонки.Добавить("sec_type_id",				ТипЧисло);
	Колонки.Добавить("sec_form_id",				ТипЧисло);
	Колонки.Добавить("sec_type_br_code",		ТипСтрока);
	Колонки.Добавить("issue_name_full",			ТипСтрока);
	Колонки.Добавить("issue_number",			ТипСтрока);
	Колонки.Добавить("start_placement_date",	ТипДата);
	Колонки.Добавить("state_reg_number",		ТипСтрока);
	Колонки.Добавить("state_reg_date",			ТипДата);
	Колонки.Добавить("reg_organ",				ТипСтрока);
	Колонки.Добавить("sec_state_id",			ТипЧисло);
	Колонки.Добавить("face_value",				ТипЧисло);
	Колонки.Добавить("currency_code",			ТипСтрока);
	Колонки.Добавить("registrar",				ТипСтрока);
	Колонки.Добавить("micex_list",				ТипСтрока);
	Колонки.Добавить("issue_size_planned",		ТипЧисло);
	Колонки.Добавить("issued_size",				ТипЧисло);
	Колонки.Добавить("origin_issued_size",		ТипЧисло);
	Колонки.Добавить("for_qualified_investors",	ТипСтрока);
	Колонки.Добавить("MicexCodeForExport",		ТипСтрока);
	
	Возврат Таблица;
КонецФункции

Функция СоздатьТаблицуЗначенийОблигаций()
	ТипСтрока	= Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная));
	ТипЧисло	= Новый ОписаниеТипов("Число");
	ТипДата		= Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	Таблица = Новый ТаблицаЗначений;
	Колонки = Таблица.Колонки;
	Колонки.Добавить("code_nsd",		ТипСтрока);
	Колонки.Добавить("isin",			ТипСтрока);
	Колонки.Добавить("cfi",				ТипСтрока);
	Колонки.Добавить("issuer",			ТипСтрока);
	Колонки.Добавить("sec_type_id",		ТипЧисло);
	Колонки.Добавить("sec_form_id",		ТипЧисло);
	Колонки.Добавить("sec_type_br_code",ТипСтрока);
	Колонки.Добавить("issue_name_full",	ТипСтрока);
	
	Колонки.Добавить("issue_number",		ТипСтрока);
	Колонки.Добавить("start_placement_date",ТипДата);
	Колонки.Добавить("end_placement_date",	ТипДата);
	Колонки.Добавить("placement_type_id",	ТипЧисло);
	Колонки.Добавить("maturity_value",		ТипЧисло);
	Колонки.Добавить("expiry_date_calc",	ТипДата);
	Колонки.Добавить("expiry_date_plan",	ТипДата);
	
	Колонки.Добавить("rate_type_id",			ТипЧисло);
	Колонки.Добавить("coupons_number",			ТипЧисло);
	Колонки.Добавить("live_period",				ТипЧисло);
	Колонки.Добавить("cp_type_id",				ТипЧисло);
	Колонки.Добавить("coupon_period_base_id",	ТипЧисло);
	Колонки.Добавить("depositary",				ТипСтрока);
	
	Колонки.Добавить("state_reg_number",		ТипСтрока);
	Колонки.Добавить("state_reg_date",			ТипДата);
	Колонки.Добавить("reg_organ",				ТипСтрока);
	Колонки.Добавить("sec_state_id",			ТипЧисло);
	Колонки.Добавить("face_value",				ТипЧисло);
	Колонки.Добавить("currency_code",			ТипСтрока);
	Колонки.Добавить("registrar",				ТипСтрока);
	Колонки.Добавить("micex_list",				ТипСтрока);
	Колонки.Добавить("issue_size_planned",		ТипЧисло);
	Колонки.Добавить("issued_size",				ТипЧисло);
	Колонки.Добавить("origin_issued_size",		ТипЧисло);
	Колонки.Добавить("for_qualified_investors",	ТипСтрока);
	Колонки.Добавить("MicexCodeForExport",		ТипСтрока);
	
	Возврат Таблица;
КонецФункции

Функция СоздатьТаблицуЗначенийДепозитарныхРасписок()
	ТипСтрока	= Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная));
	ТипЧисло	= Новый ОписаниеТипов("Число");
	ТипДата		= Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	Таблица = Новый ТаблицаЗначений;
	Колонки = Таблица.Колонки;
	Колонки.Добавить("code_nsd",				ТипСтрока);
	Колонки.Добавить("isin",					ТипСтрока);
	Колонки.Добавить("cfi",						ТипСтрока);
	Колонки.Добавить("dr_issuer",				ТипСтрока);
	Колонки.Добавить("dr_category_mn",			ТипСтрока);
	Колонки.Добавить("sec_form_id",				ТипЧисло);
	Колонки.Добавить("sec_type_br_code",		ТипСтрока);
	Колонки.Добавить("dr_name_full",			ТипСтрока);
	Колонки.Добавить("sec_state_id",			ТипЧисло);
	Колонки.Добавить("repres_fi_isin",			ТипСтрока);
	Колонки.Добавить("ratio_numerator",			ТипЧисло);
	Колонки.Добавить("ratio_denominator",		ТипЧисло);
	Колонки.Добавить("issuer_base_sec",			ТипСтрока);
	Колонки.Добавить("for_qualified_investors",	ТипСтрока);
	Колонки.Добавить("MicexCodeForExport",		ТипСтрока);
	
	Возврат Таблица;
КонецФункции

Функция СоздатьТаблицуЗначенийПаев()
	ТипСтрока	= Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная));
	ТипЧисло	= Новый ОписаниеТипов("Число");
	ТипДата		= Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	Таблица = Новый ТаблицаЗначений;
	Колонки = Таблица.Колонки;
	Колонки.Добавить("code_nsd",				ТипСтрока);
	Колонки.Добавить("isin",					ТипСтрока);
	Колонки.Добавить("cfi",						ТипСтрока);
	Колонки.Добавить("fund",					ТипСтрока);
	Колонки.Добавить("managing",				ТипСтрока);
	Колонки.Добавить("sec_type_br_code",		ТипСтрока);
	Колонки.Добавить("unit_name_full",			ТипСтрока);
	Колонки.Добавить("state_reg_number_rule",	ТипСтрока);
	Колонки.Добавить("state_reg_date_rule",		ТипДата);
	
	Колонки.Добавить("company_state_mn",		ТипСтрока);
	Колонки.Добавить("registrar",				ТипСтрока);
	Колонки.Добавить("fraction",				ТипСтрока);
	Колонки.Добавить("micex_list",				ТипСтрока);
	Колонки.Добавить("for_qualified_investors",	ТипСтрока);
	Колонки.Добавить("MicexCodeForExport",		ТипСтрока);
	
	Возврат Таблица;
КонецФункции

Функция СоздатьТаблицуЗначенийКатегорийАкций()
	
	ТипСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная));
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	Таблица = Новый ТаблицаЗначений;
	Колонки = Таблица.Колонки;
	Колонки.Добавить("share_category_id", ТипЧисло);
	Колонки.Добавить("share_category_name", ТипСтрока);
	Колонки.Добавить("share_category_name_en", ТипСтрока);
	
	Возврат Таблица;
	
КонецФункции 

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ПрочитатьКупон(Элемент, code_nsd)
	
	СтрокаКупон = Купоны.Добавить();
	СтрокаКупон.code_nsd = code_nsd;
	ЗаполнитьЗначенияСвойств(СтрокаКупон, Элемент);
	
	ЗаполнитьXMLЗначениеСвойстваДаты(СтрокаКупон, Элемент, "payment_date_fact");
	
	ЗаполнитьXMLЗначениеСвойстваДаты(СтрокаКупон, Элемент, "payment_date_calc");
	ЗаполнитьXMLЗначениеСвойстваДаты(СтрокаКупон, Элемент, "payment_date_plan");
	
	ЗаполнитьXMLЗначениеСвойстваДаты(СтрокаКупон, Элемент, "record_date_calc");
	
	ЗаполнитьXMLЗначениеСвойстваДаты(СтрокаКупон, Элемент, "record_date_plan");
	
КонецПроцедуры

Процедура ЗаполнитьXMLЗначениеСвойстваДаты(Приемник, Источник, Имя)
	
	Если Источник.Свойства().Получить(Имя) <> Неопределено Тогда
		Приемник[Имя] = XMLЗначение(Тип("Дата"), Источник[Имя]);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьПустоеСвойствоXDTO(Объект, ИмяСвойства)
	Свойство = Объект.Свойства().Получить(ИмяСвойства);
	Если Свойство <> Неопределено И ТипЗнч(Объект[ИмяСвойства]) = Тип("ОбъектXDTO") Тогда
		Объект[ИмяСвойства] = "";
	КонецЕсли;
КонецПроцедуры

// Возвращает Истина, если все поля из набора 1 равны соответствующим полям из набора 2, иначе Ложь
Функция ВсеЗначенияРавны(Набор1, Набор2, СписокПолей)
	Для Каждого Поле из СписокПолей Цикл
		Если ТипЗнч(Набор1[Поле]) <> ТипЗнч(Набор2[Поле]) Тогда
			ВызватьИсключение "Не совпадают типы сравниваемых полей """+Поле+""" "+ТипЗнч(Набор1[Поле])+" и "+ТипЗнч(Набор2[Поле]);
		КонецЕсли;
		
		Если ТипЗнч(Набор1[Поле]) = Тип("Строка") Тогда
			Если СокрЛП(Набор1[Поле]) <> СокрЛП(Набор2[Поле]) Тогда
				Возврат Ложь;
			КонецЕсли;
		ИначеЕсли Набор1[Поле] <> Набор2[Поле] Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
