
Функция Реквизиты(ДатаСреза) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	РеквизитыПриказовПриложенийКРДОСрезПоследних.НомерПриказа КАК НомерПриказа,
	|	РеквизитыПриказовПриложенийКРДОСрезПоследних.ДатаПриказа КАК ДатаПриказа
	|ИЗ
	|	РегистрСведений.РеквизитыПриказовПриложенийКРДО.СрезПоследних(&ДатаСреза, ) КАК РеквизитыПриказовПриложенийКРДОСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Реквизиты = "Приказ №" + СокрЛП(Выборка.НомерПриказа) + " от " + Формат(Выборка.ДатаПриказа, "ДЛФ=Д");
	Иначе
		Реквизиты = "";
	КонецЕсли;
	Возврат Реквизиты;
КонецФункции
