&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Соответствие = ТекущийОбъект.ПараметрыУведомления.Получить();
	Для Каждого КлючИЗначение Из Соответствие Цикл
		НоваяСтрока = ПараметрыУведомления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, КлючИЗначение);
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("Соответствие") Тогда
			Список = Новый СписокЗначений;
			Для Каждого ЭлементСтруктуры Из КлючИЗначение.Значение Цикл
				Список.Добавить(ЭлементСтруктуры.Значение, ЭлементСтруктуры.Ключ);
			КонецЦикла;
			НоваяСтрока.Значение = Список;
		КонецЕсли;
	КонецЦикла;
	ТекстПисьма = Соответствие["ТекстПисьма"];
	Если Найти(ТекстПисьма, "<!DOCTYPE HTML") = 0 Тогда
		Элементы.ТекстПисьма.Вид = ВидПоляФормы.ПолеТекстовогоДокумента;
		Элементы.ТекстПисьма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.ТекстПисьмаHTML.Видимость = (Соответствие.Получить("ТипТекстаПисьма") = ТипТекстаПочтовогоСообщения.HTML);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложения(Команда)
	СтрокаВложения = ПараметрыУведомления.НайтиСтроки(Новый Структура("Ключ", "Вложения"));
	Если СтрокаВложения.Количество() = 0 Тогда
		Предупреждение("Вложений нет!");
		Возврат;
	КонецЕсли;
	Папка = Диалоги.ВыборКаталога("");
	Если ПустаяСтрока(Папка) Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Вложение Из СтрокаВложения[0].Значение Цикл
		Вложение.Значение.Записать(Папка+"\"+Вложение.Представление);
	КонецЦикла;
КонецПроцедуры
