&НаКлиенте
Процедура ТекущийДокументПриИзменении(Элемент)
	
	ТекущийДокументПриИзмененииСервер();  
	
КонецПроцедуры         

&НаСервере
Процедура ТекущийДокументПриИзмененииСервер()
	
	ДокОбъект = Отчет.ТекущийДокумент.ПолучитьОбъект();
	Отчет.ТекущийДокументПериодРасчетаКомиссии = ДокОбъект.ПериодРасчетаКомиссии;
	Отчет.ТекущийДокументДоговор = ДокОбъект.Договор;
	НоваяТЗ = ДокОбъект.Услуги.Выгрузить();
	Отчет.ДанныеДокумента.Загрузить(НоваяТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрокаТЧ = Элементы.ДанныеДокумента.ТекущиеДанные;
	
	Отчет.ТекущаяСтрокаТЧУслуга = ТекущаяСтрокаТЧ.Услуга;
	Отчет.ТекущаяСтрокаТЧВыгодоприобретатель = ТекущаяСтрокаТЧ.Выгодоприобретатель;
	Отчет.ТекущаяСтрокаТЧВариантНачисления = ПредопределенноеЗначение("Перечисление.ВариантыНачисленияКомиссий.Месяц");

	Если не ЗначениеЗаполнено(Отчет.ТекущийДокументПериодРасчетаКомиссии) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Отсутствует период расчета в выбранном документе. Расчет не будет выполнен.'"),,,,);
		Элементы.ОсновнаяКоманднаяПанель.Доступность = ЛОЖЬ;
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрокаТЧ.СуммаКомиссии = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Отсутствует сумма комиссии в выбранной строке. Расчет не будет выполнен.'"),,,,);
		Элементы.ОсновнаяКоманднаяПанель.Доступность = ЛОЖЬ; 
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(ТекущаяСтрокаТЧ.Услуга) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Отсутствует услуга в выбранной строке. Расчет не будет выполнен.'"),,,,);
		Элементы.ОсновнаяКоманднаяПанель.Доступность = ЛОЖЬ; 
		Возврат;
	КонецЕсли;
	
	Элементы.ОсновнаяКоманднаяПанель.Доступность = ИСТИНА;

КонецПроцедуры

&НаКлиенте
Процедура ФормаПриОткрытии(Отказ)
	Элементы.ОсновнаяКоманднаяПанель.Доступность = ЛОЖЬ;
КонецПроцедуры
