
// Возвращает действующий на текущую дату договор клиента. Если таких договоров существует несколько,
// то возвращается тот из них у которого наименование совпадает с кодом клиента
// Параметры:
//	Клиент - СправочникСсылка.Контрагенты
// Возвращаемое значение:
//	СправочникСсылка.ДоговорыКонтрагентов
Функция ДоговорПоКлиенту(Клиент) Экспорт
	Договор = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ВЫБОР
	|		КОГДА Контрагенты.Код = ДоговорыКонтрагентов.Наименование ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО ДоговорыКонтрагентов.Владелец = Контрагенты.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Клиент
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И (ДоговорыКонтрагентов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ДоговорыКонтрагентов.ДатаОкончанияДействия > &ТекущаяДата)
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Договор = Выборка.Договор;
	КонецЕсли;
	
	Возврат Договор;
КонецФункции