
&ИзменениеИКонтроль("ЗаполнитьДокумент")
Процедура MV_WAP_ЗаполнитьДокумент(СообщенияЗаполнения = Неопределено, Данные = Неопределено) Экспорт

	#Область СтарыйКодЗаполнения
	//Если НЕ ЗначениеЗаполнено(Дата) Тогда
	//	Дата = ТекущаяДата();
	//КонецЕсли;
	//
	//СообщенияЗаполнения = "";
	//
	//СписокАктивов.Очистить();
	//
	//КэшКурсовВалют = Новый Соответствие;
	//
	////Подготовим данные
	//СтруктураДанныхРасчета = Документы.РасчетСредневзвешеннойСтоимости.ПолучитьДанныеРасчета(Дата, Мандат);
	//
	////Получим действующие валюты расчета
	//ВалютыРасчета = СтруктураДанныхРасчета.ВалютыРасчета;

	////Получим зафиксированные котировки на дату документа
	//ТаблицаКотировок = СтруктураДанныхРасчета.ТаблицаКотировок;
	//
	////Определим флаг расчета WAP1
	//ЭтоНачалоОтчетногоПериода = СтруктураДанныхРасчета.ЭтоНачалоОтчетногоПериода;
	//
	////Получим таблицу данных по предыдущим средневзвешенным стоимостям (по необходимым валютам)
	//ТаблицаПредыдущихСтоимостей = СтруктураДанныхРасчета.ТаблицаПредыдущихСтоимостей;
	//
	////Получим таблицу операций
	//ТаблицаОпераций = СтруктураДанныхРасчета.ТаблицаОпераций;
	//ТаблицаОпераций.Свернуть("Валюта, Актив, СчетМандата, СчетИсточник, МоментВремени, Порядок", "Количество, Сумма");
	//ТаблицаОпераций.Сортировать("Порядок, МоментВремени");
	//
	//// Получим таблицу амортизационных облигаций
	//ТаблицаАмортизационныхОблигаций = ТаблицаАмортизационныхОблигацийОстаточнаяСтоимость(ТаблицаПредыдущихСтоимостей.ВыгрузитьКолонку("Актив"));
	//
	//ВыборкаАктив = СтруктураДанныхРасчета.РезультатаЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//
	//КэшОперацийИсточников = Новый ТаблицаЗначений;
	//КэшОперацийИсточников.Колонки.Добавить("Актив");
	//КэшОперацийИсточников.Колонки.Добавить("СчетМандата");
	//КэшОперацийИсточников.Колонки.Добавить("Валюта");
	//КэшОперацийИсточников.Колонки.Добавить("WAP1");
	//КэшОперацийИсточников.Колонки.Добавить("WAP2");
	//КэшОперацийИсточников.Колонки.Добавить("Количество");
	//
	////Произведем расчет
	//Для каждого ВалютаРасчета Из ВалютыРасчета Цикл
	//	
	//	ВыборкаАктив.Сбросить();
	//	
	//	КурсКратностьВалютыРасчета = КэшКурсовВалют.Получить(ВалютаРасчета);
	//	Если КурсКратностьВалютыРасчета = Неопределено Тогда
	//		КурсКратностьВалютыРасчета = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРасчета, Дата);
	//		КэшКурсовВалют.Вставить(ВалютаРасчета, КурсКратностьВалютыРасчета);
	//	КонецЕсли;
	//	
	//	Пока ВыборкаАктив.Следующий() Цикл
	//		
	//		КоэффициентАмортизации = КоэффициентАмортизацииОблигации(ТекущийАктив.Объект, ТаблицаАмортизационныхОблигаций); // MID-112
	//		
	//		ВыборкаСчета = ВыборкаАктив.Выбрать();
	//				
	//		Пока СтрокаСчета.Следующий() Цикл
	//			
	//			СтрокиПредыдущейСтоимости = ТаблицаПредыдущихСтоимостей.НайтиСтроки(Новый Структура("Валюта, СчетМандата, Актив", ВалютаРасчета, СтрокаСчета.СчетМандата, ТекущийАктив));
	//			СтрокиОперацийПоАктиву = ТаблицаОпераций.НайтиСтроки(Новый Структура("СчетМандата, Актив", СтрокаСчета.СчетМандата, ТекущийАктив));
	//						
	//			// Расчет
	//			МассивСтруктурОпераций = Новый Массив;
	//			Для каждого СтрокаОперации Из СтрокиОперацийПоАктиву Цикл
	//				ЭтоПеревод = Ложь;
	//				СтруктураОперации = Новый Структура("Сумма, Количество, Валюта, СуммаВВалютеРасчета, P, X");
	//				ЗаполнитьЗначенияСвойств(СтруктураОперации, СтрокаОперации);

	//				Если ЗначениеЗаполнено(СтрокаОперации.СчетИсточник) Тогда //Это перевод
	//					ЭтоПеревод = Истина;
	//					СтруктураОперации.СуммаВВалютеРасчета = Новый Массив;
	//					СтруктураОперации.Сумма = Новый Массив;
	//					СтруктураОперации.X = Новый Массив;
	//					СтрокиКэша = КэшОперацийИсточников.НайтиСтроки(Новый Структура("Валюта, СчетМандата, Актив", ВалютаРасчета, СтрокаОперации.СчетИсточник, ТекущийАктив));	
	//				    Если СтрокиКэша.Количество() > 0 Тогда
	//						СтруктураОперации.Сумма.Добавить(СтрокиКэша[0].WAP1 * СтруктураОперации.Количество);	
	//						СтруктураОперации.Сумма.Добавить(СтрокиКэша[0].WAP2 * СтруктураОперации.Количество);	
	//					Иначе
	//						СтруктураОперации.Сумма.Добавить(0);	
	//						СтруктураОперации.Сумма.Добавить(0);	
	//						СообщенияЗаполнения = СообщенияЗаполнения + ?(ПустаяСтрока(СообщенияЗаполнения), "", Символы.ПС);
	//						СообщенияЗаполнения = СообщенияЗаполнения + "При заполнении стоимости сделки по счету источнику " + Строка(СтрокаОперации.СчетИсточник)
	//																  + ", активу " + Строка(ТекущийАктив) + ", валюте " + Строка(ВалютаРасчета) + " данные WAP не найдены";
	//					КонецЕсли;
	//					// Временно
	//					Если НЕ ЗначениеЗаполнено(СтруктураОперации.Валюта) Тогда
	//						СтруктураОперации.Валюта = ВалютаРасчета; 
	//					КонецЕсли; 
	//				КонецЕсли; 
	//				
	//				Если СтруктураОперации.Валюта = ВалютаРасчета Тогда
	//					СтруктураОперации.СуммаВВалютеРасчета = СтруктураОперации.Сумма;
	//				Иначе
	//					КурсКратностьВалютыОперации = КэшКурсовВалют.Получить(СтруктураОперации.Валюта);
	//					Если КурсКратностьВалютыОперации = Неопределено Тогда
	//						КурсКратностьВалютыОперации = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтруктураОперации.Валюта, Дата);
	//						КэшКурсовВалют.Вставить(СтруктураОперации.Валюта, КурсКратностьВалютыОперации);
	//					КонецЕсли;
	//					Если ЭтоПеревод Тогда
	//						Для каждого ТекущаяСумма Из СтруктураОперации.Сумма Цикл
	//							СтруктураОперации.СуммаВВалютеРасчета.Добавить(РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ТекущаяСумма, КурсКратностьВалютыОперации, КурсКратностьВалютыРасчета));						
	//						КонецЦикла; 
	//					Иначе	
	//						СтруктураОперации.СуммаВВалютеРасчета = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтруктураОперации.Сумма, КурсКратностьВалютыОперации, КурсКратностьВалютыРасчета);						
	//					КонецЕсли; 
	//				КонецЕсли;
	//				Если СтруктураОперации.Количество = 0 Тогда
	//					Если ЭтоПеревод Тогда
	//						СтруктураОперации.X.Добавить(0);
	//						СтруктураОперации.X.Добавить(0);
	//					Иначе
	//				    	СтруктураОперации.X = 0;
	//					КонецЕсли; 
	//				Иначе
	//					Если ЭтоПеревод Тогда
	//						Для каждого ТекущаяСуммаВВалютеРасчета Из СтруктураОперации.СуммаВВалютеРасчета Цикл
	//							СтруктураОперации.X.Добавить(ТекущаяСуммаВВалютеРасчета / СтруктураОперации.Количество);
	//						КонецЦикла; 
	//					Иначе	
	//						СтруктураОперации.X = СтруктураОперации.СуммаВВалютеРасчета / СтруктураОперации.Количество;
	//					КонецЕсли; 
	//				КонецЕсли;
	//				МассивСтруктурОпераций.Добавить(СтруктураОперации);
	// 			КонецЦикла; 
	//			
	//			WAP1_P0 = 0;
	//			WAP1_X0 = 0;
	//			WAP2_P0 = 0;
	//			WAP2_X0 = 0;
	//			ПредыдущееКоличество = 0;
	//			Если СтрокиПредыдущейСтоимости.Количество() > 0 Тогда
	//				ПредыдущееКоличество = СтрокиПредыдущейСтоимости[0].Количество;
	//				WAP2_X0 = СтрокиПредыдущейСтоимости[0].WAP2;
	//			    Если ЭтоНачалоОтчетногоПериода Тогда
	//					СтрокаКотировки = ТаблицаКотировок.Найти(ТекущийАктив, "Актив");
	//					Если СтрокаКотировки <> Неопределено Тогда
	//						Если СтрокаКотировки.Валюта <> ВалютаРасчета Тогда
	//							КурсКратностьКотировки = КэшКурсовВалют.Получить(СтрокаКотировки.Валюта);
	//							Если КурсКратностьКотировки = Неопределено Тогда
	//								КурсКратностьКотировки = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтрокаКотировки.Валюта, Дата);
	//								КэшКурсовВалют.Вставить(СтрокаКотировки.Валюта, КурсКратностьКотировки);
	//							КонецЕсли;
	//							WAP1_X0 = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаКотировки.Котировка, КурсКратностьКотировки, КурсКратностьВалютыРасчета);
	//						Иначе	
	//							WAP1_X0 = СтрокаКотировки.Котировка;
	//						КонецЕсли; 
	//					КонецЕсли; 
	//				Иначе	
	//					WAP1_X0 = СтрокиПредыдущейСтоимости[0].WAP1;
	//				КонецЕсли; 
	//			КонецЕсли; 
	//			
	//			// MID-112 {
	//			WAP1_X0 = WAP1_X0 * КоэффициентАмортизации;
	//			WAP2_X0 = WAP2_X0 * КоэффициентАмортизации;
	//			// } MID-112
	//			
	//			//Рассчитаем P0
	//            ЧислительWAP1 = ПредыдущееКоличество;
	//			ЗнаменательWAP1 = ЧислительWAP1;
	//            ЧислительWAP2 = ПредыдущееКоличество;
	//			ЗнаменательWAP2 = ЧислительWAP2;
	//			Для каждого СтруктураОперации Из МассивСтруктурОпераций Цикл
	//				ЗнаменательWAP1 = ЗнаменательWAP1 + СтруктураОперации.Количество;
	//				ЗнаменательWAP2 = ЗнаменательWAP2 + СтруктураОперации.Количество;
	//			КонецЦикла;  
	//			Если ЗнаменательWAP1 <> 0 Тогда
	//				WAP1_P0 = ЧислительWAP1 / ЗнаменательWAP1;
	//			КонецЕсли; 
	//			Если ЗнаменательWAP2 <> 0 Тогда
	//				WAP2_P0 = ЧислительWAP2 / ЗнаменательWAP2;
	//			КонецЕсли; 
	//			
	//			//Произведем расчет WAP1, WAP2
	//			WAP1 = WAP1_P0 * WAP1_X0;
	//			WAP2 = WAP2_P0 * WAP2_X0;
	//			Для каждого СтруктураОперации Из МассивСтруктурОпераций Цикл
	//				Если ЗнаменательWAP1 > 0 Тогда
	//					Если ТипЗнч(СтруктураОперации.X) = Тип("Массив") Тогда
	//						WAP1 = WAP1 + (СтруктураОперации.X[0] * (СтруктураОперации.Количество / ЗнаменательWAP1));
	//					Иначе
	//						WAP1 = WAP1 + (СтруктураОперации.X * (СтруктураОперации.Количество / ЗнаменательWAP1));
	//					КонецЕсли; 
	//				КонецЕсли; 
	//				Если ЗнаменательWAP2 > 0 Тогда
	//					Если ТипЗнч(СтруктураОперации.X) = Тип("Массив") Тогда
	//						WAP2 = WAP2 + (СтруктураОперации.X[1] * (СтруктураОперации.Количество / ЗнаменательWAP2));
	//					Иначе
	//						WAP2 = WAP2 + (СтруктураОперации.X * (СтруктураОперации.Количество / ЗнаменательWAP2));
	//					КонецЕсли;	
	//				КонецЕсли; 
	//			КонецЦикла;
	//			Если СтрокаСчета.ОстатокНаКонец <> 0
	//				ИЛИ WAP1 <> 0 
	//				ИЛИ WAP2 <> 0 Тогда
	//				НоваяСтрокаТЧ = СписокАктивов.Добавить();
	//				НоваяСтрокаТЧ.ВалютаРасчета = ВалютаРасчета;
	//				НоваяСтрокаТЧ.СчетМандата 	= СтрокаСчета.СчетМандата;
	//				НоваяСтрокаТЧ.Актив			= ТекущийАктив;
	//				НоваяСтрокаТЧ.Количество	= СтрокаСчета.ОстатокНаКонец;
	//				НоваяСтрокаТЧ.WAP1			= WAP1;
	//				НоваяСтрокаТЧ.WAP2			= WAP2;
	//				
	//				СтруктураПоиска = Новый Структура("СчетМандата, Актив, Валюта");
	//				ЗаполнитьЗначенияСвойств(СтруктураПоиска, НоваяСтрокаТЧ);
	//				СтрокиИсточника = КэшОперацийИсточников.НайтиСтроки(СтруктураПоиска);
	//				Если СтрокиИсточника.Количество() > 0 Тогда
	//					СтрокаИсточника = СтрокиИсточника[0];
	//				Иначе
	//					СтрокаИсточника = КэшОперацийИсточников.Добавить();	
	//				КонецЕсли;
	//				ЗаполнитьЗначенияСвойств(СтрокаИсточника, НоваяСтрокаТЧ,, "Количество");
	//				СтрокаИсточника.Валюта = ВалютаРасчета;
	//			КонецЕсли; 
	//		КонецЦикла; 
	//	КонецЦикла; 
	//КонецЦикла; 
	#КонецОбласти

	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	СообщенияЗаполнения = "";
	СписокАктивов.Очистить();
	КэшКурсовВалют = Новый Соответствие;
	//Подготовим данные
#Вставка
  Если ТипЗнч(Данные) = Тип("Структура") Тогда
    СтруктураДанныхРасчета = Данные;
  Иначе
#КонецВставки
	СтруктураДанныхРасчета = Документы.РасчетСредневзвешеннойСтоимости.ПолучитьДанныеРасчета(Дата, Мандат);
#Вставка
  КонецЕсли;
#КонецВставки
	//Получим действующие валюты расчета
	ВалютыРасчета = СтруктураДанныхРасчета.ВалютыРасчета;
	//Получим зафиксированные котировки на дату документа
	ТаблицаКотировок = СтруктураДанныхРасчета.ТаблицаКотировок;
	//Определим флаг расчета WAP1
	Если ТипЗнч(СтруктураДанныхРасчета.ЭтоНачалоОтчетногоПериода) = Тип("Соответствие") Тогда
		ЗначениеФлагаЭНОП = СтруктураДанныхРасчета.ЭтоНачалоОтчетногоПериода.Получить(Мандат);
		ЭтоНачалоОтчетногоПериода = ?(ЗначениеФлагаЭНОП = Неопределено, Ложь, ЗначениеФлагаЭНОП);
	Иначе
		ЭтоНачалоОтчетногоПериода = СтруктураДанныхРасчета.ЭтоНачалоОтчетногоПериода;
	КонецЕсли;
	//Получим таблицу данных по предыдущим средневзвешенным стоимостям (по необходимым валютам)
	ТаблицаПредыдущихСтоимостей = СтруктураДанныхРасчета.ТаблицаПредыдущихСтоимостей;
	//Получим таблицу операций
	ТаблицаОпераций = СтруктураДанныхРасчета.ТаблицаОпераций;
	// IMAPPS-30289 ++
	//ТаблицаОпераций.Свернуть("Валюта, Актив, СчетМандата, СчетИсточник, МоментВремени, Порядок", "Количество, Сумма");
	ТаблицаОпераций.Свернуть("Валюта, Актив, СчетМандата, СчетИсточник, МоментВремени, Порядок, Реорганизация", "Количество, Сумма");
	// IMAPPS-30289 --
	ТаблицаОпераций.Сортировать("Порядок, МоментВремени");
	// Получим таблицу амортизационных облигаций
	ТаблицаАмортизационныхОблигаций = ТаблицаАмортизационныхОблигацийОстаточнаяСтоимость(ТаблицаПредыдущихСтоимостей.ВыгрузитьКолонку("Актив"));
	СоответствиеВход = СтруктураДанныхРасчета.РезультатаЗапроса;
	СоответствиеПоАктивам = СоответствиеВход;
	Если ТипЗнч(СоответствиеВход) = Тип("Соответствие") Тогда
		ВнутреннееПоМандату = СоответствиеВход.Получить(Мандат);
		Если ТипЗнч(ВнутреннееПоМандату) = Тип("Соответствие") Тогда
			СоответствиеПоАктивам = ВнутреннееПоМандату;
		КонецЕсли;
	КонецЕсли;
	Если СоответствиеПоАктивам = Неопределено Тогда
		СоответствиеПоАктивам = Новый Соответствие;
	КонецЕсли;
	МассивАктивовДляРасчета = Новый Массив;
	Для каждого КлючЗначение Из СоответствиеПоАктивам Цикл
		МассивАктивовДляРасчета.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	КэшОперацийИсточников = Новый ТаблицаЗначений;
	КэшОперацийИсточников.Колонки.Добавить("Актив");
	КэшОперацийИсточников.Колонки.Добавить("СчетМандата");
	КэшОперацийИсточников.Колонки.Добавить("Валюта");
	КэшОперацийИсточников.Колонки.Добавить("WAP1");
	КэшОперацийИсточников.Колонки.Добавить("WAP2");
	КэшОперацийИсточников.Колонки.Добавить("Количество");
	//Произведем расчет
	Для каждого ВалютаРасчета Из ВалютыРасчета Цикл
		КурсКратностьВалютыРасчета = КэшКурсовВалют.Получить(ВалютаРасчета);
		Если КурсКратностьВалютыРасчета = Неопределено Тогда
			КурсКратностьВалютыРасчета = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРасчета, Дата);
			КэшКурсовВалют.Вставить(ВалютаРасчета, КурсКратностьВалютыРасчета);
		КонецЕсли;
		Для каждого ТекущийАктив Из МассивАктивовДляРасчета Цикл
			КоэффициентАмортизации = КоэффициентАмортизацииОблигации(ТекущийАктив.Объект, ТаблицаАмортизационныхОблигаций); // MID-112
			ТаблицаСчетовПоАктиву = СоответствиеПоАктивам.Получить(ТекущийАктив);
			Если ТаблицаСчетовПоАктиву = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Для каждого СтрокаСчета Из ТаблицаСчетовПоАктиву Цикл
				СтрокиПредыдущейСтоимости = ТаблицаПредыдущихСтоимостей.НайтиСтроки(Новый Структура("Валюта, СчетМандата, Актив", ВалютаРасчета, СтрокаСчета.СчетМандата, ТекущийАктив));
				СтрокиОперацийПоАктиву = ТаблицаОпераций.НайтиСтроки(Новый Структура("СчетМандата, Актив", СтрокаСчета.СчетМандата, ТекущийАктив));
				// IMAPPS-30289 ++
				Если СтрокиОперацийПоАктиву.Количество() > 0 
					И СтрокиОперацийПоАктиву[0].Реорганизация Тогда 
					СтрокиПредыдущейСтоимости.Очистить();
				КонецЕсли;
				// IMAPPS-30289 --
				// Расчет
				МассивСтруктурОпераций = Новый Массив;
				Для каждого СтрокаОперации Из СтрокиОперацийПоАктиву Цикл
					ЭтоПеревод = Ложь;
					СтруктураОперации = Новый Структура("Сумма, Количество, Валюта, СуммаВВалютеРасчета, P, X");
					ЗаполнитьЗначенияСвойств(СтруктураОперации, СтрокаОперации);
					Если ЗначениеЗаполнено(СтрокаОперации.СчетИсточник) Тогда //Это перевод
						ЭтоПеревод = Истина;
						СтруктураОперации.СуммаВВалютеРасчета = Новый Массив;
						СтруктураОперации.Сумма = Новый Массив;
						СтруктураОперации.X = Новый Массив;
						СтрокиКэша = КэшОперацийИсточников.НайтиСтроки(Новый Структура("Валюта, СчетМандата, Актив", ВалютаРасчета, СтрокаОперации.СчетИсточник, ТекущийАктив));
						Если СтрокиКэша.Количество() > 0 Тогда
							// ВТБ
							//СтруктураОперации.Сумма.Добавить(СтрокиКэша[0].WAP1 * СтруктураОперации.Количество);	
							//СтруктураОперации.Сумма.Добавить(СтрокиКэша[0].WAP2 * СтруктураОперации.Количество);	
							СтруктураОперации.СуммаВВалютеРасчета.Добавить(СтрокиКэша[0].WAP1 * СтруктураОперации.Количество);	
							СтруктураОперации.СуммаВВалютеРасчета.Добавить(СтрокиКэша[0].WAP2 * СтруктураОперации.Количество);	
						Иначе
							СтруктураОперации.Сумма.Добавить(0);	
							СтруктураОперации.Сумма.Добавить(0);	
							СообщенияЗаполнения = СообщенияЗаполнения + ?(ПустаяСтрока(СообщенияЗаполнения), "", Символы.ПС);
							СообщенияЗаполнения = СообщенияЗаполнения + "При заполнении стоимости сделки по счету источнику " + Строка(СтрокаОперации.СчетИсточник)
							+ ", активу " + Строка(ТекущийАктив) + ", валюте " + Строка(ВалютаРасчета) + " данные WAP не найдены";
						КонецЕсли;
						// Временно
						Если НЕ ЗначениеЗаполнено(СтруктураОперации.Валюта) Тогда
							СтруктураОперации.Валюта = ВалютаРасчета; 
						КонецЕсли; 
					Иначе	
						Если СтруктураОперации.Валюта = ВалютаРасчета Тогда
							СтруктураОперации.СуммаВВалютеРасчета = СтруктураОперации.Сумма;
						Иначе
							КурсКратностьВалютыОперации = КэшКурсовВалют.Получить(СтруктураОперации.Валюта);
							Если КурсКратностьВалютыОперации = Неопределено Тогда
								КурсКратностьВалютыОперации = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтруктураОперации.Валюта, Дата);
								КэшКурсовВалют.Вставить(СтруктураОперации.Валюта, КурсКратностьВалютыОперации);
							КонецЕсли;
							Если ЭтоПеревод Тогда
								Для каждого ТекущаяСумма Из СтруктураОперации.Сумма Цикл
									//DDneprovsky IMAPPS-8216 12.04.2019 Если пытаемся пересчитать нулевую сумму в другую валюту - выведу сообщение
									Если ТекущаяСумма = 0 Тогда
										СообщенияЗаполнения = СообщенияЗаполнения + Символы.ПС + "Это перевод. Пытаемся сконвертировать нулевую сумму для актива " + ТекущийАктив + " в валюту " + СтруктураОперации.Валюта;
									КонецЕсли;	
									СтруктураОперации.СуммаВВалютеРасчета.Добавить(РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ТекущаяСумма, КурсКратностьВалютыОперации, КурсКратностьВалютыРасчета));	
								КонецЦикла; 
							Иначе	
								//DDneprovsky IMAPPS-8216 12.04.2019 Если пытаемся пересчитать нулевую сумму в другую валюту - выведу сообщение
								Если СтруктураОперации.Сумма = 0 Тогда
									СообщенияЗаполнения = СообщенияЗаполнения + Символы.ПС + "Это не перевод. Пытаемся сконвертировать нулевую сумму для актива " + ТекущийАктив + " в валюту " + СтруктураОперации.Валюта;
								КонецЕсли;	
								СтруктураОперации.СуммаВВалютеРасчета = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтруктураОперации.Сумма, КурсКратностьВалютыОперации, КурсКратностьВалютыРасчета);	
							КонецЕсли; 
						КонецЕсли;
					КонецЕсли;
					Если СтруктураОперации.Количество = 0 Тогда
						Если ЭтоПеревод Тогда
							СтруктураОперации.X.Добавить(0);
							СтруктураОперации.X.Добавить(0);
						Иначе
							СтруктураОперации.X = 0;
						КонецЕсли; 
					Иначе
						Если ЭтоПеревод Тогда
							Для каждого ТекущаяСуммаВВалютеРасчета Из СтруктураОперации.СуммаВВалютеРасчета Цикл
								СтруктураОперации.X.Добавить(ТекущаяСуммаВВалютеРасчета / СтруктураОперации.Количество);
							КонецЦикла; 
							//MID-194 {
							Если ТипЗнч(СтруктураОперации.X) = Тип("Массив") И СтруктураОперации.X.Количество() = 0 Тогда
								СтруктураОперации.X.Добавить(0);
								СтруктураОперации.X.Добавить(0);
							КонецЕсли;
							//MID-194 }
						Иначе	
							СтруктураОперации.X = СтруктураОперации.СуммаВВалютеРасчета / СтруктураОперации.Количество;
						КонецЕсли; 
					КонецЕсли;
					МассивСтруктурОпераций.Добавить(СтруктураОперации);
				КонецЦикла;
				WAP1_P0 = 0;
				WAP1_X0 = 0;
				WAP2_P0 = 0;
				WAP2_X0 = 0;
				ПредыдущееКоличество = 0;
				Если СтрокиПредыдущейСтоимости.Количество() > 0 Тогда
					ПредыдущееКоличество = СтрокиПредыдущейСтоимости[0].Количество;
					WAP2_X0 = СтрокиПредыдущейСтоимости[0].WAP2;
					Если ЭтоНачалоОтчетногоПериода Тогда
						СтрокаКотировки = ТаблицаКотировок.Найти(ТекущийАктив, "Актив");
						Если СтрокаКотировки <> Неопределено Тогда
							Если СтрокаКотировки.Валюта <> ВалютаРасчета Тогда
								КурсКратностьКотировки = КэшКурсовВалют.Получить(СтрокаКотировки.Валюта);
								Если КурсКратностьКотировки = Неопределено Тогда
									КурсКратностьКотировки = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтрокаКотировки.Валюта, Дата);
									КэшКурсовВалют.Вставить(СтрокаКотировки.Валюта, КурсКратностьКотировки);
								КонецЕсли;
								//DDneprovsky IMAPPS-8216 12.04.2019 Если пытаемся пересчитать нулевую сумму в другую валюту - выведу сообщение
								Если СтрокаКотировки.Котировка = 0 Тогда
									СообщенияЗаполнения = СообщенияЗаполнения + Символы.ПС + "Конвертация котировки. Пытаемся сконвертировать нулевую сумму для актива " + ТекущийАктив + " в валюту " + СтрокаКотировки.Валюта;
								КонецЕсли;	
								// MPazhukov IMAPPS-10288 - ПересчитатьПоКурсу округляет до 2х знаков, нужно больше
								//WAP1_X0 = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаКотировки.Котировка, КурсКратностьКотировки, КурсКратностьВалютыРасчета);
								WAP1_X0 = Окр(СтрокаКотировки.Котировка * ((КурсКратностьКотировки.Курс * КурсКратностьВалютыРасчета.Кратность) / (КурсКратностьВалютыРасчета.Курс * КурсКратностьКотировки.Кратность)), 4);
								// MPazhukov IMAPPS-10288
							Иначе	
								WAP1_X0 = СтрокаКотировки.Котировка;
							КонецЕсли; 
						КонецЕсли; 
					Иначе	
						WAP1_X0 = СтрокиПредыдущейСтоимости[0].WAP1;
					КонецЕсли; 
				КонецЕсли;
				// MID-112{
				WAP1_X0 = WAP1_X0 * КоэффициентАмортизации;
				WAP2_X0 = WAP2_X0 * КоэффициентАмортизации; 
				// }MID-112

				//Рассчитаем P0
				ЧислительWAP1 = ПредыдущееКоличество;
				ЗнаменательWAP1 = ЧислительWAP1;
				ЧислительWAP2 = ПредыдущееКоличество;
				ЗнаменательWAP2 = ЧислительWAP2;
				Для каждого СтруктураОперации Из МассивСтруктурОпераций Цикл
					ЗнаменательWAP1 = ЗнаменательWAP1 + СтруктураОперации.Количество;
					ЗнаменательWAP2 = ЗнаменательWAP2 + СтруктураОперации.Количество;
				КонецЦикла; 
				Если ЗнаменательWAP1 <> 0 Тогда
					WAP1_P0 = ЧислительWAP1 / ЗнаменательWAP1;
				КонецЕсли; 
				Если ЗнаменательWAP2 <> 0 Тогда
					WAP2_P0 = ЧислительWAP2 / ЗнаменательWAP2;
				КонецЕсли;
				//Произведем расчет WAP1, WAP2
				WAP1 = WAP1_P0 * WAP1_X0;
				WAP2 = WAP2_P0 * WAP2_X0;
				Для каждого СтруктураОперации Из МассивСтруктурОпераций Цикл
					Если ЗнаменательWAP1 > 0 Тогда
						Если ТипЗнч(СтруктураОперации.X) = Тип("Массив") Тогда
							WAP1 = WAP1 + (СтруктураОперации.X[0] * (СтруктураОперации.Количество / ЗнаменательWAP1));
						Иначе
							WAP1 = WAP1 + (СтруктураОперации.X * (СтруктураОперации.Количество / ЗнаменательWAP1));
						КонецЕсли; 
					КонецЕсли; 
					Если ЗнаменательWAP2 > 0 Тогда
						Если ТипЗнч(СтруктураОперации.X) = Тип("Массив") Тогда
							WAP2 = WAP2 + (СтруктураОперации.X[1] * (СтруктураОперации.Количество / ЗнаменательWAP2));
						Иначе
							WAP2 = WAP2 + (СтруктураОперации.X * (СтруктураОперации.Количество / ЗнаменательWAP2));
						КонецЕсли;	
					КонецЕсли; 
				КонецЦикла;
				Если СтрокаСчета.ОстатокНаКонец <> 0
					ИЛИ WAP1 <> 0 
					ИЛИ WAP2 <> 0 Тогда
					НоваяСтрокаТЧ = СписокАктивов.Добавить();
					НоваяСтрокаТЧ.ВалютаРасчета = ВалютаРасчета;
					НоваяСтрокаТЧ.СчетМандата = СтрокаСчета.СчетМандата;
					НоваяСтрокаТЧ.Актив	= ТекущийАктив;
					НоваяСтрокаТЧ.Количество	= СтрокаСчета.ОстатокНаКонец;
					НоваяСтрокаТЧ.WAP1	= WAP1;
					НоваяСтрокаТЧ.WAP2	= WAP2;
					СтруктураПоиска = Новый Структура("СчетМандата, Актив, Валюта");
					ЗаполнитьЗначенияСвойств(СтруктураПоиска, НоваяСтрокаТЧ);
					СтрокиИсточника = КэшОперацийИсточников.НайтиСтроки(СтруктураПоиска);
					Если СтрокиИсточника.Количество() > 0 Тогда
						СтрокаИсточника = СтрокиИсточника[0];
					Иначе
						СтрокаИсточника = КэшОперацийИсточников.Добавить();	
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(СтрокаИсточника, НоваяСтрокаТЧ,, "Количество");
					СтрокаИсточника.Валюта = ВалютаРасчета;
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла;

КонецПроцедуры
