
////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(Основание, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение") Тогда
		Если Основание.ВидОперацииД = Справочники.ВидыОпераций.УчастиеВКД Тогда
			ДокументОснование	= Основание.Ссылка;			
			Дата				= ОбщегоНазначения.ДатаДокумента(Основание);
			ЦеннаяБумага		= Основание.ЦБ;
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание, "КарточкаКД, ВидКД, Инициатор, НомерОпцииКДВыкуп, КоличествоЦБ, Депонент, СчетДепо");
			ОтветыНаВопросыКГолосованию.Очистить();
			Для каждого СтрокаТЧ из Основание.ОтветыНаВопросыКГолосованию Цикл
				НоваяСтрока = ОтветыНаВопросыКГолосованию.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			КонецЦикла;
		Иначе	                      
			СтандартнаяОбработка = Ложь;
			Сообщить("На основании данного вида поручения нельзя создать документ Участие в КД!!!");
			Возврат;
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПоСобытию(ЭтотОбъект, "Запись");
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
	Если Не ЭтоНовый() Тогда
		Изменил	= ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Автор	= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка	= Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры
