Перем мТекстСостоянияПроведен;
Перем мТекстСостоянияНеПроведен;
Перем мТекстСостоянияПомеченНаУдаление;

/////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС

Функция РезультатОбновленияОтчета(ДокументРезультат) Экспорт
	Результат = Новый Структура;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат Результат;
	КонецЕсли;
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");	
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	КомпНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпНастроек.ЗагрузитьНастройки(Настройки);	
	СтруктураПараметров = СтруктураПараметровОтчета();
	ЗаполнитьПараметрыПоСтруктуреПараметров(КомпНастроек.Настройки, СтруктураПараметров);
	Настройки = КомпНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ВывестиКартинкиДокументов(ДокументРезультат, ДанныеРасшифровки);
	
	Результат.Вставить("ДанныеРасшифровки", ДанныеРасшифровки);
	Возврат Результат;
КонецФункции

/////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РЕАЛИЗАЦИИ

Функция СтруктураПараметровОтчета()
	Структура = Новый Структура;		// Ключ - имя параметра СКД; Значение - значение реквизита с формы
	Структура.Вставить("КД",	КД);
	Структура.Вставить("WTRC",	Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("WTRC"));
	
	Структура.Вставить("Проведен",			мТекстСостоянияПроведен);
	Структура.Вставить("НеПроведен",		мТекстСостоянияНеПроведен);
	Структура.Вставить("ПомеченНаУдаление",	мТекстСостоянияПомеченНаУдаление);
	
	ВидыОперацийПоручения1_5 = Новый Массив;
	ВидыОперацийПоручения1_5.Добавить(Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо);
	ВидыОперацийПоручения1_5.Добавить(Справочники.ВидыОпераций.Перемещение);
	Структура.Вставить("ВидыОперацийПоручения1_5",	ВидыОперацийПоручения1_5);
	
	ВидыОперацийПоручения1_10 = Новый Массив;
	ВидыОперацийПоручения1_10.Добавить(Справочники.ВидыОпераций.УчастиеВКД);
	Структура.Вставить("ВидыОперацийПоручения1_10",	ВидыОперацийПоручения1_10);
	
	Возврат Структура;
КонецФункции

Процедура ЗаполнитьПараметрыПоСтруктуреПараметров(Настройки, СтруктураПараметров)
	Для Каждого Элемент Из СтруктураПараметров Цикл
		Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Элемент.Ключ));
		Если Параметр <> Неопределено Тогда
			Параметр.Значение = Элемент.Значение;
			Параметр.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ВывестиКартинкиДокументов(ДокументРезультат, ДанныеРасшифровки)
	ПоляКартинок = Новый Массив;
	ПоляКартинок.Добавить("КДСостояние");
	ПоляКартинок.Добавить("УведомлениеСостояние");
	ПоляКартинок.Добавить("ПоручениеСостояние");
	ПоляКартинок.Добавить("РаскрытиеСостояние");
	
	КоличествоСтрок = ДокументРезультат.ВысотаТаблицы;
	КоличествоКолонок = ДокументРезультат.ШиринаТаблицы;
	
	Для СтрокаДокумента = 1 По КоличествоСтрок Цикл
		Для КолонкаДокумента = 1 По КоличествоКолонок Цикл
			
			Область = ДокументРезультат.Область(СтрокаДокумента, КолонкаДокумента);
			Расшифровка = Область.Расшифровка;
			Если ТипЗнч(Расшифровка) <> Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			
			ПоляРасшифровки = ДанныеРасшифровки.Элементы.Получить(Расшифровка).ПолучитьПоля();
			
			НайденноеПоле = Неопределено;
			Для Каждого Элемент Из ПоляКартинок Цикл
				НайденноеПоле = ПоляРасшифровки.Найти(Элемент);
				Если НайденноеПоле <> Неопределено Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НайденноеПоле = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Картинка = КартинкаПоСостояниюДокумента(НайденноеПоле.Значение);
			
			Если Картинка <> Неопределено Тогда
				КартинкаВДокументе = ДокументРезультат.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
				КартинкаВДокументе.Картинка			= Картинка;
				КартинкаВДокументе.РазмерКартинки	= РазмерКартинки.РеальныйРазмер;
				КартинкаВДокументе.ГраницаСверху	= Ложь;
				КартинкаВДокументе.ГраницаСлева		= Ложь;
				КартинкаВДокументе.ГраницаСнизу		= Ложь;
				КартинкаВДокументе.ГраницаСправа	= Ложь;
				КартинкаВДокументе.Расположить(Область);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция КартинкаПоСостояниюДокумента(Состояние)
	Картинка = Неопределено;
	
	Если Состояние = мТекстСостоянияПроведен Тогда
		Картинка = БиблиотекаКартинок.Провести;
		
	ИначеЕсли Состояние = мТекстСостоянияНеПроведен Тогда
		Картинка = БиблиотекаКартинок.РежимПросмотраСпискаСписок;
		
	ИначеЕсли Состояние = мТекстСостоянияПомеченНаУдаление Тогда
		Картинка = БиблиотекаКартинок.ПометитьНаУдаление;
	КонецЕсли;
	
	Возврат Картинка;
КонецФункции

/////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мТекстСостоянияПроведен			= "Проведен";
мТекстСостоянияНеПроведен		= "Не проведен";
мТекстСостоянияПомеченНаУдаление= "Помечен на удаление";

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
