
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьПоДокументам();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЭтап(Команда)
	ВыполнитьЭтапНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЭтапНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Ошибка = ОбработкаОбъект.РезультатИсполненияЭтапаОбработки();
	Если ЗначениеЗаполнено(Ошибка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка);
	КонецЕсли;	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры
