
//#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КонтактнаяИнформацияСервер.ПриСозданииНаСервере(ЭтаФорма);
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	СписокW8УстановитьОтборы();
	КвалифицированныйИнвесторУстановитьОтборы();
	КлиентыДоговорыУстановитьОтборы();
	КлиентскиеМенеджерыУстановитьОтборы();
	
	КИПоЗакону = РегистрыСведений.РеестрКвалифицированныхИнвесторовПоЗакону.ЕстьКИПОЗакону(Объект.Ссылка, ТекущаяДатаСеанса());
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПрочитатьНаборыЗаписейНаСервере(ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступность();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		ЭтоНовоеЮридическоеЛицоИМеждународнаяКомпания = Ложь;
		РегистрыСведений.ЮридическиеЛицаМеждународныеКомпании.ИзменитьПризнакМеждународнаяКомпанияЮридическогоЛица(ТекущийОбъект.Ссылка,
			ТекущийОбъект, Отказ);
	Иначе
		ЭтоНовоеЮридическоеЛицоИМеждународнаяКомпания = ТекущийОбъект.МеждународнаяКомпания;
		Если ТекущийОбъект.МеждународнаяКомпания И Не ЗначениеЗаполнено(ТекущийОбъект.ДатаСменыСтатусаМеждународнаяКомпания) Тогда
			ТекущийОбъект.ДатаСменыСтатусаМеждународнаяКомпания = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли;
	ПараметрыЗаписи.Вставить("ЭтоНовоеЮридическоеЛицоИМеждународнаяКомпания", ЭтоНовоеЮридическоеЛицоИМеждународнаяКомпания);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.ЭтоНовоеЮридическоеЛицоИМеждународнаяКомпания Тогда
		РегистрыСведений.ЮридическиеЛицаМеждународныеКомпании.УстановитьПризнакМеждународнаяКомпания(
			ТекущийОбъект.ДатаСменыСтатусаМеждународнаяКомпания, ТекущийОбъект.Ссылка, ТекущийОбъект.МеждународнаяКомпания,
			ТекущийОбъект.ПризнакРегистрацииМеждународнойКомпании);
	КонецЕсли;
	ЗаписатьНаборыЗаписейНаСервере(Отказ, ТекущийОбъект);
	КонтактнаяИнформацияСервер.ПриЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СписокW8УстановитьОтборы();
	КвалифицированныйИнвесторУстановитьОтборы();
	КлиентыДоговорыУстановитьОтборы();
	КлиентскиеМенеджерыУстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьДоступность();
КонецПроцедуры

//#КонецОбласти 

//#Область ОбработчикиСобытийЭлементовТаблицыФормыНаборКонтактнаяИнформация

&НаКлиенте
Процедура НаборКонтактнаяИнформацияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	КонтактнаяИнформацияКлиент.НачалоВыбораПредставления(ЭтаФорма);
КонецПроцедуры

//#КонецОбласти 

//#Область ОбработчикиСобытийЭлементовТаблицыКлиентыДоговоры

&НаКлиенте
Процедура КлиентыДоговорыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанныеТаблицыКлиентыДоговоры = Элементы.КлиентыДоговоры.ТекущиеДанные;
	Если ТекДанныеТаблицыКлиентыДоговоры <> Неопределено Тогда
		Если Элементы.КлиентыДоговоры.ТекущийЭлемент = Элементы.КлиентыДоговорыКлиент Тогда
			ПоказатьЗначение(, ТекДанныеТаблицыКлиентыДоговоры.Клиент);	
		ИначеЕсли Элементы.КлиентыДоговоры.ТекущийЭлемент = Элементы.КлиентыДоговорыДоговор Тогда
			ПоказатьЗначение(, ТекДанныеТаблицыКлиентыДоговоры.Договор);				
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

//#КонецОбласти 

&НаКлиенте
Процедура НаборW8ПриАктивизацииСтроки(Элемент)
	Если Элементы.НаборW8.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элементы.НаборW8.ТекущиеДанные.ПредоставленнаяФорма) Тогда
		ФормаW8 = Элементы.НаборW8.ТекущиеДанные.ПредоставленнаяФорма;
	Иначе
		ФормаW8 = ПредопределенноеЗначение("Справочник.ФормыW8.ПустаяСсылка");
	КонецЕсли;
	
	Элементы.Группа1.Доступность = ЗначениеЗаполнено(ФормаW8);
КонецПроцедуры


//#Область КомандыФормы

&НаКлиенте
Процедура АнкетаЮридическогоЛица(Команда)
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед формированием анкеты необходимо сохранить внесенные изменения!");
		Возврат;
	КонецЕсли;
	ТабДок = АнкетаЮридическогоЛицаНаСервере();
	ТабДок.Показать("Анкета юр. лица "+СокрЛП(Объект.Наименование));
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСменыСтатусаМеждународнаяКомпания(Команда)
	
	ОткрытьИсториюИзмененияСтатусаМеждународнаяКомпанияНаКлиенте();
	
КонецПроцедуры

//#КонецОбласти 

//#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьИсториюИзмененияСтатусаМеждународнаяКомпанияНаКлиенте()
	
	ОтборПоЮридическомуЛицу = Новый Структура("ЮридическоеЛицо", Объект.Ссылка);
	ПараметрыФормыРегистра = Новый Структура("Отбор", ОтборПоЮридическомуЛицу);
	ОткрытьФорму("РегистрСведений.ЮридическиеЛицаМеждународныеКомпании.ФормаСписка", ПараметрыФормыРегистра,
		ЭтотОбъект, Объект.Ссылка, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

//#Область Сервис

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоНовый(Форма)
	Возврат НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка);	
КонецФункции 

//#КонецОбласти 

//#Область ВызовСервера

&НаСервере
Функция АнкетаЮридическогоЛицаНаСервере()
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектФормы.АнкетаОбщиеСведения();
	
КонецФункции
 
//#КонецОбласти 

&НаСервере
Процедура СписокW8УстановитьОтборы() 
	
	ДинСписок = ЭтаФорма.НаборW8;
	ПараметрЮрлицо = ДинСписок.Параметры.Элементы.Найти("Юрлицо");
	ПараметрЮрлицо.Использование = Истина;
	ПараметрЮрлицо.Значение = ЭтаФорма.Объект.Ссылка;
	
	Элементы.СтраницаФормыW8.Доступность = ЗначениеЗаполнено(Объект.Ссылка);	
	
КонецПроцедуры

&НаСервере
Процедура КвалифицированныйИнвесторУстановитьОтборы()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КвалифицированныйИнвестор, "ЮрФизЛицо",
		Объект.Ссылка, , , ЗначениеЗаполнено(Объект.Ссылка));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КвалифицированныйИнвестор, "Организация",
		Константы.ОрганизацияПоУмолчанию.Получить(), , , ЗначениеЗаполнено(Объект.Ссылка));
КонецПроцедуры

&НаСервере
Процедура КлиентыДоговорыУстановитьОтборы()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КлиентыДоговоры, "ЮрФизЛицо", Объект.Ссылка, , ,
		ЗначениеЗаполнено(Объект.Ссылка));
КонецПроцедуры

&НаСервере
Процедура КлиентскиеМенеджерыУстановитьОтборы()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КлиентскиеМенеджеры, "ЮрФизЛицо",
		Объект.Ссылка, , , ЗначениеЗаполнено(Объект.Ссылка));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	
	Элементы.СтраницаКвалифицированныйИнвестор.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.СтраницаКлиентыДоговоры.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
	
КонецПроцедуры

//#Область НаборыЗаписей

&НаСервере
Процедура ЗаписатьНаборыЗаписейНаСервере(Отказ, ТекущийОбъект)
	ЗначениеОтбора = ТекущийОбъект.Ссылка;
	
	ЗаписатьНаборЗаписейНаСервере("НаборВлиятельныеЛица", "ЮрЛицо", ЗначениеОтбора, Отказ);	
	ЗаписатьНаборЗаписейНаСервере("НаборЛицензии", "ЮрЛицо", ЗначениеОтбора, Отказ);	
	ЗаписатьНаборЗаписейНаСервере("НаборСосбственныеСредства", "ЮрЛицо", ЗначениеОтбора, Отказ);	
	ЗаписатьНаборЗаписейНаСервере("НаборУчередители", "ЮрЛицо", ЗначениеОтбора, Отказ);	
	ЗаписатьНаборЗаписейНаСервере("НаборПредставители", "Клиент", ЗначениеОтбора, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборыЗаписейНаСервере(ТекущийОбъект)	
	ЗначениеОтбора = ТекущийОбъект.Ссылка;
	
	ПрочитатьНаборЗаписейНаСервере("НаборВлиятельныеЛица", "ЮрЛицо", ЗначениеОтбора);	
	ПрочитатьНаборЗаписейНаСервере("НаборЛицензии", "ЮрЛицо", ЗначениеОтбора);	
	ПрочитатьНаборЗаписейНаСервере("НаборСосбственныеСредства", "ЮрЛицо", ЗначениеОтбора);	
	ПрочитатьНаборЗаписейНаСервере("НаборУчередители", "ЮрЛицо", ЗначениеОтбора);		
	ПрочитатьНаборЗаписейНаСервере("НаборПредставители", "Клиент", ЗначениеОтбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаборЗаписейНаСервере(ИмяЭлемента, ИмяПоля, ЗначениеОтбора, Отказ)
	
	Если Отказ Тогда
		Возврат;		
	КонецЕсли; 
	
	НаборЗначение = РеквизитФормыВЗначение(ИмяЭлемента);
	НаборЗначение.Отбор[ИмяПоля].Установить(ЗначениеОтбора);
	Для каждого ЗаписьНабора Из НаборЗначение Цикл
		ЗаписьНабора[ИмяПоля] = ЗначениеОтбора;		
	КонецЦикла; 
	
	Попытка
		НаборЗначение.Записать();
	Исключение
		МетаНабор = НаборЗначение.Метаданные();
		
		ОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки,
		Отказ,
		"Элемент """ + СокрЛП(ЗначениеОтбора) + """ не записан. Не записан набор " + МетаНабор.Синоним + ".");			
	КонецПопытки;
			
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборЗаписейНаСервере(ИмяЭлемента, ИмяПоля, ЗначениеОтбора)
	
	Если ЭтоНовый(ЭтаФорма) Тогда
		Возврат;		
	КонецЕсли; 
	
	НаборЗначение = РеквизитФормыВЗначение(ИмяЭлемента);
	НаборЗначение.Отбор[ИмяПоля].Установить(ЗначениеОтбора);
	НаборЗначение.Прочитать();
	ЗначениеВРеквизитФормы(НаборЗначение, ИмяЭлемента);
		
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленныеДокументыИзменитьЭлемент(Команда)
	ДанныеСтроки = Элементы.НаборW8.ТекущиеДанные;
	ОткрытьТекущуюЗаписьПредоставленныхФорм(ДанныеСтроки, ДанныеСтроки.Депонент, ДанныеСтроки.Лицо);
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДанныеСтроки = Элементы.НаборW8.ТекущиеДанные;
	ОткрытьТекущуюЗаписьПредоставленныхФорм(ДанныеСтроки, ДанныеСтроки.Депонент, ДанныеСтроки.Лицо);
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленныеДокументыДобавить(Команда)
	ОткрытьФорму("РегистрСведений.ПредоставленныеДокументы.ФормаЗаписи");
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленныеДокументыУдалить(Команда)
	ДанныеСтроки = Элементы.НаборW8.ТекущиеДанные;
	Если ДанныеСтроки <> Неопределено Тогда
		Если Вопрос("Удалить запись о предоставленном документе?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ПредоставленныеДокументыУдалитьСервер(ДанныеСтроки.Период, ДанныеСтроки.Лицо,
				ДанныеСтроки.Депонент, ДанныеСтроки.ВидДокумента);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПредоставленныеДокументыСкопировать(Команда)
	ДанныеСтроки = Элементы.НаборW8.ТекущиеДанные;
	Если ДанныеСтроки <> Неопределено Тогда
		ПараметрыЗаполнения = Новый Структура("Период, Лицо, Депонент,ВидДокумента,СрокДействия,"
			+ "ДатаПредоставления,Примечание,ПредоставленнаяФорма");
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ДанныеСтроки);
		ПараметрыЗаполнения.Депонент = ДанныеСтроки.Депонент;
		ПараметрыЗаполнения.Лицо = ДанныеСтроки.Лицо;
		СтруктураЗаполнения = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);
		ОткрытьФорму("РегистрСведений.ПредоставленныеДокументы.ФормаЗаписи", СтруктураЗаполнения, , Новый УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПредоставленныеДокументыУдалитьСервер(Период, Лицо, Депонент, ВидДокумента) Экспорт
	Запись = РегистрыСведений.ПредоставленныеДокументы.СоздатьМенеджерЗаписи();
	Запись.Период = Период;
	Запись.Лицо = Лицо;
	Запись.Депонент = Депонент;
	Запись.ВидДокумента = ВидДокумента;
	Запись.Удалить();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекущуюЗаписьПредоставленныхФорм(ДанныеСтроки, Депонент, Лицо)
	Если ДанныеСтроки <> Неопределено Тогда
		Если ТипЗнч(ДанныеСтроки.ВидДокумента) = Тип("СправочникСсылка.ВидыДокументовУдостоверяющихПолномочия") Тогда
			ПараметрыКлюча = Новый Массив;
			СтруктураПараметровКлюча = Новый Структура("Период,Депонент,Лицо,ВидДокумента", ДанныеСтроки.Период, Депонент, Лицо,
			ДанныеСтроки.ВидДокумента);
			ПараметрыКлюча.Добавить(СтруктураПараметровКлюча);
			КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.ПредоставленныеДокументы", ПараметрыКлюча);
			ОткрытьФорму("РегистрСведений.ПредоставленныеДокументы.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписи));
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для данной формы нет записи в регистре ""Предоставленные документы""");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//#КонецОбласти 

//#КонецОбласти 


