
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мПроводникXDTO;
Перем ДопОбработка Экспорт;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.1.1.12");
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.09";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Операции после обмена'");
	НоваяКоманда.Идентификатор = "ОперацииПослеОбмена";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ВыполнитьОбработку(ОбъектЗапрос) Экспорт
	
	Настройки = ДопОбработка.ХранилищеНастроек;
	УстановитьНастройкиОтчета(Настройки);
	
	КомментарийОбъектXDTO = мПроводникXDTO.ЗначениеСвойства(ОбъектЗапрос.Заголовок, "Комментарий");
	
	Если Не ЗначениеЗаполнено(КомментарийОбъектXDTO) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПерерасчетРСА = Ложь;
	ТребуетсяПерерасчетРСАПоВсемПортфелям = Ложь;
	ТребуетсяПерерасчетРСАМассивКодовПортфелей = Новый Массив;
	ТребуетсяПерерасчетРСАМассивПортфелей = Новый Массив;
	ТребуетсяПерерасчетРСАДата = НачалоДня(ТекущаяДатаСеанса());
	ТребуетсяПерерасчетРСАВыполнитьРассылку = Ложь;
	ТребуетсяПерерасчетРСАДатаНачала = Дата(1, 1, 1);
	ТребуетсяПерерасчетРСАДатаОкончания = Дата(1, 1, 1);
	ТребуетсяПерерасчетРСАИдентификаторСеанса = "";
	
	ТребуетсяУдалениеБлокировок = Ложь;
	ТребуетсяУдалениеБлокировокМассивКодовПортфелей = Новый Массив;
	ТребуетсяУдалениеБлокировокМассивПортфелей = Новый Массив;
	ТребуетсяУдалениеБлокировокТаблицаДляУдаленияБлокировок = Новый ТаблицаЗначений;
	ТребуетсяУдалениеБлокировокДата = НачалоДня(ТекущаяДатаСеанса());
	ТребуетсяУдалениеБлокировокИдентификаторСеанса = "";
	
	ТребуетсяРаспространениеПравил = Ложь;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(КомментарийОбъектXDTO);
	ПараметрыОбмена = ПрочитатьJSON(ЧтениеJSON);
	
	Если ТипЗНЧ(ПараметрыОбмена) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОбмена.Свойство("ТребуетсяПерерасчетРСА", ТребуетсяПерерасчетРСА);
	ПараметрыОбмена.Свойство("ТребуетсяПерерасчетРСАПоВсемПортфелям", ТребуетсяПерерасчетРСАПоВсемПортфелям);
	ПараметрыОбмена.Свойство("ТребуетсяПерерасчетРСАИдентификаторСеанса", ТребуетсяПерерасчетРСАИдентификаторСеанса);
	
	Если ПараметрыОбмена.Свойство("ТребуетсяПерерасчетРСАМассивКодовПортфелей", ТребуетсяПерерасчетРСАМассивКодовПортфелей) Тогда
		ТребуетсяПерерасчетРСАМассивПортфелей = НайтиПортфелиПоКодам(ТребуетсяПерерасчетРСАМассивКодовПортфелей);
	КонецЕсли;
	
	Если ПараметрыОбмена.Свойство("ТребуетсяПерерасчетРСАДата", ТребуетсяПерерасчетРСАДата) Тогда
		ТребуетсяПерерасчетРСАДата = СтрЗаменить(ТребуетсяПерерасчетРСАДата, "-", "");
		ТребуетсяПерерасчетРСАДата = Лев(ТребуетсяПерерасчетРСАДата, 8);
		ТребуетсяПерерасчетРСАДата = Дата(ТребуетсяПерерасчетРСАДата);
	КонецЕсли;
	
	ПараметрыОбмена.Свойство("ТребуетсяПерерасчетРСАВыполнитьРассылку", ТребуетсяПерерасчетРСАВыполнитьРассылку);
	
	Если ПараметрыОбмена.Свойство("ТребуетсяПерерасчетРСАДатаНачала", ТребуетсяПерерасчетРСАДатаНачала) Тогда
		ТребуетсяПерерасчетРСАДатаНачала = СтрЗаменить(ТребуетсяПерерасчетРСАДатаНачала, "-", "");
		ТребуетсяПерерасчетРСАДатаНачала = СтрЗаменить(ТребуетсяПерерасчетРСАДатаНачала, "T", "");
		ТребуетсяПерерасчетРСАДатаНачала = СтрЗаменить(ТребуетсяПерерасчетРСАДатаНачала, ":", "");
		ТребуетсяПерерасчетРСАДатаНачала = Дата(ТребуетсяПерерасчетРСАДатаНачала);
	КонецЕсли;
	
	Если ПараметрыОбмена.Свойство("ТребуетсяПерерасчетРСАДатаОкончания", ТребуетсяПерерасчетРСАДатаОкончания) Тогда
		ТребуетсяПерерасчетРСАДатаОкончания = СтрЗаменить(ТребуетсяПерерасчетРСАДатаОкончания, "-", "");
		ТребуетсяПерерасчетРСАДатаОкончания = СтрЗаменить(ТребуетсяПерерасчетРСАДатаОкончания, "T", "");
		ТребуетсяПерерасчетРСАДатаОкончания = СтрЗаменить(ТребуетсяПерерасчетРСАДатаОкончания, ":", "");
		ТребуетсяПерерасчетРСАДатаОкончания = Дата(ТребуетсяПерерасчетРСАДатаОкончания);
	КонецЕсли;
	
	ПараметрыОбмена.Свойство("ТребуетсяУдалениеБлокировок", ТребуетсяУдалениеБлокировок);
	
	Если ПараметрыОбмена.Свойство("ТребуетсяУдалениеБлокировокДата", ТребуетсяУдалениеБлокировокДата) Тогда
		ТребуетсяУдалениеБлокировокДата = СтрЗаменить(ТребуетсяУдалениеБлокировокДата, "-", "");
		ТребуетсяУдалениеБлокировокДата = СтрЗаменить(ТребуетсяУдалениеБлокировокДата, "T", "");
		ТребуетсяУдалениеБлокировокДата = СтрЗаменить(ТребуетсяУдалениеБлокировокДата, ":", "");
		ТребуетсяУдалениеБлокировокДата = Дата(ТребуетсяУдалениеБлокировокДата);
	КонецЕсли;
	
	ПараметрыОбмена.Свойство("ТребуетсяУдалениеБлокировокИдентификаторСеанса", ТребуетсяУдалениеБлокировокИдентификаторСеанса);
	
	Если ПараметрыОбмена.Свойство("ТребуетсяУдалениеБлокировокМассивКодовПортфелей", ТребуетсяУдалениеБлокировокМассивКодовПортфелей) Тогда
		ТребуетсяУдалениеБлокировокМассивПортфелей = НайтиПортфелиПоКодам(ТребуетсяУдалениеБлокировокМассивКодовПортфелей);
	КонецЕсли;
	
	ПараметрыОбмена.Свойство("ТребуетсяУдалениеБлокировокТаблицаДляУдаленияБлокировок", ТребуетсяУдалениеБлокировокТаблицаДляУдаленияБлокировок);
	
	ПараметрыОбмена.Свойство("ТребуетсяРаспространениеПравил", ТребуетсяРаспространениеПравил);
	
	Если ТребуетсяПерерасчетРСА = Истина Тогда
		
		ПараметрыВыполненияОбработки = Новый Структура;
		ПараметрыВыполненияОбработки.Вставить("ИдентификаторСеанса", ТребуетсяПерерасчетРСАИдентификаторСеанса);
		ПараметрыВыполненияОбработки.Вставить("Дата", ТребуетсяПерерасчетРСАДата);
		ПараметрыВыполненияОбработки.Вставить("МассивПортфелей", ТребуетсяПерерасчетРСАМассивПортфелей);
		ПараметрыВыполненияОбработки.Вставить("ПоВсемПортфелям", ТребуетсяПерерасчетРСАПоВсемПортфелям);
		ПараметрыВыполненияОбработки.Вставить("ОбработкаПерерасчетаСтоимости", ОбработкаПерерасчетаСтоимости);
		
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка", 			Истина);
		ПараметрыЗадания.Вставить("ПараметрыВыполнения", 			ПараметрыВыполненияОбработки);
		ПараметрыЗадания.Вставить("ИмяМетода", 						"ВыполнитьПерерасчетВФоне");
		ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка", 	ОбработкаПерерасчетаСтоимости);
		
		Идентификатор = Новый УникальныйИдентификатор;
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Идентификатор);
		Если ТребуетсяПерерасчетРСАПоВсемПортфелям Тогда
			ПараметрыВыполнения.НаименованиеФоновогоЗадания = Нстр("ru = 'Пересчет фактической позиции и РСА по всем портфелям'");
		Иначе
			ПараметрыВыполнения.НаименованиеФоновогоЗадания = Нстр("ru = 'Пересчет фактической позиции и РСА'");
		КонецЕсли;
		ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		ПараметрыВыполнения.Вставить("ИдентификаторФормы", Идентификатор);
		
		ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
		ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);
		
	ИначеЕсли ТребуетсяПерерасчетРСАВыполнитьРассылку = Истина Тогда
		
		ПараметрыВыполненияОбработки = Новый Структура;
		ПараметрыВыполненияОбработки.Вставить("ИдентификаторСеанса", ТребуетсяПерерасчетРСАИдентификаторСеанса);
		ПараметрыВыполненияОбработки.Вставить("ДатаНачала", ТребуетсяПерерасчетРСАДатаНачала);
		ПараметрыВыполненияОбработки.Вставить("ДатаОкончания", ТребуетсяПерерасчетРСАДатаОкончания);
		ПараметрыВыполненияОбработки.Вставить("ОбработкаПерерасчетаСтоимости", ОбработкаПерерасчетаСтоимости);
		
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка", 			Истина);
		ПараметрыЗадания.Вставить("ПараметрыВыполнения", 			ПараметрыВыполненияОбработки);
		ПараметрыЗадания.Вставить("ИмяМетода", 						"СформироватьЛогИВыполнитьРассылку");
		ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка", 	ОбработкаПерерасчетаСтоимости);
		
		Идентификатор = Новый УникальныйИдентификатор;
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Идентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = Нстр("ru = 'Рассылка после пересчета фактической позиции и РСА'");
		ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		ПараметрыВыполнения.Вставить("ИдентификаторФормы", Идентификатор);
		
		ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
		ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);
		
	ИначеЕсли ТребуетсяУдалениеБлокировок = Истина Тогда
		
		ДопОбработкаОбъект = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ОбработкаУдаленияБлокировок);
		
		Попытка
			ДопОбработкаОбъект.УдалитьБлокировкиПоПортфелям(ТребуетсяУдалениеБлокировокИдентификаторСеанса, ТребуетсяУдалениеБлокировокДата,
				ТребуетсяУдалениеБлокировокМассивПортфелей, ЗначениеИзСтрокиВнутр(ТребуетсяУдалениеБлокировокТаблицаДляУдаленияБлокировок));
		Исключение
			СообщениеОбОшибке = СтрШаблон(НСтр("ru = 'Не удалось выполнить ""Удаление блокировок""
				| по причине:%1'"), ОписаниеОшибки());
			ЗаписьЖурналаРегистрации("УдалениеБлокировок",
				УровеньЖурналаРегистрации.Ошибка, , , СообщениеОбОшибке);
		КонецПопытки;
		
	ИначеЕсли ТребуетсяРаспространениеПравил = Истина Тогда
		
		ДопОбработкаОбъект = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ОбработкаРаспространенияПравил);
		
		Попытка
			ДопОбработкаОбъект.ВыполнитьРаспространениеПравилПослеОбмена();
		Исключение
			СообщениеОбОшибке = СтрШаблон(НСтр("ru = 'Не удалось выполнить ""Распространение правил""
				| по причине:%1'"), ОписаниеОшибки());
			ЗаписьЖурналаРегистрации("РаспространениеПравил",
				УровеньЖурналаРегистрации.Ошибка, , , СообщениеОбОшибке);
		КонецПопытки;
		
		ПроверкаНаличияЗаписиСтатусаПортфеляВРегистре();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Устанавливает настройки обработки по переданной структуре
//
Процедура УстановитьНастройкиОтчета(Настройки) Экспорт
	
	Если ТипЗнч(Настройки) = Тип("ХранилищеЗначения") Тогда
		Настройки = Настройки.Получить();
		Если ТипЗнч(Настройки) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Настройки);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Настройки) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Настройки);
	КонецЕсли;
	
КонецПроцедуры //УстановитьНастройкиОтчета

Функция НайтиПортфелиПоКодам(МассивКодовПортфелей)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Портфели.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Портфели КАК Портфели
		|ГДЕ
		|	Портфели.ВнешнийКод В(&МассивКодовПортфелей)";
	
	Запрос.УстановитьПараметр("МассивКодовПортфелей", МассивКодовПортфелей);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура ПроверкаНаличияЗаписиСтатусаПортфеляВРегистре()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТБ_СтатусыПортфелейСрезПоследних.Портфель КАК Портфель
		|ПОМЕСТИТЬ т
		|ИЗ
		|	РегистрСведений.ВТБ_СтатусыПортфелей.СрезПоследних(&Дата, ) КАК ВТБ_СтатусыПортфелейСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Дата КАК Период,
		|	Портфели.Ссылка КАК Портфель,
		|	ДополнительныеСведения.Значение КАК СтатусПортфеля
		|ИЗ
		|	Справочник.Портфели КАК Портфели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО Портфели.Ссылка = ДополнительныеСведения.Объект
		|			И (ДополнительныеСведения.Свойство = &СвойствоСтатусПортфеля)
		|			И (НЕ Портфели.ПометкаУдаления)
		|ГДЕ
		|	НЕ Портфели.Ссылка В
		|				(ВЫБРАТЬ
		|					т.Портфель
		|				ИЗ
		|					т КАК т)";
	
	Запрос.УстановитьПараметр("СвойствоСтатусПортфеля", СвойствоСтатусПортфеля);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СтатусПортфеля) Тогда
			МенеджерЗаписи = РегистрыСведений.ВТБ_СтатусыПортфелей.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
			МенеджерЗаписи.Записать();
			
			Если ЗначениеЗаполнено(СвойствоСтатусПортфеляДата) Тогда
				МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект = ВыборкаДетальныеЗаписи.Портфель;
				МенеджерЗаписи.Свойство = СвойствоСтатусПортфеляДата;
				МенеджерЗаписи.Значение = ТекущаяДатаСеанса();
				МенеджерЗаписи.Записать();
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

мПроводникXDTO = Обработки.РаботаСXDTO.Создать();
мПроводникXDTO.ПространствоИмен = Метаданные.WebСервисы.Avancore.ПространствоИмен;

#КонецОбласти

#КонецЕсли