
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("УчитыватьТипРаздела") Тогда
		СтандартнаяОбработка = Ложь;
		
		Запрос = Новый Запрос;
		ТипыРазделовСчетаДЕПО = Новый СписокЗначений;
		Если Параметры.Свойство("ТипРазделаСчетаДЕПО") Тогда
			ТипыРазделовСчетаДЕПО.Добавить(Параметры.ТипРазделаСчетаДЕПО);
			Если Параметры.ТипРазделаСчетаДЕПО = Перечисления.ТипыРазделовСчетовДЕПО.БлокированоОбособленный Тогда
				ТипыРазделовСчетаДЕПО.Добавить(Перечисления.ТипыРазделовСчетовДЕПО.Основной);
			КонецЕсли;
		КонецЕсли;
		Запрос.УстановитьПараметр("ТипыРазделовСчетаДЕПО", ТипыРазделовСчетаДЕПО);
		Если Параметры.Свойство("СтрокаПоиска") Тогда
			СтрокаПоиска = Параметры.СтрокаПоиска + "%";
		Иначе
			СтрокаПоиска = "%";
		КонецЕсли;
		Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РазделыСчетаДепоМХ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РазделыСчетаДепоМХ КАК РазделыСчетаДепоМХ
		|ГДЕ
		|	РазделыСчетаДепоМХ.ТипРазделаСчетаДЕПО В(&ТипыРазделовСчетаДЕПО)
		|	И РазделыСчетаДепоМХ.Наименование ПОДОБНО &СтрокаПоиска";
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДанныеВыбора = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
