#Область ОсновнаяФункциональностьРегистрацииКлиента

Функция РезультатРегистрацииКлиентаВДепозитарии(СтрКлиент, ТипОперации, НовоеЮрФизЛицо, Ошибка) Экспорт
	
	Data = НовыйСтруктураОтветаКлиента();
	
	Если НЕ ЭтоДепозитарныйКлиент() Тогда
		ЗафиксироватьОшибку("Не подключена услуга депозитарного обслуживания", Data, Ошибка);
		Возврат РезультатОбработки(СтрКлиент.MessageInfo, Data);
	КонецЕсли;
	
	ИдентификаторыКлиента = ClientIds[0];
	НеРезидент = НЕ ClientTaxInfo[0].RuTaxResident;
	
	ПропускаемРегистрацию = (ТипОперации = "ins" И CrmClientIdЗарегистрирован(ClientIds[0].CrmClientId));
	Если ПропускаемРегистрацию Тогда
		ЗафиксироватьОшибку("Клиент с таким CrmClientId зарегистрирован", Data, Ошибка);
		Возврат РезультатОбработки(СтрКлиент.MessageInfo, Data);
	КонецЕсли;
	
	ПерезаписываемКонтрагента = Ложь;
	Попытка
		Если ЭтоФизлицо() Тогда
			ЮридическиеФизическиеЛица = РезультатРегистрацииФизлицаВДепозитарии(ТипОперации, НовоеЮрФизЛицо, ПерезаписываемКонтрагента, Ошибка);
		ИначеЕсли ЭтоЮрлицо() Тогда
			ЮридическиеФизическиеЛица = РезультатРегистрацииЮрлицаВДепозитарии(ТипОперации, НовоеЮрФизЛицо, ПерезаписываемКонтрагента, Ошибка);
		Иначе
			ЗафиксироватьОшибку("Тип клиента не определен", Data, Ошибка);
			Возврат РезультатОбработки(СтрКлиент.MessageInfo, Data);
		КонецЕсли;
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗафиксироватьОшибку(ОписаниеОшибки, Data, Ошибка);
		Возврат РезультатОбработки(СтрКлиент.MessageInfo, Data);
	КонецПопытки;
	
	ДанныеСтатусаКлиента = Data.Client.ClientStatuses;
	ДанныеИДКлиента = Data.Client.ClientIds;
	ДанныеСтатусаКлиента.DepoClientStatus = "REG";
	ДанныеСтатусаКлиента.DepoClientStatusDate = ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO);
	ДанныеИДКлиента.DepoClientId = СокрЛП(ЮридическиеФизическиеЛица.Код);
	ДанныеИДКлиента.CrmClientId = СокрЛП(ИдентификаторыКлиента.CrmClientId);
	ЗарегистрироватьИдентификаторКлиента(ЮридическиеФизическиеЛица.Ссылка, ИдентификаторыКлиента.CrmClientId);
	
	Если ПерезаписываемКонтрагента Тогда
		ОбновитьДанныеКонтрагентаПоЮрФизЛицу(ЮридическиеФизическиеЛица);
	КонецЕсли;
	
	Результат = РезультатОбработки(СтрКлиент.MessageInfo, Data);
	Результат.Вставить("Ссылка", ЮридическиеФизическиеЛица.Ссылка);
	Возврат Результат;
	
КонецФункции

Функция РезультатРегистрацииФизлицаВДепозитарии(ТипОперации, НовоеФизЛицо, ПерезаписываемКонтрагента, Ошибка)
	CrmClientId = ClientIds[0].CrmClientId;
	ФизЛицоСсылка = Обработки.РегистрацияКлиентаЧерезKafka.КлиентПоCrmClientId(CrmClientId);
	
	ПаспортныеДанные = Неопределено;
	Для Каждого ДокументКлиента Из ClientDocuments Цикл
		Если ЭтоПаспорт(ДокументКлиента.DocumentType) Тогда
			Если Не ЗначениеЗаполнено(ФизЛицоСсылка) Тогда
				ФизЛицоСсылка = ФизлицоПоПаспорту(ДокументКлиента.Series, ДокументКлиента.Number, ДокументКлиента.DocumentType);
				Если ФизЛицоСсылка = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					ФизЛицоСсылка = ФизЛицоПоИНН(ClientTaxInfo[0].Inn);
				КонецЕсли;
			КонецЕсли;
			ПаспортныеДанные = ДокументКлиента;
			Если ДокументКлиента.Active = 1 Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПерсональнаяИнформация = PersonInfo[0];
	НалоговыеДанныеКлиента = ClientTaxInfo[0];
	ФИОКлиента = PersonFio[0];

	Если ЗначениеЗаполнено(ФизЛицоСсылка) Тогда
		ФизЛицо = ФизЛицоСсылка.ПолучитьОбъект();
	Иначе
		ФизЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
		НовоеФизЛицо = Истина;
	КонецЕсли;
	
	ПерезаписываемКонтрагента = (ФизЛицо.Наименование <> ФИОКлиента.Name) Или (ФизЛицо.ИНН <> НалоговыеДанныеКлиента.Inn);
	
	ФизЛицо.Наименование = ФИОКлиента.Name;
	ФизЛицо.ДатаРождения = ПерсональнаяИнформация.BirthDate;
	ФизЛицо.МестоРождения = ПерсональнаяИнформация.BirthPlace;
	ФизЛицо.ИНН = НалоговыеДанныеКлиента.Inn;
	ФизЛицо.Пол = ПолФизЛица(ПерсональнаяИнформация.Sex);
	ФизЛицо.СтраховойНомерПФР = ПерсональнаяИнформация.Snils;
	ФизЛицо.ПБОЮЛ = ПерсональнаяИнформация.Pboul;
	ФизЛицо.Код = CrmClientId;
	
	Попытка
		ФизЛицо.Записать();
		ЗарегистрироватьКатегорииРолейФизлицаСогласноУказов81и95(ФизЛицо.Ссылка, НовоеФизЛицо, НалоговыеДанныеКлиента);
	Исключение
		Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
	КонецПопытки;
	
	ВыполнитьРегистрацииДанныхФизЛица(ФизЛицо, ФИОКлиента, ПаспортныеДанные, ПерезаписываемКонтрагента, Ошибка);

	Возврат ФизЛицо.Ссылка;
КонецФункции

Функция РезультатРегистрацииЮрЛицаВДепозитарии(ТипОперации, НовоеЮрЛицо, ПерезаписываемКонтрагента, Ошибка)
	CrmClientId = ClientIds[0].CrmClientId;
	ЮрЛицоСсылка = Обработки.РегистрацияКлиентаЧерезKafka.КлиентПоCrmClientId(CrmClientId);
	
	НалоговыеДанныеКлиента = ClientTaxInfo[0];
	ИнформацияОЮрЛице = LegalInfo[0];
	ИнформацияОГосРегистрацииЮрЛица = RegState[0];
	
	Если ЗначениеЗаполнено(ЮрЛицоСсылка) Тогда
		ЮрЛицо = ЮрЛицоСсылка.ПолучитьОбъект();
	Иначе
		ЮрЛицо = Справочники.ЮридическиеЛица.СоздатьЭлемент();
		НовоеЮрЛицо = Истина;
	КонецЕсли;
	
	ПерезаписываемКонтрагента = (ЮрЛицо.Наименование <> ИнформацияОЮрлице.FullName) Или (ЮрЛицо.ИНН <> НалоговыеДанныеКлиента.Inn);
	ЮрЛицо.Наименование = ИнформацияОЮрЛице.ShortName;
	ЮрЛицо.ПолноеНаименование = ИнформацияОЮрЛице.FullName;
	ЮрЛицо.ПолноеНаименованиеНаАнглийскомЯзыке = ИнформацияОЮрЛице.FullFrgnName;
	ЮрЛицо.УнифицированноеНаименованиеЦБРФ = ИнформацияОЮрлице.UniCBName;
	ЮрЛицо.ОПФ = ИнформацияОЮрЛице.Ownership;
	ЮрЛицо.МеждународнаяОрганизация = ИнформацияОЮрЛице.InternationalOrganization;
	ЮрЛицо.МеждународнаяКомпания = ИнформацияОЮрЛице.InternationalCompany;
	ЮрЛицо.Страна = Справочники.КлассификаторСтранМира.СтранаПоКодуАльфа2(ИнформацияОЮрЛице.RegCountry);
	ЮрЛицо.НеРезидент = Не ИнформацияОЮрЛице.IsResident;
	ЮрЛицо.ИНН = НалоговыеДанныеКлиента.Inn;
	ЮрЛицо.КПП = ИнформацияОЮрЛице.Kpp;
	ЮрЛицо.КодПоОКПО = ИнформацияОЮрЛице.Okpo;
	ЮрЛицо.КодПоОКВЭД = ИнформацияОЮрЛице.OkVed;
	ЮрЛицо.TIN = ИнформацияОЮрЛице.TIN;
	ЮрЛицо.ОКОПФ = ИнформацияОЮрЛице.OKOPF;
	ЮрЛицо.ОКФС = ИнформацияОЮрЛице.OKFS;
	ЮрЛицо.ОКОГУ = ИнформацияОЮрЛице.OKOGU;
	ЮрЛицо.КодПоОКОНХ = ИнформацияОЮрЛице.OKONH;
	ЮрЛицо.ВидПая = ВидПаяИзJSON(ИнформацияОЮрЛице.TypeSare);
	ЮрЛицо.ТипДепонента = ТипДепонентаИзJSON(ИнформацияОЮрЛице.CodeClientReg);
	ЮрЛицо.ОГРН = ИнформацияОГосРегистрацииЮрЛица.OGRN;
	ЮрЛицо.РегистрирующийОрган = ИнформацияОГосРегистрацииЮрЛица.RegAuthority;
	ЮрЛицо.ДатаГосРегистрации = ИнформацияОГосРегистрацииЮрЛица.RegDate;
	ЮрЛицо.МестоГосРегистрации = ИнформацияОГосРегистрацииЮрЛица.RegPlace;
	ЮрЛицо.РегНомер = ИнформацияОГосРегистрацииЮрЛица.OGRNNumber;
	ЮрЛицо.ДатаВнесенияВЕГРЮЛ = ИнформацияОГосРегистрацииЮрЛица.RecordDate;
	ЮрЛицо.Код = CrmClientId;
		
	Попытка
		ЮрЛицо.Записать();
	Исключение
		Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
	КонецПопытки;
	
	ВыполнитьРегистрацииДанныхЮрЛица(ЮрЛицо, ИнформацияОЮрлице, Ошибка);
	
	Возврат ЮрЛицо.Ссылка;
КонецФункции

Функция РезультатРегистрацииДоговораКлиента(стрДоговор, Ошибка) Экспорт
	
	ДанныеДоговора = Contract[0];
	НомерДоговора = ДанныеДоговора.ContractNumber;
	ЮрФизЛицо = Обработки.РегистрацияКлиентаЧерезKafka.КлиентПоCrmClientId(ДанныеДоговора.CrmClientId);
	Если НЕ ЗначениеЗаполнено(ЮрФизЛицо) Тогда
		ЗафиксироватьОшибку("Не найден зарегистрированный клиент с кодом " + ДанныеДоговора.CrmClientId,
			ДанныеДоговора, Ошибка);
		Возврат РезультатОбработки(стрДоговор.MessageInfo,
			Новый Структура("StatusCode,CrmClientId", ДанныеДоговора.StatusCode, ДанныеДоговора.CrmClientId));
	КонецЕсли;
	Попытка 
		Контрагент = РезультатРегистрацииДепонента(ЮрФизЛицо, Ошибка);
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗафиксироватьОшибку(ОписаниеОшибки, ДанныеДоговора, Ошибка);
		Возврат РезультатОбработки(стрДоговор.MessageInfo,
			Новый Структура("StatusCode,CrmClientId", ДанныеДоговора.StatusCode, ДанныеДоговора.CrmClientId));
	КонецПопытки;
	Если Контрагент = Неопределено Тогда
		ЗафиксироватьОшибку("Договор клиента с номером " + НомерДоговора + " уже зарегистрирован в системе",
			ДанныеДоговора, Ошибка);
		Возврат РезультатОбработки(стрДоговор.MessageInfo,
			Новый Структура("StatusCode,CrmClientId", ДанныеДоговора.StatusCode, ДанныеДоговора.CrmClientId));
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК ДоговорСсылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.Код = &Код
	|	И ДоговорыКонтрагентов.ТипДоговора = &ТипДоговора");
	Запрос.УстановитьПараметр("Владелец", ЮрФизЛицо);
	Запрос.УстановитьПараметр("Код", НомерДоговора);
	Запрос.УстановитьПараметр("ТипДоговора", Перечисления.ТипыДоговоров.Депозитарный);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Договор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	Иначе
		ЗафиксироватьОшибку("Договор клиента с номером " + НомерДоговора + " уже зарегистрирован в системе",
			ДанныеДоговора, Ошибка);
		Возврат РезультатОбработки(стрДоговор.MessageInfo,
			Новый Структура("StatusCode,CrmClientId", ДанныеДоговора.StatusCode, ДанныеДоговора.CrmClientId));
	КонецЕсли;
	
	Договор.Владелец = Контрагент;
	Договор.ДатаНачалоДействия = ДанныеДоговора.CreateDate;
	Договор.Код = НомерДоговора;
	Если НРег(ДанныеДоговора.ContractSubType) = "dep" Тогда
		Договор.ТипДоговора = Перечисления.ТипыДоговоров.Депозитарный;
	Иначе
		Договор.ТипДоговора = Перечисления.ТипыДоговоров.МежДепозитарный;
	КонецЕсли;
	Договор.Наименование = НомерДоговора;
	Договор.Организация = ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию();
	Договор.Комментарий = ДанныеДоговора.Comment;
	Договор.ОбменДанными.Загрузка = Истина;
	Попытка
		Договор.Записать();
	Исключение
		ЗафиксироватьОшибку(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), ДанныеДоговора, Ошибка);
		Возврат РезультатОбработки(стрДоговор.MessageInfo,
			Новый Структура("StatusCode,CrmClientId", ДанныеДоговора.StatusCode, ДанныеДоговора.CrmClientId));
	КонецПопытки;
	ДанныеДоговора.StatusCode = "REG";
	ДанныеДоговора.Договор = Договор.Ссылка;
	Если ЭтоКорректныйКодТарифногоПлана(ДанныеДоговора.ContractRateCode) Тогда
		УстановитьУслугиПоДоговору(Договор.Ссылка, ДанныеДоговора.ContractRateCode);
	Иначе
		ЗафиксироватьОшибку(СтрШаблон("Указан недопустимый код тарифа CRM %1", ДанныеДоговора.ContractRateCode), ДанныеДоговора, Ошибка);
		Возврат РезультатОбработки(стрДоговор.MessageInfo,
			Новый Структура("StatusCode, CrmClientId", ДанныеДоговора.StatusCode, ДанныеДоговора.CrmClientId));
	КонецЕсли;
	ЗарегистрироватьПравоИспользованияЦБ(Контрагент, ДанныеДоговора);
	Data = НовыйСтруктураОтветаДоговора();
	Data.ContractId = стрДоговор.Data.ContractId;
	Data.SrcSystem = стрДоговор.Data.SrcSystem;
	Если НЕ Data.ObjectVersion = 0 Тогда
		Data.ObjectVersion = стрДоговор.Data.ObjectVersion + 1;
	КонецЕсли;
	Результат = РезультатОбработки(стрДоговор.MessageInfo, Data);
	Результат.Вставить("Ссылка", Договор.Ссылка);
	Возврат Результат;

КонецФункции

Функция РезультатРегистрацииДепонента(ЮрФизЛицо, Ошибка)
	
	ДанныеДоговора = Contract[0];
	КонтрагентСсылка = Справочники.Контрагенты.КлиентПоCrmContractNumber(ДанныеДоговора.ContractNumber);
	Если ЗначениеЗаполнено(КонтрагентСсылка) Тогда
		Возврат Неопределено;
	Иначе
		Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
	КонецЕсли;
	Контрагент.Код						 = ДанныеДоговора.ContractNumber;
	Контрагент.Родитель 				 = Справочники.Контрагенты.Депоненты;
	Контрагент.ДоходныйСчет				 = ДанныеДоговора.Profit;
	Контрагент.ЮридическиеФизическиеЛица = ЮрФизЛицо;
	Контрагент.СпособОтправкиОтчетов	 = Перечисления.СпособыОтправкиОтчетов.МП;
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ЗаполнитьДанныеКонтрагентаПоФизЛицу(Контрагент, ЮрФизЛицо, ДанныеДоговора.CreateDate);
	Иначе
		ЗаполнитьДанныеКонтрагентаПоЮрЛицу(Контрагент, ЮрФизЛицо);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеДоговора.BrokerCode) Тогда
		Контрагент.КлиентОтсутствуетВBQ = Истина;
	КонецЕсли;
	Контрагент.Записать();
	ЗарегистрироватьИдентификаторДоговора(Контрагент.Ссылка, ДанныеДоговора.ContractNumber);
	ЗаполнитьПредоставленныеДокументыДепонентаДляДержательскойСхемы(Контрагент, ДанныеДоговора);
	
	Возврат Контрагент.Ссылка;
КонецФункции

Процедура ОбновитьДанныеКонтрагентаПоЮрФизЛицу(ЮридическиеФизическиеЛица)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК КонтрагентСсылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ПометкаУдаления
	|	И Контрагенты.ЮридическиеФизическиеЛица = &ЮридическиеФизическиеЛица";
	
	Запрос.УстановитьПараметр("ЮридическиеФизическиеЛица", ЮридическиеФизическиеЛица.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Контрагент = ВыборкаДетальныеЗаписи.КонтрагентСсылка.ПолучитьОбъект();
		Если ТипЗнч(ЮридическиеФизическиеЛица) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ЗаполнитьДанныеКонтрагентаПоФизЛицу(Контрагент, ЮридическиеФизическиеЛица, ТекущаяДатаСеанса(), ClientTaxInfo[0].RuTaxResident);
		Иначе
			ЗаполнитьДанныеКонтрагентаПоЮрлицу(Контрагент, ЮридическиеФизическиеЛица);
		КонецЕсли;
		Контрагент.Записать();
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьДанныеКонтрагентаПоЮрЛицу(Контрагент, Юрлицо)
	Контрагент.ЮрФизЛицо			 = Перечисления.ЮрФизЛицо.ЮрЛицо;
	Контрагент.Наименование			 = ЮрЛицо.Наименование;
	Контрагент.НаименованиеПолное	 = ЮрЛицо.ПолноеНаименование;
	Контрагент.ИНН					 = ЮрЛицо.ИНН;
	Контрагент.КПП					 = ЮрЛицо.КПП;
	Контрагент.ОКОНХ				 = ЮрЛицо.КодПоОКОНХ;
	Контрагент.ОКВЭД 				 = ЮрЛицо.КодПоОКВЭД;
	Контрагент.КодПоОКПО			 = ЮрЛицо.КодПоОКПО;
	Контрагент.TIN					 = ЮрЛицо.TIN;
	Контрагент.ОПФ					 = ЮрЛицо.ОПФ;
	Контрагент.ОГРН					 = ЮрЛицо.ОГРН;
	
	Контрагент.Резидент				 = Не РезидентПоСтране(ЮрЛицо.Страна);		// В реквизите Резидент  - хранятся данные о резидентстве по
																				// паспорту/учередительным документам, причем Истина означает, что это
																				// нерезидент - вот такая удачная шутка предыдущих разработчиков.
	
	Контрагент.НеРезидент			 = ЮрЛицо.НеРезидент;						// Не является налоговым резидентом РФ
КонецПроцедуры

Процедура ЗаполнитьДанныеКонтрагентаПоФизЛицу(Контрагент, ФизЛицо, Дата, РезидентПоНалогам = Неопределено)
	Контрагент.ЮрФизЛицо			 = Перечисления.ЮрФизЛицо.ФизЛицо;
	Контрагент.Наименование			 = ФизЛицо.Наименование;
	Контрагент.НаименованиеПолное	 = ФизЛицо.Наименование;
	Контрагент.ИНН					 = ФизЛицо.ИНН;
	Контрагент.Резидент				 = НеРезидентПоГражданству(ФизЛицо, Дата);	// В реквизите Резидент  - хранятся данные о резидентстве по
																				// паспорту/учередительным документам, причем Истина означает, что это
																				// нерезидент - вот такая удачная шутка предыдущих разработчиков.
	Если РезидентПоНалогам <> Неопределено Тогда
		Контрагент.НеРезидент		 = Не РезидентПоНалогам;					// Не является налоговым резидентом РФ
	КонецЕсли;
КонецПроцедуры

Процедура ЗарегистрироватьПризнакКвалИнвестор(Ошибка) Экспорт	// BSLLS:Typo-off
	
	СтатусКвалификации = НРег(QualInfo[0].QualInvestStatus);
	Если СтатусКвалификации = "storeg" Тогда
		ДатаКвалификации = QualInfo[0].QualInvestDate;
		ЮрФизЛицо = Обработки.РегистрацияКлиентаЧерезKafka.КлиентПоCrmClientId(ClientIds[0].CrmClientId);
		Если ЮрФизЛицо = Неопределено Тогда
			ВызватьИсключение "Не найден клиент с CrmClientId: " + ClientIds[0].CrmClientId;
		КонецЕсли;
		
		ВидОперации = Перечисления.ВидыОперацийРеестраКвалифицированныхИнвесторов.Признание;
		РегистрируемИзменениеРеестра = НеобходимаРегистрацияИзмененияРеестраКвалИнвесторов(ЮрФизЛицо, ВидОперации, ДатаКвалификации);
		
		Если РегистрируемИзменениеРеестра Тогда
			СоздатьДокументРегистрацияИзмененийРеестра(ЮрФизЛицо, ВидОперации, ДатаКвалификации, Ошибка);
		КонецЕсли;
	Иначе
		ВызватьИсключение "Неизвестный статус квалификации: " + СтатусКвалификации;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьРегистрацииДанныхФизЛица(ФизЛицо, ФИОКлиента, ПаспортныеДанные, ПерезаписываемКонтрагента, Ошибка)
	
	Попытка
		ЗарегистрироватьФИО(ФИОКлиента, ФизЛицо.Ссылка);
	Исключение
		Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ПаспортныеДанные) Тогда
		Попытка
			ЗарегистрироватьПаспортныеДанные(ПаспортныеДанные, ФизЛицо.Ссылка);
		Исключение
			Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		ЗарегистрироватьГражданствоФизЛица(ФизЛицо.Ссылка, ПерезаписываемКонтрагента);
	Исключение
		Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
	КонецПопытки;
	
	Попытка
		ЗарегистрироватьКИЮрФизЛица(ФизЛицо);
	Исключение
		Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
	КонецПопытки;
	
	Попытка
		ЗарегистрироватьКлиентскиеМенеджерыЮрФизЛица(ФизЛицо.Ссылка);
	Исключение
		Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
	КонецПопытки;

КонецПроцедуры

Процедура ВыполнитьРегистрацииДанныхЮрЛица(ЮрЛицо, ИнформацияОЮрлице, Ошибка)
	
	Попытка
		ЗарегистрироватьКИЮрФизЛица(ЮрЛицо);
		ЗарегистрироватьЛицензииЮрЛица(ЮрЛицо.Ссылка);
		ЗарегистрироватьКатегорииРолейКлиентовСогласноУказов81и95(ЮрЛицо.Ссылка, ИнформацияОЮрЛице.CategoryRole);
		ЗарегистрироватьКлиентскиеМенеджерыЮрФизЛица(ЮрЛицо.Ссылка);
	Исключение
		Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьКИЮрФизЛица(ЮрФизЛицо)
	ВидыКИЮрФизЛица = Новый Структура("ФактическийАдрес, ЮридическийАдрес, ПочтовыйАдрес, Телефон, Email");
	
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникОбъект.ФизическиеЛица") Тогда
		ВидыКИЮрФизЛица.ФактическийАдрес = Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица;
		ВидыКИЮрФизЛица.ЮридическийАдрес = Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица;
		ВидыКИЮрФизЛица.ПочтовыйАдрес	 = Справочники.ВидыКонтактнойИнформации.ИнформАдресФизЛица;
		ВидыКИЮрФизЛица.Телефон			 = Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица;
		ВидыКИЮрФизЛица.Email			 = Справочники.ВидыКонтактнойИнформации.EmailФизЛица;
	Иначе
		ВидыКИЮрФизЛица.ФактическийАдрес = Справочники.ВидыКонтактнойИнформации.ФактАдресЮрЛица;
		ВидыКИЮрФизЛица.ЮридическийАдрес = Справочники.ВидыКонтактнойИнформации.ЮрАдресЮрЛица;
		ВидыКИЮрФизЛица.ПочтовыйАдрес	 = Справочники.ВидыКонтактнойИнформации.АдресЮрлицаПочтовый;
		ВидыКИЮрФизЛица.Телефон			 = Справочники.ВидыКонтактнойИнформации.ТелефонЮрЛица;
		ВидыКИЮрФизЛица.Email			 = Справочники.ВидыКонтактнойИнформации.EmailЮрЛица;
	КонецЕсли;
	
	ВидыКИ = Новый Массив;
	ВидыКИ.Добавить(ВидыКИЮрФизЛица.ФактическийАдрес);
	ВидыКИ.Добавить(ВидыКИЮрФизЛица.ЮридическийАдрес);
	ВидыКИ.Добавить(ВидыКИЮрФизЛица.Телефон);
	ВидыКИ.Добавить(ВидыКИЮрФизЛица.Email);
	
	ДанныеКИЮрФизЛица = ПолучитьДанныеКИ(ЮрФизЛицо.Ссылка, ВидыКИ);
	
	ЗарегистрироватьАдресаЮрФизЛица(ЮрФизЛицо.Ссылка, ДанныеКИЮрФизЛица, ВидыКИЮрФизЛица);
	ЗарегистрироватьКонтактыЮрФизЛица(ЮрФизЛицо.Ссылка, ДанныеКИЮрФизЛица, ВидыКИЮрФизЛица);

КонецПроцедуры

Процедура СоздатьДокументРегистрацияИзмененийРеестра(Физлицо, ВидОперации, ДатаКвалификации, Ошибка)
	РегистрацияИзмененийРеестра = Документы.РегистрацияИзмененийРеестраКвалифицированныхИнвесторовРОФР;
	КатегорииЦенныхБумагДляРеестра = КатегорияФизЛицаПоДаннымKafka();
	Организация = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ОрганизацияПоУмолчанию");
	ДатаПереходаНа24млн = 
		ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("2413.ДатаПереходаНаРазмерИмуществаФизЛицаКвала_24млн", '00010101');
	
	ДокументОбъект = РегистрацияИзмененийРеестра.СоздатьДокумент();
	ДокументОбъект.Дата = ДатаКвалификации;
	ДокументОбъект.Организация = Организация;
	ДокументОбъект.ЮрФизЛицо = Физлицо;
	ДокументОбъект.ВидОперации = ВидОперации;
	Если ДатаКвалификации >= ДатаПереходаНа24млн Тогда
		ДокументОбъект.ФизЛицоРазмерИмущества_24 = Истина;
	Иначе
		ДокументОбъект.ФизЛицоРазмерИмущества_12 = Истина;
	КонецЕсли;
	
	Для Каждого Категория Из QualInfo Цикл
		ЗначениеКатегории = КатегорииЦенныхБумагДляРеестра[Категория.QualSecCateg];
		Если ТипЗнч(ЗначениеКатегории) = Тип("Массив") Тогда
			Для Каждого ИмяРеквизита Из ЗначениеКатегории Цикл
				ВключитьФлагИнструмента(ДокументОбъект, ИмяРеквизита);
			КонецЦикла;
		Иначе
			ВключитьФлагИнструмента(ДокументОбъект, ЗначениеКатегории);
		КонецЕсли;
	КонецЦикла;
		
	Попытка
		ДокументОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуДатыЗапретаРедактирования", Истина);
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
	КонецПопытки;
КонецПроцедуры

Функция НеобходимаРегистрацияИзмененияРеестраКвалИнвесторов(Физлицо, ВидОперации, ДатаКвалификации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрацияИзмененийРеестраКвалифицированныхИнвесторовРОФР.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РегистрацияИзмененийРеестраКвалифицированныхИнвесторовРОФР КАК РегистрацияИзмененийРеестраКвалифицированныхИнвесторовРОФР
	|ГДЕ
	|	РегистрацияИзмененийРеестраКвалифицированныхИнвесторовРОФР.Проведен
	|	И РегистрацияИзмененийРеестраКвалифицированныхИнвесторовРОФР.ЮрФизЛицо = &ЮрФизЛицо
	|	И РегистрацияИзмененийРеестраКвалифицированныхИнвесторовРОФР.ВидОперации = &ВидОперации
	|	И НАЧАЛОПЕРИОДА(РегистрацияИзмененийРеестраКвалифицированныхИнвесторовРОФР.Дата, ДЕНЬ) = &ДатаКвалификации";
	
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	Запрос.УстановитьПараметр("ЮрФизЛицо", Физлицо);
	Запрос.УстановитьПараметр("ДатаКвалификации", НачалоДня(ДатаКвалификации));
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Пустой();

КонецФункции

Процедура ВключитьФлагИнструмента(ДокументОбъект, ИмяРеквизита)
	Если ОбщегоНазначения.ЕстьРеквизитДокумента(ИмяРеквизита, ДокументОбъект.Метаданные()) Тогда
		ДокументОбъект[ИмяРеквизита] = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПредоставленныеДокументыДепонентаДляДержательскойСхемы(Депонент, ДанныеДоговора) // BSLLS:Typo-off
	
	Если Не ЗначениеЗаполнено(ДанныеДоговора.BrokerCode) Тогда
		Возврат;
	КонецЕсли;
	
	ВидДокументаНаименование = "Дополнительное соглашение(Держатель)";
	ВидДокумента = Справочники.ВидыДокументовУдостоверяющихПолномочия.НайтиПоНаименованию(ВидДокументаНаименование, Истина);
	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
		ТекстОшибки = СтрШаблон("Не найден вид документа ""%1""", ВидДокументаНаименование);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	ДатаДополнительногоСоглашения = ДанныеДоговора.AdditionalAgreementDate;
	
	Запись = РегистрыСведений.ПредоставленныеДокументы.СоздатьМенеджерЗаписи();
	Запись.Период = ДатаДополнительногоСоглашения;
	Запись.Лицо = Депонент.ЮридическиеФизическиеЛица;
	Запись.Депонент = Депонент.Ссылка;
	Запись.ВидДокумента = ВидДокумента;
	Запись.ДатаПредоставления = ДатаДополнительногоСоглашения;
	Запись.Примечание = СтрШаблон("Дополнительное соглашение № %1 от %2",
		ДанныеДоговора.AdditionalAgreementNumber, Формат(ДатаДополнительногоСоглашения, "ДФ=dd.MM.yyyy"));
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительнаяФункциональностьРегистрации

Процедура ЗарегистрироватьИдентификаторКлиента(Клиент, Идентификатор)
	
	КодЗагрузки = Справочники.КодыЗагрузки.СсылкаПоВладельцуКлассификаторуКоду(
		Клиент,
		Справочники.КлассификаторыЗагрузки.Клиенты,
		Идентификатор,
		ТекущаяДатаСеанса());
		
	Если КодЗагрузки = Неопределено Тогда
		
		КодЗагрузки = Справочники.КодыЗагрузки.СоздатьЭлемент();
		КодЗагрузки.ДополнительныеСвойства.Вставить("КомментарийДляИсторииДанных", "РегистрацияКлиентовДепозитарий");
		КодЗагрузки.Владелец = Клиент;
		КодЗагрузки.Биржа = Справочники.КлассификаторыЗагрузки.Клиенты;
		КодЗагрузки.Код = Идентификатор;
		КодЗагрузки.Записать();
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗарегистрироватьИдентификаторДоговора(Контрагент, Идентификатор)
	
	КодЗагрузки = Справочники.КодыЗагрузки.СсылкаПоВладельцуКлассификаторуКоду(
		Контрагент,
		Идентификатор,
		Справочники.КлассификаторыЗагрузки.CrmContractNumber,
		ТекущаяДатаСеанса());
		
	Если КодЗагрузки = Неопределено Тогда
		
		КодЗагрузки = Справочники.КодыЗагрузки.СоздатьЭлемент();
		КодЗагрузки.ДополнительныеСвойства.Вставить("КомментарийДляИсторииДанных", "РегистрацияДоговораДепозитарий");
		КодЗагрузки.Владелец = Контрагент;
		КодЗагрузки.Биржа = Справочники.КлассификаторыЗагрузки.CrmContractNumber;
		КодЗагрузки.Код = Идентификатор;
		КодЗагрузки.Записать();
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗарегистрироватьФИО(СтрФизлицо, ФизЛицо)
	
	ОбновитьДанныеФИО = Ложь;
	
	ОтборФизЛицо=Новый Структура("ФизЛицо", ФизЛицо);
	
	ФИОФизЛиц=РегистрыСведений.ФИОФизЛиц.СрезПоследних( , Новый Структура("ФизЛицо", ФизЛицо));
	
	Если ФИОФизЛиц.Количество() = 1 Тогда
		ОбновитьДанныеФИО = (ФИОФизЛиц[0].Фамилия <> СтрФизлицо.LastName) Или (ФИОФизЛиц[0].Имя <> СтрФизлицо.FirstName) Или (ФИОФизЛиц[0].Отчество <> СтрФизлицо.MiddleName);
	Иначе
		ОбновитьДанныеФИО = Истина;
	КонецЕсли;
	
	Если ОбновитьДанныеФИО Тогда
		НоваяЗаписьФИО = РегистрыСведений.ФИОФизЛиц.СоздатьМенеджерЗаписи();
		НоваяЗаписьФИО.ФизЛицо = ФизЛицо;
		НоваяЗаписьФИО.Период = ТекущаяДатаСеанса();
		НоваяЗаписьФИО.Фамилия = СтрФизлицо.LastName;
		НоваяЗаписьФИО.Имя = СтрФизлицо.FirstName;
		НоваяЗаписьФИО.Отчество = СтрФизлицо.MiddleName;
		НоваяЗаписьФИО.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьПаспортныеДанные(ПаспортныеДанные, ФизЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия = &ДокументСерия
		|				И ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер = &ДокументНомер
		|				И ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид = &ВидДокумента
		|			ТОГДА ПаспортныеДанныеФизЛицСрезПоследних.Период
		|		ИНАЧЕ &ТекущаяДата
		|	КОНЕЦ КАК Период
		|ИЗ
		|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	ТекущаяДата = ТекущаяДатаСеанса();
	ДокументНомер = НомерДокумента(ПаспортныеДанные.Number);
	ДокументСерия = СерияДокумента(ПаспортныеДанные.Series);
	Запрос.УстановитьПараметр("ДокументСерия", ДокументСерия);
	Запрос.УстановитьПараметр("ДокументНомер", ДокументНомер);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	ВидДокумента = ВидДокументаПоИдентификаторуВида(ПаспортныеДанные.DocumentType);
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Запись = РегистрыСведений.ПаспортныеДанныеФизЛиц.СоздатьМенеджерЗаписи();
	Запись.ФизЛицо = ФизЛицо;
	Запись.Период = ?(ВыборкаДетальныеЗаписи.Следующий(), ВыборкаДетальныеЗаписи.Период, ТекущаяДата);
	Запись.ДокументВид = ВидДокумента;
	Запись.ДокументНомер = ДокументНомер;
	Запись.ДокументСерия = ДокументСерия;
	Запись.ДокументКемВыдан = ПаспортныеДанные.Issuer;
	Запись.ДокументДатаВыдачи = ПаспортныеДанные.IssueDate;
	Запись.ДокументКодПодразделения = ПаспортныеДанные.IssuerCode;
	Запись.Записать();
	
КонецПроцедуры

Процедура ЗарегистрироватьГражданствоФизЛица(ФизЛицо, ПерезаписываемКонтрагента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ГражданствоФизЛицСрезПоследних.Период ЕСТЬ NULL
		|			ТОГДА ФизическиеЛица.ДатаРождения
		|		ИНАЧЕ &ТекущаяДата
		|	КОНЕЦ КАК Период
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ГражданствоФизЛицСрезПоследних
		|		ПО (ГражданствоФизЛицСрезПоследних.ФизЛицо = ФизическиеЛица.Ссылка)
		|ГДЕ
		|	ФизическиеЛица.Ссылка = &ФизЛицо
		|	И ВЫБОР
		|			КОГДА ГражданствоФизЛицСрезПоследних.Страна = &Страна
		|					И ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ = &НеЯвляетсяНалоговымРезидентомРФ
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	Страна = СтранаПоКодуАльфа2(PersonInfo[0].Citizenship);
	НеЯвляетсяНалоговымРезидентомРФ = Не ClientTaxInfo[0].RuTaxResident;
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("Страна", Страна);
	Запрос.УстановитьПараметр("НеЯвляетсяНалоговымРезидентомРФ", НеЯвляетсяНалоговымРезидентомРФ);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПерезаписываемКонтрагента = Истина;
		Запись = РегистрыСведений.ГражданствоФизЛиц.СоздатьМенеджерЗаписи();
		Запись.ФизЛицо = ФизЛицо;
		Запись.Период = ВыборкаДетальныеЗаписи.Период;
		Запись.Страна = Страна;
		Запись.НеЯвляетсяНалоговымРезидентомРФ = НеЯвляетсяНалоговымРезидентомРФ;
		Запись.Записать();
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ЗарегистрироватьАдресаЮрФизЛица(ЮрФизЛицо, ДанныеКИФизЛица, ВидыКИЮрФизЛица)
	
	Для Каждого СтрокаАдреса Из ClientAddresses Цикл
		
		Вид = ВидАдресаИзJSON(ВРег(СтрокаАдреса.AddrType), ВидыКИЮрФизЛица);
		Если Не ЗначениеЗаполнено(Вид) Или ПустаяСтрока(СтрокаАдреса.AddrValue) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("Вид", Вид);
		Записи = ДанныеКИФизЛица.НайтиСтроки(ПараметрыОтбора);
		Если Записи.Количество() Тогда
			НайденнаяСтрока = Записи[0];
			Период = НайденнаяСтрока.Период;
		ИначеЕсли Не ЗначениеЗаполнено(СтрокаАдреса.AddrDate) Тогда
			Период = Дата(2000, 1, 1);
		Иначе
			Период = СтрокаАдреса.AddrDate;
		КонецЕсли;
		
		МенеджерЗаписи 			= РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период 	= Период;
		МенеджерЗаписи.Объект 	= ЮрФизЛицо;
		МенеджерЗаписи.Тип 		= Перечисления.ТипыКонтактнойИнформации.Адрес;
		МенеджерЗаписи.Вид		= Вид;
		Если ВРег(СтрокаАдреса.Country) <> "РОССИЯ" Тогда
			МенеджерЗаписи.Поле1 = СтрокаАдреса.Страна;
			МенеджерЗаписи.ЭтоРоссийскийАдрес = Ложь;
		Иначе
			МенеджерЗаписи.Поле1 = СтрокаАдреса.Index;
			МенеджерЗаписи.ЭтоРоссийскийАдрес = Истина;
		КонецЕсли;
		МенеджерЗаписи.Представление = СтрокаАдреса.AddrValue;
		МенеджерЗаписи.Поле2 = СтрокаАдреса.Region;
		МенеджерЗаписи.Поле3 = СтрокаАдреса.Area;
		МенеджерЗаписи.Поле4 = СтрокаАдреса.Town;
		МенеджерЗаписи.Поле5 = СтрокаАдреса.Locality;
		МенеджерЗаписи.Поле6 = СтрокаАдреса.Street;
		МенеджерЗаписи.Поле7 = СтрокаАдреса.House;
		МенеджерЗаписи.Поле8 = СтрокаАдреса.Housing;
		МенеджерЗаписи.Поле9 = СтрокаАдреса.Office;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьКонтактыЮрФизЛица(ЮрФизЛицо, ДанныеКИФизЛица, ВидыКИЮрФизЛица)
	
	Для Каждого Контакт Из ClientContacts Цикл
		Если НРег(Контакт.ContactType) = "phone" Тогда
			Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			Вид = ВидыКИЮрФизЛица.Телефон;
		ИначеЕсли НРег(Контакт.ContactType) = "mail" Тогда
			Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			Вид = ВидыКИЮрФизЛица.Email;
		Иначе
			Продолжить;
		КонецЕсли;
		Если ПустаяСтрока(Контакт.ContactValue) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("Вид", Вид);
		Записи = ДанныеКИФизЛица.НайтиСтроки(ПараметрыОтбора);
		Если Записи.Количество() Тогда
			НайденнаяСтрока = Записи[0];
			Период = НайденнаяСтрока.Период;
		Иначе
			Период = ТекущаяДатаСеанса();
		КонецЕсли;
		
		МенеджерЗаписи 					= РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период 			= Период;
		МенеджерЗаписи.Объект 			= ЮрФизЛицо;
		МенеджерЗаписи.Тип				= Тип;
		МенеджерЗаписи.Вид				= Вид;
		МенеджерЗаписи.Представление 	= Контакт.ContactValue;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры
	
Процедура ЗарегистрироватьПравоИспользованияЦБ(Клиент, ДанныеДоговора)
	Запись = РегистрыСведений.ПравоИспользованияЦБКлиентов.СоздатьМенеджерЗаписи();
	Запись.Клиент = Клиент;
	Запись.Период = ДанныеДоговора.CreateDate;
	Запись.Значение = ДанныеДоговора.IsClientGrantedRightsUseSecurities;
	Запись.Записать(Истина);
КонецПроцедуры

Процедура ЗарегистрироватьЛицензииЮрЛица(ЮрЛицо)
	Для каждого ДанныеЛицензии Из Licenses Цикл
		МенеджерЗаписи = РегистрыСведений.Лицензии.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЮрЛицо = ЮрЛицо;
		МенеджерЗаписи.Лицензия = ВидЛицензииИзJSON(ДанныеЛицензии.License);
		МенеджерЗаписи.Номер = ДанныеЛицензии.Number;
		МенеджерЗаписи.ДатаНачалаДействия = ДанныеЛицензии.DateStart;
		МенеджерЗаписи.ДатаОкончанияДействия = ДанныеЛицензии.DateStop;
		МенеджерЗаписи.ЛицензирующийОрган = ДанныеЛицензии.LicenseAuthority;
		
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;
КонецПроцедуры

Процедура ЗарегистрироватьКатегорииРолейКлиентовСогласноУказов81и95(ЮрФизЛицо, CategoryRole)
	Запись = РегистрыСведений.КатегорииРолейКлиентовСогласноУказов81и95.СоздатьМенеджерЗаписи();
	Запись.ЮрФизЛицо = ЮрФизЛицо;
	Запись.Период = ТекущаяДатаСеанса();
	Запись.КатегорияРоли = КатегорияРолиКлиентаИзJSON(CategoryRole);
КонецПроцедуры

Процедура УстановитьУслугиПоДоговору(Договор, КодТарифаCRM)
	
	Набор = РегистрыСведений.РегистрНазначенныхКомиссий.СоздатьНаборЗаписей();
	Набор.Отбор.ДоговорКонтрагента.Установить(Договор);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УслугиТП.Услуга КАК Услуга
	|ИЗ
	|	Справочник.ТарифныеПланы КАК ТарифныеПланы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТарифныеПланы.УслугиТарифногоПлана КАК УслугиТП
	|		ПО (ТарифныеПланы.Ссылка = УслугиТП.Ссылка
	|				И ТарифныеПланы.КодТарифаCRM = &КодТарифаCRM
	|				И НЕ УслугиТП.Услуга.НеИспользуется)";
	Запрос.УстановитьПараметр("КодТарифаCRM", КодТарифаCRM);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = Набор.Добавить();
		Запись.Период = Договор.ДатаНачалоДействия;
		Запись.ДоговорКонтрагента = Договор;
		Запись.Услуга = Выборка.Услуга;
		Запись.ФлагАктивности = Истина;
	КонецЦикла;
	Набор.Записать();
	
КонецПроцедуры

Функция ПолучитьДанныеКИ(ФизЛицо, ВидыКИ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформацияСрезПоследних.Период КАК Период,
	|	КонтактнаяИнформацияСрезПоследних.Объект КАК Объект,
	|	КонтактнаяИнформацияСрезПоследних.Тип КАК Тип,
	|	КонтактнаяИнформацияСрезПоследних.Вид КАК Вид
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			,
	|			Объект = &ФизЛицо
	|				И Вид В (&ВидыКИ)) КАК КонтактнаяИнформацияСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидыКИ", ВидыКИ);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	ДанныеКИФизЛица = Запрос.Выполнить().Выгрузить();
	Возврат ДанныеКИФизЛица;

КонецФункции

Процедура ЗарегистрироватьКлиентскиеМенеджерыЮрФизЛица(ЮрФизЛицо)
	МенеджерыЮрФизЛица = МенеджерыЮрФизЛица(ЮрФизЛицо);
	Для Каждого Менеджер Из ManagerInfo Цикл
		НеобходимаЗапись = Ложь;
		МенеджерЗаписи = РегистрыСведений.КлиентскиеМенеджеры.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЮрФизЛицо = ЮрФизЛицо;
		НайденныйМенеджер = МенеджерыЮрФизЛица.Найти(Менеджер.ManagerID, "Идентификатор");
		Если НайденныйМенеджер = Неопределено Тогда
			МенеджерЗаписи.Период = ТекущаяДатаСеанса();
			МенеджерЗаписи.Идентификатор = Менеджер.ManagerID;
			МенеджерЗаписи.КлиентскийМенеджер = Менеджер.FIO;
			НеобходимаЗапись = Истина;
		КонецЕсли;
		Если НайденныйМенеджер <> Неопределено И НайденныйМенеджер.КлиентскийМенеджер <> Менеджер.FIO Тогда
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, НайденныйМенеджер, , "КлиентскийМенеджер");
			МенеджерЗаписи.КлиентскийМенеджер = Менеджер.FIO;
			НеобходимаЗапись = Истина;
		КонецЕсли;
		Если НеобходимаЗапись Тогда
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция МенеджерыЮрФизЛица(ЮрФизЛицо)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлиентскиеМенеджеры.Период КАК Период,
	|	КлиентскиеМенеджеры.Идентификатор КАК Идентификатор,
	|	КлиентскиеМенеджеры.КлиентскийМенеджер КАК КлиентскийМенеджер
	|ИЗ
	|	РегистрСведений.КлиентскиеМенеджеры КАК КлиентскиеМенеджеры
	|ГДЕ
	|	КлиентскиеМенеджеры.ЮрФизЛицо = &ЮрФизЛицо";
	
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЮрФизЛицо);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ЗарегистрироватьКатегорииРолейФизлицаСогласноУказов81и95(ФизЛицо, НовоеФизЛицо, НалоговыеДанныеКлиента)
	ДанныеСообщения = MessageInfo[0];
	ЗарегистрироватьКатегорииРолей = НовоеФизЛицо И НРег(ДанныеСообщения.MessageType) = "client"
		И НалоговыеДанныеКлиента.RuTaxResident;
	Если ЗарегистрироватьКатегорииРолей Тогда
		МенеджерЗаписи = РегистрыСведений.КатегорииРолейКлиентовСогласноУказов81и95.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.ЮрФизЛицо = ФизЛицо;
		МенеджерЗаписи.КатегорияРоли =
			Справочники.КатегорииРолейКлиентовСогласноУказов81и95.РоссийскийРезидентПодКонтролемРоссийскихРезидентов;
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ФормированиеПорученийНаОткрытиеСчетовДепо

Процедура СформироватьПорученияИОперации() Экспорт
	
	ДанныеДоговора = Contract[0];
	ДоговорОбъект = ДанныеДоговора.Договор.ПолучитьОбъект();
	ТипыСчетовДепо = ТипыСчетовДепо(ДанныеДоговора);
	Если ТипыСчетовДепо = Неопределено Тогда
		ВызватьИсключение "Не определен тип счета депо " + ДанныеДоговора.DepoAccountSectionType;
	КонецЕсли;
	СтруктураРазделовМХ = ОбщегоНазначения.ПолучитьЗначенияРеквизитовШапкиОбъектаПоУмолчанию(
		"Обработка.РегистрацияКлиентаЧерезKafka", Новый Структура,
		?(ДанныеДоговора.IsClientGrantedRightsUseSecurities, "МХ_СПИпоУмолчанию", "МХ_БПИпоУмолчанию"));
		
	МХОсновной = СтруктураРазделовМХ.МХОсновной;
	МХОбеспечения = СтруктураРазделовМХ.МХОбеспечения;
		
	ДатаПоручения = ТекущаяДатаСеанса();
	
	ПараметрыПоручений = Новый Структура();
	ПараметрыПоручений.Вставить("ДатаПоручения", ДатаПоручения);
	ПараметрыПоручений.Вставить("Контрагент", ДоговорОбъект.Владелец);
	ПараметрыПоручений.Вставить("СпособПриемаПоручений", Справочники.СпособыПриемаПоручений.ЭлектронныйВид());
	
	НовыйВходящийНаОткрытиеСчетовДепо(ПараметрыПоручений);
	
	Поручение = НовоеПоручениеНаОткрытиеСчетаДепо(ТипыСчетовДепо.Основной, ПараметрыПоручений);	
	СчетДепо = СчетДепоПоПоручению(Поручение);
	
	ДоговорОбъект.СчетДепо = СчетДепо;
	ДоговорОбъект.Записать();
	
	//МестоХранения
	НовоеПоручениеНаОткрытиеРазделаСчетаДепо(Перечисления.ТипыРазделовСчетовДЕПО.Основной, СчетДепо, МХОсновной, ПараметрыПоручений);
		
	Поручение = НовоеПоручениеНаОткрытиеСчетаДепо(ТипыСчетовДепо.Торговый, ПараметрыПоручений);
	СчетДепоТорговый = СчетДепоПоПоручению(Поручение);
	
	//МестоХраненияОбеспечения
	ТипыРазделовСчетовДЕПО = Перечисления.ТипыРазделовСчетовДЕПО;
	Если ЗначениеЗаполнено(ДанныеДоговора.BrokerCode) Тогда
		ТипРазделаСчетаДепо = ТипыРазделовСчетовДЕПО.ОбеспеченияДержатель;
		ПараметрыПоручений.Вставить("ДанныеДоговора", ДанныеДоговора);
		ПараметрыПоручений.Вставить("НомерДоговораДепо", ДоговорОбъект.Код);
		ПараметрыПоручений.Вставить("ДатаДоговораДепо", ДоговорОбъект.ДатаНачалоДействия);
	Иначе
		ТипРазделаСчетаДепо = ТипыРазделовСчетовДЕПО.Обеспечения;
	КонецЕсли;
	НовоеПоручениеНаОткрытиеРазделаСчетаДепо(ТипРазделаСчетаДепо, СчетДепоТорговый, МХОбеспечения, ПараметрыПоручений);
	
КонецПроцедуры

Функция ТипыСчетовДепо(ДанныеДоговора)
	
	ТипДепозитарногоСчета = СокрЛП(ДанныеДоговора.DepoAccountSectionType);
	ТипыСчетов = Новый Структура;
	
	Если НРег(ТипДепозитарногоСчета) = "owner" Тогда
		ТипыСчетов.Вставить("Основной", Перечисления.ТипыСчетовДепо.Владельца);
		ТипыСчетов.Вставить("Торговый", Перечисления.ТипыСчетовДепо.ВладельцаТорговый);
	Иначе
		ТипыСчетов = Неопределено;
	КонецЕсли;
	
	Возврат ТипыСчетов;
КонецФункции

Функция НовыйВходящийНаОткрытиеСчетовДепо(ПараметрыПоручений)
	
	Входящий 					= Документы.Входящий.СоздатьДокумент();
	Входящий.Дата 				= ПараметрыПоручений.ДатаПоручения;
	Входящий.ДатаОтправления 	= ПараметрыПоручений.ДатаПоручения;
	Входящий.Депонент 			= ПараметрыПоручений.Контрагент.Ссылка;
	Входящий.ИсходящийНомер 	= "б/н";
	Входящий.Комментарий 		= "Оригинал";
	Входящий.РучнойВвод 		= Ложь;
	Входящий.ЦеннаяБумага 		= Справочники.ЦенныеБумаги.ПустаяСсылка();
	Входящий.Исполнитель 		= Константы.ПользовательРобот.Получить();
	Входящий.ЛицоНаправившееДокумент 			= ПараметрыПоручений.Контрагент.Наименование;
	Входящий.НаименованиеДокументаИлиКомплекта 	= "Комплект документов (в соответствии с Прилож.02 к РДО)";
	Входящий.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Входящий;	

КонецФункции 

Функция НовоеПоручениеНаОткрытиеСчетаДепо(ТипСчетаДепо, ПараметрыПоручений)
	
	Поручение = Документы.Поручение.СоздатьДокумент();
	Поручение.Дата = ПараметрыПоручений.ДатаПоручения;
	Поручение.ДатаПриема = ПараметрыПоручений.ДатаПоручения;
	Поручение.Инициатор = ПараметрыПоручений.Контрагент.Ссылка;
	Поручение.Депонент = ПараметрыПоручений.Контрагент.Ссылка;
	Поручение.ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеСчетаДепо;
	Поручение.ТипСчетаДепо = ТипСчетаДепо;
	Поручение.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетДЕПО;
	Поручение.ДатаИсполненияПоручения = ПараметрыПоручений.ДатаПоручения + 1;
	Поручение.СпособПриемаПоручений = ПараметрыПоручений.СпособПриемаПоручений;
	Поручение.СчетДепоМХ = СчетДепоМХПоручения(Поручение.Депонент, ТипСчетаДепо);
	Поручение.УстановитьНовыйНомер();
	Поручение.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Поручение;
	
КонецФункции

Функция НовоеПоручениеНаОткрытиеРазделаСчетаДепо(ТипРазделаСчетаДепо, СчетДепо, ДепозитарийМХ, ПараметрыПоручений)
	
	Поручение = Документы.Поручение.СоздатьДокумент();
	Поручение.Дата = ПараметрыПоручений.ДатаПоручения;
	Поручение.ДатаПриема = ПараметрыПоручений.ДатаПоручения;
	Поручение.Инициатор = ПараметрыПоручений.Контрагент.Ссылка;
	Поручение.Депонент = ПараметрыПоручений.Контрагент.Ссылка;
	Поручение.ВидОперацииД = Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо;
	Поручение.ТипСчетаДепо = СчетДепо.ТипСчетаДепо;
	Поручение.СчетДепо = СчетДепо;
	Поручение.ТипРазделаСчетаДЕПО = ТипРазделаСчетаДепо;
	Если ТипРазделаСчетаДепо = Перечисления.ТипыРазделовСчетовДЕПО.Налоговый Тогда
		Поручение.РазделСчетаДепоМХ = "";
		Поручение.СчетДепоМХ = ДепозитарийМХ.Владелец;
		Если Не ЗначениеЗаполнено(Поручение.СчетДепоМХ) Тогда
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"Не найден СчетДепоМХ для открытия налогового раздела! (НомерРаздела=%1, НомерСчета=%2)",
				ДепозитарийМХ.НомерРаздела,
				ДепозитарийМХ.НомерСчета);
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Сообщение);
			ВызватьИсключение Сообщение;
		КонецЕсли;
		НомерНалоговогоРазделаНРД = Константы.НомерНалоговогоРазделаНРД.Получить();
		Поручение.НомерРазделаСчетаДепоМХ = Лев(НомерНалоговогоРазделаНРД, 7) + СокрЛП(Поручение.Депонент.Код) + Поручение.Субклиент.Код;
		Поручение.ОткрытьВМХ = Истина;
	ИначеЕсли ТипРазделаСчетаДепо = Перечисления.ТипыРазделовСчетовДЕПО.ОбеспеченияДержатель Тогда
		ЗаполнитьПоручениеДляДержательскойСхемы(Поручение, ДепозитарийМХ, ПараметрыПоручений);
	Иначе	
		Поручение.РазделСчетаДепоМХ = ДепозитарийМХ;
		Поручение.ДатаИсполненияПоручения = ПараметрыПоручений.ДатаПоручения + 1;
	КонецЕсли;
	Поручение.СпособПриемаПоручений = ПараметрыПоручений.СпособПриемаПоручений;
	Поручение.УстановитьНовыйНомер();
	Поручение.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Поручение.Ссылка;
	
КонецФункции

Функция СчетДепоПоПоручению(Поручение)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОткрытиеСчетаДепо.СчетДепо КАК СчетДепо
	|ИЗ
	|	Документ.ОткрытиеСчетаДепо КАК ОткрытиеСчетаДепо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручение
	|		ПО ОткрытиеСчетаДепо.ДокументОснование = Поручение.Ссылка
	|ГДЕ
	|	Поручение.Ссылка = &Поручение");
	Запрос.УстановитьПараметр("Поручение", Поручение.Ссылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , "Не создан счет Депо после проведения поручения на открытие счета Депо!");
		ВызватьИсключение "Не создан счет Депо после проведения поручения на открытие счета Депо!";
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.СчетДепо;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедуры

Функция ПолФизЛица(Sex)
	НРегSex = НРег(Sex);
	Если НРегSex = "m" Тогда
		Пол = Перечисления.ПолФизическихЛиц.Мужской;
	ИначеЕсли НРегSex = "f" Тогда
		Пол = Перечисления.ПолФизическихЛиц.Женский;
	Иначе
		ВызватьИсключение "Не удалось определить пол";
	КонецЕсли;

	Возврат Пол;
КонецФункции

Функция ВидДокументаПоИдентификаторуВида(DocumentType)
	ВРегDocumentType = ВРег(DocumentType);
	Если ВРегDocumentType = "FOREIGN_PASS" Тогда
		// Заграничный паспорт для постоянно проживающих за границей граждан, которые временно находятся на территории Российской Федерации
		ВидДокумента = Справочники.ДокументыУдостоверяющиеЛичность.ИМНС10;
	Иначе 	// В том числе ВРегDocumentType = "PASS" - паспорт гражданина РФ, действующий на территории РФ с 1 октября 1997 года
			// и любые другие докуметы пока тоже обрабатываем тоже как паспорт гражданина РФ
		ВидДокумента = Справочники.ДокументыУдостоверяющиеЛичность.ИМНС21;
	КонецЕсли;
	
	Возврат ВидДокумента;
КонецФункции

Функция ЭтоПаспорт(DocumentType)
	ВРегDocumentType = ВРег(DocumentType);
	ЭтоПаспорт = (ВРегDocumentType = "PASS" Или ВРегDocumentType = "FOREIGN_PASS");
	
	Возврат ЭтоПаспорт;
КонецФункции

Функция ФизлицоПоПаспорту(Серия, Номер, DocumentType)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(
	|			,
	|			ДокументВид = &ВидДокумента
	|				И ДокументСерия = &ДокументСерия
	|				И ДокументНомер = &ДокументНомер) КАК ПаспортныеДанныеФизЛицСрезПоследних";
	Запрос.УстановитьПараметр("ДокументСерия", СерияДокумента(Серия));
	Запрос.УстановитьПараметр("ДокументНомер", НомерДокумента(Номер));
	ВидДокумента = ВидДокументаПоИдентификаторуВида(DocumentType);
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ФизЛицо;
	Иначе
		Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ФизЛицоПоИНН(ИНН)
	ФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	Если Не ПустаяСтрока(ИНН) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК ФизЛицо
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.ИНН = &ИНН
		|	И НЕ ФизическиеЛица.ПометкаУдаления");
		Запрос.УстановитьПараметр("ИНН", СокрЛП(ИНН));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ФизЛицо = Выборка.ФизЛицо;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ФизЛицо;
КонецФункции

Функция СерияДокумента(Знач ДокументНомер)
	
	Серия = Лев(СтрЗаменить(ДокументНомер, " ", ""), 4);
	Возврат Лев(Серия, 2) + " " + Прав(Серия, 2);
	
КонецФункции

Функция НомерДокумента(Знач ДокументНомер)
	
	НомерДокумента = СтрЗаменить(СокрЛП(ДокументНомер), " ", "");
	Возврат НомерДокумента;
	
КонецФункции

Функция СтранаПоКодуАльфа2(Код)
	
	Страна = Справочники.КлассификаторСтранМира.СтранаПоКодуАльфа2(Код);
	Если Страна = Справочники.КлассификаторСтранМира.ПустаяСсылка() Или Страна = Неопределено Тогда
		Страна = СтранаИзКлассификатора(Код);
	КонецЕсли; 
	
	Возврат Страна;
	
КонецФункции

Функция РезидентПоСтране(Страна)
	Возврат Страна = Справочники.КлассификаторСтранМира.РОССИЯ;
КонецФункции

Функция СтранаИзКлассификатора(Код)
	
	Если Код = "" Тогда
		Возврат Справочники.КлассификаторСтранМира.ПустаяСсылка();
	КонецЕсли;
	
	Макет = Справочники.КлассификаторСтранМира.ПолучитьМакет("КлассификаторСтранМира");
	ТекущаяОбласть = Макет.НайтиТекст(Код, , , , Истина);
	
	Если ТекущаяОбласть = Неопределено Тогда
		Возврат Справочники.КлассификаторСтранМира.ПустаяСсылка();
	КонецЕсли; 
	
	ОбластьКодЧисловой			= Макет.Области.КодЧисловой;
	ОбластьНаименованиеКраткое	= Макет.Области.НаименованиеКраткое;
	ОбластьНаименованиеПолное	= Макет.Области.НаименованиеПолное;
	ОбластьКодАльфа2 			= Макет.Области.КодАльфа2;
	
	КодЧисловой         = Макет.Область(ТекущаяОбласть.Верх, ОбластьКодЧисловой.Лево, ТекущаяОбласть.Низ, ОбластьКодЧисловой.Право).Текст;
	НаименованиеКраткое = Макет.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеКраткое.Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеКраткое.Право).Текст;
	НаименованиеПолное  = Макет.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеПолное.Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеПолное.Право).Текст;
	КодАльфа2			= Макет.Область(ТекущаяОбласть.Верх, ОбластьКодАльфа2.Лево, ТекущаяОбласть.Низ, ОбластьКодАльфа2.Право).Текст;
	
	// Создание новой страны
	Элемент = Справочники.КлассификаторСтранМира.СоздатьЭлемент();
	Элемент.Код					= КодЧисловой;
	Элемент.Наименование		= НаименованиеКраткое;
	Элемент.НаименованиеПолное	= НаименованиеПолное;
	Элемент.КодАльфа2			= КодАльфа2;
	Элемент.Записать();
	Возврат Элемент.Ссылка;
	
КонецФункции

Функция СтруктураСообщенияОшибки(CrmClientId, ErrorDescription)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	СтруктураMessageInfo = Новый Структура;
	СтруктураMessageInfo.Вставить("MessageId", Строка(Новый УникальныйИдентификатор()));
	СтруктураMessageInfo.Вставить("MasterMessageId", ?(НРег(MessageInfo[0].MasterMessageId) = "null",
									СтруктураMessageInfo.MessageId, MessageInfo[0].MasterMessageId));
	СтруктураMessageInfo.Вставить("ParentMessageId", MessageInfo[0].MessageId);
	СтруктураMessageInfo.Вставить("DateTimeCreate", ТекущаяДата);
	СтруктураMessageInfo.Вставить("SystemSource", "Depo");
	
	Data = ОбменДаннымиКафка.СообщениеОбОшибкеБлокData();
	Data.ErrorDescription = ErrorDescription;
	Data.Вставить("CrmClientId", CrmClientId);
	
	Результат = Новый Структура("MessageInfo,Data", СтруктураMessageInfo, Data);
	Возврат Результат;
	
КонецФункции

Функция РезультатОбработки(MessageInfo, Data)
	
	Результат = Новый Структура("MessageInfo,Data", MessageInfo, Data);
	Возврат Результат;
	
КонецФункции

Функция ДатаИзJSON(ДатаJSON, ФорматДаты)
	
	Если ЗначениеЗаполнено(ДатаJSON) Тогда
		Попытка
			Результат = ПрочитатьДатуJSON(ДатаJSON, ФорматДаты);
		Исключение
			Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
		КонецПопытки;
	Иначе
		Результат = Дата(1, 1, 1);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции	

Функция НовыйСтруктураОтветаКлиента()
	
	СтруктураClientIds = Новый Структура("CrmClientId,DepoClientId");
	СтруктураClientStatuses = Новый Структура("DepoClientStatus,DepoClientStatusDate");
	СтруктураClient = Новый Структура("ClientIds,ClientStatuses",
						СтруктураClientIds, СтруктураClientStatuses);
	Результат = Новый Структура("Client", СтруктураClient);

	Возврат Результат;

КонецФункции

Функция НовыйСтруктураОтветаДоговора()
	
	Data = Новый Структура("ContractId,ContractType,StatusCode,SrcSystem,CrmClientId,ContractNumber,ObjectVersion");
	ЗаполнитьЗначенияСвойств(Data, Contract[0]);
	Возврат Data;
	
КонецФункции

Функция ЭтоДепозитарныйКлиент()
	
	Для Каждого Услуга Из ClientServices Цикл
		Если НРег(Услуга.ServiceType) = "depo_service" И НРег(Услуга.ServiceStatus) = "act" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоЮрлицо()
	Возврат ВРЕГ(ClientStatuses[0].ClientType) = "LEGAL";
КонецФункции

Функция ЭтоФизлицо()
	Возврат ВРЕГ(ClientStatuses[0].ClientType) = "PERS";
КонецФункции

Функция ВидПаяИзJSON(ОбозначениеИзJSON)
	ЗаглавнымиОбозначениеИзJSON = Врег(ОбозначениеИзJSON);
	
	Если ЗаглавнымиОбозначениеИзJSON = "ПАЙ ОТКРЫТОГО ПИФА" Тогда
		ВидПая = Перечисления.ВидыПаев.Открытый;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "ПАЙ ИНТЕРВАЛЬНОГО ПИФА" Тогда
		ВидПая = Перечисления.ВидыПаев.Интервальный;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "ПАЙ ЗАКРЫТОГО ПИФА" Тогда
		ВидПая = Перечисления.ВидыПаев.Закрытый;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "ПАИ ИЛИ АКЦИИ ИНВЕСТИЦИОННЫХ ФОНДОВ" Тогда
		ВидПая = Перечисления.ВидыПаев.ПайАкцияИнвестиционногоФонда;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "БИРЖЕВОЙ" Тогда
		ВидПая = Перечисления.ВидыПаев.Биржевой;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "НЕ ОПРЕДЕЛЕН" Тогда
		ВидПая = Перечисления.ВидыПаев.НеОпределен;
	Иначе
		ВызватьИсключение "Не предусмотренное обозначение вида пая: " + ОбозначениеИзJSON;
	КонецЕсли;
	
	Возврат ВидПая;
КонецФункции

Функция ВидЛицензииИзJSON(ОбозначениеИзJSON)
	
	ВидыЛицензий = Справочники.ВидыЛицензий;
	ЗаглавнымиОбозначениеИзJSON = Врег(ОбозначениеИзJSON);
	
	Если ЗаглавнымиОбозначениеИзJSON = "BANK" Тогда
		ВидЛицензии = ВидыЛицензий.БанковскаяДеятельность;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "BROK" Тогда
		ВидЛицензии = ВидыЛицензий.БрокерскаяДеятельность;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "DEAL" Тогда
		ВидЛицензии = ВидыЛицензий.ДилерскаяДеятельность;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "DEPO" Тогда
		ВидЛицензии = ВидыЛицензий.ДепозитарнаяДеятельность;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "SECUR" Тогда
		ВидЛицензии = ВидыЛицензий.ДеятельностьДоверительногоУправления;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "ENSUR" Тогда
		ВидЛицензии = ВидыЛицензий.СтраховаяДеятельность;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "FOUND" Тогда
		ВидЛицензии = ВидыЛицензий.ДеятельностьПоУправлениюИФ_ПИФ_НПФ;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "CLEAR" Тогда
		ВидЛицензии = ВидыЛицензий.КлиринговаяДеятельность;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "STOCK" Тогда
		ВидЛицензии = ВидыЛицензий.ОрганизацияБиржевойТорговли;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "REG" Тогда
		ВидЛицензии = ВидыЛицензий.РегистраторскаяДеятельность;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "PENS" Тогда
		ВидЛицензии = ВидыЛицензий.ПенсионноеОбеспечениеИПенсионноеСтрахование;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "OTHER" Тогда
		ВидЛицензии = ВидыЛицензий.Иная;
	Иначе
		ВызватьИсключение "Не предусмотренное обозначение вида лицензии: " + ОбозначениеИзJSON;
	КонецЕсли;
	
	Возврат ВидЛицензии;
КонецФункции

Функция ТипДепонентаИзJSON(КодИзJSON)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТипыДепонентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТипыДепонентов КАК ТипыДепонентов
	|ГДЕ
	|	ТипыДепонентов.Код = &КодИзJSON
	|	И НЕ ТипыДепонентов.ПометкаУдаления";
	Запрос.УстановитьПараметр("КодИзJSON", КодИзJSON);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение "Не найден в справочнике типов депонентов код: " + КодИзJSON;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ТипДепонента = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ТипДепонента;
КонецФункции

Функция ВидАдресаИзJSON(ОбозначениеИзJSON, ВидыКИЮрФизЛица)
	ЗаглавнымиОбозначениеИзJSON = Врег(ОбозначениеИзJSON);
	
	Если ЗаглавнымиОбозначениеИзJSON = "FACT" Тогда
		Вид = ВидыКИЮрФизЛица.ФактическийАдрес;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "REG" Или ЗаглавнымиОбозначениеИзJSON = "LEG" Тогда
		Вид = ВидыКИЮрФизЛица.ЮридическийАдрес;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "POST" Тогда
		Вид = ВидыКИЮрФизЛица.ПочтовыйАдрес;
	Иначе
		Вид = Неопределено;
	КонецЕсли;
	
	Возврат Вид;
КонецФункции

Функция КатегорияРолиКлиентаИзJSON(ОбозначениеИзJSON)
	КатегорииРолей = Справочники.КатегорииРолейКлиентовСогласноУказов81и95;
	ЗаглавнымиОбозначениеИзJSON = Врег(ОбозначениеИзJSON);
	
	Если ЗаглавнымиОбозначениеИзJSON = "FRES_UC_FPERS_FROM_US" Тогда
		КатегорияРоли = КатегорииРолей.ИностранныйРезидентПодКонтролемИностранныхЛицИзНедружественныхСтран;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "FRES_UC_FPERS_FROM_FS" Тогда
		КатегорияРоли = КатегорииРолей.ИностранныйРезидентПодКонтролемИностранныхЛицИзДружественныхСтран;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "FRES_S_DECREE95" Тогда
		КатегорияРоли = КатегорииРолей.ИностранныйРезидентУдовлетворяющийТребованиямП12Указа95;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "RRES_UC_FPERS_FROM_US" Тогда
		КатегорияРоли = КатегорииРолей.РоссийскийРезидентПодКонтролемИностранныхЛицИзНедружественныхСтран;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "RRES_UC_FPERS_FROM_FS" Тогда
		КатегорияРоли = КатегорииРолей.РоссийскийРезидентПодКонтролемИностранныхЛицИзДружественныхСтран;
	ИначеЕсли ЗаглавнымиОбозначениеИзJSON = "RRES_UC_RRES" Тогда
		КатегорияРоли = КатегорииРолей.РоссийскийРезидентПодКонтролемРоссийскихРезидентов;
	Иначе
		ВызватьИсключение "Не предусмотренное обозначение категории роли клиента согласно Указов №81 и №95: " + ОбозначениеИзJSON;
	КонецЕсли;
	
	Возврат КатегорияРоли;
КонецФункции

Функция CrmClientIdЗарегистрирован(CrmClientId)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КодыЗагрузки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	КодыЗагрузки.Код = &Код
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|	И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ТекущаяДата)
	|	И КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(справочник.КлассификаторыЗагрузки.Клиенты)");
	Запрос.УстановитьПараметр("Код", СокрЛП(CrmClientId));
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
КонецФункции

Процедура ЗафиксироватьОшибку(СообщениеОбОшибке, Data, Ошибка)
	ДанныеСообщения = MessageInfo[0];
	Если НРег(ДанныеСообщения.MessageType) = "client" Тогда
		CrmClientId = ClientIds[0].CrmClientId;
		Data.Client.ClientStatuses.DepoClientStatus = СтатусРегистрацииОшибка;
		Data.Client.ClientStatuses.DepoClientStatusDate = ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO);
		Data.Client.ClientIds.CrmClientId = CrmClientId;
	ИначеЕсли НРег(ДанныеСообщения.MessageType) = "contract" Тогда
		CrmClientId = Data.CrmClientId;
		Data.StatusCode = СтатусРегистрацииОшибка;
	КонецЕсли;
	Ошибка = Ошибка + Символы.ПС + СообщениеОбОшибке;
КонецПроцедуры

Функция НеРезидентПоГражданству(ФизЛицо, Дата)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ГражданствоФизЛиц.НеЯвляетсяНалоговымРезидентомРФ КАК НеРезидент
	|ИЗ
	|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&Дата, ФизЛицо = &ФизЛицо) КАК ГражданствоФизЛиц");
	Запрос.УстановитьПараметр("Дата", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ФизЛицо", Физлицо);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		НеРезидент = Выборка.НеРезидент;
	Иначе
		НеРезидент = Ложь;
	КонецЕсли;
	Возврат НеРезидент;
КонецФункции

Функция КатегорияФизЛицаПоДаннымKafka()
	
	ИныеИнструменты = Новый Массив;
	ИныеИнструменты.Добавить("АкцииИОблигацииИностранныхЭмитентов");
	ИныеИнструменты.Добавить("ГЦБРоссийскиеСубъектовМуниципальные");
	ИныеИнструменты.Добавить("ИныеФинансовыеИнструменты");
	
	Категории = Новый Соответствие;
	Категории.Вставить("QIA_SEC_RFISSUER"			, "АкцииИОблигацииРоссийскихЭмитентов");
	Категории.Вставить("QIA_ADR_GDR"				, "ДепозитарныеРасписки");
	Категории.Вставить("QIA_SEC_FUND"				, "ИнвестиционныеПаи");
	Категории.Вставить("QIA_SEC_FORISSUER"			, "ИностранныеГЦБ");
	Категории.Вставить("QIA_OTHER_SEC_DERIVATIVE"	, ИныеИнструменты);
	
	Возврат Категории;
	
КонецФункции

Функция ЭтоКорректныйКодТарифногоПлана(ContractRateCode)
	
	КорректныеКоды = Новый Массив;
	КорректныеКоды.Добавить("Turn");
	КорректныеКоды.Добавить("PROFIT");
	
	Если КорректныеКоды.Найти(ContractRateCode) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция СчетДепоМХПоручения(Депонент, ТипСчетаДепо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравоИспользования.Значение КАК ПравоИспользованияЦБКлиентов
		|ИЗ
		|	РегистрСведений.ПравоИспользованияЦБКлиентов.СрезПоследних(&ТекущаяДата, Клиент = &Клиент) КАК ПравоИспользования";
	
	Запрос.УстановитьПараметр("Клиент", Депонент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПравоИспользованияЦБ = ВыборкаДетальныеЗаписи.ПравоИспользованияЦБКлиентов;
	Иначе
		ПравоИспользованияЦБ = Ложь;
	КонецЕсли;
	
	ИмяОбъекта = "Обработка.РегистрацияКлиентаЧерезKafka";
	ПустаяСтруктура = Новый Структура;
	// BSLLS:Typo-off
	ИмяНастройки = ?(ПравоИспользованияЦБ, "МХ_СПИпоУмолчанию", "МХ_БПИпоУмолчанию");
	// BSLLS:Typo-on
	ЗначенияРеквизитов =
		ОбщегоНазначения.ПолучитьЗначенияРеквизитовШапкиОбъектаПоУмолчанию(ИмяОбъекта, ПустаяСтруктура, ИмяНастройки);
		
	ЭтоТорговыйСчет = ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ВладельцаТорговый
		Или ТипСчетаДепо = Перечисления.ТипыСчетовДепо.НоминальногоДержателяТорговый
		Или ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ДоверительногоУправляющегоТорговый
		Или ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ИностранногоНоминальногоДержателяТорговый
		Или ТипСчетаДепо = Перечисления.ТипыСчетовДепо.ИностранногоУполномоченногоДержателяТорговый;
	Если ЭтоТорговыйСчет Тогда
		РазделСчетаДепоМХ = ЗначенияРеквизитов.МХОбеспечения;
	Иначе
		РазделСчетаДепоМХ = ЗначенияРеквизитов.МХОсновной;
	КонецЕсли;
	
	СчетДепоМХ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РазделСчетаДепоМХ, "Владелец");
	Возврат СчетДепоМХ;
	
КонецФункции

Процедура ЗаполнитьПоручениеДляДержательскойСхемы(Поручение, ДепозитарийМХ, ПараметрыПоручений) // BSLLS:Typo-off
	
	ДанныеДоговора = ПараметрыПоручений.ДанныеДоговора;
	Поручение.ОткрытьВМХ = Истина;
	Поручение.СчетДепоМХ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДепозитарийМХ, "Владелец");
	НайденныйРазделСчетаДепоМХ = Справочники.РазделыСчетаДепоМХ.НайтиПоКоду(ДанныеДоговора.DepoMxDivisionCode);
	Если ЗначениеЗаполнено(НайденныйРазделСчетаДепоМХ) Тогда
		ТекстОшибки = СтрШаблон("Номер раздела счета депо МХ %1 уже зарегистрирован", ДанныеДоговора.DepoMxDivisionCode);
		ВызватьИсключение ТекстОшибки;
	Иначе
		Поручение.НомерРазделаСчетаДепоМХ = ДанныеДоговора.DepoMxDivisionCode;
	КонецЕсли;
	КодЗагрузкиБрокера = СокрЛП(ДанныеДоговора.BrokerCode);
	НайденныйБрокер = БрокерПоКодуЗагрузки(КодЗагрузкиБрокера);
	Если ЗначениеЗаполнено(НайденныйБрокер) Тогда
		Поручение.Брокер = НайденныйБрокер;
	Иначе
		ТекстОшибки = СтрШаблон("Не удалось найти брокера по коду загрузки %1", КодЗагрузкиБрокера);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ФорматДаты = "ДФ=dd.MM.yyyy";
	Поручение.Комментарий = СтрШаблон("Депозитарный договор № %1 от %2, Дополнительное соглашение № %3 от %4",
		СокрЛП(ПараметрыПоручений.НомерДоговораДепо), Формат(ПараметрыПоручений.ДатаДоговораДепо, ФорматДаты),
		ДанныеДоговора.AdditionalAgreementNumber, Формат(ДанныеДоговора.AdditionalAgreementDate, ФорматДаты));
	
КонецПроцедуры

Функция БрокерПоКодуЗагрузки(Код)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КодыЗагрузки.Владелец КАК КодЗагрузкиВладелец,
	|	Контрагенты.Ссылка КАК ГруппаКонтрагенты
	|ПОМЕСТИТЬ КодЗагрузкиИГруппаКонтрагенты
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (Контрагенты.Код = &ГруппаКонтрагентыКод)
	|			И (Контрагенты.ЭтоГруппа)
	|ГДЕ
	|	КодыЗагрузки.Код = &Код
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА КодыЗагрузки.ДатаОкончанияДействия > &ТекущаяДата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И КодыЗагрузки.Биржа = &Классификатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Брокер
	|ИЗ
	|	КодЗагрузкиИГруппаКонтрагенты КАК КодЗагрузкиИГруппаКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО КодЗагрузкиИГруппаКонтрагенты.КодЗагрузкиВладелец = Контрагенты.Ссылка
	|			И КодЗагрузкиИГруппаКонтрагенты.ГруппаКонтрагенты = Контрагенты.Родитель
	|ГДЕ
	|	НЕ Контрагенты.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтрагентыЮрлица.Ссылка
	|ИЗ
	|	КодЗагрузкиИГруппаКонтрагенты КАК КодЗагрузкиИГруппаКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО КодЗагрузкиИГруппаКонтрагенты.КодЗагрузкиВладелец = ЮридическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыЮрлица
	|		ПО (ЮридическиеЛица.Ссылка = КонтрагентыЮрлица.ЮридическиеФизическиеЛица)
	|			И КодЗагрузкиИГруппаКонтрагенты.ГруппаКонтрагенты = КонтрагентыЮрлица.Родитель
	|ГДЕ
	|	НЕ КонтрагентыЮрлица.Ссылка ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Классификатор", Справочники.КлассификаторыЗагрузки.NrdCode);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ГруппаКонтрагентыКод", "Контрагент");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Брокер;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ИнициализацияДанных

Процедура ИнициализацияДанныхКлиентаJSON(СтруктураJSON, Ошибка) Экспорт
	
	Попытка
		ДанныеКлиента = СтруктураJSON.Data.Client;
		ИдентификаторыКлиента = ДанныеКлиента.ClientIds;
		УслугиКлиента = ДанныеКлиента.ClientServices;
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
	ЗаполнитьClientIds(ИдентификаторыКлиента, Ошибка);
	ЗаполнитьClientServices(УслугиКлиента, Ошибка);		// В этой секции есть сведения о том, является ли этот клиент клиентом депозитария
	
	Если Не ЭтоДепозитарныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		СтатусыКлиента = ДанныеКлиента.ClientStatuses;
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
	КонецПопытки;
	ЗаполнитьClientStatuses(СтатусыКлиента, Ошибка);	// В этой секции есть сведения о том, является ли клиент юрлицом или физлицом
	
	ПустойМассив = Новый Массив;
	Попытка
		Если ЭтоЮрлицо() Тогда
			ДанныеЮридическогоЛица = ДанныеКлиента.LegalInfo;
			ДанныеОЛицензияхЮрЛица = ДанныеКлиента.Licenses;
			ДанныеОГосРегистрацииЮрЛица = ДанныеКлиента.RegState;
		Иначе
			ДанныеФизлица = ДанныеКлиента.PersonInfo;
			ДанныеФИО = ДанныеФизлица.ClientFio;
			ДанныеДокументов = ДанныеКлиента.ClientDocuments;
		КонецЕсли;
		НалоговыеДанные = ДанныеКлиента.ClientTaxInfo;
		АдресаКлиента = ДанныеКлиента.ClientAddresses;
		КонтактыКлиента = ДанныеКлиента.ClientContacts;
		КлиентскиеМенеджеры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКлиента, "ManagerInfo", ПустойМассив);
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
	
	Если ЭтоЮрлицо() Тогда
		ЗаполнитьLegalInfo(ДанныеЮридическогоЛица, Ошибка);
		ЗаполнитьVed(ДанныеЮридическогоЛица, Ошибка);
		ЗаполнитьLicenses(ДанныеОЛицензияхЮрЛица, Ошибка);
		ЗаполнитьRegState(ДанныеОГосРегистрацииЮрЛица, Ошибка);
	Иначе
		ЗаполнитьPersonInfo(ДанныеФизлица, Ошибка);
		ЗаполнитьPersonFio(ДанныеФИО, Ошибка);
		ЗаполнитьClientDocuments(ДанныеДокументов, Ошибка);
	КонецЕсли;
	
	ЗаполнитьClientTaxInfo(НалоговыеДанные, Ошибка);
	ЗаполнитьClientAddresses(АдресаКлиента, Ошибка);
	ЗаполнитьClientContacts(КонтактыКлиента, Ошибка);
	ЗаполнитьManagerInfo(КлиентскиеМенеджеры, Ошибка);
КонецПроцедуры

Процедура ИнициализацияДанныхДоговораJSON(СтруктураJSON, Ошибка) Экспорт
	
	ИмяСобытия = "РегистрацияДоговора";
	Попытка
		ДанныеДоговора = СтруктураJSON.Data;
	Исключение
		ОбработатьОшибкуИнициализацииДанных(Ошибка, "Contract");
		ВызватьИсключение;
	КонецПопытки;
	
	ЗаполнитьContract(ДанныеДоговора, Ошибка);
	
КонецПроцедуры

Процедура ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка)
	ОбработатьОшибкуИнициализацииДанных(Ошибка, "Client");
КонецПроцедуры

Процедура ОбработатьОшибкуИнициализацииДанных(Ошибка, Ключ = "")
	Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
	Ответ = СтруктураСообщенияОшибки("", Ошибка);
	Ответ.Вставить("Ключ", Ключ);
	Кафка.ОтправитьОшибкуОбработки(Ответ);
КонецПроцедуры

Процедура ОчиститьТабличныеДанные()
	MessageInfo.Очистить();
	ClientIds.Очистить();
	ClientServices.Очистить();
	ClientStatuses.Очистить();
	PersonInfo.Очистить();
	PersonFio.Очистить();
	ClientDocuments.Очистить();
	ClientTaxInfo.Очистить();
	ClientAddresses.Очистить();
	ClientContacts.Очистить();
	Contract.Очистить();
	QualInfo.Очистить();
	LegalInfo.Очистить();
	VedCodes.Очистить();
	Licenses.Очистить();
	RegState.Очистить();
КонецПроцедуры

Процедура ЗаполнитьMessageInfo(ДанныеMessageInfo, Ошибка, Ключ)
	
	Запись = MessageInfo.Добавить();
	Попытка
		Запись.MessageType		= ДанныеMessageInfo.MessageType;
		Запись.MessageId		= ДанныеMessageInfo.MessageId;
		Запись.MasterMessageId	= ДанныеMessageInfo.MasterMessageId;
		Запись.ParentMessageId	= ДанныеMessageInfo.ParentMessageId;
		Запись.SystemSource		= ДанныеMessageInfo.SystemSource;
		Запись.DateTimeCreate	= ДатаИзJSON(ДанныеMessageInfo.DateTimeCreate, ФорматДатыJSON.ISO);
		Запись.JsonVersion		= ДанныеMessageInfo.JsonVersion;
		Запись.ActionType		= ДанныеMessageInfo.ActionType;
	Исключение
		ОбработатьОшибкуИнициализацииДанных(Ошибка, Ключ);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьClientIds(ДанныеClientIds, Ошибка)
	
	Запись = ClientIds.Добавить();
	Попытка
		Запись.CrmClientId	= Формат(ДанныеClientIds.CrmClientId, "ЧГ=");
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьClientServices(ДанныеClientServices, Ошибка)
	
	Попытка
		Если ДанныеClientServices = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Для Каждого Услуга Из ДанныеClientServices Цикл
			Запись					= ClientServices.Добавить();
			Запись.ServiceType		= Услуга.ServiceType;
			Запись.ServiceStatus	= Услуга.ServiceStatus;
		КонецЦикла;
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьClientStatuses(ДанныеClientStatuses, Ошибка)
	
	Запись = ClientStatuses.Добавить();
	Попытка
		Запись.ClientType			= ДанныеClientStatuses.ClientType;
		Запись.DepoClientStatus		= ДанныеClientStatuses.DepoClientStatus;
		Запись.DepoClientStatusDate = ДатаИзJSON(ДанныеClientStatuses.DepoClientStatusDate, ФорматДатыJSON.ISO);
		Запись.CrmClientStatus		= ДанныеClientStatuses.CrmClientStatus;
		Запись.CrmClientStatusDate	= ДатаИзJSON(ДанныеClientStatuses.CrmClientStatusDate, ФорматДатыJSON.ISO);
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьPersonInfo(ДанныеPersonInfo, Ошибка)
	
	Запись = PersonInfo.Добавить();
	Попытка
		Запись.Sex			= ДанныеPersonInfo.Sex;
		Запись.BirthDate	= ДатаИзJSON(ДанныеPersonInfo.BirthDate, ФорматДатыJSON.ISO);
		Запись.BirthPlace	= ДанныеPersonInfo.BirthPlace;
		Запись.Citizenship	= ДанныеPersonInfo.Citizenship;
		Запись.Snils		= ДанныеPersonInfo.Snils;
		Запись.Pboul		= ДанныеPersonInfo.Pboul;
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьPersonFio(ДанныеPersonFio, Ошибка)
	
	Запись = PersonFio.Добавить();
	Попытка
		Запись.Name				= ДанныеPersonFio.Name;
		Запись.LastName			= ДанныеPersonFio.LastName;
		Запись.FirstName		= ДанныеPersonFio.FirstName;
		Запись.MiddleName		= ДанныеPersonFio.MiddleName;
		Запись.GenName			= ДанныеPersonFio.GenName;
		Запись.NameLat			= ДанныеPersonFio.NameLat;
		Запись.LastNameLat		= ДанныеPersonFio.LastNameLat;
		Запись.FirstNameLat		= ДанныеPersonFio.FirstNameLat;
		Запись.MiddleNameLat	= ДанныеPersonFio.MiddleNameLat;
		Если ПустаяСтрока(Запись.Name) Тогда
			Запись.Name = СокрЛП(Запись.LastName) + " " + СокрЛП(Запись.FirstName) + " " + СокрЛП(Запись.MiddleName);
		КонецЕсли;
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьLegalInfo(ДанныеLegalInfo, Ошибка)
	Запись = LegalInfo.Добавить();
	Попытка
		ДанныеRole = ДанныеLegalInfo.Role;
		Запись.CategoryRole = ДанныеRole.CategoryRole;
		Запись.TypeAccountC = ДанныеRole.TypeAccountC;
		Запись.TypeOperationC = ДанныеRole.TypeOperationC;
		
		ДанныеName = ДанныеLegalInfo.Name;
		Запись.FullName = ДанныеName.FullName;
		Запись.ShortName = ДанныеName.ShortName;
		Запись.FullFrgnName = ДанныеName.FullFrgnName;
		Запись.UniCBName = ДанныеName.UniCBName;
		Запись.Ownership = ДанныеName.Ownership;
		
		ДанныеInternational = ДанныеLegalInfo.International;
		Запись.InternationalOrganization = ДанныеInternational.InternationalOrganization;
		Запись.InternationalCompany = ДанныеInternational.InternationalCompany;
		Запись.RegCountry = ДанныеInternational.RegCountry;
		Запись.IsResident = ДанныеInternational.IsResident;
		
		ДанныеStatic = ДанныеLegalInfo.Static;
		Запись.Kpp = ДанныеStatic.Kpp;
		Запись.Okpo = ДанныеStatic.Okpo;
		Запись.OkVed = ДанныеStatic.OkVed;
		Запись.Tin = ДанныеStatic.Tin;
		Запись.OKFS = ДанныеStatic.OKFS;
		Запись.OKOPF = ДанныеStatic.OKOPF;
		Запись.OKOGU = ДанныеStatic.OKOGU;
		Запись.OKONH = ДанныеStatic.OKONH;
		
		ДанныеReportingFields = ДанныеLegalInfo.ReportingFields;
		Запись.CodeClientReg = ДанныеReportingFields.CodeClientReg; 
		
		ДанныеAddedFields = ДанныеLegalInfo.AddedFields;
		Запись.TypeSare = ДанныеAddedFields.TypeSare;
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры
	
Процедура ЗаполнитьVed(ДанныеLegalInfo, Ошибка)
	Попытка
		Для Каждого КодВидаДеятельности Из ДанныеLegalInfo.Static.Ved Цикл
			Запись = VedCodes.Добавить();
			Запись.Ved = КодВидаДеятельности;
		КонецЦикла;
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

Процедура ЗаполнитьLicenses(ДанныеОЛицензияхЮрЛица, Ошибка)
	Попытка
		Для Каждого ИнформацияОЛицензии Из ДанныеОЛицензияхЮрЛица Цикл
			Запись = Licenses.Добавить();
			Запись.License = ИнформацияОЛицензии.License;
			Запись.Number = ИнформацияОЛицензии.Number;
			Запись.Institution = ИнформацияОЛицензии.Institution;
			Запись.DateExt = ДатаИзJSON(ИнформацияОЛицензии.DateExt, ФорматДатыJSON.ISO);
			Запись.DateStart = ДатаИзJSON(ИнформацияОЛицензии.DateStart, ФорматДатыJSON.ISO);
			Запись.DateStop = ДатаИзJSON(ИнформацияОЛицензии.DateStop, ФорматДатыJSON.ISO);
			Запись.ActionList = ИнформацияОЛицензии.ActionList;
			Запись.TypeLicense = ИнформацияОЛицензии.TypeLicense;
			Запись.ShortTypeLicense = ИнформацияОЛицензии.ShortTypeLicense;
			Запись.LicenseAuthority = ИнформацияОЛицензии.LicenseAuthority;
		КонецЦикла;
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

Процедура ЗаполнитьRegState(ДанныеRegState, Ошибка)
	Запись = RegState.Добавить();
	Попытка
		Запись.OGRN = ДанныеRegState.OGRN;
		Запись.RegAuthority = ДанныеRegState.RegAuthority;
		Запись.RegDate = ДатаИзJSON(ДанныеRegState.RegDate, ФорматДатыJSON.ISO);
		Запись.RegPlace = ДанныеRegState.RegPlace;
		Запись.OGRNNumber = ДанныеRegState.OGRNNumber;
		Запись.RecordDate = ДатаИзJSON(ДанныеRegState.RecordDate, ФорматДатыJSON.ISO);
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

Процедура ЗаполнитьClientDocuments(ДанныеClientDocuments, Ошибка)
	
	Попытка
		Для Каждого Документ Из ДанныеClientDocuments Цикл
			Запись = ClientDocuments.Добавить();
			Запись.DocumentType		= Документ.DocumentType;
			Запись.Series			= Документ.Series;
			Запись.Number			= Документ.Number;
			Запись.Issuer			= Документ.Issuer;
			Запись.IssuerCode		= Документ.IssuerCode;
			Запись.IssueDate		= ДатаИзJSON(Документ.IssueDate, ФорматДатыJSON.ISO);
			Запись.EndDate			= ДатаИзJSON(Документ.EndDate, ФорматДатыJSON.ISO);
			Запись.IssuerAddress	= Документ.IssuerAddress;
			Запись.IssuerAddressLat	= Документ.IssuerAddressLat;
			Запись.Active			= Документ.Active;
		КонецЦикла;
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьClientTaxInfo(ДанныеClientTaxInfo, Ошибка)
	
	Запись = ClientTaxInfo.Добавить();
	
	Если НЕ ЗначениеЗаполнено(ДанныеClientTaxInfo) Тогда
		CrmClientId = ?(ClientIds.Количество() > 0, ClientIds[0].CrmClientId, "");
		MessageId = ?(MessageInfo.Количество() > 0, MessageInfo[0].MessageId, "");
		Ошибка = "Отсутствует информация о том, является ли клиент с CrmClientId = " + CrmClientId + "налоговым резидентом РФ"
					+ " - в сообщении с MessageId = " + MessageId + " нет секции ClientTaxInfo";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
		Ответ = СтруктураСообщенияОшибки("", Ошибка);
		Ответ.Вставить("Ключ", "Client");
		Кафка.ОтправитьОшибкуОбработки(Ответ);
		Возврат;
	КонецЕсли;
	
	Попытка
		Запись.RuTaxResident	= ДанныеClientTaxInfo.RuTaxResident;
		Запись.Inn				= ДанныеClientTaxInfo.Inn;
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьClientAddresses(ДанныеClientAddresses, Ошибка)
	
	Попытка
		Для Каждого Адрес Из ДанныеClientAddresses Цикл
			Запись = ClientAddresses.Добавить();
			Запись.AddrType		= Адрес.AddrType;
			Запись.AddrValue	= Адрес.AddrValue;
			Запись.AddrDate		= ДатаИзJSON(Адрес.AddrDate, ФорматДатыJSON.ISO);
			Запись.Index		= Адрес.Index;
			Запись.Country		= Адрес.Country;
			Запись.Region		= Адрес.Region;
			Запись.Locality		= Адрес.Locality;
			Запись.Town			= Адрес.Town;
			Запись.Area			= Адрес.Area;
			Запись.Street		= Адрес.Street;
			Запись.Build		= Адрес.Build;
			Запись.Housing		= Адрес.Housing;
			Запись.House		= Адрес.House;
			Запись.Office		= Адрес.Office;
			Запись.Comment		= Адрес.Comment;
		КонецЦикла;
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьClientContacts(ДанныеClientContacts, Ошибка)
	
	Попытка
		Для Каждого Контакт Из ДанныеClientContacts Цикл
			Запись = ClientContacts.Добавить();
			Запись.ContactType	= Контакт.ContactType;
			Запись.ContactValue	= Контакт.ContactValue;
			Запись.CountryCode	= Контакт.CountryCode;
			Запись.RegionCode	= Контакт.RegionCode;
			Запись.Comment		= Контакт.Comment;
		КонецЦикла;
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьContract(ДанныеContract, Ошибка)
	
	Попытка
		Запись = Contract.Добавить();
		Запись.CreateDate							= ДатаИзJSON(ДанныеContract.CreateDate, ФорматДатыJSON.ISO);
		Запись.CloseDate							= ДатаИзJSON(ДанныеContract.CloseDate, ФорматДатыJSON.ISO);
		Запись.ContractType							= ДанныеContract.ContractType;
		Запись.ContractSubType						= ДанныеContract.ContractSubType;
		Запись.DepoAccountSectionType				= ДанныеContract.DepoAccountSectionType;
		Запись.StatusCode							= ДанныеContract.StatusCode;
		Запись.CrmClientId							= Формат(ДанныеContract.CrmClientId, "ЧГ=");
		Запись.ClientIdSystem						= ДанныеContract.ClientIdSystem;
		Запись.ContractNumber						= ДанныеContract.ContractNumber;
		Запись.IsSCP								= ДанныеContract.IsSCP;
		Запись.IsClientGrantedRightsUseSecurities	= ДанныеContract.IsClientGrantedRightsUseSecurities;
		Запись.Comment								= ДанныеContract.Comment;
		Запись.ObjectVersion						= ДанныеContract.ObjectVersion;
		Запись.ContractRateCode						= ДанныеContract.ContractRateCode;
		Если ДанныеContract.Свойство("Flags") И ТипЗнч(ДанныеContract.Flags) = Тип("Массив") Тогда
			Для Каждого Элемент Из ДанныеContract.Flags Цикл
				Если Элемент.Type = "Profit" Тогда
					Запись.Profit = ДанныеContract.Flags[0].Value;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ДанныеContract.Свойство("Holder") Тогда
			ДанныеHolder = ДанныеContract.Holder;
			Запись.BrokerCode = ДанныеHolder.BrokerCode;
			Запись.BrokerName = ДанныеHolder.BrokerName;
			Запись.AdditionalAgreementNumber = ДанныеHolder.AdditionalAgreementNumber;
			Запись.AdditionalAgreementDate = ДатаИзJSON(ДанныеHolder.AdditionalAgreementDate, ФорматДатыJSON.ISO);
			Запись.DepoMxDivisionCode = ДанныеHolder.DepoMxDivisionCode;
		КонецЕсли;
	Исключение
		ОбработатьОшибкуИнициализацииДанных(Ошибка, "Contract");
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ИнициализацияMessageInfo(СтруктураJSON, Ошибка, Ключ) Экспорт
	
	ИмяСобытия = "РегистрацияКлиента";
	СтатусРегистрацииОшибка = "REGERR";
	ОчиститьТабличныеДанные();
	Попытка
		ДанныеMessageInfo = СтруктураJSON.MessageInfo;
		ЗаполнитьMessageInfo(ДанныеMessageInfo, Ошибка, Ключ);
	Исключение
		ОбработатьОшибкуИнициализацииДанных(Ошибка, Ключ);
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры

Процедура ИнициализацияДанныхQualInfo(СтруктураJSON, Ошибка) Экспорт
	
	ИмяСобытия = "Установка признака квал.инвестор";
	Попытка
		ДанныеQualInfo = СтруктураJSON.Data.Client.QualInfo;
		ДанныеClientIds = СтруктураJSON.Data.Client.ClientIds;
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
	
	ЗаполнитьQualInfo(ДанныеQualInfo, Ошибка);
	ЗаполнитьClientIds(ДанныеClientIds, Ошибка);
КонецПроцедуры

Процедура ЗаполнитьQualInfo(ДанныеQualInfo, Ошибка)
	
	Попытка
		ДанныеQualInfoCategory = ДанныеQualInfo.QualSecCateg;
		Для Каждого Категория Из ДанныеQualInfoCategory Цикл
			Запись = QualInfo.Добавить();
			Запись.QualInvestStatus	= ДанныеQualInfo.QualInvestStatus;
			Запись.QualInvestDate	= ДатаИзJSON(ДанныеQualInfo.QualInvestDate, ФорматДатыJSON.ISO);
			Запись.QualSecCateg		= Категория;
		КонецЦикла;
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьManagerInfo(ДанныеManagerInfo, Ошибка)
	
	Если Не ЗначениеЗаполнено(ДанныеManagerInfo) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Для Каждого Менеджер Из ДанныеManagerInfo Цикл
			Запись = ManagerInfo.Добавить();
			Запись.ManagerID = Менеджер.ManagerID;
			Запись.FIO = Менеджер.FIO;
		КонецЦикла;
	Исключение
		ОбработатьОшибкуИнициализацииДанныхКлиента(Ошибка);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
