
#Область ПрограммныйИнтерфейс

// Возвращает банковские реквизиты для поручения (Паи - Банковские реквизиты)
//
// Параметры:
//  БанковскийСчет	 - СправочникСсылка.БанковскиеСчета	 - Банковский счет
// 
// Возвращаемое значение:
//   - Структура - Структура с полями см. поля запроса
//
Функция БанковскиеРеквизитыПаи(БанковскийСчет) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(БанковскиеСчета.Банк.Наименование) КАК ПаиНаименованиеБанка,
	|	МАКСИМУМ(БанковскиеСчета.НомерСчета) КАК ПаиРасчетныйСчет,
	|	МАКСИМУМ(БанковскиеСчета.Владелец.Наименование) КАК ПаиПолучатель,
	|	МАКСИМУМ(БанковскиеСчета.Банк.КоррСчет) КАК ПаиКоррСчет,
	|	МАКСИМУМ(СОКРЛП(СТРОКА(БанковскиеСчета.Банк.Код))) КАК ПаиБИК,
	|	МАКСИМУМ(БанковскиеСчета.Банк.ИНН) КАК ПаиИНН,
	|	МАКСИМУМ(БанковскиеСчета.Банк.Город) КАК ПаиГородБанка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Ссылка = &БанковскийСчет
	|
	|СГРУППИРОВАТЬ ПО
	|	БанковскиеСчета.Ссылка";
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	БанковскиеРеквизиты = Запрос.Выполнить().Выгрузить();
	Если БанковскиеРеквизиты.Количество() = 0 Тогда
		БанковскиеРеквизиты.Добавить();
	КонецЕсли;
	БанковскиеРеквизиты = ОбщегоНазначения.ТаблицаЗначенийВМассив(БанковскиеРеквизиты)[0];
	
	Возврат БанковскиеРеквизиты;
	
КонецФункции

#КонецОбласти