
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;  // ручное создание записей не предполагается
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПеренумерацию(Команда)
	
	ОтветНаВопрос = Вопрос("Выполнить перенумерацию всех зарегистрированных документов за указанные периоды?", РежимДиалогаВопрос.ДаНет, 10);
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет или ОтветНаВопрос = КодВозвратаДиалога.Таймаут Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьПеренумерациюНаСервере();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
ПРоцедура ВыполнитьПеренумерациюНаСервере()
	Обработка = Обработки.ПеренумерацияДокументов.Создать();
	Обработка.ВыполнитьПеренумерациюЗарегистрированныхДокументов();
КонецПроцедуры

