#Область ПрограммныйИнтерфейс

#Область ПрограммныйИнтерфейс

// Возвращает пустую таблицу значений
// Возвращаемое значение:
//	ТаблицаЗначений - со следующими колонками:
//							DocumentNumber - номер в СЭД
//							ClientId - идентификатор клиента в СУДК (строка(9))
//							ISIN - ISIN ЦБ
//							RegNumber - государственный регистрационный номер ЦБ
//							StockBondsCount - число ЦБ к оферте
//							OfferDate - дата оферты
//							DocumentId - ID заявки
//							Exported1C - завка была выгружена в 1С
//							CreatedAt - дата создания заявки в кабинете клиента
Функция НоваяТаблицаДляЗаявленийИзКабинетаКлиента() Экспорт
	ТипСтрока50 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50));
	ТипСтрока30 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(30));
	ТипСтрока20 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20));
	ТипЧислоКоличествоЦБ = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19, 7, ДопустимыйЗнак.Любой));
	ТипДата = Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ТипДатаСоВременем = Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	ТипЦелоеЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный));
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	Заявления = Новый ТаблицаЗначений;
	Заявления.Колонки.Добавить("DocumentNumber", ТипСтрока50);
	Заявления.Колонки.Добавить("ClientId", ТипСтрока20);
	Заявления.Колонки.Добавить("ISIN", ТипСтрока30);
	Заявления.Колонки.Добавить("RegNumber", ТипСтрока30);
	Заявления.Колонки.Добавить("StockBondsCount", ТипЧислоКоличествоЦБ);
	Заявления.Колонки.Добавить("OfferDate", ТипДата);
	Заявления.Колонки.Добавить("DocumentId", ТипЦелоеЧисло);
	Заявления.Колонки.Добавить("Exported1C", ТипБулево);
	Заявления.Колонки.Добавить("CreatedAt", ТипДатаСоВременем);
	
	Возврат Заявления;
КонецФункции

#КонецОбласти

// Процедура создает уведомление для отправки по почте
// Параметры:
//	ЗаявлениеНаУчастиеВОферте - ДокументСсылка.ЗаявлениеНаУчастиеВОферте
//	НастройкиОбмена -  Структура - струкутра содержащая праметры настроек внешнего источника данных
Процедура ОтправитьУведомлениеОПоявленииНовогоЗаявленияНаУчастиеВОферте(ЗаявлениеНаУчастиеВОферте, НастройкиОбмена) Экспорт
	
	ТемаПисьма = "Новый документ «Заявление на участие в оферте»";	
	ТекстПисьма = "В 1С сформирован новый документ " + Строка(ЗаявлениеНаУчастиеВОферте);
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("Вложения",			Неопределено);
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
	
КонецПроцедуры

#КонецОбласти
