
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Оповещение = Новый ОписаниеОповещения("ВыборСпособаОтправкиОтчетовЗавершение", ЭтотОбъект, ПараметрКоманды);
	ПоказатьВводЗначения(Оповещение, ПредопределенноеЗначение("Перечисление.СпособыОтправкиОтчетов.ПустаяСсылка"),
		"Выберите ""Способ отправки отчетов""");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборСпособаОтправкиОтчетовЗавершение(Значение, ДополнительныеПараметры) Экспорт // BSLLS:CommandModuleExportMethods-off
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтправитьОтчетНаСервере(ДополнительныеПараметры, Значение);
КонецПроцедуры

&НаСервере
Процедура ОтправитьОтчетНаСервере(СводныйОтчет, СпособОтправкиОтчетов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(СводныйОтчетОСовершенныхОперацияхОперации.НомерСтроки) КАК Количество,
		|	МАКСИМУМ(СводныйОтчетОСовершенныхОперацияхОперации.ДатаОперации) КАК Дата
		|ПОМЕСТИТЬ ВТОперации
		|ИЗ
		|	Документ.СводныйОтчетОСовершенныхОперациях.Операции КАК СводныйОтчетОСовершенныхОперацияхОперации
		|ГДЕ
		|	СводныйОтчетОСовершенныхОперацияхОперации.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СводныйОтчетОСовершенныхОперациях.Ссылка КАК Ссылка,
		|	ВТОперации.Дата КАК Дата,
		|	СводныйОтчетОСовершенныхОперациях.ИсходящийНомер КАК ИсходящийНомер,
		|	СводныйОтчетОСовершенныхОперациях.СчетДепо КАК СчетДепо,
		|	СводныйОтчетОСовершенныхОперациях.СчетДепо.Владелец КАК СчетДепоВладелец,
		|	ВТОперации.Количество КАК ОперацииКоличество
		|ИЗ
		|	Документ.СводныйОтчетОСовершенныхОперациях КАК СводныйОтчетОСовершенныхОперациях,
		|	ВТОперации КАК ВТОперации
		|ГДЕ
		|	СводныйОтчетОСовершенныхОперациях.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СводныйОтчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИменаСвойств = "СчетДепо, Документ, Кво, Клиент, Основание, АдресТаблицы, ЭДО, ActionType, ТекстОшибки, СпособОтправкиОтчетов";
		ДанныеКОтправке = Новый Структура(ИменаСвойств);
		ДанныеКОтправке.ActionType = ?(Выборка.ИсходящийНомер <> "", "UPD", "INS");
		ДанныеКОтправке.СчетДепо = Выборка.СчетДепо;
		ДанныеКОтправке.Документ = Выборка.Ссылка;
		ДанныеКОтправке.Кво = Выборка.ОперацииКоличество;
		ДанныеКОтправке.Клиент = Выборка.СчетДепоВладелец;
		ДанныеКОтправке.Основание = Выборка.Ссылка;
		ДанныеКОтправке.СпособОтправкиОтчетов = СпособОтправкиОтчетов;
		
		ПоказатьПечатьИПодписьВДокументе = Ложь;
		Адрес = Документы.СводныйОтчетОСовершенныхОперациях.АдресПечатнойФормы(
			Выборка.Ссылка,
			Неопределено,
			ПоказатьПечатьИПодписьВДокументе,
			Новый УникальныйИдентификатор);
		Описатель = ПолучитьИзВременногоХранилища(Адрес);
			
		Если Описатель.Свойство("Ошибка") Тогда
			ДанныеКОтправке.АдресТаблицы = "";
		Иначе
			ДанныеКОтправке.АдресТаблицы = ПоместитьВоВременноеХранилище(Описатель.ТабДок);
		КонецЕсли;
		
		Обработка = Обработки.ФормированиеОтчетовОСовершенныхОперациях.Создать();
		Обработка.ДатаОпераций = Выборка.Дата;
		Обработка.ДатаФормированияОтчетов = Выборка.Дата;
		Обработка.ОбработатьДанныеОтчетаДляПередачиВКафку(ДанныеКОтправке, "DepoReport", Неопределено, Неопределено);
		
		Если ЗначениеЗаполнено(ДанныеКОтправке.ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеКОтправке.ТекстОшибки);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчет отправлен");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

