
#Область Переменные

&НаКлиенте
Перем СоответствиеРазрешенаОтчетностьЧерезЛК;

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Сформировать(Команда) Экспорт //Тест
	
	СообщениеПользователю = Новый СообщениеПользователю;
	
	Если ЭтаФорма.Отчет.ДатаНачала <'20171001' или ЭтаФорма.Отчет.ДатаОкончания <'20171001' Тогда
		ТекстСообщения = НСтр("ru = 'Данная версия отчёта не работает на этом периоде, пользуйтесь старой версией.'");
		СообщениеПользователю.Текст = ТекстСообщения;
		СообщениеПользователю.Поле = "Отчет.ДатаНачала";
		СообщениеПользователю.Сообщить();
		
		Возврат;
	КонецЕсли; 


	Если ЭтаФорма.Отчет.ДатаНачала > ЭтаФорма.Отчет.ДатаОкончания Тогда
		
		ТекстСообщения = НСтр("ru = 'Дата начала не может быть позже даты окончания отчета.'");
		СообщениеПользователю.Текст = ТекстСообщения;
		СообщениеПользователю.Поле = "Отчет.ДатаНачала";
		СообщениеПользователю.Сообщить();
		
		Возврат;
	КонецЕсли;	
	
	
	Если Отчет.РежимРаботы <> 0 Тогда
		
		Если ЭтаФорма.СписокДоговоровДУ.Количество() = 0 Тогда
		
			ТекстСообщения = НСтр("ru = 'Не заполнен реквизит Договора ДУ'");
			СообщениеПользователю.Текст = ТекстСообщения;
			СообщениеПользователю.Поле = "СписокДоговоровДУ";
			СообщениеПользователю.Сообщить();
			Возврат;			
		
		КонецЕсли; 

	Иначе
		
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.ДоговорДУ) Тогда
		
			ТекстСообщения = НСтр("ru = 'Не заполнен реквизит Договор ДУ'");
			СообщениеПользователю.Поле = "Отчет.ДоговорДУ";
			СообщениеПользователю.Текст = ТекстСообщения;
			СообщениеПользователю.Сообщить();
			Возврат;	
		
		КонецЕсли; 

	КонецЕсли; 
	
	//IMAPPS-21832++
	//Сообщим пользователю, если вдруг Дата формирования указана слишком далеко от периода
	Если ЗначениеЗаполнено(Отчет.ДатаФормированияРучная) 
		и (Отчет.ДатаФормированияРучная > ДобавитьМесяц(Отчет.ДатаОкончания, 3)
		или Отчет.ДатаФормированияРучная < ДобавитьМесяц(Отчет.ДатаНачала, -3)) Тогда
		ПоказатьПредупреждение(,"Проверьте Дату Формирования, возможно она указана некорректно");
	КонецЕсли;
	//IMAPPS-21832--
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	
		СформироватьНаСервере();
	
		УстановитьСостояниеТабличныхДокументов(Ложь);	
	
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
	
	ДиалогВыбораПериода = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогВыбораПериода.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталога(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКаталогаЗавершение", ЭтотОбъект);
	
	РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораКаталога.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	Сообщить("Отчет запущен: " + ТекущаяДата());
	
	НеЗаполненыРеквизиты = Ложь;
	
	Если НЕ ЗначениеЗаполнено(КаталогВыгрузки) И Отчет.РежимРаботы <> 2 Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		ТекстСообщения = НСтр("ru = 'Не заполнен реквизит Каталог выгрузки'");
		СообщениеПользователю.Текст = ТекстСообщения;
		СообщениеПользователю.Поле = "КаталогВыгрузки";
		СообщениеПользователю.Сообщить();
		НеЗаполненыРеквизиты = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.КаталогВыгрузкиНаСервере) И Отчет.РежимРаботы = 2 Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		ТекстСообщения = НСтр("ru = 'Не заполнен реквизит Каталог выгрузки на сервере'");
		СообщениеПользователю.Текст = ТекстСообщения;
		СообщениеПользователю.Поле = "КаталогВыгрузкиНаСервере";
		СообщениеПользователю.Сообщить();
		НеЗаполненыРеквизиты = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.КаталогВыгрузкиНаСервереКопия) И Отчет.РежимРаботы = 2 Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		ТекстСообщения = НСтр("ru = 'Не заполнен реквизит Каталог выгрузки на сервере (копия)'");
		СообщениеПользователю.Текст = ТекстСообщения;
		СообщениеПользователю.Поле = "КаталогВыгрузкиНаСервереКопия";
		СообщениеПользователю.Сообщить();
		НеЗаполненыРеквизиты = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыCom) И Отчет.РежимРаботы = 2 Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		ТекстСообщения = НСтр("ru = 'Не заполнен реквизит Параметры com текущей базы'");
		СообщениеПользователю.Текст = ТекстСообщения;
		СообщениеПользователю.Поле = "ПараметрыCom";
		СообщениеПользователю.Сообщить();
		НеЗаполненыРеквизиты = Истина;
	КонецЕсли;
	
	Если НеЗаполненыРеквизиты = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Отчет.РежимРаботы = 2 Тогда
		МассоваяВыгрузкаПоКлиентамРозничногоДУ();
	ИначеЕсли Отчет.РежимРаботы = 1 Тогда
		МассоваяВыгрузка();
		Сообщить("Отчет завершен: " + ТекущаяДата());
	ИначеЕсли Отчет.РежимРаботы = 0 Тогда
		ОдиночнаяВыгрузка();
		Сообщить("Отчет завершен: " + ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ДополнительнаяОбработкаСсылка", ДопОбработка);
	ОткрытьФорму("ВнешнийОтчет.внОтчетУправляющегоДУсогласно482П_v15.Форма.ФормаНастроек", ДопПараметры, ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДополнительнаяОбработкаСсылка", ДопОбработка);
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	Версия = ТекОбъект.СведенияОВнешнейОбработке().Версия;
	Заголовок = Заголовок + "v."+Версия;
	
	СписокЭлементовТабличныхДокументов.Добавить("ТабличныйДокументРаздел1");
	СписокЭлементовТабличныхДокументов.Добавить("ТабличныйДокументРаздел2");
	СписокЭлементовТабличныхДокументов.Добавить("ТабличныйДокументРаздел3");
	СписокЭлементовТабличныхДокументов.Добавить("ТабличныйДокументРаздел4");
	СписокЭлементовТабличныхДокументов.Добавить("ТабличныйДокументРаздел5");
	СписокЭлементовТабличныхДокументов.Добавить("ТабличныйДокументРаздел6_1");
	СписокЭлементовТабличныхДокументов.Добавить("ТабличныйДокументРаздел6_2");
	СписокЭлементовТабличныхДокументов.Добавить("ТабличныйДокументРаздел7");
	
	ТабличныйДокументРаздел1.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокументРаздел2.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокументРаздел3.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокументРаздел4.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокументРаздел5.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокументРаздел6_1.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокументРаздел6_2.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокументРаздел7.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	//TM-3137
	ТабличныйДокументРаздел1.АвтоМасштаб = Истина;
	ТабличныйДокументРаздел2.АвтоМасштаб = Истина;
	ТабличныйДокументРаздел3.АвтоМасштаб = Истина;
	ТабличныйДокументРаздел4.АвтоМасштаб = Истина;
	ТабличныйДокументРаздел5.АвтоМасштаб = Истина;
	ТабличныйДокументРаздел6_1.АвтоМасштаб = Истина;;
	ТабличныйДокументРаздел6_2.АвтоМасштаб = Истина;
	ТабличныйДокументРаздел7.АвтоМасштаб = Истина;
	//TM-3137
	
	УстановитьСостояниеТабличныхДокументов(Отчет.РежимРаботы = 0); // TM-3252 {}
	
	//VTBC SadykovNiyaz 01.04.2022 (IMAPPS-16952) {
	//ЭтаФорма.Отчет.НаименованиеУК = "АО ВТБ Капитал Управление активами";
	Отчет.НаименованиеУК = "АО ВИМ Инвестиции";
	//VTBC SadykovNiyaz 01.04.2022 (IMAPPS-16952) } 
	//IMAPPS-23458 
	Отчет.Подписант = ПолучитьПодписанта("baa998db-2068-11ec-80d9-005056b100fc");
	ЭтаФорма.Отчет.ПулРДУ = Справочники.Пул.НайтиПоНаименованию("Розничное ДУ");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	//НастройкаРежимРаботы = Настройки.Получить("Отчет.РежимРаботы");
	//
	//Элементы.ДоговорДУ.Видимость = НастройкаРежимРаботы = 0;
	//Элементы.СписокДоговоровДУ.Видимость = НастройкаРежимРаботы <> 0;
	//
	//Элементы.ПараметрыCom.Видимость = НастройкаРежимРаботы = 2;
	//Элементы.КоличествоПотоков.Видимость = НастройкаРежимРаботы = 2;
	
	//IMAPPS-30982++
	Если ЭтотОбъект.ДоговорДУ.ТипКлиентаДУ = Перечисления.ТипыКлиентовДУ.ФизическиеЛица Тогда
		Отчет.СкрыватьБалансовуюСтоимость = Истина
	КонецЕсли;
    //IMAPPS-30982--
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементовНаФорме();
	
	УстановитьВидимостьТабличныхДокументов(); // TM-3252 {}
	
	УстановитьДоступностьЭлементовФормы(); // TM-3252 {} 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	УстановитьСостояниеТабличныхДокументов(Истина, "НеАктуально");
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	УстановитьСостояниеТабличныхДокументов(Истина, "НеАктуально");
КонецПроцедуры

&НаКлиенте
Процедура ОтоброжатьФИОПриИзменении(Элемент)
	УстановитьСостояниеТабличныхДокументов(Истина, "НеАктуально");
КонецПроцедуры

&НаКлиенте
Процедура ДоговорДУПриИзменении(Элемент)
	УстановитьСостояниеТабличныхДокументов(Истина, "НеАктуально");
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровДУПриИзменении(Элемент)
	УстановитьСостояниеТабличныхДокументов(Истина, "НеАктуально");
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКаталогаЗавершение", ЭтотОбъект);
	
	РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораКаталога.Показать(ОписаниеОповещения);
КонецПроцедуры

// TM-3324 {

&НаКлиенте
Процедура КаталогВыгрузкиПоПризнакуЛКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКаталогаПоПризнакуЛКЗавершение", ЭтотОбъект);
	
	РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораКаталога.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура РазбиватьОтчетыПоПризнакуЛКПриИзменении(Элемент)
	Если Отчет.РежимРаботы = 2 Тогда
		Элементы.КаталогВыгрузкиПоПризнакуЛКНаСервере.Видимость = Отчет.РазбиватьОтчетыПоПризнакуЛК;
		Элементы.КаталогВыгрузкиПоПризнакуЛК.Видимость = Ложь;
	Иначе
		Элементы.КаталогВыгрузкиПоПризнакуЛК.Видимость = Отчет.РазбиватьОтчетыПоПризнакуЛК;
		Элементы.КаталогВыгрузкиПоПризнакуЛКНаСервере.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// TM-3324 }


&НаКлиенте
Процедура ЗагружатьДанныеЕПСПриИзменении(Элемент)
	НастроитьДоступностьЗагружатьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьДанныеРСБУПриИзменении(Элемент)
	НастроитьДоступностьЗагружатьДанные();
КонецПроцедуры

&НаКлиенте
Процедура РежимРаботыПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовНаФорме();
	
	УстановитьСостояниеТабличныхДокументов(Отчет.РежимРаботы = 0, "НеАктуально"); // TM-3252 {}
	
	//Элементы.ГруппаМассоваяПечать.Видимость = Отчет.МассоваяПечатьОтчетов;
	
	УстановитьВидимостьТабличныхДокументов(); // TM-3252 {}
	
	УстановитьДоступностьЭлементовФормы(); // TM-3252 {}
	
	СформированныеОтчеты.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНаСервереНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКаталогаНаСервереЗавершение", ЭтотОбъект);
	
	РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораКаталога.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНаСервереКопияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКаталогаНаСервереКопияЗавершение", ЭтотОбъект);
	
	РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораКаталога.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиПоПризнакуЛКНаСервереНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКаталогаПоПризнакуЛКНаСервереЗавершение", ЭтотОбъект);
	
	РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораКаталога.Показать(ОписаниеОповещения);
	
КонецПроцедуры

// TM-3324 }
&НаКлиенте
Процедура КоличествоПотоковПриИзменении(Элемент)
	Если Отчет.КоличествоПотоков > 10 Тогда
		Отчет.КоличествоПотоков = 10;
		Сообщить("Максимальное количество потоков - 10");
	КонецЕсли;
КонецПроцедуры

//VTBC SadykovNiyaz 01.04.2022 (IMAPPS-16952) {
&НаКлиенте
Процедура ФлагНовоеНаименованиеУКПриИзменении(Элемент)
	
	Элементы.НаименованиеУК.Доступность = Отчет.ФлагНовоеНаименованиеУК;
	
КонецПроцедуры
//VTBC SadykovNiyaz 01.04.2022 (IMAPPS-16952) }

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
	
	// TM-3252 {
	ОчиститьТабличныеДокументы(); 
	
	ЗаполнитьТабличныеДокументы(
		ЭтаФорма.ДоговорДУ,
		Ложь,
		ЭтаФорма.Отчет.ВыгружатьВФорматеExcel,
		ЭтаФорма.Отчет.ВыгружатьВФорматеPDF
	);
	// TM-3252 }

КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличныеДокументы()
	
	ЭтаФорма.ТабличныйДокументРаздел1.Очистить();
	ЭтаФорма.ТабличныйДокументРаздел2.Очистить();
	ЭтаФорма.ТабличныйДокументРаздел3.Очистить();
	ЭтаФорма.ТабличныйДокументРаздел4.Очистить();
	ЭтаФорма.ТабличныйДокументРаздел5.Очистить();
	ЭтаФорма.ТабличныйДокументРаздел6_1.Очистить();
	ЭтаФорма.ТабличныйДокументРаздел6_2.Очистить();
	ЭтаФорма.ТабличныйДокументРаздел7.Очистить();
	
	ЭтаФорма.СформированныеОтчеты.Очистить();
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТабличныеДокументы(Знач ТекущийДоговорДУ, Знач ВернутьМассив, Знач КакXLS, Знач КакPDF)
	Перем ОтчетОбъект, ТабличныеДокументы, МассивОтчетов;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	ТабличныеДокументы = ОтчетОбъект.ЗаполнитьДанныеОтчета(ТекущийДоговорДУ);
	
	Если ТабличныеДокументы  = Неопределено Тогда   // для договора ДУ дата ввода средств ДУ>Даты окончания отчета, не формируем очтет.
		МассивСформированныхОтчетов_xlsx = Новый Массив;
		МассивСформированныхОтчетов_pdf = Новый Массив;
		
		Результат = Новый Структура;
		Результат.Вставить("xlsx", МассивСформированныхОтчетов_xlsx);
		Результат.Вставить("pdf" , МассивСформированныхОтчетов_pdf);
		
		Возврат Результат;
	КонецЕсли;
	
	ЭтаФорма.СформированныеОтчеты.Добавить(Новый Структура("ДоговорДУ, ТабличныеДокументы", ТекущийДоговорДУ, ТабличныеДокументы));
	
	Если Отчет.РежимРаботы = 0 Тогда
		ЭтаФорма.ТабличныйДокументРаздел1.Вывести(ТабличныеДокументы.Раздел1);
		ЭтаФорма.ТабличныйДокументРаздел1.ВывестиГоризонтальныйРазделительСтраниц();
		
		ЭтаФорма.ТабличныйДокументРаздел2.Вывести(ТабличныеДокументы.Раздел2);
		ЭтаФорма.ТабличныйДокументРаздел2.ВывестиГоризонтальныйРазделительСтраниц();
		
		ЭтаФорма.ТабличныйДокументРаздел3.Вывести(ТабличныеДокументы.Раздел3);
		ЭтаФорма.ТабличныйДокументРаздел3.ВывестиГоризонтальныйРазделительСтраниц();
		
		ЭтаФорма.ТабличныйДокументРаздел4.Вывести(ТабличныеДокументы.Раздел4);
		ЭтаФорма.ТабличныйДокументРаздел4.ВывестиГоризонтальныйРазделительСтраниц();
		
		ЭтаФорма.ТабличныйДокументРаздел5.Вывести(ТабличныеДокументы.Раздел5);
		ЭтаФорма.ТабличныйДокументРаздел5.ВывестиГоризонтальныйРазделительСтраниц();
		
		ЭтаФорма.ТабличныйДокументРаздел6_1.Вывести(ТабличныеДокументы.Раздел6_1);
		ЭтаФорма.ТабличныйДокументРаздел6_1.ВывестиГоризонтальныйРазделительСтраниц();
		
		ЭтаФорма.ТабличныйДокументРаздел6_2.Вывести(ТабличныеДокументы.Раздел6_2);
		ЭтаФорма.ТабличныйДокументРаздел6_2.ВывестиГоризонтальныйРазделительСтраниц();
		
		ЭтаФорма.ТабличныйДокументРаздел7.Вывести(ТабличныеДокументы.Раздел7);
		ЭтаФорма.ТабличныйДокументРаздел7.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	Если ВернутьМассив Тогда
		МассивОтчетов = ВыгрузитьНаСервере(КакXLS, КакPDF);
		
		ОчиститьТабличныеДокументы();
		
		Возврат МассивОтчетов;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции // ЗаполнитьТабличныеДокументы()

&НаСервере
Процедура СформироватьМассивОтчетов(МассивСформированныхОтчетов, ВидМассива)
	
	Для каждого СтрокаСписка Из ЭтаФорма.СформированныеОтчеты Цикл	
		
		ТабличныеДокументы = СтрокаСписка.Значение.ТабличныеДокументы;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.АвтоМасштаб = Истина;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		ТабличныйДокумент.Вывести(ТабличныеДокументы["Раздел" + ВидМассива +"1"]);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабличныйДокумент.Вывести(ТабличныеДокументы["Раздел" + ВидМассива +"2"]);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабличныйДокумент.Вывести(ТабличныеДокументы["Раздел" + ВидМассива +"3"]);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабличныйДокумент.Вывести(ТабличныеДокументы["Раздел" + ВидМассива +"4"]);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабличныйДокумент.Вывести(ТабличныеДокументы["Раздел" + ВидМассива +"5"]);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабличныйДокумент.Вывести(ТабличныеДокументы["Раздел" + ВидМассива +"6_1"]);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабличныйДокумент.Вывести(ТабличныеДокументы["Раздел" + ВидМассива +"6_2"]);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабличныйДокумент.Вывести(ТабличныеДокументы["Раздел" + ВидМассива +"7"]);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабличныйДокумент.АвтоМасштаб = Истина;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		////TM-3137
		Если ВидМассива <> "pdf" Тогда
			ТабличныйДокумент.ПолеСверху = 20;
		КонецЕсли;
		ТабличныйДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 2;
		ТабличныйДокумент.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		
		//VTBC SadykovNiyaz 01.04.2022 (IMAPPS-16952) {
		Если Отчет.ФлагНовоеНаименованиеУК Тогда
			ТабличныйДокумент.ВерхнийКолонтитул.ТекстСлева 	= Отчет.НаименованиеУК;
		Иначе
			ТабличныйДокумент.ВерхнийКолонтитул.ТекстСлева = СтрокаСписка.Значение.ДоговорДУ.УправляющаяКомпания.Наименование;  
		КонецЕсли;
		//VTBC SadykovNiyaz 01.04.2022 (IMAPPS-16952) }

		ТабличныйДокумент.ВерхнийКолонтитул.ТекстВЦентре = "Отчет о деятельности Управляющего за период с " + Формат(ЭтаФорма.Отчет.ДатаНачала, "ДФ=dd.MM.yyyy") + " по " + Формат(ЭтаФорма.Отчет.ДатаОкончания, "ДФ=dd.MM.yyyy") + Символы.ПС
		+ "Договор № " + СтрокаСписка.Значение.ДоговорДУ.Код + " от " + Формат(СтрокаСписка.Значение.ДоговорДУ.ДатаНачала, "ДФ=dd.MM.yyyy"); 
		ТабличныйДокумент.ВерхнийКолонтитул.ТекстСправа= "Стр. [&НомерСтраницы] (Всего [&СтраницВсего] стр.)";
		ТабличныйДокумент.ВерхнийКолонтитул.Выводить = Истина;
		////TM-3137
		
		СформированныйОтчет = Новый Структура("ДоговорДУ, ТабличныйДокумент");
		СформированныйОтчет.ДоговорДУ = СтрокаСписка.Значение.ДоговорДУ;
		СформированныйОтчет.ТабличныйДокумент = ТабличныйДокумент;
		
		МассивСформированныхОтчетов.Добавить(СформированныйОтчет);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьНаСервере(Знач КакXLS, Знач КакPDF)
	
	МассивСформированныхОтчетов_xlsx = Новый Массив;
	МассивСформированныхОтчетов_pdf = Новый Массив;
	
	Результат = Новый Структура;
	Результат.Вставить("xlsx", МассивСформированныхОтчетов_xlsx);
	Результат.Вставить("pdf" , МассивСформированныхОтчетов_pdf);
	
	Если КакXLS Тогда
		СформироватьМассивОтчетов(МассивСформированныхОтчетов_xlsx, "");
	КонецЕсли;
	
	Если КакPDF Тогда
		СформироватьМассивОтчетов(МассивСформированныхОтчетов_pdf, "pdf");
	КонецЕсли;
	
	Результат.Вставить("xlsx", МассивСформированныхОтчетов_xlsx);
	Результат.Вставить("pdf" , МассивСформированныхОтчетов_pdf);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СохранитьМногостраничныйФайл(Знач ДоговорДУ)
	
	ТипФайла = ТипФайлаТабличногоДокумента.XLSX;
	
	ФайлРаздел2 = ПолучитьИмяВременногоФайла();
	ЭтаФорма.ТабличныйДокументРаздел2.Записать(ФайлРаздел2, ТипФайла);
	
	ФайлРаздел3 = ПолучитьИмяВременногоФайла();
	ЭтаФорма.ТабличныйДокументРаздел3.Записать(ФайлРаздел3, ТипФайла);
	
	ФайлРаздел4 = ПолучитьИмяВременногоФайла();
	ЭтаФорма.ТабличныйДокументРаздел4.Записать(ФайлРаздел4, ТипФайла);
	
	ФайлРаздел5 = ПолучитьИмяВременногоФайла();
	ЭтаФорма.ТабличныйДокументРаздел5.Записать(ФайлРаздел5, ТипФайла);
	
	ФайлРаздел6_1 = ПолучитьИмяВременногоФайла();
	ЭтаФорма.ТабличныйДокументРаздел6_1.Записать(ФайлРаздел6_1, ТипФайла);
	
	ФайлРаздел6_2 = ПолучитьИмяВременногоФайла();
	ЭтаФорма.ТабличныйДокументРаздел6_2.Записать(ФайлРаздел6_2, ТипФайла);
	
	ФайлРаздел7 = ПолучитьИмяВременногоФайла();
	ЭтаФорма.ТабличныйДокументРаздел7.Записать(ФайлРаздел7, ТипФайла);
	
	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(ФайлРаздел2);
	МассивФайлов.Добавить(ФайлРаздел3);
	МассивФайлов.Добавить(ФайлРаздел4);
	МассивФайлов.Добавить(ФайлРаздел5);
	МассивФайлов.Добавить(ФайлРаздел6_1);
	МассивФайлов.Добавить(ФайлРаздел6_2);
	МассивФайлов.Добавить(ФайлРаздел7);

	ИмяФайлаОтчета = СформироватьИмяФайла(ДоговорДУ);
	
	ИмяФайлаОтчета = ИмяФайлаОтчета + ".xlsx";
	ИмяФайлаОтчета = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайлаОтчета);
	
	ПолныйПуть = КаталогВыгрузки + ИмяФайлаОтчета;
	
	Попытка
	
		ЭтаФорма.ТабличныйДокументРаздел1.Записать(ПолныйПуть, ТипФайла);
	    
	Исключение
		
		Сообщить(ОписаниеОшибки());
		
		Для каждого Файл Из МассивФайлов Цикл
		
			УдалитьФайлы(Файл);
		
		КонецЦикла; 
		
		Возврат;
		
	КонецПопытки;
	
	
	Попытка
	
		Excel = Новый COMОбъект("Excel.Application");
		ОбщаяКнига = Excel.WorkBooks.Open(ПолныйПуть);
	
	Исключение
		
		Сообщить(ОписаниеОшибки());
		Excel.Quit();
		Excel = Неопределено;
	              
		Для каждого Файл Из МассивФайлов Цикл
		
			УдалитьФайлы(Файл);
		
		КонецЦикла; 
		
		Возврат;
	
	КонецПопытки; 

	НомерЛиста = 1;
	
	Для каждого Файл Из МассивФайлов Цикл
		
		Книга = Excel.WorkBooks.Open(Файл);
		
		ЛистСДанными = Книга.Sheets(1);
		ЛистСДанными.Select();
		ЛистСДанными.Copy(null, ОбщаяКнига.Sheets(НомерЛиста));
		Книга.Close();
		
		НомерЛиста = НомерЛиста + 1;
		
	КонецЦикла; 
	
	ОбщаяКнига.Sheets(1).Name = "РСА";
	ОбщаяКнига.Sheets(2).Name = "Портфель";
	ОбщаяКнига.Sheets(3).Name = "Сделки";
	ОбщаяКнига.Sheets(4).Name = "Движение ДС";
	ОбщаяКнига.Sheets(5).Name = "Движение ЦБ";
	ОбщаяКнига.Sheets(6).Name = "Расходы ДУ";
	ОбщаяКнига.Sheets(7).Name = "Незавершенные сделки";
	ОбщаяКнига.Sheets(8).Name = "Голосование";
		
	РеквизитыДоговорДУ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ДоговорДУ, "УправляющаяКомпания, Код, ДатаНачала"); //TM-3137
	
	РеквизитыУправляющейКомпании = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(РеквизитыДоговорДУ.УправляющаяКомпания, "Наименование"); //TM-3137
		
	Для НомерЛиста = 1 По 8 Цикл
		
		//TM-3137
		ОбщаяКнига.Sheets(НомерЛиста).PageSetup.DifferentFirstPageHeaderFooter = True;
	    ОбщаяКнига.Sheets(НомерЛиста).PageSetup.LeftHeader   = РеквизитыУправляющейКомпании.Наименование;
		ОбщаяКнига.Sheets(НомерЛиста).PageSetup.CenterHeader = "Отчет о деятельности Управляющего за период с " + Формат(ЭтаФорма.Отчет.ДатаНачала, "ДФ=dd.MM.yyyy") + " по " + Формат(ЭтаФорма.Отчет.ДатаОкончания, "ДФ=dd.MM.yyyy") + Символы.ПС
		                                                       + "Договор № " + РеквизитыДоговорДУ.Код + " от " + Формат(РеквизитыДоговорДУ.ДатаНачала, "ДФ=dd.MM.yyyy");
		ОбщаяКнига.Sheets(НомерЛиста).PageSetup.RightHeader  = "Стр. &С&P (Всего &К&N стр.)";
		//TM-3137
	
		ОбщаяКнига.Sheets(НомерЛиста).PageSetup.FitToPagesWide = 1;
		ОбщаяКнига.Sheets(НомерЛиста).PageSetup.FitToPagesTall = 99;
		ОбщаяКнига.Sheets(НомерЛиста).PageSetup.Orientation = 2;
		ОбщаяКнига.Sheets(НомерЛиста).PageSetup.Zoom = Ложь;
	
	КонецЦикла; 
	
	
    Excel.ActiveWindow.DisplayWorkbookTabs = -1;
    Excel.ActiveWindow.TabRatio = 0.25;
	
	//vtb 12.07.2016
	ОбщаяКнига.Sheets(1).Select();
	
	
	Попытка
	
		ОбщаяКнига.Save();
		Сообщить(НСтр("ru = 'Файл успешно сохранен.'"));
	
	Исключение
		
		Сообщить(ОписаниеОшибки());
	
	КонецПопытки;
	
	ОбщаяКнига.Close();
	Excel.Quit();
	Excel = Неопределено;
              
	Для каждого Файл Из МассивФайлов Цикл
		
		УдалитьФайлы(Файл);
		
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
	
		ЭтаФорма.Отчет.ДатаНачала = Период.ДатаНачала;
		ЭтаФорма.Отчет.ДатаОкончания = Период.ДатаОкончания;
		
		УстановитьСостояниеТабличныхДокументов(Истина, "НеАктуально");
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЕстьСлэш = Прав(ВыбранныеФайлы[0], 1) = "\";
		
		КаталогВыгрузки = ВыбранныеФайлы[0] + ?(ЕстьСлэш, "", "\");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаПоПризнакуЛКЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЕстьСлэш = Прав(ВыбранныеФайлы[0], 1) = "\";
		
		КаталогВыгрузкиПоПризнакуЛК = ВыбранныеФайлы[0] + ?(ЕстьСлэш, "", "\");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеТабличныхДокументов(Видимость, Режим = "НеСформирован")
	
	Если Режим = "НеСформирован" Тогда
		
		Текст = НСтр("ru = 'Отчет не сформирован. Нажмите кнопку ""Сформировать"" для получения отчета.'");
		
	ИначеЕсли Режим = "НеАктуально" Тогда
		
		Текст = НСтр("ru = 'Данные отчета не актуальны. Нажмите кнопку ""Сформировать"" для получения отчета.'");
	
	Иначе
		
		Видимость = Ложь;
		Текст = "";
	
	КонецЕсли; 

	Для Каждого ТабличныйДокумент Из ЭтаФорма.СписокЭлементовТабличныхДокументов Цикл
			
		ЭтаФорма.Элементы[ТабличныйДокумент.Значение].ОтображениеСостояния.Видимость = Видимость;
		ЭтаФорма.Элементы[ТабличныйДокумент.Значение].ОтображениеСостояния.Картинка = БиблиотекаКартинок.Информация32;
		ЭтаФорма.Элементы[ТабличныйДокумент.Значение].ОтображениеСостояния.Текст = Текст;
		
		Если Режим = "НеАктуально" Тогда
			ЭтаФорма.Элементы[ТабличныйДокумент.Значение].ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
		Иначе
			ЭтаФорма.Элементы[ТабличныйДокумент.Значение].ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
		КонецЕсли;
		
	КонецЦикла;
	
	//IMAPPS-30982++
	Если ЭтотОбъект.ДоговорДУ.ТипКлиентаДУ = Перечисления.ТипыКлиентовДУ.ФизическиеЛица Тогда
		Отчет.СкрыватьБалансовуюСтоимость = Истина
	Иначе
		 Отчет.СкрыватьБалансовуюСтоимость = Ложь
	КонецЕсли;
    //IMAPPS-30982--


КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьТабличныхДокументов()
	
	Для Каждого ТабличныйДокумент Из СписокЭлементовТабличныхДокументов Цикл
			
		Элементы[ТабличныйДокумент.Значение].Видимость = Отчет.РежимРаботы = 0;
		
	КонецЦикла;
	
	Элементы.Лог.Видимость = Отчет.РежимРаботы <> 0;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	
	Элементы.Сформировать.Доступность = Отчет.РежимРаботы = 0;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьИмяФайла(Знач ДоговорДУ)

	РеквизитыДоговорДУ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ДоговорДУ, "Префикс, Код, Клиент");
	РеквизитыКлиента = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(РеквизитыДоговорДУ.Клиент, "ЮрФизЛицо, НаименованиеСокращенное, ВнешнийIDДляЛК");
	
	ИмяФайлаОтчета = "";
	
	Если РеквизитыКлиента.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда
		ИмяФайлаОтчета =  "AM" + СтрЗаменить(РеквизитыКлиента.ВнешнийIDДляЛК, Символ(160), "") + "-" + "ДУ " + СокрЛП(РеквизитыДоговорДУ.Префикс) + " (" + СокрЛП(РеквизитыДоговорДУ.Код) + ") - Отчет ДУ " + Формат(ЭтаФорма.Отчет.ДатаОкончания,"ДФ=ddMMyyyy");
	Иначе
		ИмяФайлаОтчета =  "AM" + СтрЗаменить(РеквизитыКлиента.ВнешнийIDДляЛК, Символ(160), "") + "-" + СокрЛП(РеквизитыКлиента.НаименованиеСокращенное) + " (" + СокрЛП(РеквизитыДоговорДУ.Код) + ") - Отчет ДУ " + Формат(ЭтаФорма.Отчет.ДатаОкончания,"ДФ=ddMMyyyy");
	КонецЕсли;
	
	Возврат ИмяФайлаОтчета;

КонецФункции

&НаКлиенте
Процедура ОдиночнаяВыгрузка()
	
	Если ЭтаФорма.СформированныеОтчеты.Количество() = 0 Тогда
		Сообщить(НСтр("ru = 'Отчет не сформирован'"));
		Возврат;
	КонецЕсли; 
	
	МассивСформированныхОтчетов = ВыгрузитьНаСервере(ЭтаФорма.Отчет.ВыгружатьВФорматеExcel, ЭтаФорма.Отчет.ВыгружатьВФорматеPDF);
	МассивСформированныхОтчетов_xlsx = МассивСформированныхОтчетов.xlsx;
	МассивСформированныхОтчетов_pdf  = МассивСформированныхОтчетов.pdf;
	
	//ЭлементМассива = МассивСформированныхОтчетов_pdf[0]; //IMAPPS-21832 ошибка, если не выбрана галка PDF
	
	Если ЭтаФорма.Отчет.ВыгружатьВФорматеExcel Тогда
		СохранитьМногостраничныйФайл(ЭтаФорма.СформированныеОтчеты[0].Значение.ДоговорДУ);
	КонецЕсли; 
	
	Если ЭтаФорма.Отчет.ВыгружатьВФорматеPDF Тогда
		ЭлементМассива = МассивСформированныхОтчетов_pdf[0]; //IMAPPS-21832 перенес сюда
		ИмяФайлаОтчета = СформироватьИмяФайла(ЭлементМассива.ДоговорДУ);
		ИмяФайлаОтчета = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайлаОтчета);
		Попытка
			ЭлементМассива.ТабличныйДокумент.Записать(КаталогВыгрузки + ИмяФайлаОтчета + ".pdf", ТипФайлаТабличногоДокумента.PDF);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура МассоваяВыгрузка()
	ЭтаФорма.ТаблицаЛога.Очистить();
	
	ДоговораДУ = ЭтаФорма.СписокДоговоровДУ.ВыгрузитьЗначения();
	
	// TM-3324 {
	Если ЭтаФорма.Отчет.РазбиватьОтчетыПоПризнакуЛК Тогда
		СвойстваДоговоровДУРазрешенаОтчетностьЧерезЛК = ПолучитьДополнительныеСвойстваНаСервере(ДоговораДУ);
	КонецЕсли;
	// TM-3324 } 
	
	Для каждого ТекущийДоговорДУ Из ДоговораДУ Цикл
		ОчиститьТабличныеДокументы();
		
		// TM-3324 {
		ТекущийКаталогВыгрузки = КаталогВыгрузки;
		
		Если ЭтаФорма.Отчет.РазбиватьОтчетыПоПризнакуЛК И ЗначениеЗаполнено(КаталогВыгрузкиПоПризнакуЛК) Тогда
			
			СвойствоДоговораДУРазрешенаОтчетностьЧерезЛК = СвойстваДоговоровДУРазрешенаОтчетностьЧерезЛК.Получить(ТекущийДоговорДУ);
			
			Если СвойствоДоговораДУРазрешенаОтчетностьЧерезЛК <> Неопределено И СвойствоДоговораДУРазрешенаОтчетностьЧерезЛК = Истина Тогда
				ТекущийКаталогВыгрузки = КаталогВыгрузкиПоПризнакуЛК;
			КонецЕсли;
			
		КонецЕсли;
		// TM-3324 }
		
		НоваяСтрокаЛога = ЭтаФорма.ТаблицаЛога.Добавить();
		НоваяСтрокаЛога.Портфель = Строка(ТекущийДоговорДУ);
		
		МассивСформированныхОтчетов = ЗаполнитьТабличныеДокументы(
			ТекущийДоговорДУ,
			Истина,
			ЭтаФорма.Отчет.ВыгружатьВФорматеExcel,
			ЭтаФорма.Отчет.ВыгружатьВФорматеPDF
		);
		
		Если (ЭтаФорма.Отчет.ВыгружатьВФорматеExcel И МассивСформированныхОтчетов.xlsx.Количество() = 0) 
			ИЛИ (ЭтаФорма.Отчет.ВыгружатьВФорматеPDF И МассивСформированныхОтчетов.pdf.Количество() = 0) Тогда
			
			НоваяСтрокаЛога.Статус = "Не выгружен";
			НоваяСтрокаЛога.Комментарий =  "Дата ввода средств в ДУ > Даты окончания периода";
			
			Продолжить;
		КонецЕсли; 
		
		Если ЭтаФорма.Отчет.ВыгружатьВФорматеExcel Тогда
			МассивСформированныхОтчетов_xlsx = МассивСформированныхОтчетов.xlsx;
			
			Для каждого ЭлементМассива Из МассивСформированныхОтчетов_xlsx Цикл
				ИмяФайлаОтчета = СформироватьИмяФайла(ЭлементМассива.ДоговорДУ);
				ИмяФайлаОтчета = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайлаОтчета);
				
				Попытка
					ЭлементМассива.ТабличныйДокумент.Записать(ТекущийКаталогВыгрузки + ИмяФайлаОтчета + ".xlsx", ТипФайлаТабличногоДокумента.XLSX); // TM-3324 {}
				Исключение
					НоваяСтрокаЛога.Статус = "Не выгружен";
					НоваяСтрокаЛога.Комментарий = ОписаниеОшибки();
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		
		Если ЭтаФорма.Отчет.ВыгружатьВФорматеPDF Тогда
			МассивСформированныхОтчетов_pdf  = МассивСформированныхОтчетов.pdf;
			
			Для каждого ЭлементМассива Из МассивСформированныхОтчетов_pdf Цикл
				ИмяФайлаОтчета = СформироватьИмяФайла(ЭлементМассива.ДоговорДУ);
				ИмяФайлаОтчета = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайлаОтчета);
				
				Попытка
					ЭлементМассива.ТабличныйДокумент.Записать(ТекущийКаталогВыгрузки + ИмяФайлаОтчета + ".pdf", ТипФайлаТабличногоДокумента.PDF); // TM-3324 {}
				Исключение
					НоваяСтрокаЛога.Статус = "Не выгружен";
					НоваяСтрокаЛога.Комментарий = ОписаниеОшибки();
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		
		НоваяСтрокаЛога.Статус = "Выгружен";
	КонецЦикла;
	
	ВывестиЛог();
КонецПроцедуры // МассоваяВыгрузка()

&НаСервере
Процедура ВывестиЛог()
	ЭтаФорма.ТабличныйДокументЛог.Вывести(РеквизитФормыВЗначение("Отчет").ЗаполнитьЛог());
КонецПроцедуры // ВывестиЛог()

// TM-3324 {

&НаСервереБезКонтекста
Функция ПолучитьДополнительныеСвойства(ДоговораДУ)
	
	СвойстваДоговоровДУРазрешенаОтчетностьЧерезЛК = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Объект,
		|	ДополнительныеСведения.Значение
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект В(&ДоговораДУ)
		|	И ДополнительныеСведения.Свойство.Наименование ПОДОБНО ""Разрешена отчетность через ЛК""";
	
	Запрос.УстановитьПараметр("ДоговораДУ", ДоговораДУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СвойстваДоговоровДУРазрешенаОтчетностьЧерезЛК.Вставить(ВыборкаДетальныеЗаписи.Объект, ВыборкаДетальныеЗаписи.Значение);
		
	КонецЦикла;
	
	Возврат СвойстваДоговоровДУРазрешенаОтчетностьЧерезЛК;
	
КонецФункции
//VTBC SadykovNiyaz 01.04.2022 (IMAPPS-16952) }

//IMAPPS-23458 
&НаСервере
Функция ПолучитьПодписанта(Подписант)
	
	Возврат Справочники.КонтактныеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(Подписант));
	
КонецФункции	

&НаКлиенте
Процедура НастроитьДоступностьЗагружатьДанные()
	
	Если Отчет.ЗагружатьДанныеЕПС = Истина Тогда 
		Элементы.ЗагружатьДанныеРСБУ.Доступность = Ложь;
		Отчет.ЗагружатьДанныеРСБУ = Ложь;
	ИначеЕсли   Отчет.ЗагружатьДанныеРСБУ = Истина Тогда 
		Элементы.ЗагружатьДанныеЕПС.Доступность = Ложь;
		Отчет.ЗагружатьДанныеЕПС = Ложь;
	Иначе 
		Элементы.ЗагружатьДанныеРСБУ.Доступность = Истина;
		Элементы.ЗагружатьДанныеЕПС.Доступность = Истина;  
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимостьЭлементовНаФорме()
	
	Элементы.ДоговорДУ.Видимость = Отчет.РежимРаботы = 0;
	Элементы.СписокДоговоровДУ.Видимость = Отчет.РежимРаботы <> 0;
	
	Элементы.ПараметрыCom.Видимость = Отчет.РежимРаботы = 2;
	Элементы.КоличествоПотоков.Видимость = Отчет.РежимРаботы = 2;
	
	Отчет.ОтоброжатьФИО = Отчет.РежимРаботы = 0;
	
	Если Отчет.РежимРаботы <> 0 И ЗначениеЗаполнено(ДоговорДУ) Тогда
		СписокДоговоровДУ.Очистить();
		СписокДоговоровДУ.Добавить(ДоговорДУ);
	КонецЕсли;
	
	Если Отчет.РежимРаботы = 2 Тогда
		Элементы.КаталогВыгрузки.Видимость = Ложь;
		Элементы.КаталогВыгрузкиНаСервере.Видимость = Истина;
		Элементы.КаталогВыгрузкиНаСервереКопия.Видимость = Истина;
		Элементы.КаталогВыгрузкиПоПризнакуЛКНаСервере.Видимость = Отчет.РазбиватьОтчетыПоПризнакуЛК;
		Элементы.КаталогВыгрузкиПоПризнакуЛК.Видимость = Ложь;
	Иначе
		Элементы.КаталогВыгрузки.Видимость = Истина;
		Элементы.КаталогВыгрузкиНаСервере.Видимость = Ложь;
		Элементы.КаталогВыгрузкиНаСервереКопия.Видимость = Ложь;
		Элементы.КаталогВыгрузкиПоПризнакуЛК.Видимость = Отчет.РазбиватьОтчетыПоПризнакуЛК;
		Элементы.КаталогВыгрузкиПоПризнакуЛКНаСервере.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаНаСервереЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЕстьСлэш = Прав(ВыбранныеФайлы[0], 1) = "\";
		
		Отчет.КаталогВыгрузкиНаСервере = ВыбранныеФайлы[0] + ?(ЕстьСлэш, "", "\");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаНаСервереКопияЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЕстьСлэш = Прав(ВыбранныеФайлы[0], 1) = "\";
		
		Отчет.КаталогВыгрузкиНаСервереКопия = ВыбранныеФайлы[0] + ?(ЕстьСлэш, "", "\");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаПоПризнакуЛКНаСервереЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЕстьСлэш = Прав(ВыбранныеФайлы[0], 1) = "\";
		
		Отчет.КаталогВыгрузкиПоПризнакуЛКНаСервере = ВыбранныеФайлы[0] + ?(ЕстьСлэш, "", "\");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиФоновыйЛогЛог()
	ЭтаФорма.ТабличныйДокументЛог.Вывести(РеквизитФормыВЗначение("Отчет").ЗаполнитьФоновыйЛог());
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокДоговоровКлиентамиРозничногоДУ(СписокДоговоровКлиентовРозничногоДУ, ИсключатьСЗаполненойДатойОкончания)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорДУ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорДУ КАК ДоговорДУ
		|ГДЕ
		|	НЕ ДоговорДУ.ПометкаУдаления
		|	И ДоговорДУ.Пул.Наименование = ""Розничное ДУ""
		|	И ВЫБОР
		|			КОГДА &ИсключатьСЗаполненойДатойОкончания
		|				ТОГДА ДоговорДУ.ДатаОкончания = &ПустаяДата
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДоговорДУ.Наименование";
	
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	Запрос.УстановитьПараметр("ИсключатьСЗаполненойДатойОкончания", ИсключатьСЗаполненойДатойОкончания);
	
	СписокДоговоровКлиентовРозничногоДУ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДополнительныеСвойстваНаСервере(ДоговораДУ)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Возврат ОтчетОбъект.ПолучитьДополнительныеСвойства(ДоговораДУ);
	
КонецФункции

&НаКлиенте
Процедура МассоваяВыгрузкаПоКлиентамРозничногоДУ()
	
	ВремяНачала = ТекущаяДатаСеансаНаСервере();
	
	Отчет.ТаблицаЛога.Очистить();
	Отчет.ТекстовыйЛог = "";
	
	ЗарегистрироватьСостояниеВыгрузкиОтчетовДУНаСервере();
	
	КолПотоков = ПолучитьКоличествоПотоковПриРаспределении(ПолучитьКоличествоНеВыгруженныеОтчетыДУНаСервере());
	
	МассивУникальныхИдентификаторов = Новый Массив;
	Для Счетчик = 1 По КолПотоков Цикл
		МассивУникальныхИдентификаторов.Добавить(Новый УникальныйИдентификатор);
	КонецЦикла;
	
	МассоваяВыгрузкаПоКлиентамРозничногоДУНаСервере(МассивУникальныхИдентификаторов);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыгрузкаПоКлиентамРозничногоДУОкончание", ЭтаФорма);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ТекстСообщения =НСтр("ru = 'Выполняется выгрузка отчетов по клиентам розничного ДУ.'");
	ПараметрыОжидания.Вставить("ВремяНачала", ВремяНачала);
	
	ОжидатьЗавершение(МассивУникальныхИдентификаторов, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКоличествоПотоковПриРаспределении(КоличествоОтчетов)
	
	КолПотоков = Мин(КоличествоОтчетов, Отчет.КоличествоПотоков);
	
	КоличествоОтчетовВФоновом = Окр(КоличествоОтчетов / КолПотоков);
	
	НачальнаяСтрока = 0;
	
	ОстатокОтчетов = КоличествоОтчетов;
	
	КонечнаяСтрока = Мин(КоличествоОтчетовВФоновом - 1, КоличествоОтчетов - 1);
	
	КоличествоФоновых = 0;
	
	Пока ОстатокОтчетов > 0 цикл
		
		КоличествоФоновых = КоличествоФоновых + 1;
		
		ВыбраноОтчетов = КонечнаяСтрока - НачальнаяСтрока + 1;
		
		ОстатокОтчетов = ОстатокОтчетов - ВыбраноОтчетов;
		
		НачальнаяСтрока = КонечнаяСтрока + 1;
		
		КонечнаяСтрока = Мин(КонечнаяСтрока + КоличествоОтчетовВФоновом, КоличествоОтчетов - 1);
		
	КонецЦикла;
	
	Возврат КоличествоФоновых;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузкаПоКлиентамРозничногоДУОкончание(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;
	
	ВсеСообщения = ПолучитьСообщенияПользователюНаСервере();
	
	Для каждого ТекСообщение Из ВсеСообщения Цикл
		ДобавитьТекстСообщения(Отчет.ТекстовыйЛог, ТекСообщение.Текст);
	КонецЦикла;
	
	Сообщить("Выгрузка файлов отчета завершена " + ТекущаяДатаСеансаНаСервере());
	
	ВывестиФоновыйЛогЛог();
	
КонецПроцедуры

// Ожидать завершения выполнения процедуры в фоновом задании и открыть форму ожидания длительной операции.
// Применяется совместно с функцией ДлительныеОперации.ВыполнитьВФоне для повышения отзывчивости пользовательского 
// интерфейса, заменяя длительный серверный вызов на запуск фонового задания.
// 
// Параметры:
//  ДлительнаяОперация     - Структура - см. возвращаемое значение функции ДлительныеОперации.ВыполнитьВФоне.
//  ОповещениеОЗавершении  - ОписаниеОповещения - оповещение, которое вызывается при завершении фонового задания. 
//                           Параметры процедуры-обработчика оповещения: 
//   * Результат - Структура, Неопределено - структура со свойствами или Неопределено, если задание было отменено. Свойства: 
//	   ** Статус           - Строка - "Выполнено", если задание было успешно выполнено;
//	                                  "Ошибка", если задание завершено с ошибкой.
//	   ** АдресРезультата  - Строка - адрес временного хранилища, в которое будет
//	                                  помещен (или уже помещен) результат работы процедуры.
//	   ** АдресДополнительногоРезультата - Строка - если установлен параметр ДополнительныйРезультат, 
//	                                     содержит адрес дополнительного временного хранилища,
//	                                     в которое будет помещен (или уже помещен) результат работы процедуры.
//	   ** КраткоеПредставлениеОшибки   - Строка - краткая информация об исключении, если Статус = "Ошибка".
//	   ** ПодробноеПредставлениеОшибки - Строка - подробная информация об исключении, если Статус = "Ошибка".
//	   ** Сообщения        - ФиксированныйМассив, Неопределено - массив объектов СообщениеПользователю, 
//                                                сформированных в процедуре-обработчике длительной операции.
//   * ДополнительныеПараметры - Произвольный - произвольные данные, переданные в описании оповещения. 
//  ПараметрыОжидания      - Структура - см. ДлительныеОперацииКлиент.ПараметрыОжидания.
//
&НаКлиенте
Процедура ОжидатьЗавершение(Знач МассивУникальныхИдентификаторов, Знач ОповещениеОЗавершении = Неопределено, 
	Знач ПараметрыОжидания = Неопределено)
	
	ПараметрыФормы = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
	Если ПараметрыОжидания <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормы, ПараметрыОжидания);
	КонецЕсли;
	ПараметрыФормы.Вставить("МассивУникальныхИдентификаторов", МассивУникальныхИдентификаторов);
	ПараметрыФормы.Вставить("ВремяНачала", ПараметрыОжидания.ВремяНачала);
	
	Если ПараметрыФормы.ВыводитьОкноОжидания Тогда
		ПараметрыФормы.Удалить("ФормаВладелец");
		
		ОткрытьФорму("ВнешнийОтчет.внОтчетУправляющегоДУсогласно482П_v15.Форма.ДлительнаяОперация", ПараметрыФормы, 
			?(ПараметрыОжидания <> Неопределено, ПараметрыОжидания.ФормаВладелец, Неопределено),
			,,,ОповещениеОЗавершении);
	Иначе
		ПараметрыФормы.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
		ПараметрыФормы.Вставить("ТекущийИнтервал", ?(ПараметрыФормы.Интервал <> 0, ПараметрыФормы.Интервал, 1));
		ПараметрыФормы.Вставить("Контроль", ТекущаяДата() + ПараметрыФормы.ТекущийИнтервал); // дата сеанса не используется
		
		Операции = ДлительныеОперацииКлиент.АктивныеДлительныеОперации();
		Операции.Список.Вставить(ПараметрыФормы.ИдентификаторЗадания, ПараметрыФормы);

		ПодключитьОбработчикОжидания("КонтрольДлительныхОпераций", ПараметрыФормы.ТекущийИнтервал, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПараметрыОжидатьЗавершение(Знач ДлительнаяОперация, Знач ОповещениеОЗавершении, Знач ПараметрыОжидания)
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("ДлительныеОперацииКлиент.ОжидатьЗавершение",
		"ДлительнаяОперация", ДлительнаяОперация, Тип("Структура"));
	
	Если ОповещениеОЗавершении <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("ДлительныеОперацииКлиент.ОжидатьЗавершение",
			"ОповещениеОЗавершении", ОповещениеОЗавершении, Тип("ОписаниеОповещения"));
	КонецЕсли;
	
	Если ПараметрыОжидания <> Неопределено Тогда
		
		ТипыСвойств = Новый Структура;
		Если ПараметрыОжидания.ФормаВладелец <> Неопределено Тогда
			ТипыСвойств.Вставить("ФормаВладелец", Тип("УправляемаяФорма"));
		КонецЕсли;
		ТипыСвойств.Вставить("ТекстСообщения", Тип("Строка"));
		ТипыСвойств.Вставить("ВыводитьОкноОжидания", Тип("Булево"));
		ТипыСвойств.Вставить("ВыводитьПрогрессВыполнения", Тип("Булево"));
		ТипыСвойств.Вставить("ВыводитьСообщения", Тип("Булево"));
		ТипыСвойств.Вставить("Интервал", Тип("Число"));
		ТипыСвойств.Вставить("ОповещениеПользователя", Тип("Структура"));
		ТипыСвойств.Вставить("ПолучатьРезультат", Тип("Булево"));
		
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("ДлительныеОперацииКлиент.ОжидатьЗавершение",
			"ПараметрыОжидания", ПараметрыОжидания, Тип("Структура"), ТипыСвойств);
		ОбщегоНазначенияКлиентСервер.Проверить(ПараметрыОжидания.Интервал = 0 Или ПараметрыОжидания.Интервал >= 1, 
			НСтр("ru = 'Параметр ПараметрыОжидания.Интервал должен быть больше или равен 1'"),
			"ДлительныеОперацииКлиент.ОжидатьЗавершение");
		ОбщегоНазначенияКлиентСервер.Проверить(Не (ПараметрыОжидания.ОповещениеОПрогрессеВыполнения <> Неопределено И ПараметрыОжидания.ВыводитьОкноОжидания), 
			НСтр("ru = 'Если параметр ПараметрыОжидания.ВыводитьОкноОжидания установлен в Истина, то параметр ПараметрыОжидания.ОповещениеОПрогрессеВыполнения не поддерживается'"),
			"ДлительныеОперацииКлиент.ОжидатьЗавершение");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекущаяДатаСеансаНаСервере()
	
	Возврат Формат(ТекущаяДатаСеанса(), "ДЛФ=T");
	
КонецФункции

&НаСервере
Процедура ЗарегистрироватьСостояниеВыгрузкиОтчетовДУНаСервере()
	
	ТабличныйДокументЛог.Очистить();
	
	ЗаполнитьСписокДоговоровКлиентамиРозничногоДУ(СписокДоговоровДУ, Отчет.ИсключатьСЗаполненойДатойОкончания);
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ЗарегистрироватьСостояниеВыгрузкиОтчетовДУ(СписокДоговоровДУ.ВыгрузитьЗначения(), "ЗаПериод");
	
КонецПроцедуры

&НаСервере
Процедура МассоваяВыгрузкаПоКлиентамРозничногоДУНаСервере(МассивУникальныхИдентификаторов)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	//Подключаемся к базе под svc учеткой
	СтруктураПодключения = Справочники.ВнешниеИнформационныеБазы.УстановитьВнешнееСоединение(ПараметрыCom);
	
	Если СтруктураПодключения.Соединение = Неопределено Тогда
		Сообщить(СтруктураПодключения.ПодробноеОписаниеОшибки);
	Иначе
		ВнешнееСоединение = СтруктураПодключения.Соединение;
		
		//ссылка на доп. обработку, подключенную к базе. В данном примере ищем по наименованию, указанному в Сведениях о внешней обработке
		ДополнительнаяОбработкаСсылка = ВнешнееСоединение.Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ОтчетОбъект.СведенияОВнешнейОбработке().Наименование, Истина);
		
		ПараметрыОтчета = ВнешнееСоединение.NewObject("Структура");
		ПараметрыОтчета.Вставить("ДатаНачала", ОтчетОбъект.ДатаНачала);
		ПараметрыОтчета.Вставить("ДатаОкончания", ОтчетОбъект.ДатаОкончания);
		ПараметрыОтчета.Вставить("ОтоброжатьФИО", ОтчетОбъект.ОтоброжатьФИО);
		ПараметрыОтчета.Вставить("НеФормироватьПечать", ОтчетОбъект.НеФормироватьПечать);
		ПараметрыОтчета.Вставить("ЗагружатьДанныеЕПС", ОтчетОбъект.ЗагружатьДанныеЕПС);
		//ПараметрыОтчета.Вставить("ВнешняяИБ", Справочники.ВнешниеИнформационныеБазы.НайтиПоНаименованию(ОтчетОбъект.ВнешняяИБ.Наименование, Истина));
		ПараметрыОтчета.Вставить("НаименованиеУК", ОтчетОбъект.НаименованиеУК);
		ПараметрыОтчета.Вставить("ФлагНовоеНаименованиеУК", ОтчетОбъект.ФлагНовоеНаименованиеУК);
		ПараметрыОтчета.Вставить("ДатаФормированияРучная", ОтчетОбъект.ДатаФормированияРучная);
		//ПараметрыОтчета.Вставить("Подписант", Справочники.КонтактныеЛица.НайтиПоНаименованию(ОтчетОбъект.Подписант.Наименование, Истина));
		ПараметрыОтчета.Вставить("ПоставкаПротивПлатежа", ОтчетОбъект.ПоставкаПротивПлатежа);
		ПараметрыОтчета.Вставить("СкрыватьБалансовуюСтоимость", ОтчетОбъект.СкрыватьБалансовуюСтоимость);
		ПараметрыОтчета.Вставить("КаталогВыгрузкиНаСервере", ОтчетОбъект.КаталогВыгрузкиНаСервере);
		ПараметрыОтчета.Вставить("КаталогВыгрузкиНаСервереКопия", ОтчетОбъект.КаталогВыгрузкиНаСервереКопия);
		ПараметрыОтчета.Вставить("ВыгружатьВФорматеExcel", ОтчетОбъект.ВыгружатьВФорматеExcel);
		ПараметрыОтчета.Вставить("ВыгружатьВФорматеPDF", ОтчетОбъект.ВыгружатьВФорматеPDF);
		ПараметрыОтчета.Вставить("РазбиватьОтчетыПоПризнакуЛК", ОтчетОбъект.РазбиватьОтчетыПоПризнакуЛК);
		ПараметрыОтчета.Вставить("КаталогВыгрузкиПоПризнакуЛКНаСервере", ОтчетОбъект.КаталогВыгрузкиПоПризнакуЛКНаСервере);
		ПараметрыОтчета.Вставить("КоличествоПотоков", ОтчетОбъект.КоличествоПотоков);
		
		МассивСтрокУникальныхИдентификаторов = ВнешнееСоединение.NewObject("Массив");
		
		Для каждого ТекИдентификатор Из МассивУникальныхИдентификаторов Цикл
			МассивСтрокУникальныхИдентификаторов.Добавить(Строка(ТекИдентификатор));
		КонецЦикла;
		
		НовыйУникальныйИдентификатор = ВнешнееСоединение.NewObject("УникальныйИдентификатор");
		
		КлючОсновногоЗадания = Новый УникальныйИдентификатор(ВнешнееСоединение.String(НовыйУникальныйИдентификатор));
		
		НаименованиеЗадания = НСтр("ru = 'Инициализация запуска Выгрузки отчетов по клиентам розничного ДУ'");;
		
		//запуск фоновой процедуры происходит через метод "ВыполнитьПроцедуруМодуляОбъектаОбработки", куда мы передаем данные об обработке и о процедуре, которую необходимо запустить
		ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
		
		ПараметрыЗадания = ВнешнееСоединение.NewObject("Структура");
		//имя внешней обработки
		ПараметрыЗадания.Вставить("ИмяОбработки", "ВнешнийОтчет.внОтчетУправляющегоДУсогласно482П_v15");
		//имя экспортной серверной процедуры обработки
		ПараметрыЗадания.Вставить("ИмяМетода", "МассоваяВыгрузкаПоКлиентамРозничногоДУВФоне");
		//входящие параметры процедуры
		СтруктураПараметров = ВнешнееСоединение.NewObject("Структура");
		СтруктураПараметров.Вставить("МассивСтрокУникальныхИдентификаторов", МассивСтрокУникальныхИдентификаторов);
		СтруктураПараметров.Вставить("ПараметрыОтчета", ПараметрыОтчета);
		
		ПараметрыЗадания.Вставить("ПараметрыВыполнения", СтруктураПараметров);
		//признак внешней обработки
		ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка", Истина);
		//ссылка на доп. обработку в базе
		ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка", ДополнительнаяОбработкаСсылка);
		
		//получаем пустую структуру параметров выполнения фонового задания и заполняем ее необходимыми данными
		ПараметрыВыполнения = ВнешнееСоединение.ДлительныеОперации.ПараметрыВыполненияВФоне(НовыйУникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
		ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		ПараметрыВыполнения.ОжидатьЗавершение = 0;
		ПараметрыВыполнения.ИдентификаторФормы = НовыйУникальныйИдентификатор;
		ПараметрыВыполнения.КлючФоновогоЗадания = НовыйУникальныйИдентификатор;
		
		//запускаем выполнение фонового задания
		Попытка
			ВнешнееСоединение.ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);
		Исключение
			Инфо = ИнформацияОбОшибке();
			Сообщить(Инфо);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоНеВыгруженныеОтчетыДУНаСервере()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Возврат ОтчетОбъект.ПолучитьНеВыгруженныеОтчетыДУ().Количество();
	
КонецФункции

&НаСервере
Функция ПолучитьСообщенияПользователюНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураПоиска = Новый Структура("Ключ", КлючОсновногоЗадания);
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураПоиска);
	НайденноеЗадание = МассивФоновыхЗаданий[0];
	ИдентификаторЗадания = НайденноеЗадание.УникальныйИдентификатор;
	
	ОсновноеФоновоеВыполнено = Ложь;
	
	Пока ОсновноеФоновоеВыполнено = Ложь Цикл
		Задание = ДлительныеОперации.ОперацияВыполнена(ИдентификаторЗадания);
		
		Если Задание.Статус = "Выполнено" Тогда
			ОсновноеФоновоеВыполнено = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ВсеСообщения = ДлительныеОперации.СообщенияПользователю(Ложь, ИдентификаторЗадания);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ВсеСообщения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьТекстСообщения(ТекстСообщения, ДобавляемыйТекст)
	
	ТекстСообщения = ?(ЗначениеЗаполнено(ТекстСообщения), ТекстСообщения + Символы.ПС + ДобавляемыйТекст, ДобавляемыйТекст);
	
КонецПроцедуры

#КонецОбласти