#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ПараметрыРегламентногоЗадания = МетрикиСервер.СтруктураПараметровРегламентногоЗадания(
		Объект.ИдентификаторРегламента);
	ЗначенияПоУмолчанию();
	 	 					
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьГрупп();
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.Алгоритм = 	"
		|//В результате работы алгоритма должна получиться таблица значений с именем ""ТаблицаЗначений""
		|//Обязательным является наличие колонки ""value""
		|//В случае необходимости можно добавить дополнительные колонки, выполняющие фунции разделителей метрик
		|//Имена колонок должны состоять только из латинских символов
		|//Тип содержимого колонки ""value"" - ""Число""
		|//Тип содержимого остальных колонок - ""Строка""
		|
		|//Пример:		|
		|ТаблицаЗначений = Новый ТаблицаЗначений;
		|ТаблицаЗначений.Колонки.Добавить(""label"", Новый ОписаниеТипов(""Строка""));
		|ТаблицаЗначений.Колонки.Добавить(""value"", Новый ОписаниеТипов(""Число""));
		|
		|ГСЧ = Новый ГенераторСлучайныхЧисел();
		|
		|НоваяСтрока = ТаблицаЗначений.добавить();
		|НоваяСтрока.label = ""Показатель_1"";
		|НоваяСтрока.value = 	ГСЧ.СлучайноеЧисло(0,100);
		|
		|НоваяСтрока = ТаблицаЗначений.добавить();
		|НоваяСтрока.label = ""Показатель_2"";
		|НоваяСтрока.value = ГСЧ.СлучайноеЧисло(0,50);";
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбновитьСостояниеФормы", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	Если ПараметрыРегламентногоЗадания.Предопределенное Тогда
		
		Задание = Метаданные.РегламентныеЗадания.РасчетМетрикPrometheus;
		ПараметрыРегламентногоЗадания.Наименование = Задание.Наименование;
		ПараметрыРегламентногоЗадания.Ключ = Задание.Ключ;	
		ПараметрыРегламентногоЗадания.Параметры = Неопределено;
		МетрикиСервер.УдалениеПерсональногоЗадания(ПараметрыРегламентногоЗадания);
		
	Иначе
		
		Задание = Метаданные.РегламентныеЗадания.РасчетМетрикPrometheus;
		НаименованиеРегламента = СтрЗаменить(Задание.Наименование, "(Общий регламент)", "(Метрика: " + ТекущийОбъект.Код + ")");
		КлючРегламента = Задание.Ключ + " " + ТекущийОбъект.Код;
			
		ПараметрыРегламентногоЗадания.Наименование = НаименованиеРегламента;
		ПараметрыРегламентногоЗадания.Ключ = КлючРегламента;
		
		ПараметрыРегламента = Новый Массив;
		ПараметрыРегламента.Добавить(ТекущийОбъект.Код);
		ПараметрыРегламентногоЗадания.Параметры = ПараметрыРегламента;
		
		ПараметрыРегламентногоЗадания.Использование = ТекущийОбъект.Активность;
		МетрикиСервер.ОбновитьРегламентноеЗадание(ПараметрыРегламентногоЗадания, Задание);
		
	КонецЕсли;
		      		
	
	ТекущийОбъект.ИдентификаторРегламента = ПараметрыРегламентногоЗадания.УникальныйИдентификатор;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МетрикиСервер.ОбработкаПроверкиЗаполненияНаСервере(Объект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура АктивностьПриИзменении(Элемент)
	
	ИзменитьОформлениеПоАктивности();
	ПодключитьОбработчикОжидания("ОбновитьСостояниеФормы", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипВычисленияМетрикиПриИзменении(Элемент)
	ВидимостьГрупп();
КонецПроцедуры

&НаКлиенте
Процедура МетодПолученияМетрикиПриИзменении(Элемент)
	
	ПерсональноеРасписание = Ложь;
	ПараметрыРегламентногоЗадания.Предопределенное = НЕ ПерсональноеРасписание;
	ПодключитьОбработчикОжидания("ОбновитьСостояниеФормы", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерсональноеРасписаниеПриИзменении(Элемент)
	
	ПараметрыРегламентногоЗадания.Предопределенное = НЕ ПерсональноеРасписание;
	Если ПерсональноеРасписание Тогда
		ПараметрыРегламентногоЗадания.Использование = Истина;
	КонецЕсли;
	ПодключитьОбработчикОжидания("ОбновитьСостояниеФормы", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеМетодаДоставкиМетрикиНажатие(Элемент)
	
	Если ПараметрыРегламентногоЗадания.Предопределенное Тогда
		ОткрытьФорму("ОбщаяФорма.НастройкиМетрик");	
	Иначе
		МетрикиКлиент.ОбработатьИзменениеРасписания(ПараметрыРегламентногоЗадания, ЭтотОбъект);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаСервере
Процедура ВыполнитьПроверкуАлгоритмаРасчетаНаСервере()
	
	РезультатРаботы = "";
	ПараметрыМетрики = МетрикиСервер.НовыеПараметрыМетрики();
	ПараметрыМетрики.Алгоритм = Объект.Алгоритм;
	ПараметрыМетрики.КлючеваяОперация = Объект.КлючеваяОперация;
	ПараметрыМетрики.ТипВычисленияМетрики = Объект.ТипВычисленияМетрики;
	Массив = Объект.ПериодыВычисления.Выгрузить().ВыгрузитьКолонку("ПериодВычисления");
	ПараметрыМетрики.ПериодыВычисления = Массив;
	
	Данные = МетрикиСервер.ДанныеМетрики(ПараметрыМетрики);
	Если Данные.Ошибка Тогда
		
		РезультатРаботы = РезультатРаботы + "Ошибка на этапе расчета.
		|Описание ошибки:" + Символы.ПС + Данные.ОписаниеОшибки;
		Возврат;
		
	КонецЕсли;
	           		
	Данные = МетрикиСервер.ПривестиТаблицуРасчетаМетрикиКСтрокеPrometheus(
		Объект.Код, Объект.ТипМетрики, Объект.Комментарий, Данные.МетрикаТаблицей);
	
	Если Данные.Ошибка Тогда
		
		РезультатРаботы = РезультатРаботы + "Ошибкой на этапе преобразования.
		||Итоговая метрика:" + Символы.ПС + Данные.МетрикаСтрокой + " 
		|Описание ошибки:" + Символы.ПС + Данные.ОписаниеОшибки;
		
		Возврат;

	КонецЕсли; 
	
	РезультатРаботы = Данные.МетрикаСтрокой;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуАлгоритма(Команда)
	
	Если Модифицированность ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, "Перед выполнением проверки объект необходимо записать!");
		Возврат;
	КонецЕсли; 
	ВыполнитьПроверкуАлгоритмаРасчетаНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбновитьСостояниеФормы() Экспорт
	
	КартинкаСостояниеМетодаДоставки = БиблиотекаКартинок.PullRed;
	ПерсональноеРасписание = НЕ ПараметрыРегламентногоЗадания.Предопределенное;
	ПредставлениеБезРасписания = НСтр("ru = 'Расписание определяется настройками Prometheus'");
	ЕстьСсылкаНаРасписание = Ложь;
	
	Если Объект.МетодПолученияМетрики = ПредопределенноеЗначение("Перечисление.МетодыПолученияМетрик.Pull") Тогда
		
		КартинкаСостояниеМетодаДоставки = ?(Объект.Активность, БиблиотекаКартинок.PullGreen, БиблиотекаКартинок.PullRed);
		ДоступенВыборПерсональногоРасписания = Ложь;
		ПредставлениеРасписания = ПредставлениеБезРасписания;
		
	ИначеЕсли Объект.МетодПолученияМетрики = ПредопределенноеЗначение("Перечисление.МетодыПолученияМетрик.PullИзКэша") Тогда
		
		КартинкаСостояниеМетодаДоставки = ?(Объект.Активность, БиблиотекаКартинок.PullGreen, БиблиотекаКартинок.PullRed);
		Если ПерсональноеРасписание Тогда
			ПредставлениеРасписания = МетрикиКлиент.ПолучитьПредставлениеРасписания(ПараметрыРегламентногоЗадания);
		Иначе
			ПредставлениеРасписания = НСтр("ru = 'Расписание определяется общими настройками'");
		КонецЕсли;
		ДоступенВыборПерсональногоРасписания = Истина;
		ЕстьСсылкаНаРасписание = Истина;
		
	Иначе
		
		ВызватьИсключение "Неизвестный метод получения метрики";
		
	КонецЕсли;
	
	Элементы.ОписаниеМетодаДоставкиМетрики.Заголовок = ПредставлениеРасписания;
	Элементы.ПерсональноеРасписание.Доступность = ДоступенВыборПерсональногоРасписания;
	Элементы.СостояниеМетодаДоставки.Картинка = КартинкаСостояниеМетодаДоставки;
	Элементы.ОписаниеМетодаДоставкиМетрики.Гиперссылка = ЕстьСсылкаНаРасписание;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВидимостьГрупп()

	Если Объект.ТипВычисленияМетрики = ПредопределенноеЗначение("Перечисление.ТипыВычисленияМетрик.Алгоритм") Тогда
		Элементы.ГруппаАлгоритм.Доступность                        = Истина;
		Элементы.ГруппаКлючеваяОперацияСредниеЗаПериод.Доступность = Ложь;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаАлгоритм;
	ИначеЕсли Объект.ТипВычисленияМетрики = ПредопределенноеЗначение("Перечисление.ТипыВычисленияМетрик.КлючеваяОперацияСредниеЗаПериод") Тогда
		Элементы.ГруппаАлгоритм.Доступность                        = Ложь;
		Элементы.ГруппаКлючеваяОперацияСредниеЗаПериод.Доступность = Истина;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаКлючеваяОперацияСредниеЗаПериод;
	Иначе
		ВызватьИсключение "Неизвестный тип вычисления";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ИзменитьОформлениеПоАктивности()
	Если Объект.Активность Тогда
		Элементы.ГруппаОсновное.ЦветФона = Новый Цвет();
	Иначе
		Элементы.ГруппаОсновное.ЦветФона = ЦветаСтиля.ЦветФонаПодсказки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗначенияПоУмолчанию()
	Если Не ЗначениеЗаполнено(Объект.ТипВычисленияМетрики) Тогда
		Объект.ТипВычисленияМетрики = Перечисления.ТипыВычисленияМетрик.Алгоритм;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ТипМетрики) Тогда
		Объект.ТипМетрики = Перечисления.ТипыМетрикPrometheus.Gauge;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.МетодПолученияМетрики) Тогда
		Объект.МетодПолученияМетрики = Перечисления.МетодыПолученияМетрик.PullИзКэша;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти