
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
//#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
	
	Макет = ЭтотОбъект.ПолучитьМакет("ЖурналОперацийПоСчетуДепо");
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");	
	
	ОбластьМакета.Параметры.ОписаниеПериода = ФормированиеОписанияПериода();    	
	ОбластьМакета.Параметры.Период = "За период с "+ Формат(ДатаНач,"ДЛФ=DD")+ " по " + Формат(ДатаКон,"ДЛФ=DD");	
	ОбластьМакета.Параметры.СчетДепо = СчетДепо;	
	ОбластьМакета.Параметры.НаименованиеВладельца = СчетДепо.Владелец.Наименование;
	
	Если СчетДепо.ТипСчетаДепо = Перечисления.ТипыСчетовДепо.Владельца Тогда	
		ОбластьМакета.Параметры.ТипСчета		 			= "";
		ОбластьМакета.Параметры.ТСВладелец		 		= "V";
		ОбластьМакета.Параметры.ТСНоминальныйДержатель 	= "";
		
	Иначе			
		Если СчетДепо.ТипСчетаДепо = Перечисления.ТипыСчетовДепо.НоминальногоДержателя  Тогда		
			ОбластьМакета.Параметры.ТипСчета		 			= "";
			ОбластьМакета.Параметры.ТСВладелец		 		= "";
			ОбластьМакета.Параметры.ТСНоминальныйДержатель 	= "V";
			
		Иначе	
			ОбластьМакета.Параметры.ТипСчета		 = СчетДепо.ТипСчетаДепо;
			ОбластьМакета.Параметры.ТСВладелец		 		= "";
			ОбластьМакета.Параметры.ТСНоминальныйДержатель 	= "";
			
		КонецЕсли; 	
	КонецЕсли;	

    ОбластьМакета.Параметры.Организация = Депозитарий.НаименованиеПолное;
	ДанныеЛицензии = ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Депозитарий);	 
	ОбластьМакета.Параметры.ЛицензияНомер = "Лицензия № "+ДанныеЛицензии.НомерЛицензии + " от ";
	ОбластьМакета.Параметры.ЛицензияДата = "" + ДанныеЛицензии.ДатаЛицензии + " г. ";

	ДокументРезультат.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");	
	ДокументРезультат.Вывести(ОбластьМакета);

	ТаблицаОтчета = ТаблицаОтчета();
	Для каждого СтрокаТаблицы Из ТаблицаОтчета Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Детали");	
		ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
		ДокументРезультат.Вывести(ОбластьМакета);		
	КонецЦикла; 		
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ЭтотОбъект.ДатаНач > ЭтотОбъект.ДатаКон И ЭтотОбъект.ДатаКон <> '00010101000000' Тогда
		Сообщить("Дата начала периода не может быть больше даты конца периода");
		Отказ = Истина;
	КонецЕсли;
	
	ЭтотОбъект.Депозитарий = Константы.ОрганизацияПоУмолчанию.Получить();
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Депозитарий) тогда
		Сообщить("Не выбрано значение организации, используемое по умолчанию!!!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

//#КонецОбласти 

//#Область СлужебныеПроцедурыИФункции

Функция ТаблицаОтчета()
	
	Результат = Новый ТаблицаЗначений;
	
	Схема = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Если ЗначениеЗаполнено(ЭтотОбъект.ДатаНач) Тогда
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачДата", ЭтотОбъект.ДатаНач);		
	КонецЕсли; 	
	Если ЗначениеЗаполнено(ЭтотОбъект.ДатаКон) Тогда
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонДата", КонецДня(ЭтотОбъект.ДатаКон));
	КонецЕсли; 
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДепо", ЭтотОбъект.СчетДепо);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, ,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцВывода.УстановитьОбъект(Результат);
	ПроцВывода.Вывести(ПроцКомпоновки);
	  
	Возврат Результат;
	
КонецФункции

Функция ФормированиеОписанияПериода() 
	
	// Вывод заголовка, описателя периода и фильтров и заголовка
	Если ДатаНач = '00010101000000' И ДатаКон = '00010101000000' Тогда

		ОписаниеПериода     = "Период: без ограничения.";

	Иначе

		Если ДатаНач = '00010101000000' ИЛИ ДатаКон = '00010101000000' Тогда
			ОписаниеПериода = "Период: " + Формат(ДатаНач, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""") 
							+ " - "      + Формат(ДатаКон, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""");
		Иначе
			ОписаниеПериода = "Период: " + ПредставлениеПериода(НачалоДня(ДатаНач), КонецДня(ДатаКон), "ФП = Истина");
		КонецЕсли;

	КонецЕсли;

	Возврат  ОписаниеПериода;

КонецФункции	

//#КонецОбласти 

#КонецЕсли

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
