Перем Макет;
Перем ПредставлениеНастроек;

Функция ВыполнитьСверку() Экспорт
	ТЗ = ПодготовитьТаблицу();
	
	Если СтрДлина(СтатусОшибки) = 0 Тогда
		ТабДок = ЗаполнитьМакет(ТЗ);
		Возврат ТабДок;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции 

Функция ЗаполнитьМакет(ТЗ)
	Отчет.Очистить();
	Отчет.ТолькоПросмотр =  ИСТИНА;
	
	Макет = ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Период = "Период с " + Формат(НачДата, "ДФ=dd.MM.yyyy") + " по " + Формат(КонДата, "ДФ=dd.MM.yyyy");
	Отчет.Вывести(Область);
	
	Статус = ЛОЖЬ;
	
	ТекВид = Неопределено;
	
	Для Каждого текСтр ИЗ ТЗ Цикл
		Если текСтр.вхБУ = 0 И текСтр.исхБУ = 0 и текСтр.вхВУ = 0 И текСтр.исхВУ = 0 И текСтр.вхУУ = 0 И текСтр.исхУУ = 0 И текСтр.вхВып = 0 И текСтр.исхВып = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ОтображатьВсе Тогда
			Если текСтр.Разница = "-" Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если текСтр.ТипКлиентаДУ <> ТекВид Тогда
			текВид = текСтр.ТипКлиентаДУ;
			Область = Макет.ПолучитьОбласть("ТипДоговораДУ");
			Область.Параметры.ТипДоговораДУ = текВид;
			Отчет.Вывести(Область);
		КонецЕсли;
		
		Если текСтр.Разница = "Есть расхождения" Тогда
			Статус = ИСТИНА;
			Если текСтр.Счет.ДоговорДУ = Справочники.ДоговорДУ.ПустаяСсылка() Тогда 
				Область = Макет.ПолучитьОбласть("СтрокаЕРС");
			Иначе 
				Область = Макет.ПолучитьОбласть("СтрокаПодсв");
			КонецЕсли;
		Иначе
			Область = Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Область.Параметры.Заполнить(текСтр);
		
		Отчет.Вывести(Область)
	КонецЦикла;
	
	Возврат Отчет;
КонецФункции

Функция ПодготовитьТаблицу()
	
	Запрос = Новый Запрос();
	Запрос.Текст = ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("ДоговорИсключение", ДоговорИсключение); //IMAPPS-20859
	Запрос.УстановитьПараметр("СчетИсключение", СчетИсключение); // IMAPPS-25493
	
	// 07.06.2018 DDneprovsky IMAPPS-6388 {
	ВладелецЕРС = РегистрыСведений.УниверсальныеСопоставления.ПрочитатьПрямоеСопоставление(Перечисления.КонтекстСопоставления.ДоговорДУ, Справочники.Контрагенты.ПустаяСсылка(), "Контрагент_Банк_ВТБ_ПАО", Ложь);
	БанкВКоторомОткрытЕРС = РегистрыСведений.УниверсальныеСопоставления.ПрочитатьПрямоеСопоставление(Перечисления.КонтекстСопоставления.ДоговорДУ, Справочники.Банки.ПустаяСсылка(), "Банк_ВТБ_ПАО", Ложь);
	Запрос.УстановитьПараметр("ВладелецЕРС", ВладелецЕРС);
	Запрос.УстановитьПараметр("БанкВКоторомОткрытЕРС", БанкВКоторомОткрытЕРС);
	// } 07.06.2018 DDneprovsky IMAPPS-6388
	Запрос.УстановитьПараметр("НачГраница", Новый Граница(НачалоДня(НачДата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонГраница", Новый Граница(КонецДня(КонДата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонДата",КонецДня(КонДата));
	тзВнутренние = Запрос.Выполнить().Выгрузить();
	
	// Соединим внешние и внутренние данные
	тзВнешние = ПолучитьДанныеПоВыпискам();
	
	Если ТипЗнч(тзВнешние) = Тип("Строка") Тогда
		СтатусОшибки = тзВнешние;
		Возврат 0;
	КонецЕсли;
	
	Для Каждого ВнешСтр Из тзВнешние Цикл
		ВнутрСтр = тзВнутренние.Добавить();
		ВнутрСтр.ДоговорДУ = ВнешСтр.ДоговорДУ;
		ВнутрСтр.ТипКлиентаДУ = ВнешСтр.ДоговорДУ.ТипКлиентаДУ;
		ВнутрСтр.Валюта = ВнешСтр.Счет.ВалютаДенежныхСредств;
		ВнутрСтр.Счет = ВнешСтр.Счет;
		ВнутрСтр.вхВып = ВнешСтр.начОст;
		ВнутрСтр.исхВып = ВнешСтр.конОст;
	КонецЦикла;
	
	тзВнутренние.Свернуть("ДоговорДУ, Счет, Валюта, ТипКлиентаДУ", "вхБУ,исхБУ,вхВУ,исхВУ,вхУУ,исхУУ,вхВып,исхВып");
	тзВнутренние.Сортировать("ТипКлиентаДУ, ДоговорДУ, Счет");	
	
	// Проставим разницу
	// IMAPPS-25536{  попросили отключить рублевую сумму по валютным счетам 
	// Если КалендарныеГрафики.ПолучитьПоследнийРабочийДень(,КонецМесяца(НачДата)) = НачДата Тогда
	//	флОтображатьРубли = ИСТИНА;
	// Иначе
		флОтображатьРубли = ЛОЖЬ;
	// КонецЕсли;
	// }IMAPPS-25536
	тзВнутренние.Колонки.Добавить("Разница"); 
	РазмерТаблицы = -(тзВнутренние.Количество() - 1);
	Для Сч = РазмерТаблицы По 0 Цикл
		ТекСтр = тзВнутренние.Получить(-Сч);
		
		Если (ТекСтр.вхБУ - ТекСтр.вхВУ) <> 0 ИЛИ (ТекСтр.вхБУ - ТекСтр.вхУУ) <> 0 ИЛИ (ТекСтр.вхБУ - ТекСтр.вхВып) <> 0 ИЛИ (ТекСтр.вхВУ - ТекСтр.вхУУ) <> 0 ИЛИ (ТекСтр.вхВУ - ТекСтр.вхВып) <> 0 ИЛИ (ТекСтр.вхУУ - ТекСтр.вхВып) <> 0 ИЛИ
			 (ТекСтр.исхБУ - ТекСтр.исхВУ) <> 0 ИЛИ (ТекСтр.исхБУ - ТекСтр.исхУУ) <> 0 ИЛИ (ТекСтр.исхБУ - ТекСтр.исхВып) <> 0 ИЛИ (ТекСтр.исхВУ - ТекСтр.исхУУ) <> 0 ИЛИ (ТекСтр.исхВУ - ТекСтр.исхВып) <> 0 ИЛИ (ТекСтр.исхУУ - ТекСтр.исхВып) <> 0 Тогда
			текСтр.Разница = "Есть расхождения";
			
		Иначе
			текСтр.Разница = "-";
		КонецЕсли;
		
		// Если это не конец месяца, то рублевую сумму по валютным счетам не отражаем
		
		Если НЕ флОтображатьРубли Тогда
			Если (ТекСтр.Счет.ВалютаДенежныхСредств <> Справочники.Валюты.RUB) И (ТекСтр.Валюта = Справочники.Валюты.RUB) Тогда
				тзВнутренние.Удалить(-Сч);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат тзВнутренние;
КонецФункции

Функция ПолучитьТекстЗапроса()
	// 07.06.2018 DDneprovsky IMAPPS-6388 {
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.ДоговорДУ КАК ДоговорДУ,
	               |	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Счет,
	               |	ЗНАЧЕНИЕ(Справочник.Валюты.RUB) КАК Валюта,
	               |	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток, 0) КАК вхБУ,
	               |	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК исхБУ,
	               |	0 КАК вхВУ,
	               |	0 КАК исхВУ,
	               |	0 КАК вхУУ,
	               |	0 КАК исхУУ
	               |ПОМЕСТИТЬ ВременнаяОстатки
	               |ИЗ
	               //|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачГраница, &КонГраница, Период, ДвиженияИГраницыПериода, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)), , ) КАК ХозрасчетныйОстаткиИОбороты
				   |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачГраница, &КонГраница, Период, ДвиженияИГраницыПериода, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)), , НЕ ДоговорДУ В (&ДоговорИсключение)) КАК ХозрасчетныйОстаткиИОбороты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.ДоговорДУ,
	               |	ХозрасчетныйОстаткиИОбороты.Субконто1.МестоХранения,
	               |	ЗНАЧЕНИЕ(Справочник.Валюты.RUB),
	               |	0,
	               |	0,
	               |	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток, 0),
	               |	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток, 0),
	               |	0,
	               |	0
	               |ИЗ
	               //|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачГраница, &КонГраница, Период, ДвиженияИГраницыПериода, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВУДС), , ) КАК ХозрасчетныйОстаткиИОбороты    //IMAPPS-20859
				   |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачГраница, &КонГраница, Период, ДвиженияИГраницыПериода, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВУДС), , НЕ ДоговорДУ В (&ДоговорИсключение)) КАК ХозрасчетныйОстаткиИОбороты
	               |ГДЕ
	               |	НЕ ХозрасчетныйОстаткиИОбороты.Субконто1.ОткрытНаБирже
	               |	И ХозрасчетныйОстаткиИОбороты.Субконто1.МестоХранения.ВидСчета <> ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Депозитный)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДенежныеСредстваУправленческийОстаткиИОбороты.ДоговорДУ,
	               |	ДенежныеСредстваУправленческийОстаткиИОбороты.АналитическийСчет.МестоХранения,
	               |	ЗНАЧЕНИЕ(Справочник.Валюты.RUB),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ДенежныеСредстваУправленческийОстаткиИОбороты.СуммаНачальныйОстаток,
	               |	ДенежныеСредстваУправленческийОстаткиИОбороты.СуммаКонечныйОстаток
	               |ИЗ
	               //|	РегистрНакопления.ДенежныеСредстваУправленческий.ОстаткиИОбороты(&НачГраница, &КонГраница, Период, ДвиженияИГраницыПериода, ) КАК ДенежныеСредстваУправленческийОстаткиИОбороты     //IMAPPS-20859
				   |	РегистрНакопления.ДенежныеСредстваУправленческий.ОстаткиИОбороты(&НачГраница, &КонГраница, Период, ДвиженияИГраницыПериода, НЕ ДоговорДУ В (&ДоговорИсключение)) КАК ДенежныеСредстваУправленческийОстаткиИОбороты
	               |ГДЕ
	               |	НЕ ДенежныеСредстваУправленческийОстаткиИОбороты.АналитическийСчет.ОткрытНаБирже
	               |	И ДенежныеСредстваУправленческийОстаткиИОбороты.АналитическийСчет.МестоХранения.ВидСчета <> ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Депозитный)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.ДоговорДУ,
	               |	ХозрасчетныйОстаткиИОбороты.Субконто1,
	               |	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.RUB)),
	               |	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаНачальныйОстаток, 0),
	               |	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаКонечныйОстаток, 0),
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               //|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачГраница, &КонГраница, Период, ДвиженияИГраницыПериода, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)), , ) КАК ХозрасчетныйОстаткиИОбороты
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачГраница, &КонГраница, Период, ДвиженияИГраницыПериода, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)), , НЕ ДоговорДУ В (&ДоговорИсключение)) КАК ХозрасчетныйОстаткиИОбороты
	               |ГДЕ
	               |	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.RUB)) <> ЗНАЧЕНИЕ(Справочник.Валюты.RUB)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.ДоговорДУ,
	               |	ХозрасчетныйОстаткиИОбороты.Субконто1.МестоХранения,
	               |	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.RUB)),
	               |	0,
	               |	0,
	               |	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаНачальныйОстаток, 0),
	               |	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаКонечныйОстаток, 0),
	               |	0,
	               |	0
	               |ИЗ
	               //|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачГраница, &КонГраница, Период, ДвиженияИГраницыПериода, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВУДС), , ) КАК ХозрасчетныйОстаткиИОбороты  //IMAPPS-20859
				   |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачГраница, &КонГраница, Период, ДвиженияИГраницыПериода, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВУДС), , НЕ ДоговорДУ В (&ДоговорИсключение)) КАК ХозрасчетныйОстаткиИОбороты
	               |ГДЕ
	               |	НЕ ХозрасчетныйОстаткиИОбороты.Субконто1.ОткрытНаБирже
	               |	И ХозрасчетныйОстаткиИОбороты.Субконто1.МестоХранения.ВидСчета <> ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Депозитный)
	               |	И ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.RUB)) <> ЗНАЧЕНИЕ(Справочник.Валюты.RUB)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДенежныеСредстваУправленческийОстаткиИОбороты.ДоговорДУ,
	               |	ДенежныеСредстваУправленческийОстаткиИОбороты.АналитическийСчет.МестоХранения,
	               |	ЕСТЬNULL(ДенежныеСредстваУправленческийОстаткиИОбороты.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.RUB)),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ДенежныеСредстваУправленческийОстаткиИОбороты.ВалютнаяСуммаНачальныйОстаток,
	               |	ДенежныеСредстваУправленческийОстаткиИОбороты.ВалютнаяСуммаКонечныйОстаток
	               |ИЗ
	               //|	РегистрНакопления.ДенежныеСредстваУправленческий.ОстаткиИОбороты(&НачГраница, &КонГраница, Период, ДвиженияИГраницыПериода, ) КАК ДенежныеСредстваУправленческийОстаткиИОбороты     //IMAPPS-20859
	               |	РегистрНакопления.ДенежныеСредстваУправленческий.ОстаткиИОбороты(&НачГраница, &КонГраница, Период, ДвиженияИГраницыПериода, НЕ ДоговорДУ В (&ДоговорИсключение)) КАК ДенежныеСредстваУправленческийОстаткиИОбороты
	               |ГДЕ
	               |	НЕ ДенежныеСредстваУправленческийОстаткиИОбороты.АналитическийСчет.ОткрытНаБирже
	               |	И ЕСТЬNULL(ДенежныеСредстваУправленческийОстаткиИОбороты.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.RUB)) <> ЗНАЧЕНИЕ(Справочник.Валюты.RUB)
	               |	И ДенежныеСредстваУправленческийОстаткиИОбороты.АналитическийСчет.МестоХранения.ВидСчета <> ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Депозитный)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Счет,
	               |	ДоговорДУ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВременнаяОстатки.ДоговорДУ КАК ДоговорДУ,
	               |	ДоговорыДУ.ТипКлиентаДУ КАК ТипКлиентаДУ,
	               |	ВременнаяОстатки.Счет КАК Счет,
	               |	ЕСТЬNULL(ВременнаяОстатки.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.RUB)) КАК Валюта,
	               |	СУММА(ВременнаяОстатки.вхБУ) КАК вхБУ,
	               |	СУММА(ВременнаяОстатки.исхБУ) КАК исхБУ,
	               |	СУММА(ВременнаяОстатки.вхВУ) КАК вхВУ,
	               |	СУММА(ВременнаяОстатки.исхВУ) КАК исхВУ,
	               |	СУММА(ВременнаяОстатки.вхУУ) КАК вхУУ,
	               |	СУММА(ВременнаяОстатки.исхУУ) КАК исхУУ,
	               |	0 КАК вхВып,
	               |	0 КАК исхВып
	               |ИЗ
	               |	ВременнаяОстатки КАК ВременнаяОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	               |		ПО ВременнаяОстатки.Счет = БанковскиеСчета.Ссылка
	               |			И (БанковскиеСчета.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипРасчетногоСчета.Единый)
	               |				ИЛИ БанковскиеСчета.Владелец <> &ВладелецЕРС
	               |				ИЛИ БанковскиеСчета.Банк <> &БанкВКоторомОткрытЕРС
	               |				ИЛИ БанковскиеСчета.ДоговорДУ <> ЗНАЧЕНИЕ(Справочник.ДоговорДУ.ПустаяСсылка))
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорДУ КАК ДоговорыДУ
	               |		ПО ВременнаяОстатки.ДоговорДУ = ДоговорыДУ.Ссылка
	               |			И (НЕ ДоговорыДУ.ПометкаУдаления)
				// IMAPPS-25536{  
				// |			И (ДоговорыДУ.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	            // |				ИЛИ ДоговорыДУ.ДатаОкончания >= &КонДата
	            // |				ИЛИ ДоговорыДУ.ДатаНачала = ДоговорыДУ.ДатаОкончания)
				// }IMAPPS-25536   
				   |ГДЕ НЕ ВременнаяОстатки.Счет В (&СчетИсключение) // IMAPPS-25493
	               |СГРУППИРОВАТЬ ПО
	               |	ДоговорыДУ.ТипКлиентаДУ,
	               |	ВременнаяОстатки.ДоговорДУ,
	               |	ВременнаяОстатки.Счет,
	               |	ЕСТЬNULL(ВременнаяОстатки.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.RUB))";
	               
	Возврат ТекстЗапроса;           
	// } 07.06.2018 DDneprovsky IMAPPS-6388
КонецФункции

Функция ПолучитьДанныеПоВыпискам() Экспорт
	// Получим список нужных счетов
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	БанковскиеСчета.Ссылка КАК Счет,
	               |	БанковскиеСчета.НомерСчета КАК Номер,
	               |	БанковскиеСчета.ДоговорДУ,
	               |	0 КАК начОст,
	               |	0 КАК конОст
	               |ИЗ
	               |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорДУ КАК Договоры
	               |		ПО БанковскиеСчета.ДоговорДУ = Договоры.Ссылка
	               |ГДЕ
				   // 07.06.2018 DDneprovsky IMAPPS-6388 {
	               |	НЕ БанковскиеСчета.ПометкаУдаления
	               |	И БанковскиеСчета.ВидСчета <> ЗНАЧЕНИЕ(Перечисление.ВидБанковскогоСчета.Депозитный)
	               |	И (БанковскиеСчета.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипРасчетногоСчета.Единый)
	               |			ИЛИ БанковскиеСчета.Владелец <> &ВладелецЕРС
	               |			ИЛИ БанковскиеСчета.Банк <> &БанкВКоторомОткрытЕРС
	               |			ИЛИ БанковскиеСчета.ДоговорДУ <> ЗНАЧЕНИЕ(Справочник.ДоговорДУ.ПустаяСсылка))
	               |	И (Договоры.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	               |			ИЛИ Договоры.ДатаОкончания >= &КонДата
	               |			ИЛИ Договоры.ДатаНачала = Договоры.ДатаОкончания)
				   //IMAPPS-20859 ++
	               |	И НЕ Договоры.Ссылка В(&ДоговорИсключение)
				   |	И НЕ БанковскиеСчета.Ссылка В(&СчетИсключение) 
				   //IMAPPS-20859 --
				   |	И НЕ Договоры.ПометкаУдаления";
				   //} 07.06.2018 DDneprovsky IMAPPS-6388
	
	Запрос.УстановитьПараметр("ДоговорИсключение", ДоговорИсключение); //IMAPPS-20859
	Запрос.УстановитьПараметр("СчетИсключение", СчетИсключение); //IMAPPS-20859
	
	// 07.06.2018 DDneprovsky IMAPPS-6388 {
	ВладелецЕРС = РегистрыСведений.УниверсальныеСопоставления.ПрочитатьПрямоеСопоставление(Перечисления.КонтекстСопоставления.ДоговорДУ, Справочники.Контрагенты.ПустаяСсылка(), "Контрагент_Банк_ВТБ_ПАО", Ложь);
	БанкВКоторомОткрытЕРС = РегистрыСведений.УниверсальныеСопоставления.ПрочитатьПрямоеСопоставление(Перечисления.КонтекстСопоставления.ДоговорДУ, Справочники.Банки.ПустаяСсылка(), "Банк_ВТБ_ПАО", Ложь);
	Запрос.УстановитьПараметр("ВладелецЕРС", ВладелецЕРС);
	Запрос.УстановитьПараметр("БанкВКоторомОткрытЕРС", БанкВКоторомОткрытЕРС);
	//} 07.06.2018 DDneprovsky IMAPPS-6388
	Запрос.УстановитьПараметр("КонДата", КонДата);
	тзСчетов = Запрос.Выполнить().Выгрузить();
		
	СписокСчетов = "";
	
	Для Каждого Счет Из тзСчетов Цикл
		Если СписокСчетов = "" Тогда
			СписокСчетов = "'" + СокрЛП(Счет.Номер) + "'";
		Иначе
			СписокСчетов = СписокСчетов + ", " + "'" + СокрЛП(Счет.Номер) + "'";
		КонецЕсли;
	КонецЦикла;
	
	// Получим остатки из базы iBankReports по нужным счетам
	АДОстр = "Provider=SQLOLEDB.1;Persist Security Info=True;User ID=rates_view;Password=DgsFaVqDSZQhORL7NrCm;Initial Catalog=iBankReports;Data Source=AMDBRATES\dbmvtbam01";
	
	Попытка		
		АДО = Новый COMОбъект("ADODB.Connection");
		АДО.ConnectionTimeOut = 60000;
		АДО.CursorLocation = 3;
		АДО.CommandTimeOut = 600;
		АДО.Open(АДОстр);		
	Исключение 
		Сообщить(ОписаниеОшибки());
		Сообщить("Не могу подсоединиться к базе. Обратитесь к разработчику.");		
		Возврат ОписаниеОшибки();
	КонецПопытки;
	рс = Новый COMОбъект("ADODB.RecordSet");
	

//	IMAPPS-1460
//	На начало периода
//	SQL = "SELECT Account, Balance1 as Balance FROM REP_BALANCE where Date1 = '" + Формат(НачДата, "ДФ=yyyyMMdd") + "' AND Account IN (" + СписокСчетов + ")";
	SQL = "SELECT x.date2, x.Account as Account, x.Balance2 as Balance FROM REP_BALANCE x,
		| (select max(date2) as date2, Account
		|    from REP_BALANCE
		|   where Date2 < '" + Формат(НачДата, "ДФ=yyyyMMdd") + "'
		|     and Account in (" + СписокСчетов + ")
		|   group by Account) y
		|   WHERE y.date2 = x.date2 AND y.account = x.account";
	рс = АДО.Execute(SQL);
	Пока рс.EOF() = 0 Цикл
		Стр = тзСчетов.Найти(СокрЛП(рс.Fields("Account").Value), "Номер");
		Стр.НачОст = Число(рс.Fields("Balance").Value);
		рс.MoveNext();
	КонецЦикла;
	
//	IMAPPS-1460
//	На конец периода
//	SQL = "SELECT Account, Balance2 as Balance FROM REP_BALANCE where Date2 = '" + Формат(КонДата, "ДФ=yyyyMMdd") + "' AND Account IN (" + СписокСчетов + ")";
	SQL = "SELECT x.date2, x.Account as Account, x.Balance2 as Balance FROM REP_BALANCE x,
		| (select max(date2) as date2, Account
		|    from REP_BALANCE
		|   where Date2 <= '" + Формат(КонДата, "ДФ=yyyyMMdd") + "'
		|     and Account in (" + СписокСчетов + ")
		|   group by Account) y
		|   WHERE y.date2 = x.date2 AND y.account = x.account";
	рс = АДО.Execute(SQL);
	Пока рс.EOF() = 0 Цикл
		Стр = тзСчетов.Найти(СокрЛП(рс.Fields("Account").Value), "Номер");
		Стр.КонОст = Число(рс.Fields("Balance").Value);
		рс.MoveNext();
	КонецЦикла;
		
	тзСчетов.Свернуть("ДоговорДУ, Счет", "НачОст, КонОст");
	Возврат тзСчетов;
КонецФункции

Процедура РассылкаОтчета(Отказ, ТекстОшибки="") Экспорт
	Если СписокРассылки.Количество() > 0 и НЕ ПочтовыйЛогин.Пустая() тогда
		
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, Вложения");
		//ПараметрыПисьма = Новый Структура("Кому, Тема, Тело");
		ПараметрыПисьма.Тема = "Отчет по сверке денежных средств";
		
		Кому = Новый Массив;
		Для каждого ТекЯщик из СписокРассылки Цикл
		   Кому.Добавить(Новый Структура("Адрес,Представление", ТекЯщик.ПочтовыйЯщик, ТекЯщик.Представление));
		КонецЦикла;
			
		ПараметрыПисьма.Кому = кому;
		
		ПутьКФайлу = ПолучитьИмяВременногоФайла("XLS");
		Отчет.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.XLS);
		
		Вложения = Новый Соответствие;
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
		АдресВложения = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		Вложения.Вставить("Report.xls", АдресВложения);
		
		ПараметрыПисьма.Вложения = Вложения;
		
		ПараметрыПисьма.Тело = "Отчет по сверке денежных средств " + Формат(НачДата,"ДЛФ=Д") + " по " + Формат(КонДата,"ДЛФ=Д") + ".";
		
		Если Статус Тогда
			ПараметрыПисьма.Тело = ПараметрыПисьма.Тело + Символы.ПС + Символы.ПС + "Выявлены расхождения. Подробности в приложенном отчете.";
		Иначе
			ПараметрыПисьма.Тело = ПараметрыПисьма.Тело + Символы.ПС + Символы.ПС + "Расхождений не выявлено!";
		КонецЕсли;
		
		Попытка
			ТекстОшибки = РаботаСПочтовымиСообщениями.ОтправитьСообщение(ПочтовыйЛогин, ПараметрыПисьма);
		Исключение
			СтатусОшибки = "Рассылка не удалась: " + ОписаниеОшибки(); 
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры


//ПРОЦЕДУРЫ ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ ОТЧЕТОВ И ОБРАБОТОК///////////
Функция СведенияОВнешнейОбработке() Экспорт
	
	//МассивСтрокИмен = Новый Массив;
	//МассивСтрокИмен.Добавить("Документ.Сделки");
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид","ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Назначение",Неопределено);   //  МассивСтрокИмен
	ПараметрыРегистрации.Вставить("Наименование", "Сверка денежных средств");
	ПараметрыРегистрации.Вставить("Версия", "1.06");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация","Сверка денежных средств");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "2.1.1.12");
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд,
	"Сверка денежных средств",
	"ЗаполнитьWEB_VTB",
	"ОткрытиеФормы");
	
	ДобавитьКоманду(ТаблицаКоманд,
	"Сверка денежных средств (фон.)",
	"ФоновоеВыполнение",
	"ВызовСерверногоМетода");

	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	Возврат ПараметрыРегистрации;
КонецФункции

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры

/////////////////////////////////////////////////////////////////

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт
	// Реализация логики команды
	Если ИдентификаторКоманды <> "ФоновоеВыполнение" Тогда Возврат; КонецЕсли;
	
	ПредставлениеНастроек = УстановитьНастройки(ПараметрыВыполненияКоманды);
	
	Задача = Задачи.ЗадачаИнтеграции.СоздатьЗадачу();
	Задача.Дата 	= ТекущаяДата();
	
	Задача.Наименование 	= "Сверка денежных средств";
	Задача.ПараметрыВыполнения = ПредставлениеНастроек;
	
	Отказ = Ложь;
	ТекстОшибки = "";
	 
	НачДата = КалендарныеГрафики.ПолучитьСледующуюРабочуюДату(, ТекущаяДата(), -1);
	КонДата = НачДата;
	
	ВыполнитьСверку();
	
	РезультатОтравки = "";
	РассылкаОтчета(Ложь, РезультатОтравки);
	
	Задача.ХранилищеЛога = Новый ХранилищеЗначения(Отчет, Новый СжатиеДанных(9));
	Задача.Описание 	= "Настройки: "+ ПредставлениеНастроек;

	Если СтрДлина(СтатусОшибки) > 0 тогда
		Задача.Описание = Задача.Описание + Символы.ПС + "При выполнении были ошибки:";
		Задача.Описание = Задача.Описание + Символы.ПС + СтатусОшибки;
		Задача.ЗавершеноСОшибками = Истина;
	Иначе
		Задача.Описание = Задача.Описание + Символы.ПС + "Загрузка успешна: " + РезультатОтравки;
	КонецЕсли;
	
	ТекстОписания 		= СокрЛП(ПочтовыйЛогин) + " " + СокрЛП(СписокРассылки.Количество());
	Задача.Описание 	= Задача.Описание + Символы.ПС + ТекстОписания;
	Задача.ДатаИсполнения = ТекущаяДата();
	Задача.Описание = Задача.Описание + Символы.ПС + " ОК";
	Задача.ВыполнитьЗадачу();
КонецПроцедуры

Функция УстановитьНастройки(ПараметрыВыполненияКоманды) Экспорт
	НастройкиВыполнения = ПараметрыВыполненияКоманды.ПараметрыДополнительнойОбработки;
	Если ТипЗнч(НастройкиВыполнения) <> Тип("Структура") тогда возврат "<Настройки не установлены>"; КонецЕсли;
	
	ЗначенияНастроек = НастройкиВыполнения;
	
	ПредставлениеНастроек = "";
	
	НачДата 	= КалендарныеГрафики.ПолучитьСледующуюРабочуюДату(, ТекущаяДата(), -1);
	КонДата 	= НачДата;
	
	УстановитьПользовательскиеНастройки(ЗначенияНастроек, ПредставлениеНастроек);
	
	Возврат ПредставлениеНастроек;

КонецФункции

Процедура УстановитьПользовательскиеНастройки(Настройки, ПредставлениеНастроек="") Экспорт
	Если Настройки.Свойство("Значения") тогда
		Почта = Неопределено;
		Если Настройки.Значения.Свойство("ПочтовыйЛогин", Почта) тогда
			ПочтовыйЛогин = Почта;
			
			Ящики = XMLЗначение(Тип("ХранилищеЗначения"),Настройки.Значения.СписокРассылки);
			СписокРассылки.Загрузить(Ящики.Получить());
		КонецЕсли;
		
		СчетИсключение = Настройки.Значения.СчетИсключение;   //IMAPPS-20859
		ДоговорИсключение = Настройки.Значения.ДоговорИсключение;     //IMAPPS-20859
		
		ПредставлениеНастроек = "Период с:"+Формат(НачДата,"ДФ=dd.MM.yyyy") + " по:"+Формат(КонДата,"ДФ=dd.MM.yyyy") + " ";
	КонецЕсли;
КонецПроцедуры

Макет = ПолучитьМакет("Макет");
