
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	СтандартнаяОбработка = Ложь;
	Код = СледующийПолностьюЦифровойКод("БанковскиеСчета");
КонецПроцедуры

// Получает следующий по порядку код в серии кодов, полностью состоящих из цифр.
// Используется полная длина кода справочника.
//
// Возвращаемое значение
//  строка с новым кодом
Функция СледующийПолностьюЦифровойКод(ИмяСправочника)
	ДлинаКода = Метаданные.Справочники[ИмяСправочника].ДлинаКода;
	Если ДлинаКода = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	СписокЦифр = Новый Массив;	// Массив односимвольных строк - цифр от 0 до 9
	Для Цифра = 0 по 9 Цикл
		СписокЦифр.Добавить(Строка(Цифра));
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокЦифр", СписокЦифр);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	БанковскиеСчета.Код КАК Код
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	&УсловиеОтбора
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код Убыв";
	УсловиеОтбора = "";
	Для инд = 1 по ДлинаКода Цикл
		УсловиеОтбора = УсловиеОтбора + ?(УсловиеОтбора <> "", " И ", "") +
			"ПОДСТРОКА(Код, "+инд+", 1) В (&СписокЦифр)";
	КонецЦикла;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", УсловиеОтбора);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "БанковскиеСчета", ИмяСправочника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Формат(Число(Выборка.Код) + 1, "ЧЦ=" + ДлинаКода + ";ЧВН=1;ЧГ=0;");
	Иначе
		НулевойКод = "";
		Для инд = 1 по ДлинаКода Цикл
			НулевойКод = НулевойКод + "0";
		КонецЦикла;
		Возврат НулевойКод;
	КонецЕсли;
КонецФункции
