
Процедура ЗарегистрироватьСтатусПоручения(Поручение, Статус) Экспорт
	
	Запись = РегистрыСведений.СтатусыПорученийВСЭД.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДата();
	Запись.Поручение = Поручение;
	Запись.Статус = Статус;
	Запись.Записать(Ложь);
	
КонецПроцедуры


Процедура ОбновитьСтатусыОжидающихПодписания(ЭДО = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрацияДокументовВЭДО.Документ КАК Документ,
	|	РегистрацияДокументовВЭДО.Идентификатор КАК Идентификатор,
	|	СтатусыПорученийВСЭДСрезПоследних.Поручение КАК Поручение
	|ИЗ
	|	РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияДокументовВЭДО,
	|	РегистрСведений.СтатусыПорученийВСЭД.СрезПоследних КАК СтатусыПорученийВСЭДСрезПоследних
	|ГДЕ
	|	СтатусыПорученийВСЭДСрезПоследних.Поручение = ВЫРАЗИТЬ(РегистрацияДокументовВЭДО.Документ КАК Документ.Выписка).ДокументОснование
	|	И СтатусыПорученийВСЭДСрезПоследних.Статус = &Загружено
	|	И РегистрацияДокументовВЭДО.Идентификатор <> 0";
	Запрос.УстановитьПараметр("Загружено", Перечисления.СтатусыДокументовВСЭД.Загружено);
	Результат = Запрос.Выполнить();
	
	Если ЭДО = Неопределено Тогда
		ЭДО = Обработки.ЭДО.Создать();
	КонецЕсли;
	
	Идентификаторы = Результат.Выгрузить().ВыгрузитьКолонку("Идентификатор");
	СтатусыДокументов = ЭДО.СтатусыДокументов(Идентификаторы);
	СтатусыДокументов.Индексы.Добавить("DocumentId");
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = СтатусыДокументов.Найти(Выборка.Идентификатор, "DocumentId");
		Если Строка <> Неопределено И Строка.SigningIsRequired = Ложь Тогда
			ЗарегистрироватьСтатусПоручения(Выборка.Поручение, Перечисления.СтатусыДокументовВСЭД.Подписано);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

