Перем УслугаОперации;
Перем Тариф;

// Проверка на существование документа созданного на основании
// переданного через параметр.
//
// Параметры
//  Основание  – Документ.Поручение
//                 
// Возвращаемое значение:
//   Булево.Истина   – если уже есть докумнт созданный на переданном основании.
//
Функция ПроверкаНаСозданныеДокументыНаОснованииТекущего(Основание)
	ДокументСозданныйНаОсновании = Документы.ПогашениеЦБ.НайтиПоРеквизиту("ДокументОснование", Основание);
	
	Возврат Ссылка <> ДокументСозданныйНаОсновании И НЕ ДокументСозданныйНаОсновании.Пустая();
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура СформироватьВыпискиПоПогашениюЦБ()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПогашениеЦБЦенныеБумаги.Депонент	КАК Депонент,
	|	ПогашениеЦБЦенныеБумаги.Количество	КАК Остаток,
	|	Выписка.Ссылка КАК ВыпискаСсылка,
	|	ПогашениеЦБЦенныеБумаги.СчетДепо КАК СчетДепо,
	|	ПогашениеЦБЦенныеБумаги.СчетДепо.Владелец КАК СчетДепоВладелец
	|ИЗ
	|	Документ.ПогашениеЦБ.ЦенныеБумаги КАК ПогашениеЦБЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка КАК Выписка
	|		ПО ПогашениеЦБЦенныеБумаги.Депонент = Выписка.СчетДепо.Владелец
	|			И ПогашениеЦБЦенныеБумаги.Ссылка = Выписка.ОперацияЦБ
	|ГДЕ
	|	ПогашениеЦБЦенныеБумаги.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ВыпискаСсылка) Тогда
			ВыпискаОбъект = Выборка.ВыпискаСсылка.ПолучитьОбъект();
		Иначе
			ВыпискаОбъект = Документы.Выписка.СоздатьДокумент();
		КонецЕсли;
		
		Если ВыпискаОбъект.ПометкаУдаления Тогда
			ВыпискаОбъект.ПометкаУдаления = Ложь;
			ВыпискаОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;	
		
		ВыпискаОбъект.ОперацияЦБ = Ссылка;
		ВыпискаОбъект.Дата = Дата;
		ВыпискаОбъект.ВидОтчета = Перечисления.ВидыОтчетов.Отчет;
		ВыпискаОбъект.ДокументОснование = ДокументОснование;
		ВыпискаОбъект.СчетДепо = Выборка.СчетДепо;
		ВыпискаОбъект.ВладелецСчета = Выборка.СчетДепоВладелец;
		ВыпискаОбъект.ПометкаУдаления = Ложь;
		ВыпискаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьЗапросПоРегиструОстаткиЦБ()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ОстаткиЦБОстатки.СчетДепо,
	|	ОстаткиЦБОстатки.РазделСчетаДепо,
	|	ОстаткиЦБОстатки.СчетДепоМХ,
	|	ОстаткиЦБОстатки.РазделСчетаДепоМХ,
	|	ОстаткиЦБОстатки.ЦБ,
	|	ОстаткиЦБОстатки.СтатусЦБ,
	|	ОстаткиЦБОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(&выбДата, ЦБ = &выбЦБ) КАК ОстаткиЦБОстатки";
	
	Запрос.УстановитьПараметр("выбДата", Дата);
	Запрос.УстановитьПараметр("выбЦБ", ЦБ);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

Функция СформироватьЗапросПоРегиструЦБВПути()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦБВПутиОстатки.СчетДепо КАК СчетДепо,
	|	ЦБВПутиОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ЦБВПутиОстатки.СчетДепоМХ КАК СчетДепоМХ,
	|	ЦБВПутиОстатки.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ЦБВПутиОстатки.ЦБ КАК ЦБ,
	|	ЦБВПутиОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЦБВПути.Остатки(&выбДата, ЦБ = &выбЦБ) КАК ЦБВПутиОстатки";
	
	Запрос.УстановитьПараметр("выбДата", Дата);
	Запрос.УстановитьПараметр("выбЦБ", ЦБ);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                  - выборка из результата запроса по шапке документа.
//	ВыборкаПоРаботники					     - выборка из результата запроса ТЧ "Работники".									
//  СтруктураПроведенияПоРегистрамНакопления - структура, содержащая имена регистров 
//                                             накопления по которым надо проводить документ
//  СтруктураПараметров                      - структура параметров проведения.
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(текДвижения, табЦБ, флДелатьДвиженияПоРегиструУслуг)
	
	Для Каждого СтрокаЦБ Из табЦБ Цикл
		
		Движение = текДвижения.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.СчетДепо = СтрокаЦБ.СчетДепо;
		Движение.РазделСчетаДепо = СтрокаЦБ.РазделСчетаДепо;
		Движение.ЦБ = СтрокаЦБ.ЦБ;
		Движение.СчетДепоМХ = СтрокаЦБ.СчетДепоМХ;
		Движение.РазделСчетаДепоМХ = СтрокаЦБ.РазделСчетаДепоМХ;
		
		Если текДвижения = Движения.ОстаткиЦБ Тогда
			
			Движение.СтатусЦБ = СтрокаЦБ.СтатусЦБ;
			
		КонецЕсли;
		
		Движение.Количество = СтрокаЦБ.КоличествоОстаток;
		
		Если флДелатьДвиженияПоРегиструУслуг Тогда
			
			ДепозитарийКлиент.СоздатьДвиженияДокумента(Дата,Движения,СтрокаЦБ.СчетДепо.Владелец,УслугаОперации,Тариф);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	табОстаткиЦБ = СформироватьЗапросПоРегиструОстаткиЦБ();
	табЦБВПути   = СформироватьЗапросПоРегиструЦБВПути();
	
	Если табОстаткиЦБ.Количество() = 0 И табЦБВПути.Количество() Тогда
		Сообщить("Указанных ценных бумаг нет ни на одном из счетов депо.");
		Отказ = Истина;
	КонецЕсли;
	
	флУслуги = Ложь;
	
	Если НЕ Отказ Тогда
		ДобавитьСтрокуВДвиженияПоРегистрамНакопления(Движения.ОстаткиЦБ, табОстаткиЦБ, флУслуги);
		ДобавитьСтрокуВДвиженияПоРегистрамНакопления(Движения.ЦБВПути, табЦБВПути, флУслуги);
	КонецЕсли;
	
	СформироватьВыпискиПоПогашениюЦБ();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(ЦБ) Тогда
		
		Сообщить("Не выбрана ценная бумаги");  
		Отказ = Истина;			
		
	КонецЕсли;	
	
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Инициатор) Тогда
		
		Сообщить("Не выбран эмитент");  
		Отказ = Истина;			
		
	КонецЕсли;	
	
	УстановитьНовыйНомер();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если Основание = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПроверкаНаСозданныеДокументыНаОснованииТекущего(Основание) Тогда
		Проверка = Истина;
		Сообщить("На основании данного поручения уже есть введенный документ!!!");
		Возврат;
	КонецЕсли;
	
	Если Основание.ВидОперацииД = Справочники.ВидыОпераций.Погашение
		ИЛИ Основание.ВидОперацииД = Справочники.ВидыОпераций.СписаниеАкцийПриЛиквидацииЭмитента
		ИЛИ Основание.ВидОперацииД = Справочники.ВидыОпераций.СписаниеОбесценившихсяЦенныхБумаг
		Тогда 
		Инициатор = Основание.Инициатор;
		ДокументОснование = Основание.Ссылка;			
		Комментарий = Строка(Основание);
		ЦБ = Основание.ЦБ;
		Дата = ОбщегоНазначения.ДатаДокумента(Основание);
		ЦенныеБумаги.Очистить();
		Для каждого СтрокаТаблицы Из Основание.ЦенныеБумагиСписываемые Цикл
			НоваяСтрока = ЦенныеБумаги.Добавить();
			НоваяСтрока.СчетДепо						= СтрокаТаблицы.СчетДепо;
			НоваяСтрока.Депонент						= СтрокаТаблицы.СчетДепо.Владелец;
			НоваяСтрока.РазделСчетаДепо					= СтрокаТаблицы.РазделСчетаДепо;
			НоваяСтрока.СчетДепоМестаХранения			= СтрокаТаблицы.СчетДепоМХ;
			НоваяСтрока.РазделСчетаДепоМестаХранения	= СтрокаТаблицы.РазделСчетаДепоМХ;
			НоваяСтрока.Количество						= СтрокаТаблицы.Количество;
		КонецЦикла;
	Иначе
		Проверка			= Истина;
		ДокументОснование 	= Документы.Поручение.ПустаяСсылка();			
		Сообщить("На основании данного вида поручения нельзя создать документ ""Погашение ценных бумаг"". 
				|Вид операции должен быть ""Погашение ЦБ"", ""Списание акций при ликвидации эмитента"""
				+ " или ""Списание обесценившихся ценных бумаг""!");
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Если Проверка Тогда
		Возврат;
	КонецЕсли;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

