
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Параметры.НастройкиАлгоритма)=Тип("Структура") тогда
		
		Настройки = Параметры.НастройкиАлгоритма;
		
		Если Настройки.Свойство("Значения") тогда
			Настройки.Значения.Свойство("СтавкаВознаграждения", Объект.СтавкаВознаграждения);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	
	Заголовок = "Расчет суммы вознаграждения за управление для Розничного ДУ.";
	ЗначениеВыбора = Новый Структура;
	ЗначениеВыбора.Вставить("Значения", ПодготовитьСтруктуруХранилища());
	ЗначениеВыбора.Вставить("ЗаголовокНастроек", Заголовок);
	
	ОповеститьОВыборе(ЗначениеВыбора);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПодготовитьСтруктуруХранилища()
	
	Значения = Новый Структура;
	Значения.Вставить("СтавкаВознаграждения", Объект.СтавкаВознаграждения);
	
	Возврат Значения;
	
Конецфункции

#КонецОбласти