#Область ПрограммныйИнтерфейс

// Возвращает список измененных ЦБ со всеми нобходимыми для экспорта во внешние системы реквизитами, в том числе
// хранящихся не в основном объекте, а в связанных регистрах.
// Параметры:
//	ДатаОтбора - Дата - Максимальные дата и время изменения (включительно) для отбираемых ЦБ. ЦБ измененные позже в возвращаемый
//						результат включены не будут.
// Возвращаемое значение:
//	 Структура - состоит из двух элементов типа ТаблицаЗначений: ЦенныеБумаги и Эмитенты
Функция ИзмененныеОбъекты(ДатаОтбора) Экспорт
	ИзмененныеОбъекты = ДанныеИзмененныхОбъектов(ДатаОтбора);
	
	КолонкиСоВложеннымиТаблицами = "Номиналы,Купоны";
	КолонкиНеДляХэша = "ЦБ,ЭмитентЮрЛицо,ВремяИзменения,СтарыйХешРеквизитов,НовыйХешРеквизитов,ЭтоДепозитарнаяРасписка";
	РассчитатьХэшиИзмененныхОбъектов(ИзмененныеОбъекты.ЦенныеБумаги, КолонкиНеДляХэша, КолонкиСоВложеннымиТаблицами);
	
	КолонкиСоВложеннымиТаблицами = "КонтактнаяИнформация,МеждународныеКомпании";
	КолонкиНеДляХэша = "Эмитент,ЦеннаяБумага,ВремяИзменения,СтарыйХешРеквизитов,НовыйХешРеквизитов,ОбработанВместеСЦеннойБумагой,Обработано";
	РассчитатьХэшиИзмененныхОбъектов(ИзмененныеОбъекты.Эмитенты, КолонкиНеДляХэша, КолонкиСоВложеннымиТаблицами);
	
	Возврат ИзмененныеОбъекты;
КонецФункции

// Выгружает в Kafka все ценные бумаги, у которых есть реальные изменения и вместе с ними их эмитентов
// Параметры:
//	ЦенныеБумаги - ТаблицаЗачений
//	Эмитенты - ТаблицаЗачений
//	ТолькоОбновлениеХэшей - Булево - необязательный параметр, при его наличии со значением Истина, не происходит реальной
//									выгрузки изменений в Kafka, но происходит перерасчет и обновление хэшей измененных
//									объектов в РС СтатусыОбъектовКОтправке, причем они получают статус обработанных.
Процедура ВыгрузитьЦенныеБумаги(ЦенныеБумаги, Эмитенты, ТолькоОбновлениеХэшей = Ложь) Экспорт
	Для каждого РеквизитыЦБ Из ЦенныеБумаги Цикл
		ОшибкаОбработки = Ложь;
		ОписаниеОшибки = "";
		Если Не ЗначениеЗаполнено(РеквизитыЦБ.ЭмитентЮрЛицо) Тогда
			ОшибкаОбработки = Истина;
			ОписаниеОшибки = "Для ценной бумаги не найден эмитент. ЦБ: " 
								+ РеквизитыЦБ.Name + " (ISIN: " + РеквизитыЦБ.ISIN + ")";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Иначе
			Если РеквизитыЦБ.ЕстьИзмененияХэша И Не ТолькоОбновлениеХэшей Тогда
				ВыгрузитьОднуЦБ(РеквизитыЦБ, Эмитенты, ОшибкаОбработки, ОписаниеОшибки);
			КонецЕсли;
		КонецЕсли;
		РегистрацияИзмененийДляВыгрузки.ЗавершитьОбработку(РеквизитыЦБ.ЦБ, РеквизитыЦБ.ВремяИзменения, 
															РеквизитыЦБ.НовыйХешРеквизитов, ОшибкаОбработки, ОписаниеОшибки);
	КонецЦикла;
КонецПроцедуры

// Выгружает в Kafka всех эмитентов, в у которых есть реальные изменения и которые еще не были выгружены ранее
// Параметры:
//	Эмитенты - ТаблицаЗачений
//	ТолькоОбновлениеХэшей - Булево - необязательный параметр, при его наличии со значением Истина, не происходит реальной
//									выгрузки изменений в Kafka, но происходит перерасчет и обновление хэшей измененных
//									объектов в РС СтатусыОбъектовКОтправке, причем они получают статус обработанных.
Процедура ВыгрузитьЭмитентов(Эмитенты, ТолькоОбновлениеХэшей) Экспорт
	Для каждого РеквизитыЭмитента Из Эмитенты Цикл
		Если Не РеквизитыЭмитента.ОбработанВместеСЦеннойБумагой Тогда
			ОшибкаОбработки = Ложь;
			ОписаниеОшибки = "";
			Если Не ЗначениеЗаполнено(РеквизитыЭмитента.ЦеннаяБумага) Тогда
				ОшибкаОбработки = Истина;
				ОписаниеОшибки = "Для эмитента не найдена ценная бумага. Эмитент: " 
									+ РеквизитыЭмитента.Name + " (Код RuData: " + РеквизитыЭмитента.RuDataCode + ")";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
			Иначе
				Если РеквизитыЭмитента.ЕстьИзмененияХэша И Не ТолькоОбновлениеХэшей Тогда
					ВыгрузитьЦеннуюБумагуИЭмитента(Неопределено, РеквизитыЭмитента, ОшибкаОбработки, ОписаниеОшибки);
				КонецЕсли;
			КонецЕсли;
			РегистрацияИзмененийДляВыгрузки.ЗавершитьОбработку(РеквизитыЭмитента.Эмитент, РеквизитыЭмитента.ВремяИзменения,
																РеквизитыЭмитента.НовыйХешРеквизитов, ОшибкаОбработки, ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ВыгрузитьОднуЦБ(РеквизитыЦБ, Эмитенты,  ОшибкаОбработки, ОписаниеОшибки)
	// С новыми ЦБ выгружаем эмитента всегда, даже если он был выгружен ранее и в нем нет изменений
	ВместеСЦеннойБумагой = Истина;
	РеквизитыЭмитента = РеквизитыЭмитента(РеквизитыЦБ.ЭмитентЮрЛицо, Эмитенты, ВместеСЦеннойБумагой);
	ВыгрузитьЦеннуюБумагуИЭмитента(РеквизитыЦБ, РеквизитыЭмитента, ОшибкаОбработки, ОписаниеОшибки);
	Если ЗначениеЗаполнено(РеквизитыЭмитента) И Не ОшибкаОбработки Тогда
		РеквизитыЭмитента.ОбработанВместеСЦеннойБумагой = Истина;
		РегистрацияИзмененийДляВыгрузки.ЗавершитьОбработку(РеквизитыЦБ.ЭмитентЮрЛицо, РеквизитыЭмитента.ВремяИзменения,
															РеквизитыЭмитента.НовыйХешРеквизитов, ОшибкаОбработки, ОписаниеОшибки);
	КонецЕсли;
КонецПроцедуры

// BSLLS:MethodSize-off
// BSLLS:AssignAliasFieldsInQuery-off		// (пришлось поставить из-за ложных срабатываний при использовании функци СОКРЛП в теле запроса

// Функция возвращает данные измененных (перезаписанных) ценных бумаг и эмитентов - юридических лиц.
// Параметры:
//	ДатаОтбора - Дата - Максимальные дата и время изменения (включительно) для отбираемых ЦБ. ЦБ измененные позже в возвращаемый
//						результат включены не будут.
// Возвращаемое значение:
//	 Структура - состоит из двух элементов типа ТаблицаЗначений: ЦенныеБумаги и Эмитенты
Функция ДанныеИзмененныхОбъектов(ДатаОтбора)
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	// Осторожно, в конце пакета в основном запросе по ЦБ и в запросах по связанной с ЦБ информации из вспомогательных
	// таблиц должна быть одинаковая сортировка по ЦБ. На это опирается алгоритм обработки результатов.
	// В основном запросе по ЮЛ и в запросах по связанной с ЮЛ информации из вспомогательных РС также должна быть
	// одинаковая сортировка по ЮЛ (на это опирается алгоритм обработки результатов запросов пакета).
	"/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|//												ИЗМЕНЕННЫЕ ОБЪЕКТЫ														//
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыОбъектовКОтправке.Объект КАК ЦБ,
	|	СтатусыОбъектовКОтправке.ВремяИзменения КАК ВремяИзменения,
	|	СтатусыОбъектовКОтправке.ХешРеквизитов КАК ХешРеквизитов,
	|	ЦенныеБумаги.Эмитент КАК ЭмитентКонтрагент,
	|	ЦенныеБумаги.БазовыйАктив КАК БазовыйАктив,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.ДепозитарнаяРасписка)
	|			ТОГДА ИСТИНА
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.АДР)
	|			ТОГДА ИСТИНА
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.ГДР)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоДепозитарнаяРасписка
	|ПОМЕСТИТЬ ВТ_ИзмененныеЦБ
	|ИЗ
	|	РегистрСведений.СтатусыОбъектовКОтправке КАК СтатусыОбъектовКОтправке
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО СтатусыОбъектовКОтправке.Объект = ЦенныеБумаги.Ссылка
	|ГДЕ
	|	СтатусыОбъектовКОтправке.Объект ССЫЛКА Справочник.ЦенныеБумаги
	|	И НЕ СтатусыОбъектовКОтправке.Обработано
	|	И СтатусыОбъектовКОтправке.ВремяИзменения <= &ДатаВремяОтбора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыОбъектовКОтправке.Объект КАК ЮЛ,
	|	СтатусыОбъектовКОтправке.ВремяИзменения КАК ВремяИзменения,
	|	СтатусыОбъектовКОтправке.ХешРеквизитов КАК ХешРеквизитов,
	|	СтатусыОбъектовКОтправке.Обработано КАК Обработано
	|ПОМЕСТИТЬ ВТ_ВсеНужныеЮЛ
	|ИЗ
	|	РегистрСведений.СтатусыОбъектовКОтправке КАК СтатусыОбъектовКОтправке
	|ГДЕ
	|	СтатусыОбъектовКОтправке.Объект ССЫЛКА Справочник.ЮридическиеЛица
	|	И НЕ СтатусыОбъектовКОтправке.Обработано
	|	И СтатусыОбъектовКОтправке.ВремяИзменения <= &ДатаВремяОтбора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЮридическиеЛица.Ссылка КАК ЮЛ,
	|	СтатусыОбъектовКОтправке.ВремяИзменения КАК ВремяИзменения,
	|	СтатусыОбъектовКОтправке.ХешРеквизитов КАК ХешРеквизитов,
	|	СтатусыОбъектовКОтправке.Обработано КАК Обработано
	|ИЗ ВТ_ИзмененныеЦБ
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|	ПО ВТ_ИзмененныеЦБ.ЭмитентКонтрагент = Контрагенты.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|	ПО Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОбъектовКОтправке КАК СтатусыОбъектовКОтправке
	|	ПО ЮридическиеЛица.Ссылка = СтатусыОбъектовКОтправке.Объект
	|ГДЕ
	|	НЕ ЮридическиеЛица.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеНужныеЮЛ.ЮЛ КАК ЮЛ,
	|	МАКСИМУМ(ВТ_ВсеНужныеЮЛ.ВремяИзменения) КАК ВремяИзменения,
	|	МАКСИМУМ(ВТ_ВсеНужныеЮЛ.ХешРеквизитов) КАК ХешРеквизитов,
	|	МАКСИМУМ(ВТ_ВсеНужныеЮЛ.Обработано) КАК Обработано
	|ПОМЕСТИТЬ ВТ_ИзмененныеЮЛ
	|ИЗ ВТ_ВсеНужныеЮЛ
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеНужныеЮЛ.ЮЛ
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|//												ПРОМЕЖУТОЧНЫЕ ДАННЫЕ													//
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИзмененныеЮЛ.ЮЛ КАК ЮЛ,
	|	МАКСИМУМ(ЦенныеБумаги.Ссылка) КАК ЛюбаяВыгруженнаяЦБЭтогоЭмитента
	|ПОМЕСТИТЬ ВТ_ЦБЭмитентов
	|ИЗ
	|	ВТ_ИзмененныеЮЛ КАК ВТ_ИзмененныеЮЛ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО Контрагенты.ЮридическиеФизическиеЛица = ВТ_ИзмененныеЮЛ.ЮЛ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ЦенныеБумаги.Эмитент = Контрагенты.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОбъектовКОтправке КАК СтатусыОбъектовКОтправке
	|		ПО СтатусыОбъектовКОтправке.Объект = ЦенныеБумаги.Ссылка
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ИзмененныеЮЛ.ЮЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеЦБ.ЦБ КАК ЦБ
	|ПОМЕСТИТЬ ВТ_ВсеЦБ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ИзмененныеЦБ.ЦБ КАК ЦБ
	|	ИЗ
	|		ВТ_ИзмененныеЦБ КАК ВТ_ИзмененныеЦБ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_ЦБЭмитентов.ЛюбаяВыгруженнаяЦБЭтогоЭмитента
	|	ИЗ
	|		ВТ_ЦБЭмитентов КАК ВТ_ЦБЭмитентов) КАК ВсеЦБ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеЦБ.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЦБ.ЦБ КАК ЦБ,
	|	СОКРЛП(МАКСИМУМ(КодыЗагрузки.Код)) КАК КодRuData
	|ПОМЕСТИТЬ ВТ_КодыЦБRuData
	|ИЗ
	|	ВТ_ВсеЦБ КАК ВТ_ВсеЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ВТ_ВсеЦБ.ЦБ = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.RuData))
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаНачалаДействия <= &ДатаОтбора
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузки.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия > &ДатаОтбора
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеЦБ.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИзмененныеЦБ.ЦБ КАК ЦБ,
	|	СОКРЛП(МАКСИМУМ(КодыЗагрузки.Код)) КАК КодRuData
	|ПОМЕСТИТЬ ВТ_БазовыхАктивовКодыRuData
	|ИЗ
	|	ВТ_ИзмененныеЦБ КАК ВТ_ИзмененныеЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ВТ_ИзмененныеЦБ.БазовыйАктив = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.RuData))
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаНачалаДействия <= &ДатаОтбора
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузки.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия > &ДатаОтбора
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИзмененныеЦБ.ЦБ
	|;
	| 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЦБ.ЦБ КАК ЦБ,
	|	СОКРЛП(МАКСИМУМ(КодыЗагрузки.Код)) КАК КодНРД
	|ПОМЕСТИТЬ ВТ_КодыЦБНРД
	|ИЗ
	|	ВТ_ВсеЦБ КАК ВТ_ВсеЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ВТ_ВсеЦБ.ЦБ = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.NrdCode))
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаНачалаДействия <= &ДатаОтбора
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузки.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия > &ДатаОтбора
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеЦБ.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоминалЦБСрезПоследних.ЦеннаяБумага КАК ЦБ,
	|	НоминалЦБСрезПоследних.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ТекущиеНоминалыЦБ
	|ИЗ
	|	РегистрСведений.НоминалЦБ.СрезПоследних(
	|			&ДатаОтбора,
	|			ЦеннаяБумага В
	|				(ВЫБРАТЬ
	|					ВТ_ИзмененныеЦБ.ЦБ КАК ЦБ
	|				ИЗ
	|					ВТ_ИзмененныеЦБ КАК ВТ_ИзмененныеЦБ)) КАК НоминалЦБСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоминалЦБСрезПоследних.ЦеннаяБумага КАК ЦБ,
	|	НоминалЦБСрезПоследних.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_НачальныеНоминалыЦБ
	|ИЗ
	|	РегистрСведений.НоминалЦБ.СрезПервых(
	|			,
	|			ЦеннаяБумага В
	|				(ВЫБРАТЬ
	|					ВТ_ИзмененныеЦБ.ЦБ КАК ЦБ
	|				ИЗ
	|					ВТ_ИзмененныеЦБ КАК ВТ_ИзмененныеЦБ)) КАК НоминалЦБСрезПоследних
	|;
	| 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИзмененныеЦБ.ЦБ КАК ЦБ,
	|	Контрагенты.ЮридическиеФизическиеЛица КАК ЭмитентЮрЛицо
	|ПОМЕСТИТЬ ВТ_ВыгружаемыеЭмитентыЦБ
	|ИЗ
	|	ВТ_ИзмененныеЦБ КАК ВТ_ИзмененныеЦБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_ИзмененныеЦБ.ЭмитентКонтрагент = Контрагенты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОбъектовКОтправке КАК СтатусыОбъектовКОтправке
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = СтатусыОбъектовКОтправке.Объект)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИзмененныеЮЛ.ЮЛ КАК ЮЛ,
	|	МАКСИМУМ(КлассификаторСекторов.Код) КАК КодСектораЭкономики
	|ПОМЕСТИТЬ ВТ_КодыСекторовЭкономики
	|ИЗ
	|	ВТ_ИзмененныеЮЛ КАК ВТ_ИзмененныеЮЛ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|	ПО Контрагенты.ЮридическиеФизическиеЛица = ВТ_ИзмененныеЮЛ.ЮЛ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСекторовЭкономикиДляИностранныхЭмитентов КАК КлассификаторСекторов
	|	ПО Контрагенты.СекторЭкономикиИностранногоЭмитента = КлассификаторСекторов.Ссылка
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ИзмененныеЮЛ.ЮЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИзмененныеЮЛ.ЮЛ КАК ЮЛ,
	|	СОКРЛП(МАКСИМУМ(КодыЗагрузки.Код)) КАК КодRuData
	|ПОМЕСТИТЬ ВТ_КодыЮЛRuData
	|ИЗ
	|	ВТ_ИзмененныеЮЛ КАК ВТ_ИзмененныеЮЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ВТ_ИзмененныеЮЛ.ЮЛ = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.RuData))
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаНачалаДействия <= &ДатаОтбора
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузки.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия > &ДатаОтбора
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИзмененныеЮЛ.ЮЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИзмененныеЮЛ.ЮЛ КАК ЮЛ,
	|	СОКРЛП(МАКСИМУМ(КодыЗагрузки.Код)) КАК КодНРД
	|ПОМЕСТИТЬ ВТ_КодыЮЛНРД
	|ИЗ
	|	ВТ_ИзмененныеЮЛ КАК ВТ_ИзмененныеЮЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ВТ_ИзмененныеЮЛ.ЮЛ = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.NrdCode))
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаНачалаДействия <= &ДатаОтбора
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузки.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия > &ДатаОтбора
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИзмененныеЮЛ.ЮЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИзмененныеЮЛ.ЮЛ КАК ЮЛ,
	|	СОКРЛП(МАКСИМУМ(КодыЗагрузки.Код)) КАК КодLEI
	|ПОМЕСТИТЬ ВТ_КодыЮЛLEI
	|ИЗ
	|	ВТ_ИзмененныеЮЛ КАК ВТ_ИзмененныеЮЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ВТ_ИзмененныеЮЛ.ЮЛ = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.LEI_Code))
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаНачалаДействия <= &ДатаОтбора
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузки.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия > &ДатаОтбора
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИзмененныеЮЛ.ЮЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЮрЛицаМКСрезПоследних.ЮридическоеЛицо КАК ЮридическоеЛицо,
	|	ЮрЛицаМКСрезПоследних.МеждународнаяКомпания КАК ЭтоМК
	|ПОМЕСТИТЬ ВТ_МеждународныеКомпании
	|ИЗ
	|	РегистрСведений.ЮридическиеЛицаМеждународныеКомпании.СрезПоследних(&ДатаОтбора, 1=1) КАК ЮрЛицаМКСрезПоследних
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|//												РЕКВИЗИТЫ ЦЕННЫХ БУМАГ													//
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	// Служебная информация
	|	ВТ_ИзмененныеЦБ.ЦБ КАК ЦБ,
	|	ВТ_ВыгружаемыеЭмитентыЦБ.ЭмитентЮрЛицо КАК ЭмитентЮрЛицо,
	|	ВТ_ИзмененныеЦБ.ВремяИзменения КАК ВремяИзменения,
	|	ВТ_ИзмененныеЦБ.ХешРеквизитов КАК СтарыйХешРеквизитов,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(128)) КАК НовыйХешРеквизитов,	// Заполним при обработке результатов запроса
	|	ЛОЖЬ КАК ЕстьИзмененияХэша,								// Рассчитаем при обработке результатов запроса
	|	ВТ_ИзмененныеЦБ.ЭтоДепозитарнаяРасписка КАК ЭтоДепозитарнаяРасписка,
	|	ЦенныеБумаги.КупоннаяОблигация КАК ЭтоКупоннаяОблигация,
	|
	|	// 1. Блок 'Asset' ------------------------------------------
	|	ISNULL(ВТ_КодыЦБНРД.КодНРД, """") КАК AssetCode,
	|	ЦенныеБумаги.ISIN КАК Isin,
	|	ЦенныеБумаги.НомерРегистрации КАК RegNum,
	|	ISNULL(ВТ_КодыЦБRuData.КодRuData, """") КАК RuDataCode,
	|
	|	// 2. Блок 'SecurityMainData' -------------------------------
	|	ЦенныеБумаги.Наименование КАК Name,
	|	ЦенныеБумаги.ПолноеНаименование КАК FullName,
	|	ЦенныеБумаги.АнглийскоеНаименование КАК NameEng,
	|	ЦенныеБумаги.CFI КАК CFI,
	|	СОКРЛП(ISNULL(ВалютыНоминала.Код, """")) КАК CurrencyCode,
	|	ЦенныеБумаги.ТипНоминала КАК NominalType,
	|	ЦенныеБумаги.ИндексируемыйНоминал КАК IndexedNominal,
	|	ISNULL(ВТ_ТекущиеНоминалыЦБ.Сумма, 0) КАК ResidualNominal,
	|	ISNULL(ВТ_НачальныеНоминалыЦБ.Сумма, 0) КАК IssueNominal,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Акция)
	|			ТОГДА ""STOCK""
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
	|			ТОГДА ""BOND""
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Вексель)
	|			ТОГДА ""BILL""
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.АДР)
	|			ТОГДА ""ADR""
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.ГДР)
	|			ТОГДА ""GDR""
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.ДепозитныйСертификат)
	|			ТОГДА ""DEPOSERT""
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Пай)
	|			ТОГДА ""SHARE""
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Золото)
	|			ТОГДА ""GOLD""
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Прочие)
	|			ТОГДА ""OTHER""
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.ДепозитарнаяРасписка)
	|			ТОГДА ""DR""
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.КлиринговыйСертификатУчастия)
	|			ТОГДА ""CLEARSERT""
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Варрант)
	|			ТОГДА ""WARRANT""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК TypeCode,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыАкций.Привилегированная)
	|			ТОГДА ""PRIVILEGE""
	|		КОГДА ЦенныеБумаги.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыАкций.Обыкновенная)
	|			ТОГДА ""ORDINARY""
	|		КОГДА ЦенныеБумаги.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыОблигаций.Государственная)
	|			ТОГДА ""STATE""
	|		КОГДА ЦенныеБумаги.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыОблигаций.Корпоративная)
	|			ТОГДА ""CORP""
	|		КОГДА ЦенныеБумаги.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхРасписок.РоссийскаяДепозитарнаяРасписка)
	|			ТОГДА ""RDR""
	|		КОГДА ЦенныеБумаги.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхРасписок.АмериканскаяДепозитарнаяРасписка)
	|			ТОГДА ""ADR""
	|		КОГДА ЦенныеБумаги.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхРасписок.ГлобальнаяДепозитарнаяРасписка)
	|			ТОГДА ""GDR""
	|		КОГДА ЦенныеБумаги.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхРасписок.ЕвропейскаяДепозитарнаяРасписка)
	|			ТОГДА ""EDR""
	|		КОГДА ЦенныеБумаги.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыПаев.Биржевой)
	|			ТОГДА ""STOCK""
	|		КОГДА ЦенныеБумаги.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыПаев.Закрытый)
	|			ТОГДА ""CLOSE""
	|		КОГДА ЦенныеБумаги.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыПаев.Интервальный)
	|			ТОГДА ""INTERVAL""
	|		КОГДА ЦенныеБумаги.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыПаев.НеОпределен)
	|			ТОГДА ""OTHER""
	|		КОГДА ЦенныеБумаги.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыПаев.Открытый)
	|			ТОГДА ""OPEN""
	|		КОГДА ЦенныеБумаги.ВидЦБ = ЗНАЧЕНИЕ(Перечисление.ВидыПаев.ПайАкцияИнвестиционногоФонда)
	|			ТОГДА ""INVESTFUND""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК KindCode,
	|	ISNULL(ВидыЦББанкаРоссии.Код, """") КАК KindCodeBankRussia,
	|	ЦенныеБумаги.НаименованиеВыпуска КАК IssueName,
	|	ЦенныеБумаги.ДатаГосРег КАК IssueRegDate,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ФормаВыпуска = ЗНАЧЕНИЕ(Перечисление.ФормаВыпускаЦБ.Бездокументарная)
	|			ТОГДА ""NODOC""
	|		КОГДА ЦенныеБумаги.ФормаВыпуска = ЗНАЧЕНИЕ(Перечисление.ФормаВыпускаЦБ.Документарная)
	|			ТОГДА ""DOC""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК IssueFormCode,
	|	ЦенныеБумаги.ВидВыпуска КАК IssueKind,
	|	ЦенныеБумаги.ТипВыпуска КАК IssueType,
	|	ЦенныеБумаги.ДатаРазмещения КАК PlacementDateStart,
	|	ЦенныеБумаги.ОбъемРазмещения КАК PlacementVolume,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.УдостоверениеПравообладания = ЗНАЧЕНИЕ(Перечисление.ФормаУдостоверенияПравообладания.НаПредъявителя)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК IsRegisteredBearer,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ТипЦБ В (&ВсеТипыДепозитарныхРасписок)
	|			ТОГДА ISNULL(ВТ_БазовыхАктивовКодыRuData.КодRuData, """")
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК BasicAsset,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ТипЦБ В (&ВсеТипыДепозитарныхРасписок)
	|			ТОГДА ВЫБОР
	|					КОГДА ЦенныеБумаги.Числитель <> 0
	|						ТОГДА ЦенныеБумаги.Знаменатель / ЦенныеБумаги.Числитель
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК BasicAssetSize,
	|	ЦенныеБумаги.Дробная КАК IsPart,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.НФИ = 1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Nfi,
	|	ЦенныеБумаги.ДляКвалифицированныхИнвесторов КАК IsForQualInvestor,
	|	ЦенныеБумаги.Ликвидная КАК IsLiquid,
	|	ЦенныеБумаги.Дефолтная КАК IsDefault,
	|	ЦенныеБумаги.ДатаДефолта КАК DefaultDate,
	|	СОКРЛП(ISNULL(СтраныНалогообложения.КодАльфа2, """")) КАК TaxCountryCode,
	|	ЦенныеБумаги.СтавкаНалога КАК TaxRate,
	|	ЦенныеБумаги.ДатаПогашения КАК CancelDate,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ПодвидОблигаций = ЗНАЧЕНИЕ(Перечисление.ПодвидыОблигаций.РФ)
	|			ТОГДА ""STATE""
	|		КОГДА ЦенныеБумаги.ПодвидОблигаций = ЗНАЧЕНИЕ(Перечисление.ПодвидыОблигаций.СубъектовРФ)
	|			ТОГДА ""REGION""
	|		КОГДА ЦенныеБумаги.ПодвидОблигаций = ЗНАЧЕНИЕ(Перечисление.ПодвидыОблигаций.Муниципальная)
	|			ТОГДА ""MUNICIPAL""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК BondTypeCode,
	|	ЦенныеБумаги.АмортизационнаяЦБ КАК isAmortisation,
	|	ЦенныеБумаги.ДополнительныеСведения КАК IssueDocsAddInfo,
	|	ЦенныеБумаги.НазваниеРеальногоЭмитента КАК RealIssueName,
	|	СОКРЛП(ISNULL(СтраныРеальногоЭмитента.КодАльфа2, """")) КАК RealIssueCountryCode,
	|	СОКРЛП(ISNULL(СтраныНахожденияАктивовРеальногоЭмитента.КодАльфа2, """")) КАК RealIssueAssetsCountryCode,
	|	ЦенныеБумаги.КвазироссийскаяЦБ КАК IsQuasiRussian,
	|	ISNULL(ЦенныеБумагиМестаХранения.ОсновноеМестоХранения, ЛОЖЬ) КАК IsMainStoragePlace,
	|	ISNULL(ЦенныеБумагиМестаХранения.МестоХранения.Наименование, """") КАК StoragePlace,
	|	ISNULL(ЦенныеБумагиМестаХранения.КодХранения, """") КАК StoragePlaceCode,
	|	ЦенныеБумаги.ДатаВключенияВПереченьБумагВИСЭ КАК InnovativeSectorListDateStart,
	|	ЦенныеБумаги.ДатаИсключенияИзПеречняБумагВИСЭ КАК InnovativeSectorListDateEnd,
	|	ЦенныеБумаги.СтатусRuData КАК StatusRuData,
	|	СОКРЛП(ISNULL(Страны.КодАльфа2, """")) КАК CountryCode,
	|	ЦенныеБумаги.ЦБДопущенаКТоргамВРФ КАК IsAdmittedTradingInRF,
	|
	|	// 3. Блок 'CouponMainData'----------------------------------
	|	СОКРЛП(ISNULL(ВалютыКупона.Код, """")) КАК CouponCurrencyCode,  // В JSON это будет просто CurrencyCode, что с CurrencyCode из блока 'Asset' не конфликтует - разные блоки
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ПериодПогашенияКупона = ЗНАЧЕНИЕ(Перечисление.ВариантыНачисленияКомиссий.Год)
	|			ТОГДА ""YEAR""
	|		КОГДА ЦенныеБумаги.ПериодПогашенияКупона = ЗНАЧЕНИЕ(Перечисление.ВариантыНачисленияКомиссий.День)
	|			ТОГДА ""DAY""
	|		КОГДА ЦенныеБумаги.ПериодПогашенияКупона = ЗНАЧЕНИЕ(Перечисление.ВариантыНачисленияКомиссий.Квартал)
	|			ТОГДА ""QUARTER""
	|		КОГДА ЦенныеБумаги.ПериодПогашенияКупона = ЗНАЧЕНИЕ(Перечисление.ВариантыНачисленияКомиссий.Месяц)
	|			ТОГДА ""MONTH""
	|		КОГДА ЦенныеБумаги.ПериодПогашенияКупона = ЗНАЧЕНИЕ(Перечисление.ВариантыНачисленияКомиссий.Полугодие)
	|			ТОГДА ""HALFYEAR""
	|		КОГДА ЦенныеБумаги.ПериодПогашенияКупона = ЗНАЧЕНИЕ(Перечисление.ВариантыНачисленияКомиссий.ПоПоручению)
	|			ТОГДА ""ORDER""
	|		КОГДА ЦенныеБумаги.ПериодПогашенияКупона = ЗНАЧЕНИЕ(Перечисление.ВариантыНачисленияКомиссий.ПроизвольнаяПериодичность)
	|			ТОГДА ""PERIOD""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК RepaymentPeriod,
	|	ЦенныеБумаги.ПроцентКупона КАК Percent,
	|	ЦенныеБумаги.КупоновВГод КАК CouponsByYear,
	|	ЦенныеБумаги.РазрядностьНКД КАК DecimalPlaces,
	|	ЦенныеБумаги.БазисРасчетаНКД КАК NkdCalcBasis
	|
	|ИЗ
	|	ВТ_ИзмененныеЦБ КАК ВТ_ИзмененныеЦБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ВТ_ИзмененныеЦБ.ЦБ = ЦенныеБумаги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыЦБRuData КАК ВТ_КодыЦБRuData
	|		ПО ВТ_ИзмененныеЦБ.ЦБ = ВТ_КодыЦБRuData.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БазовыхАктивовКодыRuData КАК ВТ_БазовыхАктивовКодыRuData
	|		ПО ВТ_ИзмененныеЦБ.ЦБ = ВТ_БазовыхАктивовКодыRuData.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыЦБНРД КАК ВТ_КодыЦБНРД
	|		ПО ВТ_ИзмененныеЦБ.ЦБ = ВТ_КодыЦБНРД.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыгружаемыеЭмитентыЦБ КАК ВТ_ВыгружаемыеЭмитентыЦБ
	|		ПО ВТ_ИзмененныеЦБ.ЦБ = ВТ_ВыгружаемыеЭмитентыЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыНоминала
	|		ПО ЦенныеБумаги.ВалютаНоминала = ВалютыНоминала.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыКупона
	|		ПО ЦенныеБумаги.ВалютаКупона = ВалютыКупона.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеНоминалыЦБ КАК ВТ_ТекущиеНоминалыЦБ
	|		ПО ВТ_ИзмененныеЦБ.ЦБ = ВТ_ТекущиеНоминалыЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НачальныеНоминалыЦБ КАК ВТ_НачальныеНоминалыЦБ
	|		ПО ВТ_ИзмененныеЦБ.ЦБ = ВТ_НачальныеНоминалыЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦББанкаРоссии КАК ВидыЦББанкаРоссии
	|		ПО ЦенныеБумаги.ВидЦББанкаРоссии = ВидыЦББанкаРоссии.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК Страны
	|		ПО ЦенныеБумаги.Страна = Страны.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК СтраныНалогообложения
	|		ПО ЦенныеБумаги.СтранаНалогообложения = СтраныНалогообложения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК СтраныРеальногоЭмитента
	|		ПО ЦенныеБумаги.СтранаРеальногоЭмитента = СтраныРеальногоЭмитента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК СтраныНахожденияАктивовРеальногоЭмитента
	|		ПО ЦенныеБумаги.СтранаНахожденияАктивовРеальногоЭмитента = СтраныНахожденияАктивовРеальногоЭмитента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги.МестаХранения КАК ЦенныеБумагиМестаХранения
	|			ПО ВТ_ИзмененныеЦБ.ЦБ = ЦенныеБумагиМестаХранения.Ссылка
	|				И ЦенныеБумагиМестаХранения.НомерСтроки = 1
	|
	|// Осторожно, в основном запросе по ЦБ и в запросах по связанной с ЦБ информации из вспомогательных таблиц (см. ниже)
	|// должна быть одинаковая сортировка по ЦБ. На это опирается алгоритм обработки результатов.
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ИзмененныеЦБ.ЭтоДепозитарнаяРасписка,
	|	ВТ_ИзмененныеЦБ.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	// 4. Блок 'SecurityNominalData' ----------------------------
	|	НоминалЦБ.ЦеннаяБумага КАК ЦБ,
	|	НоминалЦБ.Период КАК DateStart,
	|	НоминалЦБ.Сумма КАК Value
	|ИЗ
	|	РегистрСведений.НоминалЦБ КАК НоминалЦБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИзмененныеЦБ КАК ВТ_ИзмененныеЦБ
	|			ПО НоминалЦБ.ЦеннаяБумага = ВТ_ИзмененныеЦБ.ЦБ
	|
	|// Осторожно, в основном запросе по ЦБ и в запросах по связанной с ЦБ информации из вспомогательных таблиц
	|// должна быть одинаковая сортировка по ЦБ. На это опирается алгоритм обработки результатов.
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ИзмененныеЦБ.ЭтоДепозитарнаяРасписка,
	|	ВТ_ИзмененныеЦБ.ЦБ,
	|	НоминалЦБ.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	// 5. Блок 'SecurityCouponData' -----------------------------
	|	Купоны.Ссылка КАК ЦБ,
	|	Купоны.НомерКупона КАК Number,
	|	Купоны.ДатаВыпуска КАК IssueDate,
	|	Купоны.ДатаПогашения КАК CancelDate,
	|	Купоны.Купон КАК Coupon,
	|	Купоны.СрокОбращения КАК CirculationPeriod,
	|	Купоны.Сумма КАК Amount,
	|	Купоны.Ставка КАК Rate,
	|	Купоны.ДатаФиксацииСписка КАК ListFixDate,
	|	Купоны.Комментарий КАК Comment
	|ИЗ
	|	Справочник.ЦенныеБумаги.Купоны КАК Купоны
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИзмененныеЦБ КАК ВТ_ИзмененныеЦБ
	|			ПО Купоны.Ссылка = ВТ_ИзмененныеЦБ.ЦБ
	|
	|// Осторожно, в основном запросе по ЦБ и в запросах по связанной с ЦБ информации из вспомогательных таблиц
	|// должна быть одинаковая сортировка по ЦБ. На это опирается алгоритм обработки результатов.
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ИзмененныеЦБ.ЭтоДепозитарнаяРасписка,
	|	ВТ_ИзмененныеЦБ.ЦБ,
	|	Купоны.НомерКупона
	|;
	|
	|
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|//													РЕКВИЗИТЫ ЭМИТЕНТОВ													//
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	// Служебная информация
	|	ВТ_ИзмененныеЮЛ.ЮЛ КАК Эмитент,
	|	ВТ_ЦБЭмитентов.ЛюбаяВыгруженнаяЦБЭтогоЭмитента КАК ЦеннаяБумага,
	|	ВТ_ИзмененныеЮЛ.Обработано КАК Обработано,
	|	ВТ_ИзмененныеЮЛ.ВремяИзменения КАК ВремяИзменения,
	|	ВТ_ИзмененныеЮЛ.ХешРеквизитов КАК СтарыйХешРеквизитов,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(128)) КАК НовыйХешРеквизитов,	// Заполним при обработке результатов запроса
	|	ЛОЖЬ КАК ЕстьИзмененияХэша,								// Рассчитаем при обработке результатов запроса
	|	ЛОЖЬ КАК ОбработанВместеСЦеннойБумагой,
	|
	|	// 1. Блок 'Asset' ------------------------------------------
	|	ISNULL(ВТ_КодыЦБНРД.КодНРД, """") КАК AssetCode,
	|	ЦенныеБумаги.ISIN КАК AssetIsin,
	|	ЦенныеБумаги.НомерРегистрации КАК AssetRegNum,
	|	ISNULL(ВТ_КодыЦБRuData.КодRuData, """") КАК AssetRuDataCode,
	|
	|	// 6. Блок 'EmitentMainData' ---------------------------
	|	ISNULL(ВТ_КодыЮЛRuData.КодRuData, """") КАК RuDataCode,
	|	ISNULL(ВТ_КодыЮЛНРД.КодНРД, """") КАК NrdCode,
	|	ISNULL(ВТ_КодыЮЛLEI.КодLEI, """") КАК LeiCode,
	|	ЮридическиеЛица.Наименование КАК Name,
	|	ЮридическиеЛица.ПолноеНаименование КАК FullName,
	|	ЮридическиеЛица.ПолноеНаименованиеНаАнглийскомЯзыке КАК FullNameEng,
	|	ЮридическиеЛица.ИНН КАК Inn,
	|	ЮридическиеЛица.TIN КАК Tin,
	|	ЮридическиеЛица.КодПоОКПО КАК Okpo,
	|	ЮридическиеЛица.КПП КАК Kpp,
	|	ЮридическиеЛица.ОГРН КАК Ogrn,
	|	ЮридическиеЛица.КодПоОКОНХ КАК Okonh,
	|	ЮридическиеЛица.КодПоОКВЭД КАК Okved,
	|	ЮридическиеЛица.ОКОГУ КАК Okogu,
	|	ЮридическиеЛица.ОКФС КАК Okfs,
	|	ЮридическиеЛица.ОКОПФ КАК Okopf,
	|	ЮридическиеЛица.ДатаГосРегистрации КАК GovRegDate,
	|	ЮридическиеЛица.МестоГосРегистрации КАК GovRegPlace,
	|	ЮридическиеЛица.РегНомер КАК RegNumber,
	|	ЮридическиеЛица.РегистрирующийОрган КАК RegAuthority,
	|	ЮридическиеЛица.ДатаВнесенияВЕГРЮЛ КАК EgrulEntryDate,
	|	ЮридическиеЛица.НеРезидент КАК isNotTaxResident,
	|	СОКРЛП(ISNULL(Страны.КодАльфа2, """")) КАК CountryCode,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВТ_МеждународныеКомпании.ЭтоМК, Ложь) 
	|			ТОГДА ЮридическиеЛица.МеждународнаяОрганизация
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК IsInternationalOrganization,
	|	ЮридическиеЛица.КредитнаяОрганизация КАК IsCreditOrganization,
	|	ISNULL(ВТ_КодыСекторовЭкономики.КодСектораЭкономики, """") КАК EconomicSectorCode
	|ИЗ
	|	ВТ_ИзмененныеЮЛ КАК ВТ_ИзмененныеЮЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦБЭмитентов КАК ВТ_ЦБЭмитентов
	|		ПО ВТ_ИзмененныеЮЛ.ЮЛ = ВТ_ЦБЭмитентов.ЮЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ВТ_ЦБЭмитентов.ЛюбаяВыгруженнаяЦБЭтогоЭмитента = ЦенныеБумаги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыЦБRuData КАК ВТ_КодыЦБRuData
	|		ПО ВТ_ЦБЭмитентов.ЛюбаяВыгруженнаяЦБЭтогоЭмитента = ВТ_КодыЦБRuData.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыЦБНРД КАК ВТ_КодыЦБНРД
	|		ПО ВТ_ЦБЭмитентов.ЛюбаяВыгруженнаяЦБЭтогоЭмитента = ВТ_КодыЦБНРД.ЦБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО ВТ_ИзмененныеЮЛ.ЮЛ = ЮридическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыЮЛRuData КАК ВТ_КодыЮЛRuData
	|		ПО ВТ_ИзмененныеЮЛ.ЮЛ = ВТ_КодыЮЛRuData.ЮЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыЮЛНРД КАК ВТ_КодыЮЛНРД
	|		ПО ВТ_ИзмененныеЮЛ.ЮЛ = ВТ_КодыЮЛНРД.ЮЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыЮЛLEI КАК ВТ_КодыЮЛLEI
	|		ПО ВТ_ИзмененныеЮЛ.ЮЛ = ВТ_КодыЮЛLEI.ЮЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК Страны
	|		ПО ЮридическиеЛица.Страна = Страны.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыСекторовЭкономики КАК ВТ_КодыСекторовЭкономики
	|		ПО ВТ_ИзмененныеЮЛ.ЮЛ = ВТ_КодыСекторовЭкономики.ЮЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МеждународныеКомпании КАК ВТ_МеждународныеКомпании
	|		ПО ВТ_ИзмененныеЮЛ.ЮЛ = ВТ_МеждународныеКомпании.ЮридическоеЛицо
	|
	|// Осторожно, в основном запросе по ЮЛ и в запросах по связанной с ЮЛ информации из вспомогательных РС (см. ниже)
	|// должна быть одинаковая сортировка по ЮЛ (на это опирается алгоритм обработки результатов)
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ИзмененныеЮЛ.ЮЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	// 7. Блок 'EmitentContactData' ------------------------
	|	КонтактнаяИнформацияСрезПоследних.Объект КАК Эмитент,
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформацияСрезПоследних.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|			ТОГДА ""ADDRESS""
	|		КОГДА КонтактнаяИнформацияСрезПоследних.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|			ТОГДА ""PHONE""
	|		КОГДА КонтактнаяИнформацияСрезПоследних.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|			ТОГДА ""EMAIL""
	|		КОГДА КонтактнаяИнформацияСрезПоследних.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ВебСтраница)
	|			ТОГДА ""WEB""
	|		КОГДА КонтактнаяИнформацияСрезПоследних.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Другое)
	|			ТОГДА ""OTHER""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ContactInfoTypeCode,
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформацияСрезПоследних.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailЮрЛица)
	|			ТОГДА ""EMAIL""
	|		КОГДА КонтактнаяИнформацияСрезПоследних.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ВебСтраница)
	|			ТОГДА ""WEB""
	|		КОГДА КонтактнаяИнформацияСрезПоследних.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮрлицаПочтовый)
	|			ТОГДА ""POST""
	|		КОГДА КонтактнаяИнформацияСрезПоследних.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресЮрЛица)
	|			ТОГДА ""FACT""
	|		КОГДА КонтактнаяИнформацияСрезПоследних.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресЮрЛица)
	|			ТОГДА ""LEG""
	|		КОГДА КонтактнаяИнформацияСрезПоследних.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонЮрЛица)
	|			ТОГДА ""MOBILE""
	|		КОГДА КонтактнаяИнформацияСрезПоследних.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксЮрЛица)
	|			ТОГДА ""OTHER""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ContactInfoKindCode,
	|	КонтактнаяИнформацияСрезПоследних.Представление КАК Value,
	|	КонтактнаяИнформацияСрезПоследних.Период КАК DateStart
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			&ДатаОтбора,
	|			Объект В
	|				(ВЫБРАТЬ
	|					ВТ_ИзмененныеЮЛ.ЮЛ КАК ЮЛ
	|				ИЗ
	|					ВТ_ИзмененныеЮЛ КАК ВТ_ИзмененныеЮЛ)) КАК КонтактнаяИнформацияСрезПоследних
	|
	|
	|// Осторожно, в основном запросе по ЮЛ и в запросах по связанной с ЮЛ информации из вспомогательных РС 
	|// должна быть одинаковая сортировка по ЮЛ (на это опирается алгоритм обработки результатов)
	|УПОРЯДОЧИТЬ ПО
	|	КонтактнаяИнформацияСрезПоследних.Объект,
	|	КонтактнаяИнформацияСрезПоследних.Тип,
	|	КонтактнаяИнформацияСрезПоследних.Вид,
	|	КонтактнаяИнформацияСрезПоследних.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	// 7. Блок 'EmitentPeriodICData' -----------------------
	|	ЮридическиеЛицаМеждународныеКомпании.ЮридическоеЛицо КАК Эмитент,
	|	ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания КАК IsInternationalCompany,
	|	ЮридическиеЛицаМеждународныеКомпании.Период КАК DateStart
	|ИЗ
	|	ВТ_ИзмененныеЮЛ КАК ВТ_ИзмененныеЮЛ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЮридическиеЛицаМеждународныеКомпании КАК ЮридическиеЛицаМеждународныеКомпании
	|	ПО ВТ_ИзмененныеЮЛ.ЮЛ = ЮридическиеЛицаМеждународныеКомпании.ЮридическоеЛицо
	|
	|// Осторожно, в основном запросе по ЮЛ и в запросах по связанной с ЮЛ информации из вспомогательных РС 
	|// должна быть одинаковая сортировка по ЮЛ (на это опирается алгоритм обработки результатов)
	|УПОРЯДОЧИТЬ ПО
	|	ЮридическиеЛицаМеждународныеКомпании.ЮридическоеЛицо,
	|	ЮридическиеЛицаМеждународныеКомпании.Период
	|";
	Запрос.УстановитьПараметр("ДатаВремяОтбора", ДатаОтбора);
	Запрос.УстановитьПараметр("ДатаОтбора", НачалоДня(ДатаОтбора));
	Запрос.УстановитьПараметр("ВсеТипыДепозитарныхРасписок", Перечисления.ТипыЦБ.ВсеТипыДепозитарныхРасписок());
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	ИзмененныеОбъекты = ИзмененныеОбъектыИзДанныхЗапросов(РезультатыЗапросов);
	
	Возврат ИзмененныеОбъекты;
КонецФункции
// BSLLS:AssignAliasFieldsInQuery-on
// BSLLS:MethodSize-on

Функция ИзмененныеОбъектыИзДанныхЗапросов(РезультатыЗапросов)
	ИндексЗапросаПоМеждународнымКомпаниям = РезультатыЗапросов.Количество() - 1;
	ИндексЗапросаПоКонтактнойИнформации = ИндексЗапросаПоМеждународнымКомпаниям - 1;
	ИндексОсновногоЗапросаПоЭмитентам = ИндексЗапросаПоКонтактнойИнформации - 1;
	ИндексЗапросаПоКупонам = ИндексОсновногоЗапросаПоЭмитентам - 1;
	ИндексЗапросаПоНоминаламЦБ = ИндексЗапросаПоКупонам - 1;
	ИндексОсновногоЗапросаПоЦБ = ИндексЗапросаПоНоминаламЦБ - 1;
	
	РезультатЗапросаЦБ = РезультатыЗапросов[ИндексОсновногоЗапросаПоЦБ];
	РезультатЗапросаНоминалы = РезультатыЗапросов[ИндексЗапросаПоНоминаламЦБ];
	РезультатЗапросаКупоны = РезультатыЗапросов[ИндексЗапросаПоКупонам];
	ЦенныеБумаги = РезультатЗапросаЦБ.Выгрузить();
	Номиналы = РезультатЗапросаНоминалы.Выгрузить();
	Купоны = РезультатЗапросаКупоны.Выгрузить();
	СобратьВсеДанныеОЦенныхБумагахВОсновнуюТаблицу(ЦенныеБумаги, Номиналы, Купоны);
	
	РезультатЗапросаЭмитенты = РезультатыЗапросов[ИндексОсновногоЗапросаПоЭмитентам];
	РезультатЗапросаКонтактнаяИнформация = РезультатыЗапросов[ИндексЗапросаПоКонтактнойИнформации];
	РезультатЗапросаМеждународныеКомпании = РезультатыЗапросов[ИндексЗапросаПоМеждународнымКомпаниям];
	Эмитенты = РезультатЗапросаЭмитенты.Выгрузить();
	КИЭмитентов = РезультатЗапросаКонтактнаяИнформация.Выгрузить();
	МеждународныеКомпании = РезультатЗапросаМеждународныеКомпании.Выгрузить();
	СобратьВсеДанныеОбЭмитентахВОсновнуюТаблицу(Эмитенты, КИЭмитентов, МеждународныеКомпании);
	
	ИзмененныеОбъекты = Новый Структура("ЦенныеБумаги, Эмитенты", ЦенныеБумаги, Эмитенты);
	
	Возврат ИзмененныеОбъекты;
КонецФункции

Процедура СобратьВсеДанныеОЦенныхБумагахВОсновнуюТаблицу(ЦенныеБумаги, Номиналы, Купоны)
	ЦенныеБумаги.Колонки.Добавить("Номиналы");
	ЦенныеБумаги.Колонки.Добавить("Купоны");
	ТекИндексНоминалы = 0;
	ТекИндексКупоны = 0;
	МаксИндексНоминалы = Номиналы.Количество() - 1;
	МаксИндексКупоны = Купоны.Количество() - 1;
	
	Для каждого ДанныеТекущейЦБ Из ЦенныеБумаги Цикл
		ТекущаяЦБ = ДанныеТекущейЦБ.ЦБ;
		НоминалыТекущейЦБ = Номиналы.СкопироватьКолонки("Value,DateStart");
		КупоныТекущейЦБ = Купоны.СкопироватьКолонки("Number,IssueDate,CancelDate,Coupon,CirculationPeriod,Amount,Rate,ListFixDate,Comment");
		// Пользуемся тем фактом, что в основной таблице и во вспомогательной данные по ЦБ отсортированы одинаковым образом:
		// будем продвигаться по всем трем таблицам от начала к концу параллельно и перекладывать данные в основную таблицу
		// из двух вспомогательных
		ЗаполнитьТаблицуДаннымиТекОбъекта(ТекущаяЦБ, "ЦБ", НоминалыТекущейЦБ, Номиналы, ТекИндексНоминалы, МаксИндексНоминалы);
		ЗаполнитьТаблицуДаннымиТекОбъекта(ТекущаяЦБ, "ЦБ", КупоныТекущейЦБ, Купоны, ТекИндексКупоны, МаксИндексКупоны);
		ДанныеТекущейЦБ.Номиналы = НоминалыТекущейЦБ;
		ДанныеТекущейЦБ.Купоны = КупоныТекущейЦБ;
	КонецЦикла;
КонецПроцедуры

Процедура СобратьВсеДанныеОбЭмитентахВОсновнуюТаблицу(Эмитенты, КИЭмитентов, МеждународныеКомпании)
	Эмитенты.Колонки.Добавить("КонтактнаяИнформация");
	Эмитенты.Колонки.Добавить("МеждународныеКомпании");
	ТекИндексКИ = 0;
	ТекИндексМК = 0;
	МаксИндексКИ = КИЭмитентов.Количество() - 1;
	МаксИндексМК = МеждународныеКомпании.Количество() - 1;
	
	Для каждого ДанныеТекущегоЭмитента Из Эмитенты Цикл
		ТекущийЭмитент = ДанныеТекущегоЭмитента.Эмитент;
		КИТекущегоЭмитента = КИЭмитентов.СкопироватьКолонки("ContactInfoTypeCode,ContactInfoKindCode,Value,DateStart");
		МКТекущегоЭмитента = МеждународныеКомпании.СкопироватьКолонки("IsInternationalCompany,DateStart");
		
		// Пользуемся тем фактом, что в основной таблице и во вспомогательной данные по эмитентам отсортированы одинаковым образом:
		// будем продвигаться по всем трем таблицам от начала к концу параллельно и перекладывать данные в основную таблицу
		// из двух вспомогательных
		ЗаполнитьТаблицуДаннымиТекОбъекта(ТекущийЭмитент, "Эмитент", КИТекущегоЭмитента, КИЭмитентов, ТекИндексКИ, МаксИндексКИ);
		ЗаполнитьТаблицуДаннымиТекОбъекта(ТекущийЭмитент, "Эмитент", МКТекущегоЭмитента, МеждународныеКомпании, ТекИндексМК, МаксИндексМК);
		
		ДанныеТекущегоЭмитента.КонтактнаяИнформация = КИТекущегоЭмитента;
		ДанныеТекущегоЭмитента.МеждународныеКомпании = МКТекущегоЭмитента;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьТаблицуДаннымиТекОбъекта(ТекОбъект, ИмяПоляСсылки, ДопДанныеПоТекОбъекту, ДопДанныеПоВсем, ТекИндекс, МаксИндекс)
	Если МаксИндекс >= 0 Тогда
		Пока ТекИндекс <= МаксИндекс И ДопДанныеПоВсем[ТекИндекс][ИмяПоляСсылки] = ТекОбъект Цикл
			НовСтрока = ДопДанныеПоТекОбъекту.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ДопДанныеПоВсем[ТекИндекс]);
			ТекИндекс = ТекИндекс + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура РассчитатьХэшиИзмененныхОбъектов(ТаблицаИзмененных, СписокИсключаемыхКолонок, СписокКолонокСВложеннымиТаблицами)
	Если ТаблицаИзмененных.Количество() > 0 Тогда
		СтруктураРеквизитовОбъекта = СтруктураТаблицы(ТаблицаИзмененных, СписокИсключаемыхКолонок, СписокКолонокСВложеннымиТаблицами);
		Для каждого РеквизитыОбъекта Из ТаблицаИзмененных Цикл
			РеквизитыОбъекта.НовыйХешРеквизитов = РассчитатьХешРеквизитов(РеквизитыОбъекта, СтруктураРеквизитовОбъекта);
			РеквизитыОбъекта.ЕстьИзмененияХэша = (РеквизитыОбъекта.НовыйХешРеквизитов <> РеквизитыОбъекта.СтарыйХешРеквизитов);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция СтруктураТаблицы(ТаблицаЗначений, СписокИсключаемыхКолонок, СписокИменКолонокСТаблицами)
	СтруктураРеквизитов = Новый Структура;
	ОбычныеКолонки = Новый Массив;
	КолонкиСТаблицами = Новый Массив;
	
	ИменаКолонокСТаблицами = СтрРазделить(СписокИменКолонокСТаблицами, ",");
	ИсключаемыеКолонки = СтрРазделить(СписокИсключаемыхКолонок, ",");
	
	Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		ИмяКолонки = Колонка.Имя;
		Если ИсключаемыеКолонки.Найти(ИмяКолонки) <> Неопределено Тогда
			Продолжить;
		ИначеЕсли ИменаКолонокСТаблицами.Найти(ИмяКолонки) = Неопределено Тогда
			ОбычныеКолонки.Добавить(ИмяКолонки);
		Иначе
			КолонкиВложеннойТаблицы = СтруктураТаблицы(ТаблицаЗначений[0][ИмяКолонки], СписокИсключаемыхКолонок, "");
			ОписаниеКолонкиСТаблицами = Новый Структура("ИмяКолонки, КолонкиВложеннойТаблицы", ИмяКолонки, КолонкиВложеннойТаблицы);
			КолонкиСТаблицами.Добавить(ОписаниеКолонкиСТаблицами);
		КонецЕсли;
	КонецЦикла;
		
	СтруктураРеквизитов.Вставить("Обычные", ОбычныеКолонки);
	СтруктураРеквизитов.Вставить("СТаблицами", КолонкиСТаблицами);
	
	Возврат СтруктураРеквизитов;
КонецФункции

Функция РассчитатьХешРеквизитов(СтрокаТЗ, ОписаниеКолонок)
	ХешДанных = Новый ХешированиеДанных(ХешФункция.SHA512); // возможная альтернатива ХешФункция.CRC32, но она возвращала бы число
	
	ДобавитьВХэш(ХешДанных, СтрокаТЗ, ОписаниеКолонок);
	
	ДвоичныйХеш = ХешДанных.ХешСумма;
	СтроковыйХеш = СтрЗаменить(Строка(ДвоичныйХеш), " ", "");
	
	Возврат СтроковыйХеш;
КонецФункции

Процедура ДобавитьВХэш(ХешДанных, СтрокаТЗ, ОписаниеКолонок)
	Для Каждого ИмяКолонки Из ОписаниеКолонок.Обычные Цикл
		СтроковоеЗначение = Строка(СтрокаТЗ[ИмяКолонки]);
		ХешДанных.Добавить(СтроковоеЗначение);
	КонецЦикла;
		
	Для Каждого ОписаниеКолонкиСТаблицей Из ОписаниеКолонок.СТаблицами Цикл
		ВложеннаяТаблица = СтрокаТЗ[ОписаниеКолонкиСТаблицей.ИмяКолонки];
		ОписаниеКолонокВложеннойТаблицы = ОписаниеКолонкиСТаблицей.КолонкиВложеннойТаблицы;
		Для каждого СтрокаВложеннойТЗ Из ВложеннаяТаблица Цикл
			ДобавитьВХэш(ХешДанных, СтрокаВложеннойТЗ, ОписаниеКолонокВложеннойТаблицы);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция РеквизитыЭмитента(ЭмитентЮрЛицо, Эмитенты, ВместеСЦеннойБумагой)
	Отбор = Новый Структура();
	Отбор.Вставить("Эмитент", ЭмитентЮрЛицо);
	Если Не ВместеСЦеннойБумагой Тогда
		Отбор.Вставить("ОбработанВместеСЦеннойБумагой", Ложь);
		Отбор.Вставить("ЕстьИзмененияХэша", Истина);
	КонецЕсли;
	
	НайденныеСтроки = Эмитенты.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		РеквизитыЭмитента = НайденныеСтроки[0];
	Иначе
		РеквизитыЭмитента = Неопределено;
	КонецЕсли;
	
	Возврат РеквизитыЭмитента;
КонецФункции

// Создает запись в регистре сведений ЖурналИсходящихСообщенийKafka с текущими значениями реквизитов ЦБ и/или Эмитента
// Параметры:
//	РеквизитыЦБ - СтрокаТаблицыЗначений - может иметь значение Неопределено, но хотя бы одно из двух
//											(ЦБ и Эмитентов) должно быть задано.
//	РеквизитыЭмитента - СтрокаТаблицыЗначений - может иметь значение Неопределено, но хотя бы одно из двух
//											(ЦБ и Эмитентов) должно быть задано.
//	ОшибкаОбработки - Булево
//	ОписаниеОшибки - Строка
Процедура ВыгрузитьЦеннуюБумагуИЭмитента(РеквизитыЦБ, РеквизитыЭмитента,  ОшибкаОбработки, ОписаниеОшибки)
	Попытка
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaDepoToBqSecuritiesStatic1642;
		УИДСообщения = Строка(Новый УникальныйИдентификатор());
		Ключ = "SecurityStatic";
		ТекстJSON = ТекстСообщенияJSON(УИДСообщения, РеквизитыЦБ, РеквизитыЭмитента);
		ОтправляемыйОбъект = ?(РеквизитыЦБ = Неопределено, РеквизитыЭмитента.ЦеннаяБумага, РеквизитыЦБ.ЦБ);
		Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Ключ, ТекстJSON, УИДСообщения, ОтправляемыйОбъект);
		
		Если РеквизитыЦБ <> Неопределено Тогда
			ТекстСообщения = "Выгружена ЦБ: " + РеквизитыЦБ.Name + " (ISIN: " + РеквизитыЦБ.ISIN + ")";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Если РеквизитыЭмитента <> Неопределено Тогда
			ТекстСообщения = "Выгружен эмитент: " + РеквизитыЭмитента.Name + " (Код RuData: " + РеквизитыЭмитента.RuDataCode + ")";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	Исключение
		ОшибкаОбработки = Истина;
		ТекстДиагностики = "Не удалось выгрузить в JSON данные содержащие следующие объекты:";
		Если РеквизитыЦБ <> Неопределено Тогда
			ТекстДиагностики = ТекстДиагностики + Символы.ПС + "ЦБ " + РеквизитыЦБ.Name 
								+ "; ISIN=" + РеквизитыЦБ.ISIN + "; RuDataCode=" + РеквизитыЦБ.RuDataCode;
		КонецЕсли;
		Если РеквизитыЭмитента <> Неопределено Тогда
			ТекстДиагностики = ТекстДиагностики + Символы.ПС + "Эмитент " + РеквизитыЭмитента.Name
								+ "; RuDataCode=" + РеквизитыЭмитента.RuDataCode + Символы.ПС;
		КонецЕсли;
		ТекстДиагностики = ТекстДиагностики + "По причине: " + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстДиагностики);
		ОписаниеОшибки = ТекстДиагностики;
	КонецПопытки;
КонецПроцедуры

Функция ТекстСообщенияJSON(УИДСообщения, РеквизитыЦБ, РеквизитыЭмитента)
	MessageInfo = РаботаСJSON.СтруктураMessageInfo();
	MessageInfo.MessageType = "SecurityStatic";
	MessageInfo.JsonVersion = "1.0.0";
	MessageInfo.MessageId = УИДСообщения;
	MessageInfo.SystemSource = "Depo";
	Если РеквизитыЦБ <> Неопределено И Не ЗначениеЗаполнено(РеквизитыЦБ.СтарыйХешРеквизитов) Тогда
		MessageInfo.ActionType = "INS";
	Иначе
		MessageInfo.ActionType = "UPD";
	КонецЕсли;
	MessageInfo.MasterMessageId = УИДСообщения;
	MessageInfo.ParentMessageId = Неопределено;	// null
	MessageInfo.DateTimeCreate = ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO);
	
	Data = БлокData(РеквизитыЦБ, РеквизитыЭмитента);
	
	ТекстСообщенияJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	Возврат ТекстСообщенияJSON;
КонецФункции

Функция БлокData(РеквизитыЦБ, РеквизитыЭмитента)
	Data = Новый Структура;
	
	Если РеквизитыЦБ <> Неопределено Тогда
		Asset = БлокAsset(РеквизитыЦБ);
		Data.Вставить("Asset", Asset);
		SecurityMainData = БлокSecurityMainData(РеквизитыЦБ);
		Data.Вставить("SecurityMainData", SecurityMainData);
		Если РеквизитыЦБ.ЭтоКупоннаяОблигация Или РеквизитыЦБ.Купоны.Количество() > 0 Тогда
			CouponMainData = БлокCouponMainData(РеквизитыЦБ);
			Data.Вставить("CouponMainData", CouponMainData);
		КонецЕсли;
		Если РеквизитыЦБ.Номиналы.Количество() > 0 Тогда
			SecurityNominalData = БлокSecurityNominalData(РеквизитыЦБ.Номиналы);
			Data.Вставить("SecurityNominalData", SecurityNominalData);
		КонецЕсли;
		Если РеквизитыЦБ.Купоны.Количество() > 0 Тогда
			SecurityCouponData = БлокSecurityCouponData(РеквизитыЦБ.Купоны);
			Data.Вставить("SecurityCouponData", SecurityCouponData);
		КонецЕсли;
	КонецЕсли;
	Если РеквизитыЭмитента <> Неопределено Тогда
		EmitentMainData = БлокEmitentMainData(РеквизитыЭмитента);
		Data.Вставить("EmitentMainData", EmitentMainData);
		Если РеквизитыЭмитента.КонтактнаяИнформация.Количество() > 0 Тогда
			EmitentContactData = БлокEmitentContactData(РеквизитыЭмитента.КонтактнаяИнформация);
			Data.Вставить("EmitentContactData", EmitentContactData);
		КонецЕсли;
		Если РеквизитыЭмитента.МеждународныеКомпании.Количество() > 0 Тогда
			EmitentPeriodICData = БлокEmitentPeriodICData(РеквизитыЭмитента.МеждународныеКомпании);
			Data.Вставить("EmitentPeriodICData", EmitentPeriodICData);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Data;
КонецФункции

Функция БлокAsset(РеквизитыЦБ)
	Asset = Новый Структура;
	
	AssetCode	= РеквизитыЦБ.AssetCode;
	Isin		= РеквизитыЦБ.Isin;
	RegNum		= РеквизитыЦБ.RegNum;
	RuDataCode	= РаботаСJSON.ЧисловойКодRuData(РеквизитыЦБ.RuDataCode);
		
	Asset.Вставить("AssetCode",		НеопределеноЕслиПусто(AssetCode) );
	Asset.Вставить("Isin",			НеопределеноЕслиПусто(Isin) );
	Asset.Вставить("RegNum",		НеопределеноЕслиПусто(RegNum) );
	Asset.Вставить("RuDataCode",	НеопределеноЕслиПусто(RuDataCode) );
	
	Возврат Asset;
КонецФункции

Функция БлокSecurityMainData(РеквизитыЦБ)
	SecurityMainData = Новый Структура;
	
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "Name");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "FullName");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "NameEng");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "CFI");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "CurrencyCode");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "NominalType");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "IndexedNominal");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "ResidualNominal");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "IssueNominal");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "TypeCode");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "KindCode");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "KindCodeBankRussia");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "IssueName");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "IssueRegDate", Истина);
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "IssueFormCode");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "IssueKind");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "IssueType");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "PlacementDateStart", Истина);
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "PlacementVolume");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "IsRegisteredBearer");
	
	SecurityMainData.Вставить("BasicAsset", РаботаСJSON.ЧисловойКодRuData(РеквизитыЦБ.BasicAsset));
	
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "BasicAssetSize");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "Nfi");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "IsForQualInvestor");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "IsLiquid");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "IsDefault");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "DefaultDate", Истина);
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "TaxCountryCode");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "TaxRate");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "CancelDate", Истина);
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "BondTypeCode");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "isAmortisation");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "IssueDocsAddInfo");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "RealIssueName");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "RealIssueCountryCode");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "RealIssueAssetsCountryCode");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "IsQuasiRussian");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "IsMainStoragePlace");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "StoragePlace");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "StoragePlaceCode");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "InnovativeSectorListDateStart", Истина);
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "InnovativeSectorListDateEnd", Истина);
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "StatusRuData");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "CountryCode");
	ВставитьВСтруктуру(SecurityMainData, РеквизитыЦБ, "IsAdmittedTradingInRF");
	
	Возврат SecurityMainData;
КонецФункции

Функция БлокCouponMainData(РеквизитыЦБ)
	CouponMainData = Новый Структура;
	
	CouponMainData.Вставить("CurrencyCode", НеопределеноЕслиПусто(РеквизитыЦБ.CouponCurrencyCode));
	ВставитьВСтруктуру(CouponMainData, РеквизитыЦБ, "RepaymentPeriod");
	ВставитьВСтруктуру(CouponMainData, РеквизитыЦБ, "Percent");
	ВставитьВСтруктуру(CouponMainData, РеквизитыЦБ, "CouponsByYear");
	ВставитьВСтруктуру(CouponMainData, РеквизитыЦБ, "DecimalPlaces");
	ВставитьВСтруктуру(CouponMainData, РеквизитыЦБ, "NkdCalcBasis");
	
	Возврат CouponMainData;
КонецФункции

Функция БлокSecurityNominalData(ТЗНоминалы)
	SecurityNominalData = Новый Массив;
	
	Для каждого Номинал Из ТЗНоминалы Цикл
		Элемент = Новый Структура;
		ВставитьВСтруктуру(Элемент, Номинал, "Value");
		ВставитьВСтруктуру(Элемент, Номинал, "DateStart", Истина);
		SecurityNominalData.Добавить(Элемент);
	КонецЦикла;

	Возврат SecurityNominalData;
КонецФункции

Функция БлокSecurityCouponData(ТЗКупоны)
	SecurityCouponData = Новый Массив;
	
	Для каждого Купон Из ТЗКупоны Цикл
		Элемент = Новый Структура;
		ВставитьВСтруктуру(Элемент, Купон, "Number");
		ВставитьВСтруктуру(Элемент, Купон, "IssueDate", Истина);
		ВставитьВСтруктуру(Элемент, Купон, "CancelDate", Истина);
		ВставитьВСтруктуру(Элемент, Купон, "Coupon");
		ВставитьВСтруктуру(Элемент, Купон, "CirculationPeriod");
		ВставитьВСтруктуру(Элемент, Купон, "Amount");
		ВставитьВСтруктуру(Элемент, Купон, "Rate");
		ВставитьВСтруктуру(Элемент, Купон, "ListFixDate", Истина);
		ВставитьВСтруктуру(Элемент, Купон, "Comment");
		SecurityCouponData.Добавить(Элемент);
	КонецЦикла;
	
	Возврат SecurityCouponData;
КонецФункции

Функция БлокEmitentMainData(РеквизитыЭмитента)
	EmitentMainData = Новый Структура;
	
	EmitentMainData.Вставить("RuDataCode", РаботаСJSON.ЧисловойКодRuData(РеквизитыЭмитента.RuDataCode));
	
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "NrdCode");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "LeiCode");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "Name");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "FullName");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "FullNameEng");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "Inn");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "Tin");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "Okpo");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "Kpp");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "Ogrn");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "Okonh");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "Okved");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "Okogu");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "Okfs");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "Okopf");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "GovRegDate", Истина);
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "GovRegPlace");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "RegNumber");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "RegAuthority");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "EgrulEntryDate", Истина);
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "isNotTaxResident");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "CountryCode");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "IsInternationalOrganization");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "IsCreditOrganization");
	ВставитьВСтруктуру(EmitentMainData, РеквизитыЭмитента, "EconomicSectorCode");
	
	Возврат EmitentMainData;
КонецФункции

Функция БлокEmitentContactData(ТЗКонтактнаяИнформация)
	EmitentContactData = Новый Массив;
	
	Для каждого СтрокаКИ Из ТЗКонтактнаяИнформация Цикл
		Элемент = Новый Структура;
		ВставитьВСтруктуру(Элемент, СтрокаКИ, "ContactInfoTypeCode");
		ВставитьВСтруктуру(Элемент, СтрокаКИ, "ContactInfoKindCode");
		ВставитьВСтруктуру(Элемент, СтрокаКИ, "Value");
		ВставитьВСтруктуру(Элемент, СтрокаКИ, "DateStart", Истина);
		EmitentContactData.Добавить(Элемент);
	КонецЦикла;
	
	Возврат EmitentContactData;
КонецФункции

Функция БлокEmitentPeriodICData(ТЗМеждународныеКомпании)
	EmitentPeriodICData = Новый Массив;
	
	Для каждого СведенияОСтатусеМК Из ТЗМеждународныеКомпании Цикл
		Элемент = Новый Структура;
		ВставитьВСтруктуру(Элемент, СведенияОСтатусеМК, "IsInternationalCompany");
		ВставитьВСтруктуру(Элемент, СведенияОСтатусеМК, "DateStart", Истина);
		EmitentPeriodICData.Добавить(Элемент);
	КонецЦикла;
	
	Возврат EmitentPeriodICData;
КонецФункции

Процедура ВставитьВСтруктуру(Структура, Источник, ИмяЭлемента, ЭтоДата = Ложь)
	ЗначениеЭлемента = НеопределеноЕслиПусто(Источник[ИмяЭлемента]);
	
	Если ЭтоДата И ЗначениеЭлемента <> Неопределено Тогда
		ЗначениеЭлемента = ЗаписатьДатуJSON(ЗначениеЭлемента, ФорматДатыJSON.ISO);
	КонецЕсли;

	Структура.Вставить(ИмяЭлемента, ЗначениеЭлемента);
КонецПроцедуры

Функция НеопределеноЕслиПусто(Значение)
	Если ЗначениеЗаполнено(Значение) Или Значение = 0 Тогда
		Результат = Значение;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти