
&НаКлиенте
Процедура ПолныйПутьОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Объект.ПолныйПуть <> "" Тогда
		ЗапуститьПриложение(Объект.ПолныйПуть);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтносительныйПутьАрхивОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Объект.ПутьАрхив <> "" Тогда
		ЗапуститьПриложение(Объект.ПутьАрхив);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СоздатьЭлементыФормы();
	
	Для каждого Строка Из Объект.СодержимоеФайла Цикл
		Если Строка.ИмяФайла = "" Тогда
			Продолжить;
		КонецЕсли; 
		Если Элементы.ИмяФайлаОтбор.СписокВыбора.НайтиПоЗначению(Строка.ИмяФайла) = Неопределено Тогда
			Элементы.ИмяФайлаОтбор.СписокВыбора.Добавить(Строка.ИмяФайла);
		КонецЕсли; 
	КонецЦикла; 
	
	Если Элементы.ИмяФайлаОтбор.СписокВыбора.Количество() > 0 Тогда
		ИмяФайлаОтбор = Элементы.ИмяФайлаОтбор.СписокВыбора[0];
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыФормы()
 	
КонецПроцедуры


&НаКлиенте
Процедура ИмяФайлаОтборПриИзменении(Элемент)
	Элементы.СодержимоеФайла.ОтборСтрок = Новый ФиксированнаяСтруктура("ИмяФайла", ИмяФайлаОтбор);
КонецПроцедуры
  