#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТипОбъекта = ТипОбъектаКОтправкеСтрокой(Запись.Объект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ТипОбъекта = ТипОбъектаКОтправкеСтрокой(Запись.Объект);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	ТипОбъекта = ТипОбъектаКОтправкеСтрокой(Запись.Объект);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ТипОбъектаКОтправкеСтрокой(Объект)
	ТипОбъекта = РегистрыСведений.СтатусыОбъектовКОтправке.ТипОбъектаКОтправкеСтрокой(Объект);
	ТипОбъекта = "(" + ТипОбъекта + ")";
	
	Возврат ТипОбъекта;
КонецФункции

#КонецОбласти