&НаКлиенте
Процедура Установить(Команда)
	Заголовок = "";
	ЗначенияПараметров = УстановитьПараметры(Заголовок);
	ОповеститьОВыборе(новый Структура("Значения, ЗаголовокНастроек", ЗначенияПараметров,Заголовок));
КонецПроцедуры // Установить()

&НаСервере
Функция УстановитьПараметры(Заголовок)
	//Значения = Новый Структура();
	//Значения.Вставить("Календарь", ?(ЭтаФорма.Объект.ИспользоватьКалендарь, ЭтаФорма.Объект.Календарь, Справочники.ПроизводственныеКалендари.ПустаяСсылка()));
	//Значения.Вставить("ИспользоватьКалендарь", ЭтаФорма.Объект.ИспользоватьКалендарь);
	//Значения.Вставить("ПочтовыйЛогин", ЭтаФорма.Объект.ПочтовыйЛогин);
	//Значения.Вставить("СписокРассылки", XMLСтрока(Новый ХранилищеЗначения(ЭтаФорма.Объект.СписокРассылки.Выгрузить())));
	//Значения.Вставить("СписокРассылкиСаппорт", XMLСтрока(Новый ХранилищеЗначения(ЭтаФорма.Объект.СписокРассылкиСаппорт.Выгрузить())));
	////DDneprovsky 08.10.2018 IMAPPS-6929
	//Значения.Вставить("ПропускатьРасчет", ЭтаФорма.Объект.ПропуститьРасчет);
	//Значения.Вставить("ПропуститьРасчетПоМандату", ЭтаФорма.Объект.ПропуститьРасчетПоМандату);
	//Значения.Вставить("ПропуститьРасчетДата", ЭтаФорма.Объект.ПропуститьРасчетДата);
	//	
	//ПредставлениеПочты = ?(ЭтаФорма.Объект.СписокРассылки.Количество() > 0, ", Установлен список рассылки", "");
	//
	//Возврат Значения;
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектОбработки.УстановитьПараметры(Заголовок);
КонецФункции // УстановитьПараметры()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Параметры.НастройкиАлгоритма)=Тип("Структура") тогда
		
		Настройки = Параметры.НастройкиАлгоритма;
		
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.УстановитьПользовательскиеНастройки(Настройки);
		
		ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	КонецЕсли;
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ИспользоватьКалендарьПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры // ИспользоватьКалендарьПриИзменении()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура УправлениеФормой()
	Если ЭтаФорма.Объект.ИспользоватьКалендарь Тогда
		ЭтаФорма.Элементы.Календарь.Доступность = Истина;
	Иначе
		ЭтаФорма.Элементы.Календарь.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры // УправлениеФормой()

&НаСервере
Процедура НастройкиПоУмолчаниюНаСервере()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.НастройкиПоУмолчанию(Объект);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоУмолчанию(Команда)
	НастройкиПоУмолчаниюНаСервере();
КонецПроцедуры
