
&НаКлиенте
Процедура Сформировать(Команда)
	Отчет.КонДата = КонецДня(Отчет.НачДата);
	СформироватьНаСервере();
	Отчет.Отчет.ТолькоПросмотр = ИСТИНА;
	//Отчет.Отчет.Показать("Сверка денежных средств");
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
	Объект = РеквизитФормыВЗначение("Отчет");
	ТабДок = Объект.ВыполнитьСверку();
	ЗначениеВРеквизитФормы(Объект, "Отчет");
КонецФункции

&НаКлиенте
Процедура ДоговорИсключениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Отчет.ДоговорИсключение.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ДоговорДУ");
КонецПроцедуры

&НаКлиенте
Процедура СчетИсключениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Отчет. СчетИсключение.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// IMAPPS-25493++
	//Отчет.ДоговорИсключение.Добавить(Справочники.ДоговорДУ.НайтиПоНаименованию("УК ВТБ УА"));
	//Отчет.ДоговорИсключение.Добавить(Справочники.ДоговорДУ.НайтиПоНаименованию("УК ВТБ УИ"));
	//Отчет.ДоговорИсключение.Добавить(Справочники.ДоговорДУ.НайтиПоНаименованию("УК ВТБ ПР"));
	//Отчет.ДоговорИсключение.Добавить(Справочники.ДоговорДУ.НайтиПоНаименованию("ДУ 3485 (ВТБ ПФ СПН)"));
	//Отчет.ДоговорИсключение.Добавить(Справочники.ДоговорДУ.НайтиПоНаименованию("СФР_ПР"));
	//
	//Отчет.СчетИсключение.Добавить(Справочники.БанковскиеСчета.НайтиПоНаименованию("40701810600760000051"));
	
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	
	Если ТипЗнч(Параметры)=Тип("Структура")
		И Параметры.Свойство("ДополнительнаяОбработкаСсылка")
		И ЗначениеЗаполнено(Параметры.ДополнительнаяОбработкаСсылка) Тогда
		ДополнительнаяОбработкаСсылка = Параметры.ДополнительнаяОбработкаСсылка;
	Иначе
		ДополнительнаяОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ТекОбъект.СведенияОВнешнейОбработке().Наименование)
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнительнаяОбработкаСсылка) Тогда
		НастройкиАлгоритма = ДополнительнаяОбработкаСсылка.ХранилищеНастроек.Получить();
		ТекОбъект.УстановитьПользовательскиеНастройки(НастройкиАлгоритма);
		ЗначениеВРеквизитФормы(ТекОбъект,"Отчет");
	КонецЕсли;
	// IMAPPS-25493--
КонецПроцедуры


