// Получает сообщений из ЖурналВходящихСообщенийKafka
Процедура ОбработатьСообщенияNotification() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЖурналВходящихСообщенийKafka.Сообщение КАК Сообщение,
		|	ЖурналВходящихСообщенийKafka.Идентификатор КАК Идентификатор,
		|	ЖурналВходящихСообщенийKafka.ВнешнийИсточник КАК ВнешнийИсточник
		|ИЗ
		|	РегистрСведений.ЖурналВходящихСообщенийKafka КАК ЖурналВходящихСообщенийKafka
		|ГДЕ
		|	ЖурналВходящихСообщенийKafka.Обработан = ЛОЖЬ
		|	И ЖурналВходящихСообщенийKafka.ОшибкаОбработки = ЛОЖЬ
		|	И ЖурналВходящихСообщенийKafka.Ключ ПОДОБНО ""Notification%""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбработатьСообщениеNotification(ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьСообщениеNotification(ДанныеСообщения)

	ИмяСобытия = "ОбработатьСообщениеNotification";
	Сообщение = РаботаСJSON.РезультатЧтенияJSON(ДанныеСообщения.Сообщение);
	ТекстОшибки = "";
	
	Попытка
		MessageInfo = ОбменДаннымиКафка.ДанныеMessageInfo();
		ОбменДаннымиКафка.ПодготовитьMessageInfo(Сообщение.MessageInfo, MessageInfo, ИмяСобытия, ТекстОшибки);
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		MessageInfo.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(ДанныеСообщения.ВнешнийИсточник,
			ДанныеСообщения.Идентификатор, СокрЛП(ТекстОшибки));
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		Возврат;
	КонецЕсли;
	
	ИдентификаторУведомления = MessageInfo.MasterMessageId;
	СтатусыДоставкиУведомления = Новый Массив;
	СтатусыДоставкиУведомления.Добавить(Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ВыгруженИз1С);
	СтатусыДоставкиУведомления.Добавить(Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.СбойОтправки);
	
	Data = Сообщение.Data;
	
	ResultCode = "";
	ИмяПоля = "ResultCode";
	ЗаполнитьПолеПоВходящимДанным(Data, ResultCode, ИмяПоля, ТекстОшибки);
	
	ResultDescription = "";
	ИмяПоля = "ResultDescription";
	ЗаполнитьПолеПоВходящимДанным(Data, ResultDescription, ИмяПоля, ТекстОшибки);
	
	Content = "";
	ИмяПоля = "Content";
	ЗаполнитьПолеПоВходящимДанным(Data, Content, ИмяПоля, ТекстОшибки);
	
	Message = "";
	Title = "";
	Если ЗначениеЗаполнено(Content) И ТипЗнч(Content) = Тип("Структура") Тогда
		Content.Свойство("Message", Message);
		Content.Свойство("Title", Title);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(ДанныеСообщения.ВнешнийИсточник,
			ДанныеСообщения.Идентификатор, СокрЛП(ТекстОшибки));
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УведомленияСрезПоследних.Период КАК Период,
		|	УведомленияСрезПоследних.КД КАК КД,
		|	УведомленияСрезПоследних.Клиент КАК Клиент,
		|	УведомленияСрезПоследних.Договор КАК Договор,
		|	УведомленияСрезПоследних.СчетДепо КАК СчетДепо,
		|	УведомленияСрезПоследних.РазделСчетаДепо КАК РазделСчетаДепо,
		|	УведомленияСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	УведомленияСрезПоследних.ИдентификаторУведомления КАК ИдентификаторУведомления,
		|	УведомленияСрезПоследних.Количество КАК Количество,
		|	УведомленияСрезПоследних.Тема КАК Тема,
		|	УведомленияСрезПоследних.Тело КАК Тело
		|ИЗ
		|	РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет.СрезПоследних(, ИдентификаторУведомления = &ИдентификаторУведомления) КАК УведомленияСрезПоследних
		|ГДЕ
		|	УведомленияСрезПоследних.СтатусДоставкиУведомления В(&СтатусыДоставкиУведомления)";
	
	Запрос.УстановитьПараметр("ИдентификаторУведомления", ИдентификаторУведомления);
	Запрос.УстановитьПараметр("СтатусыДоставкиУведомления", СтатусыДоставкиУведомления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаУведомленияОтправленные = РезультатЗапроса.Выбрать();
	
	Если ВыборкаУведомленияОтправленные.Следующий() Тогда
		НетОшибок = ?(НРег(ResultCode) = "success", Истина, Ложь);
		Запись = РегистрыСведений.УведомленияОтправленныеЧерезЛичныйКабинет.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаУведомленияОтправленные);
		НовыйСтатус = ?(НетОшибок, Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ЗагруженВКабинетКлиента,
			Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.СбойОтправки);
		Запись.СтатусДоставкиУведомления = НовыйСтатус;
		Запись.Тема = ?(НетОшибок, Title, ResultCode);
		Тело = ?(НетОшибок, Message, ResultDescription);
		Запись.Тело = Тело;
		Попытка
			Запись.Записать();
			РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗавершитьОбработку(ДанныеСообщения.ВнешнийИсточник, ДанныеСообщения.Идентификатор);
		Исключение
			ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(ДанныеСообщения.ВнешнийИсточник,
				ДанныеСообщения.Идентификатор, СокрЛП(ТекстОшибки));
			MessageInfo.Вставить("ОписаниеОшибки", ОписаниеОшибки);
			ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПолеПоВходящимДанным(РодительПоля, ЗначениеПоля, ИмяПоля, ТекстОшибки)
	
	Если Не РодительПоля.Свойство(ИмяПоля, ЗначениеПоля) Или Не ЗначениеЗаполнено(РодительПоля[ИмяПоля]) Тогда
		ТекстОшибки = СокрЛП(ТекстОшибки + Символы.ПС + СтрШаблон("Не заполнено поле %1", ИмяПоля));
	КонецЕсли;
	
КонецПроцедуры

