#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПараметрыОтчетаНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыОтчетаНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаСверкиКонецДня = НачалоДня(НачалоМесяца(ТекущаяДатаСеанса()) - 1);
	
	ФункцииОтчетовКлиентСервер.УстановитьПараметрСКД(Отчет.КомпоновщикНастроек, "ДатаСверкиКонецДня", ДатаСверкиКонецДня);
	
	ФункцииОтчетовКлиентСервер.УстановитьПараметрСКД(Отчет.КомпоновщикНастроек, "НДЦ", Справочники.КлассификаторыЗагрузки.НДЦ());
	
КонецПроцедуры

#КонецОбласти
