#Область ПрограммныйИнтерфейс

Функция АнкетаОбщиеСведения() Экспорт
	Макет = ПолучитьМакет("ОбщиеСведения");
	Отчет = Новый ТабличныйДокумент;
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Организация = ПараметрыСеанса.Организация.Наименование;
	Область.Параметры.ПолноеНаименование = СтрЗаменить(ПараметрыСеанса.Организация.НаименованиеПолное,"Общество","общества");
	Отчет.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Тело");
	Область.Параметры.ПолноеНаименование = "Полное наименование: "+СокрЛП(ПолноеНаименование)
							+Символы.ПС+"Сокращенное наименование: "+СокрЛП(Наименование);
	Область.Параметры.ОПФ = ОПФ;
	Область.Параметры.РегНомер = ОГРН;
	Область.Параметры.Месторегистрации = МестоГосРегистрации;
	Область.Параметры.ДатаРегистрации = ДатаГосРегистрации;
	Попытка
		Область.Параметры.ЮрАдрес = РегистрыСведений.КонтактнаяИнформация.СрезПоследних(ДатаЗаполненияАнкеты, Новый Структура("Объект, Тип",Ссылка,Перечисления.ТипыКонтактнойИнформации.Адрес))[0].Представление;
	Исключение
	КонецПопытки;
	Попытка
		Область.Параметры.ФактАдрес = РегистрыСведений.КонтактнаяИнформация.СрезПоследних(ДатаЗаполненияАнкеты, Новый Структура("Объект, Тип",Ссылка,Перечисления.ТипыКонтактнойИнформации.Адрес))[0].Представление;
	Исключение
	КонецПопытки;
	Попытка
		Область.Параметры.Телефоны = РегистрыСведений.КонтактнаяИнформация.СрезПоследних(ДатаЗаполненияАнкеты, Новый Структура("Объект, Тип",Ссылка,Перечисления.ТипыКонтактнойИнформации.Телефон))[0].Представление;
	Исключение
	КонецПопытки;
	Попытка
		Область.Параметры.Email = РегистрыСведений.КонтактнаяИнформация.СрезПоследних(ДатаЗаполненияАнкеты, Новый Структура("Объект, Тип",Ссылка,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))[0].Представление;
	Исключение
	КонецПопытки;
	Область.Параметры.ИНН = ИНН;
	Область.Параметры.TIN = TIN;
	Область.Параметры.КодыФорм = "Код по ОКПО: " + КодПоОКПО + Символы.ПС +
								"Код по ОКОНХ: " + КодПоОКОНХ + Символы.ПС +
								"Код по ОКВЭД: " + КодПоОКВЭД;
	Область.Параметры.ДатаЗаполнения = ДатаЗаполненияАнкеты;
	Попытка
		Область.Параметры.РазмерСобственныхСредств = РегистрыСведений.СобственныеСредства.СрезПоследних(ДатаЗаполненияАнкеты, Новый Структура("Юрлицо",Ссылка))[0].Сумма;
	Исключение
	КонецПопытки;
	Область.Параметры.СтруктураОрганов = СведенияОСтруктуреОрганов;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредставителиЮрЛица.ЮрФизЛицо КАК Представитель
	|ИЗ
	|	РегистрСведений.ПредставителиЮрЛица КАК ПредставителиЮрЛица
	|ГДЕ
	|	ПредставителиЮрЛица.Клиент = &Клиент
	|	И ПредставителиЮрЛица.ФлагАктивности";
	
	Запрос.УстановитьПараметр("Клиент", Ссылка);
	ВыборкаПредставители = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаПредставители.Количество() > 0 Тогда
		ВыборкаПредставители.Следующий();
		Область.Параметры.Представитель = ВыборкаПредставители.Представитель;
		Отчет.Вывести(Область);
		Область = Макет.ПолучитьОбласть("Представитель");
		Пока ВыборкаПредставители.Следующий() Цикл
			Область.Параметры.Представитель = ВыборкаПредставители.Представитель;
			Отчет.Вывести(Область);
		КонецЦикла;
	Иначе
		Отчет.Вывести(Область);
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("ДоговорШапка");
	Выборка = Справочники.ДоговорыКонтрагентов.Выбрать(,Справочники.Контрагенты.НайтиПоРеквизиту("ЮридическиеФизическиеЛица",Ссылка));
	Если Выборка.Следующий() Тогда
		Область.Параметры.Договор = "№ "+ СокрЛП(Выборка.Код) + " от " + Формат(Выборка.ДатаНачалоДействия, "ДЛФ=DD");
	КонецЕсли;
	Отчет.Вывести(Область);
	Область = Макет.ПолучитьОбласть("Договор");
	Пока Выборка.Следующий() Цикл
		Область.Параметры.Договор = "№ "+ СокрЛП(Выборка.Код) + " от " + Формат(Выборка.ДатаНачалоДействия, "ДЛФ=DD");
		Отчет.Вывести(Область);
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("ЛицензииШапка");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Лицензии.Лицензия,
	                      |	Лицензии.Номер,
	                      |	Лицензии.ДатаНачалаДействия,
	                      |	Лицензии.ДатаОкончанияДействия
	                      |ИЗ
	                      |	РегистрСведений.Лицензии КАК Лицензии
	                      |ГДЕ
	                      |	Лицензии.ЮрЛицо = &ЮрЛицо
	                      |	И Лицензии.ДатаНачалаДействия <= &ДатаАнкеты
						  
	                      |	И (Лицензии.ДатаОкончанияДействия >= &ДатаАнкеты ИЛИ Лицензии.ДатаОкончанияДействия = &ПустаяДата)");
	Запрос.УстановитьПараметр("ЮрЛицо",Ссылка);
	Запрос.УстановитьПараметр("ДатаАнкеты",ДатаЗаполненияАнкеты);
	Запрос.УстановитьПараметр("ПустаяДата",Дата("00010101"));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Область.Параметры.Лицензии = Выборка.Лицензия.Описание + " № " + Выборка.Номер +
		" с "+Формат(Выборка.ДатаНачалаДействия,"ДЛФ=DD") + ?(ОбщегоНазначения.ЗначениеНеЗаполнено(Выборка.ДатаОкончанияДействия),""," по "+Формат(Выборка.ДатаОкончанияДействия,"ДЛФ=DD"));
	КонецЕсли;
	Отчет.Вывести(Область);
	Область = Макет.ПолучитьОбласть("Лицензии");
	Пока Выборка.Следующий() Цикл
		Область.Параметры.Лицензии = Выборка.Лицензия.Описание + " № " + Выборка.Номер +
		" с "+Формат(Выборка.ДатаНачалаДействия,"ДЛФ=DD") + ?(ОбщегоНазначения.ЗначениеНеЗаполнено(Выборка.ДатаОкончанияДействия),""," по "+Формат(Выборка.ДатаОкончанияДействия,"ДЛФ=DD"));
		Отчет.Вывести(Область);
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("ВидыДеятельностиШапка");
	Если ОсновныеВидыДеятельности.Количество()>0 Тогда
		Область.Параметры.ВидыДеятельности = СокрЛП(ОсновныеВидыДеятельности[0].ВидДеятельности)+" "+ОсновныеВидыДеятельности[0].Комментарий;
		Отчет.Вывести(Область);
		Область = Макет.ПолучитьОбласть("ВидыДеятельности");
		Для ААА = 1 По ОсновныеВидыДеятельности.Количество()-1 Цикл
			Область.Параметры.ВидыДеятельности = СокрЛП(ОсновныеВидыДеятельности[ААА].ВидДеятельности)+" "+ОсновныеВидыДеятельности[ААА].Комментарий;
			Отчет.Вывести(Область);
		КонецЦикла;
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("ВлиятельныеЛицаШапка");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВлиятельныеЛица.ФизЛицо,
	                      |	ВлиятельныеЛица.Комментарий
	                      |ИЗ
	                      |	РегистрСведений.ВлиятельныеЛица КАК ВлиятельныеЛица
	                      |ГДЕ
	                      |	ВлиятельныеЛица.ЮрЛицо = &ЮрЛицо");
	Запрос.УстановитьПараметр("ЮрЛицо",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Область.Параметры.СведенияОВлиятельныхЛицах = СокрЛП(Выборка.ФизЛицо) + " " + Выборка.Комментарий;
	КонецЕсли;
	Отчет.Вывести(Область);
	Область = Макет.ПолучитьОбласть("ВлиятельныеЛица");
	Пока Выборка.Следующий() Цикл
		Область.Параметры.СведенияОВлиятельныхЛицах = СокрЛП(Выборка.ФизЛицо) + " " + Выборка.Комментарий;
		Отчет.Вывести(Область);
	КонецЦикла;
	
	
	Область = Макет.ПолучитьОбласть("СоставУправленияШапка");
	Если СоставУправления.Количество()>0 Тогда
		Область.Параметры.СоставУправления = СокрЛП(СоставУправления[0].Сотрудник)+" "+СоставУправления[0].Должность;
		Отчет.Вывести(Область);
		Область = Макет.ПолучитьОбласть("СоставУправления");
		Для ААА = 1 По ОсновныеВидыДеятельности.Количество()-1 Цикл
			Область.Параметры.СоставУправления = СокрЛП(СоставУправления[ААА].Сотрудник)+" "+СоставУправления[ААА].Должность;
			Отчет.Вывести(Область);
		КонецЦикла;
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("УчередителиШапка");
	Отчет.Вывести(Область);
	
	Запрос  = Новый Запрос("ВЫБРАТЬ
	                       |	Учередители.Учередитель,
	                       |	Учередители.Доля
	                       |ИЗ
	                       |	РегистрСведений.Учередители КАК Учередители
	                       |ГДЕ
	                       |	Учередители.ЮрЛицо = &ЮрЛицо
	                       |	И Учередители.Учередитель ССЫЛКА Справочник.ФизическиеЛица");
	Запрос.УстановитьПараметр("ЮрЛицо",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Область = Макет.ПолучитьОбласть("ШапкаФизЛица");
		Отчет.Вывести(Область);
		Область = Макет.ПолучитьОбласть("ТелоФизЛица");
		ФИО = РегистрыСведений.ФИОФизЛиц.СрезПоследних(ДатаЗаполненияАнкеты, Новый Структура("ФизЛицо",Выборка.Учередитель))[0];
		Область.Параметры.ФИО = ФИО.Фамилия + " " + ФИО.Имя + " " + ФИО.Отчество;
		
		Попытка
			ПаспортныеДанные = РегистрыСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(ДатаЗаполненияАнкеты, Новый Структура("ФизЛицо",Выборка.Учередитель))[0];
			Область.Параметры.Документ = ПаспортныеДанные.ДокументВид+" "+ПаспортныеДанные.Документ.Серия+
			" № " + ПаспортныеДанные.ДокументНомер + " выдан "+Формат(ПаспортныеДанные.ДокументДатаВыдачи,"ДЛФ=DD")+
			" " + ПаспортныеДанные.ДокументКемВыдан + " код подразделения " + ПаспортныеДанные.ДокументКодПодразделения;
		Исключение
			Область.Параметры.Документ = "-----";
		КонецПопытки;
		
		Попытка
			Область.Параметры.МестоЖительства = РегистрыСведений.КонтактнаяИнформация.СрезПоследних(ДатаЗаполненияАнкеты, Новый Структура("Объект, Тип",Выборка.Учередитель,Перечисления.ТипыКонтактнойИнформации.Адрес))[0].Представление;
		Исключение
		КонецПопытки;
		Область.Параметры.Доля = Формат(Выборка.Доля,"ЧЦ=6; ЧДЦ=3") + "%";
		Отчет.Вывести(Область);
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		ФИО = РегистрыСведений.ФИОФизЛиц.СрезПоследних(ДатаЗаполненияАнкеты, Новый Структура("ФизЛицо",Выборка.Учередитель))[0];
		Область.Параметры.ФИО = ФИО.Фамилия + " " + ФИО.Имя + " " + ФИО.Отчество;
		
		Попытка
			ПаспортныеДанные = РегистрыСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(ДатаЗаполненияАнкеты, Новый Структура("ФизЛицо",Выборка.Учередитель))[0];
			Область.Параметры.Документ = ПаспортныеДанные.ДокументВид+" "+ПаспортныеДанные.Документ.Серия+
			" № " + ПаспортныеДанные.ДокументНомер + " выдан "+Формат(ПаспортныеДанные.ДокументДатаВыдачи,"ДЛФ=DD")+
			" " + ПаспортныеДанные.ДокументКемВыдан + " код подразделения " + ПаспортныеДанные.ДокументКодПодразделения;
		Исключение
			Область.Параметры.Документ = "-----";
		КонецПопытки;
		
		Попытка
			Область.Параметры.МестоЖительства = РегистрыСведений.КонтактнаяИнформация.СрезПоследних(ДатаЗаполненияАнкеты, Новый Структура("Объект, Тип",Выборка.Учередитель,Перечисления.ТипыКонтактнойИнформации.Адрес))[0].Представление;
		Исключение
		КонецПопытки;
		Область.Параметры.Доля = Формат(Выборка.Доля,"ЧЦ=6; ЧДЦ=3") + "%";
		Отчет.Вывести(Область);
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("УчередителиШапка");
	Отчет.Вывести(Область);
	
	Запрос  = Новый Запрос("ВЫБРАТЬ
	                       |	Учередители.Учередитель,
	                       |	Учередители.Доля
	                       |ИЗ
	                       |	РегистрСведений.Учередители КАК Учередители
	                       |ГДЕ
	                       |	Учередители.ЮрЛицо = &ЮрЛицо
	                       |	И Учередители.Учередитель ССЫЛКА Справочник.ЮридическиеЛица");
	Запрос.УстановитьПараметр("ЮрЛицо",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Область = Макет.ПолучитьОбласть("ШапкаЮрЛица");
		Отчет.Вывести(Область);
		Область = Макет.ПолучитьОбласть("ТелоЮрЛица");
		Область.Параметры.Наименование = Выборка.Учередитель.Наименование;
		Область.Параметры.ОГРН = Выборка.Учередитель.ОГРН;
		Область.Параметры.ИНН = Выборка.Учередитель.ИНН;
		Попытка
			Область.Параметры.МестоНахождения = РегистрыСведений.КонтактнаяИнформация.СрезПоследних(ДатаЗаполненияАнкеты, Новый Структура("Объект, Тип",Выборка.Учередитель,Перечисления.ТипыКонтактнойИнформации.Адрес))[0].Представление;
		Исключение
		КонецПопытки;
		Область.Параметры.Доля = Формат(Выборка.Доля,"ЧЦ=6; ЧДЦ=3") + "%";
		Отчет.Вывести(Область);
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		Область.Параметры.Наименование = Выборка.Учередитель.Наименование;
		Область.Параметры.ОГРН = Выборка.Учередитель.ОГРН;
		Область.Параметры.ИНН = Выборка.Учередитель.ИНН;
		Попытка
			Область.Параметры.МестоНахождения = РегистрыСведений.КонтактнаяИнформация.СрезПоследних(ДатаЗаполненияАнкеты, Новый Структура("Объект, Тип",Выборка.Учередитель,Перечисления.ТипыКонтактнойИнформации.Адрес))[0].Представление;
		Исключение
		КонецПопытки;
		Область.Параметры.Доля = Формат(Выборка.Доля,"ЧЦ=6; ЧДЦ=3") + "%";
		Отчет.Вывести(Область);
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Подвал");
	Область.Параметры.Дата = Формат(ТекущаяДата(),"ДЛФ=DD");
	Отчет.Вывести(Область);
	
	Возврат Отчет;
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Или ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Страна) И ЗначениеЗаполнено(Ссылка) И Страна <> Ссылка.Страна Тогда
		РегионИСтрана = Справочники.КлассификаторРегионов.РегионЮридическогоФизическогоЛица(Ссылка);
		Справочники.КлассификаторРегионов.УстановитьРегионДляКонтрагентов(Ссылка, РегионИСтрана);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		// Должно обязательно отработать в обработчике даже в режиме загрузки чтобы изменения были выгружены в бэкофис (BQ)
		РегистрацияИзмененийДляВыгрузки.ОтметитьИзмененияВСправочнике(ЭтотОбъект, Отказ);
		
		Возврат;
	КонецЕсли;
	
	РегистрацияИзмененийДляВыгрузки.ОтметитьИзмененияВСправочнике(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти