///////////////////////////////////////////////////////////////////////////////////
////#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Организация	= ?(Объект.Организация.Пустая(), Константы.ОрганизацияПоУмолчанию.Получить(), Объект.Организация);
		Объект.Автор		= ПараметрыСеанса.ТекущийПользователь;
		Объект.Изменил		= Справочники.Пользователи.ПустаяСсылка();
		Объект.Инициатор	= ?(НЕ ЗначениеЗаполнено(Объект.Инициатор), Константы.МестоХраненияПоУмолчанию.Получить(), Объект.Инициатор);
	КонецЕсли;
	ВыделятьСтрокиСЗаполненнымСубклиентомИНеподвтержденныеСубброкером();
	ЭмитентПриИзмененииНаСервере();
	УправлениеОтображениемРеквизитов();
	ПолучитьСтатусыНаСервереFCDR();
	Если Объект.СводноеРаскрытие.Количество() И НеобходимоВыводитьСводноеРСВ() Тогда
		ВывестиДеревоСводногоРаскрытия();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если (ТекущийОбъект.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.PARTAD)
		И (ТекущийОбъект.ТипСписка.Пустая()) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнен 'Тип списка' для ПАРТАД!!!", Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НеобходимоВыводитьСводноеРСВ() Тогда
		УстановитьВидимостьСводногоРаскрытия();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если (ИмяСобытия = "Документ.ЗапросСубброкеруНаРаскрытие.Изменен" И Параметр = Объект.Ссылка)
		Или (ИмяСобытия = "Документ.ЗапросСубброкеруНаРаскрытие.Отправлен" И Параметр = Объект.КДРеференс) Тогда 
		Прочитать();
		ЗаполнитьСписокВладельцевСервер();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

////#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////
////#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗаполнитьСписокВладельцев(Команда)
	Модифицированность = Истина;
	ЗаполнитьСписокВладельцевСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписокВладельцев(Команда)
	Модифицированность = Истина;
	Объект.СписокВладельцев.Очистить();
	Объект.ТребуетсяРаскрытиеПоСубклиентам = Ложь;
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыКД(Команда)
	Отбор = Новый Структура("ДокументКД", Объект.Ссылка);
	мПараметры = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.ЭтапыКД.ФормаСписка", мПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ОтправленныеУведомления(Команда)
	Отбор = Новый Структура("КД", Объект.Ссылка);
	мПараметры = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет.ФормаСписка", мПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСводноеРСВ(Команда)
	
	ПроверитьЗаполнениеСводногоРСВНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСводноеРСВ(Команда)
	ЗаполнитьТаблицуСводногоРаскрытияСпискаВладельцев();
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСоотвествияСтавокСУДК(Команда)
	ПроверкаСоотвествияСтавокСУДКНаСервере();
	Сообщить("Выполнена сверка ставок");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьРаскрытиеВФайл(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ВызватьИсключение "Документ не записан!";
	ИначеЕсли НетПравНаОсобогоКлиента() Тогда
			ВызватьИсключение "Есть клиент с особыми условиями";
	ИначеЕсли Объект.ТипЗагрузкиСписковРаскрытия = ПредопределенноеЗначение("Перечисление.ТипЗагрузкиСписковРаскрытия.FCDR_2017_02") Тогда
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		Диалог.Фильтр = "Файлы раскрытия (xml)|*.xml|Все файлы|*.*";
		Если Диалог.Выбрать() Тогда
			ФайлРаскрытия = Диалог.ПолноеИмяФайла;
			ВыгрузитьРаскрытиеВФайлFCDR(ФайлРаскрытия);
		КонецЕсли;
	ИначеЕсли Объект.ТипЗагрузкиСписковРаскрытия = ПредопределенноеЗначение("Перечисление.ТипЗагрузкиСписковРаскрытия.ISO20022") Тогда
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		Если Диалог.Выбрать() Тогда
			ВыгрузитьРаскрытиеВФайлISO(Диалог.Каталог);
		КонецЕсли;
	Иначе
		ВызватьИсключение СтрШаблон("Выгрузка типа загрузки %1 не поддерживается!", Объект.ТипЗагрузкиСписковРаскрытия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьРаскрытиеВФайлПоУмолчанию(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ВызватьИсключение "Документ не записан!";
	ИначеЕсли НетПравНаОсобогоКлиента() Тогда
			ВызватьИсключение "Есть клиент с особыми условиями";
	ИначеЕсли Объект.ТипЗагрузкиСписковРаскрытия = ПредопределенноеЗначение("Перечисление.ТипЗагрузкиСписковРаскрытия.FCDR_2017_02") Тогда
		ВыгрузитьРаскрытиеВФайлПоУмолчаниюFCDR();
	ИначеЕсли Объект.ТипЗагрузкиСписковРаскрытия = ПредопределенноеЗначение("Перечисление.ТипЗагрузкиСписковРаскрытия.ISO20022") Тогда
		ВыгрузитьРаскрытиеВФайлПоУмолчаниюНаСервереISO();
	Иначе
		ВызватьИсключение СтрШаблон("Выгрузка типа загрузки %1 не поддерживается!", Объект.ТипЗагрузкиСписковРаскрытия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРаскрытие(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ВызватьИсключение "Документ не записан!";
	ИначеЕсли НетПравНаОсобогоКлиента() Тогда
			ВызватьИсключение "Есть клиент с особыми условиями";
	ИначеЕсли Объект.ТипЗагрузкиСписковРаскрытия = ПредопределенноеЗначение("Перечисление.ТипЗагрузкиСписковРаскрытия.FCDR_2017_02") Тогда
		ОписаниеОшибки = "";
		ТекстHTML = ПоказатьРаскрытиеFCDRНаСервере(Объект.Ссылка, ОписаниеОшибки);
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки;
			Сообщение.Сообщить();
		КонецЕсли;
		Если ТекстHTML <> Неопределено Тогда
			ОткрытьФорму("Документ.РаскрытиеСпискаВладельцев.Форма.ВизуализацияHTML",
				Новый Структура("ЗначенияЗаполнения", ТекстHTML), ЭтотОбъект, ЭтотОбъект);
		КонецЕсли;
	ИначеЕсли Объект.ТипЗагрузкиСписковРаскрытия = ПредопределенноеЗначение("Перечисление.ТипЗагрузкиСписковРаскрытия.ISO20022") Тогда
		BizMsgIdr = ОбщегоНазначенияКлиентСервер.Транслит(СокрЛП(Объект.Номер));
		ПоказатьВизуализациюПоЦБISO(BizMsgIdr, Объект.ЦеннаяБумага1);
		ПоказатьВизуализациюПоЦБISO(BizMsgIdr, Объект.ЦеннаяБумага2);
	Иначе
		ВызватьИсключение СтрШаблон("Выгрузка типа загрузки %1 не поддерживается!", Объект.ТипЗагрузкиСписковРаскрытия);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НетПравНаОсобогоКлиента()
	НетПравНаОсобогоКлиента = Ложь;
	КлиентыСОсобымиУсловиями = Справочники.Контрагенты.ОсобыеУсловия(Объект.СписокВладельцев.Выгрузить(, "Клиент"), Истина);
	Если КлиентыСОсобымиУсловиями.Количество() > 0 
		И Не РегистрыСведений.ОтветственныеЛицаОрганизаций.ПользовательМожетРедактироватьОсобыеУсловия() Тогда
		Для Каждого Клиент Из КлиентыСОсобымиУсловиями Цикл
			НетПравНаОсобогоКлиента = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Особые условия: " + Клиент
				+ ". Выполнение операции доступно Ответственному за особых клиентов");
		КонецЦикла;
	КонецЕсли;

	Возврат НетПравНаОсобогоКлиента;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	ПолучитьСтатусыНаСервереFCDR();
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРаскрытияСписковВладельцев.Принято") 
		И Вопрос("Документ в статусе 'Принято'! Вы уверены, что хотите повторить его выгрузку?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	Если Модифицированность Или Объект.Ссылка.Пустая() Тогда
		Если Вопрос("Необходимо записать изменения документа, продолжать?", РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;
		Записать();
	КонецЕсли;
	ПрежнийСтатус = Объект.Статус;
	РезультатВыгрузки = ОткрытьФормуМодально("Документ.РаскрытиеСпискаВладельцев.Форма.ФормаВыгрузки", Новый Структура("Ключ", Объект.Ссылка), ЭтаФорма);
	Если ТипЗнч(РезультатВыгрузки) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгружено разделов: "+РезультатВыгрузки.КоличествоВыгруженных+", разделов с ошибками "+РезультатВыгрузки.КоличествоОшибок+".");
	Если ЗначениеЗаполнено(РезультатВыгрузки.ТекстОшибок) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатВыгрузки.ТекстОшибок);
	Иначе // документ мог быть перезаписан
		Прочитать();
	КонецЕсли;
	ЗаполнитьТаблицуСводногоРаскрытияСпискаВладельцев();
	Если Объект.Статус <> ПрежнийСтатус Тогда
		ПоказатьПредупреждение(, "Документу присвоен статус '"+Объект.Статус+"'!", , "Выгрузка разделов в НРД");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСводноеРаскрытие(Команда)
	БылАвтоматическийРежим = ( Объект.СводноеРаскрытие.Количество() = 0 );
	Если БылАвтоматическийРежим Тогда
		Если Вопрос("Перейти в режии ручного заполнения сводного раскрытия?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		ЗаполнитьСводноеРаскрытиеНаСервере();
	КонецЕсли;
	РезультатВыгрузки = ОткрытьФормуМодально("Документ.РаскрытиеСпискаВладельцев.Форма.ФормаРедактированияСводного", Новый Структура("Ключ", Объект.Ссылка), ЭтаФорма);
	Если РезультатВыгрузки = КодВозвратаДиалога.ОК Тогда
		Модифицированность = Истина;
		Объект.СводноеРаскрытиеРедактировалосьВручную = Истина;
		ВывестиДеревоСводногоРаскрытия();
	ИначеЕсли БылАвтоматическийРежим Тогда
		Объект.ШапкаСводного.Очистить();
		Объект.СводноеРаскрытие.Очистить();
	КонецЕсли;
	УстановитьВидимостьСводногоРаскрытия();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСводноеРаскрытие(Команда)
	Если Объект.СводноеРаскрытиеРедактировалосьВручную 
		И Вопрос("Сводное раскрытие редактировалось вручную, изменения будут утеряны!", РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьСводноеРаскрытиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьРедактированиеСводногоРаскрытия(Команда)
	Если Вопрос("Вернуться к автоматическому заполнению сводного РСВ?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Модифицированность = Истина;
		Объект.ШапкаСводного.Очистить();
		Объект.СводноеРаскрытие.Очистить();
		УстановитьВидимостьСводногоРаскрытия();
	КонецЕсли;
КонецПроцедуры

////#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////
////#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДораскрытиеПриИзменении(Элемент)
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ДораскрытиеДокументПриИзменении(Элемент)
	ДораскрытиеДокументПриИзмененииСервер();
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура СвязанныйКДПервыйПриИзменении(Элемент)
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент)
	ЦеннаяБумагаПриИзмененииНаСервере(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭмитентПриИзменении(Элемент = Неопределено)
	ЭмитентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидКорпоративногоДействияПриИзменении(Элемент)
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ТипЗагрузкиСписковРаскрытияПриИзменении(Элемент)
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура СписокВладельцевВыгодоприобретательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("Владелец", Элементы.СписокВладельцев.ТекущиеДанные.Клиент);
	Парам = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Справочник.Субклиенты.ФормаВыбора", Парам, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура СписокВладельцевСтатусОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеДляСтатуса = Новый Массив;
	Для Каждого Стр Из Элементы.СписокВладельцев.ТекущиеДанные.ДанныеДляСтатуса Цикл
		ДанныеДляСтатуса.Добавить(Новый Структура("Статус,СтатусОтказДопИнфо,НомерОтчетаНРД,ДатаОтчетаНРД,ОтчетОСтатусе",Стр.Статус,Стр.СтатусОтказДопИнфо,Стр.НомерОтчетаНРД,Стр.ДатаОтчетаНРД,Стр.ОтчетОСтатусе));
	КонецЦикла;
	
	Если ДанныеДляСтатуса.Количество()=0 Тогда
		Предупреждение("Нет данных о статусе");
	Иначе
		ОткрытьФорму("Обработка.РаскрытиеСписковВладельцевFCDR_2017_02.Форма.ДетализацияСтатусовСпискаРаскрытия",Новый Структура("ЗначенияЗаполнения",ДанныеДляСтатуса),ЭтаФорма,ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСводногоРаскрытияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ДеревоСводногоРаскрытияНазвание Или Поле = Элементы.ДеревоСводногоРаскрытияЗначение Тогда
		Возврат;
	КонецЕсли;
	ПутьКДанным = ПутьКДаннымТекущегоПоля();
	Значение = Элемент.ТекущиеДанные[ПутьКДанным];
	Если ЗначениеЗаполнено(Значение) Тогда
		ОткрытьЗначение(Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСводногоРаскрытияПередНачаломИзменения(Элемент, Отказ)
	ДанныеСтроки = Элементы.ДеревоСводногоРаскрытия.ТекущиеДанные;
	Если ПустаяСтрока(ДанныеСтроки.ИмяПоля) Тогда // это декоративная строка
		Отказ = Истина;
	ИначеЕсли ДанныеСтроки.ИмяПоля = "РазделСчетаДепоМХ" Или ДанныеСтроки.ИмяПоля = "НалоговаяСтавка" Тогда // структура редактируется только в диалоге
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСводногоРаскрытияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	ДанныеСтроки = Элементы.ДеревоСводногоРаскрытия.ТекущиеДанные;
	Если ПустаяСтрока(ДанныеСтроки.ИмяПоля) Тогда // это декоративная строка
		Возврат;
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ДеревоСводногоРаскрытияЗначение" Тогда
		Строка = ТекущаяСтрокаСводногоРаскрытия(ДанныеСтроки);
		СтароеЗначение = ?(Строка.Свойство("Ключ"), Строка.Значение, Строка[ДанныеСтроки.ИмяПоля]);
		НовоеЗначение = ДанныеСтроки.ТипЗначения.ПривестиЗначение(ДанныеСтроки.Значение);
		Если Не ЗначениеЗаполнено(НовоеЗначение) И ДанныеСтроки.ИмяПоля <> "НалоговаяСтавка" Тогда // ставка может быть 0
			Отказ = Истина;
			ПоказатьПредупреждение( , "Введено неверное значение!");
		ИначеЕсли СтароеЗначение <> НовоеЗначение Тогда
			Если Вопрос("Изменить '"+СтароеЗначение+"' на '"+НовоеЗначение+"'?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				Отказ = Истина;
				Возврат;
			ИначеЕсли Строка.Свойство("Ключ") Тогда
				Строка.Значение = НовоеЗначение;
			Иначе
				Строка[ДанныеСтроки.ИмяПоля] = НовоеЗначение;
			КонецЕсли;
			Объект.СводноеРаскрытиеРедактировалосьВручную = Истина;
			Если Строка.Свойство("Изменен") Тогда // это строка шапки сводного
				Строка.Изменен = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСводногоРаскрытияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если ОтменаРедактирования Тогда
		ДанныеСтроки = Элементы.ДеревоСводногоРаскрытия.ТекущиеДанные;
		Если ЗначениеЗаполнено(ДанныеСтроки.ИмяПоля) Тогда
			Строка = ТекущаяСтрокаСводногоРаскрытия(ДанныеСтроки);
			ДанныеСтроки.Значение = ?(Строка.Свойство("Ключ"), Строка.Значение, Строка[ДанныеСтроки.ИмяПоля]);
		КонецЕсли;
		Возврат;
	Иначе
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

////#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////
////#Область ВспомогательныеПроцедуры

&НаСервере
Процедура УправлениеОтображениемРеквизитов()
	// Видимость связанных КД
	Элементы.ГруппаКДСвязанноеВторое.Видимость	= ?(ЗначениеЗаполнено(Объект.СвязанныйВидКД1) И ЗначениеЗаполнено(Объект.СвязанныйРеференсКД1), Истина, Ложь);
	Если Не Элементы.ГруппаКДСвязанноеВторое.Видимость Тогда
		Объект.СвязанныйВидКД2		= Справочники.ВидыКорпоративныхДействий.ПустаяСсылка();
		Объект.СвязанныйРеференсКД2	= "";
	КонецЕсли;
	// Видимость второй ЦБ
	Элементы.ЦеннаяБумагаВторая.Видимость	= ?(ЗначениеЗаполнено(Объект.ЦеннаяБумага1), Истина, Ложь);
	Если НЕ Элементы.ЦеннаяБумагаВторая.Видимость Тогда
		Объект.ЦеннаяБумага2	= Справочники.ЦенныеБумаги.ПустаяСсылка();
	КонецЕсли;	
	
	Элементы.ГруппаДораскрытие.Видимость = Объект.Дораскрытие;
	
	Элементы.ГруппаКД.Доступность				= Не Объект.Дораскрытие;
	Элементы.ГруппаКДСвязанноеПервое.Доступность= Не Объект.Дораскрытие;
	Элементы.ГруппаКДСвязанноеВторое.Доступность= Не Объект.Дораскрытие;
	Элементы.ГруппаОрганизация.Доступность		= Не Объект.Дораскрытие;
	Элементы.ГруппаИнициатор.Доступность		= Не Объект.Дораскрытие;
	Элементы.ГруппаСчетДЕПО.Доступность			= Не Объект.Дораскрытие;
	Элементы.ГруппаБанковскийСчет.Доступность	= Не Объект.Дораскрытие;
	Элементы.ГруппаЦенныеБумаги.Доступность		= Не Объект.Дораскрытие;
	Элементы.ГруппаВходящийДокумент.Доступность	= Не Объект.Дораскрытие;
	Элементы.ДатаФиксации.Доступность			= Не Объект.Дораскрытие;
	Элементы.ДатаОкончанияПриема.Доступность	= Не Объект.Дораскрытие;
	
	Элементы.СписокВладельцевЦеннаяБумага.Видимость	= ЗначениеЗаполнено(Объект.ЦеннаяБумага2);

	КодыСобрания = Новый Массив;
	КодыСобрания.Добавить("BMET");
	КодыСобрания.Добавить("XMET");
	КодыСобрания.Добавить("MEET");
	
	Элементы.ГруппаДанныеСобрания.Видимость	= КодыСобрания.Найти(Объект.ВидКорпоративногоДействия.Код) <> Неопределено
		ИЛИ КодыСобрания.Найти(Объект.СвязанныйВидКД1.Код) <> Неопределено;
	Элементы.ГруппаБанковскийСчет.Видимость	= НЕ Элементы.ГруппаДанныеСобрания.Видимость;
		
	Элементы.ТипСписка.Видимость			= (Объект.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.PARTAD ИЛИ Объект.ТипЗагрузкиСписковРаскрытия = Перечисления.ТипЗагрузкиСписковРаскрытия.FCDR_2017_02);
	
	Если Объект.ТребуетсяРаскрытиеПоСубклиентам Тогда
		ЗаголовокНадписиРаскрытия	= "Требуется раскрытие по субклиентам!";
		ЦветТекстаНадписиРаскрытия	= WebЦвета.Черный;
		ШрифтТекстаНадписиРаскрытия	= Новый Шрифт(,, Истина);
	Иначе
		ЗаголовокНадписиРаскрытия	= "Не требуется раскрытие по субклиентам.";
		ЦветТекстаНадписиРаскрытия	= WebЦвета.ТемноСерый;
		ШрифтТекстаНадписиРаскрытия	= Новый Шрифт(,, Ложь);
	КонецЕсли;
	Элементы.ДекорацияРаскрытиеПоСубклиентам.Заголовок	= ЗаголовокНадписиРаскрытия;
	Элементы.ДекорацияРаскрытиеПоСубклиентам.ЦветТекста	= ЦветТекстаНадписиРаскрытия;
	Элементы.ДекорацияРаскрытиеПоСубклиентам.Шрифт		= ШрифтТекстаНадписиРаскрытия;
	
	Элементы.СписокВладельцевВыгодоприобретатель.Видимость	= Объект.ТребуетсяРаскрытиеПоСубклиентам;
	Элементы.СписокВладельцевПоДаннымСубброкера.Видимость	= Объект.ТребуетсяРаскрытиеПоСубклиентам;
	Элементы.СписокВладельцевДатаПолученияОтветаНД.Видимость= Объект.ТребуетсяРаскрытиеПоСубклиентам;
	
	ИспользоватьРегистрациюЗапросовСубброкера = WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкера(Объект.Дата); 
	Элементы.СписокВладельцевДатаОтправкиЗапросаНД.Видимость = ИспользоватьРегистрациюЗапросовСубброкера;
	Элементы.СписокВладельцевЗапросыОтветы.Видимость = ИспользоватьРегистрациюЗапросовСубброкера;
	Элементы.СписокВладельцевРазделСчетаДепо.Видимость = ИспользоватьРегистрациюЗапросовСубброкера;
	Если НеобходимоВыводитьСводноеРСВ() Тогда
		Элементы.СтраницаСводноеРаскрытиеВладельцевЦБ.Видимость = Истина;
	Иначе
		Элементы.СтраницаСводноеРаскрытиеВладельцевЦБ.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ШаблонFCDR_2017_02.Видимость = Объект.ТипЗагрузкиСписковРаскрытия=Перечисления.ТипЗагрузкиСписковРаскрытия.FCDR_2017_02;

	Если Не ЗначениеЗаполнено(Объект.ДатаФиксации) Тогда
		ЖирныйШрифт = Новый Шрифт(, , Истина);
		Элементы.ДатаФиксации.ШрифтЗаголовка = ЖирныйШрифт;
	Иначе
		ОбычныйШрифт = Новый Шрифт;
		Элементы.ДатаФиксации.ШрифтЗаголовка = ОбычныйШрифт;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВладельцевСервер()
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.ЗаполнитьСписокВладельцев();
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
	УправлениеОтображениемРеквизитов();
	Если НеобходимоВыводитьСводноеРСВ() Тогда
		ЗаполнитьТаблицуСводногоРаскрытияСпискаВладельцев();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДораскрытиеДокументПриИзмененииСервер()
	ДокументОбъект	= РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Заполнить(Объект.ДораскрытиеДокумент);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ЦеннаяБумагаПриИзмененииНаСервере(ИмяЭлемента)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ДокументОбъект.ЦеннаяБумага1 = ДокументОбъект.ЦеннаяБумага2 Тогда
		ДокументОбъект.ЦеннаяБумага2 = Справочники.ЦенныеБумаги.ПустаяСсылка();
	КонецЕсли;
	
	Если ИмяЭлемента = "ЦеннаяБумага1" Тогда
		Если Не ДокументОбъект.ЦеннаяБумага1.Пустая() Тогда
			ДокументОбъект.Эмитент = ДокументОбъект.ЦеннаяБумага1.Эмитент;
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "ЦеннаяБумага2" Тогда
		Если Не ДокументОбъект.ЦеннаяБумага2.Пустая() Тогда
			ДокументОбъект.Эмитент	= ДокументОбъект.ЦеннаяБумага2.Эмитент;
		КонецЕсли;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	ЭмитентПриИзмененииНаСервере();
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПоЭмитентуСервер()
	Если Не Объект.Эмитент.Пустая() Тогда
		НоваяСвязь	= Новый СвязьПараметраВыбора("Отбор.Эмитент", "Объект.Эмитент", РежимИзмененияСвязанногоЗначения.НеИзменять);
		НовыйМассив	= Новый Массив;
		НовыйМассив.Добавить(НоваяСвязь);
		НовыеСвязи	= Новый ФиксированныйМассив(НовыйМассив);
		Элементы.ЦеннаяБумага1.СвязиПараметровВыбора	= НовыеСвязи;
		Элементы.ЦеннаяБумага2.СвязиПараметровВыбора	= НовыеСвязи;
	Иначе
		Элементы.ЦеннаяБумага1.СвязиПараметровВыбора	= Новый ФиксированныйМассив(Новый Массив);
		Элементы.ЦеннаяБумага2.СвязиПараметровВыбора	= Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЭмитентПриИзмененииНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ЦенныеБумаги = Новый Массив;
	ЦенныеБумаги.Добавить("ЦеннаяБумага1");
	ЦенныеБумаги.Добавить("ЦеннаяБумага2");
	Для Каждого ЦБ Из ЦенныеБумаги Цикл
		Если ДокументОбъект[ЦБ].Эмитент <> ДокументОбъект.Эмитент Тогда
			ДокументОбъект[ЦБ] = Справочники.ЦенныеБумаги.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	УстановитьСвязиПоЭмитентуСервер();
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаСервере
Процедура ВыделятьСтрокиСЗаполненнымСубклиентомИНеподвтержденныеСубброкером()
	
	ИспользоватьРегистрациюЗапросовСубброкера =  WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкера(Объект.Дата);
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Кирпичный);
	
	ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Объект.ТребуетсяРаскрытиеПоСубклиентам");
	ЭлементУсловия.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение	= Истина;
	ЭлементУсловия.Использование	= Истина;
	
	ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Объект.СписокВладельцев.Субброкер");
	ЭлементУсловия.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение	= Истина;
	ЭлементУсловия.Использование	= Истина;

	ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Объект.СписокВладельцев.ПоДаннымСубброкера");
	ЭлементУсловия.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение	= Ложь;
	ЭлементУсловия.Использование	= Истина;
		
	Если ИспользоватьРегистрациюЗапросовСубброкера Тогда 
	
		ЭлементОформленияРасхождения = УсловноеОформление.Элементы.Добавить();
		ЭлементОформленияРасхождения.Использование = Истина;
		ЭлементОформленияРасхождения.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Кирпичный);
		
		ЭлементУсловия = ЭлементОформленияРасхождения.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Объект.СписокВладельцев.ЕстьРасхождения");
		ЭлементУсловия.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементУсловия.ПравоеЗначение	= Истина;
		ЭлементУсловия.Использование	= Истина;
	
    КонецЕсли;
	
	Для Каждого ТекЭлемент Из Элементы.СписокВладельцев.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТекЭлемент.Имя);
		
		Если ИспользоватьРегистрациюЗапросовСубброкера Тогда 
			ОформляемоеПоле = ЭлементОформленияРасхождения.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТекЭлемент.Имя);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСводногоРаскрытияСпискаВладельцев()
	
	ТДСводноеРСВ = Новый ТабличныйДокумент;
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Иначе // если объект не заблокирован формой, он может быть перезаписан регламентынми заданиями
		ТекущийОбъект = Объект.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	ТекущийОбъект.ЗаполнитьТабличныйДокументДляСводногоРСВ(ТДСводноеРСВ);
	СводноеРаскрытиеСпискаВладельцев.Очистить();
	СводноеРаскрытиеСпискаВладельцев.Вывести(ТДСводноеРСВ);
	СводноеРаскрытиеСпискаВладельцев.ФиксацияСверху = 1;
	
КонецПроцедуры

&НаСервере
Функция НеобходимоВыводитьСводноеРСВ()
	
	ДатаВводаQI = Константы.ДатаВводаСхемыУведомленийWTRC_QI.Получить();
	Если ЗначениеЗаполнено(ДатаВводаQI) И Объект.Дата >= ДатаВводаQI Тогда
		Если Объект.ВидКорпоративногоДействия.Код = "WTRC" И Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(Объект.ЦеннаяБумага1) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ПроверитьЗаполнениеСводногоРСВНаСервере()
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.ПроверитьЗаполнениеСводногоРСВ();
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаСоотвествияСтавокСУДКНаСервере()
	
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.СверкаСтавок();
		
КонецПроцедуры

&НаКлиенте
Процедура СообщитьЕстьКлиентыБезВыгодоприобретателей(УКБезВыгодоприобретателей)
	Если НЕ ПустаяСтрока(УКБезВыгодоприобретателей) Тогда
		Сообщение = Новый СообщениеПользователю;
		ЗаголовокСообщения = "Найдены Управляющие компании без Выгодоприобретателей";
		Сообщение.Текст = ЗаголовокСообщения + ":" + УКБезВыгодоприобретателей;
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСтатусВыгруженоНаСервере(Документ)
	Обр = Обработки.РаскрытиеСписковВладельцевFCDR_2017_02.Создать();
	Обр.ДокументРСВ = Документ;
	Обр.УстановитьСтатусДокументаРСВ(Перечисления.СтатусыРаскрытияСписковВладельцев.Выгружено);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыгрузитьРаскрытиеВФайлFCDRНаСервере(Документ, ОписаниеОшибки,УКБезВыгодоприобретателей)
	СообщениеВНРД = Неопределено;
	ОписаниеОшибки = "";
	Обр = Обработки.РаскрытиеСписковВладельцевFCDR_2017_02.Создать();
	Обр.ДокументРСВ = Документ;
	Если Обр.ОпределитьШаблонРаскрытия(ОписаниеОшибки) Тогда
		СообщениеВНРД = Обр.ВыгрузитьРаскрытиеСписка_FCDR_17_02(ОписаниеОшибки,УКБезВыгодоприобретателей);
	КонецЕсли;
	Возврат СообщениеВНРД;
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьРаскрытиеВФайлПоУмолчаниюFCDRНаСервере(Документ,СообщениеВНРД,ОписаниеОшибки)
	Обр = Обработки.РаскрытиеСписковВладельцевFCDR_2017_02.Создать();
	Обр.ДокументРСВ = Документ;
	Ошибка = Обр.ВыгрузитьВФайлПоУмолчанию(СообщениеВНРД);
	Если Ошибка<>Неопределено Тогда
		ОписаниеОшибки = Ошибка.СообщениеПользователю;
	КонецЕсли;
КонецПроцедуры
&НаСервереБезКонтекста
Функция ВыгрузитьРаскрытиеВФайлПоУмолчаниюFCDRНаСервере(Документ, ОписаниеОшибки, УКБезВыгодоприобретателей)
	СообщениеВНРД = Неопределено;
	ОписаниеОшибки = "";
	Обр = Обработки.РаскрытиеСписковВладельцевFCDR_2017_02.Создать();
	Обр.ДокументРСВ = Документ;
	Если Обр.ОпределитьШаблонРаскрытия(ОписаниеОшибки) Тогда
		СообщениеВНРД = Обр.ВыгрузитьРаскрытиеСписка_FCDR_17_02(ОписаниеОшибки, УКБезВыгодоприобретателей);
		Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) И ПустаяСтрока(УКБезВыгодоприобретателей) Тогда
			ЗаписатьРаскрытиеВФайлПоУмолчаниюFCDRНаСервере(Документ, СообщениеВНРД, ОписаниеОшибки);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	Возврат СообщениеВНРД;
КонецФункции

&НаСервереБезКонтекста
Функция ПоказатьРаскрытиеFCDRНаСервере(Документ,ОписаниеОшибки)
	СообщениеВНРД = Неопределено;
	ОписаниеОшибки = "";
	Обр = Обработки.РаскрытиеСписковВладельцевFCDR_2017_02.Создать();
	Обр.ДокументРСВ = Документ;
	Результат = "Неопределено";
	Если Обр.ОпределитьШаблонРаскрытия(ОписаниеОшибки) Тогда
		СообщениеВНРД = Обр.ВыгрузитьРаскрытиеСписка_FCDR_17_02(ОписаниеОшибки);
		Если СообщениеВНРД<>Неопределено Тогда
			Результат = Обр.ВизуализацияHTML(СообщениеВНРД);
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПоказатьВизуализациюПоЦБISO(BizMsgIdr, ЦеннаяБумага)
	Если ЗначениеЗаполнено(ЦеннаяБумага) Тогда
		ДанныеДляВыгрузки = ДанныеДляФормированияСообщенияНаСервереISO(BizMsgIdr, ЦеннаяБумага);
		ТекстHTML = ВизуализацияHTML_ISO(ДанныеДляВыгрузки.СтрокаXML);
		ОткрытьФорму("Документ.РаскрытиеСпискаВладельцев.Форма.ВизуализацияHTML",
			Новый Структура("ЗначенияЗаполнения", ТекстHTML), ЭтотОбъект, ЦеннаяБумага);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВизуализацияHTML_ISO(СтрокаДанных)
	Возврат Документы.РаскрытиеСпискаВладельцев.ВизуализацияHTML_ISO(СтрокаДанных);
КонецФункции

&НаСервере
Процедура ПолучитьСтатусыНаСервереFCDR()
	дрв = Обработки.РаскрытиеСписковВладельцевFCDR_2017_02.ПолучитьДетальныеСтатусы(Объект.Ссылка);
	Для Каждого СтрДоговор Из дрв.Строки Цикл
		Статусы_Выгодоприобретатели = СтрДоговор.Строки;
		Для Каждого СтрВыгодоприобретатель Из СтрДоговор.Строки Цикл
			ОтборСтрок = Новый Структура("Договор",СтрДоговор.Договор);
			Если ЗначениеЗаполнено(СтрВыгодоприобретатель.Выгодоприобретатель) Тогда
				ОтборСтрок.Вставить("Выгодоприобретатель",СтрВыгодоприобретатель.Выгодоприобретатель);
			КонецЕсли;
			НайдСтр = Объект.СписокВладельцев.НайтиСтроки(ОтборСтрок);
			Для Каждого СтрДокумента Из НайдСтр Цикл
				Статусы = СтрВыгодоприобретатель.Строки;
				ТекСтатус = Статусы[0].Статус;
				Если ЗначениеЗаполнено(Статусы[0].СтатусОтказДопИнфо) Тогда
					ТекСтатус = ТекСтатус+" - "+Статусы[0].СтатусОтказДопИнфо;
				КонецЕсли;
				СтрДокумента.Статус = ТекСтатус;
				
				Для Каждого Стр Из Статусы Цикл
					НовСтр = СтрДокумента.ДанныеДляСтатуса.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр,Стр);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(дрв,"СтатусыСтрокРаскрытия");
КонецПроцедуры


Процедура ВывестиДеревоСводногоРаскрытия()
	
	ЭлементыРазделов = ДеревоСводногоРаскрытия.ПолучитьЭлементы();
	ЭлементыРазделов.Очистить();
	Таблица = Объект.ШапкаСводного.Выгрузить();
	ДобавитьЭлементШапкиСводногоРаскрытия(ЭлементыРазделов, Таблица, "CORPORATE ACTION NUMBER", "CorpActionNumber");
	ДобавитьЭлементШапкиСводногоРаскрытия(ЭлементыРазделов, Таблица, "SECURITY CODE (ISIN OR COMMON CODE)", "SecurityCode");
	ДобавитьЭлементШапкиСводногоРаскрытия(ЭлементыРазделов, Таблица, "SECURITY NAME", "SecurityName");
	ДобавитьЭлементШапкиСводногоРаскрытия(ЭлементыРазделов, Таблица, "DEPOSITOR CODE", "DepositorCode");
	ДобавитьЭлементШапкиСводногоРаскрытия(ЭлементыРазделов, Таблица, "QI-EIN NUMBER", "QI_EIN");
	ДобавитьЭлементШапкиСводногоРаскрытия(ЭлементыРазделов, Таблица, "TYPE OF ALLOCATION INFORMATION", "AllocationType");
	ДобавитьЭлементШапкиСводногоРаскрытия(ЭлементыРазделов, Таблица, "RECORD DATE", "RecordDate");
	ДобавитьЭлементШапкиСводногоРаскрытия(ЭлементыРазделов, Таблица, "SECURITIES CLEARANCE ACCOUNT NUMBER", "AccountNumber");
	
	Разделы = РаскрытиеСпискаВладельцев.РазделыСводногоРаскрытия(Объект);
	Запрос = Документы.ВыгрузкаРазделаРСВвВышестоящийДепозитарий.ЗапросСостоянийВыгрузкиРазделов(Объект.Ссылка, Разделы);
	СтатусыВФайловомШлюзе = Запрос.Выполнить().Выгрузить();
	
	Элемент = Неопределено;
	Для Каждого Строка Из Объект.СводноеРаскрытие Цикл
		Если Строка.НалоговаяСтавка = Неопределено Тогда // это итоговая запись по разделу
			СтрокаСтатуса = СтатусыВФайловомШлюзе.Найти(Строка.РазделСчетаДепоМХ, "Раздел");
			Если СтрокаСтатуса <> Неопределено Тогда
				Строка.СтатусВФайловомШлюзе = СтрокаСтатуса.Статус;
			КонецЕсли;
			ДобавитьЭлементСводногоРаскрытия(ЭлементыРазделов, Строка, "SUBACCOUNT NUMBER", "РазделСчетаДепоМХ");
			ДобавитьЭлементСводногоРаскрытия(ЭлементыРазделов, Строка, "TOTAL RECORD DATE BALANCE", "КоличествоЦБ");
			Элемент = ЭлементыРазделов.Добавить();
			Элемент.Название = "BREAKDOWN:";
			ЭлементыРаскрытия = Элемент.ПолучитьЭлементы();
			Продолжить;
		КонецЕсли;
		Если Строка.СтатусПоГлаве4 = Неопределено  // Группировкм по ставке и статусу выводятся вместе
			Или Элемент = Неопределено Тогда // Своное раскрытие заполнено некорректно
			Продолжить;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Строка.Договор) Тогда // заполненность договора - косвенный признак детальных записей; можно использовать другое неитоговое поле
			ДобавитьЭлементСводногоРаскрытия(ЭлементыРаскрытия, Строка, "QUANTITY OF SECURITIES", "КоличествоЦБ");
			ДобавитьЭлементСводногоРаскрытия(ЭлементыРаскрытия, Строка, "CHAPTER 3 OR CHAPTER 4 WITHHOLDING TAX RATE", "НалоговаяСтавка");
			ДобавитьЭлементСводногоРаскрытия(ЭлементыРаскрытия, Строка, "CHAPTER 4 WITHHOLDING RATE POOL", "СтатусПоГлаве4");
			ЭлементыДетализации = ЭлементыРаскрытия.Добавить().ПолучитьЭлементы();
			Продолжить;
		КонецЕсли;
		ДобавитьЭлементСводногоРаскрытия(ЭлементыДетализации, Строка);
	КонецЦикла;
	Элементы.СводноеРаскрытиеОтредакировано.Видимость = Объект.СводноеРаскрытиеРедактировалосьВручную;
	
КонецПроцедуры

Процедура ДобавитьЭлементШапкиСводногоРаскрытия(Элементы, Таблица, Название, ИмяПоля)
	Строка = Таблица.Найти(ИмяПоля, "Ключ");
	Если Строка = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден элемент шапки сводного раскрытия '"+ИмяПоля+"'");
		Возврат;
	КонецЕсли;
	Элемент = Элементы.Добавить();
	Элемент.Название = Название+":";
	Элемент.ИмяПоля = ИмяПоля;
	Элемент.Значение = Строка.Значение;
	Типы = Новый Массив;
	Типы.Добавить(ТипЗнч(Строка.Значение));
	Элемент.ТипЗначения = Новый ОписаниеТипов(Типы);
КонецПроцедуры

Процедура ДобавитьЭлементСводногоРаскрытия(Элементы, Строка, Название = "", ИмяПоля = "")
	Элемент = Элементы.Добавить();
	Если ПустаяСтрока(Название) Тогда // Детальные записи
		ЗаполнитьЗначенияСвойств(Элемент, Строка);
		ИмяПоля = "Договор";
		//Элемент.Значение = Строка[ИмяПоля];
	Иначе
		Элемент.Название = Название+":";
		Элемент.НомерСтроки = Строка.НомерСтроки;
	КонецЕсли;
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		Элемент.ИмяПоля = ИмяПоля;
		Элемент.Значение = Строка[ИмяПоля];
		Типы = Новый Массив;
		Типы.Добавить(ТипЗнч(Строка[ИмяПоля]));
		Элемент.ТипЗначения = Новый ОписаниеТипов(Типы);
		Если ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.РазделыСчетаДепоМХ") Тогда
			Элемент.СтатусВФайловомШлюзе = Строка.СтатусВФайловомШлюзе;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ТекущаяСтрокаСводногоРаскрытия(ДанныеСтроки)
	Если ДанныеСтроки.НомерСтроки = 0 Тогда
		Строки = Объект.ШапкаСводного.НайтиСтроки(Новый Структура("Ключ", ДанныеСтроки.ИмяПоля));
		Если Строки.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдено поле шапки сводного раскрытия '"+ДанныеСтроки.ИмяПоля+"'");
			Возврат Неопределено;
		КонецЕсли;
		Возврат Строки[0];
	Иначе
		Возврат Объект.СводноеРаскрытие[ДанныеСтроки.НомерСтроки-1];
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаполнитьСводноеРаскрытиеНаСервере()
	Модифицированность = Истина;
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьСводноеРаскрытие();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	ВывестиДеревоСводногоРаскрытия();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСводногоРаскрытия()
	ЗаполняетсяАвтоматически = ( Объект.СводноеРаскрытие.Количество() = 0 );
	Элементы.ГруппаАвтоматическогоСводногоРаскрытия.Видимость = ЗаполняетсяАвтоматически;
	Элементы.ГруппаРучногоСводногоРаскрытия.Видимость = Не ЗаполняетсяАвтоматически;
	Если ЗаполняетсяАвтоматически Тогда
		ЗаполнитьТаблицуСводногоРаскрытияСпискаВладельцев();
	КонецЕсли;
КонецПроцедуры

Функция ПутьКДаннымТекущегоПоля()
	Элемент = Элементы.ДеревоСводногоРаскрытия;
	Поле = Элемент.ТекущийЭлемент;
	Возврат Сред(Поле.ПутьКДанным, СтрДлина(Элемент.ПутьКДанным)+2);
КонецФункции

&НаКлиенте
Процедура ДатаФиксацииПриИзменении(Элемент)
	УправлениеОтображениемРеквизитов();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьРаскрытиеВФайлПоУмолчаниюНаСервереISO()
	ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
	ДокументОбъект.ВыгрузитьРаскрытиеСпискаВладельцевISO();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьРаскрытиеВФайлISO(Каталог)
	
	BizMsgIdr = ОбщегоНазначенияКлиентСервер.Транслит(СокрЛП(Объект.Номер));
	
	НеобходимоЗафиксироватьВыгрузкуЭтапа = Ложь;
	СформироватьФайлПоЦБ_ISO(Каталог, Объект.ЦеннаяБумага1, BizMsgIdr, 1, НеобходимоЗафиксироватьВыгрузкуЭтапа);
	Если НеобходимоЗафиксироватьВыгрузкуЭтапа Тогда
		ЗафиксироватьВыгрузкуЭтапаНаСервере(BizMsgIdr, 1);
	КонецЕсли;
	
	НеобходимоЗафиксироватьВыгрузкуЭтапа = Ложь;
	СформироватьФайлПоЦБ_ISO(Каталог, Объект.ЦеннаяБумага2, BizMsgIdr, 2, НеобходимоЗафиксироватьВыгрузкуЭтапа);
	Если НеобходимоЗафиксироватьВыгрузкуЭтапа Тогда
		ЗафиксироватьВыгрузкуЭтапаНаСервере(BizMsgIdr, 2, 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайлПоЦБ_ISO(Каталог, ЦеннаяБумага, BizMsgIdr, Префикс, НеобходимоЗафиксироватьВыгрузкуЭтапа)
	
	Если Не ЗначениеЗаполнено(ЦеннаяБумага) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляВыгрузки = ДанныеДляФормированияСообщенияНаСервереISO(BizMsgIdr, ЦеннаяБумага);
	
	ТекстXML = Новый ТекстовыйДокумент;
	ТекстXML.ДобавитьСтроку(ДанныеДляВыгрузки.СтрокаXML);
	ИмяФайла = Объект.Номер + "_" + Формат(ОбщегоНазначенияВызовСервера.ДатаСеанса(), "ДФ=ddMMyyyy") + "_" + Префикс;
	ПолныйПутьКФайлу = Каталог + "\" + ИмяФайла + ".xml";
	Попытка
		ТекстXML.Записать(ПолныйПутьКФайлу);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сформирован файл " + ПолныйПутьКФайлу);
		НеобходимоЗафиксироватьВыгрузкуЭтапа = Истина;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не удалось записать файл!
			|
			|Возможно указанный в настройках каталог 'Каталог ISO' недоступен или путь некорректен!");
	КонецПопытки;
	
	ОбъектCSV = Новый ТекстовыйДокумент;
	ОбъектCSV.УстановитьТипФайла("windows-1251");
	ОбъектCSV.УстановитьТекст(ДанныеДляВыгрузки.СтрокаCSV);
	ПолныйПутьКФайлу = Каталог + "\" + ИмяФайла + ".csv";
	Попытка
		ОбъектCSV.Записать(ПолныйПутьКФайлу);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сформирован файл " + ПолныйПутьКФайлу);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не удалось записать файл CSV!
			|
			|Возможно указанный в настройках каталог 'Каталог ISO для CSV' недоступен или путь некорректен!");
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ДанныеДляФормированияСообщенияНаСервереISO(BizMsgIdr, ЦеннаяБумага)
	ЗапросСпискаКодовЗагрузкиЦБ = Документы.РаскрытиеСпискаВладельцев.ЗапросДляСпискаКодовЗагрузкиЦБ(Объект.Дата);
	ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
	ДокументОбъект.ПроверитьЗаполнениеРСВДляВыгрузкиISO();
	ДокументОбъект.ПроверитьОшибкиПоКлиентам();
	ВыборкаПоЦБ = ДокументОбъект.ДанныеПоРаскрытию(ЦеннаяБумага);
	ДанныеДляВыгрузки = ДокументОбъект.ДанныеДляФормированияСообщенияПоЦБ_ISO(ЗапросСпискаКодовЗагрузкиЦБ,
		ЦеннаяБумага, ВыборкаПоЦБ, , , BizMsgIdr);
	Возврат ДанныеДляВыгрузки;
КонецФункции

&НаСервере
Процедура ЗафиксироватьВыгрузкуЭтапаНаСервере(BizMsgIdr, Префикс, СдвигПоВремениСек = 0)
	BizMsgIdr_СПрефиксом = Документы.РаскрытиеСпискаВладельцев.BizMsgIdr_СПрефиксом(BizMsgIdr, Префикс);
	Документы.РаскрытиеСпискаВладельцев.ЗарегистрироватьЭтапКД(Объект.Ссылка, BizMsgIdr_СПрефиксом, СдвигПоВремениСек);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьРаскрытиеВФайлПоУмолчаниюFCDR()
	ОписаниеОшибки = "";
	УКБезВыгодоприобретателей = "";
	СообщениеВНРД = ВыгрузитьРаскрытиеВФайлПоУмолчаниюFCDRНаСервере(Объект.Ссылка, ОписаниеОшибки, УКБезВыгодоприобретателей);
	СообщитьЕстьКлиентыБезВыгодоприобретателей(УКБезВыгодоприобретателей);
	Если СообщениеВНРД <> Неопределено Тогда
		ЗаписатьРаскрытиеВФайлПоУмолчаниюFCDRНаСервере(Объект.Ссылка, СообщениеВНРД, ОписаниеОшибки);
		Предупреждение("Файл сформирован");
	КонецЕсли;
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки;
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьРаскрытиеВФайлFCDR(ФайлРаскрытия)
	ОписаниеОшибки = "";
	УКБезВыгодоприобретателей = "";
	СообщениеВНРД = ВыгрузитьРаскрытиеВФайлFCDRНаСервере(Объект.Ссылка, ОписаниеОшибки, УКБезВыгодоприобретателей);
	СообщитьЕстьКлиентыБезВыгодоприобретателей(УКБезВыгодоприобретателей);
	Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) И ПустаяСтрока(УКБезВыгодоприобретателей) Тогда
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ФайлРаскрытия, "windows-1251");
		ЗаписьXML.ЗаписатьБезОбработки(СообщениеВНРД.ТекстДокумента);
		ЗаписьXML.Закрыть();
		УстановитьСтатусВыгруженоНаСервере(Объект.Ссылка);
		Предупреждение("Файл сформирован");
	КонецЕсли;
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки;
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

////#КонецОбласти
