
// Возвращает элемент справочника по заданному виду КД, в случае неудачного поиска
// возвращает Неопределено
// 
// Возвращаемое значение:
//  СправочникСсылка.ТипыВыплатIRS
//
Функция НайтиПоВидуКД(ВидКД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	ТипыВыплатIRS.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТипыВыплатIRS КАК ТипыВыплатIRS
	|ГДЕ
	|	ТипыВыплатIRS.ВидКД = &ВидКД
	|	И НЕ ТипыВыплатIRS.ПометкаУдаления";
	Запрос.УстановитьПараметр("ВидКД", ВидКД);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Если Выборка.Количество() <> 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции
