#Область ПрограммныйИнтерфейс

Процедура ВыводПредупреждения(Текст, ТаймАут = 0, Заголовок = "") Экспорт
	
	#Если ВнешнееСоединение Тогда
		ВызватьИсключение Текст;	
	#ИначеЕсли Клиент Тогда
		Предупреждение(Текст, ТаймАут, Заголовок);
	#КонецЕсли
	
КонецПроцедуры

Процедура ВыводСостояния(Текст) Экспорт
	
	#Если Клиент Тогда
		Состояние(Текст);
	#КонецЕсли
	
КонецПроцедуры

Процедура ВыводСообщения(Текст, Важность) Экспорт
	
	#Если ВнешнееСоединение Тогда
		ВызватьИсключение Текст;
		//#ИначеЕсли Сервер Тогда
		//	ВызватьИсключение Текст;
	#Иначе
		Сообщить(Текст, Важность);
	#КонецЕсли
	
КонецПроцедуры

Функция ПолучитьПараметрыУчетаПоЦБ(Портфель, Дата) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетнаяПолитикаЦенныеБумагиСрезПоследних.СпособСписанияВУ
	               |ИЗ
	               |	РегистрСведений.УчетнаяПолитикаЦенныеБумаги.СрезПоследних(&МоментВремени, Портфель = &Портфель) КАК УчетнаяПолитикаЦенныеБумагиСрезПоследних";	
	Запрос.УстановитьПараметр("МоментВремени", Дата);
	Запрос.УстановитьПараметр("Портфель", Портфель);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВыводСообщения("На дату "+Формат(Дата, "ДЛФ = Д")+" данных по параметрам учета ЦБ для портфеля "+Портфель+" нет. Документ не проведен!", СтатусСообщения.ОченьВажное);
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.СпособСписанияВУ.Пустая() Тогда
			
			ВыводСообщения("На дату "+Формат(Дата, "ДЛФ = Д")+" не определен метод списания ЦБ. Документ не проведен!", СтатусСообщения.ОченьВажное);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат Выборка;
	
КонецФункции

Функция ПолучитьОсновнуюОрганизацию(ТекущийПользователь) Экспорт
	
	Данные = Новый Структура("Пользователь,Настройка", ТекущийПользователь,ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация);
	ОсновнаяОрганизация = РегистрыСведений.НастройкиПользователей.Получить(Данные).Значение;
	
	Возврат ОсновнаяОрганизация;
	
КонецФункции

// Процедура - обработчик ввода нового документа.
// ОперацияЦБ
Процедура ВводНовогоДокумента(ТекущийПользователь, ТекущиеЭлементыФормы) Экспорт
	
	//Получим организацию по умолчанию
	ТекущиеЭлементыФормы.Организация.Значение = ПолучитьОсновнуюОрганизацию(ТекущийПользователь);
	//валюта
	ТекущиеЭлементыФормы.Валюта.Значение = Справочники.Валюты.НайтиПоКоду("643");
	ТекущиеЭлементыФормы.Валюта.БыстрыйВыбор = Истина;

КонецПроцедуры

// Функция вызывается перед открытием формы документа. 
// Возвращает истину если разрешается открыть документ и ложь если не разрешается.
//
// Параметры
//  прОбъект     – ДокументОбъект – объект типа документа.
//  прФорма      – форма – форма документа.
//
// Возвращаемое значение:
//   Результат - булево - истина - успешный результат выполнения функции.
//
Функция глПередОткрытиемДокумента(прОбъект, прФорма) Экспорт

	Результат = Истина;
	
	Заголовок = "" + прОбъект;
	
	ЭтоНовыйДокумент = прОбъект.ЭтоНовый();
	
	//Проверка на дату запрета редактирования
	ДатаЗапрета = Константы.ДатаЗапретаРедактирования.Получить();
	
	Если НЕ ЭтоНовыйДокумент И ДатаЗапрета >= прОбъект.Дата Тогда
		ТекстСообщения = "Дата документа за пределами даты запрета редактирования. Редактирование документа запрещено.";
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, , Заголовок, СтатусСообщения.Информация);
		прФорма.ТолькоПросмотр = Истина;
	КонецЕсли;

	//Отображение информационного подвала.
	//Проверим наличие в форме информационного подвала
	Если (прФорма.ЭлементыФормы.Найти("нпНадписьПодвала") <> Неопределено) Тогда
		
		тхтНадписьПодвала = "" + ?(ОбщегоНазначения.ЗначениеНеЗаполнено(прОбъект.Автор), "Без авторизации", прОбъект.Автор)
						  + Символы.ПС
						  + ?(ОбщегоНазначения.ЗначениеНеЗаполнено(прОбъект.Изменил), "Без авторизации", прОбъект.Изменил);
		прФорма.ЭлементыФормы.нпНадписьПодвала.Заголовок = тхтНадписьПодвала;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует строку представления документа для сообщений при записи.
//
// Параметры
//  Документ     - ссылка на записываемый документ.
//	ВидСобытия   - строка, событие документв ("Запись", "Проведение", "Ввод на основании")
//
// Возвращаемое значение
//  Строка с представлением документа.
//
Функция ПредставлениеДокументаПоСобытию(Документ, ВидСобытия="") Экспорт

	МетаданныеДокумента = Документ.Метаданные();

	ВидОперацииСтр = "";

	Если Найти(Строка(ТипЗнч(Документ)), "Документ") > 0 Тогда
		
		Заголовок = ?(ВидСобытия="", "Документ", ВидСобытия+" документа");
		
	Иначе
		
		Заголовок = ?(ВидСобытия="", "Документ", ВидСобытия+" регистра");
		
	КонецЕсли;
	
	Возврат Заголовок + ": " + СокрЛП(Документ) + ВидОперацииСтр;

КонецФункции

Процедура ПометитьНаУдалениеСвязанныеОбъекты(Документ) Экспорт
	
	СчетаДепо = Справочники.СчетаДепо;
	СчетаДепо = Справочники.СчетаДепоМХ;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗакрытиеСчетаДепо") Тогда
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ОткрытиеСчетаДепо") Тогда
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ОткрытиеРазделаСчетаДепо") Тогда
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.Поручение") Тогда
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура сравнивает дату документа с датой запрета. Если начало дня даты документа совпадает
// Параметры:
//  ФормаД - ФормаКлиентскогоПриложения
//  ТекущийОбъект - ДокументОбъект
Процедура ПриЧтенииНаСервереДокумента(Форма, ТекущийОбъект) Экспорт
	Если ДействуетЗапрет(ТекущийОбъект) Тогда
		Форма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

// Процедура сравнивает дату документа с датой запрета. Если начало дня даты документа совпадает
// с датой запрета или раньше нее, то параметр Отказ устанавливается в Истина.
// Параметры:
//  Источник		 - Документ
//  Отказ			 - Булево
//  РежимЗаписи		 - РежимЗаписиДокумента
//  РежимПроведения	 - РежимПроведенияДокумента
Процедура ПроверкаДатыЗапретаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если ПараметрыСеанса.ПропуститьПроверкуЗапретаИзменения = Ложь И ДействуетЗапрет(Источник, "запись") Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

// Процедура сравнивает дату документа с датой запрета. Если начало дня даты документа совпадает
// с датой запрета или раньше нее, то параметр Отказ устанавливается в Истина.
// Параметры:
//  Источник		 - Документ
//  Отказ			 - Булево
Процедура ПроверкаДатыЗапретаПередУдалением(Источник, Отказ) Экспорт
	Если ПараметрыСеанса.ПропуститьПроверкуЗапретаИзменения = Ложь И ДействуетЗапрет(Источник, "удаление") Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#Область ВыполнениеМетодовОтчётовИОбработокВФоне

#Если НаСервере Тогда
	
// Возвращает описание основного объекта, из формы которого запускается фоновое выполнение
//
// Параметры:
//  Форма				 - ФормаКлиентскогоПриложения	 - Основная форма объекта, метод которого необходимо исполнить
//  ИмяРеквизитаОбъекта	 - Строка						 - Имя основного реквизита формы, если он по каким-то причинам является не первым реквизитом
// 
// Возвращаемое значение:
//  Структура - Описание объекта, метод которого должен быть исполнен в фоновом задании
//
Функция ПараметрыОбъектаФормы(Форма, ИмяРеквизитаОбъекта = "") Экспорт
	Параметры = Новый Структура("УникальныйИдентификатор,РеквизитыОбъекта", Форма.УникальныйИдентификатор, Новый Структура);
	РеквизитыФормы = Форма.ПолучитьРеквизиты();
	Если ПустаяСтрока(ИмяРеквизитаОбъекта) Тогда
		ИмяРеквизитаОбъекта = РеквизитыФормы[0].Имя;
	КонецЕсли;
	Объект = Форма.РеквизитФормыВЗначение(ИмяРеквизитаОбъекта);
	Для Каждого Реквизит Из Объект.Метаданные().Реквизиты Цикл
		Параметры.РеквизитыОбъекта.Вставить(Реквизит.Имя, Объект[Реквизит.Имя]);
	КонецЦикла;
	Параметры.Вставить("ПолноеИмяОбъекта", Объект.Метаданные().ПолноеИмя());
	Для Каждого Реквизит Из РеквизитыФормы Цикл
		Если Реквизит.Имя = "ИспользуемоеИмяФайла" И ЗначениеЗаполнено(Форма.ИспользуемоеИмяФайла) Тогда
			Параметры.Вставить("Файл", Форма.Файл);
			Параметры.Вставить("ИмяФайла", Форма.ИспользуемоеИмяФайла);
		КонецЕсли;
	КонецЦикла;
	Возврат Параметры;
КонецФункции

// Запускает на выполнение в фоновом задании метод отчёта или обработки и возвращает результат запуска
//
// Параметры:
//  ПараметрыОбъекта - Структура	 - Описание объекта, метод которого необходимо исполнить в фоне
//  НазваниеМетода	 - Строка		 - Название процедуры или функции модуля объекта
//  ПараметрыМетода	 - Структура	 - Параметры вызываемого метода. Ключ структуры - имя параметра.
// 
// Возвращаемое значение:
//  Структура - Описание результата запуска фонового задания, возвращаемые функцией БСП ЗапуститьВыполнениеВФоне()
//
Функция ВыполнениеМетодаОбъектаВФоне(ПараметрыОбъекта, НазваниеМетода, ПараметрыМетода = Неопределено) Экспорт
	Перем УникальныйИдентификатор;
	ПараметрыОбъекта.Свойство("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыОбъекта.Вставить("НазваниеМетода", НазваниеМетода);
	ПараметрыОбъекта.Вставить("ПараметрыМетода", ПараметрыМетода);
	
	РезультатЗапуска = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор,
	"Оболочки.ФоновоеВыполнениеМетодаОбъекта", ПараметрыОбъекта, ПараметрыОбъекта.ПолноеИмяОбъекта+"."+НазваниеМетода+" ("+ПараметрыСеанса.ТекущийПользователь+")");
	
	Возврат РезультатЗапуска;
	
КонецФункции

// Обработчик фонового задания, выполняющего метод объекта в фоне
//
// Параметры:
//  ПараметрыЗадания - Структура	 - Данные, необходимые для корректного создания объекта и вызова его метода
//  АдресРезультата	 - Строка		 - Адрес временного хранилища, куда должен быть помещён результат выполнения метода
//
// В текущем варианте не предусмотрен возврат результата вызова функций, транслируются только значения реквизитов объекта и параметров метода после его вызова.
//
Процедура ФоновоеВыполнениеМетодаОбъекта(ПараметрыЗадания, АдресРезультата) Экспорт
	Перем ДвоичныеДанные;
	Если ПараметрыЗадания.Свойство("Файл", ДвоичныеДанные) Тогда
		ПолноеИмяФайла = ПолучитьИмяВременногоФайла("erf");
		ДвоичныеДанные.Записать(ПолноеИмяФайла);
		ПараметрыЗадания.Удалить("Файл");
		Объект = ВнешниеОтчеты.Создать(ПолноеИмяФайла);
		УдалитьФайлы(ПолноеИмяФайла);
	Иначе
		ПараметрыЗадания.ПолноеИмяОбъекта = СтрЗаменить(ПараметрыЗадания.ПолноеИмяОбъекта, "Отчет.", "Отчеты.");
		Объект = Вычислить(ПараметрыЗадания.ПолноеИмяОбъекта).Создать();
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыЗадания.РеквизитыОбъекта);
	
	ПараметрыСтрока = "";
	Если ЗначениеЗаполнено(ПараметрыЗадания.ПараметрыМетода) Тогда
		Параметры = ПараметрыЗадания.ПараметрыМетода;
		Для Каждого Параметр Из Параметры Цикл 
			ПараметрыСтрока = ПараметрыСтрока + "Параметры." + Параметр.Ключ + ",";
		КонецЦикла;
		ПараметрыСтрока = Сред(ПараметрыСтрока, 1, СтрДлина(ПараметрыСтрока) - 1);
	КонецЕсли;
	
	Выполнить "Объект." + ПараметрыЗадания.НазваниеМетода + "(" + ПараметрыСтрока + ")";
	//Результат = Вычислить("Объект." + НазваниеМетода + "(" + ПараметрыСтрока + ")");
	ЗаполнитьЗначенияСвойств(ПараметрыЗадания.РеквизитыОбъекта, Объект);
	ПоместитьВоВременноеХранилище(ПараметрыЗадания, АдресРезультата);
КонецПроцедуры

#КонецЕсли

// Возвращает описание текущего состояния фонового задания
//
// Параметры:
//  ИдентификаторЗадания - УникальныйИдентификатор	 - Идентификатор, присвоенный фоновому заданию при его запуске
// 
// Возвращаемое значение:
//  Структура - Данные, необходимые для проверки состояния фонового выполнения и возврата его результатов
//
Функция СостояниеФоновогоЗадания(ИдентификаторЗадания) Экспорт
	Описание = Новый Структура("Активно, СообщенияПользователю, ИнформацияОбОшибке, Состояние", Ложь, Новый Массив);
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если Задание <> Неопределено Тогда
		Удалить = Истина;
		Описание.СообщенияПользователю = Задание.ПолучитьСообщенияПользователю(Удалить);
		Описание.Активно = Задание.Состояние = СостояниеФоновогоЗадания.Активно;
		Описание.ИнформацияОбОшибке = Задание.ИнформацияОбОшибке;
		Описание.Состояние = Строка(Задание.ИнформацияОбОшибке);
	КонецЕсли;
	Возврат Описание;
КонецФункции

// Возвращает статус фонового выполнения метода объекта.
//
// Параметры:
//  ПараметрыФоновогоВыполнения	 - Структура	 - Данные, возвращаемые функцией ВыполнениеМетодаОбъектаВФоне()
// 
// Возвращаемое значение:
//  Булево - Истина, если фоновая обработка всё ещё выполняется
//
Функция ВыполняетсяФоновоеЗадание(ПараметрыФоновогоВыполнения) Экспорт
	Если ТипЗнч(ПараметрыФоновогоВыполнения) = Тип("Структура") Тогда
		Возврат СостояниеФоновогоЗадания(ПараметрыФоновогоВыполнения.ИдентификаторЗадания).Активно;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Принудительно завершает фоновое выполнение и, при необходимости, меняет состояние поля табличного документа отчета.
//
// Параметры:
//  ПараметрыФоновогоВыполнения	 - Структура	 - Данные, возвращаемые функцией ВыполнениеМетодаОбъектаВФоне() и дополненные при подключении обработчика оповещения о результате.
//
Процедура ОтменитьФоновоеВыполнение(ПараметрыФоновогоВыполнения) Экспорт
	Перем ОтображениеСостояния;
	ПараметрыФоновогоВыполнения.Свойство("ОтображениеСостояния", ОтображениеСостояния);
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ПараметрыФоновогоВыполнения.ИдентификаторЗадания);
	Если ОтображениеСостояния <> Неопределено Тогда
		ОтображениеСостояния.Видимость = Истина;
		ОтображениеСостояния.Текст = НСтр("ru = 'Отчет не сформирован. Нажмите ""Сформировать"" для получения отчета.'");
		ОтображениеСостояния.Картинка = Новый Картинка;
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
		ПараметрыФоновогоВыполнения.АдресХранилища = "";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти //ВыполнениеМетодовОтчётовИОбработокВФоне

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

Функция ДействуетЗапрет(ДокументОбъект, НазваниеОперации = Неопределено)
	Если ПроверкаДатыЗапретаНеНужна(ДокументОбъект) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрет = Ложь;
	ДатаЗапрета = ОбщегоНазначенияНаВремяВызоваПовтИсп.ДатаЗапретаРедактирования();
	ТипДокумента = ТипЗнч(ДокументОбъект);
	Если ТипДокумента = Тип("ДокументОбъект.Поручение") Тогда
		Если ДокументОбъект.ВидОперацииД = Справочники.ВидыОпераций.СнятиеЦБсОбслуживания Тогда
			Запрет = Ложь;
		ИначеЕсли ДатаЗаполненаИНеПозжеУказанногоДня(ДокументОбъект.ДатаИсполненияПоручения, ДатаЗапрета)
					Или (ДокументОбъект.ЭтоНовый() И НачалоДня(ДокументОбъект.Дата) <= ДатаЗапрета) Тогда
			Запрет = Истина;
		Иначе
			Если Не ДокументОбъект.ЭтоНовый() Тогда
				ДатыДоИзменения = ДатыПорученияХранящегосяВИБ(ДокументОбъект.Ссылка);
				Запрет = ДатаСместиласьРаньшеУказанногоДня(ДокументОбъект.Дата, ДатыДоИзменения.Дата, ДатаЗапрета)
							Или ДатаСместиласьРаньшеУказанногоДня(ДокументОбъект.ДатаИсполненияПоручения, ДатыДоИзменения.ДатаИсполненияПоручения, ДатаЗапрета);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.НеттоПоручение") Тогда
		Если ДатаЗаполненаИНеПозжеУказанногоДня(ДокументОбъект.ДатаИсполнения, ДатаЗапрета) Тогда
			Запрет = Истина;
		КонецЕсли;
	Иначе
		Если НачалоДня(ДокументОбъект.Дата) <= ДатаЗапрета Тогда
			Запрет = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Запрет И НазваниеОперации <> Неопределено Тогда
		ТекстСообщения = "Невозможно выполнить " + НазваниеОперации + " - изменения в этом периоде запрещены, установлена "
							+ " дата запрета редактирования начиная с " + Формат(ДатаЗапрета, "ДФ=""дд.ММ.гггг""") + " включительно";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат Запрет;
КонецФункции

Функция ПроверкаДатыЗапретаНеНужна(ДокументОбъект)
	Возврат ДокументОбъект.ДополнительныеСвойства.Свойство("НеВыполнятьПроверкуДатыЗапретаРедактирования")
			И ДокументОбъект.ДополнительныеСвойства.НеВыполнятьПроверкуДатыЗапретаРедактирования;
КонецФункции

Функция ДатаЗаполненаИНеПозжеУказанногоДня(Дата, День)
	Возврат ЗначениеЗаполнено(Дата) И НачалоДня(Дата) <= День;
КонецФункции

Функция ДатаСместиласьРаньшеУказанногоДня(НоваяДата, СтараяДата, День)
	ДатаСместиласьРаньшеУказанногоДня = ДатаЗаполненаИНеПозжеУказанногоДня(НоваяДата, День) 
										И Не ДатаЗаполненаИНеПозжеУказанногоДня(СтараяДата, День);
	Возврат ДатаСместиласьРаньшеУказанногоДня;
КонецФункции

Функция ДатыПорученияХранящегосяВИБ(ПоручениеСсылка)
	ДатыПоручения = Новый Структура("Дата, ДатаИсполненияПоручения", Неопределено, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Поручение.Дата КАК Дата,
	|	Поручение.ДатаИсполненияПоручения КАК ДатаИсполненияПоручения
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ПоручениеСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДатыПоручения, Выборка);
	КонецЕсли;
	
	Возврат ДатыПоручения;
КонецФункции

#КонецОбласти