
Функция ФормаСообщения(ВидКД, Этап, ТипУведомления, ЦБНеПодпадающаяПодНалоговоеРегулированиеСША) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФормыСообщений.ФормаСообщения КАК ФормаСообщения
	|ИЗ
	|	РегистрСведений.ФормыСообщенийКабинетаКлиентаВТБКБ КАК ФормыСообщений
	|ГДЕ
	|	ФормыСообщений.ВидКД = &ВидКД
	|	И (ФормыСообщений.Этап = &Этап ИЛИ ФормыСообщений.Этап = &ПустойЭтап)
	|	И (ФормыСообщений.ТипУведомления = &ТипУведомления ИЛИ ФормыСообщений.ТипУведомления = &ПустойТипУведомления)
	|	И (ФормыСообщений.ВидКД.Код <> &КодПодтвержденияОсвобожденияОтНалогов 
	|		ИЛИ ФормыСообщений.ЦБНеПодпадающаяПодНалоговоеРегулированиеСША = &ЦБНеПодпадающаяПодНалоговоеРегулированиеСША)
	|УПОРЯДОЧИТЬ ПО
	|	ФормыСообщений.Этап,
	|	ФормыСообщений.ТипУведомления
	|");
	Запрос.УстановитьПараметр("ВидКД", ВидКД);
	Запрос.УстановитьПараметр("Этап", Этап);
	Запрос.УстановитьПараметр("ПустойЭтап", Справочники.ЭтапыКД.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипУведомления", ТипУведомления);
	Запрос.УстановитьПараметр("ПустойТипУведомления", Справочники.ТипыУведомления.ПустаяСсылка());	
	Запрос.УстановитьПараметр("КодПодтвержденияОсвобожденияОтНалогов", "WTRC");
	Запрос.УстановитьПараметр("ЦБНеПодпадающаяПодНалоговоеРегулированиеСША", ЦБНеПодпадающаяПодНалоговоеРегулированиеСША);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();		
		Возврат Выборка.ФормаСообщения;
	КонецЕсли;
КонецФункции
