
Перем мОбщаяТаблицаНастроекПолейПоиска Экспорт;
Перем мОбщаяТаблицаНастроекВыгрузки Экспорт;

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.СпособОбмена) Тогда
		Сообщить("Не указан способ обмена!");
		Отказ = Истина;
	КонецЕсли;
	ПроверяемыеРеквизиты = Новый СписокЗначений;
	ПроверяемыеРеквизиты.Добавить("АдресПолучателя", "Получатели");
	ПроверяемыеРеквизиты.Добавить("АдресПолучателяКопии", "Скрытая копия");
	ПроверяемыеРеквизиты.Добавить("НомераПолучателейСМС", "Получатели SMS");
	ПроверитьРеквизиты(ПроверяемыеРеквизиты, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("НеУстанавливатьИспользованиеУчетнойЗаписиРоботаПринудительно", Истина);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура FTPАдресОбменаПриИзменении(Элемент)
	
	
	Объект.FTPАдресОбмена = СокрЛП(Объект.FTPАдресОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура FTPАдресОбменаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ПустаяСтрока(Элемент.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	// открываем каталог который в настройках
	ЗапуститьПриложение("ftp://" + НормализоватьFTPАдрес(Элемент.Значение));

КонецПроцедуры

&НаКлиенте
Процедура СпособОбменаПриИзменении(Элемент)
	
	СпособОбменаПриИзмененииНаСервере();
	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Проверить(Команда)
	
	 РезультатПроверки = ПроверитьНастройкиFTPПодключения(Объект);
	
	Если РезультатПроверки Тогда
		Предупреждение("Проверка успешно пройдена !" , 30, "Проверка FTP подключения");
	Иначе
		Предупреждение("Возникли ошибки при подключении !", 30, "Проверка FTP подключения");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьРеквизиты(ПроверяемыеРеквизиты, Отказ)
	
	Для Каждого ИмяРеквизита Из ПроверяемыеРеквизиты Цикл
		Строка = Объект[ИмяРеквизита.Значение];
		Если ЗначениеЗаполнено(Строка) Тогда
			ОбработаннаяСтрока = ОбработаннаяСтрока(Строка);
			Если ОбработаннаяСтрока <> Строка Тогда
				Ответ = Вопрос("Поле '"+ИмяРеквизита.Представление+"' заполнено некорректно.
				|Заменить введённые данные на '"+ОбработаннаяСтрока+"'?", РежимДиалогаВопрос.ДаНетОтмена);
				Если Ответ = КодВозвратаДиалога.Да Тогда
					Объект[ИмяРеквизита.Значение] = ОбработаннаяСтрока;
				ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
					Отказ = Истина;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОбработаннаяСтрока(Строка)
	
	ОбработаннаяСтрока = СтрЗаменить(СокрЛП(Строка), " ", ",");
	ОбработаннаяСтрока = СтрЗаменить(ОбработаннаяСтрока, ";", ",");
	Подстроки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОбработаннаяСтрока);
	Индекс = Подстроки.ВГраница();
	Пока Индекс >= 0 Цикл
		Если ПустаяСтрока(Подстроки[Индекс]) Тогда
			Подстроки.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	Возврат СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(Подстроки, ";");
	
КонецФункции

&НаСервере
Процедура УстановитьДоступность()
	Элементы.СтраницаFTP.Видимость		=	(Объект.СпособОбмена = Перечисления.СпособыОбменаДанными.ОбменЧерезFTPРесурс);
	Элементы.СтраницаEmail.Видимость	=	(Объект.СпособОбмена = Перечисления.СпособыОбменаДанными.ОбменЧерезПочту);
	Элементы.СтраницаSMS.Видимость		=	(Объект.СпособОбмена = Перечисления.СпособыОбменаДанными.ОбменЧерезСМС);
	Элементы.СтраницаWeb.Видимость		=	(Объект.СпособОбмена = Перечисления.СпособыОбменаДанными.ОбменЧерезВебСервис);
	Элементы.СтраницаHTTP.Видимость		=	(Объект.СпособОбмена = Перечисления.СпособыОбменаДанными.ОбменЧерезHTTPСервис);
	Элементы.СтраницаKafka.Видимость	=	(Объект.СпособОбмена = Перечисления.СпособыОбменаДанными.ОбменЧерезKafka);
	Элементы.УчетнаяЗаписьПриемаОтправкиСообщений.Доступность = Не Объект.ИспользоватьУчетнуюЗаписьСообщенийВнешнегоИсточника;
	Элементы.ВнешнийИсточникПриемаОтправкиСообщений.Доступность = Объект.ИспользоватьУчетнуюЗаписьСообщенийВнешнегоИсточника;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьУчетнуюЗаписьСообщенийВнешнегоИсточникаПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры

&НаСервере
Процедура СпособОбменаПриИзмененииНаСервере()
	// Вся почта должна обрабатываться через один внешний источник ("робот рассылки")
	Если Объект.СпособОбмена = Перечисления.СпособыОбменаДанными.ОбменЧерезПочту Тогда
		ЭтоРоботРассылки = (Объект.Ссылка = Справочники.НастройкиОбменаДанными.РоботРассылкиPROD)
							ИЛИ (Объект.Ссылка = Справочники.НастройкиОбменаДанными.РоботРассылкиUAT);
		Если НЕ ЭтоРоботРассылки Тогда
			Объект.ИспользоватьУчетнуюЗаписьСообщенийВнешнегоИсточника = Истина;
			Объект.ВнешнийИсточникПриемаОтправкиСообщений = ПланыВидовХарактеристик.ВнешниеИсточники.РоботРассылки;
			Объект.УчетнаяЗаписьПриемаОтправкиСообщений = неопределено;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Процедура устанавливает недоступность изменения типа узла
// Процедура реализована для использования из общей формы управления списками настроек
//
&НаКлиенте
Процедура УстановитьНедоступностьИзмененияТипаУзла(МассивТипов) Экспорт   //Оствим, но нигде не  используются

	Если МассивТипов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Элементы.УзелИнформационнойБазы.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	//ЭлементыФормы.УзелИнформационнойБазы.ВыбиратьТип = (МассивТипов.Количество() > 1); 

КонецПроцедуры

// функция проверяет настройки FTP подключения
&НаКлиенте
Функция ПроверитьНастройкиFTPПодключения(ДанныеНастройки = Неопределено, ДанныеПротокола = "", Знач ВывестиИнформациюВОкноСообщений = Истина,
	ИмяКаталогаСервера = "", ИмяFTPСервера = "" , Соединение = Неопределено, СтруктураОбменаДанными = Неопределено) Экспорт
			
	// нужно по полному имени получить имя сервера и имя каталога
	ПолучитьИмяСервераИИмяКаталогаОбмена(ДанныеНастройки.FTPАдресОбмена, ИмяFTPСервера, ИмяКаталогаСервера);
	
	// если не задано имя сервера или каталога то невозможно обмениваться данными
	Если ПустаяСтрока(ИмяFTPСервера) Тогда
		
		Сообщить("Не задан сервер обмена информацией через FTP.");

		Возврат Ложь;
		
	КонецЕсли;
	
	// соединение
	Соединение = ВыполнитьFTPПодключениеКСерверу(ИмяFTPСервера, ДанныеНастройки, ДанныеПротокола, ВывестиИнформациюВОкноСообщений, СтруктураОбменаДанными);
	Если Соединение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// каталог проверяем
	НаличиеКаталога = ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, ИмяКаталогаСервера, ДанныеПротокола, ВывестиИнформациюВОкноСообщений, СтруктураОбменаДанными);
	Если Не НаличиеКаталога Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьИмяСервераИИмяКаталогаОбмена(Знач ПолныйFTPАдрес, ИмяСервера, ИмяКаталога)
	
	АдресОбмена = НормализоватьFTPАдрес(ПолныйFTPАдрес);
	
	// принцип получения адреса такой, все что до первой черты / или \ - это имя сервера, потом каталог
	АдресОбмена = СтрЗаменить(АдресОбмена, "\", "/");
	
	ПозицияПрямогоСлеша = Найти(АдресОбмена, "/");
	
	Если ПозицияПрямогоСлеша = 0 Тогда
		
		ИмяСервера = АдресОбмена;
		ИмяКаталога = "";
		
		
	Иначе
		
		ИмяСервера = Сред(АдресОбмена, 1, ПозицияПрямогоСлеша - 1);
		ИмяКаталога = Сред(АдресОбмена, ПозицияПрямогоСлеша);
		
		// последний должен быть слеш у имени каталога
		Если Сред(ИмяКаталога, СтрДлина(ИмяКаталога)) <> "/" Тогда
			
			ИмяКаталога = ИмяКаталога + "/";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// функция нормализует ftp адрес (отрезает не нужное)
&НаКлиенте
Функция НормализоватьFTPАдрес(Знач FTPАдрес) Экспорт
	
	ИтоговыйАдрес = СокрЛП(FTPАдрес);
	ПозицияFTP = Найти(Врег(ИтоговыйАдрес), "FTP://");
	
	Если ПозицияFTP = 1 Тогда
		
		ИтоговыйАдрес = Сред(ИтоговыйАдрес, 7);	
		
	КонецЕсли;
	
	Возврат ИтоговыйАдрес;
	
КонецФункции

// функция проверяет наличие катаога на FTP сервере
&НаКлиенте
Функция ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, Знач ИмяКаталогаСервера, 
	ДанныеПротокола = "", Знач ВывестиИнформациюВОкноСообщений = Истина, СтруктураОбменаДанными = Неопределено)
	
	Если ПустаяСтрока(ИмяКаталогаСервера) Тогда
		Возврат Истина;
	КонецЕсли;
	
	//надо сначала проверить что сам каталог доступа есть
	Попытка
		
		МассивНайденныхКаталогов = Соединение.НайтиФайлы(ИмяКаталогаСервера, "");
		
	Исключение
		
		// ошибка при подключении к ftp
        Сообщить("Ошибка при соединении с FTP : " + ИмяКаталогаСервера + " ! " + ОписаниеОшибки());
        Возврат Ложь;
		
	КонецПопытки;
	
	Для Каждого НайденныйКаталог Из МассивНайденныхКаталогов Цикл
		
		// если не каталог - то дальше ищем
		Если НЕ НайденныйКаталог.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		// большие и маленькие буквы считаются различными
		Если НайденныйКаталог.ПолноеИмя + "/" <> ИмяКаталогаСервера Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат Истина;
		
	КонецЦикла;
	
	// если не найден каталог для обмена
	Сообщить("Не найден FTP каталог обмена информацией: " + ИмяКаталогаСервера);
		
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьFTPПодключениеКСерверу(Знач ИмяFTPСервера, НастройкиОбмена, 
	ДанныеПротокола = "", Знач ВывестиИнформациюВОкноСообщений = Истина, СтруктураОбменаДанными = Неопределено)       
	
	#Если Клиент Тогда
		Состояние("Выполняется подключение к FTP: " + ИмяFTPСервера);
	#КонецЕсли
    
	Попытка
		
		Соединение = Новый FTPСоединение(ИмяFTPСервера, НастройкиОбмена.ПортFTPСоединения, 
				НастройкиОбмена.ПользовательFTPСоединения, НастройкиОбмена.ПарольFTPСоединения, ,НастройкиОбмена.ПассивноеFTPСоединение);						
				
	Исключение
			
		// ошибка при подключении к ftp
		Сообщить("Ошибка при подключении к FTP : " + ИмяFTPСервера + " ! " + " ! " + ОписаниеОшибки());
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции

#КонецОбласти