
Процедура СформироватьОтчет(ТаблицаОтчета) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачало", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ПериодКонец", Период.ДатаОкончания);
	
	ВидОтчетаВыплаты = Ложь;
	
	Если ВидОтчета = "РСВ" Тогда
		ТекстЗапроса = ПолучитьТекстЗапросаРСВ();
	ИначеЕсли ВидОтчета = "Уведомления" Тогда
		ТекстЗапроса = ПолучитьТекстЗапросаУведомления();
	ИначеЕсли ВидОтчета = "Выплаты" Тогда
		ВидОтчетаВыплаты = Истина;
		ТекстЗапроса = ПолучитьТекстЗапросаВыплаты();
		ВидыОперации = Новый Массив;
		ВидыОперации.Добавить(Справочники.ВидыОпераций.ПогашениеНКД);
		ВидыОперации.Добавить(Справочники.ВидыОпераций.НачислениеДивидендов);
		ВидыОперации.Добавить(Справочники.ВидыОпераций.НачислениеДоходаПрочие);
		ВидыОперации.Добавить(Справочники.ВидыОпераций.ПогашениеЦБПолное);
		ВидыОперации.Добавить(Справочники.ВидыОпераций.ПогашениеЦБЧастичное);
		Запрос.УстановитьПараметр("ВидыОперации", ВидыОперации);
		Запрос.УстановитьПараметр("ВалютаРубль", Справочники.Валюты.Рубль());
	Иначе
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Поле = "ВидОтчета";
		СообщениеПользователю.Текст = НСтр("ru = 'Значение реквизита ""Вид отчета"" не заполнено или содержит некорректные данные.'");
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = НСтр("ru = 'Данные для формирования отчета не обнаружены!'");
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	
	Макет = ПолучитьМакет("Отчет");
	ОбластьШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");
	ТаблицаОтчета.Вывести(ОбластьШапкаОбщие);
	
	Если ВидОтчетаВыплаты Тогда
		ОбластьШапкаВыплаты = Макет.ПолучитьОбласть("Шапка|Выплаты");
		ТаблицаОтчета.Присоединить(ОбластьШапкаВыплаты);
	КонецЕсли;
	
	ТаблицаОтчета.НачатьАвтогруппировкуСтрок();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОбластьДетальныеЗаписиОбщие = Макет.ПолучитьОбласть("ДетальныеЗаписи|Общие");
	ОбластьДетальныеЗаписиВыплаты = Макет.ПолучитьОбласть("ДетальныеЗаписи|Выплаты");
	
	Пока Выборка.Следующий() Цикл
		УровеньГруппировки = Выборка.Уровень();
		ЗаполнитьЗначенияСвойств(ОбластьДетальныеЗаписиОбщие.Параметры, Выборка);
		Если УровеньГруппировки = 0 Или (УровеньГруппировки = 1 И ВидОтчетаВыплаты) Тогда
			ОбластьДетальныеЗаписиОбщие.Параметры.Документ = "Количество документов: " + ОбластьДетальныеЗаписиОбщие.Параметры.Документ;
		КонецЕсли;
		ТаблицаОтчета.Вывести(ОбластьДетальныеЗаписиОбщие, УровеньГруппировки);
		Если ВидОтчетаВыплаты Тогда
			ЗаполнитьЗначенияСвойств(ОбластьДетальныеЗаписиВыплаты.Параметры, Выборка);
			ТаблицаОтчета.Присоединить(ОбластьДетальныеЗаписиВыплаты, УровеньГруппировки);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаОтчета.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры 

Функция ПолучитьТекстЗапросаРСВ()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РаскрытиеСпискаВладельцевСписокВладельцев.Ссылка КАК Документ,
	|	КОЛИЧЕСТВО(РаскрытиеСпискаВладельцевСписокВладельцев.Клиент) КАК КоличествоКлиентов
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев.СписокВладельцев КАК РаскрытиеСпискаВладельцевСписокВладельцев
	|ГДЕ
	|	РаскрытиеСпискаВладельцевСписокВладельцев.Ссылка.Дата МЕЖДУ &ПериодНачало И &ПериодКонец
	|
	|СГРУППИРОВАТЬ ПО
	|	РаскрытиеСпискаВладельцевСписокВладельцев.Ссылка
	|ИТОГИ
	|	КОЛИЧЕСТВО(Документ),
	|	СУММА(КоличествоКлиентов)
	|ПО
	|	ОБЩИЕ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаУведомления()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УведомленияОтправленныеЧерезЛичныйКабинет.КД КАК Документ,
	|	КОЛИЧЕСТВО(УведомленияОтправленныеЧерезЛичныйКабинет.Клиент) КАК КоличествоКлиентов
	|ИЗ
	|	РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК УведомленияОтправленныеЧерезЛичныйКабинет
	|ГДЕ
	|	УведомленияОтправленныеЧерезЛичныйКабинет.Период МЕЖДУ &ПериодНачало И &ПериодКонец
	|
	|СГРУППИРОВАТЬ ПО
	|	УведомленияОтправленныеЧерезЛичныйКабинет.КД
	|ИТОГИ
	|	КОЛИЧЕСТВО(Документ),
	|	СУММА(КоличествоКлиентов)
	|ПО
	|	ОБЩИЕ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаВыплаты()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПоручениеЦенныеБумагиСписываемые.Ссылка КАК Документ,
	|	ПоручениеЦенныеБумагиСписываемые.Ссылка.ВидОперацииД КАК ВидОперации,
	|	ПоручениеЦенныеБумагиСписываемые.ПлановаяДатаРасчетов КАК ПлановаяДатаРасчетов,
	|	ПоручениеЦенныеБумагиСписываемые.Сумма КАК СуммаВыплаты,
	|	ПоручениеЦенныеБумагиСписываемые.БанковскийСчет.ТипНазначения КАК ВидСчета,
	|	ПоручениеЦенныеБумагиСписываемые.Ссылка.Валюта КАК Валюта,
	|	ПоручениеЦенныеБумагиСписываемые.СчетДепо КАК СчетДепо,
	|	ПоручениеЦенныеБумагиСписываемые.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ПоручениеЦенныеБумагиСписываемые.СуммаНалога КАК СуммаНалогаУдержанногоНА,
	|	ЕСТЬNULL(НачисленныйНалог.СуммаНалога + НачисленныйНалог.СуммаНалогаПоСтавке15СПревышения, 0) КАК СуммаНалога
	|ПОМЕСТИТЬ ВТ_ДанныеВыплат
	|ИЗ
	|	Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦенныеБумагиСписываемые
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачисленныйНалог КАК НачисленныйНалог
	|		ПО (НачисленныйНалог.Основание = ПоручениеЦенныеБумагиСписываемые.Ссылка)
	|			И (НачисленныйНалог.СчетДепо = ПоручениеЦенныеБумагиСписываемые.СчетДепо)
	|			И (НачисленныйНалог.РазделСчетаДепо = ПоручениеЦенныеБумагиСписываемые.РазделСчетаДепо)
	|			И (НачисленныйНалог.Проведен)
	|ГДЕ
	|	ПоручениеЦенныеБумагиСписываемые.Ссылка.Проведен
	|	И НЕ ПоручениеЦенныеБумагиСписываемые.Ссылка.ДатаИсполненияПоручения ЕСТЬ NULL
	|	И ПоручениеЦенныеБумагиСписываемые.ПлановаяДатаРасчетов МЕЖДУ &ПериодНачало И &ПериодКонец
	|	И ПоручениеЦенныеБумагиСписываемые.Ссылка.ВидОперацииД В(&ВидыОперации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеВыплат.Документ КАК Документ,
	|	ДанныеВыплат.ВидОперации КАК ВидОперации,
	|	ДанныеВыплат.СуммаВыплаты КАК СуммаВыплаты,
	|	ДанныеВыплат.ВидСчета КАК ВидСчета,
	|	ДанныеВыплат.Валюта КАК Валюта,
	|	ДанныеВыплат.СуммаНалогаУдержанногоНА КАК СуммаНалогаУдержанногоНА,
	|	ДанныеВыплат.СуммаНалога КАК СуммаНалога,
	|	ДанныеВыплат.СчетДепо КАК СчетДепо,
	|	ДанныеВыплат.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ВЫБОР
	|		КОГДА ДанныеВыплат.Валюта <> &ВалютаРубль
	|			ТОГДА КурсыВалют.Курс * ДанныеВыплат.СуммаВыплаты
	|		ИНАЧЕ ДанныеВыплат.СуммаВыплаты
	|	КОНЕЦ КАК СуммаВыплатыВРублях,
	|	ВЫБОР
	|		КОГДА ДанныеВыплат.Валюта <> &ВалютаРубль
	|			ТОГДА КурсыВалют.Курс * ДанныеВыплат.СуммаНалогаУдержанногоНА
	|		ИНАЧЕ ДанныеВыплат.СуммаНалогаУдержанногоНА
	|	КОНЕЦ КАК СуммаНалогаУдержанногоНАВРублях,
	|	ВЫБОР
	|		КОГДА ДанныеВыплат.Валюта <> &ВалютаРубль
	|			ТОГДА КурсыВалют.Курс * ДанныеВыплат.СуммаНалога
	|		ИНАЧЕ ДанныеВыплат.СуммаНалога
	|	КОНЕЦ КАК СуммаНалогаВРублях
	|ПОМЕСТИТЬ ВТ_ДанныеВыплатВРублях
	|ИЗ
	|	ВТ_ДанныеВыплат КАК ДанныеВыплат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО (КурсыВалют.Валюта = ДанныеВыплат.Валюта)
	|			И (КурсыВалют.Период = ДанныеВыплат.ПлановаяДатаРасчетов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеВыплатВРублях.Документ КАК Документ,
	|	ДанныеВыплатВРублях.ВидОперации КАК ВидОперации,
	|	КОЛИЧЕСТВО(ДанныеВыплатВРублях.СчетДепо) КАК КоличествоКлиентов,
	|	ДанныеВыплатВРублях.ВидСчета КАК ВидСчета,
	|	ДанныеВыплатВРублях.Валюта КАК Валюта,
	|	ДанныеВыплатВРублях.СуммаВыплаты КАК СуммаВыплаты,
	|	ДанныеВыплатВРублях.СуммаНалогаУдержанногоНА КАК СуммаНалогаУдержанногоНА,
	|	ДанныеВыплатВРублях.СуммаНалога КАК СуммаНалога,
	|	ДанныеВыплатВРублях.СуммаВыплаты - ДанныеВыплатВРублях.СуммаНалога - ДанныеВыплатВРублях.СуммаНалогаУдержанногоНА КАК СуммаКВыплате,
	|	ДанныеВыплатВРублях.СуммаВыплатыВРублях КАК СуммаВыплатыВРублях,
	|	ДанныеВыплатВРублях.СуммаНалогаУдержанногоНАВРублях КАК СуммаНалогаУдержанногоНАВРублях,
	|	ДанныеВыплатВРублях.СуммаНалогаВРублях КАК СуммаНалогаВРублях,
	|	ДанныеВыплатВРублях.СуммаВыплатыВРублях - ДанныеВыплатВРублях.СуммаНалогаВРублях - ДанныеВыплатВРублях.СуммаНалогаУдержанногоНАВРублях КАК СуммаКВыплатеВРублях
	|ИЗ
	|	ВТ_ДанныеВыплатВРублях КАК ДанныеВыплатВРублях
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеВыплатВРублях.Документ,
	|	ДанныеВыплатВРублях.ВидОперации,
	|	ДанныеВыплатВРублях.ВидСчета,
	|	ДанныеВыплатВРублях.Валюта,
	|	ДанныеВыплатВРублях.СчетДепо,
	|	ДанныеВыплатВРублях.СуммаВыплаты,
	|	ДанныеВыплатВРублях.СуммаНалогаУдержанногоНА,
	|	ДанныеВыплатВРублях.СуммаНалога,
	|	ДанныеВыплатВРублях.СуммаВыплатыВРублях,
	|	ДанныеВыплатВРублях.СуммаНалогаУдержанногоНАВРублях,
	|	ДанныеВыплатВРублях.СуммаНалогаВРублях
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Документ),
	|	ВидОперации КАК ВидОперации,
	|	КОЛИЧЕСТВО(КоличествоКлиентов),
	|	СУММА(СуммаВыплаты),
	|	СУММА(СуммаНалогаУдержанногоНА),
	|	СУММА(СуммаНалога),
	|	СУММА(СуммаКВыплате),
	|	СУММА(СуммаВыплатыВРублях),
	|	СУММА(СуммаНалогаУдержанногоНАВРублях),
	|	СУММА(СуммаНалогаВРублях),
	|	СУММА(СуммаКВыплатеВРублях)
	|ПО
	|	ОБЩИЕ,
	|	ВидОперации";
	
	Возврат ТекстЗапроса;
	
КонецФункции