
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДополнительнаяОбработкаСсылка", ДопОбработка);
	
	Настройки = ДопОбработка.ХранилищеНастроек.Получить();
	
	Если ТипЗнч(Настройки) = Тип("ХранилищеЗначения") Тогда
		Настройки = Настройки.Получить();
		Если ТипЗнч(Настройки) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(Объект, Настройки);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Настройки) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Настройки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаСервере();
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура СохранитьНаСервере()
	
	Настройки = Новый Структура;
	Настройки.Вставить("ОбработкаПерерасчетаСтоимости", Объект.ОбработкаПерерасчетаСтоимости);
	Настройки.Вставить("ОбработкаУдаленияБлокировок", Объект.ОбработкаУдаленияБлокировок);
	Настройки.Вставить("ОбработкаРаспространенияПравил", Объект.ОбработкаРаспространенияПравил);
	Настройки.Вставить("СвойствоСтатусПортфеля", Объект.СвойствоСтатусПортфеля);
	Настройки.Вставить("СвойствоСтатусПортфеляДата", Объект.СвойствоСтатусПортфеляДата);
	
	ОбработкаОбъект = ДопОбработка.ПолучитьОбъект();
	ОбработкаОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(Настройки);
	ОбработкаОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти