
Процедура УстановитьУслугиПоДоговору() Экспорт
	
	Период = ?(ЗначениеЗаполнено(Дата), Дата, Договор.ДатаНачалоДействия);
	Набор = РегистрыСведений.РегистрНазначенныхКомиссий.СоздатьНаборЗаписей();
	Набор.Отбор.ДоговорКонтрагента.Установить(Договор);	
	Набор.Отбор.Период.Установить(Период);
	Набор.Прочитать();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УслугиТарифногоПлана.Услуга КАК Услуга
	|ИЗ
	|	Справочник.ТарифныеПланы.УслугиТарифногоПлана КАК УслугиТарифногоПлана
	|ГДЕ
	|	УслугиТарифногоПлана.Ссылка = &ТарифныйПлан
	|	И НЕ УслугиТарифногоПлана.Услуга.НеИспользуется";
	Запрос.УстановитьПараметр("ТарифныйПлан", ТарифныйПлан);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = Набор.Добавить();
		Запись.Период = Период;
		Запись.ДоговорКонтрагента = Договор;
		Запись.Услуга = Выборка.Услуга;
		Запись.ФлагАктивности = Истина;
	КонецЦикла;
	Набор.Записать();
	
КонецПроцедуры
