// Функция определяет, вляется ли указанный вид отчета используемым в программе
// Параметры:
// 	ВидОтчета - ПеречислениеСсылка.ВидыОтчетов
// Возвращаемое значение:
//	- Булево
Функция ЭтоВыпискаИлиОтчет(ВидОтчета) Экспорт
	Возврат ВидОтчета = Перечисления.ВидыОтчетов.ВыпискаОСостоянииСчетаДЕПО
			ИЛИ ВидОтчета = Перечисления.ВидыОтчетов.Выписка
			ИЛИ ВидОтчета = Перечисления.ВидыОтчетов.ОтчетОбОперацияхПоСчетуДЕПО
			ИЛИ ВидОтчета = Перечисления.ВидыОтчетов.СводныйОтчетОСовершеннойОперации;
КонецФункции
