#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		Адрес = АдресПечатнойФормыСервер();
		Описатель = ПолучитьИзВременногоХранилища(Адрес);
		Если Описатель.Свойство("Ошибка") Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = Описатель.Ошибка;
			Сообщение.Сообщить();
		Иначе
			Описатель.ТабДок.Показать(Описатель.Заголовок);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналОтправлений(Команда)
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		
		ОтправленоВЭДО = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("83.СводныеОтчетыВЭДОилиВKafka", 0) = 0;
		Если ОтправленоВЭДО Тогда
			ОтборПоДокументу = Новый Структура("Документ", Элементы.Список.ТекущиеДанные.Ссылка);
			ИмяРегистра = "РегистрацияДокументовВЭДО";
		Иначе
			Элементы.Список.Обновить();
			ОтборПоДокументу = Новый Структура("ОтправляемыйОбъект", Элементы.Список.ТекущиеДанные.Ссылка);
			ИмяРегистра = "ЖурналИсходящихСообщенийKafka";
		КонецЕсли;
		ПараметрыФормы = Новый Структура("Отбор", ОтборПоДокументу);
		ОткрытьФорму("РегистрСведений." + ИмяРегистра + ".ФормаСписка", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция АдресПечатнойФормыСервер()
	Возврат Документы.СводныйОтчетОСовершенныхОперациях.АдресПечатнойФормы(
		Элементы.Список.ТекущаяСтрока,
		Неопределено,
		Ложь,
		ЭтаФорма.УникальныйИдентификатор);
КонецФункции

#КонецОбласти
