
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.НастройкиАлгоритма)=Тип("Структура") тогда
	
		Настройки = Параметры.НастройкиАлгоритма;
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.УстановитьПользовательскиеНастройки(Настройки);
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	Заголовок = "";
	ЗначенияПараметров = УстановитьПараметры(Заголовок);
	ОповеститьОВыборе(новый Структура("Значения,ЗаголовокНастроек", ЗначенияПараметров,Заголовок));
КонецПроцедуры

&НаСервере
Функция УстановитьПараметры(Заголовок)
	
	Значения = Новый Структура;
	Значения.Вставить("БазаДО", Объект.БазаДО);
	Значения.Вставить("РежимТолькоЧтениеДО", Объект.РежимТолькоЧтениеДО);
	Значения.Вставить("ОповещениеОбОшибках", Объект.ОповещениеОбОшибках);
	Значения.Вставить("ПулСохранностьКапитала", Объект.ПулСохранностьКапитала);
	Значения.Вставить("ПулРозничноеДУ", Объект.ПулРозничноеДУ);
	Значения.Вставить("ОбразецУП", Объект.ОбразецУП);
	Значения.Вставить("ОбразецНастройкиОтчетности", Объект.ОбразецНастройкиОтчетности);
	Значения.Вставить("ОбразецДоговорВознаграждения", Объект.ОбразецДоговорВознаграждения);
	Значения.Вставить("ОбразецДоговорБрокерский", Объект.ОбразецДоговорБрокерский);
	Значения.Вставить("ОбразецНастройкиВознаграждения", Объект.ОбразецНастройкиВознаграждения);
	Значения.Вставить("РазмерВознаграждения", Объект.РазмерВознаграждения);
	Значения.Вставить("ВеличинаВознагражденияЗаУспех", Объект.ВеличинаВознагражденияЗаУспех);
	Значения.Вставить("ТорговыйКод", Объект.ТорговыйКод);
	Значения.Вставить("БанковскийСчет", Объект.БанковскийСчет);
	Значения.Вставить("БанковскийСчетБрокера", Объект.БанковскийСчетБрокера);
	Значения.Вставить("СчетДепо", Объект.СчетДепо);
	Значения.Вставить("Брокер", Объект.Брокер);
	Значения.Вставить("Агент", Объект.Агент);
	Значения.Вставить("Биржа", Объект.Биржа);
	Значения.Вставить("СчетУБрокера", Объект.СчетУБрокера);
	Значения.Вставить("РабочееВремяНачало", Объект.РабочееВремяНачало);
	Значения.Вставить("РабочееВремяОкончание", Объект.РабочееВремяОкончание);
	Значения.Вставить("АдресВебДО", Объект.АдресВебДО);
	Значения.Вставить("ПользовательДО", Объект.ПользовательДО);
	Значения.Вставить("ПарольДО", Объект.ПарольДО);
	
	Значения.Вставить("ПочтовыйЛогин", Объект.ПочтовыйЛогин);
	Значения.Вставить("СписокРассылки", XMLСтрока(Новый ХранилищеЗначения(Объект.СписокРассылки.Выгрузить())));
	
	Представление = ?(ЗначениеЗаполнено(Объект.БазаДО),"Settings have been set:"+Объект.БазаДО + " "+Объект.ОповещениеОбОшибках,"");
	
	Заголовок = Представление;
	Заголовок = СокрЛП(Заголовок);

	Возврат Значения;

КонецФункции
