
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеЭлементамиФормыСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	
	УправлениеЭлементамиФормыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ВидОперацииПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЖурналОтправлений(Команда)
	
	ПараметрыФормы = Новый Структура;
	Отбор = ОтборНаСервере(Объект.GUIDПлатежа);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ИмяРегистра = "ЖурналИсходящихСообщенийKafka";
	ОткрытьФорму("РегистрСведений." + ИмяРегистра + ".ФормаСписка", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормыСервер()
	
	Элементы.ФормаЖурналОтправлений.Видимость = Объект.ВидОперации = Перечисления.ВидыПлатежныхОпераций.ВыплатаДохода;
	Элементы.GUIDПлатежа.Видимость = Объект.ВидОперации = Перечисления.ВидыПлатежныхОпераций.ВыплатаДохода;
	Элементы.ВыплатаДохода.Видимость = Объект.ВидОперации = Перечисления.ВидыПлатежныхОпераций.ОплатаНалога;
	Элементы.НачисленныйНалог.Видимость = Объект.ВидОперации = Перечисления.ВидыПлатежныхОпераций.ОплатаНалога;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтборНаСервере(Знач GUIDПлатежа)
	
	Возврат Документы.ПлатежнаяОперация.ОтборПоРеквизитуОтправляемыйОбъектKafka(GUIDПлатежа);
	
КонецФункции

#КонецОбласти
