
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		
		 Объект.АдминистраторГруппы = ПараметрыСеанса.ТекущийПользователь;
	 ИначеЕсли 
		 Объект.Ссылка = Справочники.ГруппыПользователей.ВсеПользователи Тогда
		 Элементы.ПользователиГруппы.ТолькоПросмотр = Истина;
		 Элементы.ПользователиГруппыПодбор.Доступность = Ложь;
	 КонецЕсли;	
	 
	 ПрочитатьПраваДоступаКОбъекту();
	 
 КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьПраваДоступаКОбъекту(ТекущийОбъект.Ссылка, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Пользователи") Тогда
		Если Объект.ПользователиГруппы.НайтиСтроки(Новый Структура("Пользователь", ВыбранноеЗначение)).Количество() = 0 Тогда
			НоваяСтрока = Объект.ПользователиГруппы.Добавить();
			НоваяСтрока.Пользователь = ВыбранноеЗначение;
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыОбластиДанныхДоступа

&НаКлиенте
Процедура ОбластиДанныхДоступаПриАктивизацииСтроки(Элемент)
	
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Элемент.ТекущиеДанные.Ссылка) Тогда
		ЗначениеОтбора = ПредопределенноеЗначение("Перечисление.НаборыПравПользователей.ПустаяСсылка");
	Иначе
		ЗначениеОтбора = Элемент.ТекущиеДанные.Ссылка;
	КонецЕсли;	
	Элементы.ПраваДоступаПользователей.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбластьДанных",ЗначениеОтбора);	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыПраваДоступаПользователей

&НаКлиенте
Процедура ПраваДоступаПользователейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	
	Если НоваяСтрока Тогда
		 ТекущиеДанныеОтбора = Элементы.ОбластиДанныхДоступа.ТекущиеДанные;
		 
		ТекущиеДанные = Элементы.ПраваДоступаПользователей.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			
			ТекущиеДанные.ОбластьДанных = ТекущиеДанныеОтбора.Ссылка;
			ТекущиеДанные.Чтение = Истина;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПраваДоступаПользователейПослеУдаления(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ПраваДоступаПользователейПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Модифицированность = Истина;
	
КонецПроцедуры

//#КонецОбласти


//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	
	ФормаПодбора = ПолучитьФорму("Справочник.Пользователи.ФормаВыбора",,ЭтаФорма);
	ФормаПодбора.ЗакрыватьПриВыборе = Ложь;
	
	ФормаПодбора.Открыть();
	
КонецПроцедуры


//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьПраваДоступаКОбъекту(Ссылка, Отказ)
	
	Набор = РеквизитФормыВЗначение("ПраваДоступаПользователей");
	ЗаписатьПраваДоступаКОбъектуИзОбщегоМодуля(Набор, Ссылка, Отказ);
	ЗначениеВРеквизитФормы(Набор,"ПраваДоступаПользователей");                      

	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПраваДоступаКОбъекту()
	
	Набор = РеквизитФормыВЗначение("ПраваДоступаПользователей");
	НастройкаПравДоступа.ПрочитатьПраваДоступаКОбъекту(Набор, Объект.Ссылка);
	ЗначениеВРеквизитФормы(Набор,"ПраваДоступаПользователей");
	Для каждого Запись Из ПраваДоступаПользователей   Цикл
		
		Запись.Чтение = Истина;
	
	КонецЦикла;
КонецПроцедуры

// В ОМ почему то закомментировано
&НаСервере
Процедура ЗаписатьПраваДоступаКОбъектуИзОбщегоМодуля(ПраваДоступаПользователей, Ссылка, Отказ) 

	Если НЕ Отказ Тогда
	
		// Сравним наборы записей
		ЭталонныйНабор = РегистрыСведений.ПраваДоступаПользователей.СоздатьНаборЗаписей();
		Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Пользователи") ИЛИ ТипЗнч(Ссылка) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
			ЭталонныйНабор.Отбор.Пользователь.Значение = Ссылка;
			ЭталонныйНабор.Отбор.Пользователь.Использование = Истина;
		Иначе
			ЭталонныйНабор.Отбор.ОбъектДоступа.Значение = Ссылка;
			ЭталонныйНабор.Отбор.ОбъектДоступа.Использование = Истина;
		КонецЕсли; 
		ЭталонныйНабор.Прочитать();
		
		Для каждого ЗаписьНабора Из ПраваДоступаПользователей Цикл
			Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Пользователи") ИЛИ ТипЗнч(Ссылка) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
				ЗаписьНабора.Пользователь = Ссылка;
			Иначе
				ЗаписьНабора.ОбъектДоступа = Ссылка;
			КонецЕсли; 
		КонецЦикла; 
			
		Если НЕ НастройкаПравДоступа.СравнитьТаблицыНаборовЗаписей(ЭталонныйНабор.Выгрузить(), ПраваДоступаПользователей.Выгрузить()) Тогда
		
			Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Пользователи") ИЛИ ТипЗнч(Ссылка) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
				ПраваДоступаПользователей.Отбор.Пользователь.Значение      = Ссылка;
				ПраваДоступаПользователей.Отбор.Пользователь.Использование = Истина;
			Иначе
				ПраваДоступаПользователей.Отбор.ОбъектДоступа.Значение      = Ссылка;
				ПраваДоступаПользователей.Отбор.ОбъектДоступа.Использование = Истина;
			КонецЕсли; 
			
			ПолныеПрава.ЗаписатьПраваДоступа(ПраваДоступаПользователей.Выгрузить(), НастройкаПравДоступа.ПолучитьСтруктуруОтборовНабораЗаписей(ПраваДоступаПользователей), Отказ, ("Элемент """ + СокрЛП(Ссылка) + """ не записан"));
			
			Если НЕ Отказ Тогда
				НастройкаПравДоступа.ПрочитатьПраваДоступаКОбъекту(ПраваДоступаПользователей, Ссылка);
			КонецЕсли; 

		КонецЕсли;
	
	КонецЕсли; 
	
КонецПроцедуры


//#КонецОбласти

