
// В качестве первого параметра ожидается ссылка, объект или представляющая его коллекция
Функция ЗначениеПараметра(Поручение, Шаблон) Экспорт
	Выражение = "";
	ОстатокШаблона = Шаблон;
	ПозицияРеквизита = Найти(Шаблон, "[");
	Если ПозицияРеквизита > 0 Тогда
		Пока ПозицияРеквизита > 0 Цикл
			Выражение = Выражение+Лев(ОстатокШаблона, ПозицияРеквизита-1)+"Поручение[";
			ОстатокШаблона = Сред(ОстатокШаблона, ПозицияРеквизита+1);
			ПозицияРеквизита = Найти(ОстатокШаблона, "[");
		КонецЦикла;
	КонецЕсли;
	Выражение = Выражение+ОстатокШаблона;
	Попытка
		Возврат Вычислить(Выражение);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

// В качестве параметра ожидается ссылка, объект или представляющая его коллекция
Функция ПараметрыДокумента(Поручение) Экспорт
	ЭтоНетто = ( ТипЗнч(Поручение.Ссылка) = Тип("ДокументСсылка.НеттоПоручение") );
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыСделокДляЭкспортаВЛучСрезПоследних.ИмяПараметра ИмяПараметра,
	|	ПараметрыСделокДляЭкспортаВЛучСрезПоследних.ВыражениеПоручения ВыражениеПоручения,
	|	ПараметрыСделокДляЭкспортаВЛучСрезПоследних.ВыражениеНеттоПоручения ВыражениеНеттоПоручения
	|ИЗ
	|	РегистрСведений.ПараметрыСделокДляЭкспортаВЛуч.СрезПоследних(
	|			&Период,
	|			ВидОперации = &ВидОперации
	|				И МестоРасчетов = &МестоРасчетов) КАК ПараметрыСделокДляЭкспортаВЛучСрезПоследних
	|ГДЕ
	|	ПараметрыСделокДляЭкспортаВЛучСрезПоследних.ФлагАктивности";
	Запрос.УстановитьПараметр("Период", Поручение.Дата);
	Запрос.УстановитьПараметр("ВидОперации", ?(ЭтоНетто, Поручение.ВидОперации, Поручение.ВидОперацииД));
	Запрос.УстановитьПараметр("МестоРасчетов", ?(ЭтоНетто, Поручение.МестоХраненияКонтрагента, Поручение.МХКонтрагент));
	Выборка = Запрос.Выполнить().Выбрать();
	Параметры = Новый Структура;
	Пока Выборка.Следующий() Цикл
		Если ЭтоНетто И ЗначениеЗаполнено(Выборка.ВыражениеНеттоПоручения) Тогда
			Параметры.Вставить(Выборка.ИмяПараметра, ЗначениеПараметра(Поручение, Выборка.ВыражениеНеттоПоручения));
		ИначеЕсли ЗначениеЗаполнено(Выборка.ВыражениеПоручения) Тогда
			Параметры.Вставить(Выборка.ИмяПараметра, ЗначениеПараметра(Поручение, Выборка.ВыражениеПоручения));
		КонецЕсли;
	КонецЦикла;
	Возврат Параметры;
КонецФункции
