
#Область ОбработчикиКомандФормы

// Процедура - Заполнить действующие комиссии на сервере
//
&НаСервере
Процедура ЗаполнитьДействующиеКомиссииНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокОбъект.ЗаполнитьДействующиеУслуги();
	
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры

// Процедура - Заполнить действующие комиссии
//
// Параметры:
//  Команда	 - КомандаФормы - 
//
&НаКлиенте
Процедура ЗаполнитьДействующиеКомиссии(Команда)
	
	ЗаполнитьДействующиеКомиссииНаСервере();
	
КонецПроцедуры

// Процедура - Заполнить комиссии к назначению на сервере
//
&НаСервере
Процедура ЗаполнитьКомиссииКНазначениюНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокОбъект.ЗаполнитьУслугиКНазначению();
	
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры

// Процедура - Обновить комиссии к назначению
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура ОбновитьКомиссииКНазначению(Команда)
	
	ЗаполнитьКомиссииКНазначениюНаСервере();
	
КонецПроцедуры

// Процедура - Проведение на клиенте (интерактивно)
//
// Параметры:
//  ЗакрытьФорму - Булево - Признак необходимости закрыть форму документа
//
&НаКлиенте
Процедура ПроведениеНаКлиенте(ЗакрытьФорму)
	
	Если Модифицированность Тогда
		
		ЗаписьПроведениеНаСервере(РежимЗаписиДокумента.Запись);
		
	КонецЕсли;
	
	Если Объект.УслугиКНазначению.Количество() = 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОПроведенииДокументаЗавершение", ЭтотОбъект, ЗакрытьФорму);
		
		ТекстВопроса = "Обратите внимание, при проведении документа будут отменены все комиссии. Подтвердить?";
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗаписьПроведениеНаСервере(РежимЗаписиДокумента.Проведение);
		
		Если ЗакрытьФорму Тогда
			
			ЭтаФорма.Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Оповестить("ИзменениеТарифногоПлана_ИзменилсяПризнакПроведения");
	
КонецПроцедуры

// Процедура - Проведение
//
// Параметры:
//  Команда	 - КомандаФормы - 
//
&НаКлиенте
Процедура Проведение(Команда)
	
	ЗакрытьФорму = Ложь;
	
	ПроведениеНаКлиенте(ЗакрытьФорму);
	
КонецПроцедуры

// Процедура - Провести и закрыть
//
// Параметры:
//  Команда	 - КомандаФормы - 
//
&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ЗакрытьФорму = Истина;
	
	ПроведениеНаКлиенте(ЗакрытьФорму);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Установить договор с клиентом
//
&НаСервере
Процедура УстановитьДоговорСКлиентом()
	
	ДоговорКУстановке = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Выборка = Справочники.ДоговорыКонтрагентов.Выбрать(, Объект.Клиент);
	
	Если Выборка.Следующий() Тогда
		
		ДоговорКУстановке = Выборка.Ссылка;
		
	КонецЕсли;
	
	Если ДоговорКУстановке <> Объект.ДоговорСКлиентом Тогда
		
		Объект.ДоговорСКлиентом = ДоговорКУстановке;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Найти дубли комиссий на сервере
//
&НаСервере
Процедура НайтиДублиКомиссийНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокОбъект.НайтиДублиУслуг();
	
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры

// Процедура - Вопрос о проведении документа завершение
//
// Параметры:
//  Результат - КодВозвратаДиалога - 
//  ЗакрытьФорму - Булево - Признак необходимости закрыть форму документа
//
&НаКлиенте
Процедура ВопросОПроведенииДокументаЗавершение(Результат, ЗакрытьФорму) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗаписьПроведениеНаСервере(РежимЗаписиДокумента.Проведение);
		
		Оповестить("ИзменениеТарифногоПлана_ИзменилсяПризнакПроведения");
		
		Если ЗакрытьФорму Тогда
			
			ЭтаФорма.Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - Булево - Признак отказа от создания формы
//  СтандартнаяОбработка - Булево - Признак выполнения стандартной (системной) обработки события
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Проведен Тогда
		
		ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Дата изменения тарифа при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура ДатаИзмененияТарифаПриИзменении(Элемент)
	
	ЗаполнитьДействующиеКомиссииНаСервере();
	
КонецПроцедуры

// Процедура - Договор с клиентом при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура ДоговорСКлиентомПриИзменении(Элемент)
	
	ЗаполнитьДействующиеКомиссииНаСервере();
	
КонецПроцедуры

// Процедура - Клиент при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	УстановитьДоговорСКлиентом();
	
	ЗаполнитьДействующиеКомиссииНаСервере();
	
КонецПроцедуры

// Процедура - Новый тарифный план при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура НовыйТарифныйПланПриИзменении(Элемент)
	
	ЗаполнитьКомиссииКНазначениюНаСервере();
	
КонецПроцедуры

// Процедура - Комиссии к назначению при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура КомиссииКНазначениюПриИзменении(Элемент)
	
	НайтиДублиКомиссийНаСервере();
	
КонецПроцедуры

// Процедура - Действующие комиссии к отмене при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
Процедура ДействующиеКомиссииКОтменеПриИзменении(Элемент)
	
	НайтиДублиКомиссийНаСервере();
	
КонецПроцедуры

// Процедура - Запись проведение на сервере
//
// Параметры:
//  РежимЗаписи	 - РежимЗаписиДокумента - 
//
&НаСервере
Процедура ЗаписьПроведениеНаСервере(РежимЗаписи)
	
	Записать(Новый Структура("РежимЗаписи", РежимЗаписи));
	
КонецПроцедуры

#КонецОбласти
