#Область ОписаниеПеременных

Перем мУжеБылПроведен;				// Булево. Устанавливается в обработчике события ПередЗаписью
Перем мПрошлыеДанныеДляВыгрузки;	// Массив структур. Устанавливается в обработчике события ПередЗаписью для того?
									// чтобы после записи была возможность изменились ли данные для выгрузки по
									// по сравнению с прошлой версией объекта.
#КонецОбласти


#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Если РучнойВвод Тогда
		Возврат;
	КонецЕсли;
	
	Префикс = "";
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Номер = "";
	Дата = Дата(1, 1, 1);
	Автор = Неопределено;
	Изменил = Неопределено;
	ИсходящийНомер = Неопределено;
	РучнойВвод = Ложь;
	СчетДепо = Неопределено;
	ВладелецСчета = Неопределено;
	ДатаНачПериода = Дата;
	ДатаКонПериода = Дата;
	Комментарий = "Копия документа: " + ОбъектКопирования.Ссылка;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаНачПериода) Или Не ЗначениеЗаполнено(ДатаКонПериода)  Тогда
		Если Операции.Количество() > 0 Тогда
			ПерваяОперация = Операции[0];
			ДатаНачПериода = НачалоДня(ПерваяОперация.ДатаОперации);
			ДатаКонПериода = КонецДня(ПерваяОперация.ДатаОперации);
		КонецЕсли;
	КонецЕсли;
	
	ВидОтчета = Перечисления.ВидыОтчетов.СводныйОтчетОСовершеннойОперации;
	
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Автор	= ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Если Не ЭтоНовый() Тогда
			Изменил	= ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИсходящийНомер) Тогда
		СпособОтправкиОтчета = Справочники.СпособыПередачиИнформации.ЭДО;
	Иначе
		СпособОтправкиОтчета = Справочники.СпособыПередачиИнформации.Лично;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Не ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
	мУжеБылПроведен = Не ЭтоНовый() И Проведен;
	Если мУжеБылПроведен Тогда
		мПрошлыеДанныеДляВыгрузки = ОбменДаннымиКафка.ДанныеДляВыгрузкиСводногоОтчетаПоСделкамVPFI_OTC(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ЗначениеЗаполнено(ИсходящийНомер) Тогда
		
		ИсходящийНомер = "";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ И Проведен Тогда
		ОбменДаннымиКафка.ВыгрузитьПервичныеДокументыПоСделкамVPFI_OTC(Ссылка, мУжеБылПроведен, мПрошлыеДанныеДляВыгрузки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
