#Область ПрограммныйИнтерфейс

// Функция - Номинал ценной бумаги по коду ru data
//
// Параметры:
//  КодЗагрузки	 - Строка	 - Код ценной бумаги в RuData (fintoolid)
//  Период		 - Дата		 - Период номинала (Неопределено - на текущую дату)
// 
// Возвращаемое значение:
//   - Число - Номинал ценной бумаги на дату
//
Функция НоминалЦеннойБумагиПоКодуRuData(КодЗагрузки, Период = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫРАЗИТЬ(КодыЗагрузки.Владелец КАК Справочник.ЦенныеБумаги).Ссылка КАК ЦеннаяБумагаСсылка
	|ПОМЕСТИТЬ ЦенныеБумаги
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	ВЫРАЗИТЬ(КодыЗагрузки.Биржа КАК Справочник.КлассификаторыЗагрузки).Ссылка = &RuData
	|	И КодыЗагрузки.Код = &Код
	|	И КодыЗагрузки.Владелец ССЫЛКА Справочник.ЦенныеБумаги
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НоминалЦБСрезПоследних.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.НоминалЦБ.СрезПоследних(
	|			&Период,
	|			ЦеннаяБумага В
	|				(ВЫБРАТЬ
	|					ЦенныеБумаги.ЦеннаяБумагаСсылка КАК ЦеннаяБумагаСсылка
	|				ИЗ
	|					ЦенныеБумаги)) КАК НоминалЦБСрезПоследних";
	
	Запрос.УстановитьПараметр("RuData", Справочники.КлассификаторыЗагрузки.RuData);
	Запрос.УстановитьПараметр("Код", СокрЛП(КодЗагрузки));
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Сумма;
	КонецЕсли;
	
КонецФункции

// Процедура - Установить номинал ценной бумаги по коду ru data
//
// Параметры:
//  Номинал		 - Число - Номинал
//  КодЗагрузки	 - Строка	 - Код ценной бумаги в RuData (fintoolid)
//  Период		 - Дата		 - Период номинала (Неопределено - на текущую дату)
//
Процедура УстановитьНоминалЦеннойБумагиПоКодуRuData(Номинал, КодЗагрузки, Знач Период = Неопределено) Экспорт
	
	ЦеннаяБумага = Справочники.ЦенныеБумаги.ЦеннаяБумагаПоКодуRuData(КодЗагрузки, Неопределено);
	Если Не ЗначениеЗаполнено(ЦеннаяБумага) Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	RuDataAPI.ОбновитьОстаточныйНоминалЦеннойБумаги(ЦеннаяБумага, Период, Номинал);
	
КонецПроцедуры

#КонецОбласти

