#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ФормаОПоступленииМатериаловКОбщемуСобраниюВладельцев",
		Перечисления.ФормыСообщенийКК.ОПоступленииМатериаловКОбщемуСобраниюВладельцев);
		
	Список.Параметры.УстановитьЗначениеПараметра("ФормаОПоступленииИнформацииИзБюллетеня",
		Перечисления.ФормыСообщенийКК.ОПоступленииИнформацииИзБюллетеня);
		
	Список.Параметры.УстановитьЗначениеПараметра("ФормаКонвертацияОбменЦБ",
		Перечисления.ФормыСообщенийКК.ОПроведенииКД_КонвертацияОбменЦБ);
		
	Список.Параметры.УстановитьЗначениеПараметра("ФормаОбъединениеВыпусковЦБ",
		Перечисления.ФормыСообщенийКК.ОПроведенииКД_ОбъединениеВыпусковЦБ);
		
	Список.Параметры.УстановитьЗначениеПараметра("ФормаРеорганизацииОбщества", 
		Перечисления.ФормыСообщенийКК.ОПроведенииКД_РеорганизацииОбщества);
		
	Список.Параметры.УстановитьЗначениеПараметра("ФормаCписаниеЦБ", Перечисления.ФормыСообщенийКК.ОПроведенииКД_CписаниеЦБ);
	Список.Параметры.УстановитьЗначениеПараметра("ФормаCвязанногоСВыплатой", Перечисления.ФормыСообщенийКК.ОПроведенииКД_CвязанногоСВыплатой);
	Список.Параметры.УстановитьЗначениеПараметра("ФормаОтменыКД", Перечисления.ФормыСообщенийКК.ОбОтменеКД);
		
	ОбщегоНазначения.ПриСозданииНаСервере(ЭтаФорма);
	УстановитьУсловноеОформление();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправленныеУведомления(Команда)
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		Отбор = Новый Структура("КД", Элементы.Список.ТекущаяСтрока);
		Парам = Новый Структура("Отбор", Отбор);
		ОткрытьФорму("РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет.ФормаСписка", Парам);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	ОбщегоНазначения.СписокПередЗагрузкойПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	Список.УсловноеОформление.Элементы.Очистить();
	ЭлементУсловногоОформления = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловия = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДополнительнаяИнформация");
	ЭлементУсловия.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементУсловия.ПравоеЗначение 	= "Экономически значимая организация";
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 0, 0));
	ЭлементУсловногоОформления.Использование = Истина;
КонецПроцедуры

#КонецОбласти

