
#Область ПрограммныйИнтерфейс

// BSLLS:DuplicateStringLiteral-off

// Возвращает соответствие полей ММВБ и регистра сведений котировки
// 
// Возвращаемое значение:
//   - Соотвествие - Соотвествие между именами полей котировки
//
Функция СоответствиеПолейММВБиРСКотировки() Экспорт
	
	ИменаПолей = "Ключ, Тип, ВПроцентах";
	ИмяТипаЧисло = "ТипЧисло";
	
	СоответствиеПолей = Новый Соответствие;
	
	СоответствиеПолей.Вставить("VOLUME", 					Новый Структура(ИменаПолей, "volume"				, ИмяТипаЧисло, Ложь));
	СоответствиеПолей.Вставить("VALUE", 					Новый Структура(ИменаПолей, "value"					, ИмяТипаЧисло, Ложь));
	СоответствиеПолей.Вставить("OPENPERIOD",				Новый Структура(ИменаПолей, "OpenPeriod"			, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("OPEN", 						Новый Структура(ИменаПолей, "Open"					, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("LOW", 						Новый Структура(ИменаПолей, "Low"					, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("HIGH", 						Новый Структура(ИменаПолей, "High"					, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("CLOSE", 					Новый Структура(ИменаПолей, "last_price"			, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("LOWOFFER", 					Новый Структура(ИменаПолей, "LowOffer"				, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("HIGHBID", 					Новый Структура(ИменаПолей, "HighBid"				, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("WAPRICE", 					Новый Структура(ИменаПолей, "WAPrice"				, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("CLOSEPERIOD",				Новый Структура(ИменаПолей, "ClosePeriod"			, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("CLOSEAUCTION", 				Новый Структура(ИменаПолей, "ClosePeriod"			, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("TRENDCLOSE", 				Новый Структура(ИменаПолей, "TrendClose"			, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("TRENDWAP", 					Новый Структура(ИменаПолей, "TrendWAP"				, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("BID", 						Новый Структура(ИменаПолей, "Bid"					, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("OFFER", 					Новый Структура(ИменаПолей, "Offer"					, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("PREV", 	 					Новый Структура(ИменаПолей, "Prev"					, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("YIELDATWAP", 				Новый Структура(ИменаПолей, "YieldAtWAP"			, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("YIELDCLOSE", 				Новый Структура(ИменаПолей, "YieldClose"			, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("ACCINT",					Новый Структура(ИменаПолей, "AccInt"				, ИмяТипаЧисло, Ложь));
	СоответствиеПолей.Вставить("ACCINTFACE", 				Новый Структура(ИменаПолей, "AccInt"				, ИмяТипаЧисло, Ложь));
	СоответствиеПолей.Вставить("NUMTRADES", 				Новый Структура(ИменаПолей, "trades_num"			, ИмяТипаЧисло, Ложь));
	СоответствиеПолей.Вставить("ISSUESIZE", 				Новый Структура(ИменаПолей, "IssueSize"				, ИмяТипаЧисло, Ложь));
	СоответствиеПолей.Вставить("TRENDCLSPR", 				Новый Структура(ИменаПолей, "TrendClsPr"			, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("TRENDWAPPR", 				Новый Структура(ИменаПолей, "TrendWapPr"			, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("MATDATE", 					Новый Структура(ИменаПолей, "MatDate"				, "ТипДата"	  , Ложь));
	СоответствиеПолей.Вставить("MARKETPRICE", 				Новый Структура(ИменаПолей, "РыночнаяЦена"			, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("MARKETPRICE2", 				Новый Структура(ИменаПолей, "MarketPrice2"			, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("MARKETPRICE3", 				Новый Структура(ИменаПолей, "MarketPrice3"			, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("ADMITTEDQUOTE", 			Новый Структура(ИменаПолей, "ПризнаваемаяКотировка"	, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("LISTNAME", 					Новый Структура(ИменаПолей, "КотировальныйЛист"		, "ТипСтрока" , Ложь));
	СоответствиеПолей.Вставить("PREVLEGALCLOSEPRICE", 		Новый Структура(ИменаПолей, "PrevLegalClosePrice"	, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("LEGALOPENPRICE", 			Новый Структура(ИменаПолей, "LegalOpenPrice"		, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("LEGALCLOSEPRICE", 			Новый Структура(ИменаПолей, "LegalClosePrice"		, ИмяТипаЧисло, Истина));
	СоответствиеПолей.Вставить("OPENVAL", 					Новый Структура(ИменаПолей, "OpenVal"				, ИмяТипаЧисло, Ложь));
	СоответствиеПолей.Вставить("CLOSEVAL", 					Новый Структура(ИменаПолей, "CloseVal"				, ИмяТипаЧисло, Ложь));
	
	Возврат СоответствиеПолей;
	
КонецФункции

// BSLLS:DuplicateStringLiteral-on

#КонецОбласти
