
&НаКлиенте
Процедура КомандаЗагрузитьСписокИзБуфера(Команда)

	Объект.СписокРелиза.Очистить();
	
	ComОбъект = ПолучитьCOMОбъект("", "htmlfile");
	Если ComОбъект <> Неопределено Тогда
		Текст = ComОбъект.parentWindow.ClipboardData.getData("Text");
		Счетчик = 0;
		Пока Счетчик < СтрЧислоСтрок(Текст) Цикл
			Счетчик = Счетчик + 1;
			ЗадачаРелиза = Число(СтрПолучитьСтроку(Текст, Счетчик));
			ДобавитьЗадачуВСписокРелизаНаСервере(ЗадачаРелиза);
		КонецЦикла;
	КонецЕсли;
	
	ОпределитьЗадачиРелизаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗадачуВСписокРелизаНаСервере(НомерЗадачи)

	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ДобавитьНомерЗадачиРелиза(НомерЗадачи);
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");

КонецПроцедуры

&НаСервере
Процедура ОпределитьЗадачиРелизаНаСервере()

	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ОпределитьЗадачиРелиза();
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(РеквизитФормыВЗначение("Объект"));
	
	Объект.ПоказыватьВсеОбработчики = Ложь;
	ЗаполнитьСписокОбновленияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьЗаголовокКнопкиПереключенияФильтра();
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьОбновление(Команда)
	
	ВыполнитьОбновлениенаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбновлениеНаСервере()

	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	ВыполнитьОбновлениеПоЗадаче = Истина;
	ТекОбъект.ОбновитьВерсии(ВыполнитьОбновлениеПоЗадаче);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИдентификаторыМетаданных(Команда)
	
	ОбновитьИдентификаторыМетаданныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИдентификаторыМетаданныхНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОбновитьИдентификаторыМетаданных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьФильтр(Команда)
	Объект.ПоказыватьВсеОбработчики = Не Объект.ПоказыватьВсеОбработчики;
	УстановитьЗаголовокКнопкиПереключенияФильтра();
	ЗаполнитьСписокОбновленияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокКнопкиПереключенияФильтра()
	Если Объект.ПоказыватьВсеОбработчики Тогда
		НовыйЗаголовок = "Показать только еще не выполнявшиеся обработчики";
	Иначе
		НовыйЗаголовок = "Показать все обработчики - включая выполнявшиеся";
	КонецЕсли;
	Элементы.СписокОбновленияПреключательВсеНевыполненые.Заголовок = НовыйЗаголовок;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОбновленияНаСервере();
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ВыполнитьОбновлениеПоЗадаче = Ложь;
	ТекОбъект.ОбновитьВерсии(ВыполнитьОбновлениеПоЗадаче);
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	
	Если Не Объект.ПоказыватьВсеОбработчики Тогда
		Запрос = новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокОбновления.НомерСтроки,
		|	СписокОбновления.НомерЗадачи
		|ПОМЕСТИТЬ ВТ_СписокОбновления
		|ИЗ &СписокОбновления КАК СписокОбновления
		|;
		|
		|////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокОбновления.НомерЗадачи
		|ИЗ ВТ_СписокОбновления
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналРегистрацииВыполненияОбработчиковОбновления КАК ЖурналРегистрацииВыполненияОбработчиковОбновления
		|		ПО ВТ_СписокОбновления.НомерЗадачи = ЖурналРегистрацииВыполненияОбработчиковОбновления.НомерЗадачи
		|ГДЕ
		|	ЖурналРегистрацииВыполненияОбработчиковОбновления.НомерЗадачи ЕСТЬ NULL
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_СписокОбновления.НомерСтроки
		|";
		Запрос.УстановитьПараметр("СписокОбновления", Объект.СписокОбновления.Выгрузить());
		НевыполнявшиесяОбработчики = Запрос.Выполнить().Выгрузить();
		Объект.СписокОбновления.Очистить();
		Объект.СписокОбновления.Загрузить(НевыполнявшиесяОбработчики);
	КонецЕсли;
КонецПроцедуры

