
&НаКлиенте
Процедура ЗагрузитьДокументы(Команда)
	ОткрытьФормуМодально(ИмяФормыОбработкиФормированиеРаскрытияСпискаВладельцев(), , ЭтаФорма);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Функция ИмяФормыОбработкиФормированиеРаскрытияСпискаВладельцев()
	Обработка = Обработки.ФормированиеРаскрытияСпискаВладельцев.Создать();
	Возврат Обработка.Метаданные().Формы.Получить(0).ПолноеИмя();
КонецФункции

&НаКлиенте
Процедура ЗагрузкаРаскрытияСпискаPARTADЧерезШлюз(Команда)
	
	ПериодЗагрузки = Новый СтандартныйПериод;
	ПериодЗагрузки.ДатаНачала = НачалоДня(ТекущаяДата());
	ПериодЗагрузки.ДатаОкончания = КонецДня(ТекущаяДата());
	Диалог = Новый ДиалогРедактированияСтандартногоПериода(); 
	Диалог.Период = ПериодЗагрузки; 
	Если Диалог.Редактировать() Тогда 
		ПериодЗагрузки = Диалог.Период; 
		ЗагрузкаРаскрытияСпискаPARTADЧерезШлюзНаСервере(ПериодЗагрузки.ДатаНачала, ПериодЗагрузки.ДатаОкончания);
	КонецЕсли;
	
КонецПроцедуры

&наСервере
Процедура ЗагрузкаРаскрытияСпискаPARTADЧерезШлюзНаСервере(ДатаНачала, ДатаОкончания)
	
	РаскрытиеСпискаВладельцев.ЗагрузитьФайлыРаскрытияСписковИзШлюза(ДатаНачала, ДатаОкончания);	
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияКД(Команда)
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		Отбор = Новый Структура("ДокументКД", Элементы.Список.ТекущаяСтрока);
		Парам = Новый Структура("Отбор", Отбор);
		ОткрытьФорму("РегистрСведений.ЭтапыКД.ФормаСписка", Парам);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИдентификаторыОформлений = Новый СписокЗначений;
	ИдентификаторыОформлений.Добавить("ВыделятьПоСубклиентамИСтатусуОтправленЗапросНД",
		"Красным цветом документы по субклиентам со статусом 'Отправлен запрос на раскрытие НД'");
	ИдентификаторыОформлений.Добавить("ВыделятьПоСубклиентамИСтатусуПолученОтветНД",
		"Серым цветом документы по субклиентам со статусом 'Получен ответ НД по раскрытию'");
	ИдентификаторыОформлений.Добавить("ВыделятьПоСубклиентамСДедлайном",
		"Жирным шрифтом документы по субклиентам с дедлайном");
	
	ОчиститьУстановленныРанееВыделения(ИдентификаторыОформлений);
	ВыделятьРСВПоСубклиентамИСтатусу(Перечисления.СтатусыРаскрытияСписковВладельцев.ОтправленЗапросНаРаскрытиеНД,
		WebЦвета.Кирпичный, ИдентификаторыОформлений[0]);
	ВыделятьРСВПоСубклиентамИСтатусу(Перечисления.СтатусыРаскрытияСписковВладельцев.ПолученОтветНДПоРаскрытию,
		WebЦвета.ТусклоСерый, ИдентификаторыОформлений[1]);
	ВыделятьРСВПоСубклиентамСДедлайном(ИдентификаторыОформлений[2]);
КонецПроцедуры

&НаСервере
Процедура ОчиститьУстановленныРанееВыделения(ИдентификаторыОформлений)
	УдаляемыеЭлементы = Новый Массив;
	
	Для Каждого ЭлементОформления Из Список.УсловноеОформление.Элементы Цикл
		Если ИдентификаторыОформлений.НайтиПоЗначению(ЭлементОформления.ПредставлениеПользовательскойНастройки) <> Неопределено Тогда
			УдаляемыеЭлементы.Добавить(ЭлементОформления);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент Из УдаляемыеЭлементы Цикл
		Список.УсловноеОформление.Элементы.Удалить(Элемент);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ВыделятьРСВПоСубклиентамИСтатусу(Статус, ЦветТекста, ИдентификаторОформления)
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветТекста);
	ЭлементОформления.Представление = ИдентификаторОформления.Представление;
	ЭлементОформления.ПредставлениеПользовательскойНастройки = ИдентификаторОформления.Значение;
	
	ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Ссылка.ТребуетсяРаскрытиеПоСубклиентам");
	ЭлементУсловия.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение	= Истина;
	ЭлементУсловия.Использование	= Истина;
	
	ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Статус");
	ЭлементУсловия.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение	= Статус;
	ЭлементУсловия.Использование	= Истина;
КонецПроцедуры

&НаСервере
Процедура ВыделятьРСВПоСубклиентамСДедлайном(ИдентификаторОформления)
	ЖирныйШрифт = Новый Шрифт(,,Истина);
	
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ЖирныйШрифт);
	ЭлементОформления.Представление = ИдентификаторОформления.Представление;
	ЭлементОформления.ПредставлениеПользовательскойНастройки = ИдентификаторОформления.Значение;
	
	ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Ссылка.ТребуетсяРаскрытиеПоСубклиентам");
	ЭлементУсловия.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение	= Истина;
	ЭлементУсловия.Использование	= Истина;
	
	ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Ссылка.ДатаОкончанияПриемаИнструкцийВТБКБ");
	ЭлементУсловия.ВидСравнения		= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементУсловия.ПравоеЗначение	= КонецДня(ТекущаяДата());
	ЭлементУсловия.Использование	= Истина;
	
	ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Статус");
	ЭлементУсловия.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементУсловия.ПравоеЗначение	= Перечисления.СтатусыРаскрытияСписковВладельцев.Выгружено;
	ЭлементУсловия.Использование	= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтправленныеУведомления(Команда)
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		Отбор = Новый Структура("КД", Элементы.Список.ТекущаяСтрока);
		Парам = Новый Структура("Отбор", Отбор);
		ОткрытьФорму("РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет.ФормаСписка", Парам);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРСВ_FCDR(Команда)
	ОткрытьФорму("Обработка.РаскрытиеСписковВладельцевFCDR_2017_02.Форма");
КонецПроцедуры
