//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОперацияЦБ",Отчет.ОперацияЦБ);
	Параметры.Свойство("ДатаВыписки",Отчет.ДатаВыписки);
	Параметры.Свойство("Автоисполнение",Отчет.Автоисполнение);
	Параметры.Свойство("ДатаФормированияОтчетов",Отчет.ДатаФормированияОтчетов);
	
	Если Не ЗначениеЗаполнено(Отчет.ТипОперации) И ЗначениеЗаполнено(Отчет.ОперацияЦБ) Тогда
		Отчет.ТипОперации	= ПолучитьИмя(Отчет.ОперацияЦБ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.ДатаФормированияОтчетов) Тогда
		Отчет.ДатаФормированияОтчетов = ТекущаяДата();
	КонецЕсли;
	
	Если Отчет.Автоисполнение Тогда
		СформироватьНаСервере();
	Иначе 
		Отчет.ДатаФормированияОтчетов = ТекущаяДата();
	КонецЕсли;
	
	ИсключаемыеДокументы = Новый Массив;
	ИсключаемыеДокументы.Добавить("ФормированиеОтчетаВыписки");
	
	Для Каждого ТипДокумента Из Документы.Выписка.ПустаяСсылка().Метаданные().Реквизиты.ОперацияЦБ.Тип.Типы() Цикл
		ДокументСсылка	= Новый(ТипДокумента);
		Имя				= ДокументСсылка.Метаданные().Имя; 
		Синоним			= ДокументСсылка.Метаданные().Синоним;
		Если ИсключаемыеДокументы.Найти(Имя) = Неопределено Тогда
			Элементы.ТипОперации.СписокВыбора.Добавить(Имя, Синоним);
		КонецЕсли;
	КонецЦикла;
	Элементы.ТипОперации.СписокВыбора.Добавить("СводноеПоручение", "Сводное поручение");
	Элементы.ТипОперации.СписокВыбора.СортироватьПоПредставлению();
	
	Параметры.Свойство("ПоместитьВЭДО", Отчет.ПоместитьВЭДО);
	Параметры.Свойство("ИмяОбработкиЭДО", Отчет.ИмяОбработкиЭДО);
	Параметры.Свойство("ВыгружатьПовторно", Отчет.ВыгружатьПовторно);
	Если Отчет.ВыгружатьПовторно Тогда
		Заголовок = "Тестирование";
	КонецЕсли;
	Если Найти(ИмяФормы, "Внешний") Тогда
		Заголовок = Заголовок + " Внешний";
		ИспользуемоеИмяФайла = РеквизитФормыВЗначение("Отчет").ИспользуемоеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ИспользуемоеИмяФайла) Тогда
		Файл = Новый ДвоичныеДанные(ИспользуемоеИмяФайла);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ДлительныеОперацииКлиент.ПодтвердитьДействие("Отменить формирование отчета?", ЭтаФорма, Отказ);
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОперацияЦБПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Отчет.ОперацияЦБ) Тогда
		Отчет.ДатаВыписки = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Отчет.ОперацияЦБ, "Дата");
	КонецЕсли;
	Отчет.Основание = "";

КонецПроцедуры

&НаКлиенте
Процедура ДатаФормированияОтчетовОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отчет.ДатаФормированияОтчетов = НачалоМинуты(ТекущаяДата());
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Формируется = Ложь;
	ДлительныеОперацииКлиент.ПодтвердитьДействие("Отчет формируется, прервать?", ЭтаФорма, Формируется);
	Если Не Формируется Тогда
		ПараметрыФоновогоВыполнения = РезультатЗапускаФормированияВФоне();
		ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ОкончаниеФормирования", ЭтаФорма, ПараметрыФоновогоВыполнения);
		ДлительныеОперацииКлиент.ДобавитьОбработчикОповещения(ОписаниеОповещения, 10, Элементы.ТабличныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтчет() Экспорт
	
	СформироватьНаСервере();
	
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
	
	НашОбъект = РеквизитФормыВЗначение("Отчет");
	НашОбъект.СформироватьОтчет(ТабличныйДокумент);
	ЗначениеВРеквизитФормы(НашОбъект,"Отчет");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмя(ОперацияЦБ)
	
	Возврат ОперацияЦБ.Метаданные().Имя;
	
КонецФункции

&НаСервере
Функция РезультатЗапускаФормированияВФоне()
	
	ОписаниеОбъекта = Оболочки.ПараметрыОбъектаФормы(ЭтаФорма);//, "Отчет");
	ПараметрыМетода = Новый Структура("ДокументРезультат", ТабличныйДокумент);
	Возврат Оболочки.ВыполнениеМетодаОбъектаВФоне(ОписаниеОбъекта, "СформироватьОтчет", ПараметрыМетода);
	
КонецФункции

// Обработчик оповещения об окончании формирования отчёта
//
// Параметры:
//  Результат	 - Произвольный	 - Структура с результатом формирования отчёта или информация об ошибке
//  Параметры	 - Произвольный	 - Структура с информацией о фоновом задании
//
&НаКлиенте
Процедура Подключаемый_ОкончаниеФормирования(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ТабличныйДокумент = Результат.ПараметрыМетода.ДокументРезультат;
	ИначеЕсли ТипЗнч(Результат) = Тип("ИнформацияОбОшибке") Тогда
		ОбщегоНазначения.СообщитьОбОшибке(ПодробноеПредставлениеОшибки(Результат));
	КонецЕсли;
	
КонецПроцедуры

//#КонецОбласти
