
Процедура ОбработкаЗаполнения(Основание)
		
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение") Тогда
		
		Если 	Основание.ВидОперацииД   = Справочники.ВидыОпераций.ФормированиеРеестраВладельцевЦБ   Тогда
						
			//проверка на существование документов введенных на основании текущего основания.	
			Если ПроверкаНаСозданныеДокументыНаОснованииТекщего(Основание) Тогда
				
				Проверка = Истина;
				Сообщить("На основании данного поручения уже есть введенный документ!!!");
				Возврат;
				
			КонецЕсли;
			Дата						= ОбщегоНазначения.ДатаДокумента(Основание);
			ДокументОснование 			= Основание.Ссылка;			
			Если ТипЗнч(Основание.Инициатор) = Тип("СправочникСсылка.Контрагенты") Тогда
				Эмитент		 			= Основание.Инициатор;
			Иначе
				МестоХранения			= Основание.Инициатор;	
			КонецЕсли;	
			Автор 						= Основание.Автор;
			Изменил 					= Основание.Изменил;
			Комментарий					= Основание.Комментарий;
		Иначе
			Проверка = Истина;
			Сообщить("На основании данного вида поручения нельзя создать документ ""Формирование реестра владельцев"" !!!");
			Возврат;	
		КонецЕсли;
			
	КонецЕсли;
КонецПроцедуры

Функция ПроверкаНаСозданныеДокументыНаОснованииТекщего(Основание)
	
		ЗапретРедактирования   = Ложь;
	
		ЗапретРедактирования = НЕ Документы.ФормированиеРеестраВладельцев.НайтиПоРеквизиту("ДокументОснование",Основание).Пустая();
			
		Если ЗапретРедактирования Тогда
			
			Возврат Истина;
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;
		
КонецФункции // ПроверкаНаСозданныеДокументыНаОснованииТекщего()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНовыйНомер();
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры
