
////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ И ЭЛЕМЕНТОВ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаУведомленияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаУведомленияПриИзменении(Элемент)
	
	ДатаУведомленияПриИзмененииНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура СформироватьСписокДепонентов(Команда)
	
	СформироватьСписокДепонентовНаСервере();
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДепоненты;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУведомление(Команда)
	
	ОтправитьУведомлениеНаСервере();
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТекстУведомления;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ

&НаСервере
Процедура СформироватьСписокДепонентовНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СформироватьСписокДепонентов();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьУведомлениеНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОтправитьУведомление();
	ОбработкаОбъект.ЗафиксироватьОтправленноеУведомлениеВРегистре();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ДатаУведомленияПриИзмененииНаСервере()

	Если НЕ ЗначениеЗаполнено(Объект.ДатаУведомления) Тогда
		Объект.ДатаУведомления = ТекущаяДатаСеанса();
	КонецЕсли;
	ДатаОтбораБП = БизнесПроцессы.ОбработкаWTRCСообщения.ДатаСкорогоОкончанияПриемаИнструкцийНРД(
		Объект.ДатаУведомления);
	
КонецПроцедуры
