#Область ПрограммныйИнтерфейс

Процедура ПриСозданииНаСервере(Форма, ИмяРеквизитаВладельца = "Ссылка", ИмяРеквизитаНабора = "НаборКонтактнаяИнформация") Экспорт
	
	РеквизитПараметрыКИ = Новый РеквизитФормы("ПараметрыКонтактнойИнформации", Новый ОписаниеТипов(Неопределено));
	ДобавляемыеРеквизиты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РеквизитПараметрыКИ);
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ПараметрыКИ = Новый Структура;
	ПараметрыКИ.Вставить("ИмяРеквизитаВладельца", ИмяРеквизитаВладельца);
	ПараметрыКИ.Вставить("ИмяРеквизитаНабора", ИмяРеквизитаНабора);
	Форма.ПараметрыКонтактнойИнформации = Новый ФиксированнаяСтруктура(ПараметрыКИ);
		
	ПрочитатьКонтактнуюИнформацию(Форма);
	УстановитьУсловноеОформление(Форма);
	Форма.Элементы[ИмяРеквизитаНабора + "Представление"].КнопкаВыбора = Истина;
	
КонецПроцедуры

Процедура ПриЗаписиНаСервере(Форма, ТекущийОбъект, Отказ, ДопСвойства = Неопределено) Экспорт
	
	ИмяРеквизитаВладельца = Форма.ПараметрыКонтактнойИнформации.ИмяРеквизитаВладельца;
	ИмяРеквизитаНабора = Форма.ПараметрыКонтактнойИнформации.ИмяРеквизитаНабора;
	
	ВладелецКИ = ТекущийОбъект[ИмяРеквизитаВладельца];
	НаборЗначение = Форма.РеквизитФормыВЗначение(ИмяРеквизитаНабора);
	
	Если ДопСвойства <> Неопределено Тогда
		Для каждого Элемент Из ДопСвойства Цикл
			НаборЗначение.ДополнительныеСвойства.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	КонтактнаяИнформация.ЗаписатьКонтактнуюИнформацию(НаборЗначение, ВладелецКИ, Отказ);
	Форма.ЗначениеВРеквизитФормы(НаборЗначение, ИмяРеквизитаНабора);
	
КонецПроцедуры

Процедура ПрочитатьКонтактнуюИнформацию(Форма) Экспорт
	
	ИмяРеквизитаНабора = Форма.ПараметрыКонтактнойИнформации.ИмяРеквизитаНабора;
	
	ВладелецКИ = КонтактнаяИнформацияКлиентСервер.ВладелецКИ(Форма);
	
	НаборЗначение = Форма.РеквизитФормыВЗначение(ИмяРеквизитаНабора);
	КонтактнаяИнформация.ПрочитатьКонтактнуюИнформацию(НаборЗначение, ВладелецКИ);	
	Форма.ЗначениеВРеквизитФормы(НаборЗначение, ИмяРеквизитаНабора);
	
	УстановитьСвязиПараметровВыбора(Форма, ВладелецКИ);
	
КонецПроцедуры

Процедура ПриСозданииНаСервереФормыВводаКИ(ФормаВводаКИ, Отказ) Экспорт
	
	Если НЕ ФормаВводаКИ.Параметры.Свойство("Запись") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 	
	ЗаполнитьЗначенияСвойств(ФормаВводаКИ.Объект, ФормаВводаКИ.Параметры.Запись);
		
	КомандаФормы = ФормаВводаКИ.Команды.Добавить("СохранитьИЗакрыть");
	КомандаФормы.Действие = "Подключаемый_СохранитьИЗакрыть";
	КомандаФормы.Заголовок = "Сохранить и закрыть";
	
	СледЭлем = Неопределено;
	Если ЗначениеЗаполнено(ФормаВводаКИ.КоманднаяПанель.ПодчиненныеЭлементы) Тогда
		СледЭлем = ФормаВводаКИ.КоманднаяПанель.ПодчиненныеЭлементы[0];
	КонецЕсли; 
	
	ЭлемКоманды = ФормаВводаКИ.Элементы.Вставить("ФормаСохранитьИЗакрыть",
		Тип("КнопкаФормы"),
		ФормаВводаКИ.КоманднаяПанель,
		СледЭлем);
	
	ЭлемКоманды.ИмяКоманды = "СохранитьИЗакрыть";
	ЭлемКоманды.КнопкаПоУмолчанию = Истина;
	
	ВидОбъекта = КонтактнаяИнформация.ВидОбъектаКИ(ФормаВводаКИ.Объект.Объект);		
	ЭлемФормы = ФормаВводаКИ.Элементы.Вид;
	
	СписокПарамВыбора = Новый Массив;
	ПарамВыбора = Новый ПараметрВыбора("Отбор.ВидОбъектаКонтактнойИнформации", ВидОбъекта);
	СписокПарамВыбора.Добавить(ПарамВыбора);
	
	ПарамВыбора = Новый ПараметрВыбора("Отбор.Тип", ФормаВводаКИ.Объект.Тип);
	СписокПарамВыбора.Добавить(ПарамВыбора);
	
	ЭлемФормы.ПараметрыВыбора = Новый ФиксированныйМассив(СписокПарамВыбора);					
	
	Если ФормаВводаКИ.Параметры.Свойство("РедактироватьВладельца") Тогда
		ФормаВводаКИ.Элементы.Объект.Видимость = Истина;
		ФормаВводаКИ.Элементы.Объект.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСвязиПараметровВыбора(Форма, ВладелецКИ)
	
	ИмяРеквизитаНабора = Форма.ПараметрыКонтактнойИнформации.ИмяРеквизитаНабора;
	ВидОбъекта = КонтактнаяИнформация.ВидОбъектаКИ(ВладелецКИ);	
	ТаблицаНабора = Форма.Элементы[ИмяРеквизитаНабора];
	
	ПутьКДанным = ИмяРеквизитаНабора + ".Вид";
	Для каждого ЭлемКолонка Из ТаблицаНабора.ПодчиненныеЭлементы Цикл		
		Если ТипЗнч(ЭлемКолонка) = Тип("ПолеФормы") Тогда
			Если ЭлемКолонка.ПутьКДанным = ПутьКДанным Тогда				
					Связь = Новый СвязьПараметраВыбора("Отбор.Тип",
						"Элементы." + ИмяРеквизитаНабора + ".ТекущиеДанные.Тип");
					Связи = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Связь);
					ЭлемКолонка.СвязиПараметровВыбора = Новый ФиксированныйМассив(Связи);

					ПарамВыбора = Новый ПараметрВыбора("Отбор.ВидОбъектаКонтактнойИнформации", ВидОбъекта);
					СписокПарамВыбора = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПарамВыбора);
					ЭлемКолонка.ПараметрыВыбора = Новый ФиксированныйМассив(СписокПарамВыбора);					
				Прервать;
			КонецЕсли;			
		КонецЕсли;  		
	КонецЦикла; 
		
КонецПроцедуры 
 
Процедура УстановитьУсловноеОформление(Форма)
	ИмяРеквизитаНабора = Форма.ПараметрыКонтактнойИнформации.ИмяРеквизитаНабора;
	ТаблицаНабора = Форма.Элементы[ИмяРеквизитаНабора];
	
	ЭлемУФ = Форма.УсловноеОформление.Элементы.Добавить();	
	ЭлемОтбора = ЭлемУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	
	ИмяЛевогоЗначения = ИмяРеквизитаНабора + ".Представление";
	ЭлемОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяЛевогоЗначения);
	ЭлемОтбора.Использование = Истина;
	ЭлемОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	 
	ЭлемУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);	
	
	ПутьКДанным = ИмяРеквизитаНабора + ".Представление";
	
	Для каждого ЭлемКолонка Из ТаблицаНабора.ПодчиненныеЭлементы Цикл		
		Если ТипЗнч(ЭлемКолонка) = Тип("ПолеФормы") Тогда
			Если ЭлемКолонка.ПутьКДанным <> ПутьКДанным Тогда
			    ПолеОформления = ЭлемУФ.Поля.Элементы.Добавить();	
			    ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(ЭлемКолонка.Имя); 
			    ПолеОформления.Использование = Истина;					
			КонецЕсли; 		
		КонецЕсли;  		
	КонецЦикла; 	
		
КонецПроцедуры

#КонецОбласти 