
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбора.Заголовок                   = "Выберите файл для загрузки данных";
	ДиалогВыбора.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбора.ИндексФильтра               = 0;
	ДиалогВыбора.ПолноеИмяФайла              = Элемент.ТекстРедактирования;
	ДиалогВыбора.ПроверятьСуществованиеФайла = Ложь;
	
	
	
	//Если Строка(Брокер.УникальныйИдентификатор()) = "73fc232b-45e3-11e2-b4e9-005056b100ec" Тогда // Банк ВТБ
		ФорматФайлаXLSX = "XLSX";
	//Иначе
		ФорматФайла = "XLS";
	//КонецЕсли;
	
	Фильтр = НСтр("ru = 'Файлы " + ФорматФайла + "|*." + ФорматФайла + ";*." + ФорматФайлаXLSX +"| ZIP архив |*.zip| Файл json |*.json'");
	ДиалогВыбора.Фильтр = Фильтр;	
	
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяФайла = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчитатьФайл(Команда)
	ОчиститьСообщения();
	ИмяКаталогаРазархива = Неопределено;
	АдресФайлаНаСервере = "";
	Отказ = Ложь;
	Расширение = Прав(ИмяФайла,СтрДлина(ИмяФайла)-СтрНайти(ИмяФайла,"."));
	Если ВРЕГ(Расширение) = "ZIP" Тогда   
		ИмяКаталогаРазархива = КаталогВременныхФайлов()+Строка(Новый УникальныйИдентификатор)+"\";    	
		
		Разархивировано = РаспаковатьФайл(ИмяФайла,ИмяКаталогаРазархива);
		Если Не Разархивировано Тогда
			Возврат
		КонецЕсли;
		
		Файлы = НайтиФайлы(ИмяКаталогаРазархива, "*.xls*");
		Если Файлы.Количество() = 1 Тогда
			ИмяФайла = Файлы[0].ПолноеИмя	
		Иначе
			Сообщить("Не удалось разархивировать файл или в архиве больше 1-го файла, разархивируйте вручную и запустите загрузку");
			УдалитьФайлы(ИмяКаталогаРазархива,"*.*");
			Возврат
		КонецЕсли;
	Иначе
			
	КонецЕсли;
		
	
	//Поместим файл с данными во временное хранилище на сервере
	Попытка
		ПоместитьФайл(АдресФайлаНаСервере, ИмяФайла, , Ложь, УникальныйИдентификатор);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось прочитать файл " + ИмяФайла + "! Проверьте правильность пути к файлу.", , "Объект.ИмяФайла", ,Отказ);
	КонецПопытки;
	
	Если НЕ Отказ Тогда
		
		обФайл = новый Файл(ИмяФайла);
		Если НРег(Расширение) = "json" Тогда
			СчитатьФайлСервер_json(АдресФайлаНаСервере, обФайл.ИмяБезРасширения, Строка(Объект.Брокер.УникальныйИдентификатор()));	
		Иначе	
			СчитатьФайлСервер(АдресФайлаНаСервере, обФайл.ИмяБезРасширения, Строка(Объект.Брокер.УникальныйИдентификатор()));
		КонецЕсли;
	
	КонецЕсли;
	
	Если не ИмяКаталогаРазархива = Неопределено Тогда
		УдалитьФайлы(ИмяКаталогаРазархива,"*.*");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СчитатьФайлСервер(АдресФайлаНаСервере, ИмяФайлаБезРасширения, БрокерУИД)
	
	УстановитьВидимость();
	
	Об = РеквизитФормыВЗначение("Объект");
	
	//Об.КомандаФормыСчитатьФайл(АдресФайлаНаСервере, ИмяФайлаБезРасширения);	//IMAPPS-18376
	Об.КомандаФормыСчитатьФайл(АдресФайлаНаСервере, ИмяФайлаБезРасширения, БрокерУИД);

	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры // СчитатьФайлСервер()

&НаСервере
Процедура СчитатьФайлСервер_json(АдресФайлаНаСервере, ИмяФайлаБезРасширения, БрокерУИД)
	
	УстановитьВидимость();
	
	Об = РеквизитФормыВЗначение("Объект");	
	Об.ПрочитатьФайлJSON(АдресФайлаНаСервере, ИмяФайлаБезРасширения, БрокерУИД);
	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры // СчитатьФайлСервер_json()


 // Распаковывает файл архива ZIP в указанный каталог; Извлекает все файлы архива
//
// Параметры:
//  ПолноеИмяФайлаАрхива  - Строка - имя файла архива, который необходимо распаковать
//  ПутьРаспаковкиФайлов  - Строка - путь по которому необходимо распаковать файлы
//  ПарольАрхива          - Строка - пароль для распаковки архива. По умолчанию пустая строка
// 
// Возвращаемое значение:
//  Результат - Булево - Истина, если успешно, Ложь, если нет.
//
&НаКлиенте
Функция РаспаковатьФайл( ПолноеИмяФайлаАрхива, ПутьРаспаковкиФайлов, ПарольАрхива = "") 	
	
	Результат = Истина;
	
	Попытка
		
		Архиватор = Новый ЧтениеZipФайла(ПолноеИмяФайлаАрхива, ПарольАрхива);
		
	Исключение
		Архиватор = Неопределено;
		//СообщитьОбОшибке(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		
		Архиватор.ИзвлечьВсе(ПутьРаспаковкиФайлов, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
		
	Исключение
		
		СтрокаСообщения = НСтр("ru = 'Ошибка при распаковке файлов архива: %1 в каталог: %2'");
		//СтрокаСообщения = ПодставитьПараметрыВСтроку(СтрокаСообщения, ПолноеИмяФайлаАрхива, ПутьРаспаковкиФайлов);
		Сообщить(СтрокаСообщения);
		
		Результат = Ложь;
	КонецПопытки;
	
	Архиватор.Закрыть();
	Архиватор = Неопределено;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура СверитьДанные(Команда)
	
	СверитьДанныеСервер();	
	
КонецПроцедуры

&НаСервере
Процедура СверитьДанныеСервер()
	
	//ТаблицаДанныхПоиск   = ДанныеФормыВЗначение(ТаблицаДанных, Тип("ТаблицаЗначений"));
	//ТаблицаДанныхПоиск.Свернуть("ДоговорДУ, АналитическийСчетЦБ, АналитическийСчетДС, Бумага, ВидСделки","Количество, Сумма, НКД, КомиссияБрокера, КомиссияБиржи");
	
	Отказ = Ложь;
	НомСтр = 0;
	
	Для Каждого Строчка из Объект.ТаблицаДанных3 Цикл
		
		НомСтр = НомСтр + 1;
		Если НЕ ЗначениеЗаполнено(Строчка.АналитическийСчетДС) Тогда
			Сообщить("В строке №" + НомСтр + " таблицы сверки д/с не указан аналитический счет ДС");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Строчка.ДоговорДУ) Тогда
			Сообщить("В строке №" + НомСтр + " таблицы сверки д/с не указан ДоговорДУ");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	НомСтр = 0;
	Для Каждого Строчка из ТаблицаДанных4 Цикл
		
		НомСтр = НомСтр + 1;
		Если НЕ ЗначениеЗаполнено(Строчка.АналитическийСчетЦБ) Тогда
			Сообщить("В строке №" + НомСтр + " таблицы сверки ЦБ не указан аналитический счет ЦБ");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Строчка.ДоговорДУ) Тогда
			Сообщить("В строке №" + НомСтр + " таблицы сверки ЦБ не указан ДоговорДУ");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Строчка.Бумага) Тогда
			Сообщить("В строке №" + НомСтр + " таблицы сверки ЦБ не указана ЦБ");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	//Если Отказ Тогда
	//	Сообщить("Сверка не может быть выполнена", СтатусСообщения.ОченьВажное);
	//	Возврат;
	//КонецЕсли;	
	
	Сообщить("Идет сверка данных...", СтатусСообщения.Информация);
	
	ПустойАС = Справочники.АналитическиеСчета.ПустаяСсылка();
	ПустойДУ = Справочники.ДоговорДУ.ПустаяСсылка();
	ПустаяБумага = Справочники.Активы.ПустаяСсылка();
	
	//Сверка остатков ДС 	
	НомСтр = 0;
	Для Каждого Строчка из Объект.ТаблицаДанных3 Цикл
		
		Если НомСтр = 0 Тогда
			ДатаБалланса = Строчка.Дата;
			ТаблицаОстатковДС = ОстаткиПоАналитическимСчетамБрокераДС(ДатаБалланса);
		КонецЕсли;
		
		НомСтр = НомСтр + 1;
		
		//Сверка полученных данных с базой 
		Если Строчка.АналитическийСчетДС <> ПустойАС И Строчка.ДоговорДУ <> ПустойДУ Тогда
			СтрокиДС = ТаблицаОстатковДС.НайтиСтроки (Новый Структура("АналитическийСчетДС, ДоговорДУ", Строчка.АналитическийСчетДС, Строчка.ДоговорДУ));
		Иначе
			Строчка.Результат = "Сверка не проводилась. Необходимо заполнить пустые поля.";
			Продолжить;
		КонецЕсли;
		
		Если СтрокиДС.Количество() > 0 Тогда
			
			ЗаполнитьЗначенияСвойств(Строчка, СтрокиДС[0],"СуммаНачальныйОстатокБД, СуммаОборотДтБД, СуммаОборотКтБД, СуммаКонечныйОстатокБД");
			
			Если Строчка.СуммаНачальныйОстатокБД <> Строчка.СуммаНачальныйОстаток 
				Или Строчка.СуммаОборотКтБД <> Строчка.СуммаОборотКт 
				Или Строчка.СуммаОборотДтБД <> Строчка.СуммаОборотДт
				Или Строчка.СуммаКонечныйОстатокБД <> Строчка.СуммаКонечныйОстаток
				Тогда
				Строчка.Результат = "Данные отличаются от значений БД";
			Иначе	
				Строчка.Результат = "Данные идентичны.";
			КонецЕсли;
			
		Иначе
			Строчка.Результат = "Не найдены остатки в БД.";
		КонецЕсли;
		
	КонецЦикла;	
	
	//Сверка остатков ЦБ 
	НомСтр = 0;
	Для каждого Строчка Из ТаблицаДанных4 Цикл
		
		Если НомСтр = 0 Тогда
			ДатаБалланса = Строчка.Дата;
			ТаблицаОстатковЦБ = ОстаткиЦБ(ДатаБалланса);
		КонецЕсли;
		
		НомСтр = НомСтр + 1;
		
		//Сверка полученных данных с базой
		Если Строчка.АналитическийСчетЦБ <> ПустойАС И Строчка.ДоговорДУ <> ПустойДУ И Строчка.Бумага <> ПустаяБумага Тогда
			СтрокиЦБ = ТаблицаОстатковЦБ.НайтиСтроки (Новый Структура("АналитическийСчетЦБ, ДоговорДУ, Бумага", Строчка.АналитическийСчетЦБ, Строчка.ДоговорДУ, Строчка.Бумага));
		Иначе	
			Строчка.Результат = "Сверка не проводилась. Необходимо заполнить пустые поля.";
			Продолжить;
		КонецЕсли;
		
		Если СтрокиЦБ.Количество() > 0 Тогда
			
			ЗаполнитьЗначенияСвойств(Строчка, СтрокиЦБ[0],"ПриходБД, РасходБД, АктуальныйОстатокБД");
			
			Если Строчка.АктуальныйОстатокБД <> Строчка.АктуальныйОстаток ИЛИ Строчка.ПриходБД <> Строчка.Приход  ИЛИ Строчка.РасходБД <> Строчка.Расход Тогда
				Строчка.Результат = "Данные отличаются от значений БД";
			Иначе	
				Строчка.Результат = "Данные идентичны.";
			КонецЕсли;
			
		Иначе
			Строчка.Результат = "Не найдены остатки в БД.";
		КонецЕсли;
		
	КонецЦикла;
	
	Сообщить("Сверка отчета завершена.", СтатусСообщения.Информация);
	
КонецПроцедуры // СверитьДанныеСервер()


&НаКлиенте
Процедура СоздатьОбъекты(Команда)
	СоздатьОбъектыСервер();
КонецПроцедуры

&НаСервере
Процедура СоздатьОбъектыСервер()
	
	Отказ = Ложь;
	НомСтр = 0;
	
	Для Каждого Строчка из ТаблицаДанных Цикл
		НомСтр = НомСтр + 1;
		
		Если НЕ ЗначениеЗаполнено(Строчка.Бумага) Тогда
			Сообщить("В строке №" + НомСтр + " таблицы ""Сделки"" не указана ц/б");
			Отказ = Истина;
		КонецЕсли;		
	КонецЦикла;
	
	
	Если Отказ Тогда
		Сообщить("Загрузка не может быть выполнена", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;	
	
	ТаблицаДанных.Сортировать("ДатаСделки Возр,ВремяСделки Возр, НомерСделки Возр, ВидСделки Возр");
	Объект.ТаблицаДанных2.Сортировать("Дата Возр");
	
	
	ФайлЗагрузки = Новый Файл(ИмяФайла);
	ПВХ			 = ПланыВидовХарактеристик.ВидыАктивов;
	ПС			 = ПланыСчетов.Хозрасчетный;
	//ВалютаРег	 = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	СписокДоков  = Новый СписокЗначений;
	ВестиТолькоБухгалтерскийУчет = Константы.ВестиТолькоБухгалтерскийУчет.Получить();
	
	НомСтр = 0;
	//ТаблицаЗагрузки.Очистить();
	
	Сообщить("Идет формирование списка документов...", СтатусСообщения.Информация);
	
	ВключатьРасходыВСтоимость = Истина;
	ДатаСделки = '00010101';
	Для Каждого Строчка из ТаблицаДанных Цикл
		
		НомСтр = НомСтр + 1;
		
		Попытка
			Строчка.ВремяСделки = СокрЛП(Строчка.ВремяСделки);
			ДатаДокумента 	    = Дата(Год(Строчка.ДатаСделки), Месяц(Строчка.ДатаСделки), День(Строчка.ДатаСделки), Число(Лев(Строчка.ВремяСделки,2)), Число(Сред(Строчка.ВремяСделки,4,2)), Число(Прав(Строчка.ВремяСделки,2)));
		Исключение
			ДатаДокумента = Строчка.ДатаСделки;
		КонецПопытки;
		
		//Получить таблицу сделок за день
		Если НомСтр = 1 Или Строчка.ДатаСделки <> ДатаСделки Тогда
			
			ТаблицаСозданныхДокументов = ПолучитьТаблицуСделок(ДатаДокумента);
			
			ДатаСделки = Строчка.ДатаСделки;
			
		КонецЕсли;
		
		Если ВРег(Строчка.ВидСделки) = "ПОКУПКА" ИЛИ ВРег(Строчка.ВидСделки) = "КУПЛЯ" Тогда 
			НайденныеДокументы = ТаблицаСозданныхДокументов.НайтиСтроки(Новый Структура("ТипСделки, НомерВходящегоДокумента", "Купля", Строчка.НомерСделки));
		ИначеЕсли ВРег(Строчка.ВидСделки) = "ПРОДАЖА" Тогда 
			НайденныеДокументы = ТаблицаСозданныхДокументов.НайтиСтроки(Новый Структура("ТипСделки, НомерВходящегоДокумента", "Продажа", Строчка.НомерСделки));
		КонецЕсли;
		
		ДокументСделки = Неопределено;
		
		Если ЗначениеЗаполнено(НайденныеДокументы) И НайденныеДокументы.Количество() > 0 Тогда
			ДокументСделки = НайденныеДокументы.Получить(0).Ссылка;				
		КонецЕсли;
		
		Если ДокументСделки = Неопределено Тогда
			ДокументСделки = Документы.Сделка.СоздатьДокумент();
			Создан = Истина;     
		Иначе
			ДокументСделки = ДокументСделки.ПолучитьОбъект();
			Создан = Ложь;
		КонецЕсли;		
		
		
		Если ВРег(Строчка.ВидСделки) = "ПОКУПКА" ИЛИ ВРег(Строчка.ВидСделки) = "КУПЛЯ" Тогда 
			
			ДокументСделки.СчетУчетаРасчетовСКонтрагентом = ПС.РасчетыБрокераПоСделкам;
			ДокументСделки.СчетУчетаРасчетовПоАвансам = ПС.РасчетыПоАвансамВыданным;
			ДокументСделки.ВидОперации = Перечисления.ВидыОперацийСделка.Поступление;
		ИначеЕсли ВРег(Строчка.ВидСделки) = "ПРОДАЖА" Тогда 
			
			ДокументСделки.СчетУчетаРасчетовСКонтрагентом = ПС.РасчетыБрокераПоСделкам;
			ДокументСделки.СчетУчетаРасчетовПоАвансам = ПС.РасчетыПоАвансамПолученным;
			ДокументСделки.ВидОперации = Перечисления.ВидыОперацийСделка.Продажа;
		КонецЕсли;	
		
		ДокументСделки.Дата = ДатаДокумента;
		ДоговорДУ = Строчка.ДоговорДУ;
		ДокументСделки.ДоговорДУ = ДоговорДУ;
		ДокументСделки.ВнебиржеваяСделка = Ложь;
		ДокументСделки.Контрагент = Строчка.Брокер;
		ДокументСделки.ДоговорКонтрагента = Строчка.ДоговорБрокера; 
		ДокументСделки.Биржа = Строчка.Биржа;
		ДокументСделки.КурсВзаиморасчетов = 1;
		ДокументСделки.КратностьВзаиморасчетов = 1;
		ДокументСделки.ВалютаДокумента = Строчка.Валюта;
		ДокументСделки.ВидОбращаемости = Перечисления.ВидыОбращаемостиЦБ.ОбращающиесяЦБВРублях;
		ДокументСделки.НомерВходящегоДокумента = Строчка.НомерСделки;
		ДокументСделки.БУ = Истина;
		Если ВестиТолькоБухгалтерскийУчет Тогда
			ДокументСделки.ВУ = Ложь;
			ДокументСделки.УУ = Ложь;
		Иначе
			ДокументСделки.ВУ = Истина;
			ДокументСделки.УУ = Истина;
			ДокументСделки.АналитическийСчетДС = Строчка.АналитическийСчетДС;
			ДокументСделки.АналитическийСчет = Строчка.АналитическийСчетЦБ;
			ДокументСделки.ФизическоеМестоХраненияДС =  Строчка.ФизическоеМестоХраненияДС;
		КонецЕсли;
		ДокументСделки.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
		//ДокументСделки.УправляющаяКомпания = ДоговорДУ.УправляющаяКомпания;
		
		ДокументСделки.ДопРасходы.Очистить();
		
		ДокументСделки.ПометкаУдаления = Ложь;
		
		ДокументСделки.Актив 		= Строчка.Бумага;
		ДокументСделки.Цена 		= Строчка.Цена;
		ДокументСделки.Количество 	= Строчка.Количество;
		ДокументСделки.Сумма	 	= Строчка.Сумма;
		ДокументСделки.НКД 			= Строчка.НКД;
		
		Если ЗначениеЗаполнено(ДокументСделки.Актив) И  ЗначениеЗаполнено(ДокументСделки.Актив.ВидАктива)Тогда
		
			Если ДокументСделки.Актив.ВидАктива.ПринадлежитЭлементу(ПланыВидовХарактеристик.ВидыАктивов.Облигации) Тогда
				НоминальнаяСтоимость = Справочники.Облигации.ПолучитьНоминальнуюСтоимость(ДокументСделки.Актив.Объект, ДатаДокумента);
				ДокументСделки.КотировкаОблигации = ?(НоминальнаяСтоимость=0,0,ДокументСделки.Цена/НоминальнаяСтоимость*100);
			КонецЕсли;
		
		КонецЕсли;
		
		Попытка
			ВалютаЦБ = Строчка.Бумага.Объект.ВалютаНоминальнойСтоимости;
		Исключение		
			ВалютаЦБ = Неопределено;
		КонецПопытки;
		
		Если Не ЗначениеЗаполнено(ВалютаЦБ) ИЛИ ВалютаЦБ = Строчка.ДоговорДУ.Валюта Тогда
			ВалютаЦБ = Строчка.ДоговорДУ.Валюта;
			
			ДокументСделки.ВалютаЦБ = ВалютаЦБ;
			ДокументСделки.КурсЦБ = 1;
			ДокументСделки.КратностьЦБ = 1;
			
			ДокументСделки.СуммаНКДВВалютеНоминальнойСтоимости = Строчка.НКД;
			ДокументСделки.СуммаВВалютеНоминальнойСтоимости = Строчка.Сумма;
		Иначе			
			КурсКраностьЦБ = МодульВалютногоУчета.ПолучитьКурсВалюты(ДоговорДУ.Валюта, ВалютаЦБ, ДатаДокумента);
			
			ДокументСделки.ВалютаЦБ = ВалютаЦБ;
			ДокументСделки.КурсЦБ = КурсКраностьЦБ.Курс;
			ДокументСделки.КратностьЦБ = КурсКраностьЦБ.Кратность;						
			
			ДокументСделки.СуммаНКДВВалютеНоминальнойСтоимости = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Строчка.НКД, Строчка.ДоговорДУ.Валюта, ВалютаЦБ, 1, КурсКраностьЦБ.Курс, 1, КурсКраностьЦБ.Кратность);
			ДокументСделки.СуммаВВалютеНоминальнойСтоимости = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Строчка.Сумма, Строчка.ДоговорДУ.Валюта, ВалютаЦБ, 1, КурсКраностьЦБ.Курс, 1, КурсКраностьЦБ.Кратность);
		КонецЕсли;					
		
		Если Строчка.Количество <> 0 Тогда
			ДокументСделки.НКДед = Строчка.НКД / Строчка.Количество;
		КонецЕсли;	
		Если Строчка.Бумага.ВидАктива.Родитель = ПВХ.Акции Тогда
			ДокументСделки.СчетУчетаАктива = ПС.АкцииТело;
		ИначеЕсли Строчка.Бумага.ВидАктива.Родитель = ПВХ.Облигации Тогда	
			ДокументСделки.СчетУчетаАктива = ПС.ОблигацииТело;
		КонецЕсли;	
		
		//Заполнение ТЧ Доп. расходы
		Если Строчка.КомиссияБрокера > 0 Тогда
			СтрокаДопРасходов 								= ДокументСделки.ДопРасходы.Добавить();
			СтрокаДопРасходов.СтатьяЗатрат 					= Справочники.СтатьиДоходовИРасходов.КомиссияБрокера;
			СтрокаДопРасходов.СтатьяДДС                     = Справочники.СтатьиДвиженияДенежныхСредств.КомиссияПосредника;
			СтрокаДопРасходов.СчетУчетаЗатрат 				= Справочники.СтатьиДоходовИРасходов.КомиссияБрокера.СчетУчета;
			СтрокаДопРасходов.СчетУчетаЗатратКонтрагента 	= ПС.РасчетыБрокераПоСделкам;
			СтрокаДопРасходов.Стоимость 					= Строчка.КомиссияБрокера;
			СтрокаДопРасходов.ДопСведения					= "Комиссия брокера";
			Если ДокументСделки.ВидОперации = Перечисления.ВидыОперацийСделка.Поступление Тогда
				СтрокаДопРасходов.ВключатьВСтоимость 		= Истина;
			Иначе
				Если Не ЗначениеЗаполнено(СтрокаДопРасходов.СчетУчетаЗатрат) Тогда
					СтрокаДопРасходов.СчетУчетаЗатрат 		= ПС.РасходыПоПродажам;			
				КонецЕсли;				
			КонецЕсли;	
		КонецЕсли;
		
		Если Строчка.КомиссияБиржи > 0 Тогда
			СтрокаДопРасходов 								= ДокументСделки.ДопРасходы.Добавить();
			СтрокаДопРасходов.СтатьяЗатрат 					= Справочники.СтатьиДоходовИРасходов.КомиссияБиржи;
			СтрокаДопРасходов.СтатьяДДС                     = Справочники.СтатьиДвиженияДенежныхСредств.КомиссияПосредника;
			СтрокаДопРасходов.СчетУчетаЗатрат 				= Справочники.СтатьиДоходовИРасходов.КомиссияБрокера.СчетУчета;
			Если Не ЗначениеЗаполнено(СтрокаДопРасходов.СчетУчетаЗатрат) Тогда
				СтрокаДопРасходов.СчетУчетаЗатрат = ПС.РасходыПоПродажам;			
			КонецЕсли;			
			СтрокаДопРасходов.СчетУчетаЗатратКонтрагента 	= ПС.РасчетыБрокераПоСделкам;
			СтрокаДопРасходов.Стоимость 					= Строчка.КомиссияБиржи;
			СтрокаДопРасходов.ДопСведения					= "Комиссия биржи";
			Если ДокументСделки.ВидОперации = Перечисления.ВидыОперацийСделка.Поступление Тогда
				СтрокаДопРасходов.ВключатьВСтоимость 		= Истина;
			Иначе
				Если Не ЗначениеЗаполнено(СтрокаДопРасходов.СчетУчетаЗатрат) Тогда
					СтрокаДопРасходов.СчетУчетаЗатрат 		= ПС.РасходыПоПродажам;			
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;
		
		ДокументСделки.СуммаДопРасходов 					= ДокументСделки.ДопРасходы.Итог("Стоимость");
		
		Попытка
			ДокументСделки.Записать();
			Если СписокДоков.НайтиПоЗначению(ДокументСделки.Ссылка) = Неопределено Тогда
				СписокДоков.Добавить(ДокументСделки.Ссылка);	
			КонецЕсли;	
		Исключение
			Сообщить("Не удалось записать данные строки №" + НомСтр);
		КонецПопытки;	
		
	КонецЦикла;	
	
	
	Счетчик = 0;
	
	//Проведение документов
	Для Каждого ЭлементСписка Из СписокДоков Цикл
		
		Док = ЭлементСписка.Значение;
		
		Счетчик = Счетчик + 1;	
		
		ДокОбъект = Док.ПолучитьОбъект();
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось провести документ " + Док);
		КонецПопытки;	
		
	КонецЦикла;
	
	Сообщить("Проведение документов завершено.", СтатусСообщения.Информация);
	
	СверитьДанныеСервер();
	
КонецПроцедуры // СоздатьОбъектыСервер()


&НаКлиенте
Процедура СоздатьОперации(Команда)
	
	СоздатьОперацииСервер(Строка(Объект.Брокер.УникальныйИдентификатор()))
	
КонецПроцедуры 

&НаСервере
Процедура СоздатьОперацииСервер(БрокерУИД)
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.КомандаФормыСоздатьОперацииПоБрокерскомуСчету(БрокерУИД);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанных2КупонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаДанных2.ТекущиеДанные;
	
	Если ТекущиеДанные<>Неопределено и ЗначениеЗаполнено(ТекущиеДанные.Актив) Тогда
		
		ЦБ = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекущиеДанные.Актив, "Объект");
		
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Владелец", ЦБ);
		ОткрытьФорму("Справочник.КупонныеПериоды.ФормаВыбора", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СтрокаТЧ = Элемент.ТекущиеДанные;
	Если СтрокаТЧ <> Неопределено И ЗначениеЗаполнено(СтрокаТЧ.Бумага) Тогда
		УстановитьУниверсальныеСопоставления(СтрокаТЧ.Бумага, СтрокаТЧ.ISIN, СтрокаТЧ.ДатаСделки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУниверсальныеСопоставления(Бумага, ISIN, ДатаСделки)
	
	//Актив
	КонтекстСопоставления = Перечисления.КонтекстСопоставления.ЦенныеБумаги;
	Если ЗначениеЗаполнено(Бумага) И ТипЗнч(Бумага) <> Тип("Строка") Тогда
		РегистрыСведений.УниверсальныеСопоставления.ЗаписатьПрямоеСопоставление(КонтекстСопоставления, Справочники.Биржи.ПустаяСсылка(), ISIN, Бумага, "ISIN", ДатаСделки);
		//Подстановка Бумаги в строки с таким же номером.
		Для каждого СтрокаТЧ Из ТаблицаДанных Цикл
			Если СтрокаТЧ.ISIN = ISIN Тогда
				СтрокаТЧ.Бумага = Бумага;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Набор = РегистрыСведений.УниверсальныеСопоставления.СоздатьНаборЗаписей();
		Набор.Отбор.ВнешнийОбъект.Установить(ISIN, Истина);
		Набор.Отбор.КонтекстСопоставления.Установить(КонтекстСопоставления, Истина);
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры // ()


&НаКлиенте
Процедура ТаблицаДанных2ПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	СтрокаТЧ = Элемент.ТекущиеДанные;
	Если СтрокаТЧ <> Неопределено И ЗначениеЗаполнено(СтрокаТЧ.КодЦБ) Тогда
		УстановитьУниверсальныеСопоставления2(СтрокаТЧ.КодЦБ, СтрокаТЧ.Актив, СтрокаТЧ.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУниверсальныеСопоставления2(КодЦБ, Актив, Дата)
	
	//Облигация
	КонтекстСопоставления = Перечисления.КонтекстСопоставления.ЦенныеБумаги;
	Если ЗначениеЗаполнено(Актив) И ТипЗнч(Актив) <> Тип("Строка") Тогда
		РегистрыСведений.УниверсальныеСопоставления.ЗаписатьПрямоеСопоставление(КонтекстСопоставления, Справочники.Биржи.ПустаяСсылка(), КодЦБ, Актив, "Код ЦБ на бирже", Дата);
		//Подстановка Бумаги в строки с таким же номером.
		Для каждого СтрокаТЧ Из Объект.ТаблицаДанных2 Цикл
			Если СтрокаТЧ.КодЦБ = КодЦБ Тогда
				СтрокаТЧ.Актив = Актив;                          
			КонецЕсли;
		КонецЦикла;                           
	Иначе
		Набор = РегистрыСведений.УниверсальныеСопоставления.СоздатьНаборЗаписей();
		Набор.Отбор.ВнешнийОбъект.Установить(КодЦБ, Истина);
		Набор.Отбор.КонтекстСопоставления.Установить(КонтекстСопоставления, Истина);
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры // ()

&НаКлиенте
Процедура ТаблицаДанных4ПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СтрокаТЧ = Элемент.ТекущиеДанные;
	
	УстановитьУниверсальныеСопоставления4Бумага(СтрокаТЧ.Бумага, СтрокаТЧ.НомерГосРег, СтрокаТЧ.Дата);
	УстановитьУниверсальныеСопоставления4Раздел(СтрокаТЧ.РазделАСЦБ, СтрокаТЧ.Раздел, СтрокаТЧ.Дата);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУниверсальныеСопоставления4Бумага(Бумага, НомерГосРег, Дата)
	
	//Актив
	КонтекстСопоставления = Перечисления.КонтекстСопоставления.ЦенныеБумаги;
	Если ЗначениеЗаполнено(Бумага) И ТипЗнч(Бумага) <> Тип("Строка") Тогда
		РегистрыСведений.УниверсальныеСопоставления.ЗаписатьПрямоеСопоставление(КонтекстСопоставления, Справочники.Биржи.ПустаяСсылка(), НомерГосРег, Бумага, "Код ЦБ", Дата);
		//Подстановка Бумаги в строки с таким же номером.
		Для каждого СтрокаТЧ Из ТаблицаДанных4 Цикл
			Если СтрокаТЧ.НомерГосРег = НомерГосРег Тогда
				СтрокаТЧ.Бумага = Бумага;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Набор = РегистрыСведений.УниверсальныеСопоставления.СоздатьНаборЗаписей();
		Набор.Отбор.ВнешнийОбъект.Установить(НомерГосРег, Истина);
		Набор.Отбор.КонтекстСопоставления.Установить(КонтекстСопоставления, Истина);
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры // ()

&НаСервере
Процедура УстановитьУниверсальныеСопоставления4Раздел(РазделАСЦБ, Раздел, Дата)
	
	//Актив
	КонтекстСопоставления = Перечисления.КонтекстСопоставления.РазделыБрокера;
	Если ЗначениеЗаполнено(РазделАСЦБ) И ТипЗнч(РазделАСЦБ) = Тип("СправочникСсылка.Разделы") Тогда
		РегистрыСведений.УниверсальныеСопоставления.ЗаписатьПрямоеСопоставление(КонтекстСопоставления, Объект.Брокер, Раздел, РазделАСЦБ, "Код ЦБ", Дата);
		//Подстановка Бумаги в строки с таким же номером.
		Для каждого СтрокаТЧ Из ТаблицаДанных4 Цикл
			Если СтрокаТЧ.Раздел = Раздел Тогда
				СтрокаТЧ.РазделАСЦБ = РазделАСЦБ;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Набор = РегистрыСведений.УниверсальныеСопоставления.СоздатьНаборЗаписей();
		Набор.Отбор.ВнешнийОбъект.Установить(Раздел, Истина);
		Набор.Отбор.КонтекстСопоставления.Установить(КонтекстСопоставления, Истина);
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры // ()


///////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУДРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция преобразует строку, содержащую дату, в дату
&НаСервереБезКонтекста
Функция ПреобразоватьСтрокуВДату(ДатаСтрока)
	
	ПреобразованнаяДата = '00010101';
	
	Если ЗначениеЗаполнено(ДатаСтрока) Тогда
		Если СтрДлина(ДатаСтрока) = 10 Тогда // формат даты ДД.ММ.ГГГГ
			Попытка
				ПреобразованнаяДата = Дата(Прав(ДатаСтрока, 4) + Сред(ДатаСтрока, 4, 2) + Лев(ДатаСтрока, 2));
			Исключение			
			КонецПопытки;
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат ПреобразованнаяДата;
	
КонецФункции // ПреобразоватьСтрокуВДату()

&НаСервере
функция ВернитеДату(Знач значение)
	
	Разделитель = ".";
	НашаДата = "";
	ПорогТысячелетия = 50;
	
	Если значение=Дата('00010101') Тогда
		НашаДата = Дата('00010101');
	Иначе
		Стр = СокрЛП(значение);
		
		Если ПустаяСтрока(Стр) Тогда
			Возврат Дата('00010101');
		КонецЕсли;
		длРазделителя = СтрДлина(СокрЛП(Разделитель));
		НомПоля = 1;
		Пока (ПустаяСтрока(Стр) = 0) Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз = 0 Тогда	//	не нашли
				НазваниеОдногоПоля = Стр;
				Стр = "";
			Иначе
				//	вырезаем очередное поля
				НазваниеОдногоПоля = Лев(Стр,Поз-1);
				Стр = Прав(Стр,СтрДлина(Стр)-(Поз+длРазделителя-1));
			КонецЕсли;
			
			НазваниеОдногоПоля = СокрЛП(НазваниеОдногоПоля);
			
			Если НомПоля = 1 Тогда
				ЗнДень = СокрЛП(НазваниеОдногоПоля);
				Если СтрДлина(ЗнДень)=1 Тогда
					ЗнДень=Строка("0"+ЗнДень);
				КонецЕсли;
			ИначеЕсли НомПоля = 2 Тогда
				ЗнМесяц = СокрЛП(НазваниеОдногоПоля);
				Если СтрДлина(ЗнМесяц)=1 Тогда
					ЗнМесяц=Строка("0"+ЗнМесяц);
				КонецЕсли;
			ИначеЕсли НомПоля = 3 Тогда
				ЗнГод= СокрЛП(НазваниеОдногоПоля);
				Если СтрДлина(ЗнГод)<4 Тогда
					Если СтрДлина(ЗнГод)>=2 Тогда
						Если Число(Прав(ЗнГод,2))>=ПорогТысячелетия Тогда
							ЗнГод=Строка("19"+ЗнГод);
						Иначе
							ЗнГод=Строка(Лев(Прав(Формат(ТекущаяДата(), "ДЛФ=Д"),4),4-СтрДлина(ЗнГод))+ЗнГод);
						КонецЕсли;
					Иначе
						ЗнГод=Строка(Лев(Прав(Формат(ТекущаяДата(), "ДЛФ=Д"),4),4-СтрДлина(ЗнГод))+ЗнГод);
					КонецЕсли;
				КонецЕсли;
				Если СтрДлина(ЗнГод) > 4 Тогда
					ЗнГод = Лев(ЗнГод, 4);
				КонецЕсли;
				
			КонецЕсли;
			
			НомПоля = НомПоля + 1;
			Если НомПоля > 3 Тогда
				Прервать;  // Завершить просмотр строки, т.к. обработаны все необходимые поля, но есть еще что-то.
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			НашаДата = Дата(ЗнГод, ЗнМесяц, ЗнДень);
		Исключение
			НашаДата = Дата('00010101');
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат НашаДата;
	
КонецФункции // ВернитеДату()

// Функция предназначена для синхронизации объектов
//
// Параметры:
//  ПутьКДанным - путь к данным
//  ТекЗначение  - тек значение
//
// Возвращаемое значение:
//  Булево - Истина, в случае успешного выполнения операции
//
&НаСервереБезКонтекста
Функция ПолучитьТаблицуСделок(ДатаОтчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сделка.Ссылка,
	|	ВЫБОР
	|		КОГДА Сделка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделка.Поступление)
	|			ТОГДА ""Купля""
	|		ИНАЧЕ ""Продажа""
	|	КОНЕЦ КАК ТипСделки,
	|	Сделка.НомерВходящегоДокумента
	|ИЗ
	|	Документ.Сделка КАК Сделка
	|ГДЕ
	|	НЕ Сделка.ВнебиржеваяСделка
	|	И Сделка.НомерВходящегоДокумента <> """"
	|	И Сделка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаОтчета, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОтчета, ДЕНЬ)
	|	И НЕ Сделка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДатаОтчета", ДатаОтчета);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеРегНомеровЦБ()
	
	Об = РеквизитФормыВЗначение("Объект");
	Ответ = Об.ПолучитьСоответствиеРегНомеровЦБ();
	
	Возврат Ответ;
КонецФункции // ПолучитьСоответствиеРегНомеровЦБ()

&НаСервере
Функция ПолучитьТаблицуПараметровДоговоров()
	
	Об = РеквизитФормыВЗначение("Объект");
	Ответ = Об.ПолучитьТаблицуПараметровДоговоров();
	
	Возврат Ответ;
КонецФункции // ПолучитьТаблицуПараметровДоговоров()

&НаСервере
Функция АналитическиеСчетаБрокераДС()
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.АналитическиеСчетаБрокераДС();
	
	Возврат Об.АналитическиеСчетаБрокераДС();
	
КонецФункции // АналитическиеСчетаБрокераДС()

&НаСервереБезКонтекста
Функция ОстаткиПоАналитическимСчетамБрокераДС(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.АналитическиеСчета) КАК АналитическийСчетДС,
	|	ХозрасчетныйОстаткиИОбороты.ДоговорДУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстатокБД,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК СуммаОборотКтБД,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК СуммаОборотДтБД,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстатокБД
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВУДС), , ) КАК ХозрасчетныйОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница (НачалоДня(Дата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница (КонецДня(Дата), ВидГраницы.Включая));
	
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции // ()

&НаСервереБезКонтекста
Функция ОстаткиЦБ(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.АналитическиеСчета) КАК АналитическийСчетЦБ,
	|	ХозрасчетныйОстаткиИОбороты.Субконто3 КАК Бумага,
	|	ХозрасчетныйОстаткиИОбороты.ДоговорДУ,
	|	ХозрасчетныйОстаткиИОбороты.КоличествоОборотДт КАК ПриходБД,
	|	ХозрасчетныйОстаткиИОбороты.КоличествоОборотКт КАК РасходБД,
	|	ХозрасчетныйОстаткиИОбороты.КоличествоКонечныйОстаток КАК АктуальныйОстатокБД
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВУЦБ), ,  ) КАК ХозрасчетныйОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница (НачалоДня(Дата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница (КонецДня(Дата), ВидГраницы.Включая));
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции // ()

&НаСервере
Функция ПолучитьСоответствиеКодЦБНаБирже()
	
	Об = РеквизитФормыВЗначение("Объект");
	Ответ = Об.ПолучитьСоответствиеКодЦБНаБирже();
	
	Возврат Ответ;
КонецФункции // ()

&НаСервереБезКонтекста
Функция АналитическиеСчетаБрокераЦБ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   СчетаДепо.НомерСчета,
	|   АналитическиеСчета.Ссылка КАК АналитическийСчетЦБ,
	|   АналитическиеСчета.ДоговорДУ,
	|   АналитическиеСчета.Раздел
	|ИЗ
	|   Справочник.АналитическиеСчета КАК АналитическиеСчета
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
	|       ПО АналитическиеСчета.МестоХранения = СчетаДепо.Ссылка
	|ГДЕ
	|   АналитическиеСчета.ВидАналитическогоСчета = ЗНАЧЕНИЕ(Перечисление.ВидыАналитическогоСчета.ЦенныеБумаги)
	|   И НЕ АналитическиеСчета.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции // ПолучитьАСпоСчетуДЕПО()

&НаСервере
Функция ПолучитьКупон(ДатаОтчета, Облигация, СуммаОстатокДт, ДоговорДУ, ТорговыйКод, НомерСтроки, ИмяФайла)
	
	Об = РеквизитФормыВЗначение("Объект");
	Ответ = Об.ПолучитьКупон(ДатаОтчета, Облигация, СуммаОстатокДт, ДоговорДУ, ТорговыйКод, НомерСтроки, ИмяФайла);
	
	Возврат Ответ;
КонецФункции // ПолучитьКупон()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Версия = ТекОбъект.СведенияОВнешнейОбработке().Версия;
	Заголовок = "v." + Версия;
	
	// IMAPPS-26041++
	Если Параметры.Свойство("ДополнительнаяОбработкаСсылка") Тогда
		Объект.ДополнительнаяОбработкаСсылка = Параметры.ДополнительнаяОбработкаСсылка;
	Иначе
		// Обработку открыли как внешнюю
		// Для корректной работы необходима ссылка на внедренную обработку в спр ДополнительныеОтчетыИОбработки
		// т.к. вызывается фоновое задание через доп обработки
		Объект.ДополнительнаяОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ТекОбъект.СведенияОВнешнейОбработке().Наименование);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДополнительнаяОбработкаСсылка) Тогда
		ВызватьИсключение "Ошибка при получении ссылки на обработку ""Пакетный отчет брокера ДУ""";
	КонецЕсли;
	// IMAPPS-26041--
	
	УстановитьВидимость();
	
КонецПроцедуры


&НаСервере
Функция НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа)
	
	Об = РеквизитФормыВЗначение("Объект");
	Ответ = Об.НайтиПоИсинВНазначенииПлатежа(НазначениеПлатежа);
	
	Возврат Ответ;
КонецФункции


////////////////////////////////////////

&НаСервере
Процедура УстановитьВидимость()
	
	Если Константы.ВестиТолькоБухгалтерскийУчет.Получить() Тогда
		Элементы.ТаблицаДанныхАналитическийСчетДС.Видимость = Ложь;
		Элементы.ТаблицаДанных2АналитическийСчетДС.Видимость = Ложь;
		Элементы.ТаблицаДанныхАналитическийСчетЦБ.Видимость = Ложь;
		Элементы.ТаблицаДанныхФизическоеМХ.Видимость = Истина;
		Элементы.ТаблицаДанных2ФизическоеМХ.Видимость = Истина;
	Иначе
		Элементы.ТаблицаДанныхАналитическийСчетДС.Видимость = Истина;
		Элементы.ТаблицаДанных2АналитическийСчетДС.Видимость = Истина;
		Элементы.ТаблицаДанныхАналитическийСчетЦБ.Видимость = Истина;
		Элементы.ТаблицаДанныхФизическоеМХ.Видимость = Ложь;
		Элементы.ТаблицаДанных2ФизическоеМХ.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимость()

&НаСервере
Процедура ДанныеSQLНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	
	Об.КомандаФормыСчитатьДанныеSQL(НаДату);
	
	ЗначениеВРеквизитФормы(об, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеSQL(Команда)
	
	ДанныеSQLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НачДня = НачалоДня(ТекущаяДата());
	НаДату = КалендарныеГрафики.ПолучитьПоследнийРабочийДеньПериода(,НачДня-30*24*3600, НачДня-1);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьУИД(Команда)
	Сообщить(Объект.Брокер.УникальныйИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаФОН(Команда)
	ПроверкаФОННаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверкаФОННаСервере()
	Об = РеквизитФормыВЗначение("Объект");

	  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ  
		|	ДополнительныеОтчетыИОбработки.Ссылка,
		|	ДополнительныеОтчетыИОбработки.ХранилищеНастроек КАК ХранилищеНастроек
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|ГДЕ
		|	ДополнительныеОтчетыИОбработки.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", "Пакетный отчет брокера ДУ");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ПараметрыДополнительнойОбработки",Неопределено);  
	ПараметрыОбработки.Вставить("ДополнительнаяОбработкаСсылка",Неопределено); 
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПараметрыОбработки.ПараметрыДополнительнойОбработки = ВыборкаДетальныеЗаписи.ХранилищеНастроек.Получить();
		ПараметрыОбработки.ДополнительнаяОбработкаСсылка = ВыборкаДетальныеЗаписи.Ссылка// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЕсли;
	
	
	
	Об.ВыполнитьКоманду("ФоновоеВыполнение",ПараметрыОбработки);

КонецПроцедуры

&НаСервере
Функция ПустаяСсылкаНаСервере(ОбъектСсылка)
	
	Имя = ОбъектСсылка.Метаданные().Имя;
	Если ОбъектСсылка=Справочники[Имя].ПустаяСсылка() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ПустаяСсылкаНаСервере()

&НаСервере
Процедура СоздатьУниверсальноеСопоставление(КонтекстСопоставления, КонтекстОбъекта, НашОбъект, ВнешнийОбъект)
	
	Попытка
		Если НашОбъект<>Неопределено Тогда		
			//Удалить старые записи
			Набор = РегистрыСведений.УниверсальныеСопоставления.СоздатьНаборЗаписей();
			Набор.Отбор.КонтекстСопоставления.Установить(Перечисления.КонтекстСопоставления[КонтекстСопоставления]);
			Если ВнешнийОбъект="" Тогда 
				// Режим торгов
				Набор.Отбор.НашОбъект.Установить(НашОбъект);
			Иначе	
				// FX_ПИФ / FX_ТорговыйКод
				Набор.Отбор.ВнешнийОбъект.Установить(ВнешнийОбъект);
				Набор.Отбор.КонтекстОбъекта.Установить(КонтекстОбъекта);
			КонецЕсли;
			Набор.Записать(Истина);
			
			Запись = РегистрыСведений.УниверсальныеСопоставления.СоздатьМенеджерЗаписи();
			Запись.КонтекстСопоставления 	= Перечисления.КонтекстСопоставления[КонтекстСопоставления];
			Запись.КонтекстОбъекта 			= КонтекстОбъекта;
			Запись.НашОбъект 				= НашОбъект;
			Запись.ВнешнийОбъект 			= ВнешнийОбъект;
			Запись.Записать(Истина);
		КонецЕсли;
	Исключение
		Сообщить("Ошибка создания универсального сопоставления: " + ОписаниеОшибки());
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанных10ДоговорДУПриИзменении(Элемент)
	ДоговорДУ = Элементы.ТаблицаДанных10.ТекущиеДанные.ДоговорДУ;
	Если Не ПустаяСсылкаНаСервере(ДоговорДУ) Тогда
		СоздатьУниверсальноеСопоставление("ДоговорДУ",, ДоговорДУ, Элементы.ТаблицаДанных10.ТекущиеДанные.ТорговыйКодФайл);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанных10АктивПриИзменении(Элемент)
	Актив = Элементы.ТаблицаДанных10.ТекущиеДанные.Актив;
	Если Не ПустаяСсылкаНаСервере(Актив) Тогда
		СоздатьУниверсальноеСопоставление("ЦенныеБумаги",, Актив, Элементы.ТаблицаДанных10.ТекущиеДанные.АктивФайл);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанных10АналитическийСчетДСПриИзменении(Элемент)
	АналитическийСчетДС = Элементы.ТаблицаДанных10.ТекущиеДанные.АналитическийСчетДС;
	Если Не ПустаяСсылкаНаСервере(АналитическийСчетДС) Тогда
		СоздатьУниверсальноеСопоставление("Биржа",, АналитическийСчетДС, Элементы.ТаблицаДанных10.ТекущиеДанные.ТорговыйКодФайл);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьКлирингОткрытыхПозицийНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.КлирингОткрытыхПозицийСоздатьДокумент();
	ЗначениеВРеквизитФормы(Об, "Объект");

КонецПроцедуры // СоздатьКлирингОткрытыхПозицийНаСервере()

&НаКлиенте
Процедура СоздатьКлирингОткрытыхПозиций(Команда)
	СоздатьКлирингОткрытыхПозицийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанных2Удалить(Команда)
	
	МассивУдаления = Новый Массив;
	Для каждого Строка Из Объект.ТаблицаДанных2 Цикл
		Если Команда.Имя = "ТаблицаДанных2УдалитьЗеленые" И НЕ Строка.Документ = ПредопределенноеЗначение("Документ.ОперацияПоСчетуБрокера.ПустаяСсылка") Тогда
			МассивУдаления.Добавить(Строка);
		ИначеЕсли НЕ Команда.Имя = "ТаблицаДанных2УдалитьЗеленые" И Строка.Документ = ПредопределенноеЗначение("Документ.ОперацияПоСчетуБрокера.ПустаяСсылка") Тогда
			МассивУдаления.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строка Из МассивУдаления Цикл
		Объект.ТаблицаДанных2.Удалить(Объект.ТаблицаДанных2.Индекс(Строка));
	КонецЦикла;
КонецПроцедуры




