
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КопироватьДанныеФормы(Параметры.Данные, Объект);
	Обработка = РеквизитФормыВЗначение("Объект");
	Результат = Обработка.РезультатКонтроля();
	Сообщение = Обработка.ТекстСообщенияКонтроля(Результат);
КонецПроцедуры

&НаСервере
Процедура ОтправитьУведомлениеНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ОтправитьУведомлениеОНеПринятыхИНеСнятыхЦБсОбслуживания(Сообщение);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУведомление(Команда)
	ОтправитьУведомлениеНаСервере();
КонецПроцедуры
