// Описание: Единая таблица по табличным частям документа НачислениеНДФЛПоУправляющейКомпании за день.
// Параметры:
// &НачалоДня - Дата
// &КонецДня - Дата
// &ПОВсемКлиентам - Булево
// &Клиенты - Массив/СписокЗначений (СправочникСсылка.Контрагенты)
//
// Как задать период за 1 день:
// 1) Через дату:
//    &НачалоДня = НачалоДня(&ДатаСреза)
//    &КонецДня = КонецДня(&ДатаСреза)
//
// 2) Пример на фиксированную дату:
//    &НачалоДня = НачалоДня('2026-04-30')
//    &КонецДня = КонецДня('2026-04-30')
//
// Примеры:
// 1) По всем клиентам:
//    &ПОВсемКлиентам = Истина
//    &Клиенты = Неопределено
//
// 2) По списку клиентов:
//    &ПОВсемКлиентам = Ложь
//    &Клиенты = <Массив или СписокЗначений ссылок на Контрагенты>

ВЫБРАТЬ
    "НачислениеНДФЛПоУправляющейКомпании" КАК ВидДокумента,
    "Выводы" КАК ТабличнаяЧасть,
    ТЧ.Ссылка КАК Ссылка,
    ТЧ.Ссылка.Дата КАК ДатаДокумента,
    ТЧ.Ссылка.Номер КАК НомерДокумента,
    ТЧ.Портфель КАК Портфель,
    ТЧ.СуммаВывода КАК СуммаВывода,
    NULL КАК РаспределятьОбщиеРасходы,
    NULL КАК Закрытие,
    NULL КАК КодВычета,
    NULL КАК КодДохода,
    NULL КАК НалогооблагаемаяCумма,
    NULL КАК Ставка,
    NULL КАК ТипДохода,
    NULL КАК СуммаВычета,
    NULL КАК СуммаДохода,
    NULL КАК СуммаКЗачету,
    NULL КАК СуммаКУдержанию,
    NULL КАК СуммаРанееУдержанногоНДФЛ,
    NULL КАК ФинансовыйРезультат,
    NULL КАК ИзменениеФинРезультата,
    NULL КАК Пропорция,
    NULL КАК Система,
    NULL КАК Сумма
ИЗ
    Документ.НачислениеНДФЛПоУправляющейКомпании.Выводы КАК ТЧ
ГДЕ
    ТЧ.Ссылка.Дата МЕЖДУ &НачалоДня И &КонецДня
    И ТЧ.Ссылка.Проведен
    И (&ПОВсемКлиентам ИЛИ ТЧ.Ссылка.Клиент В (&Клиенты))

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
    "НачислениеНДФЛПоУправляющейКомпании",
    "ОбщиеРасходы",
    ТЧ.Ссылка,
    ТЧ.Ссылка.Дата,
    ТЧ.Ссылка.Номер,
    ТЧ.Портфель,
    NULL,
    ТЧ.РаспределятьОбщиеРасходы,
    ТЧ.Закрытие,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL
ИЗ
    Документ.НачислениеНДФЛПоУправляющейКомпании.ОбщиеРасходы КАК ТЧ
ГДЕ
    ТЧ.Ссылка.Дата МЕЖДУ &НачалоДня И &КонецДня
    И ТЧ.Ссылка.Проведен
    И (&ПОВсемКлиентам ИЛИ ТЧ.Ссылка.Клиент В (&Клиенты))

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
    "НачислениеНДФЛПоУправляющейКомпании",
    "Начисления",
    ТЧ.Ссылка,
    ТЧ.Ссылка.Дата,
    ТЧ.Ссылка.Номер,
    NULL,
    NULL,
    NULL,
    NULL,
    ТЧ.КодВычета,
    ТЧ.КодДохода,
    ТЧ.НалогооблагаемаяCумма,
    ТЧ.Ставка,
    ТЧ.ТипДохода,
    ТЧ.СуммаВычета,
    ТЧ.СуммаДохода,
    ТЧ.СуммаКЗачету,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL
ИЗ
    Документ.НачислениеНДФЛПоУправляющейКомпании.Начисления КАК ТЧ
ГДЕ
    ТЧ.Ссылка.Дата МЕЖДУ &НачалоДня И &КонецДня
    И ТЧ.Ссылка.Проведен
    И (&ПОВсемКлиентам ИЛИ ТЧ.Ссылка.Клиент В (&Клиенты))

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
    "НачислениеНДФЛПоУправляющейКомпании",
    "ИнвестиционныйВычетПоПортфелям",
    ТЧ.Ссылка,
    ТЧ.Ссылка.Дата,
    ТЧ.Ссылка.Номер,
    ТЧ.Портфель,
    NULL,
    NULL,
    NULL,
    ТЧ.КодВычета,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    ТЧ.Сумма
ИЗ
    Документ.НачислениеНДФЛПоУправляющейКомпании.ИнвестиционныйВычетПоПортфелям КАК ТЧ
ГДЕ
    ТЧ.Ссылка.Дата МЕЖДУ &НачалоДня И &КонецДня
    И ТЧ.Ссылка.Проведен
    И (&ПОВсемКлиентам ИЛИ ТЧ.Ссылка.Клиент В (&Клиенты))

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
    "НачислениеНДФЛПоУправляющейКомпании",
    "Удержания",
    ТЧ.Ссылка,
    ТЧ.Ссылка.Дата,
    ТЧ.Ссылка.Номер,
    ТЧ.Портфель,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    ТЧ.НалогооблагаемаяCумма,
    ТЧ.Ставка,
    ТЧ.ТипДохода,
    NULL,
    ТЧ.СуммаДохода,
    NULL,
    ТЧ.СуммаКУдержанию,
    ТЧ.СуммаРанееУдержанногоНДФЛ,
    ТЧ.ФинансовыйРезультат,
    ТЧ.ИзменениеФинРезультата,
    ТЧ.Пропорция,
    ТЧ.Система,
    NULL
ИЗ
    Документ.НачислениеНДФЛПоУправляющейКомпании.Удержания КАК ТЧ
ГДЕ
    ТЧ.Ссылка.Дата МЕЖДУ &НачалоДня И &КонецДня
    И ТЧ.Ссылка.Проведен
    И (&ПОВсемКлиентам ИЛИ ТЧ.Ссылка.Клиент В (&Клиенты))

УПОРЯДОЧИТЬ ПО
    ВидДокумента,
    ТабличнаяЧасть,
    Ссылка,
    ДатаДокумента,
    НомерДокумента,
    Портфель,
    СуммаВывода,
    РаспределятьОбщиеРасходы,
    Закрытие,
    КодВычета,
    КодДохода,
    НалогооблагаемаяCумма,
    Ставка,
    ТипДохода,
    СуммаВычета,
    СуммаДохода,
    СуммаКЗачету,
    СуммаКУдержанию,
    СуммаРанееУдержанногоНДФЛ,
    ФинансовыйРезультат,
    ИзменениеФинРезультата,
    Пропорция,
    Система,
    Сумма
;
