// Описание: Единая таблица по табличным частям документа НачислениеНДФЛПоПортфелю за день.
// Параметры:
// &НачалоДня - Дата
// &КонецДня - Дата
// &ПОВсемКлиентам - Булево
// &Клиенты - Массив/СписокЗначений (СправочникСсылка.Контрагенты)
//
// Как задать период за 1 день:
// 1) Через дату:
//    &НачалоДня = НачалоДня(&ДатаСреза)
//    &КонецДня = КонецДня(&ДатаСреза)
//
// 2) Пример на фиксированную дату:
//    &НачалоДня = НачалоДня('2026-04-30')
//    &КонецДня = КонецДня('2026-04-30')
//
// Примеры:
// 1) По всем клиентам:
//    &ПОВсемКлиентам = Истина
//    &Клиенты = Неопределено
//
// 2) По списку клиентов:
//    &ПОВсемКлиентам = Ложь
//    &Клиенты = <Массив или СписокЗначений ссылок на Контрагенты>

ВЫБРАТЬ
    "НачислениеНДФЛПоПортфелю" КАК ВидДокумента,
    "Начисления" КАК ТабличнаяЧасть,
    ТЧ.Ссылка КАК Ссылка,
    ТЧ.Ссылка.Дата КАК ДатаДокумента,
    ТЧ.Ссылка.Номер КАК НомерДокумента,
    NULL КАК ВидРасхода,
    ТЧ.КодДохода КАК КодДохода,
    ТЧ.КодВычета КАК КодВычета,
    ТЧ.НалогооблагаемаяCумма КАК НалогооблагаемаяCумма,
    ТЧ.Ставка КАК Ставка,
    ТЧ.ТипДохода КАК ТипДохода,
    ТЧ.СуммаВычета КАК СуммаВычета,
    ТЧ.СуммаДохода КАК СуммаДохода,
    NULL КАК СуммаРанееУдержанногоНДФЛ,
    NULL КАК СуммаКУдержанию,
    NULL КАК СуммаИсчисленногоНалога,
    NULL КАК УплаченныйНДФЛ,
    NULL КАК Сумма
ИЗ
    Документ.НачислениеНДФЛПоПортфелю.Начисления КАК ТЧ
ГДЕ
    ТЧ.Ссылка.Дата МЕЖДУ &НачалоДня И &КонецДня
    И ТЧ.Ссылка.Проведен
    И (&ПОВсемКлиентам ИЛИ ТЧ.Ссылка.Портфель.Клиент В (&Клиенты))

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
    "НачислениеНДФЛПоПортфелю",
    "Удержания",
    ТЧ.Ссылка,
    ТЧ.Ссылка.Дата,
    ТЧ.Ссылка.Номер,
    NULL,
    NULL,
    NULL,
    NULL,
    ТЧ.Ставка,
    ТЧ.ТипДохода,
    NULL,
    ТЧ.СуммаДохода,
    ТЧ.СуммаРанееУдержанногоНДФЛ,
    ТЧ.СуммаКУдержанию,
    ТЧ.СуммаИсчисленногоНалога,
    ТЧ.УплаченныйНДФЛ,
    NULL
ИЗ
    Документ.НачислениеНДФЛПоПортфелю.Удержания КАК ТЧ
ГДЕ
    ТЧ.Ссылка.Дата МЕЖДУ &НачалоДня И &КонецДня
    И ТЧ.Ссылка.Проведен
    И (&ПОВсемКлиентам ИЛИ ТЧ.Ссылка.Портфель.Клиент В (&Клиенты))

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
    "НачислениеНДФЛПоПортфелю",
    "ОбщиеРасходы",
    ТЧ.Ссылка,
    ТЧ.Ссылка.Дата,
    ТЧ.Ссылка.Номер,
    ТЧ.ВидРасхода,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    ТЧ.Сумма
ИЗ
    Документ.НачислениеНДФЛПоПортфелю.ОбщиеРасходы КАК ТЧ
ГДЕ
    ТЧ.Ссылка.Дата МЕЖДУ &НачалоДня И &КонецДня
    И ТЧ.Ссылка.Проведен
    И (&ПОВсемКлиентам ИЛИ ТЧ.Ссылка.Портфель.Клиент В (&Клиенты))

УПОРЯДОЧИТЬ ПО
    ВидДокумента,
    ТабличнаяЧасть,
    Ссылка,
    ДатаДокумента,
    НомерДокумента,
    ВидРасхода,
    КодДохода,
    КодВычета,
    НалогооблагаемаяCумма,
    Ставка,
    ТипДохода,
    СуммаВычета,
    СуммаДохода,
    СуммаРанееУдержанногоНДФЛ,
    СуммаКУдержанию,
    СуммаИсчисленногоНалога,
    УплаченныйНДФЛ,
    Сумма
;
