
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("КлассификаторНДЦ", Справочники.КлассификаторыЗагрузки.НДЦ());
	ОбщегоНазначения.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	ОбщегоНазначения.СписокПередЗагрузкойПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнкетаВыпускаЦБ(Команда)
	Если Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда
		Форма	= ПолучитьФорму("Отчет.АнкетаВыпускаЦБ.Форма.ФормаОтчета");
		Форма.Отчет.ВыводитьПечать		= Истина;
		Форма.Отчет.ОтчетПоСписку		= Истина;
		Форма.Отчет.Автоформирование	= Истина; // BSLLS:Typo-off
		Для Каждого Элемент Из Элементы.Список.ВыделенныеСтроки Цикл
			Если Не ЭлементЭтоГруппа(Элемент) Тогда
				Форма.Отчет.ЦенныеБумаги.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
		Если Форма.Отчет.ЦенныеБумаги.Количество() > 0 Тогда
			Форма.Открыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКатегорияЦБ(Команда)
	ЦБ = Новый Структура("ЦеннаяБумага", Элементы.Список.ТекущаяСтрока);
	Парам = Новый Структура("Отбор", ЦБ);
	ОткрытьФорму("РегистрСведений.КатегорияЦБ.ФормаСписка", Парам);
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКодыЗагрузки(Команда)
	ЦБ = Новый Структура("Владелец", Элементы.Список.ТекущаяСтрока);
	Парам = Новый Структура("Отбор", ЦБ);
	ОткрытьФорму("Справочник.КодыЗагрузки.ФормаСписка", Парам);
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКотировкиЦенныхБумаг(Команда)
	ЦБ = Новый Структура("ЦеннаяБумага", Элементы.Список.ТекущаяСтрока);
	Парам = Новый Структура("Отбор", ЦБ);
	ОткрытьФорму("РегистрСведений.Котировки.ФормаСписка", Парам);
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНоминалЦБ(Команда)
	ЦБ = Новый Структура("ЦеннаяБумага", Элементы.Список.ТекущаяСтрока);
	Парам = Новый Структура("Отбор", ЦБ);
	ОткрытьФорму("РегистрСведений.НоминалЦБ.ФормаСписка", Парам);
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНКД(Команда)
	ЦБ = Новый Структура("ЦеннаяБумага", Элементы.Список.ТекущаяСтрока);
	Парам = Новый Структура("Отбор", ЦБ);
	ОткрытьФорму("РегистрСведений.НКД.ФормаСписка", Парам);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДанныеRuData(Команда)
	
	ISINs = Новый Массив;
	Если Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда
		Для Каждого Элемент Из Элементы.Список.ВыделенныеСтроки Цикл
			Если Не ЭлементЭтоГруппа(Элемент) Тогда
				ISIN = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент, "ISIN");
				Если ЗначениеЗаполнено(ISIN) Тогда
					ISINs.Добавить(ISIN);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ISINs) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан ISIN");
		Возврат;
	КонецЕсли;
	ТабличныйДокумент = ИнтерфаксОтчетОЦеннойБумагеНаСервере(ISINs);
	Если ТабличныйДокумент = Неопределено Тогда
		ПредупреждениеАсинх("Нет актуальных данных или произошла ошибка.", 10);
	Иначе
		ИнтерфаксИмяОтчета = НазваниеОтчетаОЦеннойБумагеНаСервере(ISINs);
		ТабличныйДокумент.Показать(ИнтерфаксИмяОтчета, ИнтерфаксИмяОтчета);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЭлементЭтоГруппа(Элемент)
	Возврат Элемент.ЭтоГруппа;
КонецФункции

&НаСервереБезКонтекста
Функция ИнтерфаксОтчетОЦеннойБумагеНаСервере(ISIN)
	Возврат Справочники.ЦенныеБумаги.ИнтерфаксОтчетОЦеннойБумаге(ISIN);
КонецФункции

&НаСервереБезКонтекста
Функция НазваниеОтчетаОЦеннойБумагеНаСервере(ISINs)
	
	ДопустимоеКоличествоЦенныхБумагВЗаголовке = 3;
	Если ISINs.Количество() > ДопустимоеКоличествоЦенныхБумагВЗаголовке Тогда
		КЗаголовку = Новый Массив;
		Для Индекс = 0 По ДопустимоеКоличествоЦенныхБумагВЗаголовке - 1 Цикл
			КЗаголовку.Добавить(ISINs[Индекс]);
		КонецЦикла;
		КоличествоБумаг = " [" + Формат(ISINs.Количество(), "ЧГ=0") + " шт.]";
		ПодвалЗаголовка = " и т.д.";
	Иначе
		КЗаголовку = ISINs;
		КоличествоБумаг = "";
		ПодвалЗаголовка = "";
	КонецЕсли;
	
	ШаблонНазвания = "RuData Отчет о ценных бумагах%1 с ISIN %2%3";
	Название = СтрШаблон(ШаблонНазвания, КоличествоБумаг, СтрСоединить(КЗаголовку , ","), ПодвалЗаголовка);
	
	Возврат Название;
	
КонецФункции

#КонецОбласти
