
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.ДатаНач = НачалоКвартала(ТекущаяДата());
	Отчет.ДатаКон = КонецКвартала(ТекущаяДата());

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВосстановитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЗавершениеРаботы Тогда
		Возврат;		
	КонецЕсли; 
	
	СохранитьНастройки();
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборПериода(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период.ДатаНачала = Отчет.ДатаНач;
	Диалог.Период.ДатаОкончания = Отчет.ДатаКон;
	Если Диалог.Редактировать() Тогда
		Отчет.ДатаНач = Диалог.Период.ДатаНачала;
		Отчет.ДатаКон = Диалог.Период.ДатаОкончания;		
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;		
	КонецЕсли; 
	
	СкомпоноватьРезультат();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокПоказатьУбрать(Команда)
	
	Элементы.ЗаголовокПоказатьУбрать.Пометка = Не Элементы.ЗаголовокПоказатьУбрать.Пометка;
	Результат.Область(1,,20).Видимость = Элементы.ЗаголовокПоказатьУбрать.Пометка;
	
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

Процедура СохранитьНастройки()
	
	ХранилищеОбщихНастроек.Сохранить("Отчет.ЖурналОперацийПоСчетуДепо"
		, "НастройкиКомпоновщика"
		, Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры
 
Процедура ВосстановитьНастройки()
	
	Настройки = ХранилищеОбщихНастроек.Загрузить("Отчет.ЖурналОперацийПоСчетуДепо"
		, "НастройкиКомпоновщика");
		
	ТекущиеНастройки = Отчет.КомпоновщикНастроек.Настройки;
	
	// установка пользовательских настроек
	ТекущиеНастройки.Отбор.ИдентификаторПользовательскойНастройки = "Отбор";
	ТекущиеНастройки.Порядок.ИдентификаторПользовательскойНастройки = "Порядок";
	ТекущиеНастройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "УсловноеОформление";
	
	Если Настройки <> Неопределено Тогда
		НастройкиКомпоновщика =  Отчет.КомпоновщикНастроек.ПолучитьНастройки();
		КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(НастройкиКомпоновщика.Отбор
			, Настройки.Отбор);					
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновщика);			
	КонецЕсли; 
	
	// очистка пользовательских настроек
	ТекущиеНастройки = Отчет.КомпоновщикНастроек.Настройки;
	ТекущиеНастройки.Отбор.ИдентификаторПользовательскойНастройки = "";
	ТекущиеНастройки.Порядок.ИдентификаторПользовательскойНастройки = "";
	ТекущиеНастройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "";
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
КонецПроцедуры

//#КонецОбласти

&НаКлиенте
Процедура ОтборыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
	ПараметрыФормы.Вставить("Режим", "Отбор");
	ПараметрыФормы.Вставить("ИсключенныеПоля", Новый Массив);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Неопределено);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОтборыПередНачаломДобавленияЗавершение", ЭтаФорма, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораДоступногоПоля", ПараметрыФормы,,,,, ОповещениеОЗакрытии);
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПередНачаломДобавленияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда 
		
		Если Элемент.ТекущаяСтрока = Неопределено Тогда 
			ТекущаяСтрока = Неопределено;
		Иначе 
			ТекущаяСтрока = Отчет.КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(Элемент.ТекущаяСтрока);
		КонецЕсли;
		
		Если ТипЗнч(ТекущаяСтрока) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда 
			ЭлементОтбора = ТекущаяСтрока.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ИначеЕсли ТипЗнч(ТекущаяСтрока) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда 
			Если ТекущаяСтрока.Родитель <> Неопределено Тогда 
				ЭлементОтбора = ТекущаяСтрока.Родитель.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Иначе 
				ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			КонецЕсли;
		Иначе 
			ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		КонецЕсли;
		
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПараметрыВыбранногоПоля.Поле);
		ЭлементОтбора.ВидСравнения = ПараметрыВыбранногоПоля.ВидСравнения;
		
		Элемент.ТекущаяСтрока = Отчет.КомпоновщикНастроек.Настройки.Отбор.ПолучитьИдентификаторПоОбъекту(ЭлементОтбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПередНачаломИзменения(Элемент, Отказ)
	
	Если (Найти(Элемент.ТекущийЭлемент.Имя, "ОтборыЛевоеЗначение") > 0 И ТипЗнч(Элемент.ТекущиеДанные.ЛевоеЗначение) = Тип("ПолеКомпоновкиДанных")) Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
		ПараметрыФормы.Вставить("Режим", "Отбор");
		ПараметрыФормы.Вставить("ИсключенныеПоля", Новый Массив);
		ПараметрыФормы.Вставить("ТекущаяСтрока", Элемент.ТекущиеДанные.ЛевоеЗначение);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Элемент", Элемент);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОтборыПередНачаломИзмененияЗавершение", ЭтаФорма, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.ФормаВыбораДоступногоПоля", ПараметрыФормы,,,,, ОповещениеОЗакрытии);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПередНачаломИзмененияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда 
		
		ТекущаяСтрока = Отчет.КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(Элемент.ТекущаяСтрока);
				
		Если Найти(Элемент.ТекущийЭлемент.Имя, "ОтборыЛевоеЗначение") > 0 Тогда 
			ТекущаяСтрока.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПараметрыВыбранногоПоля.Поле);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПорядокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
	ПараметрыФормы.Вставить("Режим", "Порядок");
	ПараметрыФормы.Вставить("ИсключенныеПоля", Новый Массив);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Неопределено);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПорядокПередНачаломДобавленияЗавершение", ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораДоступногоПоля", ПараметрыФормы,,,,, ОповещениеОЗакрытии);
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокПередНачаломДобавленияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда 
		
		НоваяСтрока = Отчет.КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		НоваяСтрока.Использование = Истина;
		НоваяСтрока.Поле = Новый ПолеКомпоновкиДанных(ПараметрыВыбранногоПоля.Поле);
		НоваяСтрока.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокПередНачаломИзменения(Элемент, Отказ)
	
	Если Найти(Элемент.ТекущийЭлемент.Имя, "СортировкаПоле") = 1 Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
		ПараметрыФормы.Вставить("Режим", "Порядок");
		ПараметрыФормы.Вставить("ИсключенныеПоля", Новый Массив);
		ПараметрыФормы.Вставить("ТекущаяСтрока", Элемент.ТекущиеДанные.Поле);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Элемент", Элемент);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПорядокПередНачаломИзмененияЗавершение", ЭтаФорма, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.ФормаВыбораДоступногоПоля", ПараметрыФормы,,,,, ОповещениеОЗакрытии);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокПередНачаломИзмененияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда 
		
		РедактируемаяСтрока = Отчет.КомпоновщикНастроек.Настройки.Порядок.ПолучитьОбъектПоИдентификатору(Элемент.ТекущаяСтрока);
		
		РедактируемаяСтрока.Использование = Истина;
		РедактируемаяСтрока.Поле = Новый ПолеКомпоновкиДанных(ПараметрыВыбранногоПоля.Поле);
		
	КонецЕсли;

КонецПроцедуры
