
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отчет.ДатаНачала = НачалоГода(ТекущаяДата());
	Отчет.ДатаОкончания = КонецГода(ТекущаяДата());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение или ТолстыйКлиентУправляемоеПриложение Тогда
		НастройкаПериода = Новый НастройкаПериода;
		НастройкаПериода.УстановитьПериод(Отчет.ДатаНачала, ?(Отчет.ДатаОкончания=Дата("00010101"), Отчет.ДатаОкончания, КонецДня(Отчет.ДатаОкончания)));
		НастройкаПериода.РедактироватьКакПериод = Истина;
		НастройкаПериода.ВариантНастройки 		= ВариантНастройкиПериода.Период;
		
		Если НастройкаПериода.Редактировать() Тогда
			Отчет.ДатаНачала = НастройкаПериода.ПолучитьДатуНачала();
			Отчет.ДатаОкончания = НастройкаПериода.ПолучитьДатуОкончания();
		КонецЕсли;
	#Иначе
		Диалог	= Новый ДиалогРедактированияСтандартногоПериода();		
		Диалог.Период.ДатаНачала	= Отчет.ДатаНачала;
		Диалог.Период.ДатаОкончания	= ?(Отчет.ДатаНачала=Дата('0001-01-01'), Отчет.ДатаНачала, КонецДня(Отчет.ДатаОкончания));
		Диалог.Период.Вариант		= ВариантСтандартногоПериода.ПроизвольныйПериод;
		
		Если Диалог.Редактировать() Тогда
			Отчет.ДатаНачала	= Диалог.Период.ДатаНачала;
			Отчет.ДатаОкончания	= Диалог.Период.ДатаОкончания;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьУбратьОтборы(Команда)
	Элементы.КомпоновщикНастроекНастройкиОтбор.Видимость = Не Элементы.КомпоновщикНастроекНастройкиОтбор.Видимость;
	Элементы.ФормаПоказатьУбратьОтборы.Пометка = Элементы.КомпоновщикНастроекНастройкиОтбор.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьExcel(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Сохранение отчёта";
	Диалог.Фильтр = "Книга Excel (*.xlsx)|*.xlsx";
	Диалог.Расширение = "xlsx";
	Если Диалог.Выбрать() Тогда
		Результат.Записать(Диалог.ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
