
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиЗаполнениеОбъекта();
	ПараметрыРегистрации.Версия = "1.02";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.ВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	ПараметрыРегистрации.Наименование =  "Выгрузка отчетности XBRL-CSV для PB";	
	ПараметрыРегистрации.Назначение.Добавить("Документ.РО_XBRL6_1_ОтчетПоВнутреннемуУчету_577П");
	
	// Вызов клиенсткого метода
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = "Выгрузить CSV";
	Команда.Идентификатор = "ВыгрузитьCSV";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();
	
	Возврат ПараметрыРегистрации;
	
КонецФункции
