
#Область СлужебныйПрограммныйИнтерфейс

// Отправляет письмо на специальный адрес.
//
// Параметры:
//
//	Настройка - СправочникаСсылка.НастройкиОбменаДанными
//
//  ТекстСообщения - Строка - текст смс-сообщения.
// 
Процедура ОтправитьСМСУведомление(Настройка, ТекстСообщения) Экспорт
	
	Если Не ЗначениеЗаполнено(Настройка) Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяЗаписьДляОтправки = Справочники.НастройкиОбменаДанными.АктуальнаяУчетнаяЗаписьПриемаОтправкиСообщений(Настройка);
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗаписьДляОтправки);
	
	Почта = Новый ИнтернетПочта;
	Почта.Подключиться(Профиль);
	
	НомераТелефонов = Настройка.ПолучателиСписком.ВыгрузитьКолонку("Получатель");
	
	Для каждого НомерТелефона Из НомераТелефонов Цикл
	
		ТекстПисьма = 
		"login: " + Настройка.ЛогинСМСШлюза + "
		| 
		|password: " + Настройка.ПарольСМСШлюза + "
		| 
		|phones: " + НомерТелефона + "
		| 
		|message: " + Лев(ТекстСообщения, 160) + "
		| 
		|originator: BC_PLATFORM";
	
		Сообщение = Новый ИнтернетПочтовоеСообщение;
		Сообщение.Тема = "subject1";
		Сообщение.Получатели.Добавить(Настройка.АдресСМСШлюза);
		Сообщение.Тексты.Добавить(ТекстПисьма);
		
		Почта.Послать(Сообщение, ОбработкаТекстаИнтернетПочтовогоСообщения.НеОбрабатывать);
		
	КонецЦикла;
	
	Почта.Отключиться();
	
КонецПроцедуры

#КонецОбласти