
#Область ОписаниеПеременных

&НаКлиенте
Перем ИнтервалОжидания;
&НаКлиенте
Перем ФормаЗакрывается;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ВывестиИндикациюПоФоновым();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.ВыводитьОкноОжидания Тогда
		ИнтервалОжидания = ?(Параметры.Интервал <> 0, Параметры.Интервал, 1);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗаданий", ИнтервалОжидания, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОтменитьЗадания = Ложь;
	
	Для каждого ТекСтрока Из ТаблицаЗаданий Цикл
		Если ТекСтрока.Статус = "Выполняется" Тогда
			ОтменитьЗадания = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ОтменитьЗадания = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	Если ОтменитьЗадания = Истина Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗаданий", 0.1, Истина);
		Параметры.ОтменитьЗадания = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОтменитьЗадания = Ложь;
	
	МассивЗаданий = Новый Массив;
	Для каждого ТекСтрока Из ТаблицаЗаданий Цикл
		МассивЗаданий.Добавить(ТекСтрока);
		Если ТекСтрока.Статус = "Выполняется" Тогда
			ОтменитьЗадания = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ОтменитьЗадания = Истина Тогда
		ОтменитьВыполнениеЗаданий();
		Параметры.ОтменитьЗадания = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗаданий()
	
	Для каждого ТекЗадание Из ТаблицаЗаданий Цикл
		
		Задание = ПроверитьЗаданиеВыполнено(ФормаЗакрывается, ТекЗадание.ИдентификаторЗадания, ТекЗадание.КлючЗадания);
		Если Задание = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТекЗадание.Статус = Задание.Статус;
		Если Задание.Свойство("Результат") Тогда
			ТекЗадание.Результат = Задание.Результат;
		КонецЕсли;
		ТекЗадание.КраткоеПредставлениеОшибки = Задание.КраткоеПредставлениеОшибки;
		
		Если Задание.Прогресс <> Неопределено Тогда
			ПрогрессСтрокой = ПрогрессСтрокой(Задание.Прогресс);
			Если Не ПустаяСтрока(ПрогрессСтрокой) Тогда
				Элементы["ДекорацияПоясняющийТекстДлительнойОперации" + ТекЗадание.НомерФоновогоЗадания].Заголовок = ТекстСообщения + Символы.ПС + ПрогрессСтрокой;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ПарамертрыПоиска = Новый Структура("Статус", "Выполняется");
	НайденныеСтроки = ТаблицаЗаданий.НайтиСтроки(ПарамертрыПоиска);
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		ПарамертрыПоиска = Новый Структура("Статус", "Ошибка");
		НайденныеСтрокиСОшибкой = ТаблицаЗаданий.НайтиСтроки(ПарамертрыПоиска);
		
		Если НайденныеСтрокиСОшибкой.Количество() > 0 Тогда
			
			МассивОшибок = Новый Массив;
			КраткоеПредставлениеОшибки = "";
			Для каждого ТекСтрока Из НайденныеСтрокиСОшибкой Цикл
				МассивОшибок.Добавить(ТекСтрока);
				КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки + Символы.ПС + ТекСтрока.КраткоеПредставлениеОшибки;
			КонецЦикла;
			
			Закрыть(МассивОшибок);
			Если ВозвращатьРезультатВОбработкуВыбора() Тогда
				ВызватьИсключение КраткоеПредставлениеОшибки;
			КонецЕсли;
			Возврат;
			
		КонецЕсли;
		
		ПарамертрыПоиска = Новый Структура("Статус", "Выполнено");
		НайденныеСтрокиВыполнено = ТаблицаЗаданий.НайтиСтроки(ПарамертрыПоиска);
		
		Если ТаблицаЗаданий.Количество() = НайденныеСтрокиВыполнено.Количество() Тогда
			
			МассивРезультата = Новый Массив;
			Для каждого ТекСтрока Из НайденныеСтрокиВыполнено Цикл
				МассивРезультата.Добавить(ТекСтрока);
			КонецЦикла;
			
			//ПоказатьОповещение();
			Если ВозвращатьРезультатВОбработкуВыбора() Тогда
				ОповеститьОВыборе(МассивРезультата);
				Возврат;
			КонецЕсли;
			Закрыть(МассивРезультата);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.ВыводитьОкноОжидания Тогда
		Если Параметры.Интервал = 0 Тогда
			ИнтервалОжидания = ИнтервалОжидания * 1.4;
			Если ИнтервалОжидания > 15 Тогда
				ИнтервалОжидания = 15;
			КонецЕсли;
		КонецЕсли;
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗаданий", ИнтервалОжидания, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОтменитьЗадание()
	
	ФормаЗакрывается = Истина;
	Подключаемый_ПроверитьВыполнениеЗаданий(); // а вдруг задание уже выполнилось.
	
	НайденныеСтрокиВыполнено = ТаблицаЗаданий.НайтиСтроки(Новый Структура("Статус", "Выполнено"));
	НайденныеСтрокиОтменено = ТаблицаЗаданий.НайтиСтроки(Новый Структура("Статус", "Отменено"));
	
	Если ТаблицаЗаданий.Количество() = НайденныеСтрокиВыполнено.Количество() + НайденныеСтрокиОтменено.Количество() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОповещение()
	
	Если Параметры.ОповещениеПользователя = Неопределено Или Не Параметры.ОповещениеПользователя.Показать Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Параметры.ОповещениеПользователя;
	
	НавигационнаяСсылкаОповещения = Оповещение.НавигационнаяСсылка;
	
	ПоказатьОповещениеПользователя(?(Оповещение.Текст <> Неопределено, Оповещение.Текст, НСтр("ru = 'Действие выполнено'")), 
		НавигационнаяСсылкаОповещения);

КонецПроцедуры

&НаСервере
Функция ПроверитьЗаданиеВыполнено(ФормаЗакрывается, ИдентификаторЗадания, КлючЗадания)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		СтруктураПоиска = Новый Структура("Ключ", КлючЗадания);
		МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураПоиска);
		Если МассивФоновыхЗаданий.Количество() > 0 Тогда
			НайденноеЗадание = МассивФоновыхЗаданий[0];
			ИдентификаторЗадания = НайденноеЗадание.УникальныйИдентификатор;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Задание = ДлительныеОперации.ОперацияВыполнена(ИдентификаторЗадания, Ложь, Истина, Ложь);
	
	Если Параметры.ПолучатьРезультат Тогда
		Если Задание.Статус = "Выполнено" Тогда
			Задание.Вставить("Результат", ПолучитьИзВременногоХранилища(Параметры.АдресРезультата));
		Иначе
			Задание.Вставить("Результат", Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	Если ФормаЗакрывается = Истина Тогда
		ОтменитьВыполнениеЗаданий();
		Задание.Статус = "Отменено";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Задание;
	
КонецФункции

&НаКлиенте
Функция ПрогрессСтрокой(Прогресс)
	
	Результат = "";
	Если Прогресс = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Процент = 0;
	Если Прогресс.Свойство("Процент", Процент) Тогда
		Результат = Строка(Процент) + "%";
	КонецЕсли;
	Текст = 0;
	Если Прогресс.Свойство("Текст", Текст) Тогда
		Если Не ПустаяСтрока(Результат) Тогда
			Результат = Результат + " (" + Текст + ")";
		Иначе
			Результат = Текст;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВозвращатьРезультатВОбработкуВыбора()
	Возврат ОписаниеОповещенияОЗакрытии = Неопределено
		И Параметры.ПолучатьРезультат
		И ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма");
КонецФункции

&НаСервере
Процедура ОтменитьВыполнениеЗаданий()
	
	Для каждого ТекЗадание Из ТаблицаЗаданий Цикл
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ТекЗадание.ИдентификаторЗадания);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиИндикациюПоФоновым()
	
	ТаблицаЗаданий.Очистить();
	
	НомерФоновогоЗадания = 0;
	
	ТекстСообщения = НСтр("ru = 'Пожалуйста, подождите...'");
	
	Для каждого ТекИдентификатор Из Параметры.МассивУникальныхИдентификаторов Цикл
		НомерФоновогоЗадания = НомерФоновогоЗадания + 1;
		
		Если НомерФоновогоЗадания > 1 Тогда
		
			НоваяВкладка = Элементы.Добавить("ФоновоеЗадание" + НомерФоновогоЗадания, Тип("ГруппаФормы"), Элементы.Группа1);
			НоваяВкладка.Вид = ВидГруппыФормы.Страница;
			НоваяВкладка.Заголовок = "Фоновое задание " + НомерФоновогоЗадания;
			
			ГруппаСтраницы = ЭтаФорма.Элементы.Добавить("ГруппаОбычная" + НомерФоновогоЗадания, Тип("ГруппаФормы"), НоваяВкладка);
			ГруппаСтраницы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСтраницы.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаСтраницы.ОтображатьЗаголовок = Ложь;
			ГруппаСтраницы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			Рисунок = Элементы.Добавить("ДекорацияДлительнаяОперация" + НомерФоновогоЗадания, Тип("ДекорацияФормы"), ГруппаСтраницы);
			Рисунок.Вид = ВидДекорацииФормы.Картинка;
			Рисунок.Заголовок = "Длительная операция" + НомерФоновогоЗадания;
			Рисунок.Картинка = БиблиотекаКартинок.ДлительнаяОперация48;
			
			Надпись = Элементы.Добавить("ДекорацияПоясняющийТекстДлительнойОперации" + НомерФоновогоЗадания, Тип("ДекорацияФормы"), ГруппаСтраницы);
			Надпись.Вид = ВидДекорацииФормы.Надпись;
			Надпись.Заголовок = "Пожалуйста, подождите...";
			Надпись.РастягиватьПоВертикали = Истина;
			Надпись.РастягиватьПоГоризонтали = Истина;
			Надпись.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
			Надпись.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Верх;
		КонецЕсли;
		
		Элементы["ДекорацияПоясняющийТекстДлительнойОперации" + НомерФоновогоЗадания].Заголовок = ТекстСообщения;
		
		НоваяСтрока = ТаблицаЗаданий.Добавить();
		НоваяСтрока.НомерФоновогоЗадания = НомерФоновогоЗадания;
		НоваяСтрока.КлючЗадания = ТекИдентификатор;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
