Функция ТипТарифа_ФиксированнаяСумма(Дата, Тариф, Валюта, Знач ОграничениеСуммы=0)
	Перем ПараметрыВалюты;
	Перем ВозвращаемоеЗначение;
	ПараметрыВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата,Новый Структура("Валюта",Валюта));
	Если ПараметрыВалюты.Курс = Неопределено Тогда
		Сообщить("Для валюты "+Валюта+" на дату "+Дата+" не определен курс валюты",СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	Если ПараметрыВалюты.Кратность = Неопределено Тогда
		Сообщить("Для валюты "+Валюта+" на дату "+Дата+" не определена кратность валюты",СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	ВозвращаемоеЗначение = ?(ОграничениеСуммы = 0, Тариф * ПараметрыВалюты.Курс / ПараметрыВалюты.Кратность, Мин(Тариф * ПараметрыВалюты.Курс / ПараметрыВалюты.Кратность,ОграничениеСуммы));
	Возврат ВозвращаемоеЗначение;
КонецФункции	

Функция ТипТарифа_ПроцентОтНачисления(Дата, Объем, Тариф, Валюта, Знач ОграничениеСуммы=0)
	Перем ПараметрыВалюты, НоминалЦБ;
	Перем ВозвращаемоеЗначение;
	ПараметрыВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата,Новый Структура("Валюта",Валюта));
	Если ПараметрыВалюты.Курс = Неопределено Тогда
		Сообщить("Для валюты "+Валюта+" на дату "+Дата+" не определен курс валюты",СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	Если ПараметрыВалюты.Кратность = Неопределено Тогда
		Сообщить("Для валюты "+Валюта+" на дату "+Дата+" не определена кратность валюты",СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	ВозвращаемоеЗначение = ?(ОграничениеСуммы = 0,Объем * Тариф / 100 * ПараметрыВалюты.Курс / ПараметрыВалюты.Кратность,Мин(Объем * Тариф / 100 * ПараметрыВалюты.Курс / ПараметрыВалюты.Кратность,ОграничениеСуммы));
	Возврат ВозвращаемоеЗначение;
КонецФункции	

Функция ТипТарифа_ЦенаЗаЕдиницу(Дата, Тариф, ЦеннаяБумага, Валюта, Знач ОграничениеСуммы=0)
	Перем ПараметрыВалюты, НоминалЦБ;
	Перем ВозвращаемоеЗначение;
	ПараметрыВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата,Новый Структура("Валюта",Валюта));
	Если ПараметрыВалюты.Курс = Неопределено Тогда
		Сообщить("Для валюты "+Валюта+" на дату "+Дата+" не определен курс валюты",СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	Если ПараметрыВалюты.Кратность = Неопределено Тогда
		Сообщить("Для валюты "+Валюта+" на дату "+Дата+" не определена кратность валюты",СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	ВозвращаемоеЗначение = ?(ОграничениеСуммы = 0,НоминалЦБ.Сумма * Тариф * ПараметрыВалюты.Курс / ПараметрыВалюты.Кратность,Мин(НоминалЦБ.Сумма * Тариф * ПараметрыВалюты.Курс / ПараметрыВалюты.Кратность,ОграничениеСуммы));
	Возврат ВозвращаемоеЗначение;
КонецФункции	

Функция ШкалаДляРасчетаУслуги(Дата, Услуга, Объем) Экспорт
	Перем Запрос, Выборка, Результат;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ТарифыСрезПоследних.Тариф,
	                      |	ТарифыСрезПоследних.ТипТарифа
	                      |ИЗ
	                      |	РегистрСведений.Тарифы.СрезПоследних(
	                      |			&Дата,
	                      |			Услуга = &Услуга
	                      |				И Шкала >= &Шкала) КАК ТарифыСрезПоследних
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТарифыСрезПоследних.Шкала");
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.УстановитьПараметр("Шкала", Объем);
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция РасчетПоШкале(Дата, Услуга, Объем)
	Перем Выборка, СтруктураОтвета;
	
	СтруктураОтвета = Новый Структура("Тариф,ТипТарифа,Сумма,Валюта,Услуга,Объем");
	СтруктураОтвета.Услуга = Услуга;
	СтруктураОтвета.Валюта = Услуга.Валюта;
	СтруктураОтвета.Объем = Объем;
	Выборка = ШкалаДляРасчетаУслуги(Дата, Услуга, Объем);
	Если НЕ Выборка.Следующий() Тогда
		Сообщить("Для услуги <"+Услуга+"> на дату <"+Дата+"> не удалось определить шкалу расчета",СтатусСообщения.Важное);
		Возврат Неопределено
	КонецЕсли;
	СтруктураОтвета.Тариф = Выборка.Тариф;
	СтруктураОтвета.ТипТарифа = Выборка.ТипТарифа;
	
	Если Выборка.ТипТарифа = Перечисления.ТипыТарифов.ФиксированнаяСумма Тогда
		СтруктураОтвета.Сумма = ТипТарифа_ФиксированнаяСумма(Дата, Выборка.Тариф, Услуга.Валюта, Услуга.ОграничениеСуммыНачисления);
		Возврат СтруктураОтвета;
	ИначеЕсли Выборка.ТипТарифа = Перечисления.ТипыТарифов.ПроцентОтНачисления Тогда
		СтруктураОтвета.Сумма = ТипТарифа_ПроцентОтНачисления(Дата, Объем, Выборка.Тариф, Услуга.Валюта, Услуга.ОграничениеСуммыНачисления);
		Возврат СтруктураОтвета;
	ИначеЕсли Выборка.ТипТарифа = Перечисления.ТипыТарифов.ЦенаЗаЕдиницу Тогда
		СтруктураОтвета.Сумма = ТипТарифа_ЦенаЗаЕдиницу(Дата, Выборка.Тариф, Услуга.Валюта, Услуга.ОграничениеСуммыНачисления);
		Возврат СтруктураОтвета;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ОценкаАктивов(Дата, Знач Договор = Неопределено, Услуга, ПериодРасчета = Неопределено) Экспорт
	ДоступныеПериодыРасчета = Новый Массив;
	ДоступныеПериодыРасчета.Добавить(Перечисления.ВариантыНачисленияКомиссий.Месяц);
	ДоступныеПериодыРасчета.Добавить(Перечисления.ВариантыНачисленияКомиссий.Квартал);
	ДоступныеПериодыРасчета.Добавить(Перечисления.ВариантыНачисленияКомиссий.Полугодие);
	ДоступныеПериодыРасчета.Добавить(Перечисления.ВариантыНачисленияКомиссий.Год);
	
	Если НЕ ЗначениеЗаполнено(ПериодРасчета) ИЛИ ДоступныеПериодыРасчета.Найти(ПериодРасчета) = Неопределено Тогда
		ПериодРасчета = Перечисления.ВариантыНачисленияКомиссий.Месяц;
	КонецЕсли;
	
	// Внимание. Если нужно изменить запрос, то нужно так же изменить и запрос по расшифровке данных.
	// Он находится в этом же модуле в функции "РасшифровкаОценкиАктивовПоСтроке".
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Календарь.Период КАК Период
	|ПОМЕСТИТЬ Календарь
	|ИЗ
	|	РегистрСведений.Календарь КАК Календарь
	|ГДЕ
	|	Календарь.Период МЕЖДУ &НачалоПериода И &Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(РегистрНазначенныхКомиссий.Период) КАК ПериодНазначенияКомиссии,
	|	РегистрНазначенныхКомиссий.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РегистрНазначенныхКомиссий.Услуга КАК Услуга,
	|	Календарь.Период КАК ПредварительнаяДатаРасчетаКомиссии
	|ПОМЕСТИТЬ РегистрНазначенныхКомиссийПоКалендарю
	|ИЗ
	|	РегистрСведений.РегистрНазначенныхКомиссий КАК РегистрНазначенныхКомиссий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Календарь КАК Календарь
	|		ПО РегистрНазначенныхКомиссий.Период <= Календарь.Период
	|			И (РегистрНазначенныхКомиссий.Услуга = &Услуга)
	|			И (РегистрНазначенныхКомиссий.Услуга.ПериодРасчета = &ПериодРасчета)
	|			И (РегистрНазначенныхКомиссий.Услуга.ВидКомиссии = &ДепозитарнаяКомиссия)
	|			И (РегистрНазначенныхКомиссий.Услуга.ТипРасчета = &ТипРасчета)
	|			И (РегистрНазначенныхКомиссий.ДоговорКонтрагента = &Договор
	|				ИЛИ &Договор = НЕОПРЕДЕЛЕНО)
	|			И РегистрНазначенныхКомиссий.ДоговорКонтрагента.ДатаНачалоДействия <= Календарь.Период
	|			И (РегистрНазначенныхКомиссий.ДоговорКонтрагента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрНазначенныхКомиссий.ДоговорКонтрагента,
	|	РегистрНазначенныхКомиссий.Услуга,
	|	Календарь.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Комиссии.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Комиссии.Услуга КАК Услуга
	|ПОМЕСТИТЬ СписокКлиентов
	|ИЗ
	|	РегистрСведений.РегистрНазначенныхКомиссий КАК Комиссии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНазначенныхКомиссийПоКалендарю КАК РегистрНазначенныхКомиссийПоКалендарю
	|		ПО Комиссии.Период = РегистрНазначенныхКомиссийПоКалендарю.ПериодНазначенияКомиссии
	|			И Комиссии.ДоговорКонтрагента = РегистрНазначенныхКомиссийПоКалендарю.ДоговорКонтрагента
	|			И Комиссии.Услуга = РегистрНазначенныхКомиссийПоКалендарю.Услуга
	|			И (Комиссии.ФлагАктивности)
	|			И (Комиссии.ДоговорКонтрагента.ДатаНачалоДействия <= &Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	Комиссии.ДоговорКонтрагента,
	|	Комиссии.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Комиссии.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РегистрНазначенныхКомиссийПоКалендарю.ПредварительнаяДатаРасчетаКомиссии КАК Период
	|ПОМЕСТИТЬ КалендарьПоДоговору
	|ИЗ
	|	РегистрСведений.РегистрНазначенныхКомиссий КАК Комиссии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНазначенныхКомиссийПоКалендарю КАК РегистрНазначенныхКомиссийПоКалендарю
	|		ПО Комиссии.Период = РегистрНазначенныхКомиссийПоКалендарю.ПериодНазначенияКомиссии
	|			И Комиссии.ДоговорКонтрагента = РегистрНазначенныхКомиссийПоКалендарю.ДоговорКонтрагента
	|			И Комиссии.Услуга = РегистрНазначенныхКомиссийПоКалендарю.Услуга
	|			И (Комиссии.ФлагАктивности)
	|			И (Комиссии.ДоговорКонтрагента.ДатаНачалоДействия <= &Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиИОборотыЦБ.Период КАК Период,
	|	ОстаткиИОборотыЦБ.ЦБ КАК ЦБ,
	|	ОстаткиИОборотыЦБ.ЦБ.ТипЦБ КАК ЦБТипЦБ,
	|	ОстаткиИОборотыЦБ.ЦБ.ДатаПогашения КАК ЦБДатаПогашения,
	|	ОстаткиИОборотыЦБ.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	ОстаткиИОборотыЦБ.СчетДепо КАК СчетДепо,
	|	ОстаткиИОборотыЦБ.СчетДепо.Владелец КАК СчетДепоВладелец,
	|	НЕОПРЕДЕЛЕНО КАК Выгодоприобретатель
	|ПОМЕСТИТЬ ВТ_ОстаткиИОборотыЦБ
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
	|			День,
	|			,
	|			НЕ СчетДепо.Владелец.Субброкер
	|				И &УсловиеОтбораПоМестуХранения
	|				И &УсловиеОтбораПоВидамЦББанкаРоссии
	|				И СчетДепо.Владелец В
	|					(ВЫБРАТЬ
	|						СписокКлиентов.ДоговорКонтрагента.Владелец КАК Клиент
	|					ИЗ
	|						СписокКлиентов КАК СписокКлиентов)) КАК ОстаткиИОборотыЦБ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиИОборотыЦБ.Период,
	|	ОстаткиИОборотыЦБ.ЦБ,
	|	ОстаткиИОборотыЦБ.ЦБ.ТипЦБ,
	|	ОстаткиИОборотыЦБ.ЦБ.ДатаПогашения,
	|	ОстаткиИОборотыЦБ.КоличествоКонечныйОстаток,
	|	ОстаткиИОборотыЦБ.СчетДепо,
	|	ОстаткиИОборотыЦБ.СчетДепо.Владелец,
	|	ОстаткиИОборотыЦБ.РазделСчетаДепо.Субклиент
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
	|			День,
	|			,
	|			СчетДепо.Владелец.Субброкер
	|				И &УсловиеОтбораПоМестуХранения
	|				И &УсловиеОтбораПоВидамЦББанкаРоссии
	|				И СчетДепо.Владелец В
	|					(ВЫБРАТЬ
	|						СписокКлиентов.ДоговорКонтрагента.Владелец КАК Клиент
	|					ИЗ
	|						СписокКлиентов КАК СписокКлиентов)) КАК ОстаткиИОборотыЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиИОборотыЦБ.Период КАК Период,
	|	ОстаткиИОборотыЦБ.ЦБ КАК ЦБ,
	|	ВЫБОР
	|		КОГДА ОстаткиИОборотыЦБ.ЦБТипЦБ = &ТипЦБОблигация
	|				И ОстаткиИОборотыЦБ.ЦБДатаПогашения <= НАЧАЛОПЕРИОДА(ОстаткиИОборотыЦБ.Период, КВАРТАЛ)
	|				И НЕ ОстаткиИОборотыЦБ.ЦБДатаПогашения = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		ИНАЧЕ ОстаткиИОборотыЦБ.КоличествоКонечныйОстаток
	|	КОНЕЦ КАК КоличествоКонечныйОстаток,
	|	СписокКлиентов.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ОстаткиИОборотыЦБ.СчетДепо КАК СчетДепо,
	|	ОстаткиИОборотыЦБ.Выгодоприобретатель КАК Выгодоприобретатель
	|ПОМЕСТИТЬ ОстаткиПоСчетамДЕПО
	|ИЗ
	|	СписокКлиентов КАК СписокКлиентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОстаткиИОборотыЦБ КАК ОстаткиИОборотыЦБ
	|		ПО СписокКлиентов.ДоговорКонтрагента.Владелец = ОстаткиИОборотыЦБ.СчетДепоВладелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Календарь.Период КАК Период,
	|	МАКСИМУМ(ОстаткиПоСчетамДЕПО.Период) КАК ПериодРасчета,
	|	ОстаткиПоСчетамДЕПО.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ОстаткиПоСчетамДЕПО.СчетДепо КАК СчетДепо,
	|	ОстаткиПоСчетамДЕПО.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ОстаткиПоСчетамДЕПО.ЦБ КАК ЦБ
	|ПОМЕСТИТЬ ТаблицаРаспределенияПериодовПоДням
	|ИЗ
	|	КалендарьПоДоговору КАК Календарь
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиПоСчетамДЕПО КАК ОстаткиПоСчетамДЕПО
	|		ПО Календарь.Период >= ОстаткиПоСчетамДЕПО.Период
	|			И Календарь.ДоговорКонтрагента = ОстаткиПоСчетамДЕПО.ДоговорКонтрагента
	|
	|СГРУППИРОВАТЬ ПО
	|	Календарь.Период,
	|	ОстаткиПоСчетамДЕПО.ДоговорКонтрагента,
	|	ОстаткиПоСчетамДЕПО.СчетДепо,
	|	ОстаткиПоСчетамДЕПО.Выгодоприобретатель,
	|	ОстаткиПоСчетамДЕПО.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРаспределенияПериодовПоДням.Период КАК Период,
	|	ТаблицаРаспределенияПериодовПоДням.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаРаспределенияПериодовПоДням.СчетДепо КАК СчетДепо,
	|	ТаблицаРаспределенияПериодовПоДням.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ТаблицаРаспределенияПериодовПоДням.ЦБ КАК ЦБ,
	|	ВЫБОР
	|		КОГДА ОстаткиПоСчетамДЕПО.ЦБ.ТипЦБ = &ТипЦБОблигация
	|				И ОстаткиПоСчетамДЕПО.ЦБ.ДатаПогашения <= НАЧАЛОПЕРИОДА(ТаблицаРаспределенияПериодовПоДням.Период, КВАРТАЛ)
	|				И НЕ ОстаткиПоСчетамДЕПО.ЦБ.ДатаПогашения = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		ИНАЧЕ ОстаткиПоСчетамДЕПО.КоличествоКонечныйОстаток
	|	КОНЕЦ КАК Количество
	|ПОМЕСТИТЬ ТаблицаОстатковРаспределеннаяПоДням
	|ИЗ
	|	ТаблицаРаспределенияПериодовПоДням КАК ТаблицаРаспределенияПериодовПоДням
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиПоСчетамДЕПО КАК ОстаткиПоСчетамДЕПО
	|		ПО ТаблицаРаспределенияПериодовПоДням.ПериодРасчета = ОстаткиПоСчетамДЕПО.Период
	|			И ТаблицаРаспределенияПериодовПоДням.ДоговорКонтрагента = ОстаткиПоСчетамДЕПО.ДоговорКонтрагента
	|			И ТаблицаРаспределенияПериодовПоДням.СчетДепо = ОстаткиПоСчетамДЕПО.СчетДепо
	|			И ТаблицаРаспределенияПериодовПоДням.Выгодоприобретатель = ОстаткиПоСчетамДЕПО.Выгодоприобретатель
	|			И ТаблицаРаспределенияПериодовПоДням.ЦБ = ОстаткиПоСчетамДЕПО.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОстатковРаспределеннаяПоДням.Период КАК Период,
	|	ТаблицаОстатковРаспределеннаяПоДням.ЦБ КАК ЦБ
	|ПОМЕСТИТЬ ТаблицаЦБПоДатамПриНаличииОстатков
	|ИЗ
	|	ТаблицаОстатковРаспределеннаяПоДням КАК ТаблицаОстатковРаспределеннаяПоДням
	|ГДЕ
	|	ТаблицаОстатковРаспределеннаяПоДням.Количество <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЦБПоДатамПриНаличииОстатков.Период КАК Период,
	|	ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ КАК ЦБ,
	|	МАКСИМУМ(Котировки.Период) КАК ПериодКотировки
	|ПОМЕСТИТЬ ТаблицаДатКотировок
	|ИЗ
	|	ТаблицаЦБПоДатамПриНаличииОстатков КАК ТаблицаЦБПоДатамПриНаличииОстатков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Котировки КАК Котировки
	|		ПО ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ = Котировки.ЦеннаяБумага
	|			И ТаблицаЦБПоДатамПриНаличииОстатков.Период >= Котировки.Период
	|			И (ТаблицаЦБПоДатамПриНаличииОстатков.Период <= ДОБАВИТЬКДАТЕ(Котировки.Период, ДЕНЬ, 90))
	|			И (Котировки.РыночнаяЦена > 0)
	|			И (Котировки.Биржа = &НРД)
	|			И (Котировки.РежимТоргов.РежимТоргов = &РежимТорговРыночный)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦБПоДатамПриНаличииОстатков.Период,
	|	ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДатКотировок.Период КАК Период,
	|	ТаблицаДатКотировок.ЦБ КАК ЦБ,
	|	ЕСТЬNULL(МАКСИМУМ(Котировки.РыночнаяЦена), 0) КАК РыночнаяЦена
	|ПОМЕСТИТЬ ТаблицаРыночныхЦенНаДатыОстатков
	|ИЗ
	|	ТаблицаДатКотировок КАК ТаблицаДатКотировок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Котировки КАК Котировки
	|		ПО ТаблицаДатКотировок.ПериодКотировки = Котировки.Период
	|			И ТаблицаДатКотировок.ЦБ = Котировки.ЦеннаяБумага
	|			И (Котировки.Биржа = &НРД)
	|			И (Котировки.РежимТоргов.РежимТоргов = &РежимТорговРыночный)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДатКотировок.Период,
	|	ТаблицаДатКотировок.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОстатковРаспределеннаяПоДням.Период КАК Период,
	|	ТаблицаОстатковРаспределеннаяПоДням.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаОстатковРаспределеннаяПоДням.СчетДепо КАК СчетДепо,
	|	ТаблицаОстатковРаспределеннаяПоДням.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ТаблицаОстатковРаспределеннаяПоДням.ЦБ КАК ЦБ,
	|	ТаблицаОстатковРаспределеннаяПоДням.Количество КАК Количество,
	|	ЕСТЬNULL(ТаблицаРыночныхЦенНаДатыОстатков.РыночнаяЦена, 0) КАК РыночнаяЦена
	|ПОМЕСТИТЬ ТаблицаОстатковЗаКаждыйДеньВключаяКотировки
	|ИЗ
	|	ТаблицаОстатковРаспределеннаяПоДням КАК ТаблицаОстатковРаспределеннаяПоДням
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРыночныхЦенНаДатыОстатков КАК ТаблицаРыночныхЦенНаДатыОстатков
	|		ПО ТаблицаОстатковРаспределеннаяПоДням.Период = ТаблицаРыночныхЦенНаДатыОстатков.Период
	|			И ТаблицаОстатковРаспределеннаяПоДням.ЦБ = ТаблицаРыночныхЦенНаДатыОстатков.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.Период КАК Период,
	|	ИтоговаяТаблица.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ИтоговаяТаблица.СчетДепо КАК СчетДепо,
	|	ИтоговаяТаблица.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ИтоговаяТаблица.ЦБ КАК ЦБ,
	|	ИтоговаяТаблица.Количество КАК Количество,
	|	ИтоговаяТаблица.РыночнаяЦена КАК РыночнаяЦена,
	|	ВЫБОР
	|		КОГДА ИтоговаяТаблица.РыночнаяЦена > 0
	|			ТОГДА ИтоговаяТаблица.РыночнаяЦена * ИтоговаяТаблица.Количество
	|		КОГДА ИтоговаяТаблица.Количество > 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Оценка
	|ПОМЕСТИТЬ ИтоговаяТаблицаРасчета
	|ИЗ
	|	ТаблицаОстатковЗаКаждыйДеньВключаяКотировки КАК ИтоговаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблицаРасчета.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ИтоговаяТаблицаРасчета.Выгодоприобретатель КАК Выгодоприобретатель,
	|	СУММА(ИтоговаяТаблицаРасчета.Оценка) КАК Оценка,
	|	ИтоговаяТаблицаРасчета.Период КАК Период
	|ПОМЕСТИТЬ ИтоговаяОценкаПоДоговорамПоДням
	|ИЗ
	|	ИтоговаяТаблицаРасчета КАК ИтоговаяТаблицаРасчета
	|ГДЕ
	|	(ИтоговаяТаблицаРасчета.РыночнаяЦена = 0
	|				И &ТипРасчета В (&ТипыРасчетаДляНулевойРыночнойЦены)
	|			ИЛИ ИтоговаяТаблицаРасчета.РыночнаяЦена > 0
	|				И &ТипРасчета В (&ТипыРасчетаДляНенулевойРыночнойЦены))
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтоговаяТаблицаРасчета.ДоговорКонтрагента,
	|	ИтоговаяТаблицаРасчета.Выгодоприобретатель,
	|	ИтоговаяТаблицаРасчета.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяОценкаПоДоговорам.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ИтоговаяОценкаПоДоговорам.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ИтоговаяОценкаПоДоговорам.Оценка КАК Оценка,
	|	ИтоговаяОценкаПоДоговорам.Период КАК Дата
	|ПОМЕСТИТЬ ИтоговаяОценкаПоДоговорам
	|ИЗ
	|	ИтоговаяОценкаПоДоговорамПоДням КАК ИтоговаяОценкаПоДоговорам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяОценкаПоДоговорам.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ИтоговаяОценкаПоДоговорам.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ИтоговаяОценкаПоДоговорам.Оценка КАК Оценка,
	|	МИНИМУМ(ТарифыСрезПоследних.Шкала) КАК Шкала,
	|	ИтоговаяОценкаПоДоговорам.Дата КАК Дата
	|ПОМЕСТИТЬ ОценкаПоДоговорамИШкала
	|ИЗ
	|	ИтоговаяОценкаПоДоговорам КАК ИтоговаяОценкаПоДоговорам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Тарифы.СрезПоследних(&Период, Услуга = &Услуга) КАК ТарифыСрезПоследних
	|		ПО ИтоговаяОценкаПоДоговорам.Оценка <= ТарифыСрезПоследних.Шкала
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтоговаяОценкаПоДоговорам.ДоговорКонтрагента,
	|	ИтоговаяОценкаПоДоговорам.Выгодоприобретатель,
	|	ИтоговаяОценкаПоДоговорам.Оценка,
	|	ИтоговаяОценкаПоДоговорам.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОценкаПоДоговорамИШкала.ДоговорКонтрагента КАК Договор,
	|	ОценкаПоДоговорамИШкала.Выгодоприобретатель КАК Выгодоприобретатель,
	|	&Услуга КАК Комиссия,
	|	ТарифыСрезПоследних.ТипТарифа КАК ТипТарифа,
	|	СУММА(ОценкаПоДоговорамИШкала.Оценка) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ТарифыСрезПоследних.ТипТарифа = &ТарифФиксированнаяСумма
	|				ТОГДА ОценкаПоДоговорамИШкала.Оценка / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ОценкаПоДоговорамИШкала.Дата, МЕСЯЦ), КОНЕЦПЕРИОДА(ОценкаПоДоговорамИШкала.Дата, МЕСЯЦ), ДЕНЬ) + 1) * ТарифыСрезПоследних.Тариф
	|			КОГДА ТарифыСрезПоследних.ТипТарифа = &ТарифПроцентОтНачисления
	|				ТОГДА ОценкаПоДоговорамИШкала.Оценка / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ОценкаПоДоговорамИШкала.Дата, МЕСЯЦ), КОНЕЦПЕРИОДА(ОценкаПоДоговорамИШкала.Дата, МЕСЯЦ), ДЕНЬ) + 1) * ТарифыСрезПоследних.Тариф / 100
	|		КОНЕЦ) КАК СуммаКомиссии,
	|	ТарифыСрезПоследних.Тариф КАК Тариф,
	|	&Валюта КАК Валюта
	|ИЗ
	|	ОценкаПоДоговорамИШкала КАК ОценкаПоДоговорамИШкала
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Тарифы.СрезПоследних(&Период, Услуга = &Услуга) КАК ТарифыСрезПоследних
	|		ПО ОценкаПоДоговорамИШкала.Шкала = ТарифыСрезПоследних.Шкала
	|			И (ТарифыСрезПоследних.Тариф > 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОценкаПоДоговорамИШкала.ДоговорКонтрагента,
	|	ОценкаПоДоговорамИШкала.Выгодоприобретатель,
	|	ТарифыСрезПоследних.ТипТарифа,
	|	ТарифыСрезПоследних.Тариф");
	
	Запрос.УстановитьПараметр("НачалоПериода",	ДатаНачалаПериодаРасчета(Дата, ПериодРасчета));
	Запрос.УстановитьПараметр("Период",			Дата);
	Запрос.УстановитьПараметр("ПериодРасчета",	ПериодРасчета);
	Запрос.УстановитьПараметр("ДепозитарнаяКомиссия",	Перечисления.ВидыКомиссий.Депозитарная);
	Запрос.УстановитьПараметр("ТипЦБОблигация",			Перечисления.ТипыЦБ.Облигация);
	Запрос.УстановитьПараметр("РежимТорговРыночный",	Перечисления.РежимыТоргов.Рыночная);
	
	ТипыРасчетаДляНулевойРыночнойЦены = Новый Массив;
	ТипыРасчетаДляНулевойРыночнойЦены.Добавить(Перечисления.ТипыРасчетаУслуги.ОстатокПоВыпуску);
	Запрос.УстановитьПараметр("ТипыРасчетаДляНулевойРыночнойЦены", ТипыРасчетаДляНулевойРыночнойЦены);
	
	ТипыРасчетаДляНенулевойРыночнойЦены = Новый Массив;
	ТипыРасчетаДляНенулевойРыночнойЦены.Добавить(Перечисления.ТипыРасчетаУслуги.ОстатокПоРыночнойСтоимости);
	ТипыРасчетаДляНенулевойРыночнойЦены.Добавить(Перечисления.ТипыРасчетаУслуги.ОценкаРыночнойСтоимостиЗаМесяц);
	Запрос.УстановитьПараметр("ТипыРасчетаДляНенулевойРыночнойЦены", ТипыРасчетаДляНенулевойРыночнойЦены);
	
	Запрос.УстановитьПараметр("ТарифФиксированнаяСумма",	Перечисления.ТипыТарифов.ФиксированнаяСумма);
	Запрос.УстановитьПараметр("ТарифПроцентОтНачисления",	Перечисления.ТипыТарифов.ПроцентОтНачисления);
	
	Запрос.УстановитьПараметр("Валюта",			Услуга.Валюта);
	Запрос.УстановитьПараметр("Договор",		Договор);
	Запрос.УстановитьПараметр("ТипРасчета",		Услуга.ТипРасчета);
	Запрос.УстановитьПараметр("Услуга",			Услуга);
	
	Если ЗначениеЗаполнено(Услуга) И ЗначениеЗаполнено(Услуга.МестоХранения1) Тогда
		Запрос.УстановитьПараметр("НРД", Услуга.МестоХранения1);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораПоМестуХранения", "СчетДепоМХ.Владелец В (&МестаХранения)");
		Запрос.УстановитьПараметр("МестаХранения", Справочники.УслугиТарифногоПлана.МестаХраненияДляПолученияОстатков(Услуга));
	Иначе
		Запрос.УстановитьПараметр("НРД", Константы.МестоХраненияПоУмолчанию.Получить());
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораПоМестуХранения", "1 = 1");
	КонецЕсли;
	
	УстановитьОтборПоВидамЦБЕслиНужно(Запрос, Услуга.ТипРасчета, Услуга.ОтборПоВидуЦБ, Услуга.ИсключатьПриОтбореПеречисленныеВидыЦБ);

	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
КонецФункции

Функция РасшифровкаОценкиАктивовПоСтроке(Дата, Знач Договор = Неопределено, Услуга, Субклиент, ПериодРасчета = Неопределено) Экспорт
	
	// Внимание. Если нужно изменить запрос, то нужно так же учесть, что есть запрос, по которому делается данная Расшифровка.
	// Он находится в этом же модуле в функции "ОценкаАктивов".
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Календарь.Период КАК Период
	|ПОМЕСТИТЬ Календарь
	|ИЗ
	|	РегистрСведений.Календарь КАК Календарь
	|ГДЕ
	|	Календарь.Период МЕЖДУ &НачалоПериода И &Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(РегистрНазначенныхКомиссий.Период) КАК ПериодНазначенияКомиссии,
	|	РегистрНазначенныхКомиссий.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РегистрНазначенныхКомиссий.Услуга КАК Услуга,
	|	Календарь.Период КАК ПредварительнаяДатаРасчетаКомиссии
	|ПОМЕСТИТЬ РегистрНазначенныхКомиссийПоКалендарю
	|ИЗ
	|	РегистрСведений.РегистрНазначенныхКомиссий КАК РегистрНазначенныхКомиссий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Календарь КАК Календарь
	|		ПО РегистрНазначенныхКомиссий.Период <= Календарь.Период
	|			И (РегистрНазначенныхКомиссий.Услуга = &Услуга)
	|			И (РегистрНазначенныхКомиссий.Услуга.ПериодРасчета = &ПериодРасчета)
	|			И (РегистрНазначенныхКомиссий.Услуга.ВидКомиссии = &ДепозитарнаяКомиссия)
	|			И (РегистрНазначенныхКомиссий.Услуга.ТипРасчета = &ТипРасчета)
	|			И (РегистрНазначенныхКомиссий.ДоговорКонтрагента = &Договор
	|				ИЛИ &Договор = НЕОПРЕДЕЛЕНО)
	|			И РегистрНазначенныхКомиссий.ДоговорКонтрагента.ДатаНачалоДействия <= Календарь.Период
	|			И (РегистрНазначенныхКомиссий.ДоговорКонтрагента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрНазначенныхКомиссий.ДоговорКонтрагента,
	|	РегистрНазначенныхКомиссий.Услуга,
	|	Календарь.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Комиссии.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Комиссии.Услуга КАК Услуга
	|ПОМЕСТИТЬ СписокКлиентов
	|ИЗ
	|	РегистрСведений.РегистрНазначенныхКомиссий КАК Комиссии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНазначенныхКомиссийПоКалендарю КАК РегистрНазначенныхКомиссийПоКалендарю
	|		ПО Комиссии.Период = РегистрНазначенныхКомиссийПоКалендарю.ПериодНазначенияКомиссии
	|			И Комиссии.ДоговорКонтрагента = РегистрНазначенныхКомиссийПоКалендарю.ДоговорКонтрагента
	|			И Комиссии.Услуга = РегистрНазначенныхКомиссийПоКалендарю.Услуга
	|			И (Комиссии.ФлагАктивности)
	|			И (Комиссии.ДоговорКонтрагента.ДатаНачалоДействия <= &Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	Комиссии.ДоговорКонтрагента,
	|	Комиссии.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Комиссии.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РегистрНазначенныхКомиссийПоКалендарю.ПредварительнаяДатаРасчетаКомиссии КАК Период
	|ПОМЕСТИТЬ КалендарьПоДоговору
	|ИЗ
	|	РегистрСведений.РегистрНазначенныхКомиссий КАК Комиссии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНазначенныхКомиссийПоКалендарю КАК РегистрНазначенныхКомиссийПоКалендарю
	|		ПО Комиссии.Период = РегистрНазначенныхКомиссийПоКалендарю.ПериодНазначенияКомиссии
	|			И Комиссии.ДоговорКонтрагента = РегистрНазначенныхКомиссийПоКалендарю.ДоговорКонтрагента
	|			И Комиссии.Услуга = РегистрНазначенныхКомиссийПоКалендарю.Услуга
	|			И (Комиссии.ФлагАктивности)
	|			И (Комиссии.ДоговорКонтрагента.ДатаНачалоДействия <= &Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиИОборотыЦБ.Период КАК Период,
	|	ОстаткиИОборотыЦБ.ЦБ КАК ЦБ,
	|	ОстаткиИОборотыЦБ.ЦБ.ТипЦБ КАК ЦБТипЦБ,
	|	ОстаткиИОборотыЦБ.ЦБ.ДатаПогашения КАК ЦБДатаПогашения,
	|	ОстаткиИОборотыЦБ.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	ОстаткиИОборотыЦБ.СчетДепо КАК СчетДепо,
	|	ОстаткиИОборотыЦБ.СчетДепо.Владелец КАК СчетДепоВладелец,
	|	НЕОПРЕДЕЛЕНО КАК Выгодоприобретатель
	|ПОМЕСТИТЬ ВТ_ОстаткиИОборотыЦБ
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
	|			День,
	|			,
	|			НЕ СчетДепо.Владелец.Субброкер
	|				И &УсловиеОтбораПоМестуХранения
	|				И &УсловиеОтбораПоВидамЦББанкаРоссии
	|				И СчетДепо.Владелец В
	|					(ВЫБРАТЬ
	|						СписокКлиентов.ДоговорКонтрагента.Владелец КАК Клиент
	|					ИЗ
	|						СписокКлиентов КАК СписокКлиентов)
	|				И ВЫБОР
	|					КОГДА ЕСТЬNULL(&Субклиент, ЗНАЧЕНИЕ(Справочник.Субклиенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Субклиенты.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК ОстаткиИОборотыЦБ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиИОборотыЦБ.Период,
	|	ОстаткиИОборотыЦБ.ЦБ,
	|	ОстаткиИОборотыЦБ.ЦБ.ТипЦБ,
	|	ОстаткиИОборотыЦБ.ЦБ.ДатаПогашения,
	|	ОстаткиИОборотыЦБ.КоличествоКонечныйОстаток,
	|	ОстаткиИОборотыЦБ.СчетДепо,
	|	ОстаткиИОборотыЦБ.СчетДепо.Владелец,
	|	ОстаткиИОборотыЦБ.РазделСчетаДепо.Субклиент
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
	|			День,
	|			,
	|			СчетДепо.Владелец.Субброкер
	|				И &УсловиеОтбораПоМестуХранения
	|				И &УсловиеОтбораПоВидамЦББанкаРоссии
	|				И СчетДепо.Владелец В
	|					(ВЫБРАТЬ
	|						СписокКлиентов.ДоговорКонтрагента.Владелец КАК Клиент
	|					ИЗ
	|						СписокКлиентов КАК СписокКлиентов)
	|				И (РазделСчетаДепо.Субклиент = &Субклиент
	|					ИЛИ ЕСТЬNULL(&Субклиент, ЗНАЧЕНИЕ(Справочник.Субклиенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Субклиенты.ПустаяСсылка))) КАК ОстаткиИОборотыЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиИОборотыЦБ.Период КАК Период,
	|	ОстаткиИОборотыЦБ.ЦБ КАК ЦБ,
	|	ВЫБОР
	|		КОГДА ОстаткиИОборотыЦБ.ЦБТипЦБ = &ТипЦБОблигация
	|				И ОстаткиИОборотыЦБ.ЦБДатаПогашения <= НАЧАЛОПЕРИОДА(ОстаткиИОборотыЦБ.Период, КВАРТАЛ)
	|				И НЕ ОстаткиИОборотыЦБ.ЦБДатаПогашения = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		ИНАЧЕ ОстаткиИОборотыЦБ.КоличествоКонечныйОстаток
	|	КОНЕЦ КАК КоличествоКонечныйОстаток,
	|	СписокКлиентов.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ОстаткиИОборотыЦБ.СчетДепо КАК СчетДепо,
	|	ОстаткиИОборотыЦБ.Выгодоприобретатель КАК Выгодоприобретатель
	|ПОМЕСТИТЬ ОстаткиПоСчетамДЕПО
	|ИЗ
	|	СписокКлиентов КАК СписокКлиентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОстаткиИОборотыЦБ КАК ОстаткиИОборотыЦБ
	|		ПО СписокКлиентов.ДоговорКонтрагента.Владелец = ОстаткиИОборотыЦБ.СчетДепоВладелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Календарь.Период КАК Период,
	|	МАКСИМУМ(ОстаткиПоСчетамДЕПО.Период) КАК ПериодРасчета,
	|	ОстаткиПоСчетамДЕПО.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ОстаткиПоСчетамДЕПО.СчетДепо КАК СчетДепо,
	|	ОстаткиПоСчетамДЕПО.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ОстаткиПоСчетамДЕПО.ЦБ КАК ЦБ
	|ПОМЕСТИТЬ ТаблицаРаспределенияПериодовПоДням
	|ИЗ
	|	КалендарьПоДоговору КАК Календарь
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиПоСчетамДЕПО КАК ОстаткиПоСчетамДЕПО
	|		ПО Календарь.Период >= ОстаткиПоСчетамДЕПО.Период
	|			И Календарь.ДоговорКонтрагента = ОстаткиПоСчетамДЕПО.ДоговорКонтрагента
	|
	|СГРУППИРОВАТЬ ПО
	|	Календарь.Период,
	|	ОстаткиПоСчетамДЕПО.ДоговорКонтрагента,
	|	ОстаткиПоСчетамДЕПО.СчетДепо,
	|	ОстаткиПоСчетамДЕПО.Выгодоприобретатель,
	|	ОстаткиПоСчетамДЕПО.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРаспределенияПериодовПоДням.Период КАК Период,
	|	ТаблицаРаспределенияПериодовПоДням.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаРаспределенияПериодовПоДням.СчетДепо КАК СчетДепо,
	|	ТаблицаРаспределенияПериодовПоДням.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ТаблицаРаспределенияПериодовПоДням.ЦБ КАК ЦБ,
	|	ВЫБОР
	|		КОГДА ОстаткиПоСчетамДЕПО.ЦБ.ТипЦБ = &ТипЦБОблигация
	|				И ОстаткиПоСчетамДЕПО.ЦБ.ДатаПогашения <= НАЧАЛОПЕРИОДА(ТаблицаРаспределенияПериодовПоДням.Период, КВАРТАЛ)
	|				И НЕ ОстаткиПоСчетамДЕПО.ЦБ.ДатаПогашения = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		ИНАЧЕ ОстаткиПоСчетамДЕПО.КоличествоКонечныйОстаток
	|	КОНЕЦ КАК Количество
	|ПОМЕСТИТЬ ТаблицаОстатковРаспределеннаяПоДням
	|ИЗ
	|	ТаблицаРаспределенияПериодовПоДням КАК ТаблицаРаспределенияПериодовПоДням
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиПоСчетамДЕПО КАК ОстаткиПоСчетамДЕПО
	|		ПО ТаблицаРаспределенияПериодовПоДням.ПериодРасчета = ОстаткиПоСчетамДЕПО.Период
	|			И ТаблицаРаспределенияПериодовПоДням.ДоговорКонтрагента = ОстаткиПоСчетамДЕПО.ДоговорКонтрагента
	|			И ТаблицаРаспределенияПериодовПоДням.СчетДепо = ОстаткиПоСчетамДЕПО.СчетДепо
	|			И ТаблицаРаспределенияПериодовПоДням.Выгодоприобретатель = ОстаткиПоСчетамДЕПО.Выгодоприобретатель
	|			И ТаблицаРаспределенияПериодовПоДням.ЦБ = ОстаткиПоСчетамДЕПО.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОстатковРаспределеннаяПоДням.Период КАК Период,
	|	ТаблицаОстатковРаспределеннаяПоДням.ЦБ КАК ЦБ
	|ПОМЕСТИТЬ ТаблицаЦБПоДатамПриНаличииОстатков
	|ИЗ
	|	ТаблицаОстатковРаспределеннаяПоДням КАК ТаблицаОстатковРаспределеннаяПоДням
	|ГДЕ
	|	ТаблицаОстатковРаспределеннаяПоДням.Количество <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЦБПоДатамПриНаличииОстатков.Период КАК Период,
	|	ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ КАК ЦБ,
	|	МАКСИМУМ(Котировки.Период) КАК ПериодКотировки
	|ПОМЕСТИТЬ ТаблицаДатКотировок
	|ИЗ
	|	ТаблицаЦБПоДатамПриНаличииОстатков КАК ТаблицаЦБПоДатамПриНаличииОстатков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Котировки КАК Котировки
	|		ПО ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ = Котировки.ЦеннаяБумага
	|			И ТаблицаЦБПоДатамПриНаличииОстатков.Период >= Котировки.Период
	|			И (ТаблицаЦБПоДатамПриНаличииОстатков.Период <= ДОБАВИТЬКДАТЕ(Котировки.Период, ДЕНЬ, 90))
	|			И (Котировки.РыночнаяЦена > 0)
	|			И (Котировки.Биржа = &НРД)
	|			И (Котировки.РежимТоргов.РежимТоргов = &РежимТорговРыночный)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦБПоДатамПриНаличииОстатков.Период,
	|	ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДатКотировок.Период КАК Период,
	|	ТаблицаДатКотировок.ЦБ КАК ЦБ,
	|	ЕСТЬNULL(МАКСИМУМ(Котировки.РыночнаяЦена), 0) КАК РыночнаяЦена
	|ПОМЕСТИТЬ ТаблицаРыночныхЦенНаДатыОстатков
	|ИЗ
	|	ТаблицаДатКотировок КАК ТаблицаДатКотировок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Котировки КАК Котировки
	|		ПО ТаблицаДатКотировок.ПериодКотировки = Котировки.Период
	|			И ТаблицаДатКотировок.ЦБ = Котировки.ЦеннаяБумага
	|			И (Котировки.Биржа = &НРД)
	|			И (Котировки.РежимТоргов.РежимТоргов = &РежимТорговРыночный)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДатКотировок.Период,
	|	ТаблицаДатКотировок.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОстатковРаспределеннаяПоДням.Период КАК Период,
	|	ТаблицаОстатковРаспределеннаяПоДням.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаОстатковРаспределеннаяПоДням.СчетДепо КАК СчетДепо,
	|	ТаблицаОстатковРаспределеннаяПоДням.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ТаблицаОстатковРаспределеннаяПоДням.ЦБ КАК ЦБ,
	|	ТаблицаОстатковРаспределеннаяПоДням.Количество КАК Количество,
	|	ЕСТЬNULL(ТаблицаРыночныхЦенНаДатыОстатков.РыночнаяЦена, 0) КАК РыночнаяЦена
	|ПОМЕСТИТЬ ТаблицаОстатковЗаКаждыйДеньВключаяКотировки
	|ИЗ
	|	ТаблицаОстатковРаспределеннаяПоДням КАК ТаблицаОстатковРаспределеннаяПоДням
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРыночныхЦенНаДатыОстатков КАК ТаблицаРыночныхЦенНаДатыОстатков
	|		ПО ТаблицаОстатковРаспределеннаяПоДням.Период = ТаблицаРыночныхЦенНаДатыОстатков.Период
	|			И ТаблицаОстатковРаспределеннаяПоДням.ЦБ = ТаблицаРыночныхЦенНаДатыОстатков.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.Период КАК Период,
	|	ИтоговаяТаблица.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ИтоговаяТаблица.СчетДепо КАК СчетДепо,
	|	ИтоговаяТаблица.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ИтоговаяТаблица.ЦБ КАК ЦБ,
	|	ИтоговаяТаблица.Количество КАК Количество,
	|	ИтоговаяТаблица.РыночнаяЦена КАК РыночнаяЦена,
	|	ВЫБОР
	|		КОГДА ИтоговаяТаблица.РыночнаяЦена > 0
	|			ТОГДА ИтоговаяТаблица.РыночнаяЦена * ИтоговаяТаблица.Количество
	|		КОГДА ИтоговаяТаблица.Количество > 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Оценка
	|ПОМЕСТИТЬ ИтоговаяТаблицаРасчета
	|ИЗ
	|	ТаблицаОстатковЗаКаждыйДеньВключаяКотировки КАК ИтоговаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблицаРасчета.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ИтоговаяТаблицаРасчета.Выгодоприобретатель КАК Выгодоприобретатель,
	|	СУММА(ИтоговаяТаблицаРасчета.Оценка) КАК Оценка,
	|	ИтоговаяТаблицаРасчета.Период КАК Период
	|ПОМЕСТИТЬ ИтоговаяОценкаПоДоговорамПоДням
	|ИЗ
	|	ИтоговаяТаблицаРасчета КАК ИтоговаяТаблицаРасчета
	|ГДЕ
	|	(ИтоговаяТаблицаРасчета.РыночнаяЦена = 0
	|				И &ТипРасчета В (&ТипыРасчетаДляНулевойРыночнойЦены)
	|			ИЛИ ИтоговаяТаблицаРасчета.РыночнаяЦена > 0
	|				И &ТипРасчета В (&ТипыРасчетаДляНенулевойРыночнойЦены))
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтоговаяТаблицаРасчета.ДоговорКонтрагента,
	|	ИтоговаяТаблицаРасчета.Выгодоприобретатель,
	|	ИтоговаяТаблицаРасчета.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяОценкаПоДоговорам.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ИтоговаяОценкаПоДоговорам.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ИтоговаяОценкаПоДоговорам.Оценка КАК Оценка,
	|	ИтоговаяОценкаПоДоговорам.Период КАК Дата
	|ПОМЕСТИТЬ ИтоговаяОценкаПоДоговорам
	|ИЗ
	|	ИтоговаяОценкаПоДоговорамПоДням КАК ИтоговаяОценкаПоДоговорам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяОценкаПоДоговорам.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ИтоговаяОценкаПоДоговорам.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ИтоговаяОценкаПоДоговорам.Оценка КАК Оценка,
	|	МИНИМУМ(ТарифыСрезПоследних.Шкала) КАК Шкала,
	|	ИтоговаяОценкаПоДоговорам.Дата КАК Дата
	|ПОМЕСТИТЬ ОценкаПоДоговорамИШкала
	|ИЗ
	|	ИтоговаяОценкаПоДоговорам КАК ИтоговаяОценкаПоДоговорам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Тарифы.СрезПоследних(&Период, Услуга = &Услуга) КАК ТарифыСрезПоследних
	|		ПО ИтоговаяОценкаПоДоговорам.Оценка <= ТарифыСрезПоследних.Шкала
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтоговаяОценкаПоДоговорам.ДоговорКонтрагента,
	|	ИтоговаяОценкаПоДоговорам.Выгодоприобретатель,
	|	ИтоговаяОценкаПоДоговорам.Оценка,
	|	ИтоговаяОценкаПоДоговорам.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОценкаПоДоговорамИШкала.Дата КАК Дата,
	|	ОценкаПоДоговорамИШкала.ДоговорКонтрагента КАК Договор,
	|	ОценкаПоДоговорамИШкала.Выгодоприобретатель КАК Выгодоприобретатель,
	|	ИтоговаяТаблицаРасчета.ЦБ КАК ЦБ,
	|	ИтоговаяТаблицаРасчета.ЦБ.ISIN КАК ISIN,
	|	ИтоговаяТаблицаРасчета.ЦБ.ВидЦББанкаРоссии КАК ВидЦБ,
	|	ИтоговаяТаблицаРасчета.Количество КАК Количество,
	|	ИтоговаяТаблицаРасчета.РыночнаяЦена КАК РыночнаяЦена,
	|	ИтоговаяТаблицаРасчета.Оценка КАК Оценка,
	|	ОценкаПоДоговорамИШкала.Оценка КАК Сумма,
	|	&Услуга КАК Комиссия,
	|	ТарифыСрезПоследних.ТипТарифа КАК ТипТарифа,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ОценкаПоДоговорамИШкала.Дата, МЕСЯЦ), КОНЕЦПЕРИОДА(ОценкаПоДоговорамИШкала.Дата, МЕСЯЦ), ДЕНЬ) + 1 КАК РазностьДат,
	|	ВЫБОР
	|		КОГДА ТарифыСрезПоследних.ТипТарифа = &ТарифФиксированнаяСумма
	|			ТОГДА ТарифыСрезПоследних.Тариф
	|		ИНАЧЕ ТарифыСрезПоследних.Тариф / 100
	|	КОНЕЦ КАК Тариф,
	|	ВЫБОР
	|		КОГДА ТарифыСрезПоследних.ТипТарифа = &ТарифФиксированнаяСумма
	|			ТОГДА ОценкаПоДоговорамИШкала.Оценка / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ОценкаПоДоговорамИШкала.Дата, МЕСЯЦ), КОНЕЦПЕРИОДА(ОценкаПоДоговорамИШкала.Дата, МЕСЯЦ), ДЕНЬ) + 1) * ТарифыСрезПоследних.Тариф
	|		КОГДА ТарифыСрезПоследних.ТипТарифа = &ТарифПроцентОтНачисления
	|			ТОГДА ОценкаПоДоговорамИШкала.Оценка / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ОценкаПоДоговорамИШкала.Дата, МЕСЯЦ), КОНЕЦПЕРИОДА(ОценкаПоДоговорамИШкала.Дата, МЕСЯЦ), ДЕНЬ) + 1) * ТарифыСрезПоследних.Тариф / 100
	|	КОНЕЦ КАК СуммаКомиссии
	|ИЗ
	|	ОценкаПоДоговорамИШкала КАК ОценкаПоДоговорамИШкала
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Тарифы.СрезПоследних(&Период, Услуга = &Услуга) КАК ТарифыСрезПоследних
	|		ПО ОценкаПоДоговорамИШкала.Шкала = ТарифыСрезПоследних.Шкала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтоговаяТаблицаРасчета КАК ИтоговаяТаблицаРасчета
	|		ПО ОценкаПоДоговорамИШкала.ДоговорКонтрагента = ИтоговаяТаблицаРасчета.ДоговорКонтрагента
	|			И ОценкаПоДоговорамИШкала.Дата = ИтоговаяТаблицаРасчета.Период
	|			И ОценкаПоДоговорамИШкала.Выгодоприобретатель = ИтоговаяТаблицаРасчета.Выгодоприобретатель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Выгодоприобретатель,
	|	Дата");
	
	Запрос.УстановитьПараметр("НачалоПериода",	ДатаНачалаПериодаРасчета(Дата, ПериодРасчета));
	Запрос.УстановитьПараметр("Период",			Дата);
	Запрос.УстановитьПараметр("ПериодРасчета",	ПериодРасчета);
	Запрос.УстановитьПараметр("ДепозитарнаяКомиссия",	Перечисления.ВидыКомиссий.Депозитарная);
	Запрос.УстановитьПараметр("ТипЦБОблигация",			Перечисления.ТипыЦБ.Облигация);
	Запрос.УстановитьПараметр("РежимТорговРыночный",	Перечисления.РежимыТоргов.Рыночная);
	
	ТипыРасчетаДляНулевойРыночнойЦены = Новый Массив;
	ТипыРасчетаДляНулевойРыночнойЦены.Добавить(Перечисления.ТипыРасчетаУслуги.ОстатокПоВыпуску);
	Запрос.УстановитьПараметр("ТипыРасчетаДляНулевойРыночнойЦены", ТипыРасчетаДляНулевойРыночнойЦены);
	
	ТипыРасчетаДляНенулевойРыночнойЦены = Новый Массив;
	ТипыРасчетаДляНенулевойРыночнойЦены.Добавить(Перечисления.ТипыРасчетаУслуги.ОстатокПоРыночнойСтоимости);
	ТипыРасчетаДляНенулевойРыночнойЦены.Добавить(Перечисления.ТипыРасчетаУслуги.ОценкаРыночнойСтоимостиЗаМесяц);
	Запрос.УстановитьПараметр("ТипыРасчетаДляНенулевойРыночнойЦены", ТипыРасчетаДляНенулевойРыночнойЦены);
	
	Запрос.УстановитьПараметр("ТарифФиксированнаяСумма",	Перечисления.ТипыТарифов.ФиксированнаяСумма);
	Запрос.УстановитьПараметр("ТарифПроцентОтНачисления",	Перечисления.ТипыТарифов.ПроцентОтНачисления);
	
	Запрос.УстановитьПараметр("Валюта",			Услуга.Валюта);
	Запрос.УстановитьПараметр("Договор",		Договор);
	Запрос.УстановитьПараметр("ТипРасчета",		Услуга.ТипРасчета);
	Запрос.УстановитьПараметр("Услуга",			Услуга);
	Запрос.УстановитьПараметр("Субклиент",		Субклиент);
		
	Если ЗначениеЗаполнено(Услуга) И ЗначениеЗаполнено(Услуга.МестоХранения1) Тогда
		Запрос.УстановитьПараметр("НРД", Услуга.МестоХранения1);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораПоМестуХранения", "СчетДепоМХ.Владелец В (&МестаХранения)");
		Запрос.УстановитьПараметр("МестаХранения", Справочники.УслугиТарифногоПлана.МестаХраненияДляПолученияОстатков(Услуга));
	Иначе
		Запрос.УстановитьПараметр("НРД", Константы.МестоХраненияПоУмолчанию.Получить());
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораПоМестуХранения", "1 = 1");
	КонецЕсли;
	
	УстановитьОтборПоВидамЦБЕслиНужно(Запрос, Услуга.ТипРасчета, Услуга.ОтборПоВидуЦБ, Услуга.ИсключатьПриОтбореПеречисленныеВидыЦБ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Возвращает доступна ли для данного типа расчета возможность отбора по типу ЦБ банка России
//
// Параметры:
// 	ТипРасчета - ПеречислениеСсылка.ТипыРасчетаУслуги
//
// Возвращаемое значение:
//	Булево
Функция ДоступенОтборПоВидуЦББанкаРоссии(ТипРасчета) Экспорт
	ДоступенОтборПоТипуЦБ = (ТипРасчета = Перечисления.ТипыРасчетаУслуги.ОстатокПоРыночнойСтоимости)
							Или (ТипРасчета = Перечисления.ТипыРасчетаУслуги.ОстатокПоВыпуску)
							Или (ТипРасчета = Перечисления.ТипыРасчетаУслуги.ОценкаРыночнойСтоимостиЗаМесяц);
	Возврат ДоступенОтборПоТипуЦБ;
КонецФункции

Процедура УстановитьОтборПоВидамЦБЕслиНужно(Запрос, ТипРасчета, ТЧОтборПоВидуЦБ, ИсключатьПриОтбореПеречисленныеВидыЦБ)
	ШаблонУсловияОтбораПоВидамЦБ = "&УсловиеОтбораПоВидамЦББанкаРоссии";
	Если ДоступенОтборПоВидуЦББанкаРоссии(ТипРасчета) И ТЧОтборПоВидуЦБ.Количество() > 0 Тогда
		ВидыЦБ = ТЧОтборПоВидуЦБ.ВыгрузитьКолонку("ВидЦББанкаРоссии");
		Запрос.УстановитьПараметр("ВидыЦББанкаРоссии", ВидыЦБ);
		ТекстУсловияОтбораПоВидамЦБ = "ЦБ.ВидЦББанкаРоссии В (&ВидыЦББанкаРоссии)";
		Если ИсключатьПриОтбореПеречисленныеВидыЦБ Тогда
			ТекстУсловияОтбораПоВидамЦБ = "НЕ " + ТекстУсловияОтбораПоВидамЦБ;
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ШаблонУсловияОтбораПоВидамЦБ, ТекстУсловияОтбораПоВидамЦБ);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ШаблонУсловияОтбораПоВидамЦБ, "1 = 1");
	КонецЕсли;
КонецПроцедуры

Функция ДатаНачалаПериодаРасчета(Период, ПериодРасчета)
	Если ПериодРасчета = Перечисления.ВариантыНачисленияКомиссий.Месяц Тогда
		НачалоПериода = НачалоМесяца(Период);
	ИначеЕсли ПериодРасчета = Перечисления.ВариантыНачисленияКомиссий.Квартал Тогда
		НачалоПериода = НачалоКвартала(Период);
	ИначеЕсли ПериодРасчета = Перечисления.ВариантыНачисленияКомиссий.Полугодие Тогда
		НачалоПериода = ?(Месяц(Период) <= 6, НачалоГода(Период), Дата(Год(Период), 7, 1));
	ИначеЕсли ПериодРасчета = Перечисления.ВариантыНачисленияКомиссий.Год Тогда
		НачалоПериода = НачалоГода(Период);
	Иначе
		НачалоПериода = Период;
	КонецЕсли;
	Возврат НачалоПериода;
КонецФункции

Функция ДатаОкончанияПериодаРасчета(Период, ПериодРасчета)
	Если ПериодРасчета = Перечисления.ВариантыНачисленияКомиссий.Месяц Тогда
		КонецПериода = КонецМесяца(Период);
	ИначеЕсли ПериодРасчета = Перечисления.ВариантыНачисленияКомиссий.Квартал Тогда
		КонецПериода = КонецКвартала(Период);
	ИначеЕсли ПериодРасчета = Перечисления.ВариантыНачисленияКомиссий.Полугодие Тогда
		КонецПериода = ?(Месяц(Период) <= 6, КонецДня(Дата(Год(Период), 6, 30)), КонецГода(Период));
	ИначеЕсли ПериодРасчета = Перечисления.ВариантыНачисленияКомиссий.Год Тогда
		КонецПериода = КонецГода(Период);
	Иначе
		КонецПериода = Период;
	КонецЕсли;
	Возврат КонецПериода;
КонецФункции

//Функция РасчетОстаткаПоРыночнойСтоимости(Дата, ЗНАЧ Договор = НЕОПРЕДЕЛЕНО, Услуга)
//	
//	Перем СуммаРасчета;
//	
//	Если Договор.ДатаНачалоДействия > КонецМесяца(Дата) Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	СуммаРасчета = 0;
//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ
//	|	Календарь.Период
//	|ПОМЕСТИТЬ Календарь
//	|ИЗ
//	|	РегистрСведений.Календарь КАК Календарь
//	|ГДЕ
//	|	Календарь.Период <= &Период
//	|	И Календарь.Период >= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РегистрНазначенныхКомиссийСрезПоследних.ДоговорКонтрагента,
//	|	РегистрНазначенныхКомиссийСрезПоследних.Услуга
//	|ПОМЕСТИТЬ СписокКлиентов
//	|ИЗ
//	|	РегистрСведений.РегистрНазначенныхКомиссий.СрезПоследних(
//	|			&Период,
//	|			Услуга.ПериодРасчета = ЗНАЧЕНИЕ(Перечисление.ВариантыНачисленияКомиссий.Месяц)
//	|				И Услуга.ВидКомиссии = ЗНАЧЕНИЕ(Перечисление.ВидыКомиссий.Депозитарная)
//	|				И Услуга.ТипРасчета = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаУслуги.ОстатокПоВыпуску)
//	|				И ДоговорКонтрагента = &Договор) КАК РегистрНазначенныхКомиссийСрезПоследних
//	|ГДЕ
//	|	РегистрНазначенныхКомиссийСрезПоследних.ФлагАктивности = ИСТИНА
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ОстаткиЦБОстаткиИОбороты.Период,
//	|	ОстаткиЦБОстаткиИОбороты.ЦБ,
//	|	ОстаткиЦБОстаткиИОбороты.КоличествоКонечныйОстаток,
//	|	СписокКлиентов.ДоговорКонтрагента,
//	|	ОстаткиЦБОстаткиИОбороты.СчетДепо
//	|ПОМЕСТИТЬ ОстаткиПоСчетамДЕПО
//	|ИЗ
//	|	СписокКлиентов КАК СписокКлиентов
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦБ.ОстаткиИОбороты(
//	|				НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ),
//	|				КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
//	|				День,
//	|				,
//	|				ЦБ.ТипЦБ <> ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
//	|					ИЛИ ЦБ.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
//	|						И ЦБ.ДатаПогашения >= НАЧАЛОПЕРИОДА(&Период, КВАРТАЛ)) КАК ОстаткиЦБОстаткиИОбороты
//	|		ПО СписокКлиентов.ДоговорКонтрагента.Владелец = ОстаткиЦБОстаткиИОбороты.СчетДепо.Владелец
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Календарь.Период КАК Период,
//	|	МАКСИМУМ(ОстаткиПоСчетамДЕПО.Период) КАК ПериодРасчета,
//	|	ОстаткиПоСчетамДЕПО.ДоговорКонтрагента КАК ДоговорКонтрагента,
//	|	ОстаткиПоСчетамДЕПО.СчетДепо КАК СчетДепо,
//	|	ОстаткиПоСчетамДЕПО.ЦБ КАК ЦБ
//	|ПОМЕСТИТЬ ТаблицаРаспределенияПериодовПоДням
//	|ИЗ
//	|	Календарь КАК Календарь
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиПоСчетамДЕПО КАК ОстаткиПоСчетамДЕПО
//	|		ПО Календарь.Период >= ОстаткиПоСчетамДЕПО.Период
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Календарь.Период,
//	|	ОстаткиПоСчетамДЕПО.ДоговорКонтрагента,
//	|	ОстаткиПоСчетамДЕПО.СчетДепо,
//	|	ОстаткиПоСчетамДЕПО.ЦБ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаРаспределенияПериодовПоДням.Период КАК Период,
//	|	ТаблицаРаспределенияПериодовПоДням.ДоговорКонтрагента КАК ДоговорКонтрагента,
//	|	ТаблицаРаспределенияПериодовПоДням.СчетДепо КАК СчетДепо,
//	|	ТаблицаРаспределенияПериодовПоДням.ЦБ КАК ЦБ,
//	|	ОстаткиПоСчетамДЕПО.КоличествоКонечныйОстаток КАК Количество
//	|ПОМЕСТИТЬ ТаблицаОстатковРаспределеннаяПоДням
//	|ИЗ
//	|	ТаблицаРаспределенияПериодовПоДням КАК ТаблицаРаспределенияПериодовПоДням
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиПоСчетамДЕПО КАК ОстаткиПоСчетамДЕПО
//	|		ПО ТаблицаРаспределенияПериодовПоДням.ПериодРасчета = ОстаткиПоСчетамДЕПО.Период
//	|			И ТаблицаРаспределенияПериодовПоДням.ДоговорКонтрагента = ОстаткиПоСчетамДЕПО.ДоговорКонтрагента
//	|			И ТаблицаРаспределенияПериодовПоДням.СчетДепо = ОстаткиПоСчетамДЕПО.СчетДепо
//	|			И ТаблицаРаспределенияПериодовПоДням.ЦБ = ОстаткиПоСчетамДЕПО.ЦБ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ТаблицаОстатковРаспределеннаяПоДням.Период КАК Период,
//	|	ТаблицаОстатковРаспределеннаяПоДням.ЦБ КАК ЦБ
//	|ПОМЕСТИТЬ ТаблицаЦБПоДатамПриНаличииОстатков
//	|ИЗ
//	|	ТаблицаОстатковРаспределеннаяПоДням КАК ТаблицаОстатковРаспределеннаяПоДням
//	|ГДЕ
//	|	ТаблицаОстатковРаспределеннаяПоДням.Количество <> 0
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаЦБПоДатамПриНаличииОстатков.Период,
//	|	ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ,
//	|	МАКСИМУМ(Котировки.Период) КАК ПериодКотировки
//	|ПОМЕСТИТЬ ТаблицаДатКотировок
//	|ИЗ
//	|	ТаблицаЦБПоДатамПриНаличииОстатков КАК ТаблицаЦБПоДатамПриНаличииОстатков
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Котировки КАК Котировки
//	|		ПО ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ = Котировки.ЦеннаяБумага
//	|			И ТаблицаЦБПоДатамПриНаличииОстатков.Период >= Котировки.Период
//	|			И (ТаблицаЦБПоДатамПриНаличииОстатков.Период <= ДОБАВИТЬКДАТЕ(Котировки.Период, ДЕНЬ, 90))
//	|			И (Котировки.РыночнаяЦена > 0)
//	|			И (Котировки.РежимТоргов.РежимТоргов = ЗНАЧЕНИЕ(Перечисление.Режимыторгов.Рыночная))
//	|ГДЕ
//	|	Котировки.Биржа = &НРД
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаЦБПоДатамПриНаличииОстатков.Период,
//	|	ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаДатКотировок.Период,
//	|	ТаблицаДатКотировок.ЦБ,
//	|	МАКСИМУМ(Котировки.РыночнаяЦена) КАК РыночнаяЦена
//	|ПОМЕСТИТЬ ТаблицаРыночныхЦенНаДатыОстатков
//	|ИЗ
//	|	ТаблицаДатКотировок КАК ТаблицаДатКотировок
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Котировки КАК Котировки
//	|		ПО ТаблицаДатКотировок.ПериодКотировки = Котировки.Период
//	|			И ТаблицаДатКотировок.ЦБ = Котировки.ЦеннаяБумага
//	|			И (Котировки.РежимТоргов.РежимТоргов = ЗНАЧЕНИЕ(Перечисление.РежимыТоргов.Рыночная))
//	|ГДЕ
//	|	Котировки.Биржа = &НРД
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаДатКотировок.Период,
//	|	ТаблицаДатКотировок.ЦБ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаОстатковРаспределеннаяПоДням.Период КАК Период,
//	|	ТаблицаОстатковРаспределеннаяПоДням.ДоговорКонтрагента КАК ДоговорКонтрагента,
//	|	ТаблицаОстатковРаспределеннаяПоДням.СчетДепо КАК СчетДепо,
//	|	ТаблицаОстатковРаспределеннаяПоДням.ЦБ КАК ЦБ,
//	|	ТаблицаОстатковРаспределеннаяПоДням.Количество,
//	|	ТаблицаРыночныхЦенНаДатыОстатков.РыночнаяЦена
//	|ПОМЕСТИТЬ ТаблицаОстатковЗаКаждыйДеньВключаяКотировки
//	|ИЗ
//	|	ТаблицаОстатковРаспределеннаяПоДням КАК ТаблицаОстатковРаспределеннаяПоДням
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРыночныхЦенНаДатыОстатков КАК ТаблицаРыночныхЦенНаДатыОстатков
//	|		ПО ТаблицаОстатковРаспределеннаяПоДням.Период = ТаблицаРыночныхЦенНаДатыОстатков.Период
//	|			И ТаблицаОстатковРаспределеннаяПоДням.ЦБ = ТаблицаРыночныхЦенНаДатыОстатков.ЦБ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаЦБПоДатамПриНаличииОстатков.Период,
//	|	ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ,
//	|	МАКСИМУМ(НоминалЦБ.Период) КАК ПериодНоминала
//	|ПОМЕСТИТЬ ТаблицаПериодовНоминала
//	|ИЗ
//	|	ТаблицаЦБПоДатамПриНаличииОстатков КАК ТаблицаЦБПоДатамПриНаличииОстатков
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ КАК НоминалЦБ
//	|		ПО ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ = НоминалЦБ.ЦеннаяБумага
//	|			И ТаблицаЦБПоДатамПриНаличииОстатков.Период >= НоминалЦБ.Период
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаЦБПоДатамПриНаличииОстатков.Период,
//	|	ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаПериодовНоминала.Период,
//	|	ТаблицаПериодовНоминала.ЦБ,
//	|	НоминалЦБ.Сумма КАК Номинал,
//	|	НоминалЦБ.ЦеннаяБумага.ВалютаНоминала КАК ВалютаНоминала,
//	|	КурсыВалютСрезПоследних.Курс,
//	|	КурсыВалютСрезПоследних.Кратность
//	|ПОМЕСТИТЬ ТаблицаЗначенийНоминала
//	|ИЗ
//	|	ТаблицаПериодовНоминала КАК ТаблицаПериодовНоминала
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ КАК НоминалЦБ
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
//	|			ПО НоминалЦБ.ЦеннаяБумага.ВалютаНоминала = КурсыВалютСрезПоследних.Валюта
//	|		ПО ТаблицаПериодовНоминала.ПериодНоминала = НоминалЦБ.Период
//	|			И ТаблицаПериодовНоминала.ЦБ = НоминалЦБ.ЦеннаяБумага
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.Период,
//	|	ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.ДоговорКонтрагента,
//	|	ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.СчетДепо,
//	|	ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.ЦБ,
//	|	ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.Количество,
//	|	ЕСТЬNULL(ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.РыночнаяЦена, 0) КАК РыночнаяЦена,
//	|	ТаблицаЗначенийНоминала.Номинал,
//	|	ТаблицаЗначенийНоминала.ВалютаНоминала,
//	|	ТаблицаЗначенийНоминала.Курс,
//	|	ТаблицаЗначенийНоминала.Кратность
//	|ПОМЕСТИТЬ ИтоговаяТаблицаОстатков
//	|ИЗ
//	|	ТаблицаОстатковЗаКаждыйДеньВключаяКотировки КАК ТаблицаОстатковЗаКаждыйДеньВключаяКотировки
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗначенийНоминала КАК ТаблицаЗначенийНоминала
//	|		ПО ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.Период = ТаблицаЗначенийНоминала.Период
//	|			И ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.ЦБ = ТаблицаЗначенийНоминала.ЦБ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ИтоговаяТаблица.Период,
//	|	ИтоговаяТаблица.ДоговорКонтрагента,
//	|	ИтоговаяТаблица.СчетДепо,
//	|	ИтоговаяТаблица.ЦБ,
//	|	ИтоговаяТаблица.Количество,
//	|	ИтоговаяТаблица.РыночнаяЦена,
//	|	ИтоговаяТаблица.Номинал,
//	|	ИтоговаяТаблица.ВалютаНоминала,
//	|	ИтоговаяТаблица.Курс,
//	|	ИтоговаяТаблица.Кратность,
//	|	ВЫБОР
//	|		КОГДА ИтоговаяТаблица.РыночнаяЦена = 0
//	|			ТОГДА 100 / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), &Период, ДЕНЬ) + 1)
//	|		КОГДА ИтоговаяТаблица.ЦБ.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
//	|				ИЛИ ИтоговаяТаблица.ВалютаНоминала <> &ВалютаНоминала
//	|			ТОГДА ИтоговаяТаблица.Количество * ИтоговаяТаблица.Номинал * ИтоговаяТаблица.Курс / ИтоговаяТаблица.Кратность * 0.002 / 100 / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), &Период, ДЕНЬ) + 1)
//	|		ИНАЧЕ ИтоговаяТаблица.Количество * ИтоговаяТаблица.РыночнаяЦена * 0.002 / 100 / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), &Период, ДЕНЬ) + 1)
//	|	КОНЕЦ КАК Комиссия
//	|ПОМЕСТИТЬ ИтоговаяТаблицаРасчета
//	|ИЗ
//	|	ИтоговаяТаблицаОстатков КАК ИтоговаяТаблица
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЕСТЬNULL(СУММА(ВЫБОР
//	|				КОГДА ИтоговаяТаблица.ЦБ.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
//	|						ИЛИ ИтоговаяТаблица.ВалютаНоминала <> &ВалютаНоминала
//	|					ТОГДА ИтоговаяТаблица.Количество * ИтоговаяТаблица.Номинал * ИтоговаяТаблица.Курс / ИтоговаяТаблица.Кратность
//	|				ИНАЧЕ ИтоговаяТаблица.Количество * ИтоговаяТаблица.РыночнаяЦена
//	|			КОНЕЦ), 0) КАК Сумма
//	|ИЗ
//	|	ИтоговаяТаблицаОстатков КАК ИтоговаяТаблица
//	|ГДЕ
//	|	ИтоговаяТаблица.Количество > 0
//	|	И (ИтоговаяТаблица.ЦБ.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
//	|			ИЛИ ИтоговаяТаблица.РыночнаяЦена > 0)");
//	Запрос.УстановитьПараметр("Период",Дата);
//	Запрос.УстановитьПараметр("ВалютаНоминала",Константы.ВалютаРегламентированногоУчета.Получить());
//	Запрос.УстановитьПараметр("Договор",Договор);
//	Запрос.УстановитьПараметр("НРД",Справочники.МестаХранения.НайтиПоКоду("НРД"));
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		СуммаРасчета = Выборка.Сумма;
//	КонецЕсли;

//	Возврат РасчетКомиссииПоШкалеУслуги(Дата, Услуга, СуммаРасчета);

//КонецФункции

Функция РасчетКомиссииПоШкалеУслуги(Дата, Услуга, СуммаРасчета, ПериодРасчета = Неопределено)
	Если НЕ ЗначениеЗаполнено(ПериодРасчета) Тогда
		ПериодРасчета = Перечисления.ВариантыНачисленияКомиссий.Месяц;
	КонецЕсли;
	
	Результат = Новый Структура("Тариф, ТипТарифа, Сумма, СуммаКомиссии");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТарифыСрезПоследних.Услуга КАК Услуга,
	|	МИНИМУМ(ТарифыСрезПоследних.Шкала) КАК Шкала
	|ПОМЕСТИТЬ ПараметрыШкалыУслуги
	|ИЗ
	|	РегистрСведений.Тарифы.СрезПоследних(
	|			&Дата,
	|			Услуга = &Услуга
	|				И Шкала >= &Сумма) КАК ТарифыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ТарифыСрезПоследних.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифыСрезПоследних.Тариф КАК Тариф,
	|	ТарифыСрезПоследних.ТипТарифа КАК ТипТарифа,
	|	РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, ДЕНЬ) + 1 КАК КоличествоДнейВПериоде
	|ИЗ
	|	РегистрСведений.Тарифы.СрезПоследних(
	|			&Дата,
	|			Услуга = &Услуга
	|				И Шкала >= &Сумма) КАК ТарифыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыШкалыУслуги КАК ПараметрыШкалыУслуги
	|		ПО ТарифыСрезПоследних.Услуга = ПараметрыШкалыУслуги.Услуга
	|			И ТарифыСрезПоследних.Шкала = ПараметрыШкалыУслуги.Шкала";
	Запрос.УстановитьПараметр("Дата",			Дата);
	Запрос.УстановитьПараметр("НачалоПериода",	ДатаНачалаПериодаРасчета(Дата, ПериодРасчета));
	Запрос.УстановитьПараметр("КонецПериода",	ДатаОкончанияПериодаРасчета(Дата, ПериодРасчета));
	Запрос.УстановитьПараметр("Услуга",			Услуга);
	Запрос.УстановитьПараметр("Сумма",			СуммаРасчета);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Тариф		= Выборка.Тариф;
		Результат.ТипТарифа	= Выборка.ТипТарифа;
		Результат.Сумма		= СуммаРасчета;
		Результат.СуммаКомиссии = ?(Выборка.ТипТарифа = Перечисления.ТипыТарифов.ФиксированнаяСумма, Выборка.Тариф,
			СуммаРасчета * Выборка.Тариф / 100 / Выборка.КоличествоДнейВПериоде);
		Если Услуга.ОграничениеСуммыНачисления > 0 Тогда
			Результат.СуммаКомиссии = Мин(Результат.СуммаКомиссии, Услуга.ОграничениеСуммыНачисления);
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

//Функция РасчетОстаткаПоВыпуску(Дата, Договор, Услуга)
//	Перем СуммаРасчета;
//	
//	СуммаРасчета = 0;
//	Если Договор.ДатаНачалоДействия > НачалоДня(Дата) Тогда
//		Возврат 0;
//	КонецЕсли;
//	
//	Запрос = Новый Запрос("ВЫБРАТЬ
//						  |	Календарь.Период
//						  |ПОМЕСТИТЬ Календарь
//						  |ИЗ
//						  |	РегистрСведений.Календарь КАК Календарь
//						  |ГДЕ
//						  |	Календарь.Период <= &Период
//						  |	И Календарь.Период >= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
//						  |;
//						  |
//						  |////////////////////////////////////////////////////////////////////////////////
//						  |ВЫБРАТЬ
//						  |	РегистрНазначенныхКомиссийСрезПоследних.ДоговорКонтрагента,
//						  |	РегистрНазначенныхКомиссийСрезПоследних.Услуга
//						  |ПОМЕСТИТЬ СписокКлиентов
//						  |ИЗ
//						  |	РегистрСведений.РегистрНазначенныхКомиссий.СрезПоследних(
//						  |			&Период,
//						  |			Услуга.ПериодРасчета = ЗНАЧЕНИЕ(Перечисление.ВариантыНачисленияКомиссий.Месяц)
//						  |				И Услуга.ВидКомиссии = ЗНАЧЕНИЕ(Перечисление.ВидыКомиссий.Депозитарная)
//						  |				И Услуга.ТипРасчета = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаУслуги.ОстатокПоВыпуску)
//						  |				И ДоговорКонтрагента = &Договор) КАК РегистрНазначенныхКомиссийСрезПоследних
//						  |ГДЕ
//						  |	РегистрНазначенныхКомиссийСрезПоследних.ФлагАктивности = ИСТИНА
//						  |;
//						  |
//						  |////////////////////////////////////////////////////////////////////////////////
//						  |ВЫБРАТЬ
//						  |	ОстаткиЦБОстаткиИОбороты.Период,
//						  |	ОстаткиЦБОстаткиИОбороты.ЦБ,
//						  |	ОстаткиЦБОстаткиИОбороты.КоличествоКонечныйОстаток,
//						  |	СписокКлиентов.ДоговорКонтрагента,
//						  |	ОстаткиЦБОстаткиИОбороты.СчетДепо
//						  |ПОМЕСТИТЬ ОстаткиПоСчетамДЕПО
//						  |ИЗ
//						  |	СписокКлиентов КАК СписокКлиентов
//						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦБ.ОстаткиИОбороты(
//						  |				НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ),
//						  |				КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
//						  |				День,
//						  |				,
//						  |				ЦБ.ТипЦБ <> ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
//						  |					ИЛИ ЦБ.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
//						  |						И ЦБ.ДатаПогашения >= НАЧАЛОПЕРИОДА(&Период, КВАРТАЛ)) КАК ОстаткиЦБОстаткиИОбороты
//						  |		ПО СписокКлиентов.ДоговорКонтрагента.Владелец = ОстаткиЦБОстаткиИОбороты.СчетДепо.Владелец
//						  |;
//						  |
//						  |////////////////////////////////////////////////////////////////////////////////
//						  |ВЫБРАТЬ
//						  |	Календарь.Период КАК Период,
//						  |	МАКСИМУМ(ОстаткиПоСчетамДЕПО.Период) КАК ПериодРасчета,
//						  |	ОстаткиПоСчетамДЕПО.ДоговорКонтрагента КАК ДоговорКонтрагента,
//						  |	ОстаткиПоСчетамДЕПО.СчетДепо КАК СчетДепо,
//						  |	ОстаткиПоСчетамДЕПО.ЦБ КАК ЦБ
//						  |ПОМЕСТИТЬ ТаблицаРаспределенияПериодовПоДням
//						  |ИЗ
//						  |	Календарь КАК Календарь
//						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиПоСчетамДЕПО КАК ОстаткиПоСчетамДЕПО
//						  |		ПО Календарь.Период >= ОстаткиПоСчетамДЕПО.Период
//						  |
//						  |СГРУППИРОВАТЬ ПО
//						  |	Календарь.Период,
//						  |	ОстаткиПоСчетамДЕПО.ДоговорКонтрагента,
//						  |	ОстаткиПоСчетамДЕПО.СчетДепо,
//						  |	ОстаткиПоСчетамДЕПО.ЦБ
//						  |;
//						  |
//						  |////////////////////////////////////////////////////////////////////////////////
//						  |ВЫБРАТЬ
//						  |	ТаблицаРаспределенияПериодовПоДням.Период КАК Период,
//						  |	ТаблицаРаспределенияПериодовПоДням.ДоговорКонтрагента КАК ДоговорКонтрагента,
//						  |	ТаблицаРаспределенияПериодовПоДням.СчетДепо КАК СчетДепо,
//						  |	ТаблицаРаспределенияПериодовПоДням.ЦБ КАК ЦБ,
//						  |	ОстаткиПоСчетамДЕПО.КоличествоКонечныйОстаток КАК Количество
//						  |ПОМЕСТИТЬ ТаблицаОстатковРаспределеннаяПоДням
//						  |ИЗ
//						  |	ТаблицаРаспределенияПериодовПоДням КАК ТаблицаРаспределенияПериодовПоДням
//						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиПоСчетамДЕПО КАК ОстаткиПоСчетамДЕПО
//						  |		ПО ТаблицаРаспределенияПериодовПоДням.ПериодРасчета = ОстаткиПоСчетамДЕПО.Период
//						  |			И ТаблицаРаспределенияПериодовПоДням.ДоговорКонтрагента = ОстаткиПоСчетамДЕПО.ДоговорКонтрагента
//						  |			И ТаблицаРаспределенияПериодовПоДням.СчетДепо = ОстаткиПоСчетамДЕПО.СчетДепо
//						  |			И ТаблицаРаспределенияПериодовПоДням.ЦБ = ОстаткиПоСчетамДЕПО.ЦБ
//						  |;
//						  |
//						  |////////////////////////////////////////////////////////////////////////////////
//						  |ВЫБРАТЬ РАЗЛИЧНЫЕ
//						  |	ТаблицаОстатковРаспределеннаяПоДням.Период КАК Период,
//						  |	ТаблицаОстатковРаспределеннаяПоДням.ЦБ КАК ЦБ
//						  |ПОМЕСТИТЬ ТаблицаЦБПоДатамПриНаличииОстатков
//						  |ИЗ
//						  |	ТаблицаОстатковРаспределеннаяПоДням КАК ТаблицаОстатковРаспределеннаяПоДням
//						  |ГДЕ
//						  |	ТаблицаОстатковРаспределеннаяПоДням.Количество <> 0
//						  |;
//						  |
//						  |////////////////////////////////////////////////////////////////////////////////
//						  |ВЫБРАТЬ
//						  |	ТаблицаЦБПоДатамПриНаличииОстатков.Период,
//						  |	ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ,
//						  |	МАКСИМУМ(Котировки.Период) КАК ПериодКотировки
//						  |ПОМЕСТИТЬ ТаблицаДатКотировок
//						  |ИЗ
//						  |	ТаблицаЦБПоДатамПриНаличииОстатков КАК ТаблицаЦБПоДатамПриНаличииОстатков
//						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Котировки КАК Котировки
//						  |		ПО ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ = Котировки.ЦеннаяБумага
//						  |			И ТаблицаЦБПоДатамПриНаличииОстатков.Период >= Котировки.Период
//						  |			И (ТаблицаЦБПоДатамПриНаличииОстатков.Период <= ДОБАВИТЬКДАТЕ(Котировки.Период, ДЕНЬ, 90))
//						  |			И (Котировки.РыночнаяЦена > 0)
//						  |			И (Котировки.Биржа = &НРД)
//						  |			И (Котировки.РежимТоргов.РежимТоргов = ЗНАЧЕНИЕ(Перечисление.Режимыторгов.Рыночная))
//						  |
//						  |СГРУППИРОВАТЬ ПО
//						  |	ТаблицаЦБПоДатамПриНаличииОстатков.Период,
//						  |	ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ
//						  |;
//						  |
//						  |////////////////////////////////////////////////////////////////////////////////
//						  |ВЫБРАТЬ
//						  |	ТаблицаДатКотировок.Период,
//						  |	ТаблицаДатКотировок.ЦБ,
//						  |	МАКСИМУМ(Котировки.РыночнаяЦена) КАК РыночнаяЦена
//						  |ПОМЕСТИТЬ ТаблицаРыночныхЦенНаДатыОстатков
//						  |ИЗ
//						  |	ТаблицаДатКотировок КАК ТаблицаДатКотировок
//						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Котировки КАК Котировки
//						  |		ПО ТаблицаДатКотировок.ПериодКотировки = Котировки.Период
//						  |			И ТаблицаДатКотировок.ЦБ = Котировки.ЦеннаяБумага
//						  |			И (Котировки.Биржа = &НРД)
//						  |			И (Котировки.РежимТоргов.РежимТоргов = ЗНАЧЕНИЕ(Перечисление.РежимыТоргов.Рыночная))
//						  |
//						  |СГРУППИРОВАТЬ ПО
//						  |	ТаблицаДатКотировок.Период,
//						  |	ТаблицаДатКотировок.ЦБ
//						  |;
//						  |
//						  |////////////////////////////////////////////////////////////////////////////////
//						  |ВЫБРАТЬ
//						  |	ТаблицаОстатковРаспределеннаяПоДням.Период КАК Период,
//						  |	ТаблицаОстатковРаспределеннаяПоДням.ДоговорКонтрагента КАК ДоговорКонтрагента,
//						  |	ТаблицаОстатковРаспределеннаяПоДням.СчетДепо КАК СчетДепо,
//						  |	ТаблицаОстатковРаспределеннаяПоДням.ЦБ КАК ЦБ,
//						  |	ТаблицаОстатковРаспределеннаяПоДням.Количество,
//						  |	ТаблицаРыночныхЦенНаДатыОстатков.РыночнаяЦена
//						  |ПОМЕСТИТЬ ТаблицаОстатковЗаКаждыйДеньВключаяКотировки
//						  |ИЗ
//						  |	ТаблицаОстатковРаспределеннаяПоДням КАК ТаблицаОстатковРаспределеннаяПоДням
//						  |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРыночныхЦенНаДатыОстатков КАК ТаблицаРыночныхЦенНаДатыОстатков
//						  |		ПО ТаблицаОстатковРаспределеннаяПоДням.Период = ТаблицаРыночныхЦенНаДатыОстатков.Период
//						  |			И ТаблицаОстатковРаспределеннаяПоДням.ЦБ = ТаблицаРыночныхЦенНаДатыОстатков.ЦБ
//						  |;
//						  |
//						  |////////////////////////////////////////////////////////////////////////////////
//						  |ВЫБРАТЬ
//						  |	ТаблицаЦБПоДатамПриНаличииОстатков.Период,
//						  |	ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ,
//						  |	МАКСИМУМ(НоминалЦБ.Период) КАК ПериодНоминала
//						  |ПОМЕСТИТЬ ТаблицаПериодовНоминала
//						  |ИЗ
//						  |	ТаблицаЦБПоДатамПриНаличииОстатков КАК ТаблицаЦБПоДатамПриНаличииОстатков
//						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ КАК НоминалЦБ
//						  |		ПО ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ = НоминалЦБ.ЦеннаяБумага
//						  |			И ТаблицаЦБПоДатамПриНаличииОстатков.Период >= НоминалЦБ.Период
//						  |
//						  |СГРУППИРОВАТЬ ПО
//						  |	ТаблицаЦБПоДатамПриНаличииОстатков.Период,
//						  |	ТаблицаЦБПоДатамПриНаличииОстатков.ЦБ
//						  |;
//						  |
//						  |////////////////////////////////////////////////////////////////////////////////
//						  |ВЫБРАТЬ
//						  |	ТаблицаПериодовНоминала.Период,
//						  |	ТаблицаПериодовНоминала.ЦБ,
//						  |	НоминалЦБ.Сумма КАК Номинал,
//						  |	НоминалЦБ.ЦеннаяБумага.ВалютаНоминала КАК ВалютаНоминала,
//						  |	КурсыВалютСрезПоследних.Курс,
//						  |	КурсыВалютСрезПоследних.Кратность
//						  |ПОМЕСТИТЬ ТаблицаЗначенийНоминала
//						  |ИЗ
//						  |	ТаблицаПериодовНоминала КАК ТаблицаПериодовНоминала
//						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ КАК НоминалЦБ
//						  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
//						  |			ПО НоминалЦБ.ЦеннаяБумага.ВалютаНоминала = КурсыВалютСрезПоследних.Валюта
//						  |		ПО ТаблицаПериодовНоминала.ПериодНоминала = НоминалЦБ.Период
//						  |			И ТаблицаПериодовНоминала.ЦБ = НоминалЦБ.ЦеннаяБумага
//						  |;
//						  |
//						  |////////////////////////////////////////////////////////////////////////////////
//						  |ВЫБРАТЬ
//						  |	ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.Период,
//						  |	ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.ДоговорКонтрагента,
//						  |	ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.СчетДепо,
//						  |	ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.ЦБ,
//						  |	ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.Количество,
//						  |	ЕСТЬNULL(ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.РыночнаяЦена, 0) КАК РыночнаяЦена,
//						  |	ТаблицаЗначенийНоминала.Номинал,
//						  |	ТаблицаЗначенийНоминала.ВалютаНоминала,
//						  |	ТаблицаЗначенийНоминала.Курс,
//						  |	ТаблицаЗначенийНоминала.Кратность
//						  |ПОМЕСТИТЬ ИтоговаяТаблицаОстатков
//						  |ИЗ
//						  |	ТаблицаОстатковЗаКаждыйДеньВключаяКотировки КАК ТаблицаОстатковЗаКаждыйДеньВключаяКотировки
//						  |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗначенийНоминала КАК ТаблицаЗначенийНоминала
//						  |		ПО ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.Период = ТаблицаЗначенийНоминала.Период
//						  |			И ТаблицаОстатковЗаКаждыйДеньВключаяКотировки.ЦБ = ТаблицаЗначенийНоминала.ЦБ
//						  |;
//						  |
//						  |////////////////////////////////////////////////////////////////////////////////
//						  |ВЫБРАТЬ
//						  |	ИтоговаяТаблица.Период,
//						  |	ИтоговаяТаблица.ДоговорКонтрагента,
//						  |	ИтоговаяТаблица.СчетДепо,
//						  |	ИтоговаяТаблица.ЦБ,
//						  |	ИтоговаяТаблица.Количество,
//						  |	ИтоговаяТаблица.РыночнаяЦена,
//						  |	ИтоговаяТаблица.Номинал,
//						  |	ИтоговаяТаблица.ВалютаНоминала,
//						  |	ИтоговаяТаблица.Курс,
//						  |	ИтоговаяТаблица.Кратность,
//						  |	ВЫБОР
//						  |		КОГДА ИтоговаяТаблица.РыночнаяЦена = 0
//						  |			ТОГДА 100 / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), &Период, ДЕНЬ) + 1)
//						  |		КОГДА ИтоговаяТаблица.ЦБ.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
//						  |				ИЛИ ИтоговаяТаблица.ВалютаНоминала <> &ВалютаНоминала
//						  |			ТОГДА ИтоговаяТаблица.Количество * ИтоговаяТаблица.Номинал * ИтоговаяТаблица.Курс / ИтоговаяТаблица.Кратность * 0.002 / 100 / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), &Период, ДЕНЬ) + 1)
//						  |		ИНАЧЕ ИтоговаяТаблица.Количество * ИтоговаяТаблица.РыночнаяЦена * 0.002 / 100 / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), &Период, ДЕНЬ) + 1)
//						  |	КОНЕЦ КАК Комиссия
//						  |ПОМЕСТИТЬ ИтоговаяТаблицаРасчета
//						  |ИЗ
//						  |	ИтоговаяТаблицаОстатков КАК ИтоговаяТаблица
//						  |;
//						  |
//						  |////////////////////////////////////////////////////////////////////////////////
//						  |ВЫБРАТЬ
//						  |	ЕСТЬNULL(СУММА(ВЫБОР
//						  |				КОГДА ИтоговаяТаблица.ЦБ.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
//						  |						ИЛИ ИтоговаяТаблица.ВалютаНоминала <> &ВалютаНоминала
//						  |					ТОГДА ИтоговаяТаблица.Количество * ИтоговаяТаблица.Номинал * ИтоговаяТаблица.Курс / ИтоговаяТаблица.Кратность
//						  |				ИНАЧЕ ИтоговаяТаблица.Количество * ИтоговаяТаблица.РыночнаяЦена
//						  |			КОНЕЦ), 0) КАК Сумма
//						  |ИЗ
//						  |	ИтоговаяТаблицаОстатков КАК ИтоговаяТаблица
//						  |ГДЕ
//						  |	ИтоговаяТаблица.Количество > 0
//						  |	И НЕ ИтоговаяТаблица.РыночнаяЦена > 0
//						  |	И ИтоговаяТаблица.ЦБ.ТипЦБ <> ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)");
//	Запрос.УстановитьПараметр("Период",Дата);
//	Запрос.УстановитьПараметр("ВалютаНоминала",Константы.ВалютаРегламентированногоУчета.Получить());
//	Запрос.УстановитьПараметр("Договор",Договор);
//	Запрос.УстановитьПараметр("НРД",Справочники.МестаХранения.НайтиПоКоду("НРД"));
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		СуммаРасчета = Выборка.Сумма;
//	КонецЕсли;

//	Возврат РасчетКомиссииПоШкалеУслуги(Дата, Услуга, СуммаРасчета);
//КонецФункции

Функция РасчетПоПоручению(Дата, Договор, Услуга)
	Перем Запрос, Выборка;
	Перем ДатаНачалаДействияУслуги, Шкала;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РегистрНазначенныхКомиссийСрезПоследних.Услуга,
	                      |	РегистрНазначенныхКомиссийСрезПоследних.ФлагАктивности
	                      |ИЗ
	                      |	РегистрСведений.РегистрНазначенныхКомиссий.СрезПоследних(
	                      |			&Дата,
	                      |			ДоговорКонтрагента = &ДоговорКонтрагента
	                      |				И Услуга.Операция = &Операция
	                      |				"+?(Услуга.МестоХранения1 = Неопределено,""," И Услуга.МестоХранения1 = &МестоХранения1")+"
	                      |				"+?(Услуга.МестоХранения2 = Неопределено,""," И Услуга.МестоХранения2 = &МестоХранения2")+"
						  |) КАК РегистрНазначенныхКомиссийСрезПоследних");
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Запрос.УстановитьПараметр("Операция",Услуга.Операция);
	Если Услуга.МестоХранения1 <> Неопределено Тогда
		Запрос.УстановитьПараметр("МестоХранения1",Услуга.МестоХранения1);
	КонецЕсли;
	Если Услуга.МестоХранения2 <> Неопределено Тогда
		Запрос.УстановитьПараметр("МестоХранения2",Услуга.МестоХранения2);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ФлагАктивности Тогда
			Возврат РасчетПоШкале(Дата, Выборка.Услуга, 1);
		КонецЕсли;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция КоличествоОткрытыхСчетовДепо(Дата, Клиент, ПериодРасчета)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОстаткиИОборотыЦБ.СчетДепо), 0) КАК КоличествоСчетовДепо
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.ОстаткиИОбороты(&НачалоПериода, &Дата, , , СчетДепо.Владелец = &Клиент) КАК ОстаткиИОборотыЦБ
	|ГДЕ
	|	(ОстаткиИОборотыЦБ.КоличествоНачальныйОстаток > 0
	|			ИЛИ ОстаткиИОборотыЦБ.КоличествоПриход > 0
	|			ИЛИ ОстаткиИОборотыЦБ.КоличествоРасход > 0)";
	
	Запрос.УстановитьПараметр("НачалоПериода",	ДатаНачалаПериодаРасчета(Дата, ПериодРасчета));	
	Запрос.УстановитьПараметр("Дата",			КонецДня(Дата));
	Запрос.УстановитьПараметр("Клиент",			Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоСчетовДепо;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

// Возвращаемое значение:
// Если Услуга имеет тип "Структура", то расчетные параметры в виде структуры или Неопределено.
// Если Услуга имеет тип "СправочникСсылка.УслугиТарифногоПлана", то расчетные параметры в виде структуры
// или таблицы значений или Неопределено.
Функция РасчетСтоимостиУслуги(Дата, Договор, Услуга, ПериодРасчета = Неопределено) Экспорт
	Перем Результат;
	
	Если НЕ ЗначениеЗаполнено(ПериодРасчета) Тогда
		ПериодРасчета = Перечисления.ВариантыНачисленияКомиссий.Месяц;
	КонецЕсли;
	
	Результат = Новый Структура("Сумма, Тариф, ТипТарифа, СуммаКомиссии", 0, 0, Перечисления.ТипыТарифов.ПустаяСсылка(), 0);
	
	Если ТипЗнч(Услуга) = Тип("Структура") Тогда
		Возврат РасчетПоПоручению(Дата, Договор, Услуга);
		
	ИначеЕсли Услуга.ТипРасчета = Перечисления.ТипыРасчетаУслуги.ОстатокПоРыночнойСтоимости 
				ИЛИ Услуга.ТипРасчета = Перечисления.ТипыРасчетаУслуги.ОстатокПоВыпуску 
				ИЛИ Услуга.ТипРасчета = Перечисления.ТипыРасчетаУслуги.ОценкаРыночнойСтоимостиЗаМесяц Тогда
		РезультатЗапроса = ОценкаАктивов(Дата, Договор, Услуга, ПериодРасчета);
		ТаблицаОценок = РезультатЗапроса.Выгрузить();
		ТаблицаОценок.Свернуть("Тариф, ТипТарифа, Выгодоприобретатель", "Сумма, СуммаКомиссии");
		Возврат ТаблицаОценок;
		
	ИначеЕсли Услуга.ТипРасчета = Перечисления.ТипыРасчетаУслуги.КоличествоСчетовДЕПО Тогда
		Если РегистрыСведений.ЦенныеБумагиБезКомиссииЗаУслуги.НачислятьКомиссию(Дата, Услуга, Договор.Владелец) Тогда
			КоличествоОткрытыхСчетовДепо = КоличествоОткрытыхСчетовДепо(Дата, Договор.Владелец, ПериодРасчета);
			Возврат РасчетКомиссииПоШкалеУслуги(Дата, Услуга, КоличествоОткрытыхСчетовДепо, ПериодРасчета);
		КонецЕсли;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция РТ_РасчетНДС(СтавкаНДС,Сумма) Экспорт
	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Возврат 0;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда 
		Возврат 0;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда 
		Возврат Сумма*0.1;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда 
		Возврат Сумма*0.11;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда 
		Возврат Сумма*0.18;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда 
		Возврат Сумма*18/118;
	КонецЕсли;
	Возврат 0;
КонецФункции

Функция РТ_ОбщаяСумма(СтавкаНДС,Сумма,СуммаНДС) Экспорт
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС10 или СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Возврат Сумма + СуммаНДС;
	Иначе
		Возврат Сумма;
	КонецЕсли;
КонецФункции


// Получение списка услуг по договору
// Используется из документа Услуги депозитария для промежуточного расчета комиссий при закрытии договора
// Использование отлеживает пользователь
// 
Функция ФормированиеСпискаЕжемесячныхУслуг(Дата, Знач Договор = НЕОПРЕДЕЛЕНО, Знач ТипРасчета = НЕОПРЕДЕЛЕНО) Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Календарь.Период КАК Период
	|ПОМЕСТИТЬ Календарь
	|ИЗ
	|	РегистрСведений.Календарь КАК Календарь
	|ГДЕ
	|	Календарь.Период МЕЖДУ &НачалоПериода И &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(РегистрНазначенныхКомиссий.Период) КАК ПериодНазначенияКомиссии,
	|	РегистрНазначенныхКомиссий.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РегистрНазначенныхКомиссий.Услуга КАК Услуга,
	|	Календарь.Период КАК ПредварительнаяДатаРасчетаКомиссии
	|ПОМЕСТИТЬ РегистрНазначенныхКомиссийПоКалендарю
	|ИЗ
	|	РегистрСведений.РегистрНазначенныхКомиссий КАК РегистрНазначенныхКомиссий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Календарь КАК Календарь
	|		ПО РегистрНазначенныхКомиссий.Период <= Календарь.Период
	|			И (РегистрНазначенныхКомиссий.Услуга.ПериодРасчета = ЗНАЧЕНИЕ(Перечисление.ВариантыНачисленияКомиссий.Месяц))
	|			И (РегистрНазначенныхКомиссий.ДоговорКонтрагента.Владелец ССЫЛКА Справочник.Контрагенты)
	|			И (РегистрНазначенныхКомиссий.ДоговорКонтрагента = &Договор
	|				ИЛИ &Договор = НЕОПРЕДЕЛЕНО)
	|			И (РегистрНазначенныхКомиссий.Услуга.ТипРасчета = &ТипРасчета
	|				ИЛИ &ТипРасчета = НЕОПРЕДЕЛЕНО)
	|			И (РегистрНазначенныхКомиссий.Услуга.ТипРасчета В (&ТипыРасчетаХранениеЦБ))
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрНазначенныхКомиссий.ДоговорКонтрагента,
	|	РегистрНазначенныхКомиссий.Услуга,
	|	Календарь.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Комиссии.Услуга КАК Услуга,
	|	Комиссии.ДоговорКонтрагента КАК Договор
	|ИЗ
	|	РегистрСведений.РегистрНазначенныхКомиссий КАК Комиссии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНазначенныхКомиссийПоКалендарю КАК РегистрНазначенныхКомиссийПоКалендарю
	|		ПО Комиссии.Период = РегистрНазначенныхКомиссийПоКалендарю.ПериодНазначенияКомиссии
	|			И Комиссии.Услуга = РегистрНазначенныхКомиссийПоКалендарю.Услуга
	|			И Комиссии.ДоговорКонтрагента = РегистрНазначенныхКомиссийПоКалендарю.ДоговорКонтрагента
	|			И (Комиссии.ФлагАктивности = ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Комиссии.Услуга,
	|	Комиссии.ДоговорКонтрагента
	|ИЗ
	|	РегистрСведений.РегистрНазначенныхКомиссий.СрезПоследних(
	|			&Дата,
	|			Услуга.ПериодРасчета = ЗНАЧЕНИЕ(Перечисление.ВариантыНачисленияКомиссий.Месяц)
	|				И ДоговорКонтрагента.Владелец ССЫЛКА Справочник.Контрагенты) КАК Комиссии
	|ГДЕ
	|	Комиссии.ФлагАктивности = ИСТИНА
	|	И (Комиссии.ДоговорКонтрагента = &Договор
	|			ИЛИ &Договор = НЕОПРЕДЕЛЕНО)
	|	И (Комиссии.Услуга.ТипРасчета = &ТипРасчета
	|			ИЛИ &ТипРасчета = НЕОПРЕДЕЛЕНО)
	|	И НЕ Комиссии.Услуга.ТипРасчета В (&ТипыРасчетаХранениеЦБ)";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ТипРасчета", ТипРасчета);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	ТипыРасчетаХранениеЦБ = Новый Массив;
	ТипыРасчетаХранениеЦБ.Добавить(Перечисления.ТипыРасчетаУслуги.ОстатокПоВыпуску);
	ТипыРасчетаХранениеЦБ.Добавить(Перечисления.ТипыРасчетаУслуги.ОстатокПоРыночнойСтоимости);
	ТипыРасчетаХранениеЦБ.Добавить(Перечисления.ТипыРасчетаУслуги.ОценкаРыночнойСтоимостиЗаМесяц);
	Запрос.УстановитьПараметр("ТипыРасчетаХранениеЦБ", ТипыРасчетаХранениеЦБ);
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

