
Процедура ВыполнитьПеренумерациюЗарегистрированныхДокументов() Экспорт
	
	ВыборкаРег = РегистрыСведений.РегистрацияДокументовКПеренумерации.Выбрать();
	
	Пока ВыборкаРег.Следующий() Цикл
		
		ПеренумероватьДокументы(ВыборкаРег);	
		
	КонецЦикла;	
	
	ЗаписьЖурналаРегистрации("Перенумерация документов",УровеньЖурналаРегистрации.Предупреждение,,, "Обработка завершена");  
	
КонецПроцедуры	 

Процедура ВнестиИзмененияВЗаписьРегистрации(Запись, СтруктураИзменений)
	
	Если СтруктураИзменений.Количество()=0 ИЛИ НЕ Запись.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Если СтруктураИзменений.Свойство("Удалить") Тогда
		Запись.Удалить();
	Иначе 
		Для Каждого стИзм Из СтруктураИзменений Цикл
			Запись[стИзм.Ключ] = стИзм.Значение;
		КонецЦикла;	 
		
		Запись.Записать();
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура ВыполнитьПринудительнуюПеренумерациюДокументов(НаДату,Принудительная) Экспорт
	
	ТипыДокументов = Метаданные.ПодпискиНаСобытия.ДокументыКПеренумерацииПередЗаписью.Источник.Типы();
	
	Менеджер = РегистрыСведений.РегистрацияДокументовКПеренумерации;
	
	Для Каждого ТипДокумента из ТипыДокументов Цикл 
		ИмяДокумента = Метаданные.НайтиПоТипу(ТипДокумента).Имя;
		Менеджер.ЗарегистрироватьДокументыКПеренумерации(ИмяДокумента,НаДату);
	КонецЦикла;	
	
	НачалоПериодаОбработки = НачалоДня(НаДату);
	КонецПериодаОбработки  = КонецДня(НаДату);

	ВыборкаРег = РегистрыСведений.РегистрацияДокументовКПеренумерации.Выбрать(НачалоПериодаОбработки,КонецПериодаОбработки);
	
	Пока ВыборкаРег.Следующий() Цикл
		
		ПеренумероватьДокументы(ВыборкаРег,Принудительная);		
		
	КонецЦикла;	
	
	ЗаписьЖурналаРегистрации("Перенумерация документов",УровеньЖурналаРегистрации.Предупреждение,,, "Обработка завершена");  
	
КонецПроцедуры	 

Процедура ПеренумероватьДокументы(ВыборкаРег, Принудительная = Неопределено) Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ВыборкаРег.ИмяДокумента);
	ЗаписьЖурналаРегистрации("Перенумерация документов",УровеньЖурналаРегистрации.Предупреждение,МетаданныеДокумента,, "Начало перенумерации документов """+ВыборкаРег.ИмяДокумента+""" за период "+Формат(ВыборкаРег.Период, "ДФ=dd.MM.yyyy"));  
	
	НачалоПериодаОбработки = НачалоДня(ВыборкаРег.Период);
	КонецПериодаОбработки  = КонецДня(ВыборкаРег.Период);
	
	// обозначим старт обработки документов по записи регистра
	Запись = ВыборкаРег.ПолучитьМенеджерЗаписи();
	Запись.Прочитать();
	Если Запись.Выбран() И НЕ Запись.ВыполненСтарт Тогда
		ВнестиИзмененияВЗаписьРегистрации(Запись, Новый Структура("ВыполненСтарт", Истина));
	КонецЕсли;	 
	
	НомераДокументов	= НумераторыОбъектов.ПолучитьСписокДокументовЗаПериод(ВыборкаРег.ИмяДокумента, НачалоПериодаОбработки, КонецПериодаОбработки); 
	
	КолДок              = НомераДокументов.Количество();
	ЗаписьЖурналаРегистрации("Перенумерация документов",УровеньЖурналаРегистрации.Предупреждение,МетаданныеДокумента,, "Выбрано "+колДок+" документов """+ВыборкаРег.ИмяДокумента+""" за период "+Формат(ВыборкаРег.Период, "ДФ=dd.MM.yyyy"));  
	
	ЗапДок    = 0;      // счетчик перезаписанных документов
	Н 		  = 0; 		// запись документов будем выполнять транзакциями по 100 док.
	ТрОткрыта = Ложь;   // фиксируем состояние транзакции "Открыта/Зафиксирована"
	ТрОшибки  = Ложь;   // фиксируем ошибки в транзакциях
	
	Для Каждого Элемент Из НомераДокументов Цикл
		
		Если НЕ ТрОткрыта Тогда
			НачатьТранзакцию();
			ТрОткрыта 	= Истина;
			Н = 0;
		КонецЕсли;	 
		
		Попытка
			Док = Элемент.ПолучитьОбъект();
			НомерИсходный = Док.Номер;
			Док.ОбменДанными.Загрузка = Истина;
			Док.ДополнительныеСвойства.Вставить("Перенумерация",Истина);
			Док.УстановитьНовыйНомер();
			Если НомерИсходный <> Док.Номер Тогда
		
				Если Принудительная <> Неопределено и Принудительная Тогда  
					Док.ДополнительныеСвойства.Вставить("ПринудительнаяПеренумерация",Истина);
				КонецЕсли;
				Док.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов",Истина);
				Док.Записать(РежимЗаписиДокумента.Запись);
				ЗапДок = ЗапДок + 1;
				Н=Н+1;
				
			КонецЕсли;
			
		Исключение
			ОтменитьТранзакцию();
			ТрОшибки 	= Истина;
			Прервать;
		КонецПопытки;	
		
		Если Н>=100 И ТрОткрыта Тогда 
			ЗафиксироватьТранзакцию();
			ТрОткрыта 	= Ложь;
			// сдвинем момент до которого выполнена обработка
			Запись = ВыборкаРег.ПолучитьМенеджерЗаписи();
			Запись.Прочитать();
			Если Запись.Выбран() И Запись.ВыполненСтарт Тогда
				ВнестиИзмененияВЗаписьРегистрации(Запись, Новый Структура("ВыполненоДоМомента", Док.Дата));
			КонецЕсли;	 
		КонецЕсли; 
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("Перенумерация документов",УровеньЖурналаРегистрации.Предупреждение,МетаданныеДокумента,, "Обработано (перенумеровано) "+ЗапДок+" документов """+ВыборкаРег.ИмяДокумента+""" за период "+Формат(ВыборкаРег.Период, "ДФ=dd.MM.yyyy"));  
	
	// удалим запись регистра если все документы перенумерованы
	Если НЕ ТрОшибки Тогда
		Если ТрОткрыта Тогда 
			ЗафиксироватьТранзакцию();
		КонецЕсли; 
		
		Запись = ВыборкаРег.ПолучитьМенеджерЗаписи();
		Запись.Прочитать();
		Если Запись.Выбран() И Запись.ВыполненСтарт Тогда
			ВнестиИзмененияВЗаписьРегистрации(Запись, Новый Структура("Удалить", Истина));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
