#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Описание: Возвращает сведения о внешней обработке для регистрации в подсистеме БСП.
//
// Возвращаемое значение:
//  Структура - параметры регистрации дополнительной обработки
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	МетаданныеОбработки = Метаданные();
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.0.0.2";
	ПараметрыРегистрации.Информация = НСтр(
		"ru = 'Универсальное открытие ФормаНастроек элементов справочника ДополнительныеОтчетыИОбработки
		|с записью результата в ХранилищеНастроек (обход отсутствия гиперссылки в карточке ФИН).'");
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = МетаданныеОбработки.Представление();
	НоваяКоманда.Идентификатор = МетаданныеОбработки.Имя;
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
