
// Выполняет поиск ЦБ с закрытым кодом загрузки и создаёт для них операции снятия с обслуживания.
// Документы создаются датой закрытия кода загрузки.
//
// Параметры:
//  ДатаНачала		 - Дата	 - Начало периода поиска.
//  ДатаОкончания	 - Дата	 - Окончание периода поиска.
//
Процедура ВыполнитьСнятиеЗаПериод(ДатаНачала, ДатаОкончания) Экспорт
	ОбработкаОперацииПоОбслуживаниюЦБ = Обработки.ОбработкаОперацийПоОбслуживаниюЦБ.Создать();
	ОбработкаОперацииПоОбслуживаниюЦБ.ПериодНачало = ДатаНачала;
	ОбработкаОперацииПоОбслуживаниюЦБ.ПериодКонец = ДатаОкончания;
	
	ОбработкаОперацииПоОбслуживаниюЦБ.ОтобратьЦенныеБумаги(Ложь, Истина);
	ОбработкаОперацииПоОбслуживаниюЦБ.СоздатьПоручения(Ложь, Истина);
КонецПроцедуры

// Выполняет поиск неснятых ЦБ с закрытым кодом загрузки или погашенных облигаций/паев и отправляет уведомление почтой.
//
// Параметры:
//  ДатаНачала		 - Дата	 - Начало периода контроля.
//  ДатаОкончания	 - Дата	 - Окончание периода контроля.
//
Процедура ВыполнитьКонтрольЗаПериод(ДатаНачала, ДатаОкончания) Экспорт
	ОбработкаОперацииПоОбслуживаниюЦБ = Обработки.ОбработкаОперацийПоОбслуживаниюЦБ.Создать();
	ОбработкаОперацииПоОбслуживаниюЦБ.ПериодНачало = ДатаНачала;
	ОбработкаОперацииПоОбслуживаниюЦБ.ПериодКонец = ДатаОкончания;
	ОбработкаОперацииПоОбслуживаниюЦБ.ВыполнитьКонтроль();
КонецПроцедуры


