#Область ПрограммныйИнтерфейс

// Возвращает маркировку типа объекта
// Параметры:
//	Объект - СправочникСсылка - (может быть ЦБ или ЮридическоеЛицо)
// Возвращаемое значение:
//	 Строка
Функция ТипОбъектаКОтправкеСтрокой(Объект)  Экспорт
	ТипОбъектаСтрокой = "";
	
	Если ЗначениеЗаполнено(Объект) Тогда
	 	ТипЗначения = ТипЗнч(Объект);
		Если ТипЗначения = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
			ТипОбъектаСтрокой = "Эмитент";
		ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ЦенныеБумаги") Тогда
			ТипОбъектаСтрокой = "ЦБ";
		Иначе
			ТипОбъектаСтрокой = Строка(ТипЗначения);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТипОбъектаСтрокой;
КонецФункции

#КонецОбласти