

&НаКлиенте
Процедура Установить(Команда)
	
	Заголовок = "";
	ЗначенияПараметров = УстановитьПараметры(Заголовок);
	ОповеститьОВыборе(новый Структура("Значения,ЗаголовокНастроек", ЗначенияПараметров,Заголовок));
	
КонецПроцедуры

&НаСервере
Функция УстановитьПараметры(Заголовок)
	
	Значения = Новый Структура;
	
	Значения.Вставить("УзелОбменаСсылка", Объект.УзелОбменаСсылка);
	Значения.Вставить("ЗапускатьРассылку", Объект.ЗапускатьРассылку);
	
	Значения.Вставить("ПочтовыйЛогин", Объект.ПочтовыйЛогин);
	Значения.Вставить("СписокРассылки", XMLСтрока(Новый ХранилищеЗначения(Объект.СписокРассылки.Выгрузить())));
	Значения.Вставить("СписокРассылкиЮЛ", XMLСтрока(Новый ХранилищеЗначения(Объект.СписокРассылкиЮЛ.Выгрузить())));	
	
	ПредставлениеПочты = ?(Объект.СписокРассылки.Количество()>0, "Установлен список рассылки","");
	Заголовок = ПредставлениеПочты;
	Заголовок = СокрЛП(Заголовок);

	Возврат Значения;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.НастройкиАлгоритма)=Тип("Структура") тогда
		
		Настройки = Параметры.НастройкиАлгоритма;
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.УстановитьПользовательскиеНастройки(Настройки);
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастройкиПоУмолчаниюНаСервере()
	
	Объект.ЗапускатьРассылку = Истина;
	Объект.УзелОбменаСсылка = ПланыОбмена.ВыгрузкаДУFinance.НайтиПоКоду("WEB");	
	Объект.ПочтовыйЛогин = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	Объект.СписокРассылки.Очистить();
	
	Строка = Объект.СписокРассылки.Добавить();
	Строка.ПочтовыйЯщик = "IMAppSupport@vtbcapital.com";
	Строка.Представление = "IMAppSupport@vtbcapital.com";
	
	Объект.СписокРассылкиЮЛ.Очистить();
	
	Строка = Объект.СписокРассылкиЮЛ.Добавить();
	Строка.ПочтовыйЯщик = "IMAppSupport@vtbcapital.com";
	Строка.Представление = "IMAppSupport@vtbcapital.com";
	
	Строка = Объект.СписокРассылкиЮЛ.Добавить();
	Строка.ПочтовыйЯщик = "BSS_AM_Corporatesupport@vtbcapital.com";
	Строка.Представление = "BSS_AM_Corporatesupport@vtbcapital.com";
	
	Строка = Объект.СписокРассылкиЮЛ.Добавить();
	Строка.ПочтовыйЯщик = "Yulia.Belyaeva@vtbcapital.com";
	Строка.Представление = "Yulia.Belyaeva@vtbcapital.com";
	
	Строка = Объект.СписокРассылкиЮЛ.Добавить();
	Строка.ПочтовыйЯщик = "Ksenia.Galkina@vtbcapital.com";
	Строка.Представление = "Ksenia.Galkina@vtbcapital.com";
	
	Строка = Объект.СписокРассылкиЮЛ.Добавить();
	Строка.ПочтовыйЯщик = "Leonid.Zamsky@vtbcapital.com";
	Строка.Представление = "Leonid.Zamsky@vtbcapital.com";
	
	Строка = Объект.СписокРассылкиЮЛ.Добавить();
	Строка.ПочтовыйЯщик = "Yuri.Sudarikov@vtbcapital.com";
	Строка.Представление = "Yuri.Sudarikov@vtbcapital.com";
	
	Строка = Объект.СписокРассылкиЮЛ.Добавить();
	Строка.ПочтовыйЯщик = "Natalia.Bondareva@vtbcapital.com";
	Строка.Представление = "Natalia.Bondareva@vtbcapital.com";
	
	Строка = Объект.СписокРассылкиЮЛ.Добавить();
	Строка.ПочтовыйЯщик = "Valeriy.Dragun@vtbcapital.com";
	Строка.Представление = "Valeriy.Dragun@vtbcapital.com";	
	
	Строка = Объект.СписокРассылкиЮЛ.Добавить();
	Строка.ПочтовыйЯщик = "Yulia.Yurasheva@vtbcapital.com";
	Строка.Представление = "Yulia.Yurasheva@vtbcapital.com";	
	
	Строка = Объект.СписокРассылкиЮЛ.Добавить();
	Строка.ПочтовыйЯщик = "Dzhulyetta.Manukyan@vtbcapital.com";
	Строка.Представление = "Dzhulyetta.Manukyan@vtbcapital.com";	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоУмолчанию(Команда)
	НастройкиПоУмолчаниюНаСервере();
КонецПроцедуры

