
// Формирует файлы пакета ORDSW для выгрузки в ФШ НРД по реквизитам текущего объекта
//
// Параметры:
//  Путь	- Строка	- Альтернативный путь для сохранения . Если не указан, используется каталог из внешнего источника.
//
Процедура СформироватьФайлыВыгрузки(Путь = "") Экспорт
	
	ИмяФайла = ИмяФайлаВыгрузки();
	Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить название пакета! Возможно отсутствует исходящий пакет ФШ.");
		Возврат;
	КонецЕсли;
	
	Текст = ТекстФайлаВыгрузки();
	
	Попытка
		Документы.ВыгрузкаРазделаРСВвВышестоящийДепозитарий.СформироватьФайлыВыгрузки(Текст, ИмяФайла, Путь);
		ЗафиксироватьВыгрузку(ИмяФайла, Текст);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Формирует название пакета ORDSW по номеру исходящего пакета, связанного с текущим объектом
// 
// Возвращаемое значение:
//  Строка - имя файла без расширения (и каталога, в который должен быть сохранён файл)
//
Функция ИмяФайлаВыгрузки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВыгрузкаРазделаРСВвНРД.Ссылка КАК ВыгрузкаРаздела,
	|	ТехническаяОперация.Ссылка КАК ТехническаяОперация,
	|	ИсходящийПакетВФайловыйШлюз.Номер КАК Номер,
	|	ИсходящийПакетВФайловыйШлюз.Дата КАК Дата,
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус КАК Статус
	|ИЗ
	|	Документ.ВыгрузкаРазделаРСВвВышестоящийДепозитарий КАК ВыгрузкаРазделаРСВвНРД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТехническаяОперация КАК ТехническаяОперация
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсходящийПакетВФайловыйШлюз КАК ИсходящийПакетВФайловыйШлюз
	|			ПО ТехническаяОперация.Ссылка = ИсходящийПакетВФайловыйШлюз.ДокументОснование
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних КАК СостоянияДокументовВФайловомШлюзеСрезПоследних
	|			ПО (СостоянияДокументовВФайловомШлюзеСрезПоследних.Документ = ТехническаяОперация.Ссылка)
	|		ПО ВыгрузкаРазделаРСВвНРД.Ссылка = ТехническаяОперация.ДокументОснование
	|ГДЕ
	|	ВыгрузкаРазделаРСВвНРД.Ссылка = &Выгрузка";
	Запрос.УстановитьПараметр("Выгрузка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Дата) И ЗначениеЗаполнено(Выборка.Номер) Тогда
		Возврат Документы.ВыгрузкаРазделаРСВвВышестоящийДепозитарий.ИмяФайлаВыгрузки(Выборка.Дата, Выборка.Номер);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Текст файла выгрузки
// 
// Возвращаемое значение:
//  Строка - Текст файла выгрузки
//
Функция ТекстФайлаВыгрузки() Экспорт
	
	Раскрытие = РаскрытиеСпискаВладельцев.ПолучитьОбъект();
	
	ДанныеРСВ = Раскрытие.ВыборкаДанныхЗаполненияСводногоРСВ().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Попытка
		Возврат Документы.ВыгрузкаРазделаРСВвВышестоящийДепозитарий.ТекстФайлаВыгрузки(РаскрытиеСпискаВладельцев, ДанныеРСВ, РазделСчетаДепоМХ);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

// Сохраняет текст и атрибуты выгрузки в табличной части документа
//
// Параметры:
//  ИмяФайла	 - Строка	 - имя файла сохранённого пакета ORDSW
//  ТекстФайла	 - Строка	 - текст сохранённого файла пакета OEDSW
//
Процедура ЗафиксироватьВыгрузку(ИмяФайла, ТекстФайла) Экспорт
	Строка = Выгрузки.Вставить(0);
	Строка.Дата = ТекущаяДатаСеанса();
	Строка.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Строка.ИмяФайла = ИмяФайла;
	Строка.ТекстФайла = ТекстФайла;
	Записать();
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если Не ЗначениеЗаполнено(Дата) Тогда
		ВызватьИсключение "Ошибка установки номера документа, не заполнена дата документа!";
	КонецЕсли;
	Префикс = "ВРС"+Формат(Дата, "ДФ=yyMMdd");
КонецПроцедуры

