
&НаКлиенте
Процедура Сформировать(Команда)
	Если Объект.ДатаОкончания < Объект.ДатаНачала Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Указан не корректный период, сформировать отчет нет возможности";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;	                                                 
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТабДокумент = ОбработкаОбъект.ВыполнитьСверкуСделокСОтчетомБрокераSQL( ,УстанавливатьФлаг);
	ТабДокумент.ФиксацияСверху = 2;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	//Диалог = Новый ДиалогРедактированияСтандартногоПериода(); 
	//Диалог.Период = ПеременнаяТипаСтандартныйПериод; 
	//Если Диалог.Редактировать() Тогда 
	//ПеременнаяТипаСтандартныйПериод = Диалог.Период; 
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ИсключаемыеДоговорыДУ.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ДоговорДУ");    
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.ПолучитьСсылку(Новый УникальныйИдентификатор("7bd55693-f2b1-11e6-9418-005056b100fc"));
	НастройкиОбработки = ОбработкаСсылка.ХранилищеНастроек.Получить();
	ПредставлениеНастроек = "";
	ОбработкаОбъект.УстановитьПользовательскиеНастройки(НастройкиОбработки, ПредставлениеНастроек);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры
