// IMAPPS-31419++
Перем ИмяСобытияЖР;
Перем Отказ;
Перем ТекстОписаниеОшибки;
// IMAPPS-31419--

#Область ПОДСИСТЕМА_ДОПОЛНИТЕЛЬНЫХ_ОТЧЕТОВ_И_ОБРАБОТОК

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид","ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Назначение",Неопределено);  
	ПараметрыРегистрации.Вставить("Наименование", "Обмен ДУ-Финансы 3.0 многопоточно");
	ПараметрыРегистрации.Вставить("Версия", "3.27");
	ПараметрыРегистрации.Вставить("БезопасныйРежим",Ложь);
	ПараметрыРегистрации.Вставить("Информация","Обмен данными ДУ-Финансы 3.0 многопоточно");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "2.1.1.12");
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд,
	"Выполнить обмен ДУ-Финансы 3.0 многопоточно",
	"ВыполнитьОбменДУ_Финансы",
	"ОткрытиеФормы");
	
	ДобавитьКоманду(ТаблицаКоманд,
	"Выполнить обмен ДУ-Финансы 3.0 многопоточно(фон.)",
	"ФоновоеВыполнение",
	"ВызовСерверногоМетода");

	// IMAPPS-30616 ++
	ДобавитьКоманду(ТаблицаКоманд,
	"Выполнить обмен ДУ-Финансы 3.0 многопоточно РГС (фон.)",
	"ФоновоеВыполнениеРГС",
	"ВызовСерверногоМетода");
	// IMAPPS-30616 --
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБМЕНА_ДАННЫМИ  

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт
	Перем Наименование;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Если ИдентификаторКоманды <> "ФоновоеВыполнение" Тогда
	Если ИдентификаторКоманды <> "ФоновоеВыполнение" И ИдентификаторКоманды <> "ФоновоеВыполнениеРГС" Тогда
		Возврат;
	КонецЕсли;
	//ЗаписьЖурналаРегистрации("обмен", УровеньЖурналаРегистрации.Информация, , ,  ИдентификаторКоманды);
	// IMAPPS-24804++
	ОтборФонЗадан = Новый Структура;        
	ОтборФонЗадан.Вставить("ИмяМетода", "VTB_ОбщийМодуль.ВыполнитьОбменДУ_Финансы");
	ОтборФонЗадан.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	Если ИдентификаторКоманды = "ФоновоеВыполнениеРГС" Тогда 
		ОтборФонЗадан.Вставить("Наименование", "Выгрузка в базу Финансы РГС");
	Иначе 
		ОтборФонЗадан.Вставить("Наименование", "Выгрузка в базу Финансы");
	КонецЕсли;
	// IMAPPS-30616
	АктивныеФонЗадан = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФонЗадан);
	
	Если АктивныеФонЗадан.Количество() Тогда 
		Возврат;
	КонецЕсли;
	// IMAPPS-24804--
		
	ПредставлениеНастроек = УстановитьНастройки(ПараметрыВыполненияКоманды);
	
	ДопОбработка = ПараметрыВыполненияКоманды.ДополнительнаяОбработкаСсылка;
	
	ПараметрыОбработки = ПараметрыВыполненияКоманды.ПараметрыДополнительнойОбработки;

	ПараметрыВыполненияКоманды.Вставить("СписокСтатейЗатратКомиссияБанка", ЗначениеИзСтрокиВнутр(ПараметрыОбработки.Значения.КомиссияБанка));
	ПараметрыВыполненияКоманды.Вставить("СписокСтатейЗатратДепозитарныеУслуги", ЗначениеИзСтрокиВнутр(ПараметрыОбработки.Значения.ДепозитарныеУслуги));
	ПараметрыВыполненияКоманды.Вставить("СписокСтатейЗатратДивиденды", ЗначениеИзСтрокиВнутр(ПараметрыОбработки.Значения.Дивиденды));
	ПараметрыВыполненияКоманды.Вставить("ДатаНачалаРегистрации", УзелОбмена.ДатаНачалаРегистрации);  
	ПараметрыВыполненияКоманды.Вставить("Интерактивно", Ложь);  
	
	// IMAPPS-30616 ++
	Если ИдентификаторКоманды = "ФоновоеВыполнениеРГС" Тогда 
		ПараметрыВыполненияКоманды.Вставить("ОбменРГС", Истина);  
		ПараметрыВыполненияКоманды.Вставить("СписокДоговоров", ЗначениеИзСтрокиВнутр(ПараметрыОбработки.Значения.Договоры));  
	Иначе 
		ПараметрыВыполненияКоманды.Вставить("ОбменРГС", Ложь);  
		ПараметрыВыполненияКоманды.Вставить("СписокДоговоров", Новый Массив);  
	КонецЕсли;
	// IMAPPS-30616 --
	
	Задача = Задачи.ЗадачаИнтеграции.СоздатьЗадачу();
	Задача.Дата 	= ТекущаяДата();
	
	Наименование = "Обмен ДУ-Финансы многопоточно 3.0 в фоновом режиме" + ?(ПараметрыВыполненияКоманды.ОбменРГС, " (РГС)", "");
	
	Задача.ВидОбмена 		= ДопОбработка;
	Задача.ВерсияОбработки 	= ОбщегоНазначения.ПолучитьЗначениеРеквизита(ДопОбработка, "Версия");
	Задача.Наименование 	= Наименование;
	Задача.ПараметрыВыполнения = ПредставлениеНастроек;  
	
	Отказ = Ложь;
	
	// Реализация логики команды
	Попытка
		Выполнить("ВыполнитьОбменДУ_Финансы(ПараметрыВыполненияКоманды);");
		// IMAPPS-31419++
		Если ЗначениеЗаполнено(ТекстОписаниеОшибки) Тогда
			Задача.Описание = ТекстОписаниеОшибки;
		Иначе
			Задача.Описание = "Выполнено успешно";
		КонецЕсли;
		// IMAPPS-31419--
	Исключение
		Отказ = Истина;
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, , , , ОписаниеОшибки());
		Задача.Описание = "Ошибка обмена ДУ-Финансы: "+ ОписаниеОшибки();
	КонецПопытки;

	// IMAPPS-31419++
	Если СписокРассылки.Количество() > 0 и НЕ ПочтовыйЛогин.Пустая() тогда
		
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, Вложения, Важность");
		ПараметрыПисьма.Тема	 = ?(Отказ, "{FAIL} ", "{OK} ") + "Аванкор ДУ: " + Наименование + ПропискаРассылки("r0");
		ПараметрыПисьма.Важность = ?(Отказ, ВажностьИнтернетПочтовогоСообщения.Высокая, ВажностьИнтернетПочтовогоСообщения.Обычная);
		ПараметрыПисьма.Тело	 =  Задача.Описание;
		ПараметрыПисьма.Вложения = Новый Массив;
		
		Кому = Новый Массив;
		Для каждого ТекЯщик из СписокРассылки Цикл
			Кому.Добавить(Новый Структура("Адрес,Представление", ТекЯщик.ПочтовыйЯщик, ТекЯщик.Представление));
		КонецЦикла;
		
		ПараметрыПисьма.Кому = Кому;
		
		Попытка
			РаботаСПочтовымиСообщениями.ОтправитьСообщение(ПочтовыйЛогин, ПараметрыПисьма);
			текстРассылки = "Рассылка завершена";
		Исключение
			текстРассылки = "Рассылка не удалась: " + ОписаниеОшибки(); 
			Сообщения = ПолучитьСообщенияПользователю(Истина);
			Для Каждого Элемент из Сообщения Цикл
				  текстРассылки = текстРассылки + Символы.ПС + Элемент.Текст;
			КонецЦикла;
		КонецПопытки;
		
	КонецЕсли;
	// IMAPPS-31419--

	Задача.ВыполнитьЗадачу();

КонецПроцедуры

Процедура ВыполнитьОбменДУ_Финансы(ПараметрыВыполненияКоманды) Экспорт 
	
	Если ПараметрыВыполненияКоманды.ОбменРГС Тогда 
		УзелОбменаТекущий = УзелОбменаРГС;
	Иначе 
		УзелОбменаТекущий = УзелОбмена;
	КонецЕсли;
	
	//{[+] IMDEV-3254 N.Filimonova 01.03.2022
	
	этоПоследнийПакет = Ложь;
	КоличествоПотоковФакт = 0;
	//СтруктураСделок = СделкиTnПоПортфелям(УзелОбмена);
	СтруктураСделок = СделкиTnПоПортфелям(УзелОбменаТекущий, ПараметрыВыполненияКоманды);   // IMAPPS-30616

	КоличествоСделок 				= СтруктураСделок.КоличествоСделок;
	ВыборкаСделкиTnПоПортфелям 		= СтруктураСделок.ВыборкаСделкиTnПоПортфелям;
	КоличествоПортфелей 			= ВыборкаСделкиTnПоПортфелям.Строки.Количество();  
	//ЕстьСтатикаДокументыДляОбмена 	= ЕстьСтатикаДокументыДляОбмена(УзелОбмена);
	ЕстьСтатикаДокументыДляОбмена 	= ЕстьСтатикаДокументыДляОбмена(УзелОбменаТекущий);  // IMAPPS-30616
		
	Если ЕстьСтатикаДокументыДляОбмена = Истина Тогда
		КоличествоПотоков 		= КоличествоПотоков - 1;
	КонецЕсли;	
	
	Если КоличествоПотоков = 0 Тогда
		КоличествоПотоков = 1;
	КонецЕсли;
	
	СделокНаПоток 				= Цел(КоличествоСделок/КоличествоПотоков)+1;
	ПулСделок 					= Новый Массив;
	ОбработаноСделок			= 0;   
	
	// IMAPPS-31419++
	МаксКоличествоФоновыхЗаданий = 10;
	
	ТаблицаФоновыхЗаданий = Новый ТаблицаЗначений;
	ТаблицаФоновыхЗаданий.Колонки.Добавить("Завершен", Новый ОписаниеТипов("Булево"));
	ТаблицаФоновыхЗаданий.Колонки.Добавить("Отказ", Новый ОписаниеТипов("Булево"));
	ТаблицаФоновыхЗаданий.Колонки.Добавить("ТекстОшибки", Новый ОписаниеТипов("Строка"));
	ТаблицаФоновыхЗаданий.Колонки.Добавить("ФоновоеЗадание");
	ТаблицаФоновыхЗаданий.Колонки.Добавить("НомерПотока", Новый ОписаниеТипов("Строка"));
	// IMAPPS-31419--
	
	ЗаполнениеПараметровВыполненияКоманды(ПараметрыВыполненияКоманды, УзелОбменаТекущий);
	
	// Выгрузка всех отбъектов кроме Сделок Tn+ одним пакетом в фоне 
	// Флаг необходимости рассылки присваивается в последнем потоке 
	Если КоличествоСделок = 0 И ЕстьСтатикаДокументыДляОбмена = Истина Тогда   
		КоличествоПотоковФакт = 1;  
		ПараметрыВыполненияКоманды.КоличествоПотоковФакт = КоличествоПотоковФакт;  
		ПараметрыВыполненияКоманды.Рассылка = Истина; 
		ПараметрыВыполненияКоманды.ЗапускОперацийПослеОбмена = Истина;
	КонецЕсли;	 
	
	Если ЕстьСтатикаДокументыДляОбмена = Истина Тогда  
		ПараметрыВыполненияКомандыXML = СтрокаXML(ПараметрыВыполненияКоманды);
		// IMAPPS-31419++
		// ВыполнитьФоновоеЗадание(ПараметрыВыполненияКомандыXML, ПараметрыВыполненияКоманды.ОбменРГС);
		Задание = ВыполнитьФоновоеЗадание(ПараметрыВыполненияКомандыXML, ПараметрыВыполненияКоманды.ОбменРГС);
		НоваяЗапись = ТаблицаФоновыхЗаданий.Добавить();
		НоваяЗапись.ФоновоеЗадание = Задание;
		НоваяЗапись.НомерПотока = ТаблицаФоновыхЗаданий.Количество();
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация, , , "Запущено фоновое задание по потоку " + НоваяЗапись.НомерПотока);
		// IMAPPS-31419--
	КонецЕсли;	
	
	// IMAPPS-24804++
	ТаблицаРаспределенияПоПортфелям = Новый ТаблицаЗначений;
	ТаблицаРаспределенияПоПортфелям.Колонки.Добавить("КоличествоСделок", Новый ОписаниеТипов("Число"));
	ТаблицаРаспределенияПоПортфелям.Колонки.Добавить("ПулСделок");
	
	Для Сч = 1 по КоличествоПотоков Цикл
		ТаблицаРаспределенияПоПортфелям.Добавить().ПулСделок = Новый Массив;
	КонецЦикла;
	
	ВыборкаСделкиTnПоПортфелям.Строки.Сортировать("Ссылка Убыв"); // Сортировка по количеству Сделок
	
	// Распределяем Сделки в по пулам таким образом, чтобы каждый пул содержал максимально одинаковое количество сделок
	// Для этого каждый последующий Портфель, отсортированный по убыванию, будем помещать в самый маленький пул, применяя сортировку на каждом шаге
	Для Каждого Портфель Из ВыборкаСделкиTnПоПортфелям.Строки Цикл
		ТаблицаРаспределенияПоПортфелям.Сортировать("КоличествоСделок");
		ТекСтрокаРаспределения = ТаблицаРаспределенияПоПортфелям.Получить(0);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТекСтрокаРаспределения.ПулСделок, Портфель.Строки.ВыгрузитьКолонку("Ссылка"));
		ТекСтрокаРаспределения.КоличествоСделок = ТекСтрокаРаспределения.ПулСделок.Количество();
	КонецЦикла;
	
	// Далее просто вызываем фоновое по всем распределеным пулам
	Для каждого ТекСтрокаРаспределения из ТаблицаРаспределенияПоПортфелям Цикл
		
		КоличествоПотоковФакт = КоличествоПотоковФакт + 1;

			
		ПараметрыВыполненияКоманды.ЭтоПакетСделокTn = Истина;
		ПараметрыВыполненияКоманды.ПулСделок = ТекСтрокаРаспределения.ПулСделок;  
		
		этоПоследнийПакет = (ТаблицаРаспределенияПоПортфелям.Количество() - 1) = ТаблицаРаспределенияПоПортфелям.Индекс(ТекСтрокаРаспределения);
		ПараметрыВыполненияКоманды.Рассылка = этоПоследнийПакет;   
		ПараметрыВыполненияКоманды.ЗапускОперацийПослеОбмена = этоПоследнийПакет; 
		
		ПараметрыВыполненияКоманды.КоличествоПотоковФакт = КоличествоПотоковФакт;  

		ПараметрыВыполненияКомандыXML = СтрокаXML(ПараметрыВыполненияКоманды);
		
		// IMAPPS-31419++
		// ВыполнитьФоновоеЗадание(ПараметрыВыполненияКомандыXML, ПараметрыВыполненияКоманды.ОбменРГС);
		Задание = ВыполнитьФоновоеЗадание(ПараметрыВыполненияКомандыXML, ПараметрыВыполненияКоманды.ОбменРГС);
		НоваяЗапись = ТаблицаФоновыхЗаданий.Добавить();
		НоваяЗапись.ФоновоеЗадание = Задание;
		НоваяЗапись.НомерПотока = ТаблицаФоновыхЗаданий.Количество();
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация, , , "Запущено фоновое задание по потоку " + НоваяЗапись.НомерПотока);
		
		ОжидатьЗавершенияФоновыхЗаданий(ТаблицаФоновыхЗаданий, МаксКоличествоФоновыхЗаданий);
		// IMAPPS-31419--
		
		ПараметрыВыполненияКоманды.ПулСделок = Неопределено;
	
	КонецЦикла;
	
	// IMAPPS-31419++
	ОжидатьЗавершенияФоновыхЗаданий(ТаблицаФоновыхЗаданий);
	
	Для каждого ЗаписьФЗ Из ТаблицаФоновыхЗаданий Цикл
		Если ЗаписьФЗ.Отказ Тогда
			ТекстОписаниеОшибки = ТекстОписаниеОшибки + Символы.ПС + 
			ЗаписьФЗ.ТекстОшибки;
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	// IMAPPS-31419--
	
	// код снятия с узла документов не в списке договоров 
	
	//// Выгрузка сделок Tn+ пакетами в фоне
	//Для Каждого Портфель Из ВыборкаСделкиTnПоПортфелям.Строки Цикл
	//	
	//	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПулСделок, Портфель.Строки.ВыгрузитьКолонку("Ссылка"));
	//	ОбработаноСделок = ОбработаноСделок + Портфель.Строки.Количество();
	//	
	//	Если ПулСделок.Количество() >= СделокНаПоток 
	//		Или ОбработаноСделок = КоличествоСделок Тогда    
	//		
	//		КоличествоПотоковФакт = КоличествоПотоковФакт + 1;
	//		
	//		ПараметрыВыполненияКоманды.ЭтоПакетСделокTn = Истина;
	//		ПараметрыВыполненияКоманды.ПулСделок = ПулСделок;  
	//		
	//		этоПоследнийПакет = ОбработаноСделок = КоличествоСделок;
	//		ПараметрыВыполненияКоманды.Рассылка = этоПоследнийПакет;   
	//		ПараметрыВыполненияКоманды.ЗапускОперацийПослеОбмена = этоПоследнийПакет; 
	//		
	//		ПараметрыВыполненияКоманды.КоличествоПотоковФакт = КоличествоПотоковФакт;  
	//
	//		ПараметрыВыполненияКомандыXML = СтрокаXML(ПараметрыВыполненияКоманды);
	//		ВыполнитьФоновоеЗадание(ПараметрыВыполненияКомандыXML);
	//		
	//		ПараметрыВыполненияКоманды.ПулСделок = Неопределено;
	//		ПулСделок.Очистить();
	//		КоличествоВПотоке = 0;
	//	КонецЕсли;
	//	
	//КонецЦикла;	
	
	// IMAPPS-24804--
	
	//} IMDEV-3254 N.Filimonova
КонецПроцедуры  

// IMAPPS-31419++

Процедура ОжидатьЗавершенияФоновыхЗаданий(ТаблицаФоновыхЗаданий, МаксимальноеКоличествоВОжидании = 0)
	
	ОбщееВремяОжиданияЗавершенияФоновых = 0;
	ПаузаСекундыОжиданияЗавершенияФоновых = 5;
	МаксимальноеВремяОжиданияЗавершенияФоновых = 12 * 3600; // 12 Часов
	
	Пока Истина Цикл
		
		Отбор = Новый Структура("Завершен", Ложь);
		СписокНеЗавершенных = ТаблицаФоновыхЗаданий.НайтиСтроки(Отбор);
		
		Если СписокНеЗавершенных.Количество() <= МаксимальноеКоличествоВОжидании Тогда
			Прервать;
		КонецЕсли;
		
		Если СписокНеЗавершенных.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Для каждого СтрокаФЗ Из ТаблицаФоновыхЗаданий Цикл
			
			Если СтрокаФЗ.Завершен Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаданиеЕстьОшибкиВыполнения = Ложь;
			ОписаниеОшибки = "";
			Попытка
				ЗаданиеВыполнено = ДлительныеОперации.ЗаданиеВыполнено(СтрокаФЗ.ФоновоеЗадание.УникальныйИдентификатор)
			Исключение
				ЗаданиеВыполнено = Ложь;
				ЗаданиеЕстьОшибкиВыполнения = Истина;
				ОписаниеОшибки = ОписаниеОшибки();
			КонецПопытки;
			
			Если ЗаданиеЕстьОшибкиВыполнения Тогда
				// Либо были ошибки при выполнении задания
				// Либо ошибки при получении информации о выполнении задания
				СтрокаФЗ.Завершен = Истина;
				СтрокаФЗ.Отказ = Истина;
				СтрокаФЗ.ТекстОшибки = ОписаниеОшибки;
				
			ИначеЕсли ЗаданиеВыполнено Тогда
				СтрокаФЗ.Завершен = Истина;
			КонецЕсли;
			
			Если СтрокаФЗ.Завершен Тогда
				ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация, , , "Завершено фоновое задание по потоку " + СтрокаФЗ.НомерПотока);
			КонецЕсли;

		КонецЦикла;
		
		
		
		VTB_ОбщийМодуль.Пауза(ПаузаСекундыОжиданияЗавершенияФоновых);
		ОбщееВремяОжиданияЗавершенияФоновых = ОбщееВремяОжиданияЗавершенияФоновых + ПаузаСекундыОжиданияЗавершенияФоновых;
		
		Если ОбщееВремяОжиданияЗавершенияФоновых > МаксимальноеВремяОжиданияЗавершенияФоновых Тогда
			
			// Вызываем исключение
			ВызватьИсключение "Превышено время ожидания завершения выполнения фоновых заданий";
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// IMAPPS-31419--

Функция ЕстьСтатикаДокументыДляОбмена(УзелОбменаТекущий)
	//{[+] IMDEV-3254 N.Filimonova 15.08.2022     
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку(); 
	ЗапСообщения = ПланыОбмена.СоздатьЗаписьСообщения(); 
	ЗапСообщения.НачатьЗапись(ЗаписьXML, УзелОбменаТекущий);  
	
	МассивМетаданныхУзла = Новый Массив;
	
	Для Каждого Спр Из Метаданные.Справочники Цикл
		МассивМетаданныхУзла.Добавить(Спр);
	КонецЦикла; 
	
	Для Каждого Док Из Метаданные.Документы Цикл
		МассивМетаданныхУзла.Добавить(Док);
	КонецЦикла;   
	
	Для Каждого БизнесПроцесс Из Метаданные.БизнесПроцессы Цикл 
		
		Если БизнесПроцесс = Метаданные.БизнесПроцессы.СделкиTn Тогда
			Продолжить;
		КонецЕсли;	
		
		МассивМетаданныхУзла.Добавить(БизнесПроцесс);
	КонецЦикла;
	
	
	Выборка = ПланыОбмена.ВыбратьИзменения(УзелОбменаТекущий, ЗапСообщения.НомерСообщения, МассивМетаданныхУзла);  
	
	Если  Выборка.Следующий() Тогда  
		Возврат Истина;
	КонецЕсли; 
	
	Возврат Ложь;
	
	//} IMDEV-3254 N.Filimonova 
КонецФункции	

Процедура ЗаполнениеПараметровВыполненияКоманды(ПараметрыВыполненияКоманды, УзелОбменаТекущий)
	//{[+] IMDEV-3254 N.Filimonova 01.03.2022
	
	ПараметрыВыполненияКоманды.Вставить("УзелОбмена", УзелОбменаТекущий);
	ПараметрыВыполненияКоманды.Вставить("Лог", Лог);
	ПараметрыВыполненияКоманды.Вставить("ПочтовыйЛогин", ПочтовыйЛогин);
	ПараметрыВыполненияКоманды.Вставить("Имя", Имя);
	ПараметрыВыполненияКоманды.Вставить("ВебСервис", ВебСервис);
	ПараметрыВыполненияКоманды.Вставить("ПользовательВебСервиса", ПользовательВебСервиса);
	ПараметрыВыполненияКоманды.Вставить("ПарольВебСервиса", ПарольВебСервиса);
	ПараметрыВыполненияКоманды.Вставить("ВебСервисРГС", ВебСервисРГС);
	ПараметрыВыполненияКоманды.Вставить("ПользовательВебСервисаРГС", ПользовательВебСервисаРГС);
	ПараметрыВыполненияКоманды.Вставить("ПарольВебСервисаРГС", ПарольВебСервисаРГС);
	ПараметрыВыполненияКоманды.Вставить("КоличествоПотоков", 0);
	ПараметрыВыполненияКоманды.Вставить("ОчищатьСпискиДляОбработки", ОчищатьСпискиДляОбработки);
	ПараметрыВыполненияКоманды.Вставить("КоличествоОбъектовНаТранзакцию", КоличествоОбъектовНаТранзакцию);
	ПараметрыВыполненияКоманды.Вставить("ИспользоватьТранзакции", ИспользоватьТранзакции);
	ПараметрыВыполненияКоманды.Вставить("МакетПравилТекст", ПолучитьМакет("МакетПравил").ПолучитьТекст());
	ПараметрыВыполненияКоманды.Вставить("ЭтоПакетСделокTn", Ложь);
	ПараметрыВыполненияКоманды.Вставить("ПулСделок", Неопределено);
	ПараметрыВыполненияКоманды.Вставить("СтартоватьСделкиПриЗагрузке", СтартоватьСделкиПриЗагрузке);
	ПараметрыВыполненияКоманды.Вставить("ИдентификаторОбмена", Новый УникальныйИдентификатор);
	ПараметрыВыполненияКоманды.Вставить("Рассылка", Ложь);  
	ПараметрыВыполненияКоманды.Вставить("ЗапускОперацийПослеОбмена", Ложь);  
	ПараметрыВыполненияКоманды.Вставить("СписокРассылки", СписокРассылки.ВыгрузитьКолонку("ПочтовыйЯщик"));   
	ПараметрыВыполненияКоманды.Вставить("КоличествоПотоковФакт", 0);  
	ПараметрыВыполненияКоманды.Вставить("Таймаут", Таймаут); 
	
	//} IMDEV-3254 N.Filimonova
КонецПроцедуры

Функция ВыполнитьФоновоеЗадание(ПараметрыВыполненияКомандыXML, ОбменРГС = Ложь)
	//{[+] IMDEV-3254 N.Filimonova 01.03.2022
	
	ПараметрыВыполненияКоманды = Новый Массив;
	ПараметрыВыполненияКоманды.Добавить(ПараметрыВыполненияКомандыXML);
	
	// IMAPPS-30616 ++
	//ФоновыеЗадания.Выполнить("VTB_ОбщийМодуль.ВыполнитьОбменДУ_Финансы"
	//								, ПараметрыВыполненияКоманды
	//								, Новый УникальныйИдентификатор
	//								, "Выгрузка в базу Финансы");
	Если ОбменРГС = Истина Тогда 
		//VTB_ОбщийМодуль.ВыполнитьОбменДУ_Финансы(ПараметрыВыполненияКоманды);
		Задание = ФоновыеЗадания.Выполнить("VTB_ОбщийМодуль.ВыполнитьОбменДУ_Финансы"
								, ПараметрыВыполненияКоманды
								, Новый УникальныйИдентификатор
								, "Выгрузка в базу Финансы РГС");
	Иначе 
		//VTB_ОбщийМодуль.ВыполнитьОбменДУ_Финансы(ПараметрыВыполненияКоманды);
		Задание = ФоновыеЗадания.Выполнить("VTB_ОбщийМодуль.ВыполнитьОбменДУ_Финансы"
								, ПараметрыВыполненияКоманды
								, Новый УникальныйИдентификатор
								, "Выгрузка в базу Финансы");
	КонецЕсли;
	//IMAPPS-30616 --
	
	// IMAPPS-35434++
	// Для исключения блокировок при выполнении метода ВыбратьИзменения()
	Если ЗадержкаЗапускаФоновогоЗадания Тогда
		VTB_ОбщийМодуль.Пауза(ЗадержкаЗапускаФоновогоЗадания);
	КонецЕсли;
	// IMAPPS-35434--
	
	Возврат Задание; // IMAPPS-31419
	
	//} IMDEV-3254 N.Filimonova
КонецФункции 

Функция СтрокаXML(Данные) Экспорт 
	//{[+] IMDEV-3254 N.Filimonova 01.03.2022
	
    ЗаписьXML = Новый ЗаписьXML();
    ЗаписьXML.УстановитьСтроку();
    СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Данные);
    
    Возврат ЗаписьXML.Закрыть();
	
	//} IMDEV-3254 N.Filimonova
КонецФункции

Функция СделкиTnПоПортфелям(УзелОбменаТекущий, ПараметрыВыполненияКоманды)
	//{[+] IMDEV-3254 N.Filimonova 01.03.2022
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкиTnИзменения.Ссылка КАК Ссылка,
	|	СделкиTn.ДоговорДУ КАК Портфель
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	БизнесПроцесс.СделкиTn.Изменения КАК СделкиTnИзменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.СделкиTn КАК СделкиTn
	|		ПО СделкиTnИзменения.Ссылка = СделкиTn.Ссылка
	|ГДЕ
	|	СделкиTnИзменения.Узел = &Узел
	|	<ДопУсловие>
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВременнаяТаблица.Ссылка), 0) КАК КоличествоСделок
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Ссылка КАК Ссылка,
	|	ВременнаяТаблица.Портфель КАК Портфель
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|ИТОГИ
	|	КОЛИЧЕСТВО(Ссылка) // IMAPPS-24804 
	|ПО
	|	Портфель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкиTnИзменения.Ссылка КАК Ссылка
	|ИЗ
	|	БизнесПроцесс.СделкиTn.Изменения КАК СделкиTnИзменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.СделкиTn КАК СделкиTn
	|		ПО СделкиTnИзменения.Ссылка = СделкиTn.Ссылка
	|ГДЕ
	|	СделкиTnИзменения.Узел = &Узел
	|	<ДопУсловие2>";
	
	
	Если ПараметрыВыполненияКоманды.ОбменРГС Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ДопУсловие>", "И СделкиTn.ДоговорДУ В (&ДоговорДУ)");
		Запрос.УстановитьПараметр("ДоговорДУ", ПараметрыВыполненияКоманды.СписокДоговоров);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ДопУсловие2>", "И НЕ СделкиTn.ДоговорДУ В (&ДоговорДУ)");    // IMAPPS-31910
		Запрос.УстановитьПараметр("ДоговорДУ", ПараметрыВыполненияКоманды.СписокДоговоров);                     // IMAPPS-31910
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ДопУсловие>", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ДопУсловие2>", "");                                          // IMAPPS-31910
	КонецЕсли;

	//ЗаписьЖурналаРегистрации("обмен", УровеньЖурналаРегистрации.Информация, , ,  "Запрос.Текст  =  "  +Запрос.Текст);
	//Для Каждого стр из ПараметрыВыполненияКоманды.СписокДоговоров Цикл  
	//	ЗаписьЖурналаРегистрации("обмен", УровеньЖурналаРегистрации.Информация, , ,  "ПараметрыВыполненияКоманды.СписокДоговоров  =  "  +стр);
	//КонецЦикла;
	
	Запрос.УстановитьПараметр("Узел", УзелОбменаТекущий);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	КоличествоСделок = РезультатЗапроса[1].Выгрузить()[0].КоличествоСделок; 
	ВыборкаСделкиTnПоПортфелям = РезультатЗапроса[2].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// IMAPPS-31910 ++
	Если ПараметрыВыполненияКоманды.ОбменРГС Тогда 
		НенужныеСделки = РезультатЗапроса[3].Выгрузить();
		Для Каждого стр Из НенужныеСделки Цикл			
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбменаТекущий, стр.Ссылка);			
		КонецЦикла;
	Иначе 
		
	КонецЕсли;
	// IMAPPS-31910 --
	
	СтруктураСделок = Новый Структура("КоличествоСделок, ВыборкаСделкиTnПоПортфелям",КоличествоСделок, ВыборкаСделкиTnПоПортфелям);
	
	Возврат СтруктураСделок;
	
	//} IMDEV-3254 N.Filimonova
КонецФункции

#КонецОбласти

#Область ВСПОМОГАТЕЛЬНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ
  
Функция СформируемЛогЗагрузки(Параметры)
	
	Макет = ПолучитьМакет("Лог");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОтображатьГруппировки 	= Ложь;
	ТабДокумент.ОтображатьСетку 		= Ложь;
	ТабДокумент.ОтображатьЗаголовки 	= Ложь;

	Заголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабДокумент.Вывести(Заголовок);
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.ДатаФормирования = ТекущаяДата();
	ТабДокумент.Вывести(Шапка);
	
	Если Параметры.СписокСправочниковКЗагрузке.Количество() > 0 Тогда 
		ОбластьШапкаСправочники = Макет.ПолучитьОбласть("ШапкаСправочники");
		ТабДокумент.Вывести(ОбластьШапкаСправочники);
	КонецЕсли;
	
	ТаблицаЗагруженныхОбъектов = КонвертироватьТаблицуИз_COM(Параметры.ТаблицаЗагруженныхОбъектов);
	ТаблицаНеЗагруженныхОбъектов = КонвертироватьТаблицуИз_COM(Параметры.ТаблицаНеЗагруженныхОбъектов);
	
	ВсегоЗагружено 		= ТаблицаЗагруженныхОбъектов.Количество();
	ВсегоНеЗагрузилось 	= ТаблицаНеЗагруженныхОбъектов.Количество();
	ВсегоЗагружалось 	= ВсегоЗагружено + ВсегоНеЗагрузилось;
	
	
	МассивВидовСправочников = Новый Массив;
	
	МассивВидовСправочников.Добавить("ДоговорДУ");
	МассивВидовСправочников.Добавить("ДоговорыКонтрагентов");
	МассивВидовСправочников.Добавить("Контрагенты");
	МассивВидовСправочников.Добавить("БанковскиеСчета");
	МассивВидовСправочников.Добавить("СчетаДепо");
	МассивВидовСправочников.Добавить("ТорговыеКоды");
	МассивВидовСправочников.Добавить("АналитическиеСчета");
// AVANCORE  - 15.08.2017 { 
	МассивВидовСправочников.Добавить("Активы");
// AVANCORE  - 15.08.2017 } 

	МассивВидовДокументов = Новый Массив;
	
	МассивВидовДокументов.Добавить("ПоступлениеНаРасчетныйСчет");
	МассивВидовДокументов.Добавить("СписаниеСРасчетногоСчета");
	МассивВидовДокументов.Добавить("Сделка");
	МассивВидовДокументов.Добавить("СделкаНаСрочномРынке");
// AVANCORE  - 15.08.2017 { 
	МассивВидовДокументов.Добавить("ОфертаПоОблигациям");
// AVANCORE  - 15.08.2017 } 
	// VTB-Borisov  - 02.05.2018 { 
	МассивВидовДокументов.Добавить("СделкаМНО");
	МассивВидовДокументов.Добавить("ПараметрыРасчетаБанковскихПроцентов");
	
	МассивВидовДокументов.Добавить("ОперацияПоСчетуБрокера");
	МассивВидовДокументов.Добавить("НачислениеВознаграждения");
	
	МассивВидовДокументов.Добавить("ВводВыводЦенныхБумагИзДУ");
	МассивВидовДокументов.Добавить("КонвертацияАктивов");
	МассивВидовДокументов.Добавить("КорпоративноеДействие");
	// VTB-Borisov  - 02.05.2018 }

	МассивВидовБП = Новый Массив;
	МассивВидовБП.Добавить("ВнебиржеваяСделка");
	МассивВидовБП.Добавить("СделкиTn");
	МассивВидовБП.Добавить("СделкиРЕПО");
	
	Для Каждого ВидСправочника из МассивВидовСправочников Цикл
		
		ОбластьСправочникВид = Макет.ПолучитьОбласть("СправочникВид");
		
		КолЗагруженных = 0;
		КолНеЗагруженных = 0;
		
		СтрокиОтбораЗагруженныхОбъектов = ТаблицаЗагруженныхОбъектов.FindRows(Новый Структура("Тип",ВидСправочника));
		КолЗагруженных = СтрокиОтбораЗагруженныхОбъектов.Количество();
		
		СтрокиОтбораНеЗагруженныхОбъектов = ТаблицаНеЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидСправочника));
		КолНеЗагруженных = СтрокиОтбораНеЗагруженныхОбъектов.Количество();
		
		
		ОбластьСправочникВид.Параметры.Справочник = ВидСправочника;
		ОбластьСправочникВид.Параметры.КоличествоУспешно = КолЗагруженных;
		ОбластьСправочникВид.Параметры.КоличествоСОшибкой = КолНеЗагруженных;

		ТабДокумент.Вывести(ОбластьСправочникВид);
		
		Для Каждого СтрокаС_Ошибкой из СтрокиОтбораНеЗагруженныхОбъектов Цикл
			ОбластьСправочникОшибка = Макет.ПолучитьОбласть("СправочникОшибка");
			ОбластьСправочникОшибка.Параметры.Справочник = СтрокаС_Ошибкой.Представление;
			ТабДокумент.Вывести(ОбластьСправочникОшибка);
		КонецЦикла;
		
	КонецЦикла;
	
	
	ОбластьШапкаДокументы = Макет.ПолучитьОбласть("ШапкаДокументы");
	ТабДокумент.Вывести(ОбластьШапкаДокументы);

	Для Каждого ВидДокумента из МассивВидовДокументов Цикл
		
		ОбластьДокументВид = Макет.ПолучитьОбласть("ДокументВид");
		
		КолЗагруженных = 0;
		КолНеЗагруженных = 0;
				
		СтрокиОтбораЗагруженныхОбъектов = ТаблицаЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидДокумента));
		КолЗагруженных = СтрокиОтбораЗагруженныхОбъектов.Количество();
		
		СтрокиОтбораНеЗагруженныхОбъектов = ТаблицаНеЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидДокумента));
		КолНеЗагруженных = СтрокиОтбораНеЗагруженныхОбъектов.Количество();
		
		
		ОбластьДокументВид.Параметры.Документ = ВидДокумента;
		ОбластьДокументВид.Параметры.КоличествоУспешно = КолЗагруженных;
		ОбластьДокументВид.Параметры.КоличествоСОшибкой = КолНеЗагруженных;

		ТабДокумент.Вывести(ОбластьДокументВид);
		
		Для Каждого СтрокаЗагружено из СтрокиОтбораЗагруженныхОбъектов Цикл
			ОбластьДокументСтрока = Макет.ПолучитьОбласть("ДокументСтрока");
			ОбластьДокументСтрока.Параметры.Документ 	= СтрокаЗагружено.Представление;
			ОбластьДокументСтрока.Параметры.Статус 		= СтрокаЗагружено.Статус;
			ТабДокумент.Вывести(ОбластьДокументСтрока);
		КонецЦикла;

		Для Каждого СтрокаС_Ошибкой из СтрокиОтбораНеЗагруженныхОбъектов Цикл
			ОбластьДокументСтрока = Макет.ПолучитьОбласть("ДокументСтрока");
			ОбластьДокументСтрока.Параметры.Документ 	= СтрокаС_Ошибкой.Представление;
			ОбластьДокументСтрока.Параметры.Статус 	= СтрокаС_Ошибкой.Статус;
			ОбластьДокументСтрока.Параметры.ОписаниеОшибки = СтрокаС_Ошибкой.ОписаниеОшибки;
			ТабДокумент.Вывести(ОбластьДокументСтрока);
		КонецЦикла;
		
	КонецЦикла;
	
	ОбластьШапкаБП = Макет.ПолучитьОбласть("ШапкаБизнесПроцессы");
	ТабДокумент.Вывести(ОбластьШапкаБП);
	
	Для Каждого ВидБизнесПроцесса из МассивВидовБП Цикл
		
		ОбластьБизнесПроцессВид = Макет.ПолучитьОбласть("БизнесПроцессВид");
		
		КолЗагруженных = 0;
		КолНеЗагруженных = 0;
				
		СтрокиОтбораЗагруженныхОбъектов = ТаблицаЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидБизнесПроцесса));
		КолЗагруженных = СтрокиОтбораЗагруженныхОбъектов.Количество();
		
		СтрокиОтбораНеЗагруженныхОбъектов = ТаблицаНеЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидБизнесПроцесса));
		КолНеЗагруженных = СтрокиОтбораНеЗагруженныхОбъектов.Количество();
		
		
		ОбластьБизнесПроцессВид.Параметры.БизнесПроцесс = ВидБизнесПроцесса;
		ОбластьБизнесПроцессВид.Параметры.КоличествоУспешно = КолЗагруженных;
		ОбластьБизнесПроцессВид.Параметры.КоличествоСОшибкой = КолНеЗагруженных;

		ТабДокумент.Вывести(ОбластьБизнесПроцессВид);
		
		Для Каждого СтрокаЗагружено из СтрокиОтбораЗагруженныхОбъектов Цикл
			ОбластьБизнесПроцессСтрока = Макет.ПолучитьОбласть("БизнесПроцессСтрока");
			ОбластьБизнесПроцессСтрока.Параметры.БизнесПроцесс 	= СтрокаЗагружено.Представление;
			ОбластьБизнесПроцессСтрока.Параметры.Статус 		= СтрокаЗагружено.Статус;
			ОбластьОформления = ТабДокумент.Вывести(ОбластьБизнесПроцессСтрока);
            Если СтрокаЗагружено.Статус = "Изменен" Тогда
				ТабДокумент.Область(ОбластьОформления.Верх, ОбластьОформления.Лево, ОбластьОформления.Низ, ОбластьОформления.Лево).ЦветФона = WebЦвета.Красный;
			КонецЕсли; 
		КонецЦикла;

		Для Каждого СтрокаС_Ошибкой из СтрокиОтбораНеЗагруженныхОбъектов Цикл
			ОбластьБизнесПроцессСтрока = Макет.ПолучитьОбласть("БизнесПроцессСтрока");
			ОбластьБизнесПроцессСтрока.Параметры.БизнесПроцесс 	= СтрокаС_Ошибкой.Представление;
			ОбластьБизнесПроцессСтрока.Параметры.Статус 	= СтрокаС_Ошибкой.Статус;
			ОбластьБизнесПроцессСтрока.Параметры.ОписаниеОшибки = СтрокаС_Ошибкой.ОписаниеОшибки;
			ТабДокумент.Вывести(ОбластьБизнесПроцессСтрока);
		КонецЦикла;
		
	КонецЦикла;

	Возврат ТабДокумент;
	
КонецФункции

Функция КонвертироватьТаблицуИз_COM(Таблица_COM)
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	Для каждого Колонка из Таблица_COM.Columns Цикл
		ТаблицаРезультат.Колонки.Добавить(Колонка.Имя); 
	КонецЦикла;
	
	Для каждого Строка из Таблица_COM Цикл
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция УстановитьНастройки(ПараметрыВыполненияКоманды)
		
	НастройкиВыполнения = ПараметрыВыполненияКоманды.ПараметрыДополнительнойОбработки;
	Если ТипЗнч(НастройкиВыполнения) <> Тип("Структура") Тогда 
		ПредставлениеНастроек = "<Настройки не установлены>";
		Возврат ПредставлениеНастроек; 
	КонецЕсли;
	
	ЗначенияНастроек = НастройкиВыполнения;
	
	ПредставлениеНастроек = "";
	
	УстановитьПользовательскиеНастройки(ЗначенияНастроек, ПредставлениеНастроек);
	
	Возврат ПредставлениеНастроек;

КонецФункции

Процедура УстановитьПользовательскиеНастройки(Настройки, ПредставлениеНастроек="") Экспорт
	
	Если Настройки.Свойство("Значения") Тогда 
		
		УзелОбмена						= Настройки.Значения.УзелОбмена;
		УзелОбменаРГС					= Настройки.Значения.УзелОбменаРГС;
		ВебСервис 						= Настройки.Значения.ВебСервис;
		ПользовательВебСервиса			= Настройки.Значения.ПользовательВебСервиса;
		ПарольВебСервиса				= Настройки.Значения.ПарольВебСервиса;
		ВебСервисРГС 					= Настройки.Значения.ВебСервисРГС;
		ПользовательВебСервисаРГС		= Настройки.Значения.ПользовательВебСервисаРГС;
		ПарольВебСервисаРГС				= Настройки.Значения.ПарольВебСервисаРГС;
		КоличествоПотоков				= Настройки.Значения.КоличествоПотоков;   
		Таймаут							= Настройки.Значения.Таймаут; 
		СтартоватьСделкиПриЗагрузке 	= Настройки.Значения.СтартоватьСделкиПриЗагрузке;
		ОчищатьСпискиДляОбработки 		= Настройки.Значения.ОчищатьСпискиДляОбработки;
		ИспользоватьТранзакции  		= Настройки.Значения.ИспользоватьТранзакции;
		КоличествоОбъектовНаТранзакцию 	= Настройки.Значения.КоличествоОбъектовНаТранзакцию;
		
		// IMAPPS-35434++
		Если Настройки.Значения.Свойство("ЗадержкаЗапускаФоновогоЗадания") Тогда
			ЗадержкаЗапускаФоновогоЗадания 	= Настройки.Значения.ЗадержкаЗапускаФоновогоЗадания;
		КонецЕсли;
		// IMAPPS-35434--
		
		Почта = Неопределено;
		Если Настройки.Значения.Свойство("ПочтовыйЛогин", Почта) Тогда 
			ПочтовыйЛогин = Почта;
			
			Ящики = XMLЗначение(Тип("ХранилищеЗначения"),Настройки.Значения.СписокРассылки);
			СписокРассылки.Загрузить(Ящики.Получить());
			
		КонецЕсли; 
		
		ПредставлениеНастроек = "УзелОбмена: " + УзелОбмена + " КоличествоПотоков: " + КоличествоПотоков + " Таймаут: " + Таймаут;

	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьФайл(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	Если Файл.Существует() Тогда
		Попытка
			УдалитьФайлы(ИмяФайла);
		Исключение	
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура НастройкиПоУмолчанию(Объект) Экспорт
	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	Объект.СписокРассылки.Очистить();
	Если СтрНайти(СтрокаСоединения, "PROD") > 0 Тогда
		НоваяПочта = Объект.СписокРассылки.Добавить();
		НоваяПочта.ПочтовыйЯщик = "IMAppSupport@vtbcapital.com";
		НоваяПочта = Объект.СписокРассылки.Добавить();
		НоваяПочта.ПочтовыйЯщик = "IMDevelopment@vtbcapital.com";
	Иначе	
		НоваяПочта = Объект.СписокРассылки.Добавить();
		НоваяПочта.ПочтовыйЯщик = "natalya.filimonova@wiminvest.ru";
		
		Объект.ВебСервис = "http://SMSK02MG138U/AVC_UAT_FIN/ws/ndfl13_15.1cws?wsdl";   
		Объект.ПользовательВебСервиса = "svc_web";
		Объект.ПарольВебСервиса = "adm232882";
		
		Объект.ВебСервисРГС = "http://SMSK02MG138U/AVC_UAT_FIN/ws/ndfl13_15.1cws?wsdl";   
		Объект.ПользовательВебСервисаРГС = "svc_web";
		Объект.ПарольВебСервисаРГС = "adm232882";
		
	КонецЕсли;
	Объект.ПочтовыйЛогин = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	Объект.КоличествоПотоков = 5;
	Объект.ОчищатьСпискиДляОбработки = Истина;
	Объект.ИспользоватьТранзакции = Истина;
	Объект.Таймаут = Истина;
	Объект.КоличествоОбъектовНаТранзакцию = 100;
	
КонецПроцедуры

Функция ПропискаРассылки(Знач НомерРассылки)
	Перем ПараметрыПодключения, ИмяИБ;
	
	Попытка
		ПараметрыПодключения = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПодключенияИзСтрокиСоединенияИнформационнойБазы(СтрокаСоединенияИнформационнойБазы());
		ИмяИБ = ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия;
	Исключение
	КонецПопытки;
	
	Прописка = " {" + НомерРассылки + ", ib: " + ?(ЗначениеЗаполнено(ИмяИБ), ИмяИБ, "< .. >") + "}";
	
	Возврат Прописка;
КонецФункции // ПропискаРассылки()

#КонецОбласти

// IMAPPS-31419++
ИмяСобытияЖР = СведенияОВнешнейОбработке().Наименование;
Отказ = Ложь;
ТекстОписаниеОшибки = "";
// IMAPPS-31419--
