//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УчетПоВсемОрганизациям = Пользователи.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "УчетПоВсемОрганизациям");
	Если НЕ УчетПоВсемОрганизациям Тогда
		
		ОсновнаяОрганизация = Пользователи.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяОрганизация");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "СтруктурнаяЕдиница", ОсновнаяОрганизация);

	КонецЕсли;
	
КонецПроцедуры

//#КонецОбласти

