//Перем Макет; //Макет для формирования лога

//ПОДСИСТЕМА ДОПОЛНИТЕЛЬНЫХ ОТЧЕТОВ И ОБРАБОТОК//////////////////////////////////////////

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.1.1.12");
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.06";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'РОСТ Создать неторговые поручения'");
	НоваяКоманда.Идентификатор = "ЗагрузитьПоручения";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'РОСТ Создать неторговые поручения (в фоне)'");
	НоваяКоманда.Идентификатор = "ФоновоеВыполнение";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	
	//+Блок DevOps
	ВерсияПрименения = "1.00";
	Если ВерсияПрименения = ПараметрыРегистрации.Версия Тогда
		ПараметрыРегистрации.Вставить("ПереименоватьПриЗагрузке", Истина);
		ПараметрыРегистрации.Вставить("СтароеИмяФайла", "");
		ПараметрыРегистрации.Вставить("НовоеИмяФайла", "ЗагрузкаНеторговыхПорученийРОСТ");
	КонецЕсли;	
	//-Блок DevOps		
	
	Возврат ПараметрыРегистрации;
КонецФункции

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры

Функция ДополнительнаяОбработкаСсылка() Экспорт
	
	//ДопОбработкаСсылка = Константы.ОперацииПослеОбмена.Получить();
	//
	//Если Не ЗначениеЗаполнено(ДопОбработкаСсылка) Тогда
		ДопОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", 
			ЭтотОбъект.Метаданные().Имя);
	//КонецЕсли;
	
	Возврат ДопОбработкаСсылка;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт

	// Реализация логики команды
	Если ИдентификаторКоманды <> "ФоновоеВыполнение" Тогда Возврат; КонецЕсли;
	
	Лог.Очистить();
	
	ВажностьОшибки = 0;
	ТекстОшибки = "";
	
	Попытка 
		ПредставлениеНастроек = УстановитьНастройки(ПараметрыВыполненияКоманды);
	Исключение
		ВажностьОшибки = 2;
		Лог.ДобавитьСтроку("Ошибка получения настроек отчета: " + ОписаниеОшибки());
	КонецПопытки;
	
	РасчетНаДату = НачалоДня(ТекущаяДатаСеанса());
	
	Если не КалендарьБиржи.Пустая() Тогда
		
		СледРабочийДень0 = КалендарныеГрафики.ПолучитьСледующуюРабочуюДату(КалендарьБиржи, РасчетНаДату, 0);
		Если РасчетНаДату <> НачалоДня(СледРабочийДень0) Тогда
			// не рабочий день.
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		
		ДанныеОтчета = Новый ТабличныйДокумент;
		КоличествоЗаписей = СоздатьПоручения(РасчетНаДату, ДанныеОтчета, ВажностьОшибки);
	
		РассылкаОтчета(ДанныеОтчета, КоличествоЗаписей, ВажностьОшибки);
	Исключение
		ВажностьОшибки = 2;
		Лог.ДобавитьСтроку("Ошибка рассылки отчета по почте: " + ОписаниеОшибки());
	КонецПопытки;

	ТекстЛога = Лог.ПолучитьТекст();
	Если ВажностьОшибки = 2 Тогда
		
		Описание = "Расчет произведен с ошибками: " + ТекстЛога; 
		ЗаписьЖурналаРегистрации(
			"Дополнительные отчеты и обработки." + Метаданные().Представление(),
			УровеньЖурналаРегистрации.Ошибка,,,
			Описание
		);
	Иначе
		ЗаписьЖурналаРегистрации(
			"Дополнительные отчеты и обработки." + Метаданные().Представление(),
			УровеньЖурналаРегистрации.Информация,,,
			"Расчет произведен успешно!"
		);
	КонецЕсли;
	
КонецПроцедуры

Функция УстановитьНастройки(ПараметрыВыполненияКоманды) Экспорт
		
	ДопОбработка = ПараметрыВыполненияКоманды.ДополнительнаяОбработкаСсылка;
	
	НастройкиВыполнения = Неопределено;
	ХранилищеНастроек = ДопОбработка.ХранилищеНастроек;
	
	Если ТипЗнч(ХранилищеНастроек) = Тип("ХранилищеЗначения") Тогда
		НастройкиВыполнения = ХранилищеНастроек.Получить();
	КонецЕсли;
	
	Если ТипЗнч(НастройкиВыполнения) <> Тип("Структура") Тогда  
		Возврат "<Настройки не установлены>"; 
	КонецЕсли;
	
	ЗначенияНастроек = НастройкиВыполнения;
	ПредставлениеНастроек = "";
	УстановитьПользовательскиеНастройки(ЗначенияНастроек, ПредставлениеНастроек);
	
	Возврат ПредставлениеНастроек;
КонецФункции

Процедура УстановитьПользовательскиеНастройки(Настройки, ПредставлениеНастроек="") Экспорт
	
	Если ТипЗнч(Настройки) <> Тип("Структура") Тогда  
		Возврат; 
	КонецЕсли;
 
	Настройки.Свойство("АдресWS", АдресWS);
	Настройки.Свойство("Логин", Логин);
	Настройки.Свойство("Пароль", Пароль);

	Настройки.Свойство("КалендарьБиржи", КалендарьБиржи);
	Настройки.Свойство("НеКонтролироватьДостаточностьДС", НеКонтролироватьДостаточностьДС);
	Настройки.Свойство("АдаптерFIX", АдаптерFIX);
	Настройки.Свойство("КодСчетаБрокер", КодСчетаБрокер);

	Настройки.Свойство("ДопРеквизитСтатусПортфеля", ДопРеквизитСтатусПортфеля);
	Настройки.Свойство("СтатусДляПоиска", СтатусДляПоиска);
	Настройки.Свойство("СтатусДСОтправленыБрокеру", СтатусДСОтправленыБрокеру);
	Настройки.Свойство("СтатусДляПеревода", СтатусДляПеревода);
	Настройки.Свойство("СтатусПоданоПоручениеНаВыводДС_СБрокера", СтатусПоданоПоручениеНаВыводДС_СБрокера);  
	Настройки.Свойство("СтатусДСВыведены", СтатусДСВыведены);  
	
	Настройки.Свойство("ДопРеквизитДатаОперации", ДопРеквизитДатаОперации);
	Настройки.Свойство("АктивРубли", АктивРубли);
	
	Настройки.Свойство("ПризнакПозицияВыгружена", ПризнакПозицияВыгружена);
	Настройки.Свойство("ПризнакДатаПересчетаРСА", ПризнакДатаПересчетаРСА);
	
	Почта = Неопределено;
	Если Настройки.Свойство("ПочтовыйЛогин", ПочтовыйЛогин) Тогда 
		Ящики = XMLЗначение(Тип("ХранилищеЗначения"),Настройки.СписокРассылки);
		СписокРассылки.Загрузить(Ящики.Получить());
	КонецЕсли;
	//ПредставлениеНастроек = "Период с:"+Формат(ДатаНачала,"ДФ=dd.MM.yyyy") + " по:"+Формат(ДатаОкончания,"ДФ=dd.MM.yyyy") + " ";
    ПредставлениеНастроек = "Представление настроек";

КонецПроцедуры

#Область DevOps

Процедура ЗагрузитьНастройки(ПараметрыРегистрации) Экспорт
	
	ВерсияПрименения = "1.00";
	ТекущаяРегистрация = СведенияОВнешнейОбработке();
	
	Если ВерсияПрименения = ТекущаяРегистрация.Версия Тогда
		
		ПараметрыРегистрации.Вставить("ЗагружатьНастройки", Истина);
		
		НастройкиПоУмолчанию(ЭтотОбъект);
		
		ЗаголовокНастроек = "";
		ЗначенияПараметров = УстановитьПараметры(ЗаголовокНастроек);
		
		ПараметрыРегистрации.Вставить("Настройки", Новый Структура("Значения, ЗаголовокНастроек", ЗначенияПараметров, ЗаголовокНастроек));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НастройкиПоУмолчанию(Объект) Экспорт
	
	Объект.ПочтовыйЛогин = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	Объект.СписокРассылки.Очистить();
	
	//НоваяПочта = Объект.СписокРассылки.Добавить();
	//НоваяПочта.ПочтовыйЯщик = "VTBAMMiddleoffice@vtbcapital.com";
	//
	//НоваяПочта = Объект.СписокРассылки.Добавить();
	//НоваяПочта.ПочтовыйЯщик = "IMAppSupport@vtbcapital.com";
	
	НоваяПочта = Объект.СписокРассылки.Добавить();
	НоваяПочта.ПочтовыйЯщик = "Mikhail.Grishin@vtbcapital.ru";
	
	Объект.АдресWS 	= "http://SMSK02MG138U/DOC_MAN_UAT/ws/dm.1cws?wsdl";
	Объект.Логин 	= "svc_retail_test";	
	Объект.Пароль 	= "Ftr4436f~!"; 
	
	
КонецПроцедуры

Функция УстановитьПараметры(ЗаголовокНастроек) Экспорт
	
	Значения = Новый Структура();      
	Значения.Вставить("ПочтовыйЛогин", ЭтотОбъект.ПочтовыйЛогин);
	
	Значения.Вставить("АдресWS", ЭтотОбъект.АдресWS);
	Значения.Вставить("Логин", ЭтотОбъект.Логин);
	Значения.Вставить("Пароль", ЭтотОбъект.Пароль);
	
	Значения.Вставить("КалендарьБиржи", ЭтотОбъект.КалендарьБиржи);
	Значения.Вставить("НеКонтролироватьДостаточностьДС", ЭтотОбъект.НеКонтролироватьДостаточностьДС);
	Значения.Вставить("АдаптерFIX", ЭтотОбъект.АдаптерFIX); 
	Значения.Вставить("КодСчетаБрокер", ЭтотОбъект.КодСчетаБрокер); 
	
	Значения.Вставить("ДопРеквизитСтатусПортфеля", ЭтотОбъект.ДопРеквизитСтатусПортфеля);
	Значения.Вставить("СтатусДляПоиска", ЭтотОбъект.СтатусДляПоиска);
	Значения.Вставить("СтатусДСОтправленыБрокеру", ЭтотОбъект.СтатусДСОтправленыБрокеру);
	Значения.Вставить("СтатусДляПеревода", ЭтотОбъект.СтатусДляПеревода);
	Значения.Вставить("СтатусПоданоПоручениеНаВыводДС_СБрокера", ЭтотОбъект.СтатусПоданоПоручениеНаВыводДС_СБрокера);
	Значения.Вставить("СтатусДСВыведены", ЭтотОбъект.СтатусДСВыведены);
	Значения.Вставить("ДопРеквизитДатаОперации",ЭтотОбъект.ДопРеквизитДатаОперации);
	Значения.Вставить("АктивРубли",ЭтотОбъект.АктивРубли);

	Значения.Вставить("ПризнакДатаПересчетаРСА", ЭтотОбъект.ПризнакДатаПересчетаРСА);
	Значения.Вставить("ПризнакПозицияВыгружена", ЭтотОбъект.ПризнакПозицияВыгружена);
	
	Значения.Вставить("СписокРассылки", XMLСтрока(Новый ХранилищеЗначения(ЭтотОбъект.СписокРассылки.Выгрузить())));
	
	ПредставлениеПочты = ?(ЭтотОбъект.СписокРассылки.Количество()>0, ", Установлен список рассылки","");
	
	ЗаголовокНастроек = СокрЛП(ПредставлениеПочты);
	
	Возврат Значения;
	
КонецФункции

#КонецОбласти

Функция ПолучитьСуммуКупоны(НаДату)
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("НаДату", НачалоДня(НаДату));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Актив КАК Актив,
	|	т.Актив.Объект КАК АктивОбъект,
	|	СУММА(т.Количество) КАК Количество
	|ПОМЕСТИТЬ втАктивы
	|ИЗ
	|	РегистрСведений.ФактическаяПозиция КАК т
	|ГДЕ
	|	т.Дата = &НаДату
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Актив,
	|	т.Актив.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Облигация КАК Облигация,
	|	т.Документ КАК Документ
	|ПОМЕСТИТЬ втКупоны
	|ИЗ
	|	РегистрСведений.КупонноеРасписаниеПоОблигациям.СрезПоследних(
	|			КОНЕЦПЕРИОДА(&НаДату, ДЕНЬ),
	|			Облигация В
	|				(ВЫБРАТЬ
	|					т.АктивОбъект
	|				ИЗ
	|					втАктивы КАК т)) КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКупоны.Облигация КАК Облигация,
	|	втАктивы.Количество КАК Количество,
	|	ЕСТЬNULL(тКупоны.РазмерДоходаВРублях, 0) * ЕСТЬNULL(втАктивы.Количество, 0) КАК СуммаКупонов
	|ИЗ
	|	втКупоны КАК втКупоны
	|		ЛЕВОЕ СОЕДИНЕНИЕ втАктивы КАК втАктивы
	|		ПО втКупоны.Облигация = втАктивы.АктивОбъект
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КупонноеРасписание.Купоны КАК тКупоны
	|		ПО втКупоны.Документ = тКупоны.Ссылка
	|ГДЕ
	|	тКупоны.ДатаОкончанияКупонногоПериода = &НаДату
	|ИТОГИ
	|	СУММА(СуммаКупонов)
	|ПО
	|	ОБЩИЕ";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СуммаКупоны = 0;
	Если Выборка.Следующий() Тогда
		СуммаКупоны = Выборка.СуммаКупонов;
	КонецЕсли;
	
	Возврат СуммаКупоны;
	
КонецФункции

Функция ПолучитьСуммуСделкиПродажи(НаДату)
	
	ПродажиНачПериод = НачалоДня(КалендарныеГрафики.ПолучитьСледующуюРабочуюДату(КалендарьБиржи, НаДату, -1));
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ПродажиНачПериод", ПродажиНачПериод);
	Запрос.УстановитьПараметр("ПродажиКонПериод", КонецДня(ПродажиНачПериод));
	Запрос.УстановитьПараметр("Направление", Перечисления.ВидыОперацийСделки.Продажа);
	Запрос.УстановитьПараметр("СтатусДСВыведены", СтатусДСВыведены);
	Запрос.УстановитьПараметр("СвСтатусПортфеля", ДопРеквизитСтатусПортфеля);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.СуммаРасчетов КАК СуммаСделки
	|ИЗ
	|	Документ.Сделка.РаспределениеПоПортфелям КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДСведения
	|		ПО т.Портфель = ДСведения.Объект
	|			И (ДСведения.Свойство = &СвСтатусПортфеля)
	|ГДЕ
	|	т.Ссылка.Дата МЕЖДУ &ПродажиНачПериод И &ПродажиКонПериод
	|	И т.Ссылка.Проведен
	|	и т.Ссылка.Направление = &Направление
	|	И ДСведения.Значение <> &СтатусДСВыведены
	|ИТОГИ
	|	СУММА(СуммаСделки)
	|ПО
	|	ОБЩИЕ";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СуммаСделки = 0;
	Если Выборка.Следующий() Тогда
		СуммаСделки = Выборка.СуммаСделки;
	КонецЕсли;
	
	Возврат СуммаСделки;
	
КонецФункции 

Функция ПолучитьСуммуСделкиПодПокупки(НаДату) 
	
	списСтатусы = новый Массив;
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("НачПериод", НачалоДня(НаДату));
	Запрос.УстановитьПараметр("НаДату", КонецДня(НаДату));
	Запрос.УстановитьПараметр("Направление", Перечисления.ВидыОперацийСделки.Покупка);
	Запрос.УстановитьПараметр("СтатусыФормированиеПоручений", списСтатусы);
	Запрос.УстановитьПараметр("СвСтатусПортфеля", ДопРеквизитСтатусПортфеля);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Портфель КАК Портфель,
	|	т.СуммаПоручения КАК СуммаСделки
	|ИЗ
	|	Документ.Поручение КАК т
	|ГДЕ
	|	т.Дата >= &НачПериод
	|	И т.Дата <= &НаДату
	|	И т.Проведен
	|	И т.ВидОперацииНеторговогоПоручения = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНеторговыхПоручений.Ввод)
	|ИТОГИ
	|	СУММА(СуммаСделки)
	|ПО
	|	ОБЩИЕ";
	
	//"ВЫБРАТЬ
	//|	т.Портфель КАК Портфель,
	//|	т.СуммаПоручения КАК СуммаПоручения
	//|ПОМЕСТИТЬ втДС_ПодПокупки
	//|ИЗ
	//|	Документ.Поручение КАК т
	//|ГДЕ
	//|	т.Дата >= &НачПериод
	//|	И т.Дата <= &НаДату
	//|	И т.Проведен
	//|	И т.ВидОперацииНеторговогоПоручения = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНеторговыхПоручений.Ввод)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	т.Портфель КАК Портфель,
	//|	т.СуммаОстаток КАК СуммаСделки
	//|ПОМЕСТИТЬ втПокупкаИсполнена
	//|ИЗ
	//|	РегистрНакопления.ПлановаяПозиция.Остатки(&НаДату, Актив.ВидАктива = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыАктивов.Валюты)) КАК т
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДСведения
	//|		ПО т.Портфель = ДСведения.Объект
	//|			И (ДСведения.Свойство = &СвСтатусПортфеля)
	//|ГДЕ
	//|	т.Сделка.Направление = &Направление
	//|	//И ДСведения.Значение В(&СтатусыФормированиеПоручений)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	т1.Портфель КАК Портфель,
	//|	т1.СуммаПоручения + ЕСТЬNULL(т2.СуммаСделки, 0) КАК СуммаСделки
	//|ИЗ
	//|	втДС_ПодПокупки КАК т1
	//|		ЛЕВОЕ СОЕДИНЕНИЕ втПокупкаИсполнена КАК т2
	//|		ПО т1.Портфель = т2.Портфель
	//|ИТОГИ
	//|	СУММА(СуммаСделки)
	//|ПО
	//|	ОБЩИЕ";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СуммаСделки = 0;
	Если Выборка.Следующий() Тогда
		СуммаСделки = Выборка.СуммаСделки;
	КонецЕсли;
	
	Возврат СуммаСделки;
	
КонецФункции 

Функция ПолучитьСуммуДСБрокер(ТекстЛог, ВажностьОшибки) Экспорт 
	
	Если ЭтоТест Тогда
		Возврат 12000000;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Позиция", Новый Соответствие);
	Результат.Вставить("Описание", "");
	Результат.Вставить("Источник", "");
	Результат.Вставить("Журнал", "");
	Результат.Вставить("Отказ", Ложь);    
	
	СуммаБрокер = 0;
	
	ПараметрыАдаптера = Адаптеры.ПараметрыАдаптера(АдаптерFIX);
	ЗаполнитьЗначенияСвойств(ПараметрыАдаптера, Справочники.Адаптеры.БезопасныеНастройки(АдаптерFIX));
	
	КодыКлиентов = Новый ТаблицаЗначений();
	КодыКлиентов.Колонки.Добавить("БрокерскийСчет", Новый ОписаниеТипов("СправочникСсылка.МестаХранения"));
	КодыКлиентов.Колонки.Добавить("PartyIDSource", Новый ОписаниеТипов("Строка"));
	КодыКлиентов.Колонки.Добавить("PartyID", Новый ОписаниеТипов("Строка"));
	КодыКлиентов.Колонки.Добавить("PartyRole", Новый ОписаниеТипов("Строка"));

	МенеджерыАдаптеров = Справочники.Адаптеры.Менеджеры();
	Менеджер = МенеджерыАдаптеров[ПараметрыАдаптера.Вид];

	Строка = КодыКлиентов.Добавить();
	Строка.PartyIDSource = "D";
	Строка.PartyID = КодСчетаБрокер;  //код клиента	UAT 9U056/9U0078	8U041/8U0046
	Строка.PartyRole = "3";

	Указания = Новый Структура("ПараметрыАдаптера, КодыКлиентов", ПараметрыАдаптера, КодыКлиентов);
	Позиция = Менеджер.Позиция(Указания, Результат);

	Если Позиция.Количество() = 0 Тогда
		Если Результат.Описание <> "" Тогда
			ЭтотОбъект.Лог.ДобавитьСтроку("Сообщения менеджера адаптера (позиция): "+Результат.Описание);
		КонецЕсли;
		
		ЭтотОбъект.Лог.ДобавитьСтроку(НСтр("ru = 'Данные не были получены.';en = 'No data received.'"));
		ВажностьОшибки = 2;
	КонецЕсли; 
	
	Для Каждого СтрокаВх Из Позиция Цикл
		Если СтрокаВх.type <> "money" Тогда
			Продолжить;
		КонецЕсли;
		
		КодКлиента = СтрокаВх.client_code;
		//Если ПустаяСтрока(КодКлиента) Тогда
		//	ДобавитьЗаписьЖурнала(НСтр("ru = 'Не удалось разобрать код клиента.'"));
		//	Продолжить;
		//КонецЕсли;

		СуммаБрокер = СуммаБрокер + СтрокаВх.curr_bal - СтрокаВх.locked; 
	КонецЦикла;
	
	Возврат СуммаБрокер;
КонецФункции

Функция ПроверитьОбновитьСтатусДСВыведены(РасчетНаДату, ТабДок, ВажностьОшибки) Экспорт
	
	КоличествоЗаписей = 0;
	
	Макет = ПолучитьМакет("МакетОтчета");
	ТекОбласть = Макет.ПолучитьОбласть("НовыйСтатусШапка");
	
	ТабДок.Вывести(ТекОбласть);
		
	ТекОбласть = Макет.ПолучитьОбласть("НовыйСтатусСтрока");
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	Запрос.УстановитьПараметр("СвСтатусПортфеля", ДопРеквизитСтатусПортфеля);
	Запрос.УстановитьПараметр("СвДатаСтатусаПортфеля", ДопРеквизитДатаОперации);
	Запрос.УстановитьПараметр("СтатусПоданыПорученияНаВывод", СтатусПоданоПоручениеНаВыводДС_СБрокера);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Объект КАК Портфель,
	|	т.Значение КАК ТекСтатус,
	|	isnull(т2.Значение, &ПустаяДата) КАК ДатаСтатуса
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК т2
	|		ПО т.Объект = т2.Объект
	|			И &СвДатаСтатусаПортфеля = т2.Свойство
	|ГДЕ
	|	т.Свойство = &СвСтатусПортфеля
	|	И т.Значение = &СтатусПоданыПорученияНаВывод
	|	И т.Объект ССЫЛКА Справочник.Портфели";
	
	ВыборкаПортфели = Запрос.Выполнить().Выбрать();
	
	ТекДата = ТекущаяДата();
	
	Пока ВыборкаПортфели.Следующий() Цикл
		
		Если (ТекДата - ВыборкаПортфели.ДатаСтатуса) > 30 * 60 Тогда
			
			КоличествоЗаписей = КоличествоЗаписей + 1;
			
			//прошло более 30 мин с подачи поручения на вывод, в новый статус переводим автоматически
			ОбновитьСтатусПоПортфелю(ВыборкаПортфели.Портфель, СтатусДСВыведены);

			ТекОбласть.Параметры.Номер  =  КоличествоЗаписей;   
			ТекОбласть.Параметры.Портфель = ВыборкаПортфели.Портфель; 
			ТекОбласть.Параметры.НовыйСтатус = СтатусДСВыведены; 
			
			ТабДок.Вывести(ТекОбласть);
		КонецЕсли;
		
	КонецЦикла;
	
	ТекОбласть = Макет.ПолучитьОбласть("НовыйСтатусПодвал");
	ТабДок.Вывести(ТекОбласть);
	
	Возврат КоличествоЗаписей
		
КонецФункции

Функция СоздатьПоручения(РасчетНаДату, ТабДок, ВажностьОшибки) Экспорт
	
	ТекстОшибки = ""; 
	
	ТабДокНовыйСтатус = новый ТабличныйДокумент;
	КолвоПортфелей = ПроверитьОбновитьСтатусДСВыведены(РасчетНаДату, ТабДокНовыйСтатус, ВажностьОшибки);
	
	Если КолвоПортфелей > 0 Тогда
		ТабДок.Вывести(ТабДокНовыйСтатус);
	КонецЕсли;
	
	СуммаНаБрокере = ПолучитьСуммуДСБрокер(ТекстОшибки, ВажностьОшибки);
	СуммаПогашенногоКупона = ПолучитьСуммуКупоны(РасчетНаДату);
	СуммаСделкиПродажи = ПолучитьСуммуСделкиПродажи(РасчетНаДату);
	СуммаСделкиПодПокупки = ПолучитьСуммуСделкиПодПокупки(РасчетНаДату);
	СвободныйОстаток = СуммаНаБрокере - СуммаСделкиПродажи - СуммаСделкиПодПокупки;
		
	КоличествоЗаписей = 0;
	
	ПорученияНаОтправку = Новый Массив();
	
	Макет = ПолучитьМакет("МакетОтчета");
	ТекОбласть = Макет.ПолучитьОбласть("Шапка");
	ТекОбласть.Параметры.СуммаНаБрокере = СуммаНаБрокере;
	ТекОбласть.Параметры.СуммаСделкиПродажи = СуммаСделкиПродажи;
	ТекОбласть.Параметры.СуммаСделкиПодПокупки = СуммаСделкиПодПокупки;
	ТекОбласть.Параметры.СвободныйОстаток = СвободныйОстаток; 
	
	ТабДок.Вывести(ТекОбласть);
		
	ТекОбласть = Макет.ПолучитьОбласть("СтрокаТаблицы");	
	
	Попытка
		ТаблицаПортфелей = ПолучитьПортфелиДляСозданияПоручений();
	Исключение
		ВажностьОшибки = 2;
		ЭтотОбъект.Лог.ДобавитьСтроку("Возникла ошибка при формировании таблицы портфелей. Список портфелей не сформирован.");
		Возврат КоличествоЗаписей;
	КонецПопытки;
	
	Если ТаблицаПортфелей = Неопределено Тогда
		ВажностьОшибки = 1;
		ЭтотОбъект.Лог.ДобавитьСтроку("Не найдено портфелей для создания поручений.");
		Возврат КоличествоЗаписей
	КонецЕсли;
	
	СуммаИтогоСформированно = 0; 
	СуммаОжидаетПоступленияНаБрокСчет  =  0;
	
	флСервисОтказ = Ложь;
	тхтСервисОтказ = "";
	Сервис1СДО = СервисИнит(флСервисОтказ, тхтСервисОтказ);
	
	Если флСервисОтказ Тогда
		ВажностьОшибки = 2;
		ЭтотОбъект.Лог.ДобавитьСтроку(тхтСервисОтказ);
		Возврат КоличествоЗаписей;
	КонецЕсли;
	
	НПП = 0;
	
	Для Каждого ТекСтр Из ТаблицаПортфелей Цикл
		
		флСервисОтказ = Ложь;
		тхтСервисОтказ = "";
		СтруктураПортфель = ПолучитьСуммуПортфеля(Сервис1СДО, ТекСтр.НомерДоговора, флСервисОтказ, тхтСервисОтказ);
		
		Если флСервисОтказ Тогда 
			ВажностьОшибки = 2;
			ЭтотОбъект.Лог.ДобавитьСтроку("Портфель: " + ТекСтр.Портфель + тхтСервисОтказ);
			Продолжить;
		КонецЕсли;
				
		Если СтруктураПортфель.Сумма > 0 Тогда 
			
			Если не СтруктураПортфель.НаБрокере Тогда
				
				НПП = НПП + 1; 
				ТекОбласть.Параметры.Номер  =  НПП;   
				ТекОбласть.Параметры.Портфель = ТекСтр.Портфель; 
				ТекОбласть.Параметры.Сумма = СтруктураПортфель.Сумма;
				ТекОбласть.Параметры.Поручение = "Поручение не сформировано, ДС поступили на ЕРС, на брокерский счет не отправлены"; 
				
				Если ВажностьОшибки < 1 Тогда
					ВажностьОшибки = 1;
				КонецЕсли;
				
				ТабДок.Вывести(ТекОбласть);
				
			Иначе
				
				Если СтруктураПортфель.Сумма <= СвободныйОстаток или НеКонтролироватьДостаточностьДС Тогда
			
					Если ЗначениеЗаполнено(ТекСтр.СсылкаНаПоручение) Тогда
						//|	МАКСИМУМ(Поручение.Ссылка) КАК СсылкаНаПоручение,
						//|	СУММА(Поручение.СуммаПоручения) КАК СуммаПоручения
						НПП = НПП + 1; 
						ТекОбласть.Параметры.Номер  =  НПП;   
						ТекОбласть.Параметры.Портфель = ТекСтр.Портфель; 
						ТекОбласть.Параметры.Сумма = СтруктураПортфель.Сумма;
						ТекОбласть.Параметры.Поручение = СтрШаблон("Для портфеля уже есть поручение: %1 на сумма %2", ТекСтр.СсылкаНаПоручение, ТекСтр.СуммаПоручения); 
						
						Если ВажностьОшибки < 1 Тогда
							ВажностьОшибки = 1;
						КонецЕсли;
						
						ТабДок.Вывести(ТекОбласть);
					Иначе
						СуммаОжидаетПоступленияНаБрокСчет = СуммаОжидаетПоступленияНаБрокСчет + СтруктураПортфель.Сумма;
					
						НачатьТранзакцию();  //2 действия в транзакции - создание поручения и обновление данных доп сведений
						
						Попытка 
							
							Поручение = ЗаписатьПоручение(ТекСтр.Портфель, СтруктураПортфель.Сумма);
							ЗаписатьСЧА(ТекСтр.Портфель, СтруктураПортфель.Сумма);
							ОбновитьСтатусПоПортфелю(ТекСтр.Портфель, СтатусДляПеревода);
							
							УстановитьПризнакДатаПересчетаРСА(ТекСтр.Портфель);
							УстановитьПризнакПозицияВыгружена(ТекСтр.Портфель);
											
							ЗафиксироватьТранзакцию();
							
						Исключение
							ОтменитьТранзакцию();
							ВажностьОшибки = 2;
							ЭтотОбъект.Лог.ДобавитьСтроку("Портфель: " +ТекСтр.Портфель+" Ошибка: "+ ОписаниеОшибки());
							Продолжить
						КонецПопытки;
						
						//Заполнить Табдок при удачном 
						КоличествоЗаписей = КоличествоЗаписей + 1;
						
				
						НПП = НПП + 1; 
						ТекОбласть.Параметры.Номер  =  НПП;   
						ТекОбласть.Параметры.Портфель = ТекСтр.Портфель; 
						ТекОбласть.Параметры.Сумма = СтруктураПортфель.Сумма;
						ТекОбласть.Параметры.Поручение = Поручение; 
						
						СуммаИтогоСформированно = СуммаИтогоСформированно + СтруктураПортфель.Сумма;
						СвободныйОстаток = СвободныйОстаток - СтруктураПортфель.Сумма;
						
						ТабДок.Вывести(ТекОбласть);
						
						ПорученияНаОтправку.Добавить(Поручение);
						
					КонецЕсли;
					
				Иначе
					
					Если ТекСтр.СтатусПортфеля <> СтатусДСОтправленыБрокеру Тогда
						ОбновитьСтатусПоПортфелю(ТекСтр.Портфель, СтатусДСОтправленыБрокеру);
					КонецЕсли;
					
					СуммаОжидаетПоступленияНаБрокСчет = СуммаОжидаетПоступленияНаБрокСчет + СтруктураПортфель.Сумма;
				
				
					НПП = НПП + 1; 
					ТекОбласть.Параметры.Номер  =  НПП;   
					ТекОбласть.Параметры.Портфель = ТекСтр.Портфель; 
					ТекОбласть.Параметры.Сумма = СтруктураПортфель.Сумма;
					ТекОбласть.Параметры.Поручение = "Поручение не сформировано, недостаточно средств на счете: " + КодСчетаБрокер; 
					
					Если ВажностьОшибки < 1 Тогда
						ВажностьОшибки = 1;
					КонецЕсли;
					
					ТабДок.Вывести(ТекОбласть);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекОбласть = Макет.ПолучитьОбласть("Подвал");
	ТекОбласть.Параметры.СуммаИтогоОсталось = СуммаОжидаетПоступленияНаБрокСчет - СуммаИтогоСформированно;
	ТекОбласть.Параметры.СуммаИтогоСформированно = СуммаИтогоСформированно; 
	ТекОбласть.Параметры.СуммаОжидаетПоступленияНаБрокСчет  =  СуммаОжидаетПоступленияНаБрокСчет;   
	ТабДок.Вывести(ТекОбласть);
	
	Возврат КоличествоЗаписей
		
КонецФункции

Функция ПолучитьПортфелиДляСозданияПоручений()
	
	списСтатусыДляПроверки = Новый Массив;
	списСтатусыДляПроверки.Добавить(СтатусДляПоиска);
	списСтатусыДляПроверки.Добавить(СтатусДСОтправленыБрокеру);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеСведения.Объект КАК Портфель,
		|	ДополнительныеСведения.Значение КАК СтатусПортфеля,
		|	ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.Портфели).НомерДоговора КАК НомерДоговора,
		|	ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.Портфели).КодПортфеля КАК КодПортфеля
		|ПОМЕСТИТЬ ВТ_Портфели
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство = &Свойство
		|	И ДополнительныеСведения.Значение В(&Значение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Портфели.Портфель КАК Портфель,
		|	ВТ_Портфели.СтатусПортфеля КАК СтатусПортфеля,
		|	ВТ_Портфели.НомерДоговора КАК НомерДоговора,
		|	ВТ_Портфели.КодПортфеля КАК КодПортфеля,
		|	МАКСИМУМ(Поручение.Ссылка) КАК СсылкаНаПоручение,
		|	СУММА(Поручение.СуммаПоручения) КАК СуммаПоручения
		|ИЗ
		|	ВТ_Портфели КАК ВТ_Портфели
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручение
		|		ПО ВТ_Портфели.Портфель = Поручение.Портфель
		|			И (Поручение.Проведен)
		|			И (Поручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыПоручений.НеторговоеПоручение))
		|			И (Поручение.ВидОперацииНеторговогоПоручения = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНеторговыхПоручений.Ввод))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Портфели.Портфель,
		|	ВТ_Портфели.СтатусПортфеля,
		|	ВТ_Портфели.НомерДоговора,
		|	ВТ_Портфели.КодПортфеля";
	//ДокументПоручение.ВидОперации = Перечисления.ВидыПоручений.НеторговоеПоручение;
	//ДокументПоручение.ВидОперацииНеторговогоПоручения = Перечисления.ВидыОперацийНеторговыхПоручений.Ввод;
	
	Запрос.УстановитьПараметр("Значение", списСтатусыДляПроверки);
	Запрос.УстановитьПараметр("Свойство", ДопРеквизитСтатусПортфеля);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено
	Иначе
		Возврат РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	
КонецФункции

Функция СписокСубпортфелейБрокерПоПортфелю(Портфель) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Субпортфели.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Субпортфели КАК Субпортфели
	|ГДЕ
	|	Субпортфели.Портфель = &Портфель
	|	И НЕ Субпортфели.ПометкаУдаления
	|	И Субпортфели.МестоХранения.ВидМестаХранения = &ВидМестаХранения");
	Запрос.УстановитьПараметр("Портфель", Портфель);
	Запрос.УстановитьПараметр("ВидМестаХранения", ПланыВидовХарактеристик.ВидыМестХранения.БрокерскиеСчета);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

Функция СервисИнит(Отказ, ТекстОшибки)
	
	Попытка
		Определения = Новый WSОпределения(АдресWS, Логин, Пароль, , 20);
		
		Сервис = Новый WSПрокси(Определения, "http://www.1c.ru/dm", "DMService", "DMServiceSoap12", , 20);
		Сервис.Пользователь = Логин;
		Сервис.Пароль = Пароль;
	Исключение
		Отказ = Истина;
		ТекстОшибки = ТекстОшибки
	КонецПопытки;
	
	Возврат Сервис;
КонецФункции

Функция ПолучитьСуммуПортфеля(Сервис, НомерДоговора, Отказ, ТекстОшибки)
	//{
	//"НомерДУ": "МИ5",
	//"Сумма": 0,
	//"ОтправленоНаБрокерский": false 
	//}	
	
	Ответ = новый Структура("Сумма,НаБрокере", 0, Ложь);
	
	СтрокаJSON = Сервис.GetAgreementAmount(НомерДоговора);
	
	Если СтрокаJSON = "" Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Попытка
		Ридер = новый ЧтениеJSON;
		//Ридер.УстановитьСтроку(СтрШаблон("{""root"": %1}", СтрокаJSON));
		Ридер.УстановитьСтроку(СтрокаJSON);
		
		ОтветСервиса = ПрочитатьJSON(Ридер, Истина);
		
		Ответ.Сумма = ОтветСервиса["Сумма"];
		Ответ.НаБрокере = ОтветСервиса["ОтправленоНаБрокерский"];
		
	Исключение
		Отказ = Истина;
		ТекстОшибки = ТекстОшибки + Символы.ПС + ("Ошибка разбора сообщения: " + СтрокаJSON);
	КонецПопытки;
	
	Возврат Ответ
	
КонецФункции

Функция ЗаписатьПоручение(Портфель, Сумма)
	
	СписокСубпортфелей = СписокСубпортфелейБрокерПоПортфелю(Портфель);
	
	Если СписокСубпортфелей.Количество()>1 Тогда
		ВызватьИсключение "У портфеля более одного субсчета";
	ИначеЕсли  СписокСубпортфелей.Количество()=0 Тогда
		ВызватьИсключение "У портфеля нет субсчетов";
	КонецЕсли;	
		
	Субпортфель = СписокСубпортфелей[0];

	ДокументПоручение = Документы.Поручение.СоздатьДокумент();
	ДокументПоручение.Дата = ТекущаяДатаСеанса();
	ДокументПоручение.ВидОперации = Перечисления.ВидыПоручений.НеторговоеПоручение;
	ДокументПоручение.ВидОперацииНеторговогоПоручения = Перечисления.ВидыОперацийНеторговыхПоручений.Ввод;
	ДокументПоручение.Актив = АктивРубли;
	ДокументПоручение.ВалютаРасчетов = Справочники.Валюты.RUB;
	ДокументПоручение.Внебиржевая = Истина;
	ДокументПоручение.ЗаполнениеПоПортфелю = Истина;
	ДокументПоручение.Портфель = Портфель;
	ДокументПоручение.Субпортфель = Субпортфель;
	ДокументПоручение.Количество = Сумма;
	ДокументПоручение.ВысокийПриоритет = Ложь;
	ДокументПоручение.ДатаОплаты = ТекущаяДатаСеанса();
	ДокументПоручение.ДатаПоставки = ТекущаяДатаСеанса();
	ДокументПоручение.Направление = Перечисления.ВидыОперацийСделки.Покупка;
	ДокументПоручение.РежимFOP = Перечисления.РежимыFOP.PREPAYMENT;
	ДокументПоручение.Срочность = 1;
	ДокументПоручение.Субпортфель = Субпортфель;
	ДокументПоручение.СубпортфельЦБ = Субпортфель;
	ДокументПоручение.СуммаПоручения = Сумма;
	ДокументПоручение.ТипРасчетовПоВнебиржевойСделке=Перечисления.ТипыРасчетовПоВнебиржевымСделкам.FOP;
	ДокументПоручение.УсловиеИсполнения=Перечисления.УсловияИсполненияОрдеровНаБирже.PUT_IN_QUEUE;
	ДокументПоручение.Комментарий = "Создан автоматически обработой Загрузка неторговых поручений РОСТ";
	
	НСтрРаспределение = ДокументПоручение.РаспределениеПоПортфелям.Добавить();
	НСтрРаспределение.Портфель = Портфель;
	НСтрРаспределение.Количество = Сумма;
	НСтрРаспределение.Субпортфель = Субпортфель;
	НСтрРаспределение.СубпортфельЦБ = Субпортфель;
	НСтрРаспределение.МестоХранения = СубПортфель.МестоХранения;
	НСтрРаспределение.МестоХраненияЦБ = Субпортфель.МестоХранения;

	НСтрДоступы1 = ДокументПоручение.НаборыЗначенийДоступа.Добавить();
	НСтрДоступы1.НомерНабора=2;
	НСтрДоступы1.Чтение = Истина;
	НСтрДоступы1.Изменение = Истина;
	
	НСтрДоступы2 = ДокументПоручение.НаборыЗначенийДоступа.Добавить();
	НСтрДоступы2.НомерНабора=1;
	НСтрДоступы2.Чтение = Истина;
	НСтрДоступы2.Изменение = Истина;
	
	ДокументПоручение.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ДокументПоручение.Ссылка;
	
КонецФункции

Функция ЗаписатьСЧА(Портфель, Сумма)
	
	мЗаписьСЧА = РегистрыСведений.РегистрРСА_СЧА.СоздатьМенеджерЗаписи();
	мЗаписьСЧА.Активность = Истина;
	мЗаписьСЧА.Период = ТекущаяДата();
	мЗаписьСЧА.Портфель = Портфель;
	мЗаписьСЧА.РСА = Сумма;
	мЗаписьСЧА.СЧА = Сумма;
	мЗаписьСЧА.Записать();

	мЗаписьДатаА = РегистрыСведений.ДатаАктуальностиФактическойПозиции.СоздатьМенеджерЗаписи();
	мЗаписьДатаА.Активность = Истина;
	мЗаписьДатаА.Период = ТекущаяДата();
	мЗаписьДатаА.Портфель = Портфель;
	мЗаписьДатаА.Дата = НачалоДня(ТекущаяДата());
	мЗаписьДатаА.Записать();

КонецФункции

Процедура ОбновитьСтатусПоПортфелю(Портфель, НовыйСтатус)
	
	//1. Поменять статус
	ЗаписьВРегистр = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	ЗаписьВРегистр.Объект = ПортФель;
	ЗаписьВРегистр.Значение = НовыйСтатус;
	ЗаписьВРегистр.Свойство = ДопРеквизитСтатусПортфеля;
	ЗаписьВРегистр.Записать(Истина);
	
	//2. Поменять дату
	ЗаписьВРегистр = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	ЗаписьВРегистр.Объект = ПортФель;
	ЗаписьВРегистр.Значение = ТекущаяДатаСеанса();
	ЗаписьВРегистр.Свойство = ДопРеквизитДатаОперации;
	ЗаписьВРегистр.Записать(Истина);
	
	//3. История статусов
	ЗаписьВРегистр = РегистрыСведений.ВТБ_СтатусыПортфелей.СоздатьМенеджерЗаписи();
	ЗаписьВРегистр.Период = ТекущаяДатаСеанса();
	ЗаписьВРегистр.Портфель = ПортФель;
	ЗаписьВРегистр.СтатусПортфеля = НовыйСтатус;
	ЗаписьВРегистр.Автор = ПараметрыСеанса.ТекущийПользователь;
	ЗаписьВРегистр.Записать(Истина);
	
КонецПроцедуры

Процедура УстановитьПризнакПозицияВыгружена(Портфель)
	
	НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Портфель);
	НаборЗаписей.Отбор.Свойство.Установить(ПризнакПозицияВыгружена);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Объект = Портфель;
	НоваяЗапись.Свойство = ПризнакПозицияВыгружена;
	НоваяЗапись.Значение = Истина;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УстановитьПризнакДатаПересчетаРСА(Портфель)
	
	НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Портфель);
	НаборЗаписей.Отбор.Свойство.Установить(ПризнакДатаПересчетаРСА);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Объект = Портфель;
	НоваяЗапись.Свойство = ПризнакДатаПересчетаРСА;
	НоваяЗапись.Значение = ТекущаяДатаСеанса();
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

//Отправка списка поручений
Процедура ОтправитьПоручения(СписокПоручений)
	
	ДатаПроверки = КонецДня(ТекущаяДатаСеанса());
	Указания = РаспорядителиВызовСервера.ПараметрыПроверки(ДатаПроверки);
	Указания.ИспользоватьФоновыеЗадания = Истина;
	Указания.ДатаПроверки = ДатаПроверки;
	Указания.Портфели = ПортфелиПоручений(СписокПоручений);
	Указания.Поручения = СписокПоручений;
	Указания.ОтправитьПослеПроверки = Истина;

	РезультатПроверки = Распорядители.ПроверкаИОтправка(Указания);
	
	Для Каждого Сообщение Из РезультатПроверки.СообщенияПользователю Цикл
		ЗаписьЖурналаРегистрации("Регламентное задание: Рассылка поручений", УровеньЖурналаРегистрации.Информация, , , Сообщение.Текст);
	КонецЦикла;

КонецПроцедуры


Функция ПортфелиПоручений(СписокПоручений)

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоручениеРаспределениеПоПортфелям.Портфель КАК Портфель
	|ИЗ
	|	Документ.Поручение.РаспределениеПоПортфелям КАК ПоручениеРаспределениеПоПортфелям
	|ГДЕ
	|	ПоручениеРаспределениеПоПортфелям.Ссылка В (&СписокПоручений)");
	Запрос.УстановитьПараметр("СписокПоручений", СписокПоручений);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Портфель");

КонецФункции

#Область РассылкаПоПочте

Функция РассылкаОтчета(ДанныеОтчета, КоличествоЗаписей, ВажностьОшибки) Экспорт
	
	Если КоличествоЗаписей = 0 и ВажностьОшибки = 0 Тогда
		// поручений нет, ошибок нет не будем спамить
		Возврат "";
	КонецЕсли;
	
	ДатаОтчета = ТекущаяДатаСеанса();
	
	Если ЭтотОбъект.СписокРассылки.Количество() > 0 И НЕ ЭтотОбъект.ПочтовыйЛогин.Пустая() тогда
				
		Тема = "Загрузка неторговых поручений (Retail_DU) " + Формат(ДатаОтчета, "ДЛФ=DT");
		
		ТекстПисьмаОкончание = "";
		
		// Сначала обработать вложения, чтобы в случае ошибки отразить это в письме
		Вложения = Новый Массив; 
		
		Если КоличествоЗаписей <> 0 Тогда
			ТекстОшибки = ДобавитьВложение(Вложения, ДанныеОтчета, Тема + ".xlsx", "xlsx");
			Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
				ВажностьОшибки = 2;
			КонецЕсли;
			
			ТекстПисьмаОкончание = "Создано " + Формат(КоличествоЗаписей,"ЧДЦ=0")+" неторговых поручений.";
			
		Иначе //Если данных нет, то не выгружать пустой файл	
		
			Если ВажностьОшибки = 0 Тогда
				ВажностьОшибки = 1;
			КонецЕсли;
			ТекстПисьмаОкончание = "Данных для создания неторговых поручений не найдено.";
			
		КонецЕсли;
		
		ТекстПисьма = "Создание неторговых поручений (Retail_DU) " + Формат(ДатаОтчета, "ДЛФ=DT")+ символы.ПС;
		Если ВажностьОшибки = 2 Тогда
			ТекстПисьма = ТекстПисьма + Символы.ПС + ТекстОшибки;
		КонецЕсли;
		
		ТекстПисьма = ТекстПисьма + Символы.ПС + ТекстПисьмаОкончание;
		ТекстПисьма = ТекстПисьма + Символы.ПС + Лог.ПолучитьТекст();
		
		ТемаПисьма = СформироватьТемуПисьма(Тема, ВажностьОшибки, "r290");
				
		СписокПолучателей = ЭтотОбъект.СписокРассылки.Выгрузить();
		
		// Заполнение параметров рассылки	
		ПараметрыРассылки = Новый Структура;
		ПараметрыРассылки.Вставить("ТемаПисьма", 		ТемаПисьма);
		ПараметрыРассылки.Вставить("ТекстПисьма", 		ТекстПисьма);
		ПараметрыРассылки.Вставить("СписокПолучателей", СписокПолучателей);
		ПараметрыРассылки.Вставить("Вложения", 			Вложения);
		
		ТекстОшибки = ОтправитьПисьмо(ПараметрыРассылки, ЭтотОбъект.ПочтовыйЛогин, ВажностьОшибки);
		
		Если ТекстОшибки <> Неопределено Тогда 
			ЗаписьЖурналаРегистрации(
				"Дополнительные отчеты и обработки." + Метаданные().Представление(),
				УровеньЖурналаРегистрации.Ошибка,,,
				ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ДобавитьВложение(Вложения, ТабДок, ИмяФайла, Расширение, Кодировка = "")
	//Представление
	//АдресВоВременномХранилище
	ТекстОшибки = "";
	АдресВложения = ПоместитьТабДокВоВременноеХранилище(ТабДок, Расширение, ТекстОшибки);
	Если АдресВложения <> Неопределено Тогда
		Стр = Новый Структура;
		Стр.Вставить("Представление",ИмяФайла);
		Стр.Вставить("АдресВоВременномХранилище",АдресВложения);
		Вложения = Новый Массив;
		Вложения.Добавить(Стр);
	Иначе
		ТекстОшибки = СтрШаблон("Файл вложения %1 не сформирован: %2", ИмяФайла, ТекстОшибки);
	КонецЕсли;		
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция СформироватьТемуПисьма(ТемаЗаголовок, ВажностьОшибки, НомерРассылки)
									
	ТемаПисьма = ПрефиксПисьма(ВажностьОшибки) + ТемаЗаголовок + ПропискаРассылки(НомерРассылки);
	
	Возврат ТемаПисьма;
	
КонецФункции

//ПараметрыРассылки - Структура с полями:
Функция ОтправитьПисьмо(Знач ПараметрыРассылки, Знач УчетнаяЗапись, Знач ВажностьОшибки = 0)
	
	ТекстПисьма 	= ПараметрыРассылки.ТекстПисьма;
	ТемаПисьма 		= ПараметрыРассылки.ТемаПисьма;

	Вложения = Неопределено;
	ПараметрыРассылки.Свойство("Вложения", Вложения);
	
	Кому 		= Новый Массив();
	Копия 		= Новый Массив();
	СписокПолучателей = Неопределено;
	Если ПараметрыРассылки.Свойство("СписокПолучателей", СписокПолучателей) Тогда
		Если ТипЗнч(СписокПолучателей) = Тип("ТаблицаЗначений") Тогда
			Для Каждого ТекЯщик Из СписокПолучателей Цикл
				//Если ТекЯщик.КакКопия Тогда
				//	Копия.Добавить(Новый Структура("Адрес, Представление", ТекЯщик.ПочтовыйЛогин, ТекЯщик.Представление));
				//Иначе
					Кому.Добавить(Новый Структура("Адрес, Представление", ТекЯщик.ПочтовыйЯщик, ТекЯщик.Представление));
				//КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(СписокПолучателей) = Тип("Строка") Тогда
			Кому = СписокПолучателей;
		КонецЕсли;	
	КонецЕсли;
	
	ТипТекста = "HTML";
	Если НЕ ПараметрыРассылки.Свойство("ТипТекста", ТипТекста) Тогда
		ТипТекста = "HTML";
	КонецЕсли;
	
	// Заполнение параметров письма
	ПараметрыПисьма = Новый Структура("Кому, Копии, Тема, Тело, ТипТекста, Вложения, Важность");
	ПараметрыПисьма.Вложения	 = Вложения;
	ПараметрыПисьма.Кому		 = Кому;
	ПараметрыПисьма.Копии		 = Копия;
	ПараметрыПисьма.Тема		 = ТемаПисьма;
	ПараметрыПисьма.Тело		 = ТекстПисьма;
	ПараметрыПисьма.ТипТекста	 = ТипТекста;
	//ПараметрыПисьма.ИмяОтправителя = "Имя"; //
	ПараметрыПисьма.Важность	 = ?(ВажностьОшибки > 0, ВажностьИнтернетПочтовогоСообщения.Высокая, ВажностьИнтернетПочтовогоСообщения.Обычная);

	ТекстОшибки = Неопределено;
	Попытка
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
	Исключение
		ТекстОшибки = "Произошла ошибка при отправке почтового сообщения! " + ОписаниеОшибки();	
		ЗаписьЖурналаРегистрации(
			"Дополнительные отчеты и обработки." + Метаданные().Представление(),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
	КонецПопытки;	
		
	Возврат ТекстОшибки;
	
КонецФункции // ОтправитьПисьмо()

Функция СформироватьСтрокуПисьма(Знач СтрокаСообщение)
		
	СтрокаФормат = "<p>" + СтрЗаменить(СокрЛП(СтрокаСообщение), Символы.ПС, "</p><p>") + "</p>";
	Возврат СтрЗаменить(СтрокаФормат, "<p></p>", "<p>&nbsp;</p>");
	
КонецФункции

Функция СформироватьТелоПисьма(Знач ТекстПисьма)
	
	//ТелоПисьма = "
	//|<html>
	//|	<head>
	//|		<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
	//|	</head>
	//|	<body style=""font-family:Arial, Helvetica, sans-serif;color:black;"">
	//|		" + ОбщегоНазначения.ЗначениеВСтрокуXML(Заголовок) + "
	//|		<table BORDERCOLOR=""Black"" border-style= ""solid"" border-collapse =""collapse"" border=""1"">
	//|			<tr>
	//|				<th align=""center"" bgcolor=""#C0C0C0"">Тип</th>
	//|			</tr>";
	//
	//Для Каждого ТекЭлемент Из <Какаято коллекция> Цикл
	//	ТелоПисьма = ТелоПисьма + "
	//	|			<tr>
	//	|				<td>" + ОбщегоНазначения.ЗначениеВСтрокуXML(ТекЭлемент.ЧтоТо) + "</td>
	//	|			</tr>";
	//КонецЦикла;
	//
	//ТелоПисьма = ТелоПисьма + "
	//|		</table>
	//|	</body>
	//|</html>";
	
	ТелоПисьма = "
	|<html>
	|	<head>
	|		<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
	|		<style>p{margin:0cm;margin-bottom:.0001pt;font-size:11.0pt;font-family:Calibri, Arial, Helvetica, sans-serif;}</style>
	|	</head>
	|	<body style=""font-family:Arial, Helvetica, sans-serif;color:black;"">
	|		" + СформироватьСтрокуПисьма(ТекстПисьма) + "
	|	</body>
	|</html>";
		
	Возврат ТелоПисьма;
	
КонецФункции // СформироватьТелоПисьма()

// Сохраняет ТабличныйДокумент или ПакетОтображаемыхДокументов в файл на диске
//
// Параметры:
//  ТабличныйДокумент  	- ТабличныйДокумент или ПакетОтображаемыхДокументов - документ для сохранения
//  ТипФайла  			- Строка - тип файла (xlsx, pdf и т.д.)
//  ПутьКФайлу			- Строка - Полный путь к файлу на диске или пустая строка для временного файла
//	ТекстОшибки			- Строка - Для сохранения текста ошибки
//
// Возвращаемое значение:
//	Строка - Путь к Файлу на диске, в случае успешной записи или
//  Неопределено - в случае ошибки
//
Функция СохранитьТабличныйДокументВФайл(Знач ТабличныйДокумент, Знач ПутьКФайлу, Знач ТипФайла="xlsx", ТекстОшибки="")
	
	Попытка
		Если ТипЗнч(ТабличныйДокумент)=Тип("ТабличныйДокумент") Тогда 
			ТипТабДокумента = ТипФайлаТабличногоДокумента[ТипФайла];
		ИначеЕсли ТипЗнч(ТабличныйДокумент)=Тип("ПакетОтображаемыхДокументов") Тогда
			ТипТабДокумента =  ТипФайлаПакетаОтображаемыхДокументов[ТипФайла];
		Иначе
			ТекстОшибки = СтрШаблон("Тип документа ""%2"" не поддерживается для сохранения в %1 (%3)", ТипЗнч(ТабличныйДокумент), ВРег(ТипФайла), ПутьКФайлу);
			Возврат Ложь;
		КонецЕсли;
	Исключение
		ТекстОшибки = СтрШаблон("Тип файла %1 не применим для сохранения типа документа ""%2"" (%3)", ВРег(ТипФайла), ТипЗнч(ТабличныйДокумент), ПутьКФайлу);
		Возврат Ложь;		
	КонецПопытки;

	Попытка
		ТабличныйДокумент.Записать(ПутьКФайлу, ТипТабДокумента);
	Исключение
		ТекстОшибки = "Произошла ошибка при сохранении файла: " + ОписаниеОшибки();		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Помещает файл во временное хранилище
//
// Возрвщаемое значение:
//	 Строка - Адрес во временном хранилище
//
Функция ПоместитьФайлВоВременноеХранилище(Знач ПутьКФайлу, ТекстОшибки="")
	
	Попытка	
		ДвоичныеДанные 	= Новый ДвоичныеДанные(ПутьКФайлу);
		АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	Исключение
		ТекстОшибки = "Произошла ошибка при помещении файла во временное хранилище: " + ОписаниеОшибки();		
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат АдресВХранилище;
	
КонецФункции

// Записывает табличный документ или пакет в файл с указанным типом на диск и во временное хранилище
// Возрвщаемое значение - Структура: АдресВХранилище, ПутьКФайлу
Функция ПоместитьТабДокВоВременноеХранилище(Знач ТабличныйДокумент, ТипФайла="xlsx", ТекстОшибки="")
	
	АдресВХранилище = Неопределено;
	
	Попытка
		ПутьКФайлу = ПолучитьИмяВременногоФайла(ТипФайла);
	Исключение
		ТекстОшибки = "Ошибка при получении имени временного файла: " + ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
	
	Если СохранитьТабличныйДокументВФайл(ТабличныйДокумент, ПутьКФайлу, ТипФайла, ТекстОшибки) Тогда
		АдресВХранилище = ПоместитьФайлВоВременноеХранилище(ПутьКФайлу, ТекстОшибки);
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ПутьКФайлу);
	Исключение
	КонецПопытки;	
	
	Возврат АдресВХранилище;

КонецФункции // ПоместитьТабДокВоВременноеХранилище()

Процедура УдалитьВременныеФайлы(Знач МассивФайлов)
	Перем Файл;
	
	Для Каждого ТекФайл Из МассивФайлов Цикл
		Попытка
			Если ЗначениеЗаполнено(ТекФайл) Тогда
				Файл = Новый Файл(ТекФайл);
				Если Файл.Существует() Тогда
					УдалитьФайлы(ТекФайл);
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры // УдалитьВременныеФайлы()

Функция ПрефиксПисьма(Знач ВажностьОшибки, Знач ЭтоОтчет = Ложь)
	Перем ПрефиксПисьма;
	
	Если ВажностьОшибки = 1 Тогда
		ПрефиксПисьма = "{WARN} ";
		
	ИначеЕсли ВажностьОшибки = 2 Тогда
		ПрефиксПисьма = "{FAIL} ";
		
	Иначе
		ПрефиксПисьма = ?(ЭтоОтчет, "", "{OK} ");
	КонецЕсли;
	
	Возврат ПрефиксПисьма;
КонецФункции // ПрефиксПисьма()

Функция ПропискаРассылки(Знач НомерРассылки)
	Перем ПараметрыПодключения, ИмяИБ;
	
	Попытка
		ПараметрыПодключения = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПодключенияИзСтрокиСоединенияИнформационнойБазы(СтрокаСоединенияИнформационнойБазы());
		ИмяИБ = ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия;
	Исключение
	КонецПопытки;
	
	Прописка = " {" + НомерРассылки + ", ib: " + ?(ЗначениеЗаполнено(ИмяИБ), ИмяИБ, "< .. >") + "}";
	
	Возврат Прописка;
КонецФункции // ПропискаРассылки()

#КонецОбласти

//Макет = ПолучитьМакет("Лог");
ЭтоТест = Ложь;
