
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПериодКалендаря	= Год(ТекущаяДата());
	Календарь		= ТекущаяДата();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКалендаряСервер()
	ДатаУстановки = Дата(Формат(ПериодКалендаря,"ЧГ=0")+"0101");
	
	Элементы.Календарь.НачалоПериодаОтображения = НачалоГода(ДатаУстановки);
	Элементы.Календарь.КонецПериодаОтображения	= КонецГода(ДатаУстановки);
КонецПроцедуры // ()

&НаСервере
Процедура ЗаполнитьДанныеПериодовНахожденияСервер()
	Запрос	= Новый Запрос;
	
	ДатаУстановки = Дата(Формат(ПериодКалендаря,"ЧГ=0")+"0101");
	
	Запрос.УстановитьПараметр("НачалоПериода"	, НачалоГода(ДатаУстановки));
	Запрос.УстановитьПараметр("КонецПериода"	, КонецГода(ДатаУстановки));
	Запрос.УстановитьПараметр("ДатаРасчета"		, КонецДня(ДатаРасчета));
	Запрос.УстановитьПараметр("Клиент"			, Клиент);
	
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	ПрисутствиеНаТерриторииРФСрезПоследних.Дата				КАК Дата,
	|   ПрисутствиеНаТерриторииРФСрезПоследних.Местонахождение КАК Место
	|ИЗ
	|	РегистрСведений.ПрисутствиеНаТерриторииРФ.СрезПоследних(&ДатаРасчета, ) КАК ПрисутствиеНаТерриторииРФСрезПоследних
	|ГДЕ
	|	ПрисутствиеНаТерриторииРФСрезПоследних.Дата >= &НачалоПериода
	|	И
	|	ПрисутствиеНаТерриторииРФСрезПоследних.Дата <= &КонецПериода
	|	И
	|	ПрисутствиеНаТерриторииРФСрезПоследних.Клиент = &Клиент
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	ПериодыПрисутствия.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры // ЗаполнитьданныеПериодовНахожденияСервер()

&НаКлиенте
Процедура ПериодКалендаряПриИзменении(Элемент)
	КлиентПриИзменении();
	ОбновитьДанныеКалендаряСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КлиентПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриВыводеПериода(Элемент, ОформлениеПериода)
	Если Не Клиент.Пустая() Тогда
		ОформлятьДаты	= Истина;
	Иначе
		ОформлятьДаты	= Ложь;
	КонецЕсли; 
	
	ОформлениеДат	= ОформлениеПериода.Даты;
	
	Для Каждого ОформляемаяДата Из ОформлениеДат Цикл
		МассивНайденныхСтрок	= ПериодыПрисутствия.НайтиСтроки(Новый Структура("Дата ", ОформляемаяДата.Дата));
		// Дата писутсвия флаг
		// 1 - в рф, 2 - вне рф, 3 - неопределено
		ФлагПрисутствия	= 3;
		Если МассивНайденныхСтрок.Количество()>0 Тогда
			ФлагПрисутствия	= ?(МассивНайденныхСтрок[0].Место = ПредопределенноеЗначение("Перечисление.ТипыМестонахожденияКлиента.ВнеТерриторииРФ"), 2, 1);
			
		КонецЕсли;
		// Оформляем
		Если ФлагПрисутствия = 3 Тогда
			ОформляемаяДата.ЦветФона	= Новый Цвет();
		ИначеЕсли ФлагПрисутствия = 2 Тогда
			ОформляемаяДата.ЦветФона	= Новый Цвет(255,204,0);
		ИначеЕсли ФлагПрисутствия = 1 Тогда
			ОформляемаяДата.ЦветФона	= Новый Цвет(153,204,0);
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент=Неопределено)
	Если Не Клиент.Пустая() Тогда
		ЗаполнитьДанныеПериодовНахожденияСервер();
	Иначе
		ПериодыПрисутствия.Очистить();
	КонецЕсли;
	ОбновитьДанныеКалендаряСервер();
КонецПроцедуры

&НаКлиенте
Процедура ДатаРасчетаПриИзменении(Элемент)
	КлиентПриИзменении();
	ОбновитьДанныеКалендаряСервер();
КонецПроцедуры
