#Область IMAPPS39438

&НаСервере
&После("УправлениеФормой")
Процедура IMAPPS39438_УправлениеФормой()

	// IMAPPS-39438. Умолчание списка счетов и видимость поля при включённом флажке.
	Если Не ЗначениеЗаполнено(Объект.СчетаОборотовДляОтбораНДФЛ) Тогда
		Объект.СчетаОборотовДляОтбораНДФЛ = "90.01, 91.01, 91.03";
	КонецЕсли;

	Элементы.СчетаОборотовДляОтбораНДФЛ.Видимость = Объект.НеСоздаватьНДФЛПоКлиентамБезОборотов;

	Элементы.ПулДляОтбораНДФЛ.Видимость = Объект.СоздаватьНДФЛТолькоПоПулу;

КонецПроцедуры

&НаКлиенте
Процедура НеСоздаватьНДФЛПоКлиентамБезОборотовПриИзменении(Элемент)

	// IMAPPS-39438
	УправлениеФормой();

КонецПроцедуры

&НаКлиенте
Процедура СоздаватьНДФЛТолькоПоПулуПриИзменении(Элемент)

	// IMAPPS-39438
	УправлениеФормой();

КонецПроцедуры

#КонецОбласти
