
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Для Каждого Ссылка Из ПараметрКоманды Цикл
		ОбработкаКомандыНаСервере(Ссылка, ПараметрыВыполненияКоманды.Источник);
	КонецЦикла;
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.Поручение.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры

Процедура ОбработкаКомандыНаСервере(Ссылка, Форма = Неопределено)
	Объект = Ссылка.ПолучитьОбъект();
	Объект.ОтправитьУведомлениеСУДК();
	Если ТипЗнч(Форма) = Тип("УправляемаяФорма") И Форма.Параметры.Свойство("Ключ") И Форма.Параметры.Ключ = Ссылка Тогда
		Форма.ЗначениеВРеквизитФормы(Объект, "Объект");
	КонецЕсли;
КонецПроцедуры
