// Кэширование файлов в локальном TEMP и формирование списка имен закэшированных файлов
Функция СкопироватьФайлыВЛокальныйTEMP(ИсходныйКаталог, СписокФайлов, КонечныйКаталог="", ОписаниеОшибки="") Экспорт
	Для Каждого ИмяФайла ИЗ СписокФайлов Цикл
		Если Не ЗначениеЗаполнено(КонечныйКаталог) Тогда
			КонечныйКаталог	= КаталогВременныхФайлов();
		КонецЕсли; 
		
		КонечныйФайл	= Новый Файл(КонечныйКаталог+ИмяФайла);
		
		Если Не КонечныйФайл.Существует() Тогда
			Попытка
				КопироватьФайл(ИсходныйКаталог+"\"+ИмяФайла, КонечныйКаталог+ИмяФайла);
			Исключение
				ОписаниеОшибки	= ОписаниеОшибки();
				Возврат Ложь;
			КонецПопытки;
		Иначе
			ОписаниеОшибки	= "В указанном каталоге уже есть файл с таким именем!";
			Возврат Ложь;			
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

// Чистка файлов в указанной папке по списку
Функция УдалитьФайлыВУказаннойПапке(КаталогКэша, СписокФайлов, ОписаниеОшибки="") Экспорт
	Для Каждого ИмяФайла ИЗ СписокФайлов Цикл
		КонечныйФайл	= Новый Файл(КаталогКэша+ИмяФайла);
		
		Если КонечныйФайл.Существует() Тогда
			Попытка
				УдалитьФайлы(КаталогКэша, ИмяФайла);
			Исключение
				ОписаниеОшибки	= ОписаниеОшибки();
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

// Удалить указанный каталог
Функция УдалитьКаталог(ПутьККаталогу, ОписаниеОшибки="") Экспорт
	Каталог	= Новый Файл(ПутьККаталогу);
	
	Если Каталог.Существует() Тогда
		Каталог	= Неопределено;
		Попытка
			УдалитьФайлы(ПутьККаталогу);
		Исключение
			ОписаниеОшибки	= ОписаниеОшибки();
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли; 
	
	Возврат Истина;
КонецФункции

// Создать каталог под временные файлы
Функция СоздатьВременныйКаталог(ОписаниеОшибки="") Экспорт
	ПапкаСФайлами	= КаталогВременныхФайлов()+Новый УникальныйИдентификатор;
	// Проверим, а вдруг по такому УИД уже сгенерена папка
	КаталогСФайлами	= Новый Файл(ПапкаСФайлами);
	Если КаталогСФайлами.Существует() Тогда
		ПапкаСФайлами	= СоздатьВременныйКаталог();
	Иначе
		Попытка
			СоздатьКаталог(ПапкаСФайлами);
		Исключение
			ОписаниеОшибки	= ОписаниеОшибки();
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли; 
	//---
	Возврат ?(ПапкаСФайлами = Неопределено, ПапкаСФайлами, ПапкаСФайлами+"\");
КонецФункции

// Перемещает файлы исходного каталога в новый каталог
//
// Параметры:
//  ИсходныйПуть - Каталог-источник
//  НовыйПуть	 - Каталог-приемник
//
Процедура ПереместитьКаталог(ИсходныйПуть, НовыйПуть) Экспорт
	СоздатьКаталог(НовыйПуть);
	ФайлыДляПереноса = НайтиФайлы(ИсходныйПуть, "*.*");
	Для Каждого ФайлПеренос Из ФайлыДляПереноса Цикл
		Если Не ФайлПеренос.ЭтоКаталог() Тогда
			ПереместитьФайл(ФайлПеренос.ПолноеИмя, НовыйПуть + "\" + ФайлПеренос.Имя);
			УдалитьФайлы(ФайлПеренос.ПолноеИмя);
		Иначе
			ПереместитьКаталог(ФайлПеренос.ПолноеИмя, НовыйПуть + "\" + ФайлПеренос.Имя);
		КонецЕсли;
	КонецЦикла;
	УдалитьФайлы(ИсходныйПуть);
КонецПроцедуры

//Заменяет относительный путь на абсолютный
Функция ПолучитьАбсолютныйПуть(ОтносительныйПуть) Экспорт
	
	 Возврат СтрЗаменить(СтрЗаменить(ВРЕГ(ОтносительныйПуть), "G:\", "\\CORP\WorkGroups\"), "S:\", "\\CORP\Applications\");
	 
КонецФункции

// Процедура - Снять признак только чтение
//
// Параметры:
//  ПолноеИмяФайла	 - Строка - Полное имя файла (с путем)
//
Процедура СнятьПризнакТолькоЧтение(ПолноеИмяФайла) Экспорт
	
	Файл = Новый Файл(ПолноеИмяФайла);
	Если Файл.Существует() И Файл.ЭтоФайл() Тогда
		Если Файл.ПолучитьТолькоЧтение() Тогда
			Файл.УстановитьТолькоЧтение(Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Перемещает файл из иходного каталога в конечный.
//
// Параметры:
//  ИмяФайла	 - Строка - Имя перемещаемого файла (без пути)
//  ИсходныйКаталог - Строка - Путь к исходному каталогу файла
//  КонечныйКаталог - Строка - Путь к конечному каталогу файла
//  МетаданныеДляЖР - Метаданные - Объект метаданных из которого вызывается процедура для записи в ЖР в случае ошибки
//
Процедура ПереместитьФайлВНовыйКаталог(ИмяФайла, ИсходныйКаталог, КонечныйКаталог, МетаданныеДляЖР = Неопределено) Экспорт
	
	ИсходноеПолноеИмяФайла = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИсходныйКаталог) + ИмяФайла;
	СнятьПризнакТолькоЧтение(ИсходноеПолноеИмяФайла);
	КонечноеПолноеИмяФайла = КонечныйКаталог + ИмяФайла;
	Попытка
		Если Не ОбщегоНазначенияКлиентСервер.ФайлСуществует(КонечныйКаталог) Тогда
			СоздатьКаталог(КонечныйКаталог);
		КонецЕсли;
		ПереместитьФайл(ИсходноеПолноеИмяФайла, КонечноеПолноеИмяФайла);
	Исключение
		ТекстСообщения = "Не удалось переместить файл '" + ИмяФайла + "' из каталога: '"
			+ ИсходныйКаталог + "'." + ". ОписаниеОшибки:" + ОписаниеОшибки();
		Событие = "Ошибка перемещения файла";
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, МетаданныеДляЖР, , ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры
