&НаКлиенте
Процедура Установить(Команда)
	
	Если ДополнительнаяОбработка.Пустая() Тогда
		Сообщить("Отсутствует ссылка на обработку. Сохранение настроек не выполнено.", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	СохранитьНастройкиСервер();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДопОбработка", ДополнительнаяОбработка);
	
	Если не ДополнительнаяОбработка.Пустая() Тогда
		ЗагрузитьНастройкиСервер(); 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиСервер()
	
	НастройкиВыполнения = Неопределено;
	ХранилищеНастроек = ДополнительнаяОбработка.ХранилищеНастроек;
	
	Если ТипЗнч(ХранилищеНастроек) = Тип("ХранилищеЗначения") Тогда
		НастройкиВыполнения = ХранилищеНастроек.Получить();
	КонецЕсли;
	
	Если ТипЗнч(НастройкиВыполнения) <> Тип("Структура") Тогда  
		Возврат;// "<Настройки не установлены>"; 
	КонецЕсли;
	
	ЗначенияНастроек = НастройкиВыполнения;
	ПредставлениеНастроек = "";
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.УстановитьПользовательскиеНастройки(ЗначенияНастроек, ПредставлениеНастроек);
	ЗначениеВРеквизитФормы(ОбъектОбработки, "Объект");	
	
КонецПроцедуры

&НаСервере
Процедура НастройкиПоУмолчаниюНаСервере()
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.НастройкиПоУмолчанию(ОбъектОбработки);
	ЗначениеВРеквизитФормы(ОбъектОбработки, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоУмолчанию(Команда)
	
	НастройкиПоУмолчаниюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСервер()
	
	ЗаголовокНастроек = "";
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	Настройки = ОбъектОбработки.УстановитьПараметры(ЗаголовокНастроек);
	
	ДопОбработка = ДополнительнаяОбработка.ПолучитьОбъект();
	ДопОбработка.ХранилищеНастроек = Новый ХранилищеЗначения(Настройки);
	ДопОбработка.Записать();
	
КонецПроцедуры

