////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура вызывается перед записью элемента справочника.
//
Процедура ПередЗаписью(Отказ, Сообщать = Истина) Экспорт
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый() и не ПометкаУдаления=Ссылка.ПометкаУдаления тогда
		//В случае установки или снятия пометки удаления не производить проверку
		Возврат;
	КонецЕсли;
	
	// Проверим можно ли изменять реквизиты договора.
	// Проверка осуществляется только если записывается уже существующий договор
	Если НЕ ЭтоНовый() Тогда
		
		Если ЭтоГруппа Тогда
			
			// Для группы владельца менять нельзя
			Если Владелец <> Ссылка.Владелец Тогда
				
				Если не Сообщать=Ложь тогда
					Сообщить("Нельзя изменять контрагента для группы договоров.", СтатусСообщения.Важное);
				КонецЕсли;
				Отказ = Истина;
			КонецЕсли; 
			
		Иначе
			
			// Проверим Заполнение обязательных реквизитов "Организация"
			Если Не ЗначениеЗаполнено(Организация) Тогда
				Если не Сообщать=Ложь тогда
					Сообщить("Для договора """ + Наименование + """ не указана организация.
					|Элемент не записан.", 
					СтатусСообщения.Важное);
				КонецЕсли;
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли; // Если ЭтоГруппа Тогда
		
	КонецЕсли; // Если НЕ ЭтоНовый() Тогда
	
	// Проверим заполнение обязательных реквизитов.
	Если Не ЭтоГруппа Тогда
		
		// Проверим Заполнение обязательных реквизитов "Организация"
		Если Не ЗначениеЗаполнено(Организация) Тогда
			Если не Сообщать=Ложь тогда
				Сообщить("Не указана организация для договора.", СтатусСообщения.Важное);
			КонецЕслИ;	
			Отказ = Истина;
		КонецЕсли; 
		
	КонецЕсли;
	
	Если Не Модифицированность() Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

