#Область ОписаниеПеременных

Перем мУжеПроведен;		// Отвечает на вопрос был ли документ уже проведен перед записью?
Перем мИмеетСчетаТипаЦ;	// Каково было значение реквизита ИмеетСчетаТипаC перед записью документа
Перем мДепонент;		// Каково было значение реквизита Депонент пред записью документа

#КонецОбласти


#Область ОбработчикиСобытийДокумента

Процедура ОбработкаЗаполнения(Основание)
	
	Если Не ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Поручение") Тогда
		Если Основание.ВидОперацииД = Справочники.ВидыОпераций.ИзменениеКатегорииСчетовДепонента Тогда
			ДокументОснование = Основание.Ссылка;
			Дата = ОбщегоНазначения.ДатаДокумента(Основание);
			Депонент = Основание.Депонент;
			ИмеетСчетаТипаC = Основание.ИмеетСчетаТипаC;	// BSLLS:LatinAndCyrillicSymbolInWord-off
			Комментарий = Основание.Комментарий;
			Автор = Пользователи.ТекущийПользователь();
		Иначе
			ТекстСообщения = "На основании данного вида поручения нельзя создать документ Изменение категории счетов депонента!!!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЕсли;
		 	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПоСобытию(ЭтотОбъект, "Запись");
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
	Если Не ЭтоНовый() Тогда
		Изменил = Пользователи.ТекущийПользователь();
		мУжеПроведен = Ложь;
		мИмеетСчетаТипаЦ = Неопределено;
		мДепонент = Неопределено;
	Иначе
		Автор = Пользователи.ТекущийПользователь();
		мУжеПроведен = Ссылка.Проведен;
		мИмеетСчетаТипаЦ = Ссылка.ИмеетСчетаТипаC;
		мДепонент = Депонент;
	КонецЕсли;

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	СтандартнаяОбработка = Ложь;
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.КлиентыСУчетомНаСчетахТипаC.Записывать = Истина;
	Движение = Движения.КлиентыСУчетомНаСчетахТипаC.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Депонент;
	Движение.ФлагАктивности = ИмеетСчетаТипаC;
	
	Если Не мУжеПроведен 
			Или мИмеетСчетаТипаЦ <> ИмеетСчетаТипаC
			Или мДепонент <> Депонент Тогда
		ОтправитьПочтовоеУведомлениеОбИзмененииКатегорииСчетовЧерезKafka();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ОтправитьПочтовоеУведомлениеОбИзмененииКатегорииСчетовЧерезKafka();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьПочтовоеУведомлениеОбИзмененииКатегорииСчетовЧерезKafka()
	EmailПолучателя = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("EmailДепозитарногоОтдела");
	РеквизитыДепонента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Депонент, "Код,Наименование");
	ЗаголовокСообщения = "Изменение категории счетов депонента: " + Строка(РеквизитыДепонента.Код) 
							+ " " + Строка(РеквизитыДепонента.Наименование);
	ReplaceFields = Новый Структура;
	ReplaceFields.Вставить("ЗаголовокСообщения", ЗаголовокСообщения);
	ОбменДаннымиКафка.ОтправитьПочтовоеУведомление(EmailПолучателя, "ВнутренняяРассылкаОтчетовДепозитария", ReplaceFields, , Ссылка);
КонецПроцедуры

#КонецОбласти