#Область ПрограммныйИнтерфейс

// Процедура заполняет данными ТЧ ДанныеРаздела_2.
//
// BSLLS:MethodSize-off
Процедура ПолучитьДанные() Экспорт
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// Получим промежуточные данные кроме рыночной цены
	Запрос.Текст = ТекстПакетаДляПодготовкиПромежуточныхДанных();
	Запрос.УстановитьПараметр("ПолучатьЦеныИзBQ", ПолучатьЦеныИзBQ);
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйПериод);
	Запрос.УстановитьПараметр("ГраницаОтчетногоПериода", Новый Граница(КонецДня(ОтчетныйПериод), ВидГраницы.Включая) );
	ТипыДепозитарныхРасписок = Новый Массив;
	Запрос.УстановитьПараметр("ТипыДепозитарныхРасписок", Перечисления.ТипыЦБ.ВсеТипыДепозитарныхРасписок());
	КодыВидовИностранныхЦБСтрокой = "BON6,BON5,BON7,DS2,SS2,SHS5,SHS6,SHS7,SHS9,SHS10,SN3,SN4,BIL6,BIL5,BIL7,DR2,DOL2,OTHER";
	КодыВидовИностранныхЦБ = СтрРазделить(КодыВидовИностранныхЦБСтрокой, ",");
	Запрос.УстановитьПараметр("КодыВидовИностранныхЦБ", КодыВидовИностранныхЦБ);
	КодыВидовДолговыхЦБСтрокой = "BON6,BON5,BON7,SN3,SN4";
	КодыВидовДолговыхЦБ = СтрРазделить(КодыВидовДолговыхЦБСтрокой, ",");
	Запрос.УстановитьПараметр("КодыВидовДолговыхЦБ", КодыВидовДолговыхЦБ);
	КодыВидовЦБСНулевымНоминаломСтрокой = "SHS7,DR2,DOL2,OTHER";
	КодыВидовЦБСНулевымНоминалом = СтрРазделить(КодыВидовЦБСНулевымНоминаломСтрокой, ",");
	Запрос.УстановитьПараметр("КодыВидовЦБСНулевымНоминалом", КодыВидовЦБСНулевымНоминалом);
	Запрос.УстановитьПараметр("КодРегионаОрганизации", Лев(Организация.КодПоОКАТО, 2));
	
	ИспользуемыеЦБ = Запрос.Выполнить().Выгрузить();
	
	// Получим рыночные цены ЦБ из backQORT
	РыночныеЦеныЦБ = РыночныеЦеныЦБ(ИспользуемыеЦБ);
	
	// Получим итогововые данные
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстПакетаДляПолученияИтоговыхДанных();
	Запрос.УстановитьПараметр("ТЗРыночныеЦеныЦБ", РыночныеЦеныЦБ);
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйПериод);
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	
	ИндексПоследнегоЗапроса = РезультатПакета.Количество() - 1;
	ИндексВторогоЗапросаСКонца = ИндексПоследнегоЗапроса - 1;
	ИндексТретьегоЗапросаСКонца = ИндексВторогоЗапросаСКонца - 1;
		
	ДанныеМестХранения = РезультатПакета[ИндексВторогоЗапросаСКонца].Выгрузить();
	ПроверитьДанныеМестХранения(ДанныеМестХранения);
		
	ДанныеЦБ = РезультатПакета[ИндексТретьегоЗапросаСКонца].Выгрузить();
	ПроверитьДанныеЦБ(ДанныеЦБ, КодыВидовИностранныхЦБ, КодыВидовИностранныхЦБСтрокой);
		
	ДанныеРаздела_2.Загрузить(РезультатПакета[ИндексПоследнегоЗапроса].Выгрузить());
	ПронумероватьСтроки(ДанныеРаздела_2);
	
	МенеджерВременныхТаблиц = Неопределено;
КонецПроцедуры

// Процедура выгружает сформированный отчет (данные в табличных частях отчета) в XML-файл
// Параметры:
//	ОписаниеОшибок - Строка
//	ПроверкиУспешны - Булево
Процедура ВыгрузитьВXML(ОписаниеОшибок, ПроверкиУспешны) Экспорт
	// BSLLS:Typo-off
	СписокОбязательныхКолонок = "Разд2НомСтр, ISIN, КодТипЦБум, КодСрокаПог, НаимЭмит, КодСтраны, КодСектЭк, ПризКлиента"
								+ ", КодКлиента, КодВалюты, КодМестХранЦБум";
	// BSLLS:Typo-on
	МетаданныеТЧ = Метаданные().ТабличныеЧасти.ДанныеРаздела_2;
	ПроверкиУспешны = РегуляторнаяОтчетность.ЗаполненыОбязательныеКолонкиДляВыгрузкиВXML(ДанныеРаздела_2, МетаданныеТЧ,
													СписокОбязательныхКолонок, "Разд2НомСтр", ОписаниеОшибок);
	Если Не ПроверкиУспешны Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормы = "0409404";
	ПространствоИмен = "urn:cbr-ru:rep0409404:v5.0.4.5";
	
	// Осторожно! Схема хранимая в конфигурации модифицирована по сравнению с оригинальной:
	//	- добавлены типы: Строка21, Строка29
	//	- в разделе "Ф0409404Данные404Раздел2Раздел2Данные" типы атрибутов Строка29Число15_6Неотр-лок и Число15_6Полож-лок
	//		заменены на Строка21, а Число23_6Неотр-лок на Строка29.
	// Это потребовалось, чтобы все числа можно было выгрузить в файл дополненными до 6 нулей после запятой (см. NRB-321)
	СхемаXSD = ПолучитьМакет("Ф404_Schema_XSD");
	
	Фабрика = РегуляторнаяОтчетность.ФабрикаИзСхемыXSD(СхемаXSD);
	Отчетность = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409404"));
	
	УникИдОЭС = Новый УникальныйИдентификатор;
	Отчетность.УникИдОЭС = Строка(УникИдОЭС);	// Пример: "8b91f09d-da8b-11ed-811d-00155d1a3509";
	Отчетность.ВидОтчета = ИмяФормы;
	Отчетность.КодФормы = ИмяФормы;
	Отчетность.ОКУД = "0409404";
	Отчетность.ВидОЭС = "Отчетность КО";
	Отчетность.ВидОтчета = "основной";
	Отчетность.Периодичность = "месячная";
	Отчетность.ДатаВремяФормирования = ТекущаяДатаСеанса();
	
	ОтчетнаяДатаДляXML = КонецДня(ОтчетныйПериод) + 1;	// Следующий день после конца отчетного периода
	// BSLLS:Typo-off
	Отчетность.ОтчДата = ОтчетнаяДатаДляXML;
	// BSLLS:Typo-on
	
	Отчетность.Составитель = СоставительОтчета(Фабрика, ПространствоИмен, ОтчетнаяДатаДляXML);
	Отчетность.Данные404 = Данные404(Фабрика, ПространствоИмен);
	
	РегуляторнаяОтчетность.ЗаписатьОтчетностьДляДельтыВXML(Фабрика, Отчетность, ИмяФормы, Неопределено, ОтчетныйПериод);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ТекстПакетаДляПодготовкиПромежуточныхДанных()
	Текст =
	// Ищем иностранные ЦБ принадлежащие резидентам, не являющимися кредитными оранизациями
	// Важно что реквизит Резидент в справочнике контрагентов, как это ни парадоксально, означает "Нерезидент по документам"
	// - живите теперь с этим, если не знали раньше
	"ВЫБРАТЬ
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.МеждународнаяКомпания КАК МеждународнаяКомпания,
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.ЮридическоеЛицо КАК ЮридическоеЛицо
	|ПОМЕСТИТЬ ВТ_МеждународныеКомпании
	|ИЗ
	|	РегистрСведений.ЮридическиеЛицаМеждународныеКомпании.СрезПоследних(&ОтчетныйПериод, 1 = 1) КАК ЮридическиеЛицаМеждународныеКомпанииСрезПоследних
	|ГДЕ
	|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.МеждународнаяКомпания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОстатки.ЦБ КАК ЦБ,
	|	ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБОстатки.СчетДепоМХ КАК СчетДепоМХ,
	|	ОстаткиЦБОстатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ ВТ_ОстаткиВсехЦБУРезидентов
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&ГраницаОтчетногоПериода,
	|			НЕ СчетДепо.Владелец.Резидент
	|					И НЕ ЕСТЬNULL(ВЫРАЗИТЬ(СчетДепо.Владелец.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).КредитнаяОрганизация, ЛОЖЬ)
	|				ИЛИ СчетДепо.Владелец.ЮридическиеФизическиеЛица В
	|					(ВЫБРАТЬ
	|						ВТ_МеждународныеКомпании.ЮридическоеЛицо КАК ЮридическоеЛицо
	|					ИЗ
	|						ВТ_МеждународныеКомпании КАК ВТ_МеждународныеКомпании)) КАК ОстаткиЦБОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиВсехЦБУРезидентов.ЦБ КАК ЦБ
	|ПОМЕСТИТЬ ВТ_ВсеЦБРезидентов
	|ИЗ
	|	ВТ_ОстаткиВсехЦБУРезидентов КАК ВТ_ОстаткиВсехЦБУРезидентов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиВсехЦБУРезидентов.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЦБРезидентов.ЦБ КАК ЦБ,
	|	ЕСТЬNULL(БазовыеАктивыДепозитарныхРасписок.Эмитент, ЦенныеБумаги.Эмитент) КАК Эмитент,
	|	ЦенныеБумаги.ВидЦББанкаРоссии КАК ВидЦББанкаРоссии,
	|	ЕСТЬNULL(БазовыеАктивыДепозитарныхРасписок.ВалютаНоминала, ЦенныеБумаги.ВалютаНоминала) КАК ВалютаНоминала,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ТипЦБ В (&ТипыДепозитарныхРасписок)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоДепозитарнаяРасписка,
	|	ЦенныеБумаги.ДатаРазмещения КАК ДатаРазмещения,
	|	ЦенныеБумаги.ДатаПогашения КАК ДатаПогашения,
	|	ЦенныеБумаги.ISIN КАК ISIN
	|ПОМЕСТИТЬ ВТ_ВсеЦБРезидентовСРеквизитами
	|ИЗ
	|	ВТ_ВсеЦБРезидентов КАК ВТ_ВсеЦБРезидентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ВТ_ВсеЦБРезидентов.ЦБ = ЦенныеБумаги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК БазовыеАктивыДепозитарныхРасписок
	|		ПО (ЦенныеБумаги.БазовыйАктив = БазовыеАктивыДепозитарныхРасписок.Ссылка)
	|			И (ЦенныеБумаги.ТипЦБ В (&ТипыДепозитарныхРасписок))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЦБРезидентовСРеквизитами.ЦБ КАК ЦБ,
	|	ВТ_ВсеЦБРезидентовСРеквизитами.Эмитент КАК Эмитент,
	|	ВТ_ВсеЦБРезидентовСРеквизитами.ВалютаНоминала КАК ВалютаНоминала,
	|	ВТ_ВсеЦБРезидентовСРеквизитами.ЭтоДепозитарнаяРасписка КАК ЭтоДепозитарнаяРасписка,
	|	ВидыЦББанкаРоссии.Код КАК КодВидаЦББанкаРоссии
	|ПОМЕСТИТЬ ВТ_ИностранныеЦБ
	|ИЗ
	|	ВТ_ВсеЦБРезидентовСРеквизитами КАК ВТ_ВсеЦБРезидентовСРеквизитами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Эмитенты
	|		ПО ВТ_ВсеЦБРезидентовСРеквизитами.Эмитент = Эмитенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦББанкаРоссии КАК ВидыЦББанкаРоссии
	|		ПО ВТ_ВсеЦБРезидентовСРеквизитами.ВидЦББанкаРоссии = ВидыЦББанкаРоссии.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО (Эмитенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МеждународныеКомпании КАК ВТ_МеждународныеКомпании
	|		ПО ЮридическиеЛица.Ссылка = ВТ_МеждународныеКомпании.ЮридическоеЛицо
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Эмитенты.РегионДляОтчетов ССЫЛКА Справочник.КлассификаторРегионов
	|					И Эмитенты.РегионДляОтчетов <> ЗНАЧЕНИЕ(Справочник.КлассификаторРегионов.ПустаяСсылка)
	|				ТОГДА ЛОЖЬ
	|			КОГДА Эмитенты.РегионДляОтчетов = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.РОССИЯ)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВидыЦББанкаРоссии.Код В(&КодыВидовИностранныхЦБ)
	|	И ВТ_МеждународныеКомпании.ЮридическоеЛицо ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоминалЦБСрезПоследних.ЦеннаяБумага КАК ЦБ,
	|	НоминалЦБСрезПоследних.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_НоминалЦБ
	|ИЗ
	|	РегистрСведений.НоминалЦБ.СрезПоследних(
	|			&ОтчетныйПериод,
	|			ЦеннаяБумага В
	|				(ВЫБРАТЬ
	|					ВТ_ИностранныеЦБ.ЦБ КАК ЦБ
	|				ИЗ
	|					ВТ_ИностранныеЦБ КАК ВТ_ИностранныеЦБ)) КАК НоминалЦБСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИностранныеЦБ.ЦБ КАК ЦБ,
	|	ВТ_ИностранныеЦБ.Эмитент КАК Эмитент,
	|	ВТ_ИностранныеЦБ.ЭтоДепозитарнаяРасписка КАК ЭтоДепозитарнаяРасписка,
	|	ВТ_ИностранныеЦБ.КодВидаЦББанкаРоссии КАК КодВидаЦББанкаРоссии,
	|	ВТ_ИностранныеЦБ.ВалютаНоминала КАК ВалютаНоминала,
	|	Валюты.Код КАК КодВалютыНоминала,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(Эмитенты.НаименованиеПолное КАК СТРОКА(500)), """") <> """"
	|			ТОГДА ВЫРАЗИТЬ(Эмитенты.НаименованиеПолное КАК СТРОКА(500))
	|		КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ЮридическиеЛица.ПолноеНаименованиеНаАнглийскомЯзыке КАК СТРОКА(500)), """") <> """"
	|			ТОГДА ВЫРАЗИТЬ(ЮридическиеЛица.ПолноеНаименованиеНаАнглийскомЯзыке КАК СТРОКА(500))
	|		ИНАЧЕ Эмитенты.Наименование
	|	КОНЕЦ КАК НаименованиеЭмитента,
	|	КлассификаторСекторовЭкономики.Код КАК КодСектораЭкономики,
	|	ВЫБОР
	|		КОГДА ЮридическиеЛица.МеждународнаяОрганизация = ИСТИНА
	|			ТОГДА ""998""
	|		КОГДА НЕ КлассификаторСтранМира.Код ЕСТЬ NULL
	|			ТОГДА КлассификаторСтранМира.Код
	|		ИНАЧЕ ""999""
	|	КОНЕЦ КАК КодСтраныЭмитента,
	|	ЦенныеБумаги.ТипЦБ КАК ТипЦБ,
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.НомерРегистрации КАК НомерРегистрации,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
	|				И ЦенныеБумаги.ДатаПогашения <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ДОБАВИТЬКДАТЕ(ЦенныеБумаги.ДатаРазмещения, ГОД, 1) > ЦенныеБумаги.ДатаПогашения
	|			ТОГДА ""SHT""
	|		КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
	|			ТОГДА ""LNT""
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК КодСрокаПогашения,
	|	ВЫБОР
	|		КОГДА ВТ_ИностранныеЦБ.КодВидаЦББанкаРоссии В (&КодыВидовДолговыхЦБ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоДолговаяЦБ,
	|	ЦенныеБумаги.Дефолтная КАК Дефолтная,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ДатаПогашения = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		КОГДА ЦенныеБумаги.ДатаПогашения <= &ОтчетныйПериод
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДатаПогашенияНаступила,
	|	ВЫБОР
	|		КОГДА ВТ_ИностранныеЦБ.КодВидаЦББанкаРоссии В (&КодыВидовЦБСНулевымНоминалом)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВидЦБСНулевымНоминалом
	|ПОМЕСТИТЬ ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ
	|ИЗ
	|	ВТ_ИностранныеЦБ КАК ВТ_ИностранныеЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ВТ_ИностранныеЦБ.ЦБ = ЦенныеБумаги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Эмитенты
	|		ПО ВТ_ИностранныеЦБ.Эмитент = Эмитенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ВТ_ИностранныеЦБ.ВалютаНоминала = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|		ПО (Эмитенты.РегионДляОтчетов = КлассификаторСтранМира.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСекторовЭкономикиДляИностранныхЭмитентов КАК КлассификаторСекторовЭкономики
	|		ПО (Эмитенты.СекторЭкономикиИностранногоЭмитента = КлассификаторСекторовЭкономики.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО (Эмитенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧЦенныеБумагиСписываемые.ЦеннаяБумага КАК ЦБ
	|ПОМЕСТИТЬ ВТ_ПогашенныеИностранныеДолговыеЦБ
	|ИЗ
	|	Документ.Поручение.ЦенныеБумагиСписываемые КАК ТЧЦенныеБумагиСписываемые
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение КАК ДокументПоручение
	|		ПО (ДокументПоручение.Ссылка = ТЧЦенныеБумагиСписываемые.Ссылка)
	|			И (ДокументПоручение.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ПогашениеЦБПолное))
	|			И (ДокументПоручение.Дата <= &ОтчетныйПериод)
	|			И (ДокументПоручение.Проведен)
	|			И (ДокументПоручение.ДатаИсполненияПоручения <> ДАТАВРЕМЯ(1, 1, 1))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ КАК ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ
	|		ПО (ДокументПоручение.ЦенныеБумагиСписываемые.ЦеннаяБумага = ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.ЦБ)
	|			И (ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.ЭтоДолговаяЦБ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧЦенныеБумагиСписываемые.Ссылка,
	|	ТЧЦенныеБумагиСписываемые.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.ЦБ КАК ЦБ,
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.Эмитент КАК Эмитент,
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.ЭтоДепозитарнаяРасписка КАК ЭтоДепозитарнаяРасписка,
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.КодВидаЦББанкаРоссии КАК КодВидаЦББанкаРоссии,
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.ВалютаНоминала КАК ВалютаНоминала,
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.КодВалютыНоминала КАК КодВалютыНоминала,
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.НаименованиеЭмитента КАК НаименованиеЭмитента,
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.КодСектораЭкономики КАК КодСектораЭкономики,
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.КодСтраныЭмитента КАК КодСтраныЭмитента,
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.ТипЦБ КАК ТипЦБ,
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.ISIN КАК ISIN,
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.НомерРегистрации КАК НомерРегистрации,
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.КодСрокаПогашения КАК КодСрокаПогашения,
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.ЭтоДолговаяЦБ КАК ЭтоДолговаяЦБ,
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.Дефолтная КАК Дефолтная,
	|	ВЫБОР
	|		КОГДА ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.ЭтоДолговаяЦБ
	|				И ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.ДатаПогашенияНаступила
	|				И ВТ_ПогашенныеИностранныеДолговыеЦБ.ЦБ ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Просрочена,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ПогашенныеИностранныеДолговыеЦБ.ЦБ ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Погашена,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.ЭтоВидЦБСНулевымНоминалом
	|				ТОГДА 0
	|			КОГДА НЕ ВТ_ПогашенныеИностранныеДолговыеЦБ.ЦБ ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(ВТ_НоминалЦБ.Сумма, 0)
	|		КОНЕЦ КАК ЧИСЛО(21, 6)) КАК НоминальнаяЦена,
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.ЭтоВидЦБСНулевымНоминалом КАК ЭтоВидЦБСНулевымНоминалом
	|ПОМЕСТИТЬ ВТ_ИнформацияОбИностранныхЦБ
	|ИЗ
	|	ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ КАК ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПогашенныеИностранныеДолговыеЦБ КАК ВТ_ПогашенныеИностранныеДолговыеЦБ
	|		ПО ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.ЦБ = ВТ_ПогашенныеИностранныеДолговыеЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НоминалЦБ КАК ВТ_НоминалЦБ
	|		ПО ВТ_ПромежуточнаяИнформацияОбИностранныхЦБ.ЦБ = ВТ_НоминалЦБ.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиВсехЦБУРезидентов.ЦБ КАК ЦБ,
	|	СчетаДепо.Владелец КАК Депонент,
	|	СчетаДепоМХ.Владелец КАК МестоХранения,
	|	ВЫРАЗИТЬ(СУММА(ВТ_ОстаткиВсехЦБУРезидентов.Количество) КАК ЧИСЛО(21, 6)) КАК Количество
	|ПОМЕСТИТЬ ВТ_ОстаткиИностранныхЦБУРезидентов
	|ИЗ
	|	ВТ_ОстаткиВсехЦБУРезидентов КАК ВТ_ОстаткиВсехЦБУРезидентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИностранныеЦБ КАК ВТ_ИностранныеЦБ
	|		ПО ВТ_ОстаткиВсехЦБУРезидентов.ЦБ = ВТ_ИностранныеЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
	|		ПО ВТ_ОстаткиВсехЦБУРезидентов.СчетДепо = СчетаДепо.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепоМХ КАК СчетаДепоМХ
	|		ПО ВТ_ОстаткиВсехЦБУРезидентов.СчетДепоМХ = СчетаДепоМХ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиВсехЦБУРезидентов.ЦБ,
	|	СчетаДепо.Владелец,
	|	СчетаДепоМХ.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиИностранныхЦБУРезидентов.Депонент КАК Депонент
	|ПОМЕСТИТЬ ВТ_Депоненты
	|ИЗ
	|	ВТ_ОстаткиИностранныхЦБУРезидентов КАК ВТ_ОстаткиИностранныхЦБУРезидентов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиИностранныхЦБУРезидентов.Депонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Депоненты.Депонент КАК Депонент,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ""3""
	|		ИНАЧЕ ""1""
	|	КОНЕЦ КАК ПризнакКлиента,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ""ФЛ""
	|		ИНАЧЕ ЮридическиеЛица.ИНН
	|	КОНЕЦ КАК КодКлиента,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(КлассификаторРегионов.КодДляОтчетов6406У, &КодРегионаОрганизации)
	|		ИНАЧЕ ЕСТЬNULL(КлассификаторРегионов.КодДляОтчетов6406У, """")
	|	КОНЕЦ КАК КодРегионаКлиента,
	|	""ДО"" КАК ОсобаяПометка
	|ПОМЕСТИТЬ ВТ_ИнформацияОДепонентах
	|ИЗ
	|	ВТ_Депоненты КАК ВТ_Депоненты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_Депоненты.Депонент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторРегионов КАК КлассификаторРегионов
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица)
	|			И (Контрагенты.РегионДляОтчетов = КлассификаторРегионов.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиИностранныхЦБУРезидентов.МестоХранения КАК МестоХранения
	|ПОМЕСТИТЬ ВТ_МестаХранения
	|ИЗ
	|	ВТ_ОстаткиИностранныхЦБУРезидентов КАК ВТ_ОстаткиИностранныхЦБУРезидентов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиИностранныхЦБУРезидентов.МестоХранения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МестаХранения.МестоХранения КАК МестоХранения,
	|	МестаХранения.ПризнакОрганизации КАК ПризнакОрганизации,
	|	ВЫБОР
	|		КОГДА МестаХранения.ПризнакОрганизации = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.СпециализированныйДепозитарийКредитнаяОрганизация)
	|			ТОГДА ""1""
	|		КОГДА МестаХранения.ПризнакОрганизации = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.Нерезидент)
	|			ТОГДА ""3""
	|		ИНАЧЕ ""2""
	|	КОНЕЦ КАК ПризнакМестаХранения,
	|	ВЫБОР
	|		КОГДА МестаХранения.ПризнакОрганизации = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.СпециализированныйДепозитарийКредитнаяОрганизация)
	|			ТОГДА МестаХранения.РегистрационныйНомер
	|		КОГДА МестаХранения.ПризнакОрганизации = ЗНАЧЕНИЕ(Перечисление.ПризнакОрганизации.Нерезидент)
	|			ТОГДА ""9999""
	|		ИНАЧЕ МестаХранения.ИНН
	|	КОНЕЦ КАК КодМестаХранения
	|ПОМЕСТИТЬ ВТ_ИнформацияОМестахХранения
	|ИЗ
	|	ВТ_МестаХранения КАК ВТ_МестаХранения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МестаХранения КАК МестаХранения
	|		ПО ВТ_МестаХранения.МестоХранения = МестаХранения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнформацияОбИностранныхЦБ.ЦБ КАК ЦеннаяБумага,
	|	ВТ_ИнформацияОбИностранныхЦБ.ISIN КАК ISIN,
	|	ВТ_ИнформацияОбИностранныхЦБ.НомерРегистрации КАК НомерРегистрации
	|ИЗ
	|	ВТ_ИнформацияОбИностранныхЦБ КАК ВТ_ИнформацияОбИностранныхЦБ
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ &ПолучатьЦеныИзBQ
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_ИнформацияОбИностранныхЦБ.ЭтоДолговаяЦБ
	|					И ВТ_ИнформацияОбИностранныхЦБ.Погашена
	|				ТОГДА ЛОЖЬ
	|			КОГДА ВТ_ИнформацияОбИностранныхЦБ.ЭтоДолговаяЦБ
	|					И ВТ_ИнформацияОбИностранныхЦБ.Дефолтная
	|				ТОГДА ЛОЖЬ
	|			КОГДА ВТ_ИнформацияОбИностранныхЦБ.ЭтоДолговаяЦБ
	|					И ВТ_ИнформацияОбИностранныхЦБ.Просрочена
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИнформацияОбИностранныхЦБ.ЦБ,
	|	ВТ_ИнформацияОбИностранныхЦБ.ISIN,
	|	ВТ_ИнформацияОбИностранныхЦБ.НомерРегистрации";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстПакетаДляПолученияИтоговыхДанных()
	Текст =
	"ВЫБРАТЬ
	|	ТЗРыночныеЦеныЦБ.ЦБ КАК ЦБ,
	|	ТЗРыночныеЦеныЦБ.ISIN КАК ISIN,
	|	ТЗРыночныеЦеныЦБ.RegNum КАК НомерРегистрации,
	|	ТЗРыночныеЦеныЦБ.Rate КАК Котировка,
	|	ТЗРыночныеЦеныЦБ.RateNominal КАК КотировкаВВалютеНоминалаБезНКД,
	|	ТЗРыночныеЦеныЦБ.RateNominalWithAccru КАК КотировкаВВалютеНоминалаВключаяНКД,
	|	ТЗРыночныеЦеныЦБ.NominalCurrency КАК КодВалютыНоминалаПоДаннымBQ,
	|	ТЗРыночныеЦеныЦБ.Level КАК УровеньОценки,
	|	ТЗРыночныеЦеныЦБ.Metod КАК Metod,
	|	ВЫБОР
	|		КОГДА ТЗРыночныеЦеныЦБ.Metod <> """"
	|			ТОГДА ТЗРыночныеЦеныЦБ.Metod
	|		КОГДА ТЗРыночныеЦеныЦБ.Level = ""1""
	|			ТОГДА ""РЦ""
	|		КОГДА ТЗРыночныеЦеныЦБ.Level = ""2""
	|			ТОГДА ""СД""
	|		ИНАЧЕ ""НО""
	|	КОНЕЦ КАК МетодОценки
	|ПОМЕСТИТЬ ВТ_РыночныеКотировки
	|ИЗ
	|	&ТЗРыночныеЦеныЦБ КАК ТЗРыночныеЦеныЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнформацияОбИностранныхЦБ.ЦБ КАК ЦБ,
	|	ВТ_ИнформацияОбИностранныхЦБ.ISIN КАК ISIN,
	|	ВТ_ИнформацияОбИностранныхЦБ.НомерРегистрации КАК НомерРегистрации,
	|	ВТ_ИнформацияОбИностранныхЦБ.Эмитент КАК Эмитент,
	|	ВТ_ИнформацияОбИностранныхЦБ.НаименованиеЭмитента КАК НаименованиеЭмитента,
	|	ВТ_ИнформацияОбИностранныхЦБ.КодВидаЦББанкаРоссии КАК КодВидаЦББанкаРоссии,
	|	ВТ_ИнформацияОбИностранныхЦБ.ВалютаНоминала КАК ВалютаНоминала,
	|	ВТ_ИнформацияОбИностранныхЦБ.КодВалютыНоминала КАК КодВалютыНоминала,
	|	ВТ_ИнформацияОбИностранныхЦБ.ЭтоВидЦБСНулевымНоминалом КАК ЭтоВидЦБСНулевымНоминалом,
	|	ВТ_ИнформацияОбИностранныхЦБ.НоминальнаяЦена КАК НоминальнаяЦена,
	|	ВТ_ИнформацияОбИностранныхЦБ.КодСектораЭкономики КАК КодСектораЭкономики,
	|	ВТ_ИнформацияОбИностранныхЦБ.КодСтраныЭмитента КАК КодСтраныЭмитента,
	|	ВТ_ИнформацияОбИностранныхЦБ.КодСрокаПогашения КАК КодСрокаПогашения,
	|	ВТ_ИнформацияОбИностранныхЦБ.ТипЦБ КАК ТипЦБ,
	|	ВТ_ИнформацияОбИностранныхЦБ.ЭтоДепозитарнаяРасписка КАК ЭтоДепозитарнаяРасписка,
	|	ЕСТЬNULL(ВТ_РыночныеКотировки.УровеньОценки, НЕОПРЕДЕЛЕНО) КАК УровеньОценки,
	|	ЕСТЬNULL(РыночныеЦеныЦенныхБумаг.ЦенаЦБ, 0) КАК РыночнаяКотировка,
	|	ВЫБОР
	|		КОГДА ВТ_ИнформацияОбИностранныхЦБ.ЭтоДолговаяЦБ
	|				И ВТ_РыночныеКотировки.Metod = """"
	|				И ВТ_ИнформацияОбИностранныхЦБ.Погашена
	|			ТОГДА ""ПБ""
	|		КОГДА ВТ_ИнформацияОбИностранныхЦБ.ЭтоДолговаяЦБ
	|				И ВТ_РыночныеКотировки.Metod = """"
	|				И ВТ_ИнформацияОбИностранныхЦБ.Дефолтная
	|			ТОГДА ""ПБ""
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РыночныеКотировки.МетодОценки, ""НО"")
	|	КОНЕЦ КАК МетодОценки,
	|	ЕСТЬNULL(ВТ_РыночныеКотировки.КодВалютыНоминалаПоДаннымBQ, ВТ_ИнформацияОбИностранныхЦБ.КодВалютыНоминала) КАК КодВалютыНоминалаПоДаннымBQ,
	|	ВТ_ИнформацияОбИностранныхЦБ.ЭтоДолговаяЦБ КАК ЭтоДолговаяЦБ,
	|	ВТ_ИнформацияОбИностранныхЦБ.Погашена КАК Погашена,
	|	ВТ_ИнформацияОбИностранныхЦБ.Просрочена КАК Просрочена,
	|	ВТ_ИнформацияОбИностранныхЦБ.Дефолтная КАК Дефолтная,
	|	РыночныеЦеныЦенныхБумаг.ЦенаЦБ ЕСТЬ NULL КАК ВРегистреРыночныеЦеныЦБНеНайденаЦенаЦБ
	|ПОМЕСТИТЬ ВТ_ИнформацияОбЦБ
	|ИЗ
	|	ВТ_ИнформацияОбИностранныхЦБ КАК ВТ_ИнформацияОбИностранныхЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РыночныеКотировки КАК ВТ_РыночныеКотировки
	|		ПО (ВЫБОР
	|				КОГДА ВТ_РыночныеКотировки.ЦБ <> ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)
	|					ТОГДА ВТ_ИнформацияОбИностранныхЦБ.ЦБ = ВТ_РыночныеКотировки.ЦБ
	|				ИНАЧЕ ВТ_ИнформацияОбИностранныхЦБ.НомерРегистрации <> """"
	|							И ВТ_ИнформацияОбИностранныхЦБ.НомерРегистрации = ВТ_РыночныеКотировки.НомерРегистрации
	|						ИЛИ ВТ_ИнформацияОбИностранныхЦБ.ISIN <> """"
	|							И ВТ_ИнформацияОбИностранныхЦБ.ISIN = ВТ_РыночныеКотировки.ISIN
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РыночныеЦеныЦенныхБумаг КАК РыночныеЦеныЦенныхБумаг
	|		ПО ВТ_ИнформацияОбИностранныхЦБ.ЦБ = РыночныеЦеныЦенныхБумаг.ЦеннаяБумага
	|			И РыночныеЦеныЦенныхБумаг.Период = &ОтчетныйПериод
	|			И РыночныеЦеныЦенныхБумаг.МетодикаРасчета = ЗНАЧЕНИЕ(Перечисление.МетодикиРасчетаРыночныхЦен.Для0409404)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнформацияОбЦБ.ЦБ КАК ЦБ,
	|	ВТ_ИнформацияОбЦБ.ISIN КАК ISIN,
	|	ВТ_ИнформацияОбЦБ.НомерРегистрации КАК НомерРегистрации,
	|	ВТ_ИнформацияОбЦБ.КодВидаЦББанкаРоссии КАК КодВидаЦББанкаРоссии,
	|	ВТ_ИнформацияОбЦБ.ВалютаНоминала КАК ВалютаНоминала,
	|	ВТ_ИнформацияОбЦБ.КодВалютыНоминала КАК КодВалютыНоминала,
	|	ВТ_ИнформацияОбЦБ.НоминальнаяЦена КАК НоминальнаяЦена,
	|	ВТ_ИнформацияОбЦБ.РыночнаяКотировка КАК РыночнаяКотировка,
	|	ВТ_ИнформацияОбЦБ.УровеньОценки КАК УровеньОценки,
	|	ВТ_ИнформацияОбЦБ.МетодОценки КАК МетодОценки,
	|	ВТ_ИнформацияОбЦБ.КодВалютыНоминалаПоДаннымBQ КАК КодВалютыНоминалаПоДаннымBQ,
	|	ВТ_ИнформацияОбЦБ.ЭтоДепозитарнаяРасписка КАК ЭтоДепозитарнаяРасписка,
	|	ВТ_ИнформацияОбЦБ.ЭтоВидЦБСНулевымНоминалом КАК ЭтоВидЦБСНулевымНоминалом,
	|	ВТ_ИнформацияОбЦБ.ЭтоДолговаяЦБ КАК ЭтоДолговаяЦБ,
	|	ВТ_ИнформацияОбЦБ.Погашена КАК Погашена,
	|	ВТ_ИнформацияОбЦБ.Просрочена КАК Просрочена,
	|	ВТ_ИнформацияОбЦБ.Дефолтная КАК Дефолтная,
	|	ВТ_ИнформацияОбЦБ.ВРегистреРыночныеЦеныЦБНеНайденаЦенаЦБ КАК ВРегистреРыночныеЦеныЦБНеНайденаЦенаЦБ
	|ИЗ
	|	ВТ_ИнформацияОбЦБ КАК ВТ_ИнформацияОбЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнформацияОМестахХранения.МестоХранения КАК МестоХранения,
	|	ВТ_ИнформацияОМестахХранения.ПризнакОрганизации КАК ПризнакОрганизации,
	|	ВТ_ИнформацияОМестахХранения.ПризнакМестаХранения КАК ПризнакМестаХранения,
	|	ВТ_ИнформацияОМестахХранения.КодМестаХранения КАК КодМестаХранения
	|ИЗ
	|	ВТ_ИнформацияОМестахХранения КАК ВТ_ИнформацияОМестахХранения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнформацияОбЦБ.ISIN КАК ISIN,																				// 2
	|	ВТ_ИнформацияОбЦБ.КодВидаЦББанкаРоссии КАК КодТипЦБум,															// 3
	|	ВТ_ИнформацияОбЦБ.КодСрокаПогашения КАК КодСрокаПог,															// 4
	|	ВТ_ИнформацияОбЦБ.НаименованиеЭмитента КАК НаимЭмит,															// 5
	|	ВТ_ИнформацияОбЦБ.КодСтраныЭмитента КАК КодСтраны,																// 6
	|	ВТ_ИнформацияОбЦБ.КодСектораЭкономики КАК КодСектЭк,															// 7
	|																													// 8 не заполняется
	|	ВТ_ИнформацияОДепонентах.ПризнакКлиента КАК ПризКлиента,														// 9
	|	ВТ_ИнформацияОДепонентах.КодКлиента КАК КодКлиента,																// 10
	|	ВТ_ИнформацияОДепонентах.КодРегионаКлиента КАК КодРегионКл,														// 11
	|	СУММА(ВТ_ОстаткиИностранныхЦБУРезидентов.Количество) КАК КолЦБум,												// 12
	|	ВТ_ИнформацияОбЦБ.КодВалютыНоминала КАК КодВалюты,																// 13
	|	ВТ_ИнформацияОбЦБ.НоминальнаяЦена КАК ЦенаЦБумНомин,															// 14
	|	ВТ_ИнформацияОбЦБ.РыночнаяКотировка КАК ЦенаЦБумРын,															// 15
	|	СУММА(ВТ_ОстаткиИностранныхЦБУРезидентов.Количество * ВТ_ИнформацияОбЦБ.НоминальнаяЦена) КАК ОбщСтЦБумНомин,	// 16
	|	СУММА(ВТ_ОстаткиИностранныхЦБУРезидентов.Количество * ВТ_ИнформацияОбЦБ.РыночнаяКотировка) КАК ОбщСтЦБумРын,	// 17
	|	ВТ_ИнформацияОбЦБ.МетодОценки КАК КодМетОцСтоимЦБум,															// 18
	|	ВТ_ИнформацияОМестахХранения.ПризнакМестаХранения КАК ПризнМестаХр,												// 19
	|	ВТ_ИнформацияОМестахХранения.КодМестаХранения КАК 	КодМестХранЦБум,											// 20
	|	ВТ_ИнформацияОДепонентах.ОсобаяПометка КАК ОсобПом,																// 21
	|	ВТ_ОстаткиИностранныхЦБУРезидентов.ЦБ КАК ЦБ,
	|	ВТ_ОстаткиИностранныхЦБУРезидентов.МестоХранения КАК МестоХранения,
	|	ВТ_ИнформацияОбЦБ.Эмитент КАК Эмитент
	|ИЗ
	|	ВТ_ОстаткиИностранныхЦБУРезидентов КАК ВТ_ОстаткиИностранныхЦБУРезидентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнформацияОДепонентах КАК ВТ_ИнформацияОДепонентах
	|		ПО ВТ_ОстаткиИностранныхЦБУРезидентов.Депонент = ВТ_ИнформацияОДепонентах.Депонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнформацияОбЦБ КАК ВТ_ИнформацияОбЦБ
	|		ПО ВТ_ОстаткиИностранныхЦБУРезидентов.ЦБ = ВТ_ИнформацияОбЦБ.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнформацияОМестахХранения КАК ВТ_ИнформацияОМестахХранения
	|		ПО ВТ_ОстаткиИностранныхЦБУРезидентов.МестоХранения = ВТ_ИнформацияОМестахХранения.МестоХранения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИнформацияОбЦБ.КодСектораЭкономики,
	|	ВТ_ИнформацияОбЦБ.КодСтраныЭмитента,
	|	ВТ_ИнформацияОбЦБ.Эмитент,
	|	ВТ_ИнформацияОбЦБ.КодВидаЦББанкаРоссии,
	|	ВТ_ИнформацияОбЦБ.ISIN,
	|	ВТ_ИнформацияОДепонентах.КодКлиента,
	|	ВТ_ИнформацияОбЦБ.МетодОценки,
	|	ВТ_ИнформацияОМестахХранения.ПризнакМестаХранения,
	|	ВТ_ИнформацияОбЦБ.НаименованиеЭмитента,
	|	ВТ_ИнформацияОДепонентах.ПризнакКлиента,
	|	ВТ_ИнформацияОДепонентах.КодРегионаКлиента,
	|	ВТ_ОстаткиИностранныхЦБУРезидентов.ЦБ,
	|	ВТ_ОстаткиИностранныхЦБУРезидентов.МестоХранения,
	|	ВТ_ИнформацияОМестахХранения.КодМестаХранения,
	|	ВТ_ИнформацияОДепонентах.ОсобаяПометка,
	|	ВТ_ИнформацияОбЦБ.НоминальнаяЦена,
	|	ВТ_ИнформацияОбЦБ.КодСрокаПогашения,
	|	ВТ_ИнформацияОбЦБ.КодВалютыНоминала,
	|	ВТ_ИнформацияОбЦБ.РыночнаяКотировка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ИнформацияОбЦБ.НаименованиеЭмитента,
	|	ВТ_ИнформацияОбЦБ.КодВидаЦББанкаРоссии";
	
	Возврат Текст;
КонецФункции

Функция РыночныеЦеныЦБ(ИспользуемыеЦБ)
	Перем АДО;
	
	ДатаКотировокСтрокой = Формат(ОтчетныйПериод, "ДФ='yyyyMMdd'");
	
	СписокЦБВФорматеJSON = СписокЦБВФорматеJSON(ИспользуемыеЦБ);
	
	РыночныеЦеныЦБ = Новый ТаблицаЗначений;
	ЛитералСтрока = "Строка";
	ОписаниеТипаДляКотировок = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 6));
	РыночныеЦеныЦБ.Колонки.Добавить("ЦБ", Новый ОписаниеТипов("СправочникСсылка.ЦенныеБумаги"));
	РыночныеЦеныЦБ.Колонки.Добавить("RegNum", Новый ОписаниеТипов(ЛитералСтрока, , Новый КвалификаторыСтроки(50)));
	РыночныеЦеныЦБ.Колонки.Добавить("ISIN", Новый ОписаниеТипов(ЛитералСтрока, , Новый КвалификаторыСтроки(30)));
	РыночныеЦеныЦБ.Колонки.Добавить("Rate", ОписаниеТипаДляКотировок);
	РыночныеЦеныЦБ.Колонки.Добавить("RateNominal", ОписаниеТипаДляКотировок);
	РыночныеЦеныЦБ.Колонки.Добавить("RateWithAccru", ОписаниеТипаДляКотировок);
	РыночныеЦеныЦБ.Колонки.Добавить("RateNominalWithAccru", ОписаниеТипаДляКотировок);
	РыночныеЦеныЦБ.Колонки.Добавить("NominalCurrency", Новый ОписаниеТипов(ЛитералСтрока, , Новый КвалификаторыСтроки(3)));
	РыночныеЦеныЦБ.Колонки.Добавить("Level", Новый ОписаниеТипов(ЛитералСтрока, , Новый КвалификаторыСтроки(1)));
	РыночныеЦеныЦБ.Колонки.Добавить("Metod", Новый ОписаниеТипов(ЛитералСтрока, , Новый КвалификаторыСтроки(2)));
	
	Если ПолучатьЦеныИзBQ И Не ПустаяСтрока(СписокЦБВФорматеJSON) Тогда
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.НРБСервисStoredProcSQL;
		ВходныеПараметры = Новый Структура;
		ВходныеПараметры.Вставить("Date", ДатаКотировокСтрокой);
		ВходныеПараметры.Вставить("JsonParams", СписокЦБВФорматеJSON);
		
		Попытка
			Параметры = Неопределено;
			ВнешниеДанные.ДобавитьПараметрСоединения(Параметры, "ВнешнийИсточник", ВнешнийИсточник);
			ВнешниеДанные.ИнициироватьСоединение(АДО, "АДО", Параметры);
			// Получаем рыночные котировки ЦБ с помощью вызова хранимки из базы backQORT
			// Возвращается таблица с колонками RateDate, RegNum, ISIN, Rate, RateCurrency, Level, NominalCurrency, CrossRate, RateNominal
			ДанныеBQ = АДО.ВыполнитьХранимуюПроцедуру("[GATE].[GetMarketData]", ВходныеПараметры);
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ШаблонСообщенияОбОшибке = "BQ: при попытке получить рыночные котировки на дату: %1 произошла ошибка: " + ТекстОшибки;
			ТекстСообщенияОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, ДатаКотировокСтрокой);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке);
			ДанныеBQ = Неопределено;
		КонецПопытки;
		
		Если ДанныеBQ <> Неопределено 	Тогда
			ПереместитьДанныеОКотировкахВТаблицуСТипизированнымиКолонками(РыночныеЦеныЦБ, ДанныеBQ);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПолучатьЦеныИзBQ И Не ПустаяСтрока(СписокЦБВФорматеJSON) Тогда
		
		Если ОбщегоНазначения.РабочийДень(ОтчетныйПериод) Тогда
			ОтчетныйРабочийПериод = ОтчетныйПериод;
		Иначе
			ОтчетныйРабочийПериод = ОбщегоНазначения.ПредыдущийРабочийДень(ОтчетныйПериод);
		КонецЕсли;
		
		СрезНаДату = Ложь;
		РасчетРыночныхЦенДля0409404.ЗаполнитьТаблицуДляОтчета0409404(ОтчетныйРабочийПериод, ИспользуемыеЦБ, РыночныеЦеныЦБ, СрезНаДату);
		
		Методика = Перечисления.МетодикиРасчетаРыночныхЦен.Для0409404;
		ОписаниеОшибки =
			РегистрыСведений.СостоянияРасчетаРыночныхЦенЦенныхБумаг.ОписаниеНезавершенногоСостоянияОсновногоРасчета(ОтчетныйРабочийПериод, Методика);
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РыночныеЦеныЦБ;
КонецФункции

Процедура ПереместитьДанныеОКотировкахВТаблицуСТипизированнымиКолонками(РыночныеЦеныЦБ, ДанныеBQ)
	Для Каждого ДанныеОБумагеИзBQ Из ДанныеBQ Цикл
		НовСтрокаТЗ = РыночныеЦеныЦБ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрокаТЗ, ДанныеОБумагеИзBQ, , "Rate,RateNominal,RateWithAccru,RateNominalWithAccru");
		НовСтрокаТЗ.Rate = ПреобразоватьСтрокуВЧисло(ДанныеОБумагеИзBQ.Rate);
		НовСтрокаТЗ.RateNominal = ПреобразоватьСтрокуВЧисло(ДанныеОБумагеИзBQ.RateNominal);
		НовСтрокаТЗ.RateWithAccru = ПреобразоватьСтрокуВЧисло(ДанныеОБумагеИзBQ.RateWithAccru);
		НовСтрокаТЗ.RateNominalWithAccru = ПреобразоватьСтрокуВЧисло(ДанныеОБумагеИзBQ.RateNominalWithAccru);
	КонецЦикла;
КонецПроцедуры

Функция ПреобразоватьСтрокуВЧисло(ЧислоСтрокой)
	ЧислоСтрокойБезПробелов = СтрЗаменить(СтрЗаменить(ЧислоСтрокой, " ", ""), Символы.НПП, "");
	ОписаниеТипа = Новый ОписаниеТипов("Число");
	Число = ОписаниеТипа.ПривестиЗначение(ЧислоСтрокойБезПробелов);
	
	Возврат Число;
КонецФункции

Функция СписокЦБВФорматеJSON(ИспользуемыеЦБ)
	ТекстJSON = "";
	
	ЭтоПерваяСтрока = Истина;
	Для каждого СтрокаТЗ Из ИспользуемыеЦБ Цикл
		ПолеRegNum = ОписаниеПоляJSON("RegNum", СтрокаТЗ.НомерРегистрации);
		ПолеIsin = ОписаниеПоляJSON("Isin", СтрокаТЗ.ISIN);
		Если ПолеIsin = "" И ПолеRegNum = "" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоПерваяСтрока Тогда
			ЭтоПерваяСтрока = Ложь;
		Иначе
			ТекстJSON = ТекстJSON + ",";
		КонецЕсли;
		ТекстJSON = ТекстJSON + "{" + ПолеRegNum + ?(ПолеRegNum = "" Или ПолеIsin = "", "", ",") + ПолеIsin + "}";
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекстJSON) Тогда
		ТекстJSON = "[" + ТекстJSON + "]";
	КонецЕсли;
	
	Возврат ТекстJSON;
КонецФункции

Функция ОписаниеПоляJSON(ИмяПоля, ЗначениеПоля)
	Если Не ПустаяСтрока(ЗначениеПоля) Тогда
		ОписаниеПоля = """" + ИмяПоля + """:""" + ЗначениеПоля + """";
	Иначе
		ОписаниеПоля = "";
	КонецЕсли;
	
	Возврат ОписаниеПоля;
КонецФункции

Процедура ПроверитьДанныеМестХранения(ДанныеМестХранения)
	Для каждого Данные Из ДанныеМестХранения Цикл
		ИмяНезаполненногоРеквизита = "";
		
		Если Не ЗначениеЗаполнено(Данные.ПризнакОрганизации) Тогда
			ИмяНезаполненногоРеквизита = "Признак организации";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Данные.КодМестаХранения) Тогда
			Если Данные.ПризнакМестаХранения = "1" Тогда
				ИмяНезаполненногоРеквизита = "Регистрационный номер";
			Иначе
				ИмяНезаполненногоРеквизита = "ИНН";
			КонецЕсли;
		КонецЕсли;
		
		Если ИмяНезаполненногоРеквизита <> "" Тогда
			ОписаниеОшибки =  "Для места хранения " + Строка(Данные.МестоХранения) + " не указан " + ИмяНезаполненногоРеквизита;
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьДанныеЦБ(ВсеДанные, КодыВидовИностранныхЦБ, КодыВидовИностранныхЦБСтрокой)
	ИмяИсточникаРыночныхЦен = ?(ПолучатьЦеныИзBQ, "BackQORT", "1С");
	Для каждого Данные Из ВсеДанные Цикл
		ПроверитьСтрокуДанных(Данные, КодыВидовИностранныхЦБ, КодыВидовИностранныхЦБСтрокой, ИмяИсточникаРыночныхЦен);
	КонецЦикла;
КонецПроцедуры

Функция КотировкаИзДЕПО(Данные)
	КотировкаИзДЕПО = Данные.ЭтоДолговаяЦБ И (Данные.Погашена Или Данные.Дефолтная);
	
	Возврат КотировкаИзДЕПО;
КонецФункции

Процедура ПроверитьСтрокуДанных(Данные, КодыВидовИностранныхЦБ, КодыВидовИностранныхЦБСтрокой, ИмяИсточникаРыночныхЦен)
	Если ПустаяСтрока(Данные.ISIN) И ПустаяСтрока(Данные.НомерРегистрации) Тогда
		ОписаниеОшибки = ОписаниеЦБ(Данные) + " не заполнены ни ISIN, ни регистрационный номер";
		РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
	КонецЕсли;
	
	Если КодыВидовИностранныхЦБ.Найти(Данные.КодВидаЦББанкаРоссии) = Неопределено Тогда
		ОписаниеОшибки = ОписаниеЦБ(Данные) + " код вида ЦБ банка России " 
							+ Данные.КодВидаЦББанкаРоссии + " не входит в список: " + КодыВидовИностранныхЦБСтрокой;
		РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Данные.ВалютаНоминала) Тогда
		ОписаниеОшибки = ОписаниеЦБ(Данные) + " не указана валюта номинала";
		РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Данные.НоминальнаяЦена) И НоминальнаяСтоимостьДолжнаБытьНеПустой(Данные) Тогда
		ОписаниеОшибки = ОписаниеЦБ(Данные) + " не указана номинальная стоимость";
		РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
	КонецЕсли;
	
	Если Данные.МетодОценки = "НО" И Данные.УровеньОценки = Неопределено Тогда
		ОписаниеОшибки = ОписаниеЦБ(Данные) + " не найдено никакой информации о ней в базе " + ИмяИсточникаРыночныхЦен
			+ ", рыночную цену определить невозможно";
		РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
	Иначе
		Если Не ЗначениеЗаполнено(Данные.РыночнаяКотировка) 
			И Не КотировкаИзДЕПО(Данные) Тогда
			ОписаниеОшибки = ОписаниеЦБ(Данные) + " из " + ИмяИсточникаРыночныхЦен
				+ " получена рыночная цена 0, уровень " + ОписаниеУровняОценки(Данные.УровеньОценки);
			РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Данные.МетодОценки) Тогда
		ОписаниеОшибки = ОписаниеЦБ(Данные) + " не указан код метода оценки рыночной цены";
		РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
	КонецЕсли;
	
	Если Данные.КодВалютыНоминала <> Данные.КодВалютыНоминалаПоДаннымBQ Тогда
		ОписаниеОшибки = ОписаниеЦБ(Данные) + " код валюты номинала по данным 1С ДЕПО (" + Данные.КодВалютыНоминала + ")"
						+ "отличается от кода валюты номинала по данным " + ИмяИсточникаРыночныхЦен + " (" + Данные.КодВалютыНоминалаПоДаннымBQ + ")";
		РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
	КонецЕсли;
	
	Если Данные.Просрочена Тогда
		ОписаниеОшибки = ОписаниеЦБ(Данные, "По ценной бумаге ") + " просрочено погашение";
		РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
	КонецЕсли;
	
	Если Данные.ВРегистреРыночныеЦеныЦБНеНайденаЦенаЦБ Тогда
		ОписаниеОшибки = ОписаниеЦБ(Данные, "По ценной бумаге ")
			+ " не найдена Рыночная цена в валюте ЦБ в регистре ""Рыночные цены ценных бумаг""";
		РегуляторнаяОтчетность.ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

Функция НоминальнаяСтоимостьДолжнаБытьНеПустой(Данные)
	Возврат (Не Данные.ЭтоДепозитарнаяРасписка И Не Данные.ЭтоВидЦБСНулевымНоминалом И Не Данные.Погашена);
КонецФункции

Функция ОписаниеУровняОценки(УровеньОценки)
	
	Если ПолучатьЦеныИзBQ Тогда
		ОписаниеУровня = ОписаниеУровняОценкиBQ(УровеньОценки);
	Иначе
		ОписаниеУровня = ОписаниеУровняОценки1С(УровеньОценки);
	КонецЕсли;
	
	Возврат ОписаниеУровня;
	
КонецФункции

Функция ОписаниеУровняОценкиBQ(УровеньОценки)
	
	Если УровеньОценки = "1" Тогда
		НазваниеУровня = "рыночная цена";
	ИначеЕсли УровеньОценки = "2" Тогда
		НазваниеУровня = "цена номинала";
	ИначеЕсли УровеньОценки = "3" Тогда
		НазваниеУровня = "нет данных о цене";
	Иначе
		НазваниеУровня = "непредвиденный номер уровня";
	КонецЕсли;
	ОписаниеУровня = УровеньОценки + " - " + НазваниеУровня;
	
	Возврат ОписаниеУровня;
КонецФункции

Функция ОписаниеУровняОценки1С(УровеньОценки)
	
	Если УровеньОценки = "1" Или  УровеньОценки = "2" Тогда
		НазваниеУровня = "рыночная цена";
	ИначеЕсли УровеньОценки = "3" Тогда
		НазваниеУровня = "цена последней сделки";
	ИначеЕсли УровеньОценки = "4" Тогда
		НазваниеУровня = "цена номинала";
	ИначеЕсли УровеньОценки = "5" Тогда
		НазваниеУровня = "нет данных о цене";
	Иначе
		НазваниеУровня = "непредвиденный номер уровня";
	КонецЕсли;
	ОписаниеУровня = УровеньОценки + " - " + НазваниеУровня;
	
	Возврат ОписаниеУровня;
КонецФункции

Функция ОписаниеЦБ(Данные, Префикс = Неопределено)
	Если Префикс = Неопределено Тогда
		Префикс = "У ЦБ ";
	КонецЕсли;
	Описание = Префикс + Строка(Данные.ЦБ);
	Если НЕ ПустаяСтрока(Данные.ISIN) Тогда
		Описание = Описание + " (ISIN:" + Данные.ISIN + ")";
	КонецЕсли;
	
	Возврат Описание;
КонецФункции

Функция СоставительОтчета(Фабрика, ПространствоИмен, ОтчетнаяДатаДляXML)
	Составитель = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409404Составитель"));
	
	Составитель.Руководитель = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409404СоставительРуководитель"));
	РегуляторнаяОтчетность.ЗаполнитьИнформациюОбОтветственномЛице(Составитель.Руководитель, Организация,
								Перечисления.ОтветственныеЛицаОрганизаций.ПодписантВРегуляторнойОтчетности, ОтчетнаяДатаДляXML);
	
	Составитель.Исполнитель = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409404СоставительИсполнитель"));
	РегуляторнаяОтчетность.ЗаполнитьИнформациюОбОтветственномЛице(Составитель.Исполнитель, Организация,
								Перечисления.ОтветственныеЛицаОрганизаций.ИсполнительВРегуляторнойОтчетности, ОтчетнаяДатаДляXML);
	
	РегуляторнаяОтчетность.ЗаполнитьИнформациюОбОрганизации(Составитель, Организация, ОтчетнаяДатаДляXML);
	
	Возврат Составитель;
КонецФункции

Функция Данные404(Фабрика, ПространствоИмен)
	Данные404 = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409404Данные404"));
	Данные404.Ид = "1";
	
	Данные404.Раздел2 = Раздел2(Фабрика, ПространствоИмен);
	
	Возврат Данные404;
КонецФункции

Функция Раздел2(Фабрика, ПространствоИмен)
	Раздел2 = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409404Данные404Раздел2"));
	
	Для каждого Данные Из ДанныеРаздела_2 Цикл
		СтрокаРаздела2 = Фабрика.Создать(Фабрика.Тип(ПространствоИмен, "Ф0409404Данные404Раздел2Раздел2Данные"));
		
		// BSLLS:Typo-off
		ЗаполнитьЗначенияСвойств(СтрокаРаздела2, Данные, , "КодРегионКл, КолЦБум, ЦенаЦБумНомин, ЦенаЦБумРын, ОбщСтЦБумНомин, ОбщСтЦБумРын");
		
		// Осторожно! Схема хранимая в конфигурации модифицирована по сравнению с оригинальной:
		//	- добавлены типы: Строка21, Строка29
		//	- в разделе "Ф0409404Данные404Раздел2Раздел2Данные" типы атрибутов Строка29Число15_6Неотр-лок и Число15_6Полож-лок
		//		заменены на Строка21, а Число23_6Неотр-лок на Строка29.
		// Это потребовалось, чтобы все числа можно было выгрузить в файл дополненными до 6 нулей после запятой (см. NRB-321)
		ФорматЧисла = "ЧДЦ=6; ЧРД=.; ЧН=; ЧГ=";
		СтрокаРаздела2.КолЦБум = Формат(Данные.КолЦБум, ФорматЧисла);
		СтрокаРаздела2.ЦенаЦБумНомин = Формат(Данные.ЦенаЦБумНомин, ФорматЧисла);
		СтрокаРаздела2.ЦенаЦБумРын = Формат(Данные.ЦенаЦБумРын, ФорматЧисла);
		СтрокаРаздела2.ОбщСтЦБумНомин = Формат(Данные.ОбщСтЦБумНомин, ФорматЧисла);
		СтрокаРаздела2.ОбщСтЦБумРын = Формат(Данные.ОбщСтЦБумРын, ФорматЧисла);
		// BSLLS:Typo-on
		СтрокаРаздела2.ОсобПом = Данные.ОсобПом;
		РегуляторнаяОтчетность.ПрисвоитьНепустое(СтрокаРаздела2.КодРегионКл, Данные.КодРегионКл);
		Раздел2.Раздел2Данные.Добавить(СтрокаРаздела2);
	КонецЦикла;
	
	Раздел2.КолСтрокРаздДанные = ДанныеРаздела_2.Количество();
	
	Возврат Раздел2;
КонецФункции

// Нумерует строки в данных и заполняет колонку N1 с банковской лицензией организации
// Параметры:
//	Данные - ТабличнаяЧасть - Табличная часть или таблица значений, должна
Процедура ПронумероватьСтроки(Данные)
	НомСтр = 0;
	Для каждого Строка Из Данные Цикл
		НомСтр = НомСтр + 1;
		Строка.Разд2НомСтр = "2." + Формат(НомСтр, "ЧГ=");
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область Инициализация

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);

#КонецОбласти