
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Базовая функциональность".
// Клиентские и серверные процедуры и функции общего назначения:
// - для поддержки формирования печатных форм;
// - для работы с файлами;
// - для работы с управляемыми формами; 
// - для работы с почтовыми адресами;
// - для работы с отборами динамических списков;
// - прочее.
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает значение свойства структуры.
//
// Параметры:
//   Источник - Структура - Объект, из которого необходимо прочитать значение ключа.
//   Ключ - Строка - Имя свойства структуры, значение которого необходимо получить.
//   ЗначениеПоУмолчанию - Произвольный - Необязательный. Возвращаемое значение, 
//                                        когда в структуре нет указанного ключа.
//
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры, или ЗначениеПоУмолчанию, если указанного ключа нет.
//
Функция СвойствоСтруктуры(Источник, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Результат = Неопределено;
	ЕстьСвойство = Ложь;
	Если ТипЗнч(Источник) = Тип("Структура") Тогда
		ЕстьСвойство = Источник.Свойство(Ключ, Результат);
	КонецЕсли;
	
	Если НЕ ЕстьСвойство Тогда
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет наличие реквизита или свойства у произвольного объекта без обращения к метаданным.
//
// Параметры:
//  Объект       - Произвольный - объект, у которого нужно проверить наличие реквизита или свойства;
//  ИмяРеквизита - Строка       - имя реквизита или свойства.
//
// Возвращаемое значение:
//  Булево - Истина, если есть.
//
Функция ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита) Экспорт
	
	КлючУникальности   = Новый УникальныйИдентификатор;
	СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
	
	Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
	
КонецФункции

// Сравнить две строки версий.
//
// Параметры
//  СтрокаВерсии1  – Строка – номер версии в формате РР.{П|ПП}.ЗЗ.СС
//  СтрокаВерсии2  – Строка – второй сравниваемый номер версии
//
// Возвращаемое значение:
//   Число   – больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0.0", СтрокаВерсии2);
	Версия1 = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка1, ".");
	Если Версия1.Количество() <> 4 Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		                    НСтр("ru = 'Неправильный формат строки версии: %1'"), СтрокаВерсии1);
	КонецЕсли;
	Версия2 = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка2, ".");
	Если Версия2.Количество() <> 4 Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	                         НСтр("ru = 'Неправильный формат строки версии: %1'"), СтрокаВерсии2);
	КонецЕсли;
	
	Результат = 0;
	Для Разряд = 0 По 3 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для обработки событий и вызова необязательных подсистем.

// Возвращает Истина, если подсистема существует.
//
// Параметры:
//  ПолноеИмяПодсистемы - Строка. Полное имя объекта метаданных подсистема без слов "Подсистема.".
//                        Например: "СтандартныеПодсистемы.БазоваяФункциональность".
//
// Пример вызова необязательной подсистемы:
//
//  Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
//  	МодульУправлениеДоступом = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеДоступом");
//  	МодульУправлениеДоступом.<Имя метода>();
//  КонецЕсли;
//
// Возвращаемое значение:
//  Булево.
//
Функция ПодсистемаСуществует(ПолноеИмяПодсистемы) Экспорт
	
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	ИменаПодсистем = СтандартныеПодсистемыПовтИсп.ИменаПодсистем();
#Иначе
	ИменаПодсистем = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске(
		).ИменаПодсистем;
#КонецЕсли
	
	Возврат ИменаПодсистем.Получить(ПолноеИмяПодсистемы) <> Неопределено;
	
КонецФункции

 // Возвращает ссылку на общий модуль по имени.
//
// Параметры:
//  Имя          - Строка - имя общего модуля, например:
//                 "ОбщегоНазначения",
//                 "ОбщегоНазначенияКлиент".
//
// Возвращаемое значение:
//  ОбщийМодуль.
//
Функция ОбщийМодуль(Имя) Экспорт
	
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Модуль = СтандартныеПодсистемыСервер.СерверныйОбщийМодуль(Имя);
#Иначе
	Модуль = СтандартныеПодсистемыКлиент.КлиентскийОбщийМодуль(Имя);
#КонецЕсли
	
	Возврат Модуль;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Клиентские и серверные процедуры общего назначения

Функция ЗначениеВМассиве(Значение) Экспорт	
	Результат = Новый Массив;
	Результат.Добавить(Значение);
	
	Возврат Результат;
	
КонецФункции

// Возвращает разность массивов. Разностью двух массивов является массив, содержащий
// все элементы первого массива, не существующие во втором массиве.
//
// Параметры:
//  Массив - Массив - массив элементов, из которого необходимо выполнить вычитание;
//  МассивВычитания - Массив - массив элементов, который будет вычитаться.
// 
// Возвращаемое значение:
//  Массив - разностью двух массивов.
//
// Пример:
//	//А = [1, 3, 5, 7];
//	//В = [3, 7, 9];
//	Результат = ОбщегоНазначенияКлиентСервер.РазностьМассивов(А, В);
//	//Результат = [1, 5];
//
Функция РазностьМассивов(Знач Массив, Знач МассивВычитания) Экспорт
	
	Результат = Новый Массив;
	Для Каждого Элемент Из Массив Цикл
		Если МассивВычитания.Найти(Элемент) = Неопределено Тогда
			Результат.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Клиентские и серверные процедуры общего назначения

// Формирует и выводит сообщение, которое может быть связано с элементом 
// управления формы.
//
//  Параметры
//  ТекстСообщенияПользователю - Строка - текст сообщения.
//  КлючДанных                - Любая ссылка на объект информационной базы.
//                               Ссылка на объект информационной базы, к которому это сообщение относится,
//                               или ключ записи.
//  Поле                       - Строка - наименование реквизита формы
//  ПутьКДанным                - Строка - путь к данным (путь к реквизиту формы)
//  Отказ                      - Булево - Выходной параметр
//                               Всегда устанавливается в значение Истина
//
//	Примеры использования:
//
//	1. Для вывода сообщения у поля управляемой формы, связанного с реквизитом объекта:
//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//		НСтр("ru = 'Сообщение об ошибке.'"), ,
//		"ПолеВРеквизитеФормыОбъект",
//		"Объект");
//
//	Альтернативный вариант использования в форме объекта:
//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//		НСтр("ru = 'Сообщение об ошибке.'"), ,
//		"Объект.ПолеВРеквизитеФормыОбъект");
//
//	2. Для вывода сообщения рядом с полем управляемой формы, связанным с реквизитом формы:
//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//		НСтр("ru = 'Сообщение об ошибке.'"), ,
//		"ИмяРеквизитаФормы");
//
//	3. Для вывода сообщения связанного с объектом информационной базы
//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//		НСтр("ru = 'Сообщение об ошибке.'"), ОбъектИнформационнойБазы, "Ответственный",,Отказ);
//
// 4. Для вывода сообщения по ссылке на объект информационной базы
//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//		НСтр("ru = 'Сообщение об ошибке.'"), Ссылка, , , Отказ);
//
// Случаи некорректного использования:
//  1. Передача одновременно параметров КлючДанных и ПутьКДанным
//  2. Передача в параметре КлючДанных значения типа отличного от допустимых
//  3. Установка ссылки без установки поля (и/или пути к данным)
//
Процедура СообщитьПользователю(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных = Неопределено,
		Знач Поле = "",
		Знач ПутьКДанным = "",
		Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	ЭтоОбъект = Ложь;
	
#Если НЕ (ТонкийКлиент ИЛИ ВебКлиент) Тогда
	Если КлючДанных <> Неопределено
	   И XMLТипЗнч(КлючДанных) <> Неопределено Тогда
		ТипЗначенияСтрокой = XMLТипЗнч(КлючДанных).ИмяТипа;
		ЭтоОбъект = Найти(ТипЗначенияСтрокой, "Object.") > 0;
	КонецЕсли;
#КонецЕсли
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
		
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры

// Формирует путь к заданной строке НомерСтроки и колонке ИмяРеквизита 
// табличной части ИмяТабличнойЧасти для выдачи сообщений в форме.
// Для совместного использования с процедурой СообщитьПользователю
// (для передачи в параметры Поле или ПутьКДанным). 
//
// Параметры:
//  ИмяТабличнойЧасти - Строка - имя табличной части.
//  НомерСтроки       - Число - номер строки табличной части.
//  ИмяРеквизита      - Строка - имя реквизита.
//
// Возвращаемое значение:
//  Строка.
//
Функция ПутьКТабличнойЧасти(Знач ИмяТабличнойЧасти, Знач НомерСтроки, 
	Знач ИмяРеквизита) Экспорт

	Возврат ИмяТабличнойЧасти + "[" + Формат(НомерСтроки - 1, "ЧН=0; ЧГ=0") + "]." + ИмяРеквизита;

КонецФункции

// Дополняет таблицу значений-приемник данными из таблицы значений-источник
//
// Параметры:
//  ТаблицаИсточник - Таблица значений - таблица из которой будут браться строки для заполнения
//  ТаблицаПриемник - Таблица значений - таблица в которую будут добавлены строки из таблицы-источника
//  
Процедура ДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник) Экспорт
	
	Для каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);
		
	КонецЦикла;
	
КонецПроцедуры

// Дополняет таблицу значений Таблица значениями из массива Массив.
//
// Параметры:
//  Таблица - ТаблицаЗначений - таблица, которую необходимо заполнить значениями из массива
//  Массив - Массив - массив значений для заполнения таблицы
//  ИмяПоля - Строка - имя поля таблицы значений, в которое необходимо загрузить значения из массива
// 
Процедура ДополнитьТаблицуИзМассива(Таблица, Массив, ИмяПоля) Экспорт

	Для каждого Значение Из Массив Цикл
		
		Таблица.Добавить()[ИмяПоля] = Значение;
		
	КонецЦикла;
	
КонецПроцедуры

// Снимает один элемент условного оформления, если это список значений.
// Параметры
// УсловноеОформление - условное оформление элемента формы
// ИдентификаторПользовательскойНастройки - строка - идентификатор настройки
// Значение - значение, которое требуется удалить из списка оформления
//
Процедура СнятьУсловноеОформлениеСпискаЗначений(
						УсловноеОформление,
						знач ИдентификаторПользовательскойНастройки,
						знач Значение) Экспорт
	
	Для каждого ЭлементУО Из УсловноеОформление.Элементы Цикл
		Если ЭлементУО.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки Тогда
			Если ЭлементУО.Отбор.Элементы.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			ЭлементСписокОтбора = ЭлементУО.Отбор.Элементы[0];
			Если ЭлементСписокОтбора.ПравоеЗначение = Неопределено Тогда
				Возврат;
			КонецЕсли;
			ЭлементСписка = ЭлементСписокОтбора.ПравоеЗначение.НайтиПоЗначению(Значение);
			Если ЭлементСписка <> Неопределено Тогда
				ЭлементСписокОтбора.ПравоеЗначение.Удалить(ЭлементСписка);
			КонецЕсли;
			ЭлементСписокОтбора.ПравоеЗначение = ЭлементСписокОтбора.ПравоеЗначение;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Дополняет массив МассивПриемник значениями из массива МассивИсточник.
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения.
//  МассивИсточник - Массив - массив значений для заполнения.
//  ТолькоУникальныеЗначения - Булево - если истина, то в массив будут включены только уникальные значения.
//
Процедура ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь) Экспорт
	
	Если ТолькоУникальныеЗначения Тогда
		
		УникальныеЗначения = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			УникальныеЗначения.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			Если УникальныеЗначения[Значение] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				УникальныеЗначения.Вставить(Значение, Истина);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Дополняет структуру всеми значениями из другой структуры.
//
// Параметры:
//   Приемник - Структура - коллекция, в которую будут добавляться новые значения.
//   Источник - Структура - коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
//   Заменять - Булево
//            - Неопределено - что делать в местах пересечения ключей источника и приемника:
//                             Истина - заменять значения приемника (самый быстрый способ),
//                             Ложь   - не заменять значения приемника (пропускать),
//                             Неопределено - значение по умолчанию. Бросать исключение.
//
Процедура ДополнитьСтруктуру(Приемник, Источник, Заменять = Неопределено) Экспорт
	
	Для Каждого Элемент Из Источник Цикл
		Если Заменять <> Истина И Приемник.Свойство(Элемент.Ключ) Тогда
			Если Заменять = Ложь Тогда
				Продолжить;
			Иначе
				ТекстОшибки = НСтр("ru = 'Пересечение ключей источника и приемника: ""%1"".'");
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Элемент.Ключ);
			КонецЕсли;
		КонецЕсли;
		Приемник.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
КонецПроцедуры

// Дополняет структуру указанными элементами из другой структуры.
//
// Параметры:
//   СтруктураПриемник - Структура - коллекция, в которую будут добавляться новые значения.
//   СтруктураИсточник - Структура - коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
//   Ключи - Строка - список элементов коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
Процедура ДополнитьСтруктуруВыборочно(СтруктураПриемник, СтруктураИсточник, Ключи) Экспорт
	
	МассивКлючей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Ключи, ",");
	Для Каждого Ключ Из МассивКлючей Цикл
		Если СтруктураИсточник.Свойство(Ключ) Тогда
			СтруктураПриемник.Вставить(Ключ, СтруктураИсточник[Ключ]);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Дополняет структуру еще одним элементом из другой структуры, причем если элемента с таким
// ключом там нет - он все равно добовляется, со значеним по умолчанию
//
// Параметры:
//   СтруктураПриемник - Структура - коллекция, в которую будут добавляться новые значения.
//   СтруктураИсточник - Структура - коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
//   КлючЭлемента - Строка
//   ЗначениеПоУмолчанию - Строка - или значению любого другого типа
Процедура ДобавитьЭлементСтруктуры(СтруктураПриемник, СтруктураИсточник, КлючЭлемента, ЗначениеПоУмолчанию) Экспорт
	Если СтруктураИсточник.Свойство(КлючЭлемента) Тогда
		ЗначениеЭлемента = СтруктураИсточник[КлючЭлемента];
	Иначе
		ЗначениеЭлемента = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	СтруктураПриемник.Вставить(КлючЭлемента, ЗначениеЭлемента);
КонецПроцедуры

// Дополняет структуру еще одним элементом если элемента с таким ключом еще нет в ней
//
// Параметры:
//   Структура - Структура - коллекция, в которую будет добавляться новый элемент
//   КлючЭлемента - Строка
//   ЗначениеЭлемента - Строка - или значению любого другого типа
Процедура ДобавитьЭлементСтруктурыПриОтсутствии(Структура , КлючЭлемента, ЗначениеЭлемента) Экспорт
	Если Не Структура.Свойство(КлючЭлемента) Тогда
		Структура.Вставить(КлючЭлемента, ЗначениеЭлемента);
	КонецЕсли;
КонецПроцедуры

// Дополняет соответствие значениями из другого соответствия.
//
// Параметры:
//   Приемник - Соответствие - коллекция, в которую будут добавляться новые значения.
//   Источник - Соответствие из КлючИЗначение - коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
//   Заменять - Булево
//            - Неопределено - что делать в местах пересечения ключей источника и приемника:
//                             Истина - заменять значения приемника (самый быстрый способ),
//                             Ложь   - не заменять значения приемника (пропускать),
//                             Неопределено - значение по умолчанию. Бросать исключение.
//
Процедура ДополнитьСоответствие(Приемник, Источник, Заменять = Неопределено) Экспорт
	
	Для Каждого Элемент Из Источник Цикл
		Если Заменять <> Истина И Приемник[Элемент.Ключ] <> Неопределено Тогда
			Если Заменять = Ложь Тогда
				Продолжить;
			Иначе
				ТекстОшибки = НСтр("ru = 'Пересечение ключей источника и приемника: ""%1"".'");
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Элемент.Ключ);
			КонецЕсли;
		КонецЕсли;
		Приемник.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
КонецПроцедуры

// Удаляет все вхождения переданного значения из массива
//
// Параметры:
//  Массив - массив, из которого необходимо удалить значение
//  Значение - удаляемое значение из массива
// 
Процедура УдалитьВсеВхожденияЗначенияИзМассива(Массив, Значение) Экспорт
	
	КолвоЭлементовКоллекции = Массив.Количество();
	
	Для ОбратныйИндекс = 1 По КолвоЭлементовКоллекции Цикл
		
		Индекс = КолвоЭлементовКоллекции - ОбратныйИндекс;
		
		Если Массив[Индекс] = Значение Тогда
			
			Массив.Удалить(Индекс);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Удаляет все вхождения значений указанного типа
//
// Параметры:
//  Массив - массив, из которого необходимо удалить значения
//  Тип – тип, значения которых следует удалить из коллекции
// 
Процедура УдалитьВсеВхожденияТипаИзМассива(Массив, Тип) Экспорт
	
	КолвоЭлементовКоллекции = Массив.Количество();
	
	Для ОбратныйИндекс = 1 По КолвоЭлементовКоллекции Цикл
		
		Индекс = КолвоЭлементовКоллекции - ОбратныйИндекс;
		
		Если ТипЗнч(Массив[Индекс]) = Тип Тогда
			
			Массив.Удалить(Индекс);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Удаляет одно значение из массива
//
// Параметры:
//  Массив - массив, из которого необходимо удалить значение
//  Значение - удаляемое значение из массива
// 
Процедура УдалитьЗначениеИзМассива(Массив, Значение) Экспорт
	
	Индекс = Массив.Найти(Значение);
	
	Если Индекс <> Неопределено Тогда
		
		Массив.Удалить(Индекс);
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет коллекцию-приемник значениями из коллекции-источник
// В качестве коллекций источника и приемника могут выступать типы:
// ТаблицаЗначений; ДеревоЗначений; СписокЗначений и пр.
//
// Параметры:
//  КоллекцияИсточник - коллекция значений, которая является источником для заполнения данных
//  КоллекцияПриемник - коллекция значений, которая является приемником для заполнения данных
// 
Процедура ЗаполнитьКоллекциюСвойств(КоллекцияИсточник, КоллекцияПриемник) Экспорт
	
	Для Каждого Элемент ИЗ КоллекцияИсточник Цикл
		
		ЗаполнитьЗначенияСвойств(КоллекцияПриемник.Добавить(), Элемент);
		
	КонецЦикла;
	
КонецПроцедуры

// Получает массив значений из отмеченных элементов списка значений
//
// Параметры:
//  Список - СписокЗначений - список значений из которого будет формироваться массив значений
// 
// Возвращаемое значение:
//  Массив - массив значений из отмеченных элементов списка значений
//
Функция ПолучитьМассивОтмеченныхЭлементовСписка(Список) Экспорт
	
	// возвращаемое значение функции
	Массив = Новый Массив;
	
	Для Каждого Элемент ИЗ Список Цикл
		
		Если Элемент.Пометка Тогда
			
			Массив.Добавить(Элемент.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Массив;
КонецФункции

// Вычитает один массив элементов из другого массива. Возвращает результат вычитания.
//
// Параметры:
//  Массив - массив элементов, из которого необходимо выполнить вычитание
//  МассивВычитания - массив элементов, который будет вычитаться
// 
//  Возвращаемое значение:
//  Массив – результат вычитания двух массивов
//
Функция СократитьМассив(Массив, МассивВычитания) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого Элемент Из Массив Цикл
		
		Если МассивВычитания.Найти(Элемент) = Неопределено Тогда
			
			Результат.Добавить(Элемент);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Преобразует РасписаниеРегламентногоЗадания в структуру.
//
// Параметры:
//  Расписание - РасписаниеРегламентногоЗадания
// 
// Возвращаемое значение:
//  Структура
//
Функция РасписаниеВСтруктуру(Знач Расписание) Экспорт
	
	ЗначениеРасписания = Расписание;
	Если ЗначениеРасписания = Неопределено Тогда
		ЗначениеРасписания = Новый РасписаниеРегламентногоЗадания();
	КонецЕсли;
	СписокПолей = "ВремяЗавершения,ВремяКонца,ВремяНачала,ДатаКонца,ДатаНачала,ДеньВМесяце,ДеньНеделиВМесяце," + 
		"ДниНедели,ИнтервалЗавершения,Месяцы,ПаузаПовтора,ПериодНедель,ПериодПовтораВТечениеДня,ПериодПовтораДней";
	Результат = Новый Структура(СписокПолей);
	ЗаполнитьЗначенияСвойств(Результат, ЗначениеРасписания, СписокПолей);
	ДетальныеРасписанияДня = Новый Массив;
	Для каждого РасписаниеДля Из Расписание.ДетальныеРасписанияДня Цикл
		ДетальныеРасписанияДня.Добавить(РасписаниеВСтруктуру(РасписаниеДля));
	КонецЦикла;
	Результат.Вставить("ДетальныеРасписанияДня", ДетальныеРасписанияДня);
	Возврат Результат;
	
КонецФункции		
	
// Преобразует структуру в РасписаниеРегламентногоЗадания.
//
// Параметры:
//  СтруктураРасписания - Структура
// 
// Возвращаемое значение:
//  РасписаниеРегламентногоЗадания
//
Функция СтруктураВРасписание(Знач СтруктураРасписания) Экспорт
	
	Если СтруктураРасписания = Неопределено Тогда
		Возврат Новый РасписаниеРегламентногоЗадания();
	КонецЕсли;
	СписокПолей = "ВремяЗавершения,ВремяКонца,ВремяНачала,ДатаКонца,ДатаНачала,ДеньВМесяце,ДеньНеделиВМесяце," + 
		"ДниНедели,ИнтервалЗавершения,Месяцы,ПаузаПовтора,ПериодНедель,ПериодПовтораВТечениеДня,ПериодПовтораДней";
	Результат = Новый РасписаниеРегламентногоЗадания;
	ЗаполнитьЗначенияСвойств(Результат, СтруктураРасписания, СписокПолей);
	ДетальныеРасписанияДня = Новый Массив;
	Для каждого Расписание Из СтруктураРасписания.ДетальныеРасписанияДня Цикл
		  ДетальныеРасписанияДня.Добавить(СтруктураВРасписание(Расписание));
	КонецЦикла;
	Результат.ДетальныеРасписанияДня = ДетальныеРасписанияДня;  
	Возврат Результат;
	
КонецФункции		

////////////////////////////////////////////////////////////////////////////////
// Блок функций для поддержки формирования печатных форм
//

////////////////////////////////////////////////////////////////////////////////
// Блок функций для работы с файловой системой
//

// Процедура УдалитьКаталогСФайлами удаляет все файлы в заданном каталоге.
//
// Параметры:
//  Путь         - Строка, полный путь каталога, в котором требуется
//                 удалить все файлы.
//
Процедура УдалитьКаталогСФайлами(Путь) Экспорт
	
	Каталог = Новый Файл(Путь);
	
	Если Каталог.Существует() Тогда
		УдалитьФайлы(Путь);
	КонецЕсли;
	
КонецПроцедуры // УдалитьКаталогСФайлами()

// Добавляет к переданному пути каталога конечный символ-разделитель,
// если необходимо.
//
// Параметры
//  ПутьКаталога  - Строка - путь к каталогу
//
// Возвращаемое значение:
//   Строка   - путь к каталогу с конечным символом-разделителем.
//
// Примеры использования:
//    Результат = ДобавитьКонечныйРазделительПути("C:\Мой каталог"); // возвращает "C:\Мой каталог\"
//    Результат = ДобавитьКонечныйРазделительПути("C:\Мой каталог\"); // возвращает "C:\Мой каталог\"
//    Результат = ДобавитьКонечныйРазделительПути("ftp://Мой каталог"); // возвращает "ftp://Мой каталог/"
//
Функция ДобавитьКонечныйРазделительПути(Знач ПутьКаталога) Экспорт
	Если ПустаяСтрока(ПутьКаталога) Тогда
		Возврат ПутьКаталога;
	КонецЕсли;
	
	ДобавляемыйСимвол = "\";
	Если Найти(ПутьКаталога, "/") > 0 Тогда
		ДобавляемыйСимвол = "/";
	КонецЕсли;
	
	Длина = СтрДлина(ПутьКаталога);
	Если Длина = 0 Тогда
		Возврат ДобавляемыйСимвол;
	ИначеЕсли Сред(ПутьКаталога, Длина, 1) <> ДобавляемыйСимвол Тогда
		Возврат ПутьКаталога + ДобавляемыйСимвол;
	Иначе 
		Возврат ПутьКаталога;
	КонецЕсли;
КонецФункции

// Составляет полное имя файла из имени каталога и имени файла.
//
// Параметры
//  ИмяКаталога  – Строка, содержащая путь к каталогу файла на диске.
//  ИмяФайла     – Строка, содержащая имя файла, без имени каталога.
//
// Возвращаемое значение:
//   Строка – полное имя файла с учетом каталога.
//
Функция ПолучитьИмяФайла(Знач ИмяКаталога, Знач ИмяФайла) Экспорт

	Если НЕ ПустаяСтрока(ИмяФайла) Тогда
		
		Слэш = "";
		Если (Прав(ИмяКаталога, 1) <> "\") И (Прав(ИмяКаталога, 1) <> "/") Тогда
			Слэш = ?(Найти(ИмяКаталога, "\") = 0, "/", "\");
		КонецЕсли;
		
		Возврат ИмяКаталога + Слэш + ИмяФайла;
		
	Иначе
		
		Возврат ИмяКаталога;
		
	КонецЕсли;

КонецФункции

// Возвращает Истина, если файл существует, и Ложь в ином случае.
//
// Параметры:
//   ИмяФайла - Строка - имя файла для проверки
//
// Возвращаемое значение:
//   Булево
//
Функция ФайлСуществует(ИмяФайла) Экспорт
	
	Файл = Новый Файл(ИмяФайла);
	Возврат Файл.Существует();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Блок функций для работы с почтовыми адресами
//

// Функция проверяет что введенная строка с e-mail адресами введена правильно
//
// Формат строки:
// Z = ИмяПользователя|[Имя Пользователя] [<]пользователь@почтовый_сервер[>], Строка = Z[<разделитель*>Z]..
// 
//   прим.: разделитель* - имеется в виду любой разделитель адресов
//
// Параметры:
// СтрокаАдресов - строка - правильная строка с почтовыми адресами
//
// Возвращаемое значение:
// Структура
// ключ Статус - булево - успех или неуспех преобразования
// в случае успеха содержит ключ Значение:
//           Массив структур, где
//                  Адрес- e-mail получателя
//                  Представление   - имя получателя
// в случае неуспеха содержит ключ СообщениеОбОшибке - строка
//
//  ВАЖНО: Функция возвращает массив структур, в которых одно поле (любое)
//         может быть незаполнено. Может использоваться различными
//         подсистемами для собственного сопоставления имени пользователя
//         некому e-mail адресу. Поэтому, необходимо перед непосредственной
//         отправкой проверить, что поле почтового адреса заполнено.
//
Функция РазобратьСтрокуСПочтовымиАдресами(знач СтрокаАдресов) Экспорт
	
	Результат = Новый Массив;
	
	НедопустимыеСимволы = "!#$%^&*()+`~|\/=";
	СимволыРазделители = ";,";
	
	Индекс = 1;               // номер обрабатываемого символа
	Накопитель = "";          // накопитель символов, после анализа перемещается либо в полное имя
	                          // либо в почтовый адрес
	ПолноеИмяАдресата = "";   // переменная, накапливающая имя адресата
	ПочтовыйАдрес = "";       // переменная, накапливающая e-mail адрес
	// 1 - формирование полного имени: ожидаются любые допустимые символы имени адресата
	// 2 - формирование почтового адреса: ожидаются любые допустимые символы email адреса
	// 3 - завершение формирования очередного почтового адреса - ожидаются символы разделители либо пробелы
	СтадияРазбора = 1; 
	
	СообщениеНедопустимыеСимволы = НСтр("ru = 'Недопустимые символы в почтовом адресе.'");
	СообщениеНеверныйФорматПочтовогоАдреса = НСтр("ru = 'Неверный формат почтового адреса.'");
	
	Пока Индекс <= СтрДлина(СтрокаАдресов) Цикл
		
		Символ = Сред(СтрокаАдресов, Индекс, 1);
		
		Если      Символ = " " Тогда
			Индекс = ? ((ПропуститьПробелы(СтрокаАдресов, Индекс, " ") - 1) > Индекс,
			             ПропуститьПробелы(СтрокаАдресов, Индекс, " ") - 1,
			             Индекс);
			Если      СтадияРазбора = 1 Тогда
				ПолноеИмяАдресата = ПолноеИмяАдресата + Накопитель + " ";
			ИначеЕсли СтадияРазбора = 2 Тогда
				ПочтовыйАдрес = Накопитель;
				СтадияРазбора = 3;
			КонецЕсли;
			Накопитель = "";
		ИначеЕсли Символ = "@" Тогда
			Если      СтадияРазбора = 1 Тогда
				СтадияРазбора = 2;
				
				Для ИндексПоискаНС = 1 По СтрДлина(Накопитель) Цикл
					Если Найти(НедопустимыеСимволы, Сред(Накопитель, ИндексПоискаНС, 1)) > 0 Тогда
						ВызватьИсключение СообщениеНедопустимыеСимволы;
					КонецЕсли;
				КонецЦикла;
				
				Накопитель = Накопитель + Символ;
			ИначеЕсли СтадияРазбора = 2 Тогда
				ВызватьИсключение СообщениеНеверныйФорматПочтовогоАдреса;
			ИначеЕсли СтадияРазбора = 3 Тогда
				ВызватьИсключение СообщениеНеверныйФорматПочтовогоАдреса;
			КонецЕсли;
		ИначеЕсли Найти(СимволыРазделители, Символ) > 0 Тогда
			
			Если      СтадияРазбора = 1 Тогда
				ПолноеИмяАдресата = ПолноеИмяАдресата + Накопитель;
			ИначеЕсли СтадияРазбора = 2 Тогда
				ПочтовыйАдрес = Накопитель;
			КонецЕсли;
			
			СтадияРазбора = 1;
			
			Если НЕ (ПустаяСтрока(ПолноеИмяАдресата) И ПустаяСтрока(ПочтовыйАдрес)) Тогда
				Результат.Добавить(ПроверитьИПодготовитьПочтовыйАдрес(ПолноеИмяАдресата, ПочтовыйАдрес));
			КонецЕсли;
			
			ПочтовыйАдрес = "";
			ПолноеИмяАдресата = "";
			Накопитель = "";
		Иначе
			Если СтадияРазбора = 2 ИЛИ СтадияРазбора = 3 Тогда
				Если Найти(НедопустимыеСимволы, Символ) > 0 Тогда
					ВызватьИсключение СообщениеНедопустимыеСимволы;
				КонецЕсли;
			КонецЕсли;
			
			Накопитель = Накопитель + Символ;
		КонецЕсли;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Если      СтадияРазбора = 1 Тогда
		ПолноеИмяАдресата = ПолноеИмяАдресата + Накопитель;
	ИначеЕсли СтадияРазбора = 2 Тогда
		ПочтовыйАдрес = Накопитель;
	КонецЕсли;

	Если НЕ (ПустаяСтрока(ПолноеИмяАдресата) И ПустаяСтрока(ПочтовыйАдрес)) Тогда
		Результат.Добавить(ПроверитьИПодготовитьПочтовыйАдрес(ПолноеИмяАдресата, ПочтовыйАдрес));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что почтовый адрес не содержит символов обрамления
// если символы обрамления вставлены правильно убирает их
// Параметры:
//  ПолноеИмяАдресата - строка - имя получателя
//  ПочтовыйАдрес     - строка - email адрес
// Возвращаемое значение:
//  Структура:
//   Ключ статус - булево - успех или неуспех операции
//   СообщениеОбОшибке - в случае неуспеха операции содержит сообщение об ошибке
//   Значение - структура - в случае успеха операции содержит записанную структуру почтового
//                          адреса: ключи - Адрес, Представление (строки)
//
Функция ПроверитьИПодготовитьПочтовыйАдрес(знач ПолноеИмяАдресата, знач ПочтовыйАдрес)
	
	НедопустимыйСимволВИмениАдресата = НСтр("ru = 'Недопустимый символ в имени адресата.'");
	НедопустимыйСимволВПочтовомАдресе = НСтр("ru = 'Недопустимый символ в почтовом адресе.'");
	СимволыОбрамления = "<>[]";
	
	ПочтовыйАдрес     = СокрЛП(ПочтовыйАдрес);
	ПолноеИмяАдресата = СокрЛП(ПолноеИмяАдресата);
	
	Если Лев(ПолноеИмяАдресата, 1) = "<" Тогда
		Если Прав(ПолноеИмяАдресата, 1) = ">" Тогда
			ПолноеИмяАдресата = Сред(ПолноеИмяАдресата, 2, СтрДлина(ПолноеИмяАдресата)-2);
		Иначе
			ВызватьИсключение НедопустимыйСимволВИмениАдресата;
		КонецЕсли;
	ИначеЕсли Лев(ПолноеИмяАдресата, 1) = "[" Тогда
		Если Прав(ПолноеИмяАдресата, 1) = "]" Тогда
			ПолноеИмяАдресата = Сред(ПолноеИмяАдресата, 2, СтрДлина(ПолноеИмяАдресата)-2);
		Иначе
			ВызватьИсключение НедопустимыйСимволВИмениАдресата;
		КонецЕсли;
	КонецЕсли;
	
	Если Лев(ПочтовыйАдрес, 1) = "<" Тогда
		Если Прав(ПочтовыйАдрес, 1) = ">" Тогда
			ПочтовыйАдрес = Сред(ПочтовыйАдрес, 2, СтрДлина(ПочтовыйАдрес)-2);
		Иначе
			ВызватьИсключение НедопустимыйСимволВПочтовомАдресе;
		КонецЕсли;
	ИначеЕсли Лев(ПочтовыйАдрес, 1) = "[" Тогда
		Если Прав(ПочтовыйАдрес, 1) = "]" Тогда
			ПочтовыйАдрес = Сред(ПочтовыйАдрес, 2, СтрДлина(ПочтовыйАдрес)-2);
		Иначе
			ВызватьИсключение НедопустимыйСимволВПочтовомАдресе;
		КонецЕсли;
	КонецЕсли;
	
	Для Индекс = 1 По СтрДлина(СимволыОбрамления) Цикл
		Если Найти(ПолноеИмяАдресата, Сред(СимволыОбрамления, Индекс, 1)) <> 0
		 ИЛИ Найти(ПочтовыйАдрес,     Сред(СимволыОбрамления, Индекс, 1)) <> 0 Тогда
			ВызватьИсключение НедопустимыйСимволВПочтовомАдресе;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Адрес, Представление", ПочтовыйАдрес,ПолноеИмяАдресата);
	
КонецФункции

// Формирует структуру с ключами Статус (Истина) и Значение
//
Функция ЗаполнитьРезультат(знач Значение, знач Статус = Истина) Экспорт
	
	Если Статус Тогда
		Возврат Новый Структура("Статус, Значение", Истина, Значение);
	Иначе
		Возврат Новый Структура("Статус, СообщениеОбОшибке", Ложь, Значение);
	КонецЕсли;
	
КонецФункции

// Сдвигает маркер позиции пока встречается символ Символ
// возвращает номер позиции в строке, на которое установился маркер
//
Функция ПропуститьПробелы(знач Строка,
                          знач ТекущийИндекс,
                          знач ПропускаемыйСимвол)
	
	Результат = ТекущийИндекс;
	
	// убираем лишние пробелы если они есть
	Пока ТекущийИндекс < СтрДлина(Строка) Цикл
		Если Сред(Строка, ТекущийИндекс, 1) <> ПропускаемыйСимвол Тогда
			Возврат ТекущийИндекс;
		КонецЕсли;
		ТекущийИндекс = ТекущийИндекс + 1;
	КонецЦикла;
	
	Возврат ТекущийИндекс;
	
КонецФункции

#Если Не ВебКлиент Тогда
// Функция ПолучитьИмяКаталога возвращает полный путь
// к новому каталогу в каталоге временных файлов.
//
// Параметры:
//  Идентификатор - Строка, начальная часть имени каталога во временном каталоге.
//
// Возвращаемое значение:
//  Строка - полное имя временного каталога, например "КаталогВременныхФайлов() + Обработка123\".
// 
Функция ПолучитьИмяКаталога(знач Идентификатор) Экспорт
	
	Индекс = 0;
	
	Пока Истина Цикл
		
		ПутьККаталогу = КаталогВременныхФайлов () + Идентификатор + строка(Индекс) + "\";
		КаталогНаДиске = Новый Файл(ПутьККаталогу);
		Если НЕ КаталогНаДиске.Существует() Тогда
			СоздатьКаталог(ПутьККаталогу);
			Возврат ПутьККаталогу;
		КонецЕсли;
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
КонецФункции // ПолучитьИмяКаталога()
#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// Блок функций для работы с отборами динамических списков
//

// Поиск элементов и групп отбора динамического списка
// Параметры:
//  ОбластьПоиска - контейнер с элементами и группами отбора, например
//                  Список.Отбор или группа в отборе
//  ИмяПоля - имя поля компоновки (не используется для групп)
//  Представление - представление поля компоновки
//  Примечание: поиск может осуществляться или по ЛевомуЗначению, или по Представлению
//
Функция НайтиЭлементыИГруппыОтбора(знач ОбластьПоиска,
									знач ИмяПоля = Неопределено,
									знач Представление = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
		СпособПоиска = 1;
	Иначе
		СпособПоиска = 2;
		ЗначениеПоиска = Представление;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	
	НайтиРекурсивно(ОбластьПоиска.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
	
	Возврат МассивЭлементов;
	
КонецФункции

// Добавление группы отбора
// Параметры:
//  КоллекцияЭлементов - контейнер с элементами и группами отбора, например
//                      Список.Отбор или группа в отборе
//  ТипГруппы - ТипГруппыЭлементовОтбораКомпоновкиДанных - тип группы
//  Представление строка - представление группы
//
Функция СоздатьГруппуЭлементовОтбора(КоллекцияЭлементов, Представление, ТипГруппы) Экспорт
	
	ГруппаЭлементовОтбора = НайтиЭлементОтбораПоПредставлению(КоллекцияЭлементов, Представление);
	Если ГруппаЭлементовОтбора = Неопределено Тогда
		ГруппаЭлементовОтбора = КоллекцияЭлементов.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	Иначе
		ГруппаЭлементовОтбора.Элементы.Очистить();
	КонецЕсли;
	
	ГруппаЭлементовОтбора.Представление    = Представление;
	ГруппаЭлементовОтбора.Применение       = ТипПримененияОтбораКомпоновкиДанных.Элементы;
	ГруппаЭлементовОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ГруппаЭлементовОтбора.ТипГруппы        = ТипГруппы;
	ГруппаЭлементовОтбора.Использование    = Истина;
	
	Возврат ГруппаЭлементовОтбора;
	
КонецФункции

// Добавление элемента компоновки в контейнер элементов компоновки
// Параметры:
//  ОбластьДобавления - контейнер с элементами и группами отбора, например
//                  Список.Отбор или группа в отборе
//  ИмяПоля - строка - имя для поля компоновки данных
//  ВидСравнения - ВидСравненияКомпоновкиДанных - вид сравнения
//  ПравоеЗначение - произвольный
//  Представление - представление элемента компоновки данных
//  Использование - булево - использование элемента
//
Функция ДобавитьЭлементКомпоновки(ОбластьДобавления,
									знач ИмяПоля,
									знач ВидСравнения,
									знач ПравоеЗначение = Неопределено,
									знач Представление  = Неопределено,
									знач Использование  = Неопределено) Экспорт
	
	Элемент = ОбластьДобавления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Элемент.ВидСравнения = ВидСравнения;
	Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Если ПравоеЗначение <> Неопределено Тогда
		Элемент.ПравоеЗначение = ПравоеЗначение;
	КонецЕсли;
	
	Если Представление <> Неопределено Тогда
		Элемент.Представление = Представление;
	КонецЕсли;
	
	Если Использование <> Неопределено Тогда
		Элемент.Использование = Использование;
	КонецЕсли;
	
	Возврат Элемент;
	
КонецФункции

// Изменение элементов отбора
// Параметры
//  ИмяПоля - строка - имя поля компоновки
//  ВидСравнения - ВидСравненияКомпоновкиДанных - вид сравнения
//  ПравоеЗначение - произвольный
//  Представление - строка - представление элемента компоновки данных
//
Функция ИзменитьЭлементыОтбора(ОбластьПоиска,
								знач ИмяПоля = Неопределено,
								знач Представление = Неопределено,
								знач ПравоеЗначение = Неопределено,
								знач ВидСравнения = Неопределено,
								знач Использование = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
		СпособПоиска = 1;
	Иначе
		СпособПоиска = 2;
		ЗначениеПоиска = Представление;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	
	НайтиРекурсивно(ОбластьПоиска.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
	
	Для Каждого Элемент Из МассивЭлементов Цикл
		Если ИмяПоля <> Неопределено Тогда
			Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		КонецЕсли;
		Если Представление <> Неопределено Тогда
			Элемент.Представление = Представление;
		КонецЕсли;
		Если Использование <> Неопределено Тогда
			Элемент.Использование = Использование;
		КонецЕсли;
		Если ВидСравнения <> Неопределено Тогда
			Элемент.ВидСравнения = ВидСравнения;
		КонецЕсли;
		Если ПравоеЗначение <> Неопределено Тогда
			Элемент.ПравоеЗначение = ПравоеЗначение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЭлементов.Количество();
	
КонецФункции

// Поиск элементов и групп отбора динамического списка
// Параметры:
//  ОбластьУдаления - контейнер с элементами и группами отбора, например
//                  Список.Отбор или группа в отборе
//  ИмяПоля - имя поля компоновки (не используется для групп)
//  Представление - представление поля компоновки
//  Примечание: поиск может осуществляться или по ЛевомуЗначению, или по Представлению
//
Процедура УдалитьЭлементыГруппыОтбора(знач ОбластьУдаления,
										знач ИмяПоля = Неопределено,
										знач Представление = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
		СпособПоиска = 1;
	Иначе
		СпособПоиска = 2;
		ЗначениеПоиска = Представление;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	
	НайтиРекурсивно(ОбластьУдаления.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
	
	Для Каждого Элемент Из МассивЭлементов Цикл
		Если Элемент.Родитель = Неопределено Тогда
			ОбластьУдаления.Элементы.Удалить(Элемент);
		Иначе
			Элемент.Родитель.Элементы.Удалить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Используется для создания элемента отбора или, если таковой не найден,
// установления существующим элементам свойств
// Параметры
//  ОбластьПоискаДобавления - контейнер с элементами и группами отбора, например
//                  Список.Отбор или группа в отборе
//  ИмяПоля - строка - имя для поля компоновки данных (заполняется всегда)
// Устанавливаемые поля:
//  ВидСравнения - ВидСравненияКомпоновкиДанных - вид сравнения
//  ПравоеЗначение - произвольный
//  Представление - представление элемента компоновки данных
//  Использование - булево - использование элемента
//
Процедура УстановитьЭлементОтбора(ОбластьПоискаДобавления,
								знач ИмяПоля,
								знач ПравоеЗначение = Неопределено,
								знач ВидСравнения = Неопределено,
								знач Представление = Неопределено,
								знач Использование = Неопределено) Экспорт
	
	ЧислоИзмененных = ИзменитьЭлементыОтбора(ОбластьПоискаДобавления, ИмяПоля, Представление,
							ПравоеЗначение, ВидСравнения, Использование);
	
	Если ЧислоИзмененных = 0 Тогда
		Если ВидСравнения = Неопределено Тогда
			ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
		ДобавитьЭлементКомпоновки(ОбластьПоискаДобавления, ИмяПоля, ВидСравнения,
								ПравоеЗначение, Представление, Использование);
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает значение Значение параметра ИмяПараметра динамического списка Список 
// или отключает его использование в зависимости от признака Использование.
//
Процедура УстановитьПараметрДинамическогоСписка(Список, ИмяПараметра, Значение, Использование = Истина) Экспорт
	
	Если Использование Тогда
		Список.Параметры.УстановитьЗначениеПараметра(ИмяПараметра, Значение);
	Иначе
		ЗначениеПараметра = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		Если ЗначениеПараметра <> Неопределено Тогда
			ЗначениеПараметра.Значение = Значение;
			ЗначениеПараметра.Использование = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

// Получает значение реквизита формы
// Параметры:
//		Форма
//		ПутьРеквизита - строка, путь к данным, например: "Объект.МесяцНачисления"
Функция ПолучитьРеквизитФормыПоПути(Форма, ПутьРеквизита) Экспорт
	
	МассивИмен = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПутьРеквизита, ".");
	
	Объект        = Форма;
	ПоследнееПоле = МассивИмен[МассивИмен.Количество()-1];
	
	Для Сч = 0 по МассивИмен.Количество()-2 Цикл
		Объект = Объект[МассивИмен[Сч]]
	КонецЦикла;
	
	Возврат Объект[ПоследнееПоле];
	
КонецФункции

// Устанавливает значение реквизиту формы
// Параметры:
//		Форма
//		ПутьРеквизита - строка, путь к данным, например: "Объект.МесяцНачисления"
//		Значение
Процедура УстановитьРеквизитФормыПоПути(Форма, ПутьРеквизита, Значение, ТолькоЕслиНеЗаполнен = Ложь) Экспорт
	
	МассивИмен = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПутьРеквизита, ".");
	
	Объект        = Форма;
	ПоследнееПоле = МассивИмен[МассивИмен.Количество()-1];
	
	Для Сч = 0 по МассивИмен.Количество()-2 Цикл
		Объект = Объект[МассивИмен[Сч]]
	КонецЦикла;
	Если НЕ ТолькоЕслиНеЗаполнен ИЛИ НЕ ЗначениеЗаполнено(Объект[ПоследнееПоле]) Тогда
		Объект[ПоследнееПоле] = Значение;
	КонецЕсли;
	
КонецПроцедуры

// Выполняет поиск элемента отбора в коллекции по заданному представлению
//
// Параметры:
//  КоллекцияЭлементов - контейнер с элементами и группами отбора, например
//                      Список.Отбор или группа в отборе
//  Представление строка - представление группы
// 
Функция НайтиЭлементОтбораПоПредставлению(КоллекцияЭлементов, Представление) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		Если ЭлементОтбора.Представление = Представление Тогда
			ВозвращаемоеЗначение = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение
	
КонецФункции

// Служебные и вспомогательные функции

// Функция для изменения отбора, используется для поддержки ранее созданных функций изменения отбора.
// Для изменения отбора рекомендуется воспользоваться функцией ИзменитьЭлементыОтбора.
//
Процедура ИзменитьОтбор(Список, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь, ВидСравнения = Неопределено) Экспорт
	
	ВидСравнения = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	
	УдалитьЭлементыГруппыОтбора(Список.Отбор, ИмяПоля);
	
	Если Установить Тогда
		ДобавитьЭлементКомпоновки(
					Список.Отбор,
					ИмяПоля,
					ВидСравнения,
					ПравоеЗначение,
					ИмяПоля,
					Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура НайтиРекурсивно(КоллекцияЭлементов, МассивЭлементов, СпособПоиска, ЗначениеПоиска)
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			Если СпособПоиска = 1 Тогда
				Если ЭлементОтбора.ЛевоеЗначение = ЗначениеПоиска Тогда
					МассивЭлементов.Добавить(ЭлементОтбора);
				КонецЕсли;
			ИначеЕсли СпособПоиска = 2 Тогда
				Если ЭлементОтбора.Представление = ЗначениеПоиска Тогда
					МассивЭлементов.Добавить(ЭлементОтбора);
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			НайтиРекурсивно(ЭлементОтбора.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
			
			Если СпособПоиска = 2 И ЭлементОтбора.Представление = ЗначениеПоиска Тогда
				МассивЭлементов.Добавить(ЭлементОтбора);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ И ПРОЦЕДУРЫ ПЕРЕВОДА НА АНГЛИЙСКИЙ ЯЗЫК

// Перевод строки в транслит
//
Функция Транслит(Знач РусскийТекст) Экспорт
	
	АнглийскийТекст = РусскийТекст;
	
	Если Лев(АнглийскийТекст, 3) = "г. " ИЛИ Лев(АнглийскийТекст, 3) = "Г. " Тогда
		АнглийскийТекст = Сред(АнглийскийТекст, 4);
	КонецЕсли;
	
	Если Лев(АнглийскийТекст, 2) = "г." ИЛИ Лев(АнглийскийТекст, 2) = "Г." Тогда
		АнглийскийТекст = Сред(АнглийскийТекст, 3);
	КонецЕсли;
	
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "ООО", "LLC");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Общество с ограниченной ответственностью", "Limited liability company");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "ОАО", "JSC");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Открытое акционерное общество", "Joint-stock company");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "ПАО", "PJSC");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Публичное акционерное общество", "Public Joint-Stock Company");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "АО", "JSC");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Акционерное общество", "Joint-stock company");
	
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Белоруссия", "Belarus");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Москва", "Moscow");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Россия", "Russia");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Украина", "Ukraine");
	
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, " г.", " ");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, " пос.", " ");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, " ул.", " ");
	
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "А", "A");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "а", "a");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Б", "B");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "б", "b");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "В", "V");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "в", "v");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Г", "G");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "г", "g");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Д", "D");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "д", "d");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Е", "E");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "е", "e");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Ё", "E");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "ё", "e");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Ж", "Zh");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "ж", "zh");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "З", "Z");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "з", "z");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "И", "I");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "и", "i");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Й", "I");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "й", "i");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "К", "K");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "к", "k");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Л", "L");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "л", "l");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "М", "M");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "м", "m");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Н", "N");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "н", "n");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "О", "O");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "о", "o");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "П", "P");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "п", "p");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Р", "R");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "р", "r");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "С", "S");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "с", "s");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Т", "T");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "т", "t");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "У", "U");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "у", "u");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Ф", "F");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "ф", "f");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Х", "Kh");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "х", "kh");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Ц", "Ts");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "ц", "ts");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Ч", "Ch");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "ч", "ch");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Ш", "Sh");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "ш", "sh");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Щ", "Shch");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "щ", "shch");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Ъ", "Ie");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "ъ", "ie");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Ы", "Y");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "ы", "y");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Ь", "");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "ь", "");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Э", "E");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "э", "e");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Ю", "Iu");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "ю", "iu");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "Я", "Ia");
	АнглийскийТекст = СтрЗаменить(АнглийскийТекст, "я", "ia");
	
	Возврат АнглийскийТекст;
	
КонецФункции // Транслит()

// Перевести на английский язык
Процедура Перевод(Область, НаименованиеПараметра, Знач ОтчетНаАнглийскомЯзыке = Ложь) Экспорт
	
	Если НЕ ОтчетНаАнглийскомЯзыке Тогда
		Возврат;
	КонецЕсли;
	
	АнглийскаяСтрока = СокрЛП(Область.Параметры[НаименованиеПараметра]);
	
	АнглийскаяСтрока = СтрЗаменить(АнглийскаяСтрока, "Внебиржевой рынок", "Внебиржевой рынок / OTC market");
	АнглийскаяСтрока = СтрЗаменить(АнглийскаяСтрока, "Денежные средства", "Денежные средства / Monetary funds");
	АнглийскаяСтрока = СтрЗаменить(АнглийскаяСтрока, "Опцион", "Опцион / Option");
	АнглийскаяСтрока = СтрЗаменить(АнглийскаяСтрока, "Покупка", "Покупка / Purchase");
	АнглийскаяСтрока = СтрЗаменить(АнглийскаяСтрока, "Продажа", "Продажа / Sale");
	АнглийскаяСтрока = СтрЗаменить(АнглийскаяСтрока, "РЕПО 1ч.", "РЕПО 1ч. / 1st leg of repo");
	АнглийскаяСтрока = СтрЗаменить(АнглийскаяСтрока, "РЕПО 2ч.", "РЕПО 2ч. / 2nd leg of repo");
	АнглийскаяСтрока = СтрЗаменить(АнглийскаяСтрока, "Руб.", "RUR");
	АнглийскаяСтрока = СтрЗаменить(АнглийскаяСтрока, "Срочный рынок", "Срочный рынок / Forward market");
	АнглийскаяСтрока = СтрЗаменить(АнглийскаяСтрока, "ФБ ММВБ", "ФБ ММВБ / MICEX");
	АнглийскаяСтрока = СтрЗаменить(АнглийскаяСтрока, "Фьючерс", "Фьючерс / Futures");
	
	Область.Параметры[НаименованиеПараметра] = АнглийскаяСтрока;
	
КонецПроцедуры // Перевод()

#Если Не ТонкийКлиент Тогда
	
// Тип ЦБ по-английски
Функция ПредставлениеТипаЦБ(ЦБ, Знач ОтчетНаАнглийскомЯзыке) Экспорт
	SecurityType = "";
	Если ОтчетНаАнглийскомЯзыке Тогда
		Если ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Акция Тогда
			Если ЦБ.ВидЦБ = Перечисления.ВидыАкций.Обыкновенная Тогда
				SecurityType = "Common share";
			ИначеЕсли ЦБ.ВидЦБ = Перечисления.ВидыАкций.Привилегированная Тогда
				SecurityType = "Privileged share";
			Иначе
				SecurityType = "Share";
			КонецЕсли;
		ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Вексель Тогда
			SecurityType = "Bill";
		ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.ДепозитарнаяРасписка Тогда
			SecurityType = "Depositary receipt";
		ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Облигация Тогда
			SecurityType = "Bond";
		ИначеЕсли ЦБ.ТипЦБ = Перечисления.ТипыЦБ.Пай Тогда
			SecurityType = "Unit"; // ?
		КонецЕсли;
	Иначе
		SecurityType = Строка(ЦБ.ТипЦБ);
	КонецЕсли;
	Возврат SecurityType;
КонецФункции // ПредставлениеТипаЦБ()

// Возвращает краткое представление типа ценной бумаги.
//
// Параметры:
//	ЦеннаяБумага - СправочникСсылка.ЦенныеБумаги
//	Язык - строка - двухсимвольное обозначение языка
//
// Возвращаемое значение:
//	строка
Функция ПредставлениеТипаЦБКраткое(ЦеннаяБумага, Знач Язык) Экспорт
	Язык = Врег(Язык);
	Если ЦеннаяБумага.ТипЦБ = Перечисления.ТипыЦБ.Акция Тогда
		Если ЦеннаяБумага.ВидЦБ = Перечисления.ВидыАкций.Обыкновенная Тогда
			Если Язык = "RU" Тогда
				Представление = "АО";
			ИначеЕсли Язык = "EN" Тогда
				Представление = "cs";	// common share
			КонецЕсли;
			
		ИначеЕсли ЦеннаяБумага.ВидЦБ = Перечисления.ВидыАкций.Привилегированная Тогда
			Если Язык = "RU" Тогда
				Представление = "АП";
			ИначеЕсли Язык = "EN" Тогда
				Представление = "ps";	// preferred share
			КонецЕсли;
			
		Иначе
			Если Язык = "RU" Тогда
				Представление = "А";
			ИначеЕсли Язык = "EN" Тогда
				Представление = "share";
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ЦеннаяБумага.ТипЦБ = Перечисления.ТипыЦБ.Облигация Тогда
		Если Язык = "RU" Тогда
			Представление = "обл";
		ИначеЕсли Язык = "EN" Тогда
			Представление = "bond";
		КонецЕсли;
		
	Иначе
		Представление = "";
	КонецЕсли;
	
	Возврат Представление;
КонецФункции

// Представление ЦБ - полное описание для отчета
Функция ПредставлениеЦБ(ЦеннаяБумага, Знач ДобавитьАнглийскоеНаименование) Экспорт
	ПредставлениеЦБ = "";
	КраткоеПредставлениеТипа = ПредставлениеТипаЦБКраткое(ЦеннаяБумага, "RU");
	ПредставлениеЦБ = Справочники.ЦенныеБумаги.РусскоеНаименование(ЦеннаяБумага)
		+ ?(ЗначениеЗаполнено(КраткоеПредставлениеТипа), " " + КраткоеПредставлениеТипа, "");
	
	Если ДобавитьАнглийскоеНаименование И НЕ ПустаяСтрока(ЦеннаяБумага.АнглийскоеНаименование) Тогда
		КраткоеПредставлениеТипа = ПредставлениеТипаЦБКраткое(ЦеннаяБумага, "EN");
		АнглийскоеНаименование = СокрЛП(ЦеннаяБумага.АнглийскоеНаименование)
			+ ?(ЗначениеЗаполнено(КраткоеПредставлениеТипа), " " + КраткоеПредставлениеТипа, "");
		ПредставлениеЦБ = ПредставлениеЦБ + " / " + АнглийскоеНаименование;
	КонецЕсли;
	Возврат ПредставлениеЦБ;	
КонецФункции

Функция НаименованиеКлиента(Клиент, Знач ОтчетНаАнглийскомЯзыке) Экспорт
	
	// У юр.лиц смотрим полное наименование
	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") И Клиент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо 
		И ЗначениеЗаполнено(Клиент.НаименованиеПолное) Тогда
		Результат = СокрЛП(Клиент.НаименованиеПолное);
	Иначе
		Результат = СокрЛП(Клиент.Наименование);
	КонецЕсли;
	
	Если ОтчетНаАнглийскомЯзыке Тогда
		Если ЗначениеЗаполнено(Клиент.АнглийскоеНаименование) Тогда
			EnglishName = СокрЛП(Клиент.АнглийскоеНаименование);
			Результат = Результат + " / " + EnglishName;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // НаименованиеКлиента()

// Функция возвращает строку описывающую залогодержателя, включающую его наименование и ОГРН на русском 
// или английском языках.
// Параметры:
//	Залогодержатель - СправочникСсылка.Контрагенты
//	НаАнглийскомЯзыке - Булево
// Возвращаемое значение:
//	Строка
Функция ПредставлениеЗалогодержателя(Залогодержатель, НаАнглийскомЯзыке = Ложь) Экспорт
	ЗалогодержательЮрЛицо = (Залогодержатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо);
	
	Если НаАнглийскомЯзыке Тогда
		НаименованиеЗалогодержателя = Залогодержатель.АнглийскоеНаименование;
	ИначеЕсли ЗалогодержательЮрЛицо И ЗначениеЗаполнено(Залогодержатель.НаименованиеПолное) Тогда
		НаименованиеЗалогодержателя = Залогодержатель.НаименованиеПолное;
	Иначе
		НаименованиеЗалогодержателя = Залогодержатель.Наименование;
	КонецЕсли;
	
	НаименованиеКодаЗалогодержателя = "";
	КодЗалогодержателя = "";
	Если ЗалогодержательЮрЛицо И ЗначениеЗаполнено(Залогодержатель.ЮридическиеФизическиеЛица) Тогда
		ЮрЛицоЗалогодержателя = Залогодержатель.ЮридическиеФизическиеЛица;
		ЭтоРезидент = Не Залогодержатель.Резидент;	// Удивительно, но Истина в реквизите резидент означает, что это нерезидент, 
													// а Ложь, наоборот что это резидент
		ИнформацияОКоде = ОфициальныйКодЮрлицаЗалогодержателя(ЮрЛицоЗалогодержателя, ЭтоРезидент, НаАнглийскомЯзыке);
		НаименованиеКодаЗалогодержателя = ИнформацияОКоде.НаименованиеКода;
		КодЗалогодержателя = ИнформацияОКоде.Код;
	КонецЕсли;
	
	Представление = "(" + ?(НаАнглийскомЯзыке, "Pledgee", "Залогодержатель") + " - ";
	Представление = Представление + СокрЛП(НаименованиеЗалогодержателя);
	Если НаименованиеКодаЗалогодержателя <> "" Тогда
		Представление = Представление + ", " + НаименованиеКодаЗалогодержателя + " " + КодЗалогодержателя;
	КонецЕсли;
	Представление = Представление + ")";
	
	Возврат Представление;
КонецФункции

Функция ОфициальныйКодЮрлицаЗалогодержателя(ЮрЛицоЗалогодержателя, ЭтоРезидент, НаАнглийскомЯзыке = Ложь)
	ОфициальныйКод = Новый Структура("НаименованиеКода, Код");
	ЮрЛицо = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЮрЛицоЗалогодержателя, "ИНН,ОГРН,РегНомер,TIN,МеждународнаяОрганизация");
	Если ЮрЛицо.МеждународнаяОрганизация Тогда
		ОфициальныйКод.Код = ЮрЛицо.ИНН;
		ОфициальныйКод.НаименованиеКода = ?(НаАнглийскомЯзыке, "INN", "ИНН");
	ИначеЕсли ЭтоРезидент Тогда
		ОфициальныйКод.Код = ЮрЛицо.ОГРН;
		ОфициальныйКод.НаименованиеКода = ?(НаАнглийскомЯзыке, "OGRN", "ОГРН");
	ИначеЕсли Не ПустаяСтрока(ЮрЛицо.РегНомер) Тогда
		ОфициальныйКод.Код = ЮрЛицо.РегНомер;
		ОфициальныйКод.НаименованиеКода = ?(НаАнглийскомЯзыке, "Reg number", "рег номер");  // BSLLS:Typo-off
	ИначеЕсли Не ПустаяСтрока(ЮрЛицо.TIN) Тогда
		ОфициальныйКод.Код = ЮрЛицо.TIN;
		ОфициальныйКод.НаименованиеКода = "TIN";
	ИначеЕсли Не ПустаяСтрока(ЮрЛицо.ИНН) Тогда
		ОфициальныйКод.Код = ЮрЛицо.ИНН;
		ОфициальныйКод.НаименованиеКода = "TIN";  // Нет, TIN - не ошибка. Тут нужен заголовок именно TIN, а не INN
	Иначе
		ОфициальныйКод.НаименованиеКода = "";
		ОфициальныйКод.Код = "";
	КонецЕсли;
	
	Возврат ОфициальныйКод;
КонецФункции

// Функция возвращает строку описывающую раздел счета депо на русском и при необходимости, дополнительно
// на английском языке.
// Параметры:
//	РазделСчетаДепо - СправочникСсылка.РазделыСчетовДепо
//	ОтчетНаАнглийскомЯзыке - Булево
//	БезНомера - Булево - в описание не включается сам номер раздела сета депо из реквизита Наименование.
// Возвращаемое значение:
//	Строка
Функция ПредставлениеРазделаСчетаДепо(РазделСчетаДепо, ОтчетНаАнглийскомЯзыке = Ложь, БезНомера = Ложь) Экспорт
	Если Не ЗначениеЗаполнено(РазделСчетаДепо) Тогда
		Возврат "";
	КонецЕсли;
	
	ТипРазделаСчетаДЕПО = РазделСчетаДепо.ТипРазделаСчетаДЕПО;
	НомерСчетаДепо = СокрЛП(Строка(РазделСчетаДепо));
	
	Представление = НомерСчетаДепо + "/" + ПредставлениеТипаРазделаСчетаДепо(ТипРазделаСчетаДЕПО);
	Если Не БезНомера Тогда
		Представление = НомерСчетаДепо + "/";
	Иначе
		Представление = "";
	КонецЕсли;
	Представление = Представление + ПредставлениеТипаРазделаСчетаДепо(ТипРазделаСчетаДЕПО);
	
	Если ТипРазделаСчетаДЕПО = Перечисления.ТипыРазделовСчетовДЕПО.БлокированоВЗалоге Тогда
		НаАнглийскомЯзыке = Ложь;
		Представление = Представление + ПредставлениеЗалогодержателя(РазделСчетаДепо.Залогодержатель, НаАнглийскомЯзыке);
	КонецЕсли;
	
	Если ОтчетНаАнглийскомЯзыке Тогда
		НаАнглийскомЯзыке = Истина;
		ПредставлениеТипаРазделаСчетаДепоАнгл = ПредставлениеТипаРазделаСчетаДепо(ТипРазделаСчетаДЕПО, НаАнглийскомЯзыке);
		
		ПредставлениеАнгл = "";
		Если Не БезНомера И ЗначениеЗаполнено(ПредставлениеТипаРазделаСчетаДепоАнгл) Тогда
			ПредставлениеАнгл = НомерСчетаДепо + "/";
		КонецЕсли;
		Если ЗначениеЗаполнено(ПредставлениеТипаРазделаСчетаДепоАнгл) Тогда
			ПредставлениеАнгл = ПредставлениеАнгл + ПредставлениеТипаРазделаСчетаДепоАнгл;
		КонецЕсли;
		Если ТипРазделаСчетаДЕПО = Перечисления.ТипыРазделовСчетовДЕПО.БлокированоВЗалоге Тогда
			ПредставлениеАнгл = ПредставлениеАнгл + ПредставлениеЗалогодержателя(РазделСчетаДепо.Залогодержатель, НаАнглийскомЯзыке);
		КонецЕсли;
		Если ЗначениеЗаполнено(ПредставлениеАнгл) Тогда
			Представление = Представление + " / " + ПредставлениеАнгл;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Представление;
КонецФункции

// Функция возвращает представление типа раздела счета депо на русском или английском языке
// Параметры:
//	ТипРазделаСчетаДепо - ПеречислениеСсылка.ТипыРазделовСчетовДЕПО
//	НаАнглийскомЯзыке - Булево
// Возвращаемое значение:
//	Строка
Функция ПредставлениеТипаРазделаСчетаДепо(ТипРазделаСчетаДепо, НаАнглийскомЯзыке = Ложь) Экспорт
	Если НаАнглийскомЯзыке Тогда
		ТипаИНаименование = Новый Соответствие;
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.Основной,					"Main");
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.ОсновнойВТББанк, 			"");
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.Торговый, 					"Tradе");
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.Обеспечения, 				"Сollateral");
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.ОбеспеченияДержатель, 		"");
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоКД, 				"BlockedCA");
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоВЗалоге, 			"Pledge");
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоЗапретОпераций, 	"");
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоИное, 			"Blocked");
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоПоАресту, 		"");
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоОбособленный, 	"");
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоОбособленныйПоПредписаниямБР, "");
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоРасчеты, 			"");
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.ДляРаспределения, 			"Distribution");
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.Налоговый, 					"Tax");
		ТипаИНаименование.Вставить(Перечисления.ТипыРазделовСчетовДЕПО.НИФИ, 						"FFI, non qualified as securities");
		
		Наименование = ТипаИНаименование.Получить(ТипРазделаСчетаДепо);
		Если Наименование = Неопределено Тогда
			Наименование = Строка(ТипРазделаСчетаДепо);
			Сообщение = "Не найдено английское наименование для типа раздела счета ДЕПО """ + Наименование + """";
			СообщитьПользователю(Сообщение);
			Уровень = УровеньЖурналаРегистрации.Предупреждение;
			ЗаписьЖурналаРегистрации(Сообщение, Уровень, , , Сообщение);
		КонецЕсли;
	Иначе
		Наименование = Строка(ТипРазделаСчетаДепо);
	КонецЕсли;
	
	Возврат Наименование;
КонецФункции

// Функция возвращает представление типа раздела счета депо на русском или английском языке
// Параметры:
//	ТипРазделаСчетаДепо - ПеречислениеСсылка.ТипыРазделовСчетовДЕПО
//	ОтчетНаАнглийскомЯзыке - Булево
// Возвращаемое значение:
//	Строка
Функция ПредставлениеТипаРазделаСчетаДепоДляОтчета(ТипРазделаСчетаДепо, ОтчетНаАнглийскомЯзыке = Ложь) Экспорт
	Если Не ЗначениеЗаполнено(ТипРазделаСчетаДепо) Тогда
		Возврат "";
	КонецЕсли;
	
	Представление = ПредставлениеТипаРазделаСчетаДепо(ТипРазделаСчетаДепо);
	
	Если ОтчетНаАнглийскомЯзыке Тогда
		НаАнглийскомЯзыке = Истина;
		ПредставлениеАнгл = ПредставлениеТипаРазделаСчетаДепо(ТипРазделаСчетаДепо, НаАнглийскомЯзыке);
		Если ЗначениеЗаполнено(ПредставлениеАнгл) Тогда
			Представление = Представление + "/" + ПредставлениеАнгл;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Представление;
КонецФункции

// Функция возвращает представление документа основания
// Параметры:
//	ДокументОснование - ДокументСсылка.ТипыРазделовСчетовДЕПО
//	ОтчетНаАнглийскомЯзыке - Булево
// Возвращаемое значение:
//	Строка
Функция ДокументОснованиеСтрокой(ДокументОснование, ОтчетНаАнглийскомЯзыке) Экспорт
	
	ДокументОснованиеСтрокой = СокрЛП(ДокументОснование.Метаданные().Синоним);
	Если ОтчетНаАнглийскомЯзыке Тогда
		ДокументОснованиеСтрокой = ДокументОснованиеСтрокой
			+ "["
			+ ПредставлениеДокумента(ДокументОснование, Истина)
			+ "]";
	КонецЕсли;
	ДокументОснованиеСтрокой = ДокументОснованиеСтрокой + " № "
		+ СокрЛП(ДокументОснование.Номер)
		+ ?(ОтчетНаАнглийскомЯзыке, " от[dated] ", " от ")
		+ Формат(ДокументОснование.Дата, "ДФ=dd.MM.yy");
	
	Возврат ДокументОснованиеСтрокой;
	
КонецФункции

// Функция возвращает представление типа (вида) операции строкой
// Параметры:
//	ТипОперации - СправочникСсылка.ВидыОпераций
//	ОтчетНаАнглийскомЯзыке - Булево
//	ВидСчетаДепо - ПеречислениеСсылка.ВидыСчетовДепо
// Возвращаемое значение:
//	Строка
Функция ТипОперацииСтрокой(ТипОперации, ОтчетНаАнглийскомЯзыке, ВидСчетаДепо) Экспорт
	
	Если ТипОперации = Справочники.ВидыОпераций.Депонирование Тогда
		ТипОперацииСтрокой = "Зачисление";
	ИначеЕсли ТипОперации = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
		ТипОперацииСтрокой = "Списание";
	Иначе
		Если ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ И ЗначениеЗаполнено(ТипОперации.НаименованиеОперацииИФИ) Тогда
			ТипОперацииСтрокой = СокрЛП(ТипОперации.НаименованиеОперацииИФИ);
		Иначе
			ТипОперацииСтрокой = СокрЛП(ТипОперации.Наименование);
		КонецЕсли;
	КонецЕсли;
	
	Если ОтчетНаАнглийскомЯзыке Тогда
		Если ЗначениеЗаполнено(ТипОперации.АнглийскоеНаименование) Тогда
			ТипОперацииСтрокой = ТипОперацииСтрокой + " / " + СокрЛП(ТипОперации.АнглийскоеНаименование);
		Иначе
			Сообщение = "В справочнике видов операций не указано английское наименование для операции """ + Строка(ТипОперации) + """";
			СообщитьПользователю(Сообщение);
			Уровень = УровеньЖурналаРегистрации.Предупреждение;
			ЗаписьЖурналаРегистрации("Не найдено английское наименование вида операции", Уровень, , , Сообщение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТипОперацииСтрокой;
КонецФункции

Функция ПредставлениеДокумента(ДокументСсылка, Знач ОтчетНаАнглийскомЯзыке) Экспорт
	
	DocumentName = "";
	Если ОтчетНаАнглийскомЯзыке Тогда
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВводДивидендов") Тогда
			DocumentName = "Input of dividends";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗакрытиеСчетаДепо") Тогда
			DocumentName = "Custody account closing";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.иц_СводноеПоручение") Тогда
			DocumentName = "Consolidated instruction";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КонвертацияЦБ") Тогда
			DocumentName = "Security conversion";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаРеквизитовСчетаДепо") Тогда
			DocumentName = "Correction of requisites of the custody account";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.НазначениеПредставителяСчетаДепо") Тогда
			DocumentName = "Appointment of the representative of the custody account";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОперацииЦБ") Тогда
			DocumentName = "Operation on securities";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОткрытиеРазделаСчетаДепо") Тогда
			DocumentName = "Opening of the section of the custody account";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОткрытиеСчетаДепо") Тогда
			DocumentName = "Custody account opening";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтменаПоручения") Тогда
			DocumentName = "Order cancellation";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтменаПредставителяСчетаДепо") Тогда
			DocumentName = "Cancellation of the representative of the custody account";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПогашениеНКД") Тогда
			DocumentName = "Coupon payment";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПогашениеЦБ") Тогда
			DocumentName = "Repayment of the bond";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Поручение") Тогда
			DocumentName = "Instruction";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ФормированиеРеестраВладельцев") Тогда
			DocumentName = "Filling of the register of owners";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЦБВПути") Тогда
			DocumentName = "Security transfer";
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ГлобальнаяОперация") Тогда
			Если ДокументСсылка.ВидГлобальнойОперации = Справочники.ВидыОпераций.НачислениеДивидендов Тогда
				DocumentName = "Input of dividends";
			ИначеЕсли ДокументСсылка.ВидГлобальнойОперации = Справочники.ВидыОпераций.ПогашениеНКД Тогда
				DocumentName = "Coupon payment";
			ИначеЕсли ДокументСсылка.ВидГлобальнойОперации = Справочники.ВидыОпераций.Погашение
					ИЛИ ДокументСсылка.ВидГлобальнойОперации = Справочники.ВидыОпераций.СписаниеАкцийПриЛиквидацииЭмитента
					ИЛИ ДокументСсылка.ВидГлобальнойОперации = Справочники.ВидыОпераций.СписаниеОбесценившихсяЦенныхБумаг
				Тогда
				DocumentName = "Repayment of the bond";
			ИначеЕсли ДокументСсылка.ВидГлобальнойОперации = Справочники.ВидыОпераций.ПогашениеЦБПолное Тогда
				DocumentName = "Full repayment of the bond";
			ИначеЕсли ДокументСсылка.ВидГлобальнойОперации = Справочники.ВидыОпераций.ПогашениеЦБЧастичное Тогда
			    DocumentName = "Partial repayment of the bond";
			КонецЕсли;
		КонецЕсли;
	Иначе
		DocumentName = ДокументСсылка.Метаданные().Синоним;
	КонецЕсли;
	
	Возврат DocumentName;
	
КонецФункции // ПредставлениеДокумента()

// Возвращает Истина, если клиентское приложение запущено под управлением ОС Linux.
//
// Возвращаемое значение:
//  Булево. Если нет клиентского приложения, возвращается Ложь.
//
Функция ЭтоLinuxКлиент() Экспорт
	
#Если Клиент Или ВнешнееСоединение Тогда
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	ЭтоLinuxКлиент = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86
	             ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
#Иначе
	УстановитьПривилегированныйРежим(Истина);
	
	//ЭтоLinuxКлиент = СтандартныеПодсистемыСервер.ПараметрыКлиентаНаСервере().Получить("ЭтоLinuxКлиент");
	ЭтоLinuxКлиент = Неопределено;
	
	Если ЭтоLinuxКлиент = Неопределено Тогда
		Возврат Ложь; // Нет клиентского приложения.
	КонецЕсли;
#КонецЕсли
	
	Возврат ЭтоLinuxКлиент;
	
КонецФункции

// Возвращает код основного языка конфигурации, например "ru".
Функция КодОсновногоЯзыка() Экспорт
	#Если Клиент Тогда
		Попытка
			Возврат СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().КодОсновногоЯзыка;
		Исключение
			Возврат Метаданные.ОсновнойЯзык.КодЯзыка;
		КонецПопытки;
	#Иначе
		Возврат Метаданные.ОсновнойЯзык.КодЯзыка;
	#КонецЕсли
КонецФункции

// Возвращает полное наименование для клиента-юр.лица и Ф.И.О. из регистра сведений на ДатаСреза для физ.лица
Функция НаименованиеЮрФизЛицаКлиента(Клиент, ДатаСреза, ОтчетНаАнглийскомЯзыке) Экспорт
	Если ТипЗнч(Клиент) <> Тип("СправочникСсылка.Контрагенты")
		И ТипЗнч(Клиент) <> Тип("СправочникСсылка.Организации") Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(Клиент.ЮридическиеФизическиеЛица) Тогда
		Если Клиент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо И ЗначениеЗаполнено(Клиент.ЮридическиеФизическиеЛица.ПолноеНаименование) Тогда
			Результат = СокрЛП(Клиент.ЮридическиеФизическиеЛица.ПолноеНаименование);
		ИначеЕсли Клиент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			Отбор = Новый Структура("ФизЛицо", Клиент.ЮридическиеФизическиеЛица);
			ФИОСрез = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(ДатаСреза, Отбор);
			Результат = СокрЛП(ФИОСрез.Фамилия) + " " + СокрЛП(ФИОСрез.Имя) + ?(ЗначениеЗаполнено(ФИОСрез.Отчество), " " + ФИОСрез.Отчество, "");
		Иначе
			Результат = СокрЛП(Клиент.Наименование);
		КонецЕсли;
	Иначе
		Результат = СокрЛП(Клиент.Наименование);
	КонецЕсли;
	
	Если ОтчетНаАнглийскомЯзыке И ЗначениеЗаполнено(Клиент.АнглийскоеНаименование) Тогда
		Результат = Результат + " / " + СокрЛП(Клиент.АнглийскоеНаименование);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Возвращает для клиента-юр.лица его ОГРН, для физ.лица - данные документа, удостоверяющего личность, на ДатаСреза
Функция ДокументКлиента(Клиент, ДатаСреза) Экспорт
	Результат = "";
	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(Клиент.ЮридическиеФизическиеЛица) Тогда
		Если Клиент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			Если Клиент.ЮридическиеФизическиеЛица.Страна = Справочники.КлассификаторСтранМира.РОССИЯ Тогда
				Результат = "ОГРН ";
			Иначе
				Результат = "";
			КонецЕсли;
			Результат = Результат + Клиент.ЮридическиеФизическиеЛица.ОГРН;
		Иначе
			Отбор = Новый Структура("ФизЛицо", Клиент.ЮридическиеФизическиеЛица);
			Паспорт = РегистрыСведений.ПаспортныеДанныеФизЛиц.ПолучитьПоследнее(ДатаСреза, Отбор);
			Если ЗначениеЗаполнено(Паспорт.ДокументВид) Тогда
				Результат = Справочники.ФизическиеЛица.ДокументУдостоверяющийЛичность(Паспорт);
			Иначе
				Результат = "";
				Сообщение = Новый СообщениеПользователю();
			    Сообщение.Текст = "Для физ.лица "+Клиент.ЮридическиеФизическиеЛица+" на дату "+ДатаСреза
					+" не указан вид документа.";
			    Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Клиент) = Тип("СправочникСсылка.Организации") Тогда
		Если Клиент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			Если Клиент.ИностраннаяОрганизация Тогда
				Результат = "";
			Иначе
				Результат = "ОГРН ";
			КонецЕсли;
			Результат = Результат + Клиент.ОГРН;
		ИначеЕсли ЗначениеЗаполнено(Клиент.ИндивидуальныйПредприниматель) Тогда
			Отбор = Новый Структура("ФизЛицо", Клиент.ИндивидуальныйПредприниматель);
			Паспорт = РегистрыСведений.ПаспортныеДанныеФизЛиц.ПолучитьПоследнее(ДатаСреза, Отбор);
			Если ЗначениеЗаполнено(Паспорт.ДокументВид) Тогда
				Результат = Справочники.ФизическиеЛица.ДокументУдостоверяющийЛичность(Паспорт);
			Иначе
				Результат = "";
				Сообщение = Новый СообщениеПользователю();
			    Сообщение.Текст = "Для физ.лица "+Клиент.ИндивидуальныйПредприниматель+" на дату "+ДатаСреза
					+" не указан вид документа.";
			    Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецЕсли

Функция НаименованиеОрганизации(Организация, Знач ОтчетНаАнглийскомЯзыке) Экспорт
	
	// Смотрим полное наименование
	Результат = СокрЛП(Организация.НаименованиеПолное);
	
	Если ОтчетНаАнглийскомЯзыке Тогда
		Если ЗначениеЗаполнено(Организация.АнглийскоеНаименование) Тогда
			EnglishName = СокрЛП(Организация.АнглийскоеНаименование);
			Результат = Результат + " / " + EnglishName;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // НаименованиеОрганизации()

// Добавляет / заменяет существующий элемент отбора динамического списка.
//   Работает для платформы версии 8.3.
//
// Параметры:
//   ДинамическийСписок (ДинамическийСписок) Реквизит формы, для которого требуется установить отбор.
//   Остальные параметры - см. УстановитьЭлементОтбора()
//
Процедура УстановитьЭлементОтбораДинамическогоСписка(ДинамическийСписок, ИмяПоля,
	ПравоеЗначение = Неопределено,
	ВидСравнения = Неопределено,
	Представление = Неопределено,
	Использование = Неопределено,
	РежимОтображения = Неопределено,
	ИдентификаторПользовательскойНастройки = Неопределено) Экспорт
	
	Если РежимОтображения = Неопределено Тогда
		РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	ОтборДинамическогоСписка = ДинамическийСписок.Отбор;
		
	УстановитьЭлементОтбора(
		ОтборДинамическогоСписка,
		ИмяПоля,
		ПравоеЗначение,
		ВидСравнения,
		Представление,
		Использование);
	
КонецПроцедуры

// Добавляет в список ошибок новую ошибку пользователя для дальнейшей отправки
// с помощью процедуры СообщитьОшибкиПользователю().
//  Используется в процедурах ОбработкаПроверкиЗаполнения.
//
// Параметры:
//  Ошибки          - Неопределено - будет создан новый список,
//                  - значение, установленное при первом вызове этой процедуры со значением Неопределено.
//
//  ПолеОшибки      - Строка - значение, которое задается в свойстве Поле объекта СообщениеПользователю.
//                    Для автоподстаноски номера строки должна содержать "%1".
//                    Например, "Объект.ИНН" или "Объект.Пользователи[%1].Пользователь".
//
//  ТекстДляОднойОшибки - Строка - текст ошибки для случая, когда ГруппаОшибок в коллекции только одна,
//                    например, НСтр("ru = 'Пользователь не выбран.'").
//
//  ГруппаОшибок    - Произвольный - используется для выбора либо текста для одной ошибки,
//                    либо текста для нескольких ошибок, например, имя "Объект.Пользователи".
//                    Если значение не заполнено, тогда используется текст для одной ошибки.
//
//  НомерСтроки     - Число - значение от 0 ... , определяющее номер строки, который нужно подставить
//                    в строку ПолеОшибки и в ТекстДляНесколькихОшибок (подставляется НомерСтроки + 1).
//
//  ТекстДляНесколькихОшибок - Строка - текст ошибки для случая, когда добавлено несколько ошибок с одинаковым
//                    свойством ГруппаОшибок, например, НСтр("ru = 'Пользователь в строке %1 не выбран.'").
//
Процедура ДобавитьОшибкуПользователю(Ошибки, Знач ПолеОшибки, Знач ТекстДляОднойОшибки, Знач ГруппаОшибок = "", Знач НомерСтроки = 0, Знач ТекстДляНесколькихОшибок = "") Экспорт
	
	Если Ошибки = Неопределено Тогда
		Ошибки = Новый Структура;
		Ошибки.Вставить("СписокОшибок", Новый Массив);
		Ошибки.Вставить("ГруппыОшибок", Новый Соответствие);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ГруппаОшибок) Тогда
		// При незаполненной группе ошибок используется текст для одной ошибки.
	Иначе
		Если Ошибки.ГруппыОшибок[ГруппаОшибок] = Неопределено Тогда
			// Группа ошибок использовалась один раз, используется текст для одной ошибки.
			Ошибки.ГруппыОшибок.Вставить(ГруппаОшибок, Ложь);
		Иначе
			// Группа ошибок использовалась несколько раз, используется текст для нескольких ошибок.
			Ошибки.ГруппыОшибок.Вставить(ГруппаОшибок, Истина);
		КонецЕсли;
	КонецЕсли;
	
	Ошибка = Новый Структура;
	Ошибка.Вставить("ПолеОшибки",               ПолеОшибки);
	Ошибка.Вставить("ТекстДляОднойОшибки",      ТекстДляОднойОшибки);
	Ошибка.Вставить("ГруппаОшибок",             ГруппаОшибок);
	Ошибка.Вставить("НомерСтроки",              НомерСтроки);
	Ошибка.Вставить("ТекстДляНесколькихОшибок", ТекстДляНесколькихОшибок);
	
	Ошибки.СписокОшибок.Добавить(Ошибка);
	
КонецПроцедуры

// Сообщает ошибки добавленные с помощью процедуры ДобавитьОшибкуПользователю().
//
// Параметры:
//  Ошибки  - Неопределено - возврат,
//            значение, установленное при использовании процедуры ДобавитьОшибкуПользователю().
//  Отказ   - Булево, устанавливается Истина, если ошибки сообщались.
//
Процедура СообщитьОшибкиПользователю(Знач Ошибки, Отказ = Ложь) Экспорт
	
	Если Ошибки = Неопределено Тогда
		Возврат;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Для каждого Ошибка Из Ошибки.СписокОшибок Цикл
		
		Если Ошибки.ГруппыОшибок[Ошибка.ГруппаОшибок] <> Истина Тогда
			
			СообщитьПользователю(
				Ошибка.ТекстДляОднойОшибки,
				,
				СтрЗаменить(Ошибка.ПолеОшибки, "%1", Формат(Ошибка.НомерСтроки, "ЧН=0; ЧГ=")));
		Иначе
			СообщитьПользователю(
				СтрЗаменить(Ошибка.ТекстДляНесколькихОшибок, "%1", Формат(Ошибка.НомерСтроки + 1, "ЧН=0; ЧГ=")),
				,
				СтрЗаменить(Ошибка.ПолеОшибки, "%1", Формат(Ошибка.НомерСтроки, "ЧН=0; ЧГ=")));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Создает копию значения типа Соответствие.
//
// Параметры:
//  СоответствиеИсточник – Соответствие - соответствие, копию которого необходимо получить.
// 
// Возвращаемое значение:
//  Соответствие - копия исходного соответствия.
//
Функция СкопироватьСоответствие(СоответствиеИсточник) Экспорт
	
	СоответствиеРезультат = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из СоответствиеИсточник Цикл
		СоответствиеРезультат.Вставить(КлючИЗначение.Ключ, СкопироватьРекурсивно(КлючИЗначение.Значение));
	КонецЦикла;
	
	Возврат СоответствиеРезультат;

КонецФункции

// Создает копию экземпляра указанного объекта.
//
// Параметры:
//  Источник - Произвольный - объект, который необходимо скопировать.
//
// Возвращаемое значение:
//  Произвольный - копия объекта, переданного в параметре Источник.
//
// Примечание:
//  Функцию нельзя использовать для объектных типов (СправочникОбъект, ДокументОбъект и т.п.).
Функция СкопироватьРекурсивно(Источник) Экспорт
	
	Перем Приемник;
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("Структура") Тогда
		Приемник = СкопироватьСтруктуру(Источник);
	ИначеЕсли ТипИсточника = Тип("Соответствие") Тогда
		Приемник = СкопироватьСоответствие(Источник);
	ИначеЕсли ТипИсточника = Тип("Массив") Тогда
		Приемник = СкопироватьМассив(Источник);
	ИначеЕсли ТипИсточника = Тип("СписокЗначений") Тогда
		Приемник = СкопироватьСписокЗначений(Источник);
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	ИначеЕсли ТипИсточника = Тип("ТаблицаЗначений") Тогда
		Приемник = Источник.Скопировать();
#КонецЕсли
	Иначе
		Приемник = Источник;
	КонецЕсли;
	
	Возврат Приемник;
	
КонецФункции

// Создает копию значения типа Структура.
//
// Параметры:
//  СтруктураИсточник – Структура – копируемая структура.
// 
// Возвращаемое значение:
//  Структура - копия исходной структуры.
//
Функция СкопироватьСтруктуру(СтруктураИсточник) Экспорт
	
	СтруктураРезультат = Новый Структура;
	
	Для Каждого КлючИЗначение Из СтруктураИсточник Цикл
		СтруктураРезультат.Вставить(КлючИЗначение.Ключ, СкопироватьРекурсивно(КлючИЗначение.Значение));
	КонецЦикла;
	
	Возврат СтруктураРезультат;
	
КонецФункции

 // Создает копию значения типа Массив.
//
// Параметры:
//  МассивИсточник – Массив - массив, копию которого необходимо получить.
// 
// Возвращаемое значение:
//  Массив - копия исходного массива.
//
Функция СкопироватьМассив(МассивИсточник) Экспорт
	
	МассивРезультат = Новый Массив;
	
	Для Каждого Элемент Из МассивИсточник Цикл
		МассивРезультат.Добавить(СкопироватьРекурсивно(Элемент));
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

Функция СкопироватьСписокЗначений(СписокИсточник) Экспорт
	
	СписокРезультат = Новый СписокЗначений;
	
	Для Каждого ЭлементСписка Из СписокИсточник Цикл
		СписокРезультат.Добавить(
			СкопироватьРекурсивно(ЭлементСписка.Значение), 
			ЭлементСписка.Представление, 
			ЭлементСписка.Пометка, 
			ЭлементСписка.Картинка);
	КонецЦикла;
	
	Возврат СписокРезультат;
	
КонецФункции

// Удаляет недопустимые символы в XML-строке.
//
// Параметры:
//  Текст – Строка – строка, в которой требуется удалить недопустимые символы.
// 
//  Возвращаемое значение:
//  Тип: Строка. Строка, полученная при удалении недопустимых символов в XML-строке.
//
Функция УдалитьНедопустимыеСимволыXML(Знач Текст) Экспорт
	
	Возврат ЗаменитьНедопустимыеСимволыXML(Текст, "");
	
КонецФункции

// Заменяет недопустимые символы в XML-строке на заданные символы.
//
// Параметры:
//   Текст - Строка - строка, в которой требуется выполнить замену недопустимых символов.
//   СимволЗамены - Строка - строка, на которую требуется выполнить замену недопустимого символа в XML-строке.
// 
// Возвращаемое значение:
//    Строка - строка, полученная заменой недопустимых символов в XML-строке.
//
Функция ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = " ") Экспорт
	
#Если Не ВебКлиент Тогда
	ПозицияНачала = 1;
	Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
	Пока Позиция > 0 Цикл
		НедопустимыйСимвол = Сред(Текст, Позиция, 1);
		Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
		ПозицияНачала = Позиция + СтрДлина(СимволЗамены);
		Если ПозицияНачала > СтрДлина(Текст) Тогда
			Прервать;
		КонецЕсли;
		Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
	КонецЦикла;
	
	Возврат Текст;
#Иначе
	// Коды символов от 0 до 2^16-1, которые метод НайтиНедопустимыеСимволыXML
	// считает недопустимыми: 0-8, 11-12, 14-31, 55296-57343.
	Итог = "";
	ДлинаСтроки = СтрДлина(Текст);
	
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		Символ = Сред(Текст, НомерСимвола, 1);
		КодСимвола = КодСимвола(Символ);
		
		Если КодСимвола < 9
		 Или КодСимвола > 10    И КодСимвола < 13
		 Или КодСимвола > 13    И КодСимвола < 32
		 Или КодСимвола > 55295 И КодСимвола < 57344 Тогда
			
			Символ = СимволЗамены;
		КонецЕсли;
		Итог = Итог + Символ;
	КонецЦикла;
	
	Возврат Итог;
#КонецЕсли
	
КонецФункции

// Заменяет недопустимые символы в XML-строке на цифровой код символа в виде строки "{{Символ(Код)}}".
//
// Параметры:
//   Текст - Строка - строка, в которой требуется выполнить замену недопустимых символов.
// 
// Возвращаемое значение:
//    Строка - строка, полученная заменой недопустимых символов в XML-строке.
//
Функция ЗаменитьНедопустимыеСимволыXMLНаКодыСимволов(Знач Текст) Экспорт
	
	ОбработанныйТекст = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(Текст);
	ДлинаИсходнойСтроки = СтрДлина(Текст);
	ИтоговыйТекст = "";
	
	Для НомерСимвола = 1 По ДлинаИсходнойСтроки Цикл
		ОчереднойСимволИсходногоТекста = Сред(Текст, НомерСимвола, 1);
		ОчереднойСимволОбработанногоТекста = Сред(ОбработанныйТекст, НомерСимвола, 1);
		Если ОчереднойСимволИсходногоТекста = ОчереднойСимволОбработанногоТекста Тогда
			ИтоговыйТекст = ИтоговыйТекст + ОчереднойСимволОбработанногоТекста;
		Иначе
			ИтоговыйТекст = ИтоговыйТекст + "{{Символ(" + КодСимвола(ОчереднойСимволИсходногоТекста) + ")}}";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИтоговыйТекст;
	
КонецФункции

// Возвращает строку недопустимых символов.
// Согласно http://en.wikipedia.org/wiki/Filename - в разделе "Reserved characters and words".
// 
// Возвращаемое значение:
//   Строка
//
Функция ПолучитьНедопустимыеСимволыВИмениФайла() Экспорт

	НедопустимыеСимволы = """/\[]:;|=?*<>.";
	НедопустимыеСимволы = НедопустимыеСимволы + Символы.Таб + Символы.ПС;
	Возврат НедопустимыеСимволы;

КонецФункции

// Заменяет недопустимые символы в имени файла.
//
// Параметры:
//  ИмяФайла     - Строка - исходное имя файла.
//  НаЧтоМенять  - Строка - строка, на которую необходимо заменить недопустимые символы.
//
// Возвращаемое значение:
//   Строка
//
Функция ЗаменитьНедопустимыеСимволыВИмениФайла(Знач ИмяФайла, НаЧтоМенять = " ") Экспорт
	
	Возврат СокрЛП(СтрСоединить(СтрРазделить(ИмяФайла, ПолучитьНедопустимыеСимволыВИмениФайла(), Истина), НаЧтоМенять));

КонецФункции

// Заменяет недопустимые символы в строках на заданные символы.
//
// Параметры:
//  СтрокиКЗамене	 - Массив	 - строки, в которых требуется выполнить замену недопустимых символов.
//  НаЧтоМенять		 - Строка	 - строка, на которую требуется выполнить замену недопустимого символа в строке.
//
Процедура ЗаменитьНедопустимыеСимволыВИменахФайлов(СтрокиКЗамене, НаЧтоМенять = " ") Экспорт
	
	Для Индекс = 0 По СтрокиКЗамене.ВГраница() Цикл
		СтрокиКЗамене[Индекс] = ЗаменитьНедопустимыеСимволыВИмениФайла(СтрокиКЗамене[Индекс], НаЧтоМенять);
	КонецЦикла;
	
КонецПроцедуры

Функция РабочаяДата() Экспорт
	
	Возврат ТекущаяДата();
	
КонецФункции

Функция ПрочитатьТекстJSON(ТекстJSON,ИменаСвойствСоЗначениямиДата=Неопределено, Знач ОжидаемыйФорматДаты=Неопределено) Экспорт
	
	Если ОжидаемыйФорматДаты=Неопределено Тогда
		ОжидаемыйФорматДаты = ФорматДатыJSON.ISO;
	КонецЕсли;
	
	JSON = Новый ЧтениеJSON;
	JSON.УстановитьСтроку(ТекстJSON);
	Результат = ПрочитатьJSON(JSON,,ИменаСвойствСоЗначениямиДата,ОжидаемыйФорматДаты);
	JSON.Закрыть();
	
	Возврат Результат;
КонецФункции

Функция ЗаписатьВТекстJSON(Объект) Экспорт
	JSON = Новый ЗаписьJSON;
	JSON.УстановитьСтроку();
	ЗаписатьJSON(JSON,Объект);
	Результат = JSON.Закрыть();
	
	Возврат Результат;
КонецФункции

Функция ПолучитьДатуИзJSON(Знач ДатаJSON, ВернутьПустуюДатуКакНеопределено = Истина) Экспорт
	Если ВернутьПустуюДатуКакНеопределено Тогда
		ДатаРезультат = Неопределено;
	Иначе
		ДатаРезультат = Дата(1, 1, 1);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаJSON) Тогда
		ДатаJSON = ВРег(СокрЛП(ДатаJSON));
		Год = Лев(ДатаJSON, 4);
		Месяц = Сред(ДатаJSON, 6, 2);
		День = Сред(ДатаJSON, 9, 2);
		ДатаРезультат = Дата(Год + Месяц + День);
	КонецЕсли;
	Возврат ДатаРезультат;
КонецФункции

Процедура ПреобразоватьДатуИзJSON(JSON,ИмяПоляДата) Экспорт
	ДатаJSON = "";
	Если JSON.Свойство(ИмяПоляДата,ДатаJSON) Тогда
		JSON[ИмяПоляДата] = ПолучитьДатуИзJSON(ДатаJSON);
	КонецЕсли;
КонецПроцедуры

// Процедура снимает флаг использования в пользовательских отборах
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой в динамическом списке нужно отключить использование пользовательских отборов
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Загружаемые настройки, в которых нужно отключить использование пользовательских отборов
//
Процедура СнятьФлагИспользованияОтборов(Форма, Настройки) Экспорт 
	
	ИДНастройки = Форма.Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки;
	ПользовательскиеОтборы = Настройки.Элементы.Найти(ИДНастройки);
	
	СнятьФлагИспользованияОтборовРекурсивно(ПользовательскиеОтборы.Элементы);
	
КонецПроцедуры

// Обходит все элементы пользовательских отборов и снимает у них признак использования
//
// Параметры:
//  КоллекцияЭлементов - КоллекцияЭлементовОтбораКомпоновкиДанных -  Коллекция элементов отбора, у которых нужно снять признак использования
//
Процедура СнятьФлагИспользованияОтборовРекурсивно(КоллекцияЭлементов)
	
	Для Каждого ЭлементОтбора Из КоллекцияЭлементов Цикл 
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда 
			СнятьФлагИспользованияОтборовРекурсивно(ЭлементОтбора.Элементы);
		КонецЕсли;
		ЭлементОтбора.Использование = Ложь;
	КонецЦикла;
	
КонецПроцедуры

// Добавляет предопределенные отборы Динамаческого списка формы
// Параметры:
//  Форма - УправляемаяФорма - настраиваемая форма с динамическим списком
//  ОбластьДобавления - ГруппаФормы - контейнер с элементами, например Список.Отбор
//  ИмяТаблицы - Строка - Имя таблицы формы связанной с Дин.списком. 
//  ИсключаемыеОтборы - Массив - Массив имен колонок, по которым не нужно 
//  задавать предопределенные отборы
Процедура УстановитьОтборыДинамическогоСпискаПоУмолчанию(Форма, ОбластьДобавления, ИмяТаблицы, ИсключаемыеОтборы = Неопределено) Экспорт
	
	КнопкаНастройкиСписка = Форма.КоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаНастройкаСписка");
	Если КнопкаНастройкиСписка <> Неопределено Тогда
		КнопкаНастройкиСписка.ТолькоВоВсехДействиях = Ложь;
	КонецЕсли;
	
	НеограниченнаяСтрока	= Новый КвалификаторыСтроки(0);
	ТипНеограниченнаяСтрока	= Новый ОписаниеТипов("Строка",, НеограниченнаяСтрока);
	ТипДата					= Новый ОписаниеТипов("Дата");
	
	Если ИсключаемыеОтборы = Неопределено Тогда
		ИсключаемыеОтборы = Новый Массив;
		ИсключаемыеОтборы.Добавить("Ссылка");
		ИсключаемыеОтборы.Добавить("Дата");
	КонецЕсли;
	Если ОбластьДобавления.Элементы.Количество() > 0 Тогда
		Для Каждого УстановленныйОтбор Из ОбластьДобавления.Элементы Цикл
			ИсключаемыеОтборы.Добавить(УстановленныйОтбор.ЛевоеЗначение);
		КонецЦикла;
	КонецЕсли;
	
	ЭлементыОтбора = Новый Массив;
	ПолучитьЭлементыОтбораПоУмолчанию(Форма.Элементы.Найти(ИмяТаблицы), ЭлементыОтбора);
	
	Для Каждого ИмяЭлемента Из ЭлементыОтбора Цикл
		
		Если ИсключаемыеОтборы.Найти(ИмяЭлемента) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеВДоступныхПоляхОтбора = ОбластьДобавления.ДоступныеПоляОтбора.Элементы.Найти(ИмяЭлемента);
		Если ПолеВДоступныхПоляхОтбора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементОтбора				= ОбластьДобавления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование	= Ложь;
		ЭлементОтбора.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных(ИмяЭлемента);
		
		Если ТипНеограниченнаяСтрока = ПолеВДоступныхПоляхОтбора.ТипЗначения Тогда
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
		Иначе
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			Если ТипДата = ПолеВДоступныхПоляхОтбора.ТипЗначения Тогда
				ЭлементОтбора.ПравоеЗначение = Дата(1,1,1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Для таблицы формы получает имена всех подчиненных элементов с типом ПолеФормы
// Параметры:
//  ЭлементФормы - ТаблицаФормы - Таблица формы, для которой необходимо получить имена всех полей формы
//  ЭлементыОтбора - Массив, Неопределено - Массив, в который помещаются имена полей формы
Процедура ПолучитьЭлементыОтбораПоУмолчанию(ЭлементФормы, ЭлементыОтбора)
	
	Если ЭлементыОтбора = Неопределено Тогда
		ЭлементыОтбора = Новый Массив;
	КонецЕсли;
	
	Для Каждого ПодчиненныйЭлемент Из ЭлементФормы.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ПолеФормы") Тогда
			ЭлементыОтбора.Добавить(ПодчиненныйЭлемент.Имя);
		ИначеЕсли ТипЗнч(ПодчиненныйЭлемент) = Тип("ГруппаФормы") Тогда
			ПолучитьЭлементыОтбораПоУмолчанию(ПодчиненныйЭлемент, ЭлементыОтбора);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает Истина если конфигурация запущена под управлением платформы 8.3.
//
Функция ЭтоПлатформа83() Экспорт
	
	Информация = Новый СистемнаяИнформация;
	Возврат Лев(Информация.ВерсияПриложения, 3) = "8.3";
	
КонецФункции

// Собирает строку из всех заполненных элементов структуры.
//
// Параметры:
//  Параметры	 - Структура - Параметры формы, методов ADO, веб-сервисов и т.п.
//  Разделитель	 - Строка	 - Разделитель
//  Кавычки		 - Строка	 - Кавычки
// 
// Возвращаемое значение:
//  Строка - вида ИмяПараметра1=ЗначениеПараметра1, ИмяПараметра2=ЗначениеПараметра2...
Функция ПараметрыСтрокой(Параметры, Разделитель = " ", Кавычки = "'") Экспорт
	ПараметрыСтрокой = "";
	Для Каждого Параметр Из Параметры Цикл
		Если ЗначениеЗаполнено(Параметр.Значение) Тогда
			ПараметрыСтрокой = ПараметрыСтрокой + ?(ПустаяСтрока(ПараметрыСтрокой), "", Разделитель)
			+ Кавычки + Параметр.Ключ + "=" + Параметр.Значение + Кавычки;
		КонецЕсли;
	КонецЦикла;
	Возврат ПараметрыСтрокой;
КонецФункции

#Область ПроверитьПараметр

Функция ЗначениеОжидаемогоТипа(Значение, ОжидаемыеТипы)
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗнч(ОжидаемыеТипы) = Тип("ОписаниеТипов") Тогда
		Возврат ОжидаемыеТипы.Типы().Найти(ТипЗначения) <> Неопределено;
	ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Тип") Тогда
		Возврат ТипЗначения = ОжидаемыеТипы;
	ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Массив") 
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированныйМассив") Тогда
		Возврат ОжидаемыеТипы.Найти(ТипЗначения) <> Неопределено;
	ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие") 
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда
		Возврат ОжидаемыеТипы.Получить(ТипЗначения) <> Неопределено;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

Функция ПредставлениеТипов(ОжидаемыеТипы)
	
	Если ТипЗнч(ОжидаемыеТипы) = Тип("Массив")
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированныйМассив")
		Или ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие")
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда
		
		Результат = "";
		Индекс = 0;
		Для Каждого Элемент Из ОжидаемыеТипы Цикл
			
			Если ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие")
				Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда 
				
				Тип = Элемент.Ключ;
			Иначе 
				Тип = Элемент;
			КонецЕсли;
			
			Если Не ПустаяСтрока(Результат) Тогда
				Результат = Результат + ", ";
			КонецЕсли;
			
			Результат = Результат + ПредставлениеТипа(Тип);
			Индекс = Индекс + 1;
			Если Индекс > 10 Тогда
				Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1,... (всего %2 типов)'"), 
					Результат, 
					ОжидаемыеТипы.Количество());
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Результат;
		
	Иначе 
		Возврат ПредставлениеТипа(ОжидаемыеТипы);
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеТипа(Тип)
	
	Если Тип = Неопределено Тогда
		
		Возврат "Неопределено";
		
	ИначеЕсли ТипЗнч(Тип) = Тип("ОписаниеТипов") Тогда
		
		ТипСтрокой = Строка(Тип);
		Возврат 
			?(СтрДлина(ТипСтрокой) > 150, 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1,... (всего %2 типов)'"),
					Лев(ТипСтрокой, 150),
					Тип.Типы().Количество()), 
				ТипСтрокой);
		
	Иначе
		
		ТипСтрокой = Строка(Тип);
		Возврат 
			?(СтрДлина(ТипСтрокой) > 150, 
				Лев(ТипСтрокой, 150) + "...", 
				ТипСтрокой);
		
	КонецЕсли;
	
КонецФункции

// Возвращает признак того, что переданное значение является, либо не является, числом.
//
// Параметры:
//  ПроверяемоеЗначение	 - Произвольный	 - значение, которое проверяется на соответствие числу. (Допустимы типы Строка и Число)
// 
// Возвращаемое значение:
//  Булево - признак того, что переданное значение является, либо не является, числом.
//
Функция ЭтоЧисло(Знач ПроверяемоеЗначение) Экспорт
	
	Если ТипЗнч(ПроверяемоеЗначение) = Тип("Число") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПроверяемоеЗначение = "0" Тогда
		Возврат Истина;
	КонецЕсли;
	
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	
	Возврат ОписаниеЧисла.ПривестиЗначение(ПроверяемоеЗначение) <> 0;
	
КонецФункции

#КонецОбласти

#Область Данные

// Возвращает копию исходного массива с уникальными значениями.
//
// Параметры:
//  Массив - Массив - массив произвольных значений.
//
// Возвращаемое значение:
//  Массив - массив уникальных элементов.
//
Функция СвернутьМассив(Знач Массив) Экспорт
	Результат = Новый Массив;
	ДополнитьМассив(Результат, Массив, Истина);
	Возврат Результат;
КонецФункции

// Вызывает исключение с текстом Сообщение, если Условие не равно Истина.
// Применяется для самодиагностики кода.
//
// Параметры:
//   Условие - Булево - если не равно Истина, то вызывается исключение.
//   Сообщение - Строка - текст сообщения. Если не задан, то исключение вызывается с сообщением по умолчанию.
//   КонтекстПроверки - Строка - например, имя процедуры или функции, в которой выполняется проверка.
//
Процедура Проверить(Знач Условие, Знач Сообщение = "", Знач КонтекстПроверки = "") Экспорт
	
	Если Условие <> Истина Тогда
		
		Если ПустаяСтрока(Сообщение) Тогда
			ТекстИсключения = НСтр("ru = 'Недопустимая операция'"); // Assertion failed
		Иначе
			ТекстИсключения = Сообщение;
		КонецЕсли;
		
		Если Не ПустаяСтрока(КонтекстПроверки) Тогда
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 в %2'"), ТекстИсключения, КонтекстПроверки);
		КонецЕсли;
		
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывает исключение, если тип значения параметра ИмяПараметра процедуры или функции ИмяПроцедурыИлиФункции
// отличается от ожидаемого.
// Для быстрой диагностики типов параметров, передаваемых в процедуры и функции программного интерфейса.
//
// В связи с особенностью реализации ОписанияТипов всегда включает в себя тип <Неопределено>.
// если требуется жесткая проверка типа, используйте в параметре ОжидаемыеТипы 
// конкретный тип, массив или соответствие типов.
//
// Параметры:
//   ИмяПроцедурыИлиФункции - Строка - имя процедуры или функции, параметр которой проверяется.
//   ИмяПараметра - Строка - имя проверяемого параметра процедуры или функции.
//   ЗначениеПараметра - Произвольный - фактическое значение параметра.
//   ОжидаемыеТипы - ОписаниеТипов
//                 - Тип
//                 - Массив
//                 - ФиксированныйМассив
//                 - Соответствие
//                 - ФиксированноеСоответствие - тип(ы)
//       параметра процедуры или функции.
//   ОжидаемыеТипыСвойств - Структура - если ожидаемый тип - структура, то 
//       в этом параметре можно указать типы ее свойств.
//
Процедура ПроверитьПараметр(Знач ИмяПроцедурыИлиФункции, Знач ИмяПараметра, Знач ЗначениеПараметра, 
	Знач ОжидаемыеТипы, Знач ОжидаемыеТипыСвойств = Неопределено) Экспорт
	
	Контекст = "ОбщегоНазначенияКлиентСервер.ПроверитьПараметр";
	Проверить(ТипЗнч(ИмяПроцедурыИлиФункции) = Тип("Строка"), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение параметра %1.'"), "ИмяПроцедурыИлиФункции"), 
		Контекст);
	Проверить(ТипЗнч(ИмяПараметра) = Тип("Строка"), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение параметра %1.'"), "ИмяПараметра"), 
			Контекст);
	
	ЭтоКорректныйТип = ЗначениеОжидаемогоТипа(ЗначениеПараметра, ОжидаемыеТипы);
	Проверить(ЭтоКорректныйТип <> Неопределено, 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение параметра %1.'"), "ОжидаемыеТипы"),
		Контекст);
	Проверить(ЭтоКорректныйТип,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение параметра %1 в %2. 
			           |Ожидалось: %3; передано значение: %4 (тип %5).'"),
			ИмяПараметра, ИмяПроцедурыИлиФункции, ПредставлениеТипов(ОжидаемыеТипы), 
			?(ЗначениеПараметра <> Неопределено, ЗначениеПараметра, НСтр("ru = 'Неопределено'")),
		ТипЗнч(ЗначениеПараметра)));
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("Структура") И ОжидаемыеТипыСвойств <> Неопределено Тогда
		
		Проверить(ТипЗнч(ОжидаемыеТипыСвойств) = Тип("Структура"), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Недопустимое значение параметра %1.'"), "ИмяПроцедурыИлиФункции"),
			Контекст);
		
		Для каждого Свойство Из ОжидаемыеТипыСвойств Цикл
			
			ОжидаемоеИмяСвойства = Свойство.Ключ;
			ОжидаемыйТипСвойства = Свойство.Значение;
			ЗначениеСвойства = Неопределено;
			
			Проверить(ЗначениеПараметра.Свойство(ОжидаемоеИмяСвойства, ЗначениеСвойства), 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Недопустимое значение параметра %1 (Структура) в %2. 
					           |В структуре ожидалось свойство %3 (тип %4).'"), 
					ИмяПараметра, ИмяПроцедурыИлиФункции, ОжидаемоеИмяСвойства, ОжидаемыйТипСвойства));
			
			ЭтоКорректныйТип = ЗначениеОжидаемогоТипа(ЗначениеСвойства, ОжидаемыйТипСвойства);
			Проверить(ЭтоКорректныйТип, 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Недопустимое значение свойства %1 в параметре %2 (Структура) в %3. 
					           |Ожидалось: %4; передано значение: %5 (тип %6).'"), 
					ОжидаемоеИмяСвойства, ИмяПараметра,	ИмяПроцедурыИлиФункции,
					ПредставлениеТипов(ОжидаемыеТипы), 
					?(ЗначениеСвойства <> Неопределено, ЗначениеСвойства, НСтр("ru = 'Неопределено'")),
				ТипЗнч(ЗначениеСвойства)));
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Математика

////////////////////////////////////////////////////////////////////////////////
// Математические процедуры и функции.

// BSLLS:CognitiveComplexity-off
// BSLLS:EmptyCodeBlock-off

// Выполняет пропорциональное распределение суммы в соответствии
// с заданными коэффициентами распределения.
//
// Параметры:
//  РаспределяемаяСумма - Число  - сумма, которую надо распределить, если сумма равна 0 - то возвращается Неопределено;
//                                 Если передана отрицательная - расчет по модулю и после инверсия знаков результата.
//  Коэффициенты        - Массив - коэффициенты распределения, должны быть положительны или отрицательными одновременно
//  Точность            - Число  - точность округления при распределении. Необязателен.
//
// Возвращаемое значение:
//  Массив - массив размерностью равный массиву коэффициентов, содержит
//           суммы в соответствии с весом коэффициента (из массива коэффициентов).
//           В случае, если распределить невозможно (кол-во коэффициентов = 0
//           есть коэффициенты с отрицательным значением или суммарный вес коэффициентов = 0),
//           тогда будет возвращено Неопределено.
//
// Пример:
//
//	Коэффициенты = Новый Массив;
//	Коэффициенты.Добавить(1);
//	Коэффициенты.Добавить(2);
//	Результат = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(1, Коэффициенты);
//	// Результат = [0.33, 0.67]
//
Функция РаспределитьСуммуПропорциональноКоэффициентам(Знач РаспределяемаяСумма, Знач Коэффициенты, Знач Точность = 2) Экспорт
	
	КоэффициентыАбсолютные = Новый Массив(Новый ФиксированныйМассив(Коэффициенты)); // Копируем массив в памяти.
	
	// Старое поведение при неуказанной сумме - для обратной совместимости.
	Если Не ЗначениеЗаполнено(РаспределяемаяСумма) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если КоэффициентыАбсолютные.Количество() = 0 Тогда 
		// Недопустимо значение параметра Коэффициенты
		// Ожидалось: хотя бы один коэффициент будет задан.
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексМаксимальногоКоэффициента = 0;
	МаксимальныйКоэффициент = 0;
	СуммаКоэффициентов = 0;
	КоэффициентыОтрицательны = (КоэффициентыАбсолютные[0] < 0);
	
	Для Индекс = 0 По КоэффициентыАбсолютные.Количество() - 1 Цикл
		Коэффициент = КоэффициентыАбсолютные[Индекс];
		
		Если КоэффициентыОтрицательны И Коэффициент > 0 Тогда 
			// Недопустимо значение параметра Коэффициенты
			// Ожидалось: все коэффициенты положительны или все отрицательны одновременно.
			Возврат Неопределено;
		КонецЕсли;
		
		Если Коэффициент < 0 Тогда 
			// Если коэффициент меньше нуля, то его абсолютное значение отрицательное ему число.
			Коэффициент = -Коэффициент; // Abs(Коэффициент)
			КоэффициентыАбсолютные[Индекс] = Коэффициент; // Заменяем коэффициент в массиве.
		КонецЕсли;
		
		Если МаксимальныйКоэффициент < Коэффициент Тогда
			МаксимальныйКоэффициент = Коэффициент;
			ИндексМаксимальногоКоэффициента = Индекс;
		КонецЕсли;
		
		СуммаКоэффициентов = СуммаКоэффициентов + Коэффициент;
	КонецЦикла;
	
	Если СуммаКоэффициентов = 0 Тогда
		// Недопустимо значение параметра Коэффициенты
		// Ожидалось: хотя бы один коэффициент будет отличен от нуля.
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Массив(КоэффициентыАбсолютные.Количество());
	
	ВыполнятьИнверсию = (РаспределяемаяСумма < 0);
	Если ВыполнятьИнверсию Тогда 
		// Если изначально распределяемая сумма меньше нуля, надо сначала распределить абсолютное значение суммы
		// затем выполнить инверсию результата.
		РаспределяемаяСумма = -РаспределяемаяСумма; // Abs(РаспределяемаяСумма).
	КонецЕсли;
	
	РаспределеннаяСумма = 0;
	
	Для Индекс = 0 По КоэффициентыАбсолютные.Количество() - 1 Цикл
		Результат[Индекс] = Окр(РаспределяемаяСумма * КоэффициентыАбсолютные[Индекс] / СуммаКоэффициентов, Точность, 1);
		РаспределеннаяСумма = РаспределеннаяСумма + Результат[Индекс];
	КонецЦикла;
	
	СуммарнаяПогрешность = РаспределяемаяСумма - РаспределеннаяСумма;
	
	Если СуммарнаяПогрешность > 0 Тогда 
		
		// Погрешности округления отнесем на коэффициент с максимальным весом.
		Если Не РаспределеннаяСумма = РаспределяемаяСумма Тогда
			Результат[ИндексМаксимальногоКоэффициента] = Результат[ИндексМаксимальногоКоэффициента] + СуммарнаяПогрешность;
		КонецЕсли;
		
	ИначеЕсли СуммарнаяПогрешность < 0 Тогда 
		
		// Если распределили больше чем положено, размазываем погрешность по ближайшим максимальным весам.
		ЗначениеПогрешности = 1 / Pow(10, Точность);
		КоличествоЭлементовПогрешности = -СуммарнаяПогрешность / ЗначениеПогрешности;
		
		Для Сч = 1 По КоличествоЭлементовПогрешности Цикл // BSLLS:UnusedLocalVariable-off
			МаксимальныйКоэффициент = МаксимальноеЗначениеВМассиве(КоэффициентыАбсолютные);
			Индекс = КоэффициентыАбсолютные.Найти(МаксимальныйКоэффициент);
			Результат[Индекс] = Результат[Индекс] - ЗначениеПогрешности;
			КоэффициентыАбсолютные[Индекс] = 0;
		КонецЦикла;
		
	Иначе 
		// Если СуммарнаяПогрешность = 0, то все идеально.
	КонецЕсли;
	
	Если ВыполнятьИнверсию Тогда 
		Для Индекс = 0 По КоэффициентыАбсолютные.Количество() - 1 Цикл
			Результат[Индекс] = -Результат[Индекс];
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// BSLLS:CognitiveComplexity-on
// BSLLS:EmptyCodeBlock-on

Функция МаксимальноеЗначениеВМассиве(Массив)
	
	МаксимальноеЗначение = 0;
	
	Для Индекс = 0 По Массив.Количество() - 1 Цикл
		Значение = Массив[Индекс];
		
		Если МаксимальноеЗначение < Значение Тогда
			МаксимальноеЗначение = Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МаксимальноеЗначение;
	
КонецФункции

#КонецОбласти
