#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Не ЗначениеЗаполнено(Объект.ВидДанных) Тогда
			Объект.ВидДанных = Перечисления.ВидыДанныхИзDiasoft.ДоходыИРасходыОтносящиесяКДепозитарнойДеятельности;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.КонецПериода) Тогда
			Объект.КонецПериода = КонецМесяца(НачалоМесяца(ТекущаяДатаСеанса()) - 1);
			Объект.НачалоПериода = НачалоГода(Объект.КонецПериода);
		КонецЕсли;
	КонецЕсли;
	УстановитьДоступностьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЭтоНовый = ТекущийОбъект.Ссылка <> Объект.Ссылка;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоНовый Тогда
		УстановитьОтбор();
		ЭтоНовый = Ложь;
		УстановитьДоступностьЭлементов(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьОтбор();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	Объект.КонецПериода = КонецМесяца(Объект.КонецПериода);
	Объект.НачалоПериода = НачалоМесяца(Объект.КонецПериода);
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторСообщенияОткрытие(Элемент, СтандартнаяОбработка)
	КлючЗаписи = КлючЗаписиЖурналаВходящихСообщенийKafka();
	ПараметрыФормыЗаписи = Новый Структура("Ключ", КлючЗаписи);
	ОткрытьФорму("РегистрСведений.ЖурналВходящихСообщенийKafka.ФормаЗаписи", ПараметрыФормыЗаписи);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Форма)
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	Элементы.СписокДанных.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДанных, "ДокументЗагрузки", Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КлючЗаписиЖурналаВходящихСообщенийKafka()
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaMultiToDiasRequestData1655;
	ЗначенияКлюча = Новый Структура("ВнешнийИсточник, Идентификатор", ВнешнийИсточник, Объект.ИдентификаторСообщения);
	КлючЗаписи = РегистрыСведений.ЖурналВходящихСообщенийKafka.СоздатьКлючЗаписи(ЗначенияКлюча);
	
	Возврат КлючЗаписи;
КонецФункции

#КонецОбласти