&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Документ = Параметры.Ссылка;
	Комментарий = Параметры.Комментарий;
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	ДокументОбъект = Документ.ПолучитьОбъект();
	ДокументОбъект.Комментарий = Комментарий;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	ОбменДаннымиКафка.ЗаписатьОбъектВИсходящиеСообщенияКафкаПриЗаписиДокумента(ДокументОбъект);
КонецПроцедуры