#Область ОписаниеПеременных

&НаСервере
Перем мТекущийОбъектНаСервере; // Реквизит формы "Объект", преобразованный в объект прикладного типа

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ТекущийОбъект());
	Объект.ПоОстаткам = Истина;
	
	Объект.МетодикаРасчета = Перечисления.МетодикиРасчетаРыночныхЦен.Для0409404;
	ОбновитьДатуРасчета();
	ОбновитьСостоянияРасчета();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЦенныеБумагиISINОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ISIN = Элементы.ЦенныеБумаги.ТекущиеДанные.ISIN;
	Если ЗначениеЗаполнено(ISIN) Тогда
		ЦБ = ЦеннаяБумагаПоISIN(ISIN);
		ПоказатьЗначение(, ЦБ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДатаРасчетаПриИзменении(Элемент)
	
	ДатаРасчетаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура МетодикаРасчетаПриИзменении(Элемент)
	
	МетодикаРасчетаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРасчетаПриИзменении(Элемент)
	
	ПериодРасчетаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьISIN(Команда)
	
	РезультатОтбора = ОткрытьФормуМодально("Обработка.РасчетРыночныхЦенЦенныхБумаг.Форма.ФормаОтбораISIN", , ЭтотОбъект);
	
	ЗаполнитьISINНаСервере(РезультатОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	
	МожноПроизвестиРасчет = ПровереныУсловия();
	Если МожноПроизвестиРасчет Тогда
		Лог = РассчитатьНаСервере();
		Лог.Показать("Результаты расчета рыночных цен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрРС_РыночныеЦеныЦенныхБумаг(Команда)
	ОткрытьФорму("РегистрСведений.РыночныеЦеныЦенныхБумаг.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрРС_Котировки(Команда)
	ОткрытьФорму("РегистрСведений.Котировки.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрРС_НоминалЦБ(Команда)
	ОткрытьФорму("РегистрСведений.НоминалЦБ.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрРС_СостоянияРасчетаРыночныхЦенЦенныхБумаг(Команда)
	ОткрытьФорму("РегистрСведений.СостоянияРасчетаРыночныхЦенЦенныхБумаг.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрРС_ЖурналИсходящихСообщенийKafka(Команда)
	ЗначениеОтбора = Новый Структура("ТипСообщения", "Request");
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.ЖурналИсходящихСообщенийKafka.Форма.ФормаСписка", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрРС_ЖурналВходящихСообщенийKafka(Команда)
	ЗначениеОтбора = Новый Структура("ТипСообщения", "LastTradePrice");
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.ЖурналВходящихСообщенийKafka.Форма.ФормаСписка", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПровереныУсловия()
	
	Если Объект.ЦенныеБумаги.Количество() = 0 И Не Объект.ПоОстаткам Тогда
		Предупреждение("Укажите ""по остаткам"" или Isin или и то и другое!");
		МожноПроизвестиРасчет = Ложь;
	Иначе
		МожноПроизвестиРасчет = Истина;
	КонецЕсли;
	
	Возврат МожноПроизвестиРасчет;
	
КонецФункции

&НаСервере
Функция ТекущийОбъект()
	
	Если мТекущийОбъектНаСервере = Неопределено Тогда
		мТекущийОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат мТекущийОбъектНаСервере;
	
КонецФункции

&НаСервере
Процедура ДатаРасчетаПриИзмененииНаСервере()
	Объект.ПериодРасчета = Новый СтандартныйПериод(Объект.ДатаРасчета, Объект.ДатаРасчета);
	ОбновитьСостоянияРасчета();
КонецПроцедуры

&НаСервере
Процедура ПериодРасчетаПриИзмененииНаСервере()
	
	Если НачалоДня(Объект.ПериодРасчета.ДатаНачала) = НачалоДня(Объект.ПериодРасчета.ДатаОкончания) Тогда
		Объект.ДатаРасчета = Объект.ПериодРасчета.ДатаНачала;
	Иначе
		Объект.ДатаРасчета = '00010101';
	КонецЕсли;
	ОбновитьСостоянияРасчета();
	
КонецПроцедуры

&НаСервере
Процедура МетодикаРасчетаПриИзмененииНаСервере()
	ПериодТребуется = (Объект.МетодикаРасчета = Перечисления.МетодикиРасчетаРыночныхЦен.Для0409404);
	Элементы.ПериодРасчета.Видимость = ПериодТребуется;
	ОбновитьДатуРасчета();
	Элементы.СостоянияРасчетаИдентификаторЗапросаDiasoft.Видимость = Не ПериодТребуется;
	Элементы.СостоянияРасчетаПолученОтветBQ.Видимость = Не ПериодТребуется;
	Элементы.СостоянияРасчетаПолученОтветDiasoft.Видимость = Не ПериодТребуется;
	ДатаРасчетаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДатуРасчета()
	Если Объект.МетодикаРасчета = Перечисления.МетодикиРасчетаРыночныхЦен.Для0409404 Тогда
		Объект.ДатаРасчета = ОбщегоНазначения.ПредыдущийРабочийДень(ТекущаяДатаСеанса());
	Иначе
		Объект.ДатаРасчета = НачалоДня(НачалоКвартала(ТекущаяДатаСеанса()) - 1);
	КонецЕсли;
	Объект.ПериодРасчета = Новый СтандартныйПериод(Объект.ДатаРасчета, Объект.ДатаРасчета);
КонецПроцедуры

// BSLLS:LatinAndCyrillicSymbolInWord-off

&НаСервере
Процедура ЗаполнитьISINНаСервере(РезультатОтбора)
	
	Если РезультатОтбора = Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполнение ISIN отменено");
		
	Иначе
		
		КопироватьДанныеФормы(РезультатОтбора.ЦенныеБумаги, Объект.ЦенныеБумаги);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполнение ISIN произведено");
		
	КонецЕсли;
	
КонецПроцедуры

// BSLLS:LatinAndCyrillicSymbolInWord-on

&НаСервере
Процедура ОбновитьСостоянияРасчета()
	
	СостоянияРасчета.Параметры.УстановитьЗначениеПараметра("НачалоПериода", НачалоДня(Объект.ПериодРасчета.ДатаНачала));
	СостоянияРасчета.Параметры.УстановитьЗначениеПараметра("КонецПериода", КонецДня(Объект.ПериодРасчета.ДатаОкончания));
	СостоянияРасчета.Параметры.УстановитьЗначениеПараметра("МетодикаРасчета", Объект.МетодикаРасчета);
	
КонецПроцедуры

&НаСервере
Функция РассчитатьНаСервере()
	
	ОтчетРезультат = Новый ТабличныйДокумент;
	МассивISIN = ОбщегоНазначения.ВыгрузитьКолонку(Объект.ЦенныеБумаги, "ISIN", Истина, Истина);
	ISINs = СтрСоединить(МассивISIN, ",");
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("МетодикаРасчета", Объект.МетодикаРасчета);
	ПараметрыРасчета.Вставить("ДатаРасчета", Объект.ДатаРасчета);
	ПараметрыРасчета.Вставить("НачалоПериода", Объект.ПериодРасчета.ДатаНачала);
	ПараметрыРасчета.Вставить("ОкончаниеПериода", Объект.ПериодРасчета.ДатаОкончания);
	ПараметрыРасчета.Вставить("ПоОстаткам", Объект.ПоОстаткам);
	ПараметрыРасчета.Вставить("ISINs", ISINs);
	ЗапросЦеныПоследнейСделкиПоISIN = Объект.ЗапроситьЦенуПоследнейСделкиПоВыбраннымISIN И ЗначениеЗаполнено(ISINs);
	ПараметрыРасчета.Вставить("ЗапросЦеныПоследнейСделкиПоISIN", ЗапросЦеныПоследнейСделкиПоISIN);
	ПараметрыРасчета.Вставить("БезЗапросаЦеныПоследнейСделки", Объект.БезЗапросаЦеныПоследнейСделки);
	
	ТекущийОбъект().ВыполнитьРасчетРыночныхЦенЦенныхБумаг(ПараметрыРасчета, ОтчетРезультат);
	
	Возврат ОтчетРезультат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЦеннаяБумагаПоISIN(ISIN)
	Возврат Справочники.ЦенныеБумаги.ЦеннаяБумагаПоРегНомеруИISIN(ISIN, Неопределено, Ложь);
КонецФункции

#КонецОбласти
