#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрыРегламентногоЗаданияРасчетМетрик = МетрикиСервер.СтруктураПараметровРегламентногоЗадания();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбновитьСостояниеФормы", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользованиеЗаданияРасчетМетрикПриИзменении(Элемент)
	ПараметрыРегламентногоЗаданияРасчетМетрик.Использование = ИспользованиеЗаданияРасчетМетрик;
	ПодключитьОбработчикОжидания("ОбновитьСостояниеФормы", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеРасписанияРасчетаМетрикНажатие(Элемент)
	МетрикиКлиент.ОбработатьИзменениеРасписания(ПараметрыРегламентногоЗаданияРасчетМетрик, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	СохранитьНастройкиВПараметры();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПервоначальноеЗаполнение(Команда)
	ВыполнитьПервоначальноеЗаполнениеНаСервере();
	ПодключитьОбработчикОжидания("ОбновитьСостояниеФормы", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьПервоначальноеЗаполнениеНаСервере()
	МетрикиСервер.ВыполнитьПервоначальноеЗаполнение();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеФормы() Экспорт
	
	ИспользованиеЗаданияРасчетМетрик = ПараметрыРегламентногоЗаданияРасчетМетрик.Использование;
	Элементы.ОписаниеРасписанияРасчетаМетрик.Заголовок =
		МетрикиКлиент.ПолучитьПредставлениеРасписания(ПараметрыРегламентногоЗаданияРасчетМетрик);
		
	ПолучитьНастройкиИзПараметров();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройкиИзПараметров()
	УстановитьПривилегированныйРежим(Истина);
	Менеджер = РегистрыСведений.ПараметрыГлобальные;
	МногопоточныйРасчетМетрик = Менеджер.ЗначениеПараметра("1562.Prometheus_МногопоточныйРасчетМетрик", Ложь);
	ПервоначальноеЗаполнениеВыполнено = Менеджер.ЗначениеПараметра("1562.Prometheus_ПервоначальноеЗаполнениеВыполнено", Ложь);
	ПредельнаяДлительностьПолученияМетрикOnline =
		Менеджер.ЗначениеПараметра("1562.Prometheus_ПредельнаяДлительностьПолученияМетрикOnline");
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиВПараметры()
	
	МетрикиСервер.ОбновитьРегламентноеЗадание(ПараметрыРегламентногоЗаданияРасчетМетрик,
		Метаданные.РегламентныеЗадания.РасчетМетрикPrometheus);

	УстановитьПривилегированныйРежим(Истина);
	Менеджер = РегистрыСведений.ПараметрыГлобальные;
	Менеджер.УстановитьЗначениеПараметра("1562.Prometheus_МногопоточныйРасчетМетрик", МногопоточныйРасчетМетрик);
	Менеджер.УстановитьЗначениеПараметра("1562.Prometheus_ПервоначальноеЗаполнениеВыполнено", ПервоначальноеЗаполнениеВыполнено);
	Менеджер.УстановитьЗначениеПараметра("1562.Prometheus_ПредельнаяДлительностьПолученияМетрикOnline",
		ПредельнаяДлительностьПолученияМетрикOnline);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

