
#Область ПрограммныйИнтерфейс

// Возвращает параметры запроса остатки ЦБ Securities API
//
// Параметры:
//  ТелоЗапроса	 - Строка	 - Тело POST запроса JSON
// 
// Возвращаемое значение:
//   - Структура - свойство ДатаВремяСверки полученное из параметров запроса
//
Функция ReconciliationAPIОстаткиЦБПараметрыЗапроса(ТелоЗапроса) Экспорт
	
	ПараметрыЗапроса = Новый Структура;
	
	ПараметрыПреобразования = Новый Структура;
	ДанныеЗапросаHTTP = КоннекторHTTP.JsonВОбъект(ТелоЗапроса, , ПараметрыПреобразования);
	Если ТипЗнч(ДанныеЗапросаHTTP) <> Тип("Соответствие") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДатаВремяСверкиСтрокой = ДанныеЗапросаHTTP["DateTimeReconciliation"];
	ПозицияМиллисекунд = СтрНайти(ДатаВремяСверкиСтрокой, ".");
	Если ПозицияМиллисекунд > 0 Тогда
		ДатаВремяСверкиСтрокой = Сред(ДатаВремяСверкиСтрокой, 1, ПозицияМиллисекунд - 1);
	КонецЕсли;
	ДатаВремяСверки = ПрочитатьДатуJSON(ДатаВремяСверкиСтрокой, ФорматДатыJSON.ISO);
	ПараметрыЗапроса.Вставить("ДатаВремяСверки", ДатаВремяСверки);
	
	CrmClientIdЗначение = ДанныеЗапросаHTTP.Получить("CrmClientId");
	Если ЗначениеЗаполнено(CrmClientIdЗначение) Тогда
		ПараметрыЗапроса.Вставить("ПоВсемКлиентам", Ложь);
		ПараметрыЗапроса.Вставить("КодКлиента", Формат(CrmClientIdЗначение, "ЧГ=0"));
	Иначе
		ПараметрыЗапроса.Вставить("ПоВсемКлиентам", Истина);
		ПараметрыЗапроса.Вставить("КодКлиента", "null");
	КонецЕсли;
	
	BoundaryTypeIncludingЗначение = ДанныеЗапросаHTTP.Получить("BoundaryTypeIncluding");
	ПараметрыЗапроса.Вставить("ВключаяГраничноеЗначение", BoundaryTypeIncludingЗначение = Истина);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

// Возвращает остатки ЦБ
//
// Параметры:
//  ПараметрыЗапроса - Структура - содержит ДатаВремяСверки для получения остатков
// 
// Возвращаемое значение:
//   - Структура - см. https://confluence/pages/viewpage.action?pageId=223520614
//
Функция ReconciliationAPIОстаткиЦБ(ПараметрыЗапроса) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Период = Неопределено;
	Если Не ПараметрыЗапроса.Свойство("ДатаВремяСверки", Период) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Data = ОстаткиЦБНаДату(Период, ПараметрыЗапроса);
	Ответ = Новый Структура;
	Ответ.Вставить("Data", Data);
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Сереализует входящие данные в JSON, возвращает HTTP ответ с кодом 200,с телом ответа в формате JSON
//
// Параметры:
//  Данные  - Произвольный - любые сериализуемые в JSON данные, данные для сериализации в JSON
//  Запрос  - HTTPЗапрос
//
// Возвращаемое значение:
//   HTTPСервисОтвет - HTTP ответ с кодом 200,с телом ответа в формате JSON, код 204 если данныех нет
//
Функция httpОтветСТеломJSON(Данные, Запрос = Неопределено) Экспорт // BSLLS:LatinAndCyrillicSymbolInWord-off
	
	Если ТипЗнч(Данные) = Тип("Массив") И Данные.Количество() = 0 Тогда
		Возврат Новый HTTPСервисОтвет(204);
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Accept-Charset", "utf-8");
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	
	ДанныеJSON = КоннекторHTTP.ОбъектВJson(Данные);
	
	Если Запрос = Неопределено Тогда
		КлиентПоддерживаетGzip = Ложь;
	Иначе
		КлиентПоддерживаетGzip = СтрНайти(НРег(Запрос.Заголовки.Получить("Accept-Encoding")), "gzip") <> 0;
	КонецЕсли;
	Если КлиентПоддерживаетGzip Тогда
		Ответ.Заголовки.Вставить("Content-Encoding", "gzip");
		ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(ДанныеJSON, КодировкаТекста.UTF8);
		Ответ.УстановитьТелоИзДвоичныхДанных(КоннекторHTTP.ЗаписатьGZip(ДвоичныеДанные));
	Иначе
		Ответ.УстановитьТелоИзСтроки(ДанныеJSON);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Возвращает HTTP ответ с кодом 500, ошибка на стороне сервера
//
// Параметры:
//  ТекстОшибки  - Строка - Описание ошибки (необязательно)
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - HTTP ответ с кодом 500
//
Функция httpОтветВнутренняяОшибкаСервера(ТекстОшибки = "") Экспорт // BSLLS:LatinAndCyrillicSymbolInWord-off
	
	Ответ = Новый HTTPСервисОтвет(500);
	Ответ.Заголовки.Вставить("Accept-Charset", "utf-8");
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Ответ.Заголовки.Вставить("Content-Type", "text/html;charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ТекстОшибки);
	КонецЕсли;
	
	Возврат Ответ;

КонецФункции

// Возвращает HTTP ответ с кодом 400, с описанием ошибки
//
// Параметры:
//  ТекстОшибки  - Строка - Описание ошибки
//
// Возвращаемое значение:
//   HTTPСервисОтвет - HTTP ответ с кодом 400,с телом ответа из параметра
//
Функция httpОтветКлиентскаяОшибка(ТекстОшибки) Экспорт // BSLLS:LatinAndCyrillicSymbolInWord-off
	
	Ответ = Новый HTTPСервисОтвет(400);
	Ответ.Заголовки.Вставить("Accept-Charset", "utf-8");
	Ответ.Заголовки.Вставить("Content-Type", "text/html;charset=utf-8");
	
	Ответ.УстановитьТелоИзСтроки(ТекстОшибки);
	
	Возврат Ответ;
	
КонецФункции

// Проверяет наличие параметра в http-запросе, приводит значение к типу Дата.
//
// Параметры:
//  ПараметрыЗапроса  - Структура - Параметры http-запроса
//  ИмяПараметраДата  - Строка - имя параметра с датой в http-запросе
//
// Возвращаемое значение:
//	Результат - структура с ответом
//		Дата
//		ОписаниеОшибки
//
Функция ДатаИзПараметровЗапроса(ПараметрыЗапроса, ИмяПараметраДата) Экспорт
	
	Результат = Новый Структура("Дата, ОписаниеОшибки");
	Результат.Дата = ПараметрыЗапроса.Получить(ИмяПараметраДата);
	
	Если Результат.Дата <> Неопределено Тогда
		
		Результат.Дата = КоннекторHTTP.ДатаИзСтроки(Результат.Дата);
		
		Если Не ЗначениеЗаполнено(Результат.Дата) Тогда
			Результат.ОписаниеОшибки = "Не верный формат даты в параметрах запроса. Должен быть - yyyyMMdd";
		КонецЕсли; 
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// Проверяет наличие параметров дата начала/окончания периода в http-запросе, приводит значения к типу Дата.
//
// Параметры:
//  ПараметрыЗапроса  - Структура - Параметры http-запроса
//  ИмяПараметраНачалоПериода  - Строка - имя параметра с датой начала периода в http-запросе
//  ИмяПараметраКонецПериода  - Строка - имя параметра с датой окончания периода в http-запросе
//
// Возвращаемое значение:
//	Результат - структура с ответом
//		НачалоПериода
//		КонецПериода
//		ОписаниеОшибки
//
Функция ПериодИзПараметровЗапроса(ПараметрыЗапроса, ИмяПараметраНачалоПериода, ИмяПараметраКонецПериода) Экспорт
	
	Результат = Новый Структура("НачалоПериода, КонецПериода, ОписаниеОшибки");
	
	Результат.НачалоПериода = ПараметрыЗапроса.Получить(ИмяПараметраНачалоПериода);
	Результат.КонецПериода 	= ПараметрыЗапроса.Получить(ИмяПараметраКонецПериода);
	
	Если Результат.КонецПериода <> Неопределено Или Результат.НачалоПериода <> Неопределено Тогда
		
		Результат.НачалоПериода = КоннекторHTTP.ДатаИзСтроки(Результат.НачалоПериода);
		Результат.КонецПериода 	= КоннекторHTTP.ДатаИзСтроки(Результат.КонецПериода);
		
		Если Не (ЗначениеЗаполнено(Результат.НачалоПериода) И ЗначениеЗаполнено(Результат.КонецПериода)) Тогда
			Результат.ОписаниеОшибки = "Не верный формат даты в параметрах запроса. Должен быть - yyyyMMdd";
		ИначеЕсли Результат.НачалоПериода > Результат.КонецПериода Тогда
			Результат.ОписаниеОшибки = "Не верно указан период в параметрах запроса. Дата начала периода больше даты окончания";
		Иначе
			Результат.ОписаниеОшибки = "";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Фиксирует в регистре начало вызова
//
// Параметры:
//  ИмяСобытия	 - Строка	 - Имя события
//  Запрос		 - HTTPЗапрос	 - HTTPЗапрос
//  Комментарий	 - Строка		 - произвольный комментарий
// 
// Возвращаемое значение:
//   - Структура - ОписаниеВызова
//
Функция ЗафиксироватьНачало(ИмяСобытия, Запрос, Комментарий = "") Экспорт
	
	ПараметрыЗапроса = "";
	Если Запрос.ПараметрыЗапроса.Количество() <> 0 Тогда
		МассивПараметров = Новый Массив;
		Для Каждого Параметр Из Запрос.ПараметрыЗапроса Цикл
			МассивПараметров.Добавить(Параметр.Ключ + "=" + Параметр.Значение);
		КонецЦикла;
		ПараметрыЗапроса = "?" + СтрСоединить(МассивПараметров, "&");
	КонецЕсли;
	
	ОписаниеВызова = РегистрыСведений.ЖурналРегистрацииВызовов.НовоеОписаниеВызова(
		Запрос.БазовыйURL + Запрос.ОтносительныйURL + ПараметрыЗапроса, ИмяСобытия);
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьНачало(ОписаниеВызова, Комментарий);
	
	Возврат ОписаниеВызова;
	
КонецФункции

// Дополняет параметры описания вызова и вносит запись об окончании вызова с ошибкой в регистр
//
// Параметры:
//  ОписаниеВызова	 - Структура - см. РегистрыСведений.ЖурналРегистрацииВызовов.НовоеОписаниеВызова()
//  ОписаниеОшибки	 - Строка	 - подробное описание ошибки
//  Комментарий		 - Строка	 - произвольный комментарий
//
Процедура ЗафиксироватьОшибку(ОписаниеВызова, ОписаниеОшибки, Комментарий = "") Экспорт
	
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОшибку(ОписаниеВызова, ОписаниеОшибки, Комментарий);
	ЗаписьЖурналаРегистрации(ОписаниеВызова.ВидДействия, УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
	
КонецПроцедуры

// Дополняет параметры описания вызова и вносит запись об успешном окончании вызова в регистр
//
// Параметры:
//  ОписаниеВызова	 - Структура - см. РегистрыСведений.ЖурналРегистрацииВызовов.НовоеОписаниеВызова()
//  Комментарий		 - Строка	 - произвольный комментарий
//
Процедура ЗафиксироватьОкончание(ОписаниеВызова, Комментарий = "") Экспорт
	
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОкончание(ОписаниеВызова, Комментарий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОстаткиЦБНаДату(Период, ПараметрыЗапроса)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
	|	МИНИМУМ(РазделСчетаОбеспечения.ДатаОткрытияСчета) КАК ДатаОткрытияСчета
	|ПОМЕСТИТЬ СамыеРанниеРазделыСчета
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(&Период, ИСТИНА) КАК ОстаткиЦБОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РазделСчетаОбеспечения
	|		ПО ОстаткиЦБОстатки.СчетДепо = РазделСчетаОбеспечения.Владелец
	|			И (ВЫБОР
	|				КОГДА ОстаткиЦБОстатки.СчетДепо.ТипСчетаДепо = ЗНАЧЕНИЕ(Перечисление.ТипысчетовДепо.ВладельцаТорговый)
	|					ТОГДА РазделСчетаОбеспечения.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.Обеспечения)
	|				ИНАЧЕ РазделСчетаОбеспечения.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.Основной)
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиЦБОстатки.СчетДепо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОстатки.СчетДепо.Владелец.ЮридическиеФизическиеЛица КАК СчетДепоВладелецЮридическиеФизическиеЛица,
	|	ОстаткиЦБОстатки.ЦБ КАК ЦБ,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ОстаткиЦБОстатки.ЦБ.ТипЦБ В (&ТипыДепозитарныхРасписок)
	|					ТОГДА ОстаткиЦБОстатки.ЦБ.БазовыйАктив.Эмитент.Наименование
	|				ИНАЧЕ ОстаткиЦБОстатки.ЦБ.Эмитент.Наименование
	|			КОНЕЦ КАК СТРОКА(150)), """") КАК IssuerName,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ОстаткиЦБОстатки.ЦБ.Наименование КАК СТРОКА(150)), """") КАК SecurityName,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ОстаткиЦБОстатки.ЦБ.ISIN КАК СТРОКА(30)), """") КАК Isin,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ОстаткиЦБОстатки.ЦБ.НомерРегистрации КАК СТРОКА(50)), """") КАК RegNum,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ОстаткиЦБОстатки.СчетДепо.Код КАК СТРОКА(12)), """") КАК DepoAccount,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ОстаткиЦБОстатки.СчетДепоМХ.Код КАК СТРОКА(17)), """") КАК DepoAccountSafeKeeping,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ОстаткиЦБОстатки.РазделСчетаДепоМХ.Код КАК СТРОКА(17)), """") КАК SubDepoAccountSafeKeeping,
	|	ОстаткиЦБОстатки.КоличествоОстаток КАК Qty,
	|	ОстаткиЦБОстатки.СчетДепо.Владелец КАК СчетДепоВладелец
	|ПОМЕСТИТЬ ОстаткиЦБОстатки
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(&Период, ИСТИНА) КАК ОстаткиЦБОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РазделСчетаОбеспечения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СамыеРанниеРазделыСчета КАК СамыеРанниеРазделыСчета
	|			ПО РазделСчетаОбеспечения.Владелец = СамыеРанниеРазделыСчета.СчетДепо
	|				И РазделСчетаОбеспечения.ДатаОткрытияСчета = СамыеРанниеРазделыСчета.ДатаОткрытияСчета
	|		ПО ОстаткиЦБОстатки.СчетДепо = РазделСчетаОбеспечения.Владелец
	|			И (ВЫБОР
	|				КОГДА ОстаткиЦБОстатки.СчетДепо.ТипСчетаДепо = ЗНАЧЕНИЕ(Перечисление.ТипысчетовДепо.ВладельцаТорговый)
	|					ТОГДА РазделСчетаОбеспечения.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.Обеспечения)
	|				ИНАЧЕ РазделСчетаОбеспечения.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.Основной)
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫРАЗИТЬ(КодыЗагрузкиКлиент.Код КАК СТРОКА(20)), """") КАК CrmClientIdСтрокой,
	|	ОстаткиЦБОстатки.IssuerName КАК IssuerName,
	|	ОстаткиЦБОстатки.SecurityName КАК SecurityName,
	|	ОстаткиЦБОстатки.Isin КАК Isin,
	|	ОстаткиЦБОстатки.RegNum КАК RegNum,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(КодыЗагрузкиЦБ.Код КАК СТРОКА(20)), """") КАК NrdCode,
	|	ОстаткиЦБОстатки.DepoAccount КАК DepoAccount,
	|	ОстаткиЦБОстатки.DepoAccountSafeKeeping КАК DepoAccountSafeKeeping,
	|	ОстаткиЦБОстатки.SubDepoAccountSafeKeeping КАК SubDepoAccountSafeKeeping,
	|	СУММА(ОстаткиЦБОстатки.Qty) КАК Qty
	|ИЗ
	|	ОстаткиЦБОстатки КАК ОстаткиЦБОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиКлиент
	|		ПО ОстаткиЦБОстатки.СчетДепоВладелецЮридическиеФизическиеЛица = КодыЗагрузкиКлиент.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиЦБ
	|		ПО ОстаткиЦБОстатки.ЦБ = КодыЗагрузкиЦБ.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиДепоненты
	|		ПО (КодыЗагрузкиДепоненты.Владелец = ОстаткиЦБОстатки.СчетДепоВладелец)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ПоВсемКлиентам = ИСТИНА
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЕСТЬNULL(КодыЗагрузкиКлиент.Код, """") = &КодКлиента
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПоВсемРазделамСчетовМХ = ИСТИНА
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОстаткиЦБОстатки.SubDepoAccountSafeKeeping В (&РазделыСчетовДепоМХ)
	|		КОНЕЦ
	|	И КодыЗагрузкиКлиент.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.Клиенты)
	|	И (КодыЗагрузкиКлиент.Владелец ССЫЛКА Справочник.ФизическиеЛица
	|			ИЛИ КодыЗагрузкиКлиент.Владелец ССЫЛКА Справочник.ЮридическиеЛица)
	|	И КодыЗагрузкиДепоненты.Биржа = &CrmContractNumber
	|	И КодыЗагрузкиДепоненты.Владелец ССЫЛКА Справочник.Контрагенты
	|	И КодыЗагрузкиЦБ.Биржа = &НДЦ
	|	И КодыЗагрузкиЦБ.Владелец ССЫЛКА Справочник.ЦенныеБумаги
	|	И (НЕ КодыЗагрузкиКлиент.ПометкаУдаления
	|				И КодыЗагрузкиКлиент.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ КодыЗагрузкиКлиент.ДатаОкончанияДействия > &ПериодДень)
	|	И (НЕ КодыЗагрузкиЦБ.ПометкаУдаления
	|				И КодыЗагрузкиЦБ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ КодыЗагрузкиЦБ.ДатаОкончанияДействия > &ПериодДень)
	|	И (НЕ КодыЗагрузкиДепоненты.ПометкаУдаления
	|				И КодыЗагрузкиДепоненты.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ КодыЗагрузкиДепоненты.ДатаОкончанияДействия > &ПериодДень)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВЫРАЗИТЬ(КодыЗагрузкиКлиент.Код КАК СТРОКА(20)), """"),
	|	ОстаткиЦБОстатки.IssuerName,
	|	ОстаткиЦБОстатки.SecurityName,
	|	ОстаткиЦБОстатки.Isin,
	|	ОстаткиЦБОстатки.RegNum,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(КодыЗагрузкиЦБ.Код КАК СТРОКА(20)), """"),
	|	ОстаткиЦБОстатки.DepoAccount,
	|	ОстаткиЦБОстатки.DepoAccountSafeKeeping,
	|	ОстаткиЦБОстатки.SubDepoAccountSafeKeeping
	|
	|УПОРЯДОЧИТЬ ПО
	|	Isin";
	
	Запрос.УстановитьПараметр("ПериодДень", НачалоДня(Период));
	Если ПараметрыЗапроса.ВключаяГраничноеЗначение Тогда
		Запрос.УстановитьПараметр("Период", Новый Граница(Период, ВидГраницы.Включая));
	Иначе
		Запрос.УстановитьПараметр("Период", Период);
	КонецЕсли;
	Запрос.УстановитьПараметр("ПоВсемРазделамСчетовМХ", Не ЗначениеЗаполнено(ПараметрыЗапроса.РазделыСчетовДепоМХ));
	Запрос.УстановитьПараметр("РазделыСчетовДепоМХ", ПараметрыЗапроса.РазделыСчетовДепоМХ);
	Запрос.УстановитьПараметр("ПоВсемКлиентам", ПараметрыЗапроса.ПоВсемКлиентам);
	Запрос.УстановитьПараметр("КодКлиента", ПараметрыЗапроса.КодКлиента);
	Запрос.УстановитьПараметр("НДЦ", Справочники.КлассификаторыЗагрузки.НДЦ());
	Запрос.УстановитьПараметр("CrmContractNumber", Справочники.КлассификаторыЗагрузки.CrmContractNumber);
	Запрос.УстановитьПараметр("ТипыДепозитарныхРасписок", Перечисления.ТипыЦБ.ВсеТипыДепозитарныхРасписок());
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	ТаблицаОстатков.Колонки.Вставить(0, "DateTimeReconciliation");
	ТаблицаОстатков.ЗаполнитьЗначения(XMLСтрока(Период), "DateTimeReconciliation");
	ТаблицаОстатков.Колонки.Вставить(1, "CrmClientId", Новый ОписаниеТипов("Число"));
	Для Каждого Стр Из ТаблицаОстатков Цикл
		Стр.CrmClientId 			 = СтроковыеФункцииКлиентСервер.ЧислоИзСтроки(СокрЛП(Стр.CrmClientIdСтрокой));
		Стр.NrdCode					 = СокрЛП(Стр.NrdCode);
		Стр.DepoAccount				 = СокрЛП(Стр.DepoAccount);
		Стр.DepoAccountSafeKeeping	 = СокрЛП(Стр.DepoAccountSafeKeeping);
		Стр.SubDepoAccountSafeKeeping = СокрЛП(Стр.SubDepoAccountSafeKeeping);
	КонецЦикла;
	ТаблицаОстатков.Колонки.Удалить("CrmClientIdСтрокой");
	КолонкиКУдалениюЕслиЗначениеНеЗаполнено = "CrmClientId";
	Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаОстатков, КолонкиКУдалениюЕслиЗначениеНеЗаполнено);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
