
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Параметры.Отбор) = Тип("Структура") И Параметры.Отбор.Свойство("Поручение") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Поручение", Параметры.Отбор.Поручение);
		ЭтаФорма.Заголовок = "Поручения в вышестоящий депозитарий с отбором по: " + Параметры.Отбор.Поручение;
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("В форму списка с отбором не передана структура ""Отбор"" с параметром ""Поручение""", Отказ);
	КонецЕсли;
КонецПроцедуры
