#Область ПрограммныйИнтерфейс

// Возвращает массив со всеми кодами для заверения об обособлении ЦБ
// Возвращаемое значение:
//	Массив
//
Функция ВсеКоды() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КодыДляЗаверенияОбОбособленииЦБ.Код КАК Код
	|ИЗ
	|	Справочник.КодыДляЗаверенияОбОбособленииЦБ КАК КодыДляЗаверенияОбОбособленииЦБ
	|ГДЕ
	|	Не КодыДляЗаверенияОбОбособленииЦБ.ПометкаУдаления";
	ВсеКоды = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Код");
	
	Возврат ВсеКоды;
КонецФункции

#КонецОбласти