Функция СтрокаВДату(Элемент, ФорматСтроки, РазделительДаты, знач ПрефиксГодаДаты=0) Экспорт
	Перем СтруктураДаты;
	Попытка
		Выполнить("СтруктураДаты = Новый Структура("""+ФорматСтроки+""","+?(РазделительДаты<>",",СтрЗаменить(Элемент,РазделительДаты,","),Элемент)+")");
	Исключение
		Возврат "Недопустимый формат даты";
	КонецПопытки;
	Возврат Дата(ПрефиксГодаДаты*100+СтруктураДаты.Год,СтруктураДаты.Месяц,СтруктураДаты.День);
КонецФункции

// из строки с разделителями таб возвращается структура для заполнения
Процедура СтрокаВТаблицуЗначений(СтрокаТаблицыЗначений, СписокПолейСтроки, СписокЗначенийСтроки) Экспорт
	Перем СтруктураПолей;
	СписокЗначенийСтроки = СтрЗаменить(СписокЗначенийСтроки,"""","''");
	Попытка
		Выполнить("СтруктураПолей = Новый Структура("""+СтрЗаменить(СписокПолейСтроки,Символы.Таб,",")+""","""+СтрЗаменить(СписокЗначенийСтроки,Символы.Таб,""",""")+""")");
	Исключение
		Сообщить("Недопустимый формат данных");
	КонецПопытки;
	ЗаполнитьЗначенияСвойств(СтрокаТаблицыЗначений,СтруктураПолей);
КонецПроцедуры

Функция КонвертацияВалюты(Дата, Сумма, Валюта, Знач НужнаВалюта = Истина) Экспорт
	Перем ПараметрыВалюты;
	ПараметрыВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта",Валюта));
	Если ПараметрыВалюты.Курс = Неопределено Тогда
		Сообщить("На дату "+Дата+" для валюты "+Валюта+" не определен курс");
		Возврат Неопределено;
	КонецЕсли;
	Если ПараметрыВалюты.Кратность = Неопределено Тогда
		Сообщить("На дату "+Дата+" для валюты "+Валюта+" не определена кратность");
		Возврат Неопределено;
	КонецЕсли;
	Возврат ?(НужнаВалюта, Сумма / ПараметрыВалюты.Курс * ПараметрыВалюты.Кратность, Сумма / ПараметрыВалюты.Кратность * ПараметрыВалюты.Курс);
КонецФункции
