
//#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отчет.НачПериода	=	НачалоКвартала(ТекущаяДата());	
	Отчет.КонПериода	=   КонецКвартала(ТекущаяДата());
	СформироватьЗаголовокФормы();
	
КонецПроцедуры


//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы


//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	//проверка выбранного периода.
	Если НЕ ПроверкаВыбранногоПериода() Тогда
		
		Сообщить("Не правильно выбран период!");
		Возврат;
		
	КонецЕсли;
	СформироватьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериода(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтаФорма);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период.ДатаНачала = Отчет.НачПериода;
	Диалог.Период.ДатаОкончания =  Отчет.КонПериода;
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		Отчет.НачПериода = Период.ДатаНачала;
		Отчет.КонПериода = Период.ДатаОкончания;
	КонецЕсли;
	СформироватьЗаголовокФормы();
КонецПроцедуры


&НаСервере
Процедура СформироватьНаСервере()
	
	РеквизитФормыВЗначение("Отчет").Сформировать(ТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовокФормы()
	
	// Вывод заголовка, описателя периода и фильтров и заголовка
	Если Отчет.НачПериода = '00010101000000' И Отчет.КонПериода = '00010101000000' Тогда
		
		ОписаниеПериода = "Период не установлен";
		
	Иначе
		
		Если Отчет.НачПериода = '00010101000000' ИЛИ Отчет.КонПериода = '00010101000000' Тогда
			
			ОписаниеПериода = "" + Формат(Отчет.НачПериода, "ДФ = ""дд.ММ.гггг""; ДП = ""...""") 
			+ " - "      + Формат(Отчет.КонПериода, "ДФ = ""дд.ММ.гггг""; ДП = ""...""");
			
		Иначе
			
			Если Отчет.НачПериода <= Отчет.КонПериода Тогда
				ОписаниеПериода = "" + ПредставлениеПериода(НачалоДня(Отчет.НачПериода), КонецДня(Отчет.КонПериода), "ФП = Истина");
			Иначе
				ОписаниеПериода = "Неправильно задан период!"
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	Заголовок 	= ЗаголовокОтчета()+" (" + ОписаниеПериода + ") " ;
	
КонецПроцедуры 

&НаКлиенте
Функция ЗаголовокОтчета() Экспорт
	Возврат  "Количество счетов депо ";
КонецФункции

&НаКлиенте
Функция ПроверкаВыбранногоПериода()
	Если Отчет.НачПериода > Отчет.КонПериода И Отчет.КонПериода <> '00010101000000' Тогда
		Предупреждение("Дата начала периода не может быть больше даты конца периода");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

//#КонецОбласти
