////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС

Процедура ИнициироватьСоединение(Параметры = Неопределено) Экспорт
	Макет = ПолучитьМакет("Макет");
КонецПроцедуры

////#Область Тестовые методы

Функция РезультатОтправкиУведомленияПоВыкупам(ТаблицаОпций, РезультатЗапросаПоКлиентам, РезультатЗапросаПоДокументуКД,
	ЗаголовокСообщения, ТекстСообщения, УникальныйИдентификатор) Экспорт
	
	Сообщить("*** РезультатОтправкиУведомленияПоВыкупам() ***");
	Сообщить("Параметры:");
	
	Сообщить("--- ТаблицаОпций ---");
	ВывестиТаблицуЗначений(ТаблицаОпций);
	
	Сообщить("--- РезультатЗапросаПоКлиентам ---");
	ВывестиТаблицуЗначений(РезультатЗапросаПоКлиентам.Выгрузить());
	
	Сообщить("--- РезультатЗапросаПоДокументуКД ---");
	ВывестиТаблицуЗначений(РезультатЗапросаПоДокументуКД.Выгрузить());
	
	Сообщить("ЗаголовокСообщения: " + ЗаголовокСообщения);
	Сообщить("ТекстСообщения:" + Символы.ПС + ТекстСообщения);
	Сообщить("УникальныйИдентификатор: " + УникальныйИдентификатор);
	
	Возврат Истина;
	
КонецФункции

Функция РезультатОтправкиУведомленияПоСобраниям(РезультатЗапросаПоКлиентам,	РезультатЗапросаПоВопросам,
	РезультатЗапросаПоДокументуКД, ЗаголовокСообщения, ТекстСообщения, УникальныйИдентификатор) Экспорт
	
	Сообщить("*** РезультатОтправкиУведомленияПоСобраниям() ***");
	Сообщить("Параметры:");
	
	Сообщить("--- РезультатЗапросаПоКлиентам ---");
	ВывестиТаблицуЗначений(РезультатЗапросаПоКлиентам.Выгрузить());
	
	Сообщить("--- РезультатЗапросаПоВопросам ---");
	ВывестиТаблицуЗначений(РезультатЗапросаПоВопросам.Выгрузить());
	
	Сообщить("--- РезультатЗапросаПоДокументуКД ---");
	ВывестиТаблицуЗначений(РезультатЗапросаПоДокументуКД.Выгрузить());
	
	Сообщить("ЗаголовокСообщения: " + ЗаголовокСообщения);
	Сообщить("ТекстСообщения:" + Символы.ПС + ТекстСообщения);
	Сообщить("УникальныйИдентификатор: " + УникальныйИдентификатор);
	
	Возврат Истина;
	
КонецФункции

Функция РезультатСохраненияКорпоративногоДействияWTRC(ТаблицаКлиентов, ТаблицаРазделов, ПараметрыWebСервиса,
	УникальныйИдентификатор) Экспорт

	Сообщить("*** РезультатСохраненияКорпоративногоДействияWTRC() ***");
	Сообщить("Параметры:");
	
	Сообщить("--- ТаблицаКлиентов ---");
	ВывестиТаблицуЗначений(ТаблицаКлиентов);
	
	Сообщить("--- ТаблицаРазделов ---");
	ВывестиТаблицуЗначений(ТаблицаРазделов);
	
	Сообщить("--- ПараметрыWebСервиса ---");
	ВывестиСтруктуру(ПараметрыWebСервиса);
	
	Сообщить("УникальныйИдентификатор: " + УникальныйИдентификатор);
	
	Возврат Истина;
	
КонецФункции

Функция РезультатДобавленияКлиентаВСуществующееКорпоративноеДействиеWTRC(ПараметрыWebСервиса,
	УникальныйИдентификатор) Экспорт
	
	Сообщить("*** РезультатДобавленияКлиентаВСуществующееКорпоративноеДействиеWTRC() ***");
	Сообщить("Параметры:");
	
	Сообщить("--- ПараметрыWebСервиса.Данные ---");
	ВывестиТаблицуЗначений(ПараметрыWebСервиса.Данные);

	Сообщить("--- ПараметрыWebСервиса ---");
	ВывестиСтруктуру(ПараметрыWebСервиса);
	
	Сообщить("УникальныйИдентификатор: " + УникальныйИдентификатор);
	
	Возврат Истина;
	
КонецФункции

Функция РезультатОтправкиУведомленияПоВозвратуЧастиНалога(ТаблицаКлиентов, РезультатЗапросаПоДокументуКД,
	ЗаголовокСообщения, ТекстСообщения, ВидКД, УникальныйИдентификатор) Экспорт

	Сообщить("*** РезультатОтправкиУведомленияПоВозвратуЧастиНалога() ***");
	Сообщить("Параметры:");
	
	Сообщить("--- ТаблицаКлиентов ---");
	ВывестиТаблицуЗначений(ТаблицаКлиентов);

	Сообщить("--- РезультатЗапросаПоДокументуКД ---");
	ВывестиТаблицуЗначений(РезультатЗапросаПоДокументуКД.Выгрузить());
	
	Сообщить("ЗаголовокСообщения: " + ЗаголовокСообщения);
	Сообщить("ТекстСообщения:" + Символы.ПС + ТекстСообщения);
	Сообщить("УникальныйИдентификатор: " + УникальныйИдентификатор);
	
	Возврат Истина;
	
КонецФункции

Функция РезультатОтправкиУведомленияИнформационного(ИдентификаторыКлиентов,	ЗаголовокСообщения, ТекстСообщения,
	УникальныйИдентификатор) Экспорт

	Сообщить("*** РезультатОтправкиУведомленияИнформационного() ***");
	Сообщить("Параметры:");
	
	Сообщить("--- ИдентификаторыКлиентов ---");
	Сообщить(СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ИдентификаторыКлиентов, Символы.ПС));

	Сообщить("ЗаголовокСообщения: " + ЗаголовокСообщения);
	Сообщить("ТекстСообщения:" + Символы.ПС + ТекстСообщения);
	Сообщить("УникальныйИдентификатор: " + УникальныйИдентификатор);
	
	Возврат Истина;
	
КонецФункции

Функция РезультатОтправкиИнформационногоПисьмаКлиентам(ИдентификаторыКлиентов, ЗаголовокСообщения, ТекстСообщения) Экспорт

	Сообщить("*** РезультатОтправкиУведомленияИнформационного() ***");
	Сообщить("Параметры:");
	
	Сообщить("--- ИдентификаторыКлиентов ---");
	Сообщить(СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ИдентификаторыКлиентов, Символы.ПС));
	
	Сообщить("ЗаголовокСообщения: " + ЗаголовокСообщения);
	Сообщить("ТекстСообщения:" + Символы.ПС + ТекстСообщения);
	
	Возврат Истина;
	
КонецФункции

Функция СтатусыДоставкиУведомленийОКД(ДанныеУведомлений) Экспорт
	СтатусыДоставки = Новый ТаблицаЗначений;
	СтатусыДоставки.Колонки.Добавить("GUID");
	СтатусыДоставки.Колонки.Добавить("ClientId");
	СтатусыДоставки.Колонки.Добавить("Успешно");
	
	ТаблицаМакета = ДанныеИзТаблицыМакета("СтатусыДоставкиУведомленийОКД");
	
	Для Каждого СтрокаУведомления Из ДанныеУведомлений Цикл
		Для Каждого КодЗагрузки Из СтрокаУведомления.ИдентификаторыКлиентов Цикл
			Отбор = Новый Структура("GUID, ClientId", СтрокаУведомления.УникальныйИдентификатор, КодЗагрузки);
			СтрокиДанных = ТаблицаМакета.НайтиСтроки(Отбор);
			
			НоваяСтрока = СтатусыДоставки.Добавить();
			НоваяСтрока.GUID = СтрокаУведомления.УникальныйИдентификатор;
			НоваяСтрока.ClientId = КодЗагрузки;
			НоваяСтрока.Успешно = ?(СтрокиДанных.Количество() > 0, СтрокиДанных[0].Успешно, Ложь);
		КонецЦикла;
	КонецЦикла;
	
	Возврат СтатусыДоставки;
КонецФункции

Функция УведомленияКДОтстутствующиеВ1С(ДанныеУведомлений, НачалоПериода, КонецПериода) Экспорт
	Возврат ДанныеИзТаблицыМакета("УведомленияКДОтстутствующиеВ1С");
КонецФункции

// Возвращает таблицу с данными о всех созданных в КК заявлениях на участие в оферте, которые
// подписаны клиентом, но еще не были загружены в 1С ДЕПО
// Возвращаемое значение:
//	Таблица значений - со следующими колонками:
//							DocumentNumber - строка - номер в СЭД
//							ClientId - строка(9) - идентификатор клиента в СУДК
//							ISIN - строка - ISIN ЦБ
//							RegNumber - строка - государственный регистрационный номер ЦБ
//							StockBondsCount - число - число ЦБ к оферте
//							OfferDate - дата - дата оферты
//							DocumentId - целое число - ID заявки
Функция НовыеЗаявленияНаУчастиеВОферте() Экспорт
	
	Заявления = Документы.ЗаявлениеНаУчастиеВОферте.НоваяТаблицаДляЗаявленийИзКабинетаКлиента();
	
	НовСтрока = Заявления.Добавить();
	НовСтрока.DocumentNumber = "Д230222-0001";
	НовСтрока.ClientId = "000001017";
	НовСтрока.ISIN = "RU0009843239";
	НовСтрока.RegNumber = "1-02-00609-D";
	НовСтрока.StockBondsCount = 125;
	НовСтрока.OfferDate = Дата(2023, 2, 22, 16, 03, 58);
	НовСтрока.DocumentId = 3966253;
	НовСтрока.Exported1C = Ложь;
	НовСтрока.CreatedAt = Дата(2023, 2, 23, 11, 17, 11);
	
	Возврат Заявления;
	
КонецФункции

// Возвращает таблицу с данными о всех имеющихся в КК подписанных заявлениях на участие в оферте
// за указанный период.
// Параметры:
//	ДатаНачала - дата
//	ДатаОкончания - дата
// Возвращаемое значение:
//	Таблица значений - со следующими колонками:
//							DocumentNumber - номер в СЭД
//							ClientId - идентификатор клиента в СУДК (строка(9))
//							ISIN - ISIN ЦБ
//							RegNumber - государственный регистрационный номер ЦБ
//							StockBondsCount - число ЦБ к оферте
//							OfferDate - дата оферты
//							DocumentId - ID заявки
//							Exported1C - завка была выгружена в 1С
Функция ЗаявленияНаУчастиеВОфертеЗаПериод(ДатаНачала, ДатаОкончания) Экспорт
	
	Заявления = Документы.ЗаявлениеНаУчастиеВОферте.НоваяТаблицаДляЗаявленийИзКабинетаКлиента();
	
	НовСтрока = Заявления.Добавить();
	НовСтрока.DocumentNumber = "Д230222-0001";
	НовСтрока.ClientId = "000001017";
	НовСтрока.ISIN = "RU0009843239";
	НовСтрока.RegNumber = "1-02-00609-D";
	НовСтрока.StockBondsCount = 125;
	НовСтрока.OfferDate = Дата(2023, 2, 22, 16, 03, 58);
	НовСтрока.DocumentId = 3966253;
	НовСтрока.Exported1C = Истина;
	НовСтрока.CreatedAt = Дата(2023, 2, 23, 11, 17, 11);
	
	Возврат Заявления;
	
КонецФункции


// Сообщает СУДК какие заявления были успешно загружены в 1С ДЕПО
// Параметры:
//	ЗагруженныеЗаявления - Массив - массив DocumentId, представляющих собой целые числа
Процедура СообщитьСУДКЧтоЗаявленияНаУчастиеВОфертеЗагружены(ЗагруженныеЗаявления) Экспорт
	Сообщение = "Заглушка вызова метода SetOfferRequestExported1C веб-сервиса ""Веб сервис клиенты"" выполнена ... ";
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
КонецПроцедуры

////#КонецОбласти Тестовые методы

////#Область Вспомогательные методы

Функция ДанныеИзТаблицыМакета(ИмяПроцедуры)
	ИндексСтроки = 1;
	ИндексКолонки = 2;
	КоличествоПропусков = 0;
	ПроцедураНайдена = Ложь;
	ТаблицаВозврата = Новый ТаблицаЗначений;
	
	// Ищем имя процедуры
	Пока Истина Цикл 
		ОбластьЗаголовок = Макет.Область(ИндексСтроки, 1, ИндексСтроки, 1).Текст;
		Если ЗначениеЗаполнено(ОбластьЗаголовок) Тогда 
			Если ОбластьЗаголовок = ИмяПроцедуры Тогда 
				ПроцедураНайдена = Истина;
				Прервать;
			КонецЕсли;
			КоличествоПропусков = 0;
		Иначе 
			КоличествоПропусков = КоличествоПропусков + 1;
		КонецЕсли;
		
		Если КоличествоПропусков > 20 Тогда  // если данных больше, нужно увеличить этот порог
			КоличествоПропусков = 0;
			Прервать;
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Если Не ПроцедураНайдена Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В макете тестирования не найдена процедура: " + ИмяПроцедуры);
		Возврат ТаблицаВозврата;
	КонецЕсли;
	
	// Читаем поля таблицы и типы
	ИндексСтрокиИмени = ИндексСтроки + 1; // В этой строке имена полей таблицы возврата
	ИндексСтрокиТипа  = ИндексСтрокиИмени + 1; // В этой строке типы полей таблицы возврата
	Пока Истина Цикл 
		ИмяПоляТаблицы = Макет.Область(ИндексСтрокиИмени, ИндексКолонки, ИндексСтрокиИмени, ИндексКолонки).Текст;
		ТипПоляТаблицы = Макет.Область(ИндексСтрокиТипа, ИндексКолонки, ИндексСтрокиТипа, ИндексКолонки).Текст;
		Если ЗначениеЗаполнено(ИмяПоляТаблицы) И ЗначениеЗаполнено(ТипПоляТаблицы) Тогда 
			ИндексПоискаНачало = Найти(ТипПоляТаблицы, "(");
			ИндексПоискаКонец  = Найти(ТипПоляТаблицы, ")");
			Если ИндексПоискаНачало > 0 Тогда // Обработка для строки
				ИндексПоискаНачало = ИндексПоискаНачало + 1;
				ИскомоеЧисло = Сред(ТипПоляТаблицы, ИндексПоискаНачало, ИндексПоискаКонец - ИндексПоискаНачало);
				ИскомыйТип   = Лев(ТипПоляТаблицы, ИндексПоискаНачало - 2);
				Если Лев(ТипПоляТаблицы,1) = "С" Тогда 
					КС = Новый КвалификаторыСтроки(ИскомоеЧисло);
					ОписаниеТипов = Новый ОписаниеТипов(ИскомыйТип,,КС);
				Иначе 
					КЧ = Новый КвалификаторыЧисла(ИскомоеЧисло);
					ОписаниеТипов = Новый ОписаниеТипов(ИскомыйТип,,,КЧ);
				КонецЕсли;
			Иначе
				ОписаниеТипов = Новый ОписаниеТипов(ТипПоляТаблицы);
			КонецЕсли;
			ТаблицаВозврата.Колонки.Добавить(ИмяПоляТаблицы, ОписаниеТипов);
			ИндексКолонки = ИндексКолонки + 1;
		Иначе 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Читаем данные в таблицу возврата
	Колонки = ТаблицаВозврата.Колонки;
	Если Колонки.Количество() = 0 Тогда 
		Возврат ТаблицаВозврата;
	КонецЕсли;
	
	ВсегоКолонок = ИндексКолонки -1;
	ИндексСтроки = ИндексСтрокиТипа;
	Пока Истина Цикл 
		ИндексКолонки = 2;
		ИндексСтроки = ИндексСтроки + 1; // Строка данных
		ЗначениеПоляТаблицы = Макет.Область(ИндексСтроки, ИндексКолонки, ИндексСтроки, ИндексКолонки).Текст;
		Если ЗначениеЗаполнено(ЗначениеПоляТаблицы) И ЗначениеПоляТаблицы <> "Ограничитель" Тогда 
			НоваяСтрока = ТаблицаВозврата.Добавить();
			УстановитьЗначениеВТаблицу(НоваяСтрока, Колонки, ИндексКолонки, ЗначениеПоляТаблицы);
			ИндексКолонки = ИндексКолонки + 1;
			Пока ИндексКолонки <= ВсегоКолонок Цикл 
				ЗначениеПоляТаблицы = Макет.Область(ИндексСтроки, ИндексКолонки, ИндексСтроки, ИндексКолонки).Текст;
				Если ЗначениеЗаполнено(ЗначениеПоляТаблицы) Тогда 
					УстановитьЗначениеВТаблицу(НоваяСтрока, Колонки, ИндексКолонки, ЗначениеПоляТаблицы);
				КонецЕсли;
				ИндексКолонки = ИндексКолонки + 1;
			КонецЦикла;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаВозврата;
	
КонецФункции

Процедура УстановитьЗначениеВТаблицу(НоваяСтрока,Колонки,ИндексКолонки,ЗначениеПоляТаблицы)
	Колонка		= Колонки[ИндексКолонки -2];
	ИмяКолонки	= Колонка.Имя;
	ТипКолонки	= Колонка.ТипЗначения;
	НоваяСтрока[ИмяКолонки] = ТипизироватьЗначение(ЗначениеПоляТаблицы,ТипКолонки);
КонецПроцедуры

Функция ТипизироватьЗначение(ЗначениеПоляТаблицы,ТипКолонки)
	Результат = ЗначениеПоляТаблицы;
	Если ТипКолонки.Типы().Найти(Тип("Дата")) <> Неопределено Тогда 
		Результат = Дата(ЗначениеПоляТаблицы);
	ИначеЕсли ТипКолонки.Типы().Найти(("Число")) <> Неопределено Тогда 
		Результат = Число(ЗначениеПоляТаблицы);
	ИначеЕсли ТипКолонки.Типы().Найти(Тип("Булево")) <> Неопределено Тогда 
		Результат = ?(ЗначениеПоляТаблицы = "1", Истина, Ложь);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура ВывестиТаблицуЗначений(ТЗ)
	СписокКолонок = "Колонки:";
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		СписокКолонок = СписокКолонок + Символы.Таб + Колонка.Имя;
	КонецЦикла;
	Сообщить(СписокКолонок);
	
	Если ТЗ.Количество() = 0 Тогда
		Сообщить("(таблица пустая)");
	КонецЕсли;
	
	НомСтр = 1;
	Для Каждого Строка Из ТЗ Цикл
		ПредставлениеСтроки = "Стр." + НомСтр + ":	";
		Для Каждого Колонка Из ТЗ.Колонки Цикл
			ПредставлениеСтроки = ПредставлениеСтроки + Символы.Таб + СокрЛП(Строка[Колонка.Имя]);
		КонецЦикла;
		Сообщить(ПредставлениеСтроки);
		НомСтр = НомСтр+1;
	КонецЦикла;
КонецПроцедуры

Процедура ВывестиСтруктуру(Стр)
	Если Стр.Количество() = 0 Тогда
		Сообщить("(структура пустая)");
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из Стр Цикл
		Сообщить(СокрЛП(КлючИЗначение.Ключ) + "=" + СокрЛП(КлючИЗначение.Значение));
	КонецЦикла;
КонецПроцедуры

////#КонецОбласти Вспомогательные методы

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
