
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	РезультатПроверки = ПроверитьСовместимость();
	Если РезультатПроверки.Отказ Тогда
		ВызватьИсключение(РезультатПроверки.ТекстСообщения);
	КонецЕсли;
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = Версия();
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.ВерсияБСП	= СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	
	// Открытие формы
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = Метаданные().Синоним + " (настройки)";
	Команда.Идентификатор = Метаданные().ПолноеИмя();
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Ложь;
	
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция Версия() Экспорт
	
	Возврат "1.00";
	
КонецФункции 

Процедура УстановитьНастройки(НастройкиОбработки) Экспорт
	
КонецПроцедуры

Процедура ВыполнитьДополнительныеДействия(ПараметрыОбработки, Отказ = Ложь) Экспорт
	
	Если Отказ Или Не ПараметрыОбработки.Свойство("ВидДопДействия") Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
  		
	// Блок 1. Операции по портфелю. Выполняются отдельно по каждому портфелю за дату.			
	Если ПараметрыОбработки.ВидДопДействия = "ПередВыполнениемВсехРегламентныхОперацийПоПортфелю" Тогда  
		
	ИначеЕсли ПараметрыОбработки.ВидДопДействия = "ПослеВыполненияВсехРегламентныхОперацийПоПортфелю" Тогда
			
	// Блок 2. Операции сразу по всем портфелям за весь выбранный период. 
	// Выполнять с осторожностью. Только для операций не зависящих от остатков в базе (например первичка).
	// т.к.при выполнении за период или перепроведении они выполнятся только один раз перед первым периодом а в след. периодах данные могут измениться.   
	
	ИначеЕсли ПараметрыОбработки.ВидДопДействия = "ПередВыполнениемВсехРегламентныхОпераций" Тогда 
		
	ИначеЕсли ПараметрыОбработки.ВидДопДействия = "ПослеВыполненияВсехРегламентныхОпераций" Тогда 	
		
		
	ИначеЕсли ПараметрыОбработки.ВидДопДействия = "ПриФормированииПланаРегламентныхОперацийЗаДень" Тогда
		ПриФормированииПланаРегламентныхОперацийЗаДень (ПараметрыОбработки, Отказ)
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Перед выполнением всех регламентных операций по портфелю

// После выполнения всех регламентных операций по портфелю
// ...

// Перед выполнением всех регламентных операций
// ...

// После выполнения всех регламентных операций 

Процедура ПриФормированииПланаРегламентныхОперацийЗаДень(ПараметрыОбработки, Отказ = Ложь)
	
	// Здесь вносим наш код, таблица хранится в ПараметрыОбработки.ПланРегламентныхОпераци
	
КонецПроцедуры

// Прочее
  
Функция ПроверитьСовместимость()
	
	РезультатПроверки = Новый Структура("Отказ, ТекстСообщения", Ложь, "");
	
	// Проверка конфигурации
	Если Лев(Метаданные.Имя, 3) <> "ДУ" Тогда 
		ТекстСообщения = НСтр("ru='Обработка предназначена для конфигурации ""Аванкор: Доверительное управление"".'; 
		|en='The processing is for the configuration ""Avancore: Trust management"".'");
		ОбщегоНазначенияДУ.ДобавитьТекстКСообщению(РезультатПроверки.ТекстСообщения,ТекстСообщения,,РезультатПроверки.Отказ); 
	КонецЕсли;
	
	// Проверка минимальной версии
	МинимальнаяВерсия = "2.8.2.13";
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Метаданные.Версия, МинимальнаяВерсия) < 0 Тогда 
		ТекстСообщения = СтрШаблон(НСтр("ru='Обработка предназначена для версии конфигурации %1 или старше.'; 
		|en='The processing is intended for configuration version %1 or older.'"), МинимальнаяВерсия);
		ОбщегоНазначенияДУ.ДобавитьТекстКСообщению(РезультатПроверки.ТекстСообщения,ТекстСообщения,,РезультатПроверки.Отказ); 
	КонецЕсли;	
	
	Возврат РезультатПроверки;
	
КонецФункции // ()

#КонецОбласти