#Область ОписаниеПеременных

&НаСервере
Перем ДевятьЧасов;				// Время по-умолчанию

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Объект.Проверка Тогда
			Отказ = Истина;
		КонецЕсли;
		
		УстановитьНомерДокументаСервер();
		ЗаполнитьШапкуДокументаСервер();
		
	КонецЕсли;
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СчетДепоПриИзменении(Элемент)
	СчетДепоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СчетДепоПриИзмененииНаСервере()
	Объект.ВладелецСчета = Объект.СчетДепо.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
	УстановитьНомерДокументаСервер();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	Адрес = АдресПечатнойФормыСервер();
	Описатель = ПолучитьИзВременногоХранилища(Адрес);
	Если Описатель.Свойство("Ошибка") Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Описатель.Ошибка;
		Сообщение.Сообщить();
	Иначе
		Если ЕстьПравоНаПечать() Тогда
			Описатель.ТабДок.Показать(Описатель.Заголовок);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЕстьПравоНаПечать()
	
	Если Не Справочники.Контрагенты.ОсобыеУсловия(Объект.ВладелецСчета)
		Или РегистрыСведений.ОтветственныеЛицаОрганизаций.ПользовательМожетРедактироватьОсобыеУсловия() Тогда 
		Возврат Истина;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Особые условия: " + Объект.ВладелецСчета
		+ ". Выполнение операции доступно Ответственному за особых клиентов");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ЖурналОтправлений(Команда)
	
	Если Объект.Ссылка <> Неопределено Тогда
		
		ОтправленоВЭДО = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("83.СводныеОтчетыВЭДОилиВKafka", 0) = 0;
		Если ОтправленоВЭДО Тогда
			ОтборПоДокументу = Новый Структура("Документ", Объект.Ссылка);
			ИмяРегистра = "РегистрацияДокументовВЭДО";
		Иначе
			ОтборПоДокументу = Новый Структура("ОтправляемыйОбъект", Объект.Ссылка);
			ИмяРегистра = "ЖурналИсходящихСообщенийKafka";
		КонецЕсли;
		ПараметрыФормы = Новый Структура("Отбор", ОтборПоДокументу);
		ОткрытьФорму("РегистрСведений." + ИмяРегистра + ".ФормаСписка", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция АдресПечатнойФормыСервер()
	Возврат Документы.СводныйОтчетОСовершенныхОперациях.АдресПечатнойФормы(
		Объект.Ссылка,
		Неопределено,
		Ложь,
		ЭтаФорма.УникальныйИдентификатор);
КонецФункции

&НаСервере
Процедура ЗаполнитьШапкуДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ОбщегоНазначения.ЗаполнитьШапкуДокумента(ТекущийОбъект, ПараметрыСеанса.ТекущийПользователь);
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Если НачалоДня(ТекущийОбъект.Дата) = ТекущийОбъект.Дата Тогда
		
		ТекущееВремя = ТекущаяДатаСеанса() - НачалоДня(ТекущаяДатаСеанса());
		ТекущийОбъект.Дата = ТекущийОбъект.Дата + ТекущееВремя;
		
	КонецЕсли;
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура УстановитьНомерДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Дата) Тогда
		ТекущийОбъект.Дата = НачалоДня(ТекущаяДатаСеанса()) + ДевятьЧасов;
	КонецЕсли;
	ТекущийОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

#КонецОбласти

#Область Инициализация

ДевятьЧасов 		= 32400;

#КонецОбласти