
// Обработчик события ПередЗаписью документов, 
// выписка по которым формируется автоматически.

Процедура ПриПроведенииДокументовФормированиеВыписки(Источник, Отказ, РежимПроведения) Экспорт
	Если (ТипЗнч(Источник) = Тип("ДокументОбъект.ОткрытиеРазделаСчетаДепо")
			Или ТипЗнч(Источник) = Тип("ДокументОбъект.ЗакрытиеРазделаСчетаДепо"))	
		И ЗначениеЗаполнено(Источник.СчетДепо)
		И ТипЗнч(Источник.СчетДепо) = Тип("СправочникСсылка.СчетаДепоМХ")
		И ЗначениеЗаполнено(Источник.СчетДепо.ВладелецСчетаДепоМХ)
		И ТипЗнч(Источник.СчетДепо.ВладелецСчетаДепоМХ) = Тип("СправочникСсылка.Организации") Тогда
		Возврат;	// Выписку формировать не нужно, т.к. выписка дается клиенту, а тут мы и есть клиент
	КонецЕсли;
	
	// Формируем выписку
	Если ЗначениеЗаполнено(Источник.Ссылка) Тогда
		ДокументВыписка = Документы.Выписка.НайтиПоРеквизиту("ОперацияЦБ", Источник.Ссылка);
	Иначе
		СсылкаНового = Документы[Источник.Метаданные().Имя].ПолучитьСсылку();
		Источник.УстановитьСсылкуНового(СсылкаНового);
		ДокументВыписка = Документы.Выписка.ПустаяСсылка();
	КонецЕсли;
	
	ОтключитьФормированиеВыписки =
		ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("83.ФормированиеСводныхОтчетовОСовершенныхОперациях", Ложь)
		И ТипЗнч(Источник) <> Тип("ДокументСсылка.ФормированиеОтчетаВыписки")
		И ТипЗнч(Источник) <> Тип("ДокументОбъект.ФормированиеОтчетаВыписки");
	Если ОтключитьФормированиеВыписки Тогда
		
		Документы.СводныйОтчетОСовершенныхОперациях.ИсполнитьПоручениеВыпиской(Источник);
		
	Иначе
		
		Если ДокументВыписка.Пустая() Тогда
			ДокументВыписка = Документы.Выписка.СоздатьДокумент();
		Иначе
			ДокументВыписка = ДокументВыписка.ПолучитьОбъект();
		КонецЕсли;
		ДокументВыписка.Заполнить(Источник);
		ДокументВыписка.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалениеВыписокПриПометкеНаУдалениеПриЗаписи(Источник, Отказ) Экспорт
	Если Источник.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Выписка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Выписка КАК Выписка
	|ГДЕ
	|	Выписка.ОперацияЦБ = &Ссылка
	|ИЛИ
	|	Выписка.ДокументОснование = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Удалить();
	КонецЦикла;
КонецПроцедуры

// Процедура выполняет проверку необходимости перенумерации документов типа источника за день
// в случае необходимости выполняется регистрация типа документа в регистре сведений "РегистрацияДокументовКПеренумерации"
Процедура ДокументыКПеренумерацииПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ДополнительныеСвойства.Свойство("ОнлайнЗагрузка") Или Источник.ДополнительныеСвойства.Свойство("Перенумерация") Тогда
		Возврат;  // отключение регистрации документов в режиме загрузки или перенумерации
	КонецЕсли;		
		
	ИмяИсточника = Источник.Метаданные().Имя;
	Менеджер = РегистрыСведений.РегистрацияДокументовКПеренумерации;
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Источник.Ссылка) Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Менеджер.ЗарегистрироватьДокументыКПеренумерации(ИмяИсточника, Источник.Дата);
		КонецЕсли;
	ИначеЕсли  Источник.Ссылка.Проведен Или Источник.Проведен Тогда 
		Если Источник.Ссылка.Дата <> Источник.Дата Тогда 
			Менеджер.ЗарегистрироватьДокументыКПеренумерации(ИмяИсточника,Источник.Ссылка.Дата);
		КонецЕсли;	
		Менеджер.ЗарегистрироватьДокументыКПеренумерации(ИмяИсточника,Источник.Дата);
	КонецЕсли;	 
	
КонецПроцедуры	 

Процедура ПередЗаписьюДокументовДляОбмена(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ПередУдалениемДокументовДляОбмена(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением(Источник, Отказ);
КонецПроцедуры

Процедура ПередЗаписьюСправочниковДляОбменаПередЗаписью(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью(Источник, Отказ);
КонецПроцедуры

Процедура ПередЗаписьюНабораДляОбменаПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра(Источник, Отказ, Истина);
	
КонецПроцедуры

Процедура ПередЗаписьюДокументовУстановитьАвтора(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоНовый() Тогда
		Источник.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаКомментарияКИсторииДанных(Источник, Отказ) Экспорт
	Если Источник.ДополнительныеСвойства.Свойство("КомментарийДляИсторииДанных") Тогда
		Источник.УстановитьКомментарийВерсииИсторииДанных(Источник.ДополнительныеСвойства.КомментарийДляИсторииДанных);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписиДокументовДляДобавленияВЖурналИсходящихСообщенийКафкаПриЗаписи(Источник, Отказ) Экспорт
	ОбменДаннымиКафка.ЗаписатьОбъектВИсходящиеСообщенияКафкаПриЗаписиДокумента(Источник);
КонецПроцедуры

