
#Область ПрограммныйИнтерфейс

// Процедура для обработки сообщений Request от Kafka
//
// Параметры:
//  Выборка	 - ВыборкаИзРезультатаЗапроса - Выборка данных из РС ЖурналВходящихСообщенийKafka
//
Процедура ВыполнитьСоздание(Выборка) Экспорт
	
	ИмяСобытия = "ОбработкаВнешнихЗапросовRequest";
	Сообщение = РаботаСJSON.РезультатЧтенияJSON(Выборка.Сообщение);
	ТекстОшибки = "";
	Попытка
		MessageInfo = ОбменДаннымиКафка.ДанныеMessageInfo();
		ОбменДаннымиКафка.ПодготовитьMessageInfo(Сообщение.MessageInfo, MessageInfo, ИмяСобытия, ТекстОшибки);
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		MessageInfo.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ТекстОшибки = "";
		ПроверитьData(Сообщение, ТекстОшибки);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ВызватьИсключение "Не заполнены обязательные поля JSON.";
		КонецЕсли;
		
		ТекстОшибки = "";
		СоздатьПорученияНаПереводЦБ(Сообщение.Data, ТекстОшибки);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ВызватьИсключение "При создании поручения на перевод ЦБ произошли ошибки";
		Иначе
			РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗавершитьОбработку(Выборка.ВнешнийИсточник, Выборка.Идентификатор);
		КонецЕсли;
		
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()) + Символы.ПС + ТекстОшибки;
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		MessageInfo.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьData(ДанныеИзJSON, ТекстОшибки)
	
	ОбязательныеПоля = "ObjectVersion,OperationNum,Date,DepoId,CrmClientId,ContractNumber,DepoDivisionCode,DepoMxDivisionCode,GetCrmClientId,
		|GetContractNumber,GetDepoDivisionCode,GetDepoMxDivisionCode,Asset";
	ОбязательныеПоля = СтрЗаменить(ОбязательныеПоля, Символы.ПС, "");
	РаботаСJSON.ПроверитьОбязательныеПоля(ДанныеИзJSON.Data, ОбязательныеПоля, ТекстОшибки);
	
	ОбязательныеПоля = "Qty";
	РаботаСJSON.ПроверитьОбязательныеПоля(ДанныеИзJSON.Data.Asset, ОбязательныеПоля, ТекстОшибки);
	
КонецПроцедуры

Процедура СоздатьПорученияНаПереводЦБ(Data, ТекстОшибки)
	
	ТекДата = ТекущаяДатаСеанса();
	Списание = Перечисления.ТипыПереводов.Списание;
	Зачисление = Перечисления.ТипыПереводов.Зачисление;
	НомерПорученияВБО1 = Data.Trades.ExternalId;
	НомерПорученияВБО2 = Data.Trades.GetExternalId;
	
	КодРазделаСчетаДепоДепонента = Data.DepoDivisionCode;
	КодРазделаСчетаДепоМХДепонента = Data.DepoMxDivisionCode;
	ДанныеДепонента = ДанныеПоСчетамИРазделам(КодРазделаСчетаДепоДепонента, КодРазделаСчетаДепоМХДепонента);
	РазделСчДепоМХДепонента = ДанныеДепонента.РазделСчетаДЕПОМХ;
	РазделСчДепоМХРазделаСчДепонента = ДанныеДепонента.РазделСчетаДЕПО.РазделСчетаДепоМХ;
	ВладелецРазделаСчДепоМХРазделаСчДепонента = РазделСчДепоМХРазделаСчДепонента.Владелец;
	ВладелецРазделаСчДепоМХДепонента = РазделСчДепоМХДепонента.Владелец;
	
	// Проверить привязку раздела счета ДЕПО МХ в разделе счета ДЕПО Депонента к разделу счета ДЕПО МХ
	Если РазделСчДепоМХДепонента <> РазделСчДепоМХРазделаСчДепонента Тогда
			ТекстОшибки = ("Внимание! Раздел счета ДЕПО МХ " + РазделСчДепоМХДепонента
								+ " не привязан к разделу счета ДЕПО МХ " + РазделСчДепоМХРазделаСчДепонента 
								+ " по счету ДЕПО " + ДанныеДепонента.РазделСчетаДЕПО);
		ОтправитьУведомлениеООтсутствииПривязкиРазделаСчДепоКРазделуСчДЕПОМХ(ТекстОшибки);
	КонецЕсли;
	
	КодРазделаСчетаДепоКонтрагента = Data.GetDepoDivisionCode;
	КодРазделаСчетаДепоМХКонтрагента = Data.GetDepoMxDivisionCode;
	ДанныеКонтрагента = ДанныеПоСчетамИРазделам(КодРазделаСчетаДепоКонтрагента, КодРазделаСчетаДепоМХКонтрагента);
	РазделСчДепоМХКонтрагента = ДанныеКонтрагента.РазделСчетаДЕПОМХ;
	РазделСчДепоМХРазделаСчКонтрагента = ДанныеКонтрагента.РазделСчетаДЕПО.РазделСчетаДепоМХ;
	ВладелецРазделаСчДепоМХРазделаСчКонтрагента = РазделСчДепоМХРазделаСчКонтрагента.Владелец;
	ВладелецРазделаСчДепоМХКонтрагента = РазделСчДепоМХКонтрагента.Владелец;
	
	// Проверить привязку раздела счета ДЕПО МХ в разделе счета ДЕПО контрагента к разделу счета ДЕПО МХ
	Если РазделСчДепоМХКонтрагента <> РазделСчДепоМХРазделаСчКонтрагента Тогда
			ТекстОшибки = ("Внимание! Раздел счета ДЕПО МХ " + РазделСчДепоМХКонтрагента + Символы.ПС
						+ "не привязан к разделу счета ДЕПО МХ " + РазделСчДепоМХРазделаСчКонтрагента 
						+ " по счету ДЕПО " + ДанныеКонтрагента.РазделСчетаДЕПО);
		ОтправитьУведомлениеООтсутствииПривязкиРазделаСчДепоКРазделуСчДЕПОМХ(ТекстОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		ПоручениеСписание = СоздатьПереводЦБ(Data, Списание, ТекДата, НомерПорученияВБО1, ДанныеДепонента, ДанныеКонтрагента, ТекстОшибки);
		ПоручениеЗачисление = СоздатьПереводЦБ(Data, Зачисление, ТекДата, НомерПорученияВБО2, ДанныеДепонента, ДанныеКонтрагента, ТекстОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		ТекстПисьмаОНеравенстве = "";
		// Проверить равенство счетов ДЕПО МХ Депонента и Контрагента
		Если ВладелецРазделаСчДепоМХДепонента <> ВладелецРазделаСчДепоМХКонтрагента Тогда
			ТекстПисьмаОНеравенстве = ("Внимание! Счет ДЕПО МХ Депонента" + ВладелецРазделаСчДепоМХДепонента.Код
			+ " не равен счету ДЕПО МХ Контрагента" + ВладелецРазделаСчДепоМХКонтрагента.Код) + Символы.ПС;
		КонецЕсли;
		
		// Проверить равенство разделов счетов ДЕПО МХ Депонента и Контрагента
		Если КодРазделаСчетаДепоДепонента <> КодРазделаСчетаДепоКонтрагента Тогда
			ТекстПисьмаОНеравенстве = ТекстПисьмаОНеравенстве + ("Внимание! Раздел счета ДЕПО МХ Депонента" + КодРазделаСчетаДепоДепонента
			+ " не равен разделу счета ДЕПО МХ Контрагента" + КодРазделаСчетаДепоКонтрагента) + Символы.ПС;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстПисьмаОНеравенстве) Тогда
			ТекстПисьмаОНеравенстве = ТекстПисьмаОНеравенстве + "Поручение на списание № " + ПоручениеСписание.Номер;
			ОтправитьУведомлениеОНеравенствеСчетовРазделовМХПереводаЦБ(ТекстПисьмаОНеравенстве);
		КонецЕсли;
			
		ОтправитьУведомлениеОЗагруженныхПорученияхПоМежклиентскойСделке(ПоручениеСписание, ПоручениеЗачисление);
		
		ПоручениеСписание.ДополнительныеСвойства.Вставить("ПереводЦБПоМежклиентскойСделкеПоДаннымКафка");
		ЗаписатьИлиПровестиПоручениеНаПереводЦБ(ПоручениеСписание, ТекстОшибки, РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьПереводЦБ(Data, ТипПеревода, Дата, НомерПорученияВБО, ДанныеДепонента, ДанныеКонтрагента, ТекстОшибки)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Поручение.Ссылка КАК Поручение
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.НомерПорученияВБО = &НомерПорученияВБО
	|	И НЕ Поручение.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НомерПорученияВБО", НомерПорученияВБО);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПоручениеОбъект = Выборка.Поручение.ПолучитьОбъект();
	Иначе
		ПоручениеОбъект = Документы.Поручение.СоздатьДокумент();
	КонецЕсли;
	ПоручениеОбъект.ВидОперацииД = Справочники.ВидыОпераций.Перевод;
	ПоручениеОбъект.Инициатор = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ОрганизацияПоУмолчанию");
	ПоручениеОбъект.ТипПеревода = ТипПеревода;
	ПоручениеОбъект.Дата = Дата;
	ВидИнициатораБрокер = 1;
	ПоручениеОбъект.ВидИнициатора = ВидИнициатораБрокер;
	ПоручениеОбъект.НомерПорученияВБО = НомерПорученияВБО;
	ДатаСделки = ПрочитатьДатуJSON(Data.Date, ФорматДатыJSON.ISO);
	ПоручениеОбъект.ДатаСделки = ДатаСделки;
	Если ТипПеревода = Перечисления.ТипыПереводов.Списание Тогда
		ПланируемаяДатаРасчетов = ПрочитатьДатуJSON(Data.DocDate, ФорматДатыJSON.ISO);
	ИначеЕсли ТипПеревода = Перечисления.ТипыПереводов.Зачисление Тогда
		ПланируемаяДатаРасчетов = ПрочитатьДатуJSON(Data.GetDocDate, ФорматДатыJSON.ISO);
	Иначе
		ТекстОшибки = ТекстОшибки + "Не корректный Тип перевода: " + ТипПеревода;
	КонецЕсли;
	ПоручениеОбъект.ПланируемаяДатаРасчетов = ПланируемаяДатаРасчетов;
	
	НомерСделки = СтроковыеФункцииКлиентСервер.СтрокаТолькоДопустимыхСимволов(НомерПорученияВБО, "0123456789");
	ПоручениеОбъект.Комментарий = СтрШаблон("Сделка №%1 от %2", НомерСделки, Формат(ДатаСделки, "ДФ=dd.MM.yyyy"));
	
	Депонент = Справочники.Контрагенты.КлиентПоCrmContractNumber(Data.ContractNumber);
	Контрагент = Справочники.Контрагенты.КлиентПоCrmContractNumber(Data.GetContractNumber);
	
	ПоручениеОбъект.Депонент = Депонент;
	ПоручениеОбъект.СчетДепо = ДанныеДепонента.СчетДепо;
	ПоручениеОбъект.РазделСчетаДепо = ДанныеДепонента.РазделСчетаДепо;
	ПоручениеОбъект.СчетДепоМХ = ДанныеДепонента.СчетДепоМХ;
	ПоручениеОбъект.РазделСчетаДепоМХ = ДанныеДепонента.РазделСчетаДепоМХ;
	ПоручениеОбъект.МХДепонента = ДанныеДепонента.МестоХранения;
		
	ПоручениеОбъект.Контрагент = Контрагент;
	ПоручениеОбъект.СчетДепоКонтрагента = ДанныеКонтрагента.СчетДепо;
	ПоручениеОбъект.РазделСчетаДепоКонтрагента = ДанныеКонтрагента.РазделСчетаДепо;
	ПоручениеОбъект.СчетДепоМХКонтрагента = ДанныеКонтрагента.СчетДепоМХ;
	ПоручениеОбъект.РазделСчетаДепоМХКонтрагента = ДанныеКонтрагента.РазделСчетаДепоМХ;
	ПоручениеОбъект.МХКонтрагент = ДанныеКонтрагента.МестоХранения;
	
	Если ЗначениеЗаполнено(Data.Asset.NrdCode) Тогда
		ПоручениеОбъект.ЦБ = Справочники.ЦенныеБумаги.ЦеннаяБумагаПоКодуЗагрузкиНДЦ(Data.Asset.NrdCode, Дата);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПоручениеОбъект.ЦБ) Тогда
		ПоручениеОбъект.ЦБ = Справочники.ЦенныеБумаги.ЦеннаяБумагаПоРегНомеруИISIN(Data.Asset.Isin, Data.Asset.RegNum);
	КонецЕсли;
	ПоручениеОбъект.КоличествоЦБ = Data.Asset.Qty;
	
	ЗаписатьИлиПровестиПоручениеНаПереводЦБ(ПоручениеОбъект, ТекстОшибки);
	
	Возврат ПоручениеОбъект;
	
КонецФункции

Процедура ЗаписатьИлиПровестиПоручениеНаПереводЦБ(ПоручениеОбъект, ТекстОшибки, РежимЗаписи = Неопределено)
	Попытка
		ПоручениеОбъект.Записать(РежимЗаписи);
	Исключение
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки);
		ТекстОшибки = ?(ЗначениеЗаполнено(ТекстОшибки), Символы.ПС, "") + ПодробноеПредставлениеОшибки;
	КонецПопытки;
КонецПроцедуры

Функция ДанныеПоСчетамИРазделам(КодРазделаСчетаДепо, КодРазделаСчетаДепоМХ)
	
	ДанныеПоСчетамИРазделам = Новый Структура("СчетДепо, РазделСчетаДепо, СчетДепоМХ, РазделСчетаДепоМХ, МестоХранения");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РазделыСчетаДепо.Ссылка КАК РазделСчетаДепо,
	|	РазделыСчетаДепо.Владелец КАК СчетДепо
	|ПОМЕСТИТЬ ДанныеСчетаДепо
	|ИЗ
	|	Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
	|ГДЕ
	|	РазделыСчетаДепо.Код = &КодРазделаСчетаДепо
	|	И НЕ РазделыСчетаДепо.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РазделыСчетаДепоМХ.Ссылка КАК РазделСчетаДепоМХ,
	|	РазделыСчетаДепоМХ.Владелец КАК СчетДепоМХ,
	|	РазделыСчетаДепоМХ.Владелец.Владелец КАК МестоХранения
	|ПОМЕСТИТЬ ДанныеСчетаДепоМХ
	|ИЗ
	|	Справочник.РазделыСчетаДепоМХ КАК РазделыСчетаДепоМХ
	|ГДЕ
	|	РазделыСчетаДепоМХ.Код = &КодРазделаСчетаДепоМХ
	|	И НЕ РазделыСчетаДепоМХ.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСчетаДепо.СчетДепо КАК СчетДепо,
	|	ДанныеСчетаДепо.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ДанныеСчетаДепоМХ.СчетДепоМХ КАК СчетДепоМХ,
	|	ДанныеСчетаДепоМХ.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ДанныеСчетаДепоМХ.МестоХранения КАК МестоХранения
	|ИЗ
	|	ДанныеСчетаДепо КАК ДанныеСчетаДепо,
	|	ДанныеСчетаДепоМХ КАК ДанныеСчетаДепоМХ";
	
	Запрос.УстановитьПараметр("КодРазделаСчетаДепо", КодРазделаСчетаДепо);
	Запрос.УстановитьПараметр("КодРазделаСчетаДепоМХ", КодРазделаСчетаДепоМХ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеПоСчетамИРазделам, Выборка);
	КонецЕсли;
	
	Возврат ДанныеПоСчетамИРазделам;

КонецФункции

// Процедура отправляет уведомление о недостаточном остатке для перевода ЦБ
//
// Параметры:
//  ТекстПисьма - Строка - текст письма
// 
Процедура ОтправитьУведомлениеООтсутствииПривязкиРазделаСчДепоКРазделуСчДЕПОМХ(ТекстПисьма)
	
	ПВХ = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийООтсутствииПривязкиРазделаСчетаДепоКРазделуСчетаДепоМХ;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПВХ).Настройка;
	Если НастройкиОбмена = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось получить параметры внешнего источника """ + ПВХ + """");
		Возврат;
	КонецЕсли;
	
	ТемаПисьма = "Отсутствие привязки раздела счета ДЕПО к разделу счета ДЕПО МХ";
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКОтправке(ПараметрыУведомления);
КонецПроцедуры

// Процедура отправляет уведомление о загруженных поручениях на перевод ЦБ по межклиентской сделке
//
// Параметры:
//  ПоручениеСписание - Ссылка - ссылка на поручение на списание ЦБ
//  ПоручениеЗачисление - Ссылка - ссылка на поручение на зачисление ЦБ
// 
Процедура ОтправитьУведомлениеОЗагруженныхПорученияхПоМежклиентскойСделке(ПоручениеСписание, ПоручениеЗачисление)
	
	ПВХ = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОЗагруженныхПорученияхПоМежклиентскойСделке;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПВХ).Настройка;
	Если НастройкиОбмена = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось получить параметры внешнего источника """ + ПВХ + """");
		Возврат;
	КонецЕсли;
	
	ТемаПисьма = "Поручения на Перевод ЦБ по межклиентским ОТС сделкам загружены";
	ТекстПисьма = "Поручение на списание № " + ПоручениеСписание.Номер + " от " + ПоручениеСписание.Дата + Символы.ПС;
	ТекстПисьма = ТекстПисьма + "Поручение на зачисление № " + ПоручениеЗачисление.Номер + " от " + ПоручениеЗачисление.Дата + Символы.ПС;
	ТекстПисьма = ТекстПисьма + "Счет ДЕПО Депонента: " + ПоручениеСписание.СчетДепо + Символы.ПС;
	ТекстПисьма = ТекстПисьма + "Счет ДЕПО Контрагента: " + ПоручениеСписание.СчетДепоКонтрагента + Символы.ПС;
	ТекстПисьма = ТекстПисьма + "ЦБ: " + ПоручениеСписание.ЦБ + Символы.ПС;
	ТекстПисьма = ТекстПисьма + "Количество ЦБ: " + ПоручениеСписание.КоличествоЦБ;

	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКОтправке(ПараметрыУведомления);
КонецПроцедуры

// Процедура отправляет уведомление о неравенстве счетов или разделов ДЕПО МХ в поручении на Перевод ЦБ
//
// Параметры:
//  ТекстПисьма - Строка - текст письма
// 
Процедура ОтправитьУведомлениеОНеравенствеСчетовРазделовМХПереводаЦБ(ТекстПисьма)
	
	ПВХ = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОНеравенствеСчетовРазделовМХПереводаЦБ;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПВХ).Настройка;
	Если НастройкиОбмена = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось получить параметры внешнего источника """ + ПВХ + """");
		Возврат;
	КонецЕсли;

	ТемаПисьма = "В поручениях на Перевод ЦБ по межклиентским ОТС сделкам счета или разделы МХ отличаются";
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКОтправке(ПараметрыУведомления);
КонецПроцедуры

#КонецОбласти
