
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Период") Тогда
		Объект.ПериодОтбора = Параметры.Период;
		Объект.ПериодРасчета = КонецМесяца(Параметры.Период.ДатаОкончания);
	Иначе
		ВыполнитьМетодОбъекта("ИнициироватьПараметры");
	КонецЕсли;
	
	Если Параметры.Свойство("Контрагент") Тогда
		Объект.Контрагент = Параметры.Контрагент;
	КонецЕсли;
	
	Объект.РежимОтчета = Истина;
	
	СхемаКомпоновки = Обработки.ФормированиеУслугДепозитария.ПолучитьМакет("МакетОснованияУслуг");
	АдресСхемыКомпоновки = ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновки);
	Объект.КомпоновщикНастроекОтчета.Инициализировать(ИсточникНастроек);
	Объект.КомпоновщикНастроекОтчета.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ВыполнитьМетодОбъекта("СформироватьОтчетПоОснованиям");
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьМетодОбъекта(ИмяМетода, ПараметрыМетода = "")
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Выполнить("Обработка." + ИмяМетода + "(" + ПараметрыМетода + ")");
	ЗначениеВРеквизитФормы(Обработка, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтбораПриИзменении(Элемент)
	
	Объект.ПериодРасчета = КонецМесяца(Объект.ПериодОтбора.ДатаОкончания);
	
КонецПроцедуры
