

//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Запись.Боевая Тогда
		ТипСреды = 1;
	Иначе
		ТипСреды = 2;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
Если ТипСреды = 1 Тогда
		Запись.Боевая = Истина;
	ИначеЕсли ТипСреды = 2 Тогда
		Запись.Боевая = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗагрузитьНастройкиИБНаСервере(ТекущийОбъект);
	ЗагрузитьНастройкиКодированияНаСервере(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	НастройкиКодирование = ТекущийОбъект.НастройкиКодирования.Получить();
	АдресНастроек = ПоместитьВоВременноеХранилище(НастройкиКодирование,Новый УникальныйИдентификатор);
	Настройки = ТекущийОбъект.ЗначениеНастройки.Получить();
	Адрес = ПоместитьВоВременноеХранилище(Настройки,Новый УникальныйИдентификатор);
	
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьНастройкиИБ(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Фильтр = "Файл настроек (*.xml)|*.xml";

	ДиалогОткрытияФайла.Заголовок = "Выберите файл настроек";
	Если Не ДиалогОткрытияФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
	Данные = Новый ДвоичныеДанные(ИмяФайла);
	Адрес = ПоместитьВоВременноеХранилище(Данные, Новый УникальныйИдентификатор);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьНастройкиКодирования(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Фильтр = "Файл настроек (*.cod)|*.cod";
	ДиалогОткрытияФайла.Заголовок = "Выберите файл настроек";
	Если Не ДиалогОткрытияФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
	Данные = Новый ДвоичныеДанные(ИмяФайла);
	АдресНастроек = ПоместитьВоВременноеХранилище(Данные, Новый УникальныйИдентификатор);
		
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНастройкиКодированияНаСервере(ТекущийОбъект)
	
	Данные = ПолучитьИзВременногоХранилища(АдресНастроек);
	Хранилище = Новый ХранилищеЗначения(Данные);
	
	ТекущийОбъект.НастройкиКодирования = Хранилище;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиИБНаСервере(ТекущийОбъект)
	
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	Хранилище = Новый ХранилищеЗначения(Данные);
	
	ТекущийОбъект.ЗначениеНастройки = Хранилище;
	
КонецПроцедуры

//#КонецОбласти
