
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ИнициализироватьНастройки();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОчиститьПрогресс();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьПрогресс();
	Для Каждого Строка Из Объект.ДанныеОчистки Цикл
		Если Строка.ФлагОчистки Тогда
			Строка.Прогресс = "Очищается...";
			ОбновитьОтображениеДанных();
			КоличествоСтрок = 0;
			ОчиститьРегистрНаСервере(Строка.ИмяРегистра, Строка.ДатаОчистки, Строка.ПолеОтбора, КоличествоСтрок);
			Строка.Прогресс = "Готово";
			ОбновитьОтображениеДанных();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОчиститьРегистрНаСервере(ИмяРегистра, ДатаОчистки, ПолеОтбора, КоличествоСтрок)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОчиститьРегистр(ИмяРегистра, ДатаОчистки, ПолеОтбора, КоличествоСтрок);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПрогресс()
	Для Каждого Строка Из Объект.ДанныеОчистки Цикл
		Строка.Прогресс = "";
	КонецЦикла;
КонецПроцедуры
