
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.НастройкиАлгоритма) = Тип("Структура") Тогда
		Настройки = Параметры.НастройкиАлгоритма;
		
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.УстановитьПользовательскиеНастройки(Настройки);
		
		ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьПараметры(Заголовок)
	
	ОбъектОбрабоки = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектОбрабоки.УстановитьПараметры(Заголовок);
	
КонецФункции 

&НаСервере
Процедура НастройкиПоУмолчаниюНаСервере()    
	
	ОбъектОбрабоки = РеквизитФормыВЗначение("Объект");
	ОбъектОбрабоки.НастройкиПоУмолчанию(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоУмолчанию(Команда) 
	
	НастройкиПоУмолчаниюНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	Перем ЗначенияПараметров;
	
	ЭтаФорма.Заголовок = "";
	
	ЗначенияПараметров = УстановитьПараметры(ЭтаФорма.Заголовок);
	ОповеститьОВыборе(Новый Структура("Значения, ЗаголовокНастроек", ЗначенияПараметров, ЭтаФорма.Заголовок));
	
КонецПроцедуры

