#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущаяДата = ТекущаяДатаСеанса();
	Объект.НачалоПериода = ТекущаяДата;
	Объект.КонецПериода = ТекущаяДата;
	
	ИсточникиКотировок = Обработки.ВыгрузкаНКДВBackQort.ВыгружаемыеИсточникиКотировок();
	Элементы.Биржа.СписокВыбора.ЗагрузитьЗначения(ИсточникиКотировок);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьВBackQort(Команда)
	Если ПроверитьЗаполнение() Тогда
		ВыгрузитьНаСервереВBackQort();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВыгрузкиКотировок(Команда)
	ОткрытьФорму("Обработка.ВыгрузкаНКДВBackQort.Форма.ФормаПараметрыВыгрузкиКотировок", , , , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыгрузитьНаСервереВBackQort()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьВBackQort();
КонецПроцедуры

#КонецОбласти