
&НаКлиенте
Процедура КомандаЗагрукаИПодборЦБ(Команда)
	
	СписокДоступныхВидовПоиска = Новый СписокЗначений();
	СписокДоступныхВидовПоиска.Добавить("Код", "Код ЦБ");
	СписокДоступныхВидовПоиска.Добавить("Наименование", "Наименование ЦБ");
	СписокДоступныхВидовПоиска.Добавить("ISIN", "ISIN");
	СписокДоступныхВидовПоиска.Добавить("НомерРегистрации", "Номер гос. регистрации");
	
	РеквизитДляПоискаЭлементов = СписокДоступныхВидовПоиска.ВыбратьЭлемент("Выберите реквизит для поиска");
	
	Если НЕ РеквизитДляПоискаЭлементов = Неопределено Тогда
		
		СписокПолученныхДанных = ЗагрузкаИзБуфера();
		
		ПодобратьИСообщитьОВыборе(СписокПолученныхДанных, РеквизитДляПоискаЭлементов.Значение);
			
	КонецЕсли;
	
КонецПроцедуры

// возвращает список строковых данных
&НаКлиенте
Функция ЗагрузкаИзБуфера()  
	Перем Результат;
	
	Результат = Новый СписокЗначений();
	
	Объект = ПолучитьCOMОбъект("", "htmlfile");
	Если Объект <> Неопределено Тогда
		Текст = Объект.parentWindow.ClipboardData.getData("Text");
		Счетчик = 0;
		Пока Счетчик < СтрЧислоСтрок(Текст) Цикл
			Строка = СтрПолучитьСтроку(Текст, Счетчик + 1);
			Результат.Добавить(Строка);
			Счетчик = Счетчик + 1;
		КонецЦикла;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

//Подбор и оповещение владельца формы
&НаКлиенте
Процедура ПодобратьИСообщитьОВыборе(СписокОтбора, РеквизитДляОтбора)
	
	ОтобранныеЦБ = РезультатОтбора(СписокОтбора, РеквизитДляОтбора);
	Для Каждого ЦБ Из ОтобранныеЦБ Цикл
		ЭтаФорма.ОповеститьОВыборе(ЦБ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РезультатОтбора(СписокОтбора, РеквизитДляОтбора)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОтбора", СписокОтбора);
	Запрос.УстановитьПараметр("ОтборПоКоду", РеквизитДляОтбора = "Код");
	Запрос.УстановитьПараметр("ОтборПоНаименованию", РеквизитДляОтбора = "Наименование");
	Запрос.УстановитьПараметр("ОтборПоISIN", РеквизитДляОтбора = "ISIN");
	Запрос.УстановитьПараметр("ОтборПоНомеруРегистрации", РеквизитДляОтбора = "НомерРегистрации");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка как Ссылка
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|ГДЕ
	|	ЦенныеБумаги.ПометкаУдаления = ЛОЖЬ
	|	И (ЦенныеБумаги.Код В (&СписокОтбора)
	|				И &ОтборПоКоду
	|			ИЛИ ЦенныеБумаги.Наименование В (&СписокОтбора)
	|				И &ОтборПоНаименованию
	|			ИЛИ ЦенныеБумаги.ISIN В (&СписокОтбора)
	|				И &ОтборПоISIN
	|			ИЛИ ЦенныеБумаги.НомерРегистрации В (&СписокОтбора)
	|				И &ОтборПоНомеруРегистрации)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦенныеБумаги.Наименование";
						  
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
