
#Область ПрограммныйИнтерфейс

// Возвращает сообщения контроля поручений
//
// Параметры:
//  Поручение		 - ДокументСсылка.Поручение	 - Контролируемое поручение
//  СобытияКонтроля	 - ПеречислениеСсылка.СобытияКонтроляПоручений - возможные значения ПриЗаписи, ПриПроведении
//  					или ПриПроведенииСЗапретом или массив из этих значений
// 
// Возвращаемое значение:
//   - Массив - Массив структур с ключами СообщениеКонтроля (строка) и СобытиеКонтроля (строка)
//
Функция СообщенияКонтроляПоручений(Поручение, СобытияКонтроля) Экспорт
	
	СообщенияКонтроля = Новый Массив;
	
	СхемаКомпоновки = Справочники.КонтрольПоручений.ПолучитьМакет("МакетОтбораПоручений");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СобытияКонтроля", СобытияКонтроля);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтрольПоручений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтрольПоручений КАК КонтрольПоручений
	|ГДЕ
	|	НЕ КонтрольПоручений.ПометкаУдаления
	|	И КонтрольПоручений.Актуальность
	|	И КонтрольПоручений.СобытиеКонтроля В (&СобытияКонтроля)";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Попытка
			НастройкиКомпоновки = ВыборкаДетальныеЗаписи.Ссылка.НастройкиСКД.Получить();
			ОбщегоНазначения.УстановитьПараметрыСКД(НастройкиКомпоновки, "КонтролируемоеПоручение", Поручение);
			
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки =
			КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
			ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
			ТаблицаРезультата = Новый ТаблицаЗначений;
			ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
			ПроцессорВывода.Вывести(ПроцессорКомпоновки);
			
			Если ЗначениеЗаполнено(ТаблицаРезультата) Тогда
				СообщенияКонтроляПорученийДобавить(СообщенияКонтроля, Поручение, ВыборкаДетальныеЗаписи.Ссылка, ТаблицаРезультата);
			КонецЕсли;
			
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;
	КонецЦикла;
	
	Возврат СообщенияКонтроля;
	
КонецФункции

// Процедура - Показать сообщения контроля поручений
//
// Параметры:
//  СообщенияКонтроля	 - Массив	 - Массив структур с ключами СообщениеКонтроля (строка)
//										и СобытиеКонтроля (ПеречислениеСсылка.СобытияКонтроляПоручений)
//  ЗапретПроведения	 - Булево	 - Признак отказа от проведения
//
Процедура ПоказатьСообщенияКонтроляПоручений(СообщенияКонтроля, ЗапретПроведения) Экспорт
	
	Для Каждого РезультатКонтроля Из СообщенияКонтроля Цикл
		ТекстСообщенияКонтроля = "КОНТРОЛЬ: " + РезультатКонтроля.СообщениеКонтроля;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияКонтроля);
		Если Не ЗапретПроведения И РезультатКонтроля.СобытиеКонтроля = Перечисления.СобытияКонтроляПоручений.ПриПроведенииСЗапретом Тогда
			ЗапретПроведения = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура СообщенияКонтроляПорученийДобавить(СообщенияКонтроля, Поручение, ТекущийЭлементКонтроля, ТаблицаРезультата)
	
	ШаблонЗапроса =
	"ВЫБРАТЬ
	|	ЦенныеБумагиСписываемые.СчетДепо.Код КАК ЗначениеРеквизита
	|ИЗ
	|	Документ.Поручение.ЦенныеБумагиСписываемые КАК ЦенныеБумагиСписываемые
	|ГДЕ
	|	ЦенныеБумагиСписываемые.Ссылка = &Поручение";
	
	ЦенныеБумагиСписываемыеНомераСтрок = Новый Массив;
	ЦенныеБумагиЗачисляемыеНомераСтрок = Новый Массив;
	ВзятьНомераСтрокТабличнойЧастиПоручения(ТаблицаРезультата, ЦенныеБумагиСписываемыеНомераСтрок, ЦенныеБумагиЗачисляемыеНомераСтрок);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Поручение", Поручение);
	Запрос.УстановитьПараметр("ЦенныеБумагиСписываемыеНомераСтрок", ЦенныеБумагиСписываемыеНомераСтрок);
	Запрос.УстановитьПараметр("ЦенныеБумагиЗачисляемыеНомераСтрок", ЦенныеБумагиЗачисляемыеНомераСтрок);
	
	СообщениеКонтроля = ТекущийЭлементКонтроля.ШаблонСообщения;
	Для Каждого ПеременнаяШаблона Из ТекущийЭлементКонтроля.СоответствияПеременныхШаблонаРеквизитам Цикл
		
		ПозицияВШаблоне = СтрНайти(СообщениеКонтроля, ПеременнаяШаблона.ИмяПеременной);
		Если ПозицияВШаблоне = 0 Тогда
			Продолжить;
		КонецЕсли;
		ДлинаИмениПеременной = СтрДлина(ПеременнаяШаблона.ИмяПеременной);
		
		ЭтоПеременнаяТабличнойЧастиПоручения = Ложь;
		ИмяТабличнойЧастиПоручения = "";
		Для Каждого ТЧ Из Поручение.Метаданные().ТабличныеЧасти Цикл
			ИмяТабличнойЧастиПоручения = ТЧ.Имя;
			ЭтоПеременнаяТабличнойЧастиПоручения = СтрНайти(ПеременнаяШаблона.ПутьКРеквизиту, ИмяТабличнойЧастиПоручения) > 0;
			Если ЭтоПеременнаяТабличнойЧастиПоручения Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЭтоПеременнаяТабличнойЧастиПоручения Тогда
			ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "ЦенныеБумагиСписываемые.СчетДепо.Код", ПеременнаяШаблона.ПутьКРеквизиту);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ГДЕ", "ГДЕ ЦенныеБумагиСписываемые.НомерСтроки В (&ЦенныеБумагиСписываемыеНомераСтрок) И ");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЦенныеБумагиСписываемые", ИмяТабличнойЧастиПоручения);
		Иначе
			ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "ЦенныеБумагиСписываемые.СчетДепо.Код", "Поручение." + ПеременнаяШаблона.ПутьКРеквизиту);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".ЦенныеБумагиСписываемые", "");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЦенныеБумагиСписываемые", "Поручение");
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		ЗначенияПеременной = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗначениеРеквизита"); // BSLLS:CreateQueryInCycle-off
		СтрокаЗамены = СообщенияКонтроляПорученийСтрокаЗамены(ЗначенияПеременной);
		СообщениеКонтроля = Лев(СообщениеКонтроля, ПозицияВШаблоне - 1)
			+ СтрокаЗамены
			+ Сред(СообщениеКонтроля, ПозицияВШаблоне + ДлинаИмениПеременной);
	КонецЦикла;
	
	РезультатКонтроля = Новый Структура;
	РезультатКонтроля.Вставить("СообщениеКонтроля", СообщениеКонтроля);
	РезультатКонтроля.Вставить("СобытиеКонтроля", ТекущийЭлементКонтроля.СобытиеКонтроля);
	РезультатКонтроля.Вставить("ОтправкаУведомленияПоЭлектроннойПочте", ТекущийЭлементКонтроля.ОтправкаУведомленияПоЭлектроннойПочте);
	РезультатКонтроля.Вставить("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	СообщенияКонтроля.Добавить(РезультатКонтроля);
	
КонецПроцедуры

Функция СообщенияКонтроляПорученийСтрокаЗамены(ЗначенияПеременной)
	
	СтрокаЗамены = "";
	Для Каждого ЗначениеЗамены Из ЗначенияПеременной Цикл
		СтрокаЗамены = СтрокаЗамены + ?(ЗначениеЗаполнено(СтрокаЗамены), ", ", "") + СокрЛП(ЗначениеЗамены);
	КонецЦикла;
	
	Возврат СтрокаЗамены;
	
КонецФункции

Процедура ВзятьНомераСтрокТабличнойЧастиПоручения(ТаблицаРезультата,
	ЦенныеБумагиСписываемыеНомераСтрок,
	ЦенныеБумагиЗачисляемыеНомераСтрок)
	
	Для Каждого СтрокаРезультата Из ТаблицаРезультата Цикл
		Если ЗначениеЗаполнено(СтрокаРезультата.ЦенныеБумагиСписываемыеНомерСтроки) Тогда
			ЦенныеБумагиСписываемыеНомераСтрок.Добавить(СтрокаРезультата.ЦенныеБумагиСписываемыеНомерСтроки);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаРезультата.ЦенныеБумагиЗачисляемыеНомерСтроки) Тогда
			ЦенныеБумагиЗачисляемыеНомераСтрок.Добавить(СтрокаРезультата.ЦенныеБумагиЗачисляемыеНомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
