
//#Область ОписаниеПеременных

//#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДополнительнаяОбработкаСсылка = Неопределено;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Заголовок = "Начисление вознаграждения за управление: Розничное ДУ. Версия - " + ОбработкаОбъект.СведенияОВнешнейОбработке().Версия;
	
	Если Параметры.Свойство("ДополнительнаяОбработкаСсылка", ДополнительнаяОбработкаСсылка) Тогда
		Если ДополнительнаяОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка() Тогда
			ИмяОбработки = ОбработкаОбъект.Метаданные().Имя;
			ДополнительнаяОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ИмяОбработки);
		КонецЕсли;
	Иначе
		ИмяОбработки = ОбработкаОбъект.Метаданные().Имя;
		ДополнительнаяОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ИмяОбработки);
	КонецЕсли;
	
	Если ДополнительнаяОбработкаСсылка <> Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка() Тогда
		Настройки = ДополнительнаяОбработкаСсылка.ХранилищеНастроек.Получить();
		ОбработкаОбъект.УстановитьПользовательскиеНастройки(Настройки);
		
		ДопОбработка = ДополнительнаяОбработкаСсылка;
		ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	КонецЕсли;
	
	//Объект.ДоговорыДУ.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ДоговорДУ");
	
КонецПроцедуры

&НаСервере
Процедура ДоговорыКНачислениюНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ДоговорыКНачислению();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыКНачислению(Команда)
	ДоговорыКНачислениюНаСервере();
КонецПроцедуры

&НаСервере
Процедура НачислитьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СоздатьНачисления();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура Начислить(Команда)
	НачислитьНаСервере();
КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы
//// Код процедур и функций
//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормы<ИмяТаблицыФормы>
//// Код процедур и функций
//#КонецОбласти

//#Область ОбработчикиКомандФормы
//// Код процедур и функций
//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//// Код процедур и функций
//#КонецОбласти