
Функция НовыйПорядковыйНомерВТечениеДня(ДатаВыгрузки) Экспорт
	// Предполагаемый формат исходящего номера:
	// <код депонента><символ разделителя><номер в течение дня>
	СимволРазделителя = "-";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыВыгруженныеВЛуч.ИсходящийНомер КАК ИсходящийНомер
	|ИЗ
	|	РегистрСведений.ДокументыВыгруженныеВЛуч КАК ДокументыВыгруженныеВЛуч
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ДокументыВыгруженныеВЛуч.ДатаВыгрузки, ДЕНЬ) = &ДатаВыгрузки
	|	И ДокументыВыгруженныеВЛуч.ИсходящийНомер ПОДОБНО ""%-____""";
	Запрос.УстановитьПараметр("ДатаВыгрузки", НачалоДня(ДатаВыгрузки));
	Выборка = Запрос.Выполнить().Выбрать();
	МаксимальныйНомер = 0;
	Сообщение = Новый СообщениеПользователю;
	
	Пока Выборка.Следующий() Цикл
		ПозицияРазделителя = Найти(Выборка.ИсходящийНомер, СимволРазделителя);
		Если ПозицияРазделителя = 0 Тогда
			Сообщение.Текст = "Несоответствие формату: исходящий номер <" + Выборка.ИсходящийНомер
				+ "> не содержит символа-разделителя <" + СимволРазделителя + ">";
			Сообщение.Сообщить();
			Возврат 0;
		КонецЕсли;
		
		Попытка
			ТекущийНомер = Число(Сред(Выборка.ИсходящийНомер, ПозицияРазделителя+1));
		Исключение
			Сообщение.Текст = "Не удалось преобразовать к числу порядковый номер из исходящего номера "
				+ Выборка.ИсходящийНомер + " за " + Формат(ДатаВыгрузки, "ДЛФ=Д");
			Сообщение.Сообщить();
			Возврат 0;
		КонецПопытки;
		
		Если ТекущийНомер > МаксимальныйНомер Тогда
			МаксимальныйНомер = ТекущийНомер; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат МаксимальныйНомер + 1;
КонецФункции

Функция ДокументВыгружен(Документ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ДокументыВыгруженныеВЛуч.ДокументОснование) КАК КоличествоВыгруженныхДокументов
	|ИЗ
	|	РегистрСведений.ДокументыВыгруженныеВЛуч КАК ДокументыВыгруженныеВЛуч
	|ГДЕ
	|	ДокументыВыгруженныеВЛуч.ДокументОснование = &Документ";
	Запрос.УстановитьПараметр("Документ", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.КоличествоВыгруженныхДокументов > 0;
КонецФункции

Функция РеквизитыВыгрузки(Документ) Экспорт
	Реквизиты = Новый Структура("Ссылка,ДатаВыгрузки,ИсходящийНомер,РегистрационныйНомер,Исполнитель");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыВыгруженныеВЛуч.ДокументОснование КАК Ссылка,
	|	ДокументыВыгруженныеВЛуч.ДатаВыгрузки КАК ДатаВыгрузки,
	|	ДокументыВыгруженныеВЛуч.ИсходящийНомер КАК ИсходящийНомер,
	|	ДокументыВыгруженныеВЛуч.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ДокументыВыгруженныеВЛуч.Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.ДокументыВыгруженныеВЛуч КАК ДокументыВыгруженныеВЛуч
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НеттоПоручение.Поручения КАК НеттоПоручениеПоручения
	|		ПО (&Документ = НеттоПоручениеПоручения.Поручение)
	|ГДЕ
	|	(ДокументыВыгруженныеВЛуч.ДокументОснование = &Документ
	|			ИЛИ ДокументыВыгруженныеВЛуч.ДокументОснование = НеттоПоручениеПоручения.Ссылка)";
	Запрос.УстановитьПараметр("Документ", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	КонецЕсли;
	Возврат Реквизиты;
КонецФункции

Процедура ДобавитьДокумент(Документ, ДатаВыгрузки, ИсходящийНомер, РегистрационныйНомер, Исполнитель) Экспорт
	НаборРегистраций = РегистрыСведений.ДокументыВыгруженныеВЛуч.СоздатьНаборЗаписей();
	НаборРегистраций.Отбор.ДокументОснование.Установить(Документ);
	НаборРегистраций.Прочитать();
	Если НаборРегистраций.Количество() = 0 Тогда
		НоваяРегистрация = НаборРегистраций.Добавить();
		НоваяРегистрация.ДокументОснование = Документ;
		НоваяРегистрация.ДатаВыгрузки = ДатаВыгрузки;
		Если ПустаяСтрока(РегистрационныйНомер) Тогда // когда запись создаётся уже после выгрузки и обработки в Луч,, дату выгрузки не заполняем
			НоваяРегистрация.ДатаПоследнейВыгрузки = ДатаВыгрузки;
		КонецЕсли;
	Иначе
		НоваяРегистрация = НаборРегистраций[0];
		НоваяРегистрация.ДатаПоследнейВыгрузки = ДатаВыгрузки;
	КонецЕсли;
	НоваяРегистрация.ИсходящийНомер = ИсходящийНомер;
	НоваяРегистрация.РегистрационныйНомер = РегистрационныйНомер;
	НоваяРегистрация.Исполнитель = Исполнитель;
	НаборРегистраций.Записать(); 
КонецПроцедуры
