
#Область СлужебныйПрограммныйИнтерфейс

// Получить параметры источника NSD
// 
// Возвращаемое значение:
//   - Структура - Параметры подключения к источнику NSD
//
Функция ПараметрыИсточника() Экспорт
	
	Источник = ПланыВидовХарактеристик.ВнешниеИсточники.ЗагрузкаИзВнешнейAPINSD;
	
	Если ТестированиеVanessa.ЭтоТест() Тогда
		Настройка = Неопределено;
	Иначе
		Настройка = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(Источник).Настройка;
	КонецЕсли;
	
	СтруктураНастроек = Новый Структура;
	
	Если ЗначениеЗаполнено(Настройка) Тогда
		СтруктураНастроек.Вставить("HTTPСервисАдресСервера"								, Настройка.HTTPСервисАдресСервера);
		СтруктураНастроек.Вставить("HTTPСервисПорт"										, Настройка.HTTPСервисПорт);
		СтруктураНастроек.Вставить("HTTPСервисТаймаут"									, Настройка.HTTPСервисТаймаут);
		СтруктураНастроек.Вставить("HTTPСервисЗащищенноеСоединение"						, Настройка.HTTPСервисЗащищенноеСоединение);
		СтруктураНастроек.Вставить("HTTPСервисПользователь"								, Настройка.HTTPСервисПользователь);
		СтруктураНастроек.Вставить("HTTPСервисПароль"									, Настройка.HTTPСервисПароль);
		СтруктураНастроек.Вставить("HTTPСервисАдресРесурсаАутентификации"				, Настройка.HTTPСервисАдресРесурсаАутентификации);
		СтруктураНастроек.Вставить("HTTPСервисАдресРесурса"								, Настройка.HTTPСервисАдресРесурса);
	Иначе
		СтруктураНастроек.Вставить("HTTPСервисАдресСервера"								, "ServerNSDAPI");
		СтруктураНастроек.Вставить("HTTPСервисПорт"										, 0);
		СтруктураНастроек.Вставить("HTTPСервисТаймаут"									, 0);
		СтруктураНастроек.Вставить("HTTPСервисЗащищенноеСоединение"						, Истина);
		СтруктураНастроек.Вставить("HTTPСервисПользователь"								, "");
		СтруктураНастроек.Вставить("HTTPСервисПароль"									, "");
		СтруктураНастроек.Вставить("HTTPСервисАдресРесурсаАутентификации"				, "");
		СтруктураНастроек.Вставить("HTTPСервисАдресРесурса"								, "/api/get/eod");
	КонецЕсли;
	
	СтруктураНастроек.Вставить("ПроксиСерверАдрес",			 ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("ПроксиСерверАдрес"));
	СтруктураНастроек.Вставить("ПроксиСерверПорт",			 ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("ПроксиСерверПорт", 3128));
	СтруктураНастроек.Вставить("ПроксиСерверИспользовать",
		ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("ПроксиСерверИспользовать", Ложь));
	
	СтруктураНастроек.Вставить("ИмяИсточника",				 Источник.Наименование);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Получает источник NSD API, записывает ключ авторизации в параметры сеанса
//
// Параметры:
//  ОписаниеОшибки	 - Строка	 - Описание ошибки (если есть)
//  СлужебныйВызов	 - Булево	 - Признак вызова из служебной процедуры (по - умолчанию)
//  Сессия			 - Структура - Кеш соединения
// 
// Возвращаемое значение:
//   - Булево - Стутус получения ключа
//
Функция Подключить(ОписаниеОшибки, СлужебныйВызов = Истина, Сессия = Неопределено) Экспорт
	
	ОписаниеОшибки = "";
	
	НастройкиСоединения = ПараметрыИсточника();
	
	Если ЗначениеЗаполнено(НастройкиСоединения) Тогда
		
		ПараметрыСеанса.APIKeyNSD = API_AccountLogin(НастройкиСоединения, ОписаниеОшибки, Сессия);
		
	Иначе
		
		ПараметрыСеанса.APIKeyNSD = "";
		
		ОписаниеОшибки = "Не заполнены настройки для подключения внешнего источника NSDAPI.";
		
	КонецЕсли;
	
	Если Не СлужебныйВызов И ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		
	КонецЕсли;
	
	Если ОписаниеОшибки = "" И Не ТестированиеVanessa.ЭтоТест() Тогда
		Соединение = КешСоединения(Сессия);
		Если Соединение = Неопределено Тогда
			ОписаниеОшибки = "Нет HTTP Соединения";
		Иначе
			Возврат Соединение;
		КонецЕсли;
		Возврат Неопределено;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Процедура - Подключиться к сервису
//
// Параметры:
//  Соединение		 - HTTPСоединение	 - Соединение
//  Токен			 - Строка			 - Токен
//  Отказ			 - Булево			 - Отказ
//  ТекстОтказа		 - Строка			 - Описание ошибки
//  СлужебныйВызов	 - Булево			 - Признак служебного вызова
//  Сессия			 - Структура		 - Кеш
//
Процедура ПодключитьсяКСервису(Соединение,
	Токен,
	Отказ,
	ТекстОтказа,
	СлужебныйВызов = Ложь, Сессия = Неопределено) Экспорт
	
	ТекстОтказа = "";
	Соединение = Подключить(ТекстОтказа, СлужебныйВызов, Сессия);
	Если ЗначениеЗаполнено(ТекстОтказа) Тогда
		Отказ = Истина;
	Иначе
		Токен = ПараметрыСеанса.APIKeyNSD;
	КонецЕсли;
	
КонецПроцедуры

// BSLLS:LatinAndCyrillicSymbolInWord-off

// Возвращает данные из метода getValuation
//
// Параметры:
//  ВхПараметры								 - Строка	 - Входные параметры метода
//  Отказ									 - Булево	 - Признак отказа
//  ТекстОтказа								 - Строка	 - Описание ошибки
//  ЛогПолученныхДанных						 - ТекстовыйДокумент - Логирование
//  Соединение								 - HTTPСоединение	 - Кеш соединения
//  ОставитьЗаписьВЖурналеРегистрацииВызовов - Булево			 - Делать запись в журнале регистрации вызовов
//  Комментарий								 - Строка			 - Комментарий в журнале регистрации вызовов
// 
// Возвращаемое значение:
//   - Массив - Котировки
//
Функция ДанныеМетода_getValuation(ВхПараметры,
	Отказ,
	ТекстОтказа,
	ЛогПолученныхДанных,
	Соединение = Неопределено,
	ОставитьЗаписьВЖурналеРегистрацииВызовов = Истина,
	Комментарий = "") Экспорт
	
	Токен = ПараметрыСеанса.APIKeyNSD;
	Если Соединение = Неопределено Или Токен = "" Тогда
		СлужебныйВызов = Истина;
		ПодключитьсяКСервису(Соединение, Токен, Отказ, ТекстОтказа, СлужебныйВызов);
	КонецЕсли;
	Если Отказ Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	// Параметры метода
	ПараметрыURLЗапроса = Новый Структура;
	ПараметрыURLЗапроса.Вставить("apikey", Токен);
	
	// JSON документ (массив JSON документов), описывающий условие(я), которым должны удовлетворять запрашиваемые данные
	// &filter={"val_date":"2019-10-01","isin":"RU0009029540"} 
	Если ВхПараметры.Свойство("filter") Тогда // В параметр фильтр пердается структура параметров.
		ПараметрыURLЗапроса.Вставить("filter", ВхПараметры.filter);
	КонецЕсли;
	
	// Позволяет ограничить количество документов в ответе
	// &limit=10 Выдать не более 10 документов, удовлетворяющих условию
	Если ВхПараметры.Свойство("limit") Тогда
		ПараметрыURLЗапроса.Вставить("limit", ВхПараметры.limit);
	КонецЕсли;
	
	// Позволяет пропустить n документов в ответе. Совместно с limit можно использовать для реализации постраничной загрузки
	// &skip=1000 пропустить первые 1000 документов
	Если ВхПараметры.Свойство("skip") Тогда
		ПараметрыURLЗапроса.Вставить("skip", ВхПараметры.skip);
	КонецЕсли;
	
	// Включить в ответ только указанные аттрибуты. Для вложенные аттрибутов указываются полный путь через точку
	// &include=id,corp_action_type,coupon.number
	Если ВхПараметры.Свойство("include") Тогда
		ПараметрыURLЗапроса.Вставить("include", ВхПараметры.include);
	КонецЕсли;
	
	// Исключить из ответа указанные аттрибуты. Может применяться для уменьшения объема получаемых данных, если элемент точно не нужен.
	// Для вложенные аттрибутов указываются полный путь через точку
	// &exclude=corp_action_type,securities.issuer,securities.bond.depository
	Если ВхПараметры.Свойство("exclude") Тогда
		ПараметрыURLЗапроса.Вставить("exclude", ВхПараметры.exclude);
	КонецЕсли;
	
	ПараметрыЖурналаРегистрации =
		Новый Структура("ОставитьЗаписьВЖурналеРегистрацииВызовов, Комментарий", ОставитьЗаписьВЖурналеРегистрацииВызовов, Комментарий);
	ДанныеИзСервиса =
		ДанныеИзСервиса("GET", ПараметрыURLЗапроса, Отказ, ТекстОтказа, ЛогПолученныхДанных, Соединение, ПараметрыЖурналаРегистрации);
	
	Возврат ДанныеИзСервиса;
	
КонецФункции

// BSLLS:LatinAndCyrillicSymbolInWord-on

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область API

Функция API_AccountLogin(НастройкиСоединения, ОписаниеОшибки, Сессия)
	
	URL = "https://" + НастройкиСоединения.HTTPСервисАдресСервера + НастройкиСоединения.HTTPСервисАдресРесурсаАутентификации;
	
	ОписаниеВызова = РегистрыСведений.ЖурналРегистрацииВызовов.НовоеОписаниеВызова(
		"URL = " + URL,
		"ОбщийМодуль.NSDAPI." + "API_AccountLogin");
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьНачало(ОписаниеВызова);
	
	Если Не ТестированиеVanessa.ЭтоТест() Тогда
		ssl		= Новый ЗащищенноеСоединениеOpenSSL();
		Если НастройкиСоединения.ПроксиСерверИспользовать Тогда
			ПроксиСервер = Новый ИнтернетПрокси;
			ПроксиСервер.Установить("https", НастройкиСоединения.ПроксиСерверАдрес, НастройкиСоединения.ПроксиСерверПорт);
		Иначе
			ПроксиСервер = Неопределено;
		КонецЕсли;
		Попытка
			Соединение = Новый HTTPСоединение(НастройкиСоединения.HTTPСервисАдресСервера, 443, , , ПроксиСервер, 10, ssl);
			Сессия = Новый Структура("Соединение", Соединение);
		Исключение
			ОписаниеОшибки	= НСтр("ru='Ошибка соединения с НРД. Техническая информация: '") + ОписаниеОшибки();
			РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОшибку(ОписаниеВызова, ОписаниеОшибки);
			Возврат "";
		КонецПопытки;
	КонецЕсли;
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОкончание(ОписаниеВызова);
	
	Возврат НастройкиСоединения.HTTPСервисПароль;
	
КонецФункции

// BSLLS:LatinAndCyrillicSymbolInWord-off

Функция HTTPЗапросМетодPOST(АдресСервиса, ПараметрыURLЗапроса)
	
	ЗаголовкиЗапроса	= Новый Соответствие;
	ЗаголовкиЗапроса.Вставить("Content-Type", "application/json");
	ЗаголовкиЗапроса.Вставить("Accept", "application/xml");
	
	ИнтернетЗапрос	= Новый HTTPЗапрос;
	ИнтернетЗапрос.АдресРесурса	= АдресСервиса + "?token=" + ПараметрыСеанса.APIKeyNSD;
	ИнтернетЗапрос.Заголовки	= ЗаголовкиЗапроса;
	
	ТелоЗапроса	= Новый ЗаписьJSON;
	ТелоЗапроса.УстановитьСтроку();
	
	ТелоЗапроса.ЗаписатьНачалоОбъекта();
	
	Для Каждого ТекПараметр Из ПараметрыURLЗапроса Цикл
		ТелоЗапроса.ЗаписатьИмяСвойства(ТекПараметр.Ключ);
		ТелоЗапроса.ЗаписатьЗначение(ТекПараметр.Значение);
	КонецЦикла;
	
	ТелоЗапроса.ЗаписатьКонецОбъекта();
	
	СтрокаТелоЗапроса	= ТелоЗапроса.Закрыть();
	
	ИнтернетЗапрос.УстановитьТелоИзСтроки(СтрокаТелоЗапроса);
	
	Возврат ИнтернетЗапрос;
	
КонецФункции

Функция HTTPЗапросМетодGET(АдресСервиса, ПараметрыURLЗапроса, ЛогПолученныхДанных = Неопределено, ИмяКлюча = "apikey")
	
	ЗаголовкиЗапроса = Новый Соответствие();
	ЗаголовкиЗапроса.Вставить("Accept-Encoding", "gzip");
	ЗаголовкиЗапроса.Вставить("Content-Type", "application/json");
	ЗаголовкиЗапроса.Вставить("Accept", "application/json");
	
	ИнтернетЗапрос = Новый HTTPЗапрос();
	ИнтернетЗапрос.АдресРесурса = АдресСервиса;
	ИнтернетЗапрос.Заголовки	= ЗаголовкиЗапроса;
	
	СтрокаПараметровURLЗапроса = СтрокаПараметровURLЗапроса_Преобразовать(ПараметрыURLЗапроса);
	
	Если ЗначениеЗаполнено(СтрокаПараметровURLЗапроса) Тогда
		
		// Сохраняем полученные даные в логе
		Если ТипЗнч(ЛогПолученныхДанных) = Тип("ТекстовыйДокумент") Тогда
			ПозицияКлюча = СтрНайти(СтрокаПараметровURLЗапроса, ИмяКлюча);
			ДлинаКлюча = СтрДлина(ПараметрыURLЗапроса[ИмяКлюча]);
			ДлинаИмениКлюча = СтрДлина(ИмяКлюча);
			ИнформационнаяСтрокаПараметровURLЗапроса = "?" + Лев(СтрокаПараметровURLЗапроса, ПозицияКлюча - 1) + ИмяКлюча + "=*"
				+ Сред(СтрокаПараметровURLЗапроса, ПозицияКлюча + ДлинаКлюча + ДлинаИмениКлюча + 1);
			ЛогПолученныхДанных.ДобавитьСтроку("Тело запроса:");
			ЛогПолученныхДанных.ДобавитьСтроку(ИнформационнаяСтрокаПараметровURLЗапроса);
		КонецЕсли;
		
		ИнтернетЗапрос.АдресРесурса = ИнтернетЗапрос.АдресРесурса + "?" + СтрокаПараметровURLЗапроса;
	КонецЕсли;
	
	Возврат ИнтернетЗапрос;
	
КонецФункции

Функция СтрокаПараметровURLЗапроса_Преобразовать(ПараметрыURLЗапроса)
	
	СтрокаПараметровURLЗапроса = "";
	Для Каждого ТекПараметр Из ПараметрыURLЗапроса Цикл
		
		Если ТекПараметр.Ключ = "filter" Тогда
			
			Если ТипЗнч(ТекПараметр.Значение) = Тип("Структура") Или ТипЗнч(ТекПараметр.Значение) = Тип("Соответствие") Тогда
				
				ЗаписьJSON = Новый ЗаписьJSON;
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(ЗаписьJSON, ТекПараметр.Значение);
				УсловияФильтра = ЗаписьJSON.Закрыть();
				УсловияФильтра = СтрЗаменить(УсловияФильтра, "_S_", "$");
				
				СтрокаПараметровURLЗапроса = СтрокаПараметровURLЗапроса
					+ "filter=" + КодироватьСтроку(УсловияФильтра , СпособКодированияСтроки.URLВКодировкеURL) + "&";
				
			КонецЕсли;
			
		Иначе
			СтрокаПараметровURLЗапроса = СтрокаПараметровURLЗапроса
				+ ТекПараметр.Ключ + "=" + КодироватьСтроку(ТекПараметр.Значение, СпособКодированияСтроки.КодировкаURL) + "&";
		КонецЕсли;
		
	КонецЦикла;
	
	Если Прав(СтрокаПараметровURLЗапроса, 1) = "&" Тогда
		СтрокаПараметровURLЗапроса = Лев(СтрокаПараметровURLЗапроса, СтрДлина(СтрокаПараметровURLЗапроса) - 1);
	КонецЕсли;
	
	Возврат СтрокаПараметровURLЗапроса;
	
КонецФункции

Функция ДанныеИзСервиса(Метод,
	ПараметрыURLЗапроса,
	Отказ,
	ТекстОтказа,
	ЛогПолученныхДанных,
	Соединение,
	ПараметрыЖурналаРегистрации)
	
	НастройкиСоединения = ПараметрыИсточника();
	АдресСервиса	= НастройкиСоединения.HTTPСервисАдресРесурса;
	
	URL = "https://" + НастройкиСоединения.HTTPСервисАдресСервера + АдресСервиса;
	
	ОставитьЗаписьВЖурналеРегистрацииВызовов = ПараметрыЖурналаРегистрации.ОставитьЗаписьВЖурналеРегистрацииВызовов;
	Комментарий								 = ПараметрыЖурналаРегистрации.Комментарий;
	
	Если ОставитьЗаписьВЖурналеРегистрацииВызовов Тогда
		ОписаниеВызова = РегистрыСведений.ЖурналРегистрацииВызовов.НовоеОписаниеВызова(
			"URL = " + URL,
			"ОбщийМодуль.NSDAPI.ДанныеИзСервиса");
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьНачало(ОписаниеВызова);
	Иначе
		ОписаниеВызова = Неопределено;
	КонецЕсли;
	
	ДанныеИзСервиса = Новый Массив;
	КодСостояния200 = 200;
	КодСостояния400 = 400;
	Ответ = Неопределено;
	
	Попытка
		
		Если Метод = "GET" Тогда
			HTTPЗапрос = HTTPЗапросМетодGET(АдресСервиса, ПараметрыURLЗапроса, ЛогПолученныхДанных);
			Ответ = Соединение.Получить(HTTPЗапрос);
		Иначе
			Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапросМетодPOST(АдресСервиса, ПараметрыURLЗапроса));
		КонецЕсли;
		
		Если Ответ.КодСостояния = КодСостояния200 Тогда
			ТекстОтказа = "";
		ИначеЕсли Ответ.КодСостояния = КодСостояния400 Тогда
			ТекстШаблона = НСтр("ru='Не удалось получить данные Из сервиса %1. Код ошибки: %2.'");
			ТекстОтказа =  СтрШаблон(ТекстШаблона, АдресСервиса, ОписаниеПоКодуОтвета(Ответ.КодСостояния));
		Иначе
			ТекстШаблона = НСтр("ru='Не удалось получить данные Из сервиса %1. Код ошибки: %2.'");
			ТекстОтказа =  СтрШаблон(ТекстШаблона, АдресСервиса, ОписаниеПоКодуОтвета(Ответ.КодСостояния));
			Отказ = Истина;
		КонецЕсли;
		
	Исключение
		ОбработатьОшибкиПодключения(ОписаниеОшибки(), АдресСервиса, Ответ, Отказ, ТекстОтказа);
	КонецПопытки;
	
	Если Отказ Тогда
		Если ТипЗнч(ЛогПолученныхДанных) = Тип("ТекстовыйДокумент") Тогда
			ЛогПолученныхДанных.ДобавитьСтроку("Ответ:");
			ЛогПолученныхДанных.ДобавитьСтроку(ТекстОтказа);
		КонецЕсли;
		ЗафиксироватьОшибку(ОписаниеВызова, ТекстОтказа, Комментарий, АдресСервиса);
		Возврат ДанныеИзСервиса;
	КонецЕсли;
	
	ДанныеИзСервиса = ОтветСервиса(АдресСервиса, Ответ, Отказ, ТекстОтказа, ЛогПолученныхДанных);
	
	Если Отказ Тогда
		Если ТипЗнч(ЛогПолученныхДанных) = Тип("ТекстовыйДокумент") Тогда
			ЛогПолученныхДанных.ДобавитьСтроку("Ответ:");
			ЛогПолученныхДанных.ДобавитьСтроку(ТекстОтказа);
		КонецЕсли;
		ЗафиксироватьОшибку(ОписаниеВызова, ТекстОтказа, Комментарий, АдресСервиса);
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ОставитьЗаписьВЖурналеРегистрацииВызовов Тогда
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОкончание(ОписаниеВызова, Комментарий);
	КонецЕсли;
	
	Возврат ДанныеИзСервиса;
	
КонецФункции

// BSLLS:LatinAndCyrillicSymbolInWord-on

Процедура ОбработатьОшибкиПодключения(ОписаниеОшибки, АдресСервиса, Ответ, Отказ, ТекстОтказа)
	
	Если ТестированиеVanessa.ЭтоТест() Тогда
		ТестовыйОтвет = "
		|[{
		|    ""isin"": ""MHY8565N3002"",
		|    ""currency"": ""USD"",
		|    ""price_open"": ""43.55"",
		|    ""price_high"": ""43.55"",
		|    ""price_low"": ""43.55"",
		|    ""price_close"": ""43.55"",
		|    ""volume_trade"": 0,
		|    ""price_bid"": ""44.65"",
		|    ""price_ask"": ""49.1"",
		|    ""mic"": ""XFRA"",
		|    ""exchange_name"": ""Deutsche Boerse AG"",
		|    ""primary_exchange_mic"": ""XNYS"",
		|    ""primary_exchange_name"": ""New York Stock Exchange; Inc.""
		|},{
		|    ""isin"": ""MHY8565N3002"",
		|    ""currency"": ""USD"",
		|    ""price_open"": ""49.67"",
		|    ""price_high"": ""51.43"",
		|    ""price_low"": ""49.67"",
		|    ""price_close"": ""50.79"",
		|    ""volume_trade"": 412290,
		|    ""price_bid"": ""49.77"",
		|    ""price_ask"": ""51.68"",
		|    ""mic"": ""XNYS"",
		|    ""exchange_name"": ""New York Stock Exchange; Inc."",
		|    ""primary_exchange_mic"": ""XNYS"",
		|    ""primary_exchange_name"": ""New York Stock Exchange; Inc.""
		|}]";
		Ответ = Новый ТекстовыйДокумент;
		Ответ.УстановитьТекст(ТестовыйОтвет);
	Иначе
		ТекстШаблона = НСтр("ru='Не удалось получить данные Из сервиса %1. Техническая информация: %2'");
		ТекстОтказа = СтрШаблон(ТекстШаблона, АдресСервиса, ОписаниеОшибки);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗафиксироватьОшибку(ОписаниеВызова, ТекстОтказа, Комментарий, АдресСервиса)
	
	Если ОписаниеВызова = Неопределено Тогда
		ОписаниеВызова = РегистрыСведений.ЖурналРегистрацииВызовов.НовоеОписаниеВызова(
			"URL = " + АдресСервиса,
			"ОбщийМодуль.NSDAPI.ДанныеИзСервиса");
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьНачало(ОписаниеВызова);
	КонецЕсли;
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОшибку(ОписаниеВызова, ТекстОтказа, Комментарий);
	
КонецПроцедуры

Функция ОтветСервиса(АдресСервиса, Ответ, Отказ, ТекстОтказа, ЛогПолученныхДанных = Неопределено)
	
	ДанныеОтветаСервиса = Новый Массив;
	
	ЗаписатьВЛогПолученныхДанных = ТипЗнч(ЛогПолученныхДанных) = Тип("ТекстовыйДокумент");
	СтрокаОтвета = "";
	
	Попытка
		Если ТипЗнч(Ответ) = Тип("HTTPОтвет") Тогда
			мОтвет = Новый Структура;
			мОтвет.Вставить("Тело", Ответ.ПолучитьТелоКакДвоичныеДанные());
			мОтвет.Вставить("Заголовки", Ответ.Заголовки);
			мОтвет.Вставить("Кодировка", "utf-8");
			ПараметрыПреобразованияJSON = Новый Структура;
			ПараметрыПреобразованияJSON.Вставить("ПрочитатьВСоответствие", Ложь);
			мПолученныеДанные = КоннекторHTTP.КакJson(мОтвет, ПараметрыПреобразованияJSON);
			Если ЗаписатьВЛогПолученныхДанных Тогда
				СтрокаОтвета = КоннекторHTTP.КакТекст(мОтвет);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Ответ) = Тип("ТекстовыйДокумент") Тогда
			СтрокаОтвета	= Ответ.ПолучитьТекст();
			ОтветJSON = Новый ЧтениеJSON;
			ОтветJSON.УстановитьСтроку(СтрокаОтвета);
			мПолученныеДанные = ПрочитатьJSON(ОтветJSON);
			ОтветJSON.Закрыть();
		Иначе
			Отказ = Истина;
			ТекстОтказа = СтрШаблон("Не удалось прочитать полученные данные. Техническая информация: Пустой ответ.");
			Возврат ДанныеОтветаСервиса;
		КонецЕсли;
	Исключение
		Отказ = Истина;
		ТекстОтказа = СтрШаблон("Не удалось прочитать полученные данные. Техническая информация: %1", ОписаниеОшибки());
		Возврат ДанныеОтветаСервиса;
	КонецПопытки;
	
	// Сохраняем полученные даные в логе
	Если ЗаписатьВЛогПолученныхДанных Тогда
		ЛогПолученныхДанных.ДобавитьСтроку("Ответ:");
		СтрокаЛога = СтрЗаменить(СтрокаОтвета, "}", "}" + Символы.ПС);
		ЛогПолученныхДанных.ДобавитьСтроку(СтрокаЛога);
	КонецЕсли;
	
	ПреобразоватьДанныеОтветаСервиса(АдресСервиса, мПолученныеДанные, ДанныеОтветаСервиса, Отказ, ТекстОтказа);
	
	Возврат ДанныеОтветаСервиса;
	
КонецФункции

Процедура ПреобразоватьДанныеОтветаСервиса(АдресСервиса, мПолученныеДанные, ДанныеОтветаСервиса, Отказ, ТекстОтказа)
	
	Если ТипЗнч(мПолученныеДанные) = Тип("Структура") Тогда
		
		errors = Неопределено;
		Если мПолученныеДанные.Свойство("errors", errors) Тогда
			Отказ = Истина;
			ПричинаОшибки = ПричинаОшибкиНРД(errors);
			ТекстОтказа = СтрШаблон(НСтр("ru='Не удалось получить данные из сервиса %1. Причина: %2'"),
				АдресСервиса, ПричинаОшибки);
		Иначе
			ДанныеОтветаСервиса.Добавить(мПолученныеДанные);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(мПолученныеДанные) = Тип("Массив") Тогда
		
		Для Каждого Значение Из мПолученныеДанные Цикл
			ДанныеОтветаСервиса.Добавить(Значение);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(мПолученныеДанные) = Тип("Соответствие") Тогда
		
		ДанныеОтветаСервиса.Добавить(мПолученныеДанные);
		
	Иначе
		Отказ = Истина;
		ТекстОтказа = СтрШаблон(НСтр("ru='Не удалось получить данные из сервиса %1. Тип данных: %2 не поддерживается'"),
			АдресСервиса, ТипЗнч(мПолученныеДанные));
	КонецЕсли;
	
КонецПроцедуры

Функция ПричинаОшибкиНРД(Ошибки)
	
	ПричинаОшибки = "";
	
	Для Каждого Ошибка Из Ошибки Цикл
		КлючОшибки = Ошибка.Ключ;
		ТекстОшибкиПоКлючу = СтрСоединить(Ошибка.Значение, ",");
		ПричинаОшибки = ПричинаОшибки + КлючОшибки + ":" + ТекстОшибкиПоКлючу + "; ";
	КонецЦикла;
	
	Возврат ПричинаОшибки;
	
КонецФункции

Функция КешСоединения(Сессия)
	
	Если Не Сессия = Неопределено И Сессия.Свойство("Соединение") Тогда
		Возврат Сессия.Соединение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция КодыСостоянияHTTP()
	
	КодыСостояния = Новый Соответствие;
	Для Каждого Описание Из КоннекторHTTP.КодыСостоянияHTTP() Цикл
		КодыСостояния.Вставить(Описание.Значение, Описание.Ключ);
	КонецЦикла;
	
	Возврат КодыСостояния;
	
КонецФункции

Функция ОписаниеПоКодуОтвета(КодОтвета)
	
	СписокКодовОтвета = КодыСостоянияHTTP();
	Описание = Строка(КодОтвета) + " - ";
	
	НайденноеОписание = СписокКодовОтвета[КодОтвета];
	
	Если НайденноеОписание <> Неопределено Тогда
		Описание = Описание + НайденноеОписание;
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти

#КонецОбласти