//СОБЫТИЯ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ//////////////////////////////////

//КОМАНДЫ ФОРМЫ/////////////////////////////////////////////////

&НаКлиенте
Процедура ПрочитатьОбъекты(Команда)
	 ПрочитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере(Отказ = Ложь)
	
	//ТекОбъект = РеквизитФормыВЗначение("Объект");
	//ТекОбъект.ЗагрузитьОбъекты(Отказ);
	//ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	//
	//Если Отказ Тогда
	//	Сообщить("Во время загрузки произошли ошибки", СтатусСообщения.Важное);
	//Иначе
	//	Сообщить("Чтение успешно завершено", СтатусСообщения.Информация);
	//КонецЕсли;
	
	
	ДатаВыгрузки = КонецДня(Объект.Дата);

	//Задача = Задачи.ЗадачаИнтеграции.СоздатьЗадачу();
	//Задача.Дата 	= ТекущаяДата();
	//
	//Задача.ВидОбмена 		= ДопОбработка;
	//Задача.ВерсияОбработки 	= ОбщегоНазначения.ПолучитьЗначениеРеквизита(ДопОбработка, "Версия");
	//Задача.Наименование 	= "Выгрузка в CRIMS";
	//Задача.ПараметрыВыполнения = ПредставлениеНастроек;
	
	Отказ = Ложь;
	ТекстОшибки = "";
	 
	//ЗагрузитьОбъекты(Отказ, ТекстОшибки);
	//СоздатьОбъекты(Отказ, ТекстОшибки);
	
	//Задача.ХранилищеЛога = Новый ХранилищеЗначения(Лог, Новый СжатиеДанных(9));
	//
	//Задача.Описание 	= "Настройки: "+ ПредставлениеНастроек;

	
	Таб = "";
	
	Запрос = новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	""ЦБ"" КАК счет,
	               |	ХозрасчетныйОстатки.ДоговорДУ,
	               |	ХозрасчетныйОстатки.Субконто1 КАК МХ,
	               |	ХозрасчетныйОстатки.Субконто2 КАК Актив,
	               |	ХозрасчетныйОстатки.КоличествоОстаток КАК Остаток,
	               |	NULL КАК Валюта
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(
	               |			&ДатаВыгрузки,
	               |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВУЦБ),
	               |			,
	               |			ВариантУчетнойПолитики = ЗНАЧЕНИЕ(Справочник.ВариантыУчетнойПолитики.ПустаяСсылка)
	               |				ИЛИ ВариантУчетнойПолитики = ЗНАЧЕНИЕ(Справочник.ВариантыУчетнойПолитики.Основной)) КАК ХозрасчетныйОстатки
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	""ДС"",
	               |	ХозрасчетныйОстатки.ДоговорДУ,
	               |	ХозрасчетныйОстатки.Субконто1,
	               |	ХозрасчетныйОстатки.Субконто2,
	               |	ХозрасчетныйОстатки.ВалютнаяСуммаОстаток,
	               |	ХозрасчетныйОстатки.Валюта
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(
	               |			&ДатаВыгрузки,
	               |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВУДС),
	               |			,
	               |			ВариантУчетнойПолитики = ЗНАЧЕНИЕ(Справочник.ВариантыУчетнойПолитики.ПустаяСсылка)
	               |				ИЛИ ВариантУчетнойПолитики = ЗНАЧЕНИЕ(Справочник.ВариантыУчетнойПолитики.Основной)) КАК ХозрасчетныйОстатки";
				
	Запрос.УстановитьПараметр("ДатаВыгрузки", ДатаВыгрузки);
	
	
	Выборка = Запрос.Выполнить().Выгрузить();
	//Выборка.Колонки.Добавить(ID,Строка,,50);
	ИмяБазы = Макс(НСтр(СтрокаСоединенияИнформационнойБазы(),"Ref"),НСтр(СтрокаСоединенияИнформационнойБазы(),"File"));	
    	
    	SQL = Новый COMОбъект("ADODB.Connection");
    		ServerName = "AMDBRATES\DBMVTBAM01"; //имя или IP-адрес сервера
    		DSN = "MasterData"; //имя базы данных
    		UID = "svc_ratesuploader"; //логин пользователя SQL-сервера
    		PWD = "5E-20-5A-2D-5C-B9"; //пароль пользователя SQL-сервера
    		ConnectString = "Provider=SQLOLEDB;" + "Data Source=" +ServerName + ";Initial Catalog=" + DSN + ";UID=" + UID + ";PWD=" + PWD;
    		SQL.ConnectionString = ConnectString;
    		SQL.ConnectionTimeOut = 15;
    		SQL.CommandTimeout = 30;
    		//Подключаемся к базе данных
    		SQL.Open();
			
			SQLText = "delete from [MasterData].[dbo].[AvanPositionsExp] where [System] ='"+ИмяБазы+"'";
			SQL.Execute(SQLText);
			SQLText = "";

			Для каждого стр Из Выборка Цикл 
				попытка
				Если стр.Счет = "ЦБ"  Тогда
				  SQLText = "insert into [MasterData].[dbo].[AvanPositionsExp] ([ID],[Name],[ISIN],[Gosreg],[QTY],[System]) "+
	    		  "values ('"+стр.МХ.УникальныйИдентификатор()+"' , '"+ СокрЛП(стр.МХ.Наименование)+"' , '"+ СокрЛП(стр.Актив.Объект.ISIN)+"' , '"+ СокрЛП(стр.Актив.Объект.НомерГосРегистрацииВыпуска)+"' , "+формат(стр.Остаток,"ЧРД=.; ЧГ=")+" , '"+ИмяБазы+"')";
			  	Иначе
				   SQLText = "insert into [MasterData].[dbo].[AvanPositionsExp] ([ID],[Name],[ISIN],[Gosreg],[QTY],[System]) "+
	    		  "values ('"+стр.МХ.УникальныйИдентификатор()+"' , '"+ СокрЛП(стр.МХ.Наименование)+"' , '"+ СокрЛП(стр.Валюта)+"' , '' , "+формат(стр.Остаток,"ЧРД=.; ЧГ=")+" , '"+ИмяБазы+"')";  
			  КонецЕсли; 
			  
				SQL.Execute(SQLText);
			исключение
				сообщить("Проблемы с выгрузкой остатков по активу "+стр.Актив);
				конецпопытки;
			//стр.ID = стр.МХ.УникальныйИдентификатор();
			КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСделки(Команда)
	СоздатьСделкиНаСервере();
	
	Объект.Лог.ТолькоПросмотр = Истина;
	Объект.Лог.Показать();
	

КонецПроцедуры

&НаСервере
Процедура СоздатьСделкиНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.СоздатьОбъекты(Ложь);
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКомиссиюБрокера(Команда)
	ПересчитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ОбновитьКомиссиюБрокера();
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
КонецПроцедуры

&Наклиенте
Процедура ВыполнитьШаг(Команда) экспорт
	сообщить(ТекущаяДата());
	ВыполнитьШагНаСервере();
	сообщить(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура ВыполнитьШагНаСервере()
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ВыполнитьСделки();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьШагФонНаСервере()
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.РассчитатьКомиссиюОбороотовВБизнесПроцессах();
	ТекОбъект.ВыполнитьСделкиВПотоках(Ложь, Неопределено, Неопределено, Пул);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьШагФон(Команда)
	ВыполнитьШагФонНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьШагФонПроверкаНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	ТекОбъект.РассчитатьКомиссиюОбороотовВБизнесПроцессах();
	
	Отказ = Ложь;
	Комментарий = "";
	ТекОбъект.ВыполнитьСделкиВПотоках(Истина, Отказ, Комментарий, Пул);
	
	Сообщить(Отказ);
	Сообщить(Комментарий);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьШагФонПроверка(Команда)
	ВыполнитьШагФонПроверкаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере()
	
	СписокЗаданий.Очистить();
	
	мас = ФоновыеЗадания.ПолучитьФоновыеЗадания(новый Структура("ИмяМетода", "VTB_ОбщийМодуль.ВыполнитьИсполнениеСделокПоСпискуДоговорДУ"));

	Для каждого эл Из мас Цикл
		
		Если НачалоДня(эл.Начало) <> НачалоДня(ТекущаяДата()) Тогда
			Продолжить;
		КонецЕсли;
		
		нов_строка = СписокЗаданий.Добавить();
		нов_строка.Начало = эл.Начало;
		нов_строка.Конец = эл.Конец;
		нов_строка.Наименование = эл.Наименование;
		нов_строка.Состояние = эл.Состояние;
		Если эл.ИнформацияОбОшибке <> Неопределено Тогда 
			нов_строка.ИнформацияОбОшибке = эл.ИнформацияОбОшибке.Описание;
		КонецЕсли;
		//РазделениеДанных (DataSeparation)
		//Расположение (Location)
		//РегламентноеЗадание (ScheduledJob)
		//УникальныйИдентификатор (UUID)
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.КоличествоПотоков = 1;
КонецПроцедуры

