
Функция ДанныеПоследнейФормыW8(Депонент) Экспорт
	
	ДанныеПоследнейФормыW8 = Новый Структура("ФормаW8, ЕстьПересеченияПоСрокамСдругимиФормами, ТекстОшибки",, Ложь, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредоставленныеДокументы.ПредоставленнаяФорма КАК ПредоставленнаяФорма,
		|	ПредоставленныеДокументы.ПредоставленнаяФорма.СрокДействия КАК СрокДействия,
		|	ПредоставленныеДокументы.ПредоставленнаяФорма.ДатаПредоставления КАК ДатаПредоставления
		|ПОМЕСТИТЬ вт_ФормыДепонента
		|ИЗ
		|	РегистрСведений.ПредоставленныеДокументы КАК ПредоставленныеДокументы
		|ГДЕ
		|	ПредоставленныеДокументы.Депонент = &Депонент
		|	И ПредоставленныеДокументы.ВидДокумента В(&СписокДопустимыхВидовФорм)
		|	И ПредоставленныеДокументы.ПредоставленнаяФорма <> ЗНАЧЕНИЕ(Справочник.ФормыW8.ПустаяСсылка)
		|	И ПредоставленныеДокументы.ПредоставленнаяФорма.ПометкаУдаления = ЛОЖЬ
		|	И ПредоставленныеДокументы.ПредоставленнаяФорма.ДатаПредоставления < &ТекущаяДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(вт_ФормыДепонента.СрокДействия) КАК СрокДействия
		|ПОМЕСТИТЬ вт_ДатаПоследнейДействующейФормы
		|ИЗ
		|	вт_ФормыДепонента КАК вт_ФормыДепонента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	вт_ФормыДепонента.ПредоставленнаяФорма КАК ПоследняяПредоставленнаяФорма,
		|	вт_ФормыДепонента.СрокДействия КАК СрокДействияПоследейФормы,
		|	вт_ФормыДепонента.ДатаПредоставления КАК ДатаПредоставленияПоследейФормы
		|ПОМЕСТИТЬ вт_ПоследняяПредоставленнаяФорма
		|ИЗ
		|	вт_ФормыДепонента КАК вт_ФормыДепонента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ДатаПоследнейДействующейФормы КАК вт_ДатаПоследнейДействующейФормы
		|		ПО вт_ФормыДепонента.СрокДействия = вт_ДатаПоследнейДействующейФормы.СрокДействия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ПоследняяПредоставленнаяФорма.ПоследняяПредоставленнаяФорма КАК ПоследняяПредоставленнаяФорма
		|ИЗ
		|	вт_ПоследняяПредоставленнаяФорма КАК вт_ПоследняяПредоставленнаяФорма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ФормыДепонента.ПредоставленнаяФорма КАК ФормаИмеющаяПересеченияПоСрокамСПоследней
		|ИЗ
		|	вт_ФормыДепонента КАК вт_ФормыДепонента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ПоследняяПредоставленнаяФорма КАК вт_ПоследняяПредоставленнаяФорма
		|		ПО вт_ФормыДепонента.ПредоставленнаяФорма <> вт_ПоследняяПредоставленнаяФорма.ПоследняяПредоставленнаяФорма
		|			И (НЕ(вт_ПоследняяПредоставленнаяФорма.ДатаПредоставленияПоследейФормы < вт_ФормыДепонента.ДатаПредоставления
		|						И вт_ПоследняяПредоставленнаяФорма.СрокДействияПоследейФормы < вт_ФормыДепонента.ДатаПредоставления
		|					ИЛИ вт_ПоследняяПредоставленнаяФорма.ДатаПредоставленияПоследейФормы > вт_ФормыДепонента.СрокДействия
		|						И вт_ПоследняяПредоставленнаяФорма.СрокДействияПоследейФормы > вт_ФормыДепонента.СрокДействия))";
	
	СписокДопустимыхВидовФорм = Новый Массив;
	СписокДопустимыхВидовФорм.Добавить(Справочники.ВидыДокументовУдостоверяющихПолномочия.ФормаW8BENE_W8BEN);
	Запрос.УстановитьПараметр("СписокДопустимыхВидовФорм", СписокДопустимыхВидовФорм);
	Запрос.УстановитьПараметр("Депонент", Депонент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	РезультатЗапросаПоследняяФорма = ПакетЗапросов[ПакетЗапросов.Количество() - 2];
	Если НЕ РезультатЗапросаПоследняяФорма.Пустой() Тогда
		
		ВыборкаПоследняяФорма = ПакетЗапросов[ПакетЗапросов.Количество() - 2].Выбрать();
		ВыборкаПоследняяФорма.Следующий();
		ДанныеПоследнейФормыW8.ФормаW8 = ВыборкаПоследняяФорма.ПоследняяПредоставленнаяФорма;
		
		РезультатЗапросаПересекающиесяФормы = ПакетЗапросов[ПакетЗапросов.Количество() - 1];
		Если НЕ РезультатЗапросаПересекающиесяФормы.Пустой() Тогда
			
			СписокПересекающихсяФорм = РезультатЗапросаПересекающиесяФормы.Выгрузить().ВыгрузитьКолонку("ФормаИмеющаяПересеченияПоСрокамСПоследней");
			
			СписокПересекающихсяФормСтрокой = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(СписокПересекающихсяФорм, "', '");
			ТекстОшибки = "Текущая форма имеет пересечения по срокам действия со следующими формами: '" + СписокПересекающихсяФормСтрокой + "'";
				
			ДанныеПоследнейФормыW8.ЕстьПересеченияПоСрокамСдругимиФормами = Истина;
			ДанныеПоследнейФормыW8.ТекстОшибки = ТекстОшибки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеПоследнейФормыW8;
	
КонецФункции
