
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСрокДействияФормыВПредоставленныхДокументах();
	
	Если ДополнительныеСвойства.Свойство("ЭтоНовый") И ДополнительныеСвойства.ЭтоНовый = Истина Тогда
		РегистрыСведений.ДокументыКНачислениюКомиссииДепо.Добавить(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСрокДействияФормыВПредоставленныхДокументах()
	
	//Блокировка = Новый БлокировкаДанных;
	//ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПредоставленныеДокументы");
	//ЭлементБлокировки.УстановитьЗначение("ПредоставленнаяФорма", Ссылка);
	//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	//Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредоставленныеДокументы.Период,
		|	ПредоставленныеДокументы.Депонент,
		|	ПредоставленныеДокументы.ВидДокумента,
		|	ПредоставленныеДокументы.СрокДействия,
		|	ПредоставленныеДокументы.ДатаПредоставления,
		|	ПредоставленныеДокументы.Примечание,
		|	ПредоставленныеДокументы.ПредоставленнаяФорма
		|ИЗ
		|	РегистрСведений.ПредоставленныеДокументы КАК ПредоставленныеДокументы
		|ГДЕ
		|	ПредоставленныеДокументы.ПредоставленнаяФорма = &ПредоставленнаяФорма
		|	И (ПредоставленныеДокументы.СрокДействия <> ПредоставленныеДокументы.ПредоставленнаяФорма.СрокДействия
		|			ИЛИ ПредоставленныеДокументы.ДатаПредоставления <> ПредоставленныеДокументы.ПредоставленнаяФорма.ДатаПредоставления)";
	
	Запрос.УстановитьПараметр("ПредоставленнаяФорма", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.ПредоставленныеДокументы.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			МенеджерЗаписи.СрокДействия = СрокДействия;
			МенеджерЗаписи.ДатаПредоставления = ДатаПредоставления;
			МенеджерЗаписи.Записать();
		КонецЦикла; 
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ТипФормы = Перечисления.ТипыФормW8.ФормаW8IMY Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("СтранаГражданства");
		МассивНепроверяемыхРеквизитов.Добавить("СтранаНалоговогоРезиденстваЛица");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаРождения");
		МассивНепроверяемыхРеквизитов.Добавить("ИНН_TIN");
		
	Иначе
		Если ТипФормы = Перечисления.ТипыФормW8.ФормаW8BENE Тогда
		
			МассивНепроверяемыхРеквизитов.Добавить("СтранаГражданства");
			МассивНепроверяемыхРеквизитов.Добавить("СтранаНалоговогоРезиденстваЛица");
			МассивНепроверяемыхРеквизитов.Добавить("ДатаРождения");
			МассивНепроверяемыхРеквизитов.Добавить("GIINЛица");
		
		ИначеЕсли ТипФормы = Перечисления.ТипыФормW8.ФормаW8BEN Тогда
		
			МассивНепроверяемыхРеквизитов.Добавить("СтранаРегистрации");
			МассивНепроверяемыхРеквизитов.Добавить("GIINЛица");
			
		КонецЕсли;
		
		СоздатьСубклиентаПоДаннымАнкеты = Ложь;
		ДополнительныеСвойства.Свойство("СоздатьСубклиентаПоДаннымАнкеты",СоздатьСубклиентаПоДаннымАнкеты);
		ДобавитьВПредоставленныеДокументы = Ложь;
		ДополнительныеСвойства.Свойство("ДобавитьВПредоставленныеДокументы",ДобавитьВПредоставленныеДокументы);
		Если СоздатьСубклиентаПоДаннымАнкеты=Истина ИЛИ ДобавитьВПредоставленныеДокументы=Истина Тогда
			ДопТекстКонтрагент = "";
			Если СоздатьСубклиентаПоДаннымАнкеты=Истина Тогда
				ДопТекстКонтрагент = "(Субброкер)"
			КонецЕсли;
			МассивНепроверяемыхРеквизитов.Добавить("Лицо");
			ВладелецСубклиента = Неопределено;
			ДополнительныеСвойства.Свойство("Контрагент",ВладелецСубклиента);
			Если НЕ ЗначениеЗаполнено(ВладелецСубклиента) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле """"Контрагент "+ДопТекстКонтрагент+""" не заполнено",,"Объект.Контрагент",,Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	МассивРеквизитовДляПроверки = Новый Массив;
	МассивРеквизитовДляПроверки.Добавить("НаименованиеЛицаАнгл");
	МассивРеквизитовДляПроверки.Добавить("АдресПМЖ_АдресДом");
	МассивРеквизитовДляПроверки.Добавить("АдресПМЖ_Город");
	МассивРеквизитовДляПроверки.Добавить("АдресПочтовый_АдресДом");
	МассивРеквизитовДляПроверки.Добавить("АдресПочтовый_Город");
	МассивРеквизитовДляПроверки.Добавить("GIINЛица");
	МассивРеквизитовДляПроверки.Добавить("GIINСпонсирующейКомпании");
	МассивРеквизитовДляПроверки.Добавить("НазваниеСпонсирующейКомпании");
	Если РеквизитыФормыСодержатКириллицу(МассивРеквизитовДляПроверки) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция РеквизитыФормыСодержатКириллицу(МассивРеквизитовДляПроверки)
	
	РеквизитыСодержатКириллицу = Ложь;
	
	Для каждого НаименованиеРеквизита Из МассивРеквизитовДляПроверки Цикл
		Если СтроковыеФункцииКлиентСервер.ТекстСодержитКириллицу(ЭтотОбъект[НаименованиеРеквизита]) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В поле '" + НаименованиеРеквизита + 
				"' допустима только латиница!",,"Объект." + НаименованиеРеквизита,,РеквизитыСодержатКириллицу);
		КонецЕсли;
	КонецЦикла;
	
	Возврат РеквизитыСодержатКириллицу;

КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипСтруктура = Тип("Структура");
	Если ТипЗнч(ДанныеЗаполнения)=ТипСтруктура Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,,"ДополнительныеСвойства");
		ДопСвойства = Неопределено;
		Если ДанныеЗаполнения.Свойство("ДополнительныеСвойства",ДопСвойства) Тогда
			Если ТипЗнч(ДопСвойства)=ТипСтруктура Тогда
				Для Каждого Эл Из ДопСвойства Цикл
					ДополнительныеСвойства.Вставить(Эл.Ключ,Эл.Значение);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьАдрес(НаборКонтакнаяИнформация, Объект, ВидАдреса, Страна, Город, Адрес)
	
	Запись = НаборКонтакнаяИнформация.Добавить();
	Запись.Объект = Объект;
	Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	Запись.Вид = ВидАдреса;
	
	Запись.Поле1 = Страна;
	
	Если Страна=Справочники.КлассификаторСтранМира.РОССИЯ Тогда 
		Запись.Поле4			= Город;
		Запись.Поле6			= Адрес;
		Запись.Представление	= КонтактнаяИнформация.ПолучитьПредставлениеАдреса(Запись);
	Иначе
		Запись.Представление	= Адрес;
		Если Адрес<>"" И Город<>"" Тогда
			Запись.Представление = Запись.Представление+", ";
		КонецЕсли;
		Запись.Представление = Запись.Представление+Город;
	КонецЕсли;	
КонецПроцедуры

Функция СоздатьСубклиентаПоДаннымАнкеты(Отказ)
	
	ВладелецСубклиента = Неопределено;
	ДополнительныеСвойства.Свойство("Контрагент",ВладелецСубклиента);
	Субклиент = Справочники.Субклиенты.СоздатьЭлемент();
	Субклиент.Владелец = ВладелецСубклиента;
	
	Если ТипФормы=Перечисления.ТипыФормW8.ФормаW8BEN Тогда
		ЛицоОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
		ЛицоОбъект.ДатаРождения = ДатаРождения;
		ЛицоОбъект.ИНН = ИНН_TIN;
		
		ВидЮрАдреса = Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица;
		ВидПочтовогоАдреса = Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица;
		
		Субклиент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
		
	ИначеЕсли ТипФормы=Перечисления.ТипыФормW8.ФормаW8BENE Тогда	
		ЛицоОбъект = Справочники.ЮридическиеЛица.СоздатьЭлемент();
		ЛицоОбъект.ПолноеНаименование = НаименованиеЛицаАнгл;
		Если СтранаРегистрации=Справочники.КлассификаторСтранМира.РОССИЯ Тогда
			ЛицоОбъект.ИНН = ИНН_TIN;
		Иначе
			ЛицоОбъект.TIN = ИНН_TIN;
		КонецЕсли;
		ВидЮрАдреса = Справочники.ВидыКонтактнойИнформации.ЮрАдресЮрЛица;
		ВидПочтовогоАдреса = Справочники.ВидыКонтактнойИнформации.ФактАдресЮрЛица;
		
		Субклиент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создать Лицо по данным анкеты для типа формы "+ТипФормы,,"Объект.ТипФормы",,Отказ);
		
	КонецЕсли;
	ЛицоОбъект.Наименование = НаименованиеЛицаАнгл;
	ЛицоОбъект.Записать();
	Лицо = ЛицоОбъект.Ссылка;
	
	Субклиент.ЮридическиеФизическиеЛица = ЛицоОбъект.Ссылка;
	Субклиент.Наименование =  НаименованиеЛицаАнгл;
	Субклиент.Код = ДепозитарныйКодСублиентаПоДаннымСубброкера;
	
	НаборКонтакнаяИнформация = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборКонтакнаяИнформация.Отбор.Объект.Установить(ЛицоОбъект.Ссылка,Истина);
	НаборКонтакнаяИнформация.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Адрес,Истина);
	
	ДобавитьАдрес(НаборКонтакнаяИнформация, ЛицоОбъект.Ссылка, ВидЮрАдреса, АдресПМЖ_Страна, АдресПМЖ_Город, АдресПМЖ_АдресДом);
	ДобавитьАдрес(НаборКонтакнаяИнформация, ЛицоОбъект.Ссылка, ВидПочтовогоАдреса, АдресПочтовый_Страна, АдресПочтовый_Город, АдресПочтовый_АдресДом);
	
	НаборКонтакнаяИнформация.Записать();
	Субклиент.Записать();
	
	Возврат Субклиент.Ссылка;
КонецФункции

Процедура ПередЗаписью(Отказ)
	СозданныйСубклиент = Неопределено;
	СоздатьСубклиентаПоДаннымАнкеты = Ложь;
	Если ДополнительныеСвойства.Свойство("СоздатьСубклиентаПоДаннымАнкеты",СоздатьСубклиентаПоДаннымАнкеты) Тогда
		Если СоздатьСубклиентаПоДаннымАнкеты Тогда
			СозданныйСубклиент = СоздатьСубклиентаПоДаннымАнкеты(Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("ЭтоНовый", Истина);
		ДобавитьВПредоставленныеДокументы = Ложь;
		Если ДополнительныеСвойства.Свойство("ДобавитьВПредоставленныеДокументы",ДобавитьВПредоставленныеДокументы) Тогда
			Если ДобавитьВПредоставленныеДокументы Тогда
				
				Если ЗначениеЗаполнено(СозданныйСубклиент) Тогда
					Контрагент = СозданныйСубклиент;
				Иначе
					Контрагент = Неопределено;
					ДополнительныеСвойства.Свойство("Контрагент",Контрагент);
				КонецЕсли;
				
				СсылкаНового = Справочники.ФормыW8.ПолучитьСсылку(Новый УникальныйИдентификатор);
				УстановитьСсылкуНового(СсылкаНового);
				
				Набор = РегистрыСведений.ПредоставленныеДокументы.СоздатьНаборЗаписей();
				Если ЗначениеЗаполнено(Контрагент) Тогда
					Набор.Отбор.Депонент.Установить(Контрагент);
				Иначе
					Набор.Отбор.Лицо.Установить(Лицо);
				КонецЕсли;
				Если ТипФормы=Перечисления.ТипыФормW8.ФормаW8IMY Тогда
					ВидДокумента = Справочники.ВидыДокументовУдостоверяющихПолномочия.ФормаW8IMY;
				Иначе 
					ВидДокумента = Справочники.ВидыДокументовУдостоверяющихПолномочия.ФормаW8BENE_W8BEN;
				КонецЕсли;
				Набор.Отбор.ВидДокумента.Установить(ВидДокумента);
				Набор.Прочитать();
				ПредыдущаяФорма = Неопределено;
				Если Набор.Количество() > 0 Тогда
					ПоследняяЗапись = Набор[Набор.Количество() - 1];
					Если ПоследняяЗапись.СрокДействия > ДатаПредоставления Тогда
						ПредыдущийРабочийДень = ОбщегоНазначения.ПредыдущийРабочийДень(ДатаПредоставления);
						ПоследняяЗапись.СрокДействия = ПредыдущийРабочийДень;
						ПредыдущаяФорма = ПоследняяЗапись.ПредоставленнаяФорма;
					КонецЕсли;
				КонецЕсли;
				
				Запись = Набор.Добавить();
				Запись.Депонент = Контрагент;
				Запись.Лицо = Лицо;
				Запись.ВидДокумента = ВидДокумента;
				Запись.СрокДействия = СрокДействия;
				Запись.ДатаПредоставления = ДатаПредоставления;
				Запись.ПредоставленнаяФорма = СсылкаНового;
				Запись.Период = ДатаПредоставления;
				Набор.Записать();
				Если ЗначениеЗаполнено(ПредыдущаяФорма) Тогда
					ПредыдущаяФормаОбъект = ПредыдущаяФорма.ПолучитьОбъект();
					ПредыдущаяФормаОбъект.СрокДействия = ПредыдущийРабочийДень;
					ПредыдущаяФормаОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ПометкаУдаления Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредоставленныеДокументы.Период КАК Период,
		|	ПредоставленныеДокументы.Депонент КАК Депонент,
		|	ПредоставленныеДокументы.Лицо КАК Лицо,
		|	ПредоставленныеДокументы.ВидДокумента КАК ВидДокумента,
		|	ПредоставленныеДокументы.СрокДействия КАК СрокДействия,
		|	ПредоставленныеДокументы.ДатаПредоставления КАК ДатаПредоставления,
		|	ПредоставленныеДокументы.Примечание КАК Примечание,
		|	ПредоставленныеДокументы.ПредоставленнаяФорма КАК ПредоставленнаяФорма
		|ИЗ
		|	РегистрСведений.ПредоставленныеДокументы КАК ПредоставленныеДокументы
		|ГДЕ
		|	ПредоставленныеДокументы.ПредоставленнаяФорма = &ПредоставленнаяФорма";
		Запрос.УстановитьПараметр("ПредоставленнаяФорма", Ссылка);
		Выгрузка = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаВыгрузки Из Выгрузка Цикл
			Запись = РегистрыСведений.ПредоставленныеДокументы.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаВыгрузки);
			Запись.Удалить();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

