
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ТребуемыеПараметры);
	// Конец СтандартныеПодсистемы
	
	// Установка параметра сеанса подсистемы "Оценка производительности" при использовании отдельно от БСП.
	ОценкаПроизводительностиСлужебный.УстановкаПараметровСеанса("КомментарийЗамераВремени", Новый Массив);
	
	Если ТребуемыеПараметры = Неопределено Тогда
		ПараметрыСеанса.ЗавершитьРаботу = Ложь;
		ПараметрыСеанса.Организация = Константы.ОрганизацияПоУмолчанию.Получить();		
		ПараметрыСеанса.ТекущийПользователь = ОбщегоНазначения.обОпределитьТекущегоПользователя();
		ОпеределитьПараметрыТекущегоСоединения();
		Привилегированный.ВыполнитьДействияПриПеремещенииБазы();
		
		ПараметрыТестирования = ТестированиеVanessa.ДействующиеПараметрыТестирования();
		ПараметрыСеанса.ЭтоТестированиеVanessa = ПараметрыТестирования.ЭтоТестированиеVanessa;
		ПараметрыСеанса.ТестовыеДанныеVanessa = ПараметрыТестирования.ТестовыеДанныеVanessa;
		
		// Инициализация параметров для работы с ADO в клиент серверном варианте [для Taxi]
		ТипыКомандADO				= ВнешниеДанные.ИнициализацияТиповADO();
		ТипыПараметровADO			= ВнешниеДанные.ИнициализацияТиповПараметровADO();
		ТипыНаправленийПараметраADO = ВнешниеДанные.ИнициализацияТиповНаправленияПараметровADO();
		ПараметрыСеанса.ТипыКомандADO				= Новый ФиксированнаяСтруктура(ТипыКомандADO);
		ПараметрыСеанса.ТипыПараметровADO			= Новый ФиксированнаяСтруктура(ТипыПараметровADO);
		ПараметрыСеанса.ТипыНаправленийПараметраADO	= Новый ФиксированнаяСтруктура(ТипыНаправленийПараметраADO);
		
		ПараметрыСеанса.ТокенRuDataAPI = "";
		ПараметрыСеанса.APIKeyNSD = "";
		
		ПараметрыСеанса.ОтмененныеДлительныеОперации = Новый ФиксированныйМассив(Новый Массив);
		ПараметрыСеанса.ПропуститьПроверкуЗапретаИзменения = Ложь;
		
	Иначе
		// Установка параметров сеанса "по требованию"
		
		// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
		// следует инициализировать сразу группой. Для того, чтобы избежать их повторной инициализации,
		// имена уже установленных параметров сеанса сохраняются в массиве УстановленныеПараметры
		УстановленныеПараметры = Новый Массив;
		Для каждого ИмяПараметра Из ТребуемыеПараметры Цикл
			УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Установить значения параметров сеанса и возвратить имена установленных параметров сеанса
// в параметре УстановленныеПараметры.
//
// Параметры
//  ИмяПараметра  - Строка - имя параметра сеанса, который требуется установить (проинициализировать).
//  УстановленныеПараметры  - Массив - массив, в который добавляются имена
//                                     установленных (проинициализированных) параметров.
//
Процедура УстановитьЗначениеПараметраСеанса(Знач ИмяПараметра, УстановленныеПараметры)
	
	// {ОбменДаннымиБСП
	ОбменДаннымиСервер.УстановитьПараметрыСеанса(ИмяПараметра, УстановленныеПараметры);
	// }ОбменДаннымиБСП
	
КонецПроцедуры

Процедура ОпеределитьПараметрыТекущегоСоединения()

	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	ИмяСервера = ОбщегоНазначения.ПолучитьПараметрСтрокиСоединения("Srvr", СтрокаСоединения);
	
	// Если имя сервера не определено, тогда, возможно, это файловый вариант
	Если ИмяСервера = "" Тогда
		ИмяСервера = ОбщегоНазначения.ПолучитьПараметрСтрокиСоединения("File", СтрокаСоединения);
	КонецЕсли;
	
	ИмяИБ = ОбщегоНазначения.ПолучитьПараметрСтрокиСоединения("Ref", СтрокаСоединения);
	
	ПараметрыСеанса.ТекущийКластерСерверов = ИмяСервера;
	ПараметрыСеанса.ТекущаяИнформационнаяБаза = ИмяИБ;

КонецПроцедуры
