

Функция ДанныеОписанийУсловийПереходаПоРазборуТекста(ДанныеРежимаЗагрузкиОписания = Неопределено) Экспорт
	
	СтруктураОписания = Новый Структура;
	
	
	СтруктураОписания.Вставить("Объект", Обработки.ЗагрузкаДокументовИзНРД.Создать());
	СтруктураОписания.Вставить("ОписаниеБлоков", Новый Массив);		
	
	
	//имяблока "#1"
	СтруктураБлока = Новый Структура;
	СтруктураБлока.Вставить("ИмяБлока", "#1");
	
	СтруктураПроверяемыхЗначений = Новый Структура();
	СтруктураПроверяемыхЗначений.Вставить("ТекстСтолбца1");
	СтруктураПроверяемыхЗначений.Вставить("ТекстСтолбца2");
	СтруктураПроверяемыхЗначений.Вставить("ТекстСтолбца3");
	СтруктураПроверяемыхЗначений.Вставить("ТекстСтолбца4");	
	СтруктураПроверяемыхЗначений.Вставить("НаименованиеЦБ");
	СтруктураБлока.Вставить("СтруктураПроверяемыхЗначений", СтруктураПроверяемыхЗначений);
	
	СтруктураБлока.Вставить("ПроцедураЗаполненияБлока", "Объект.ЗаполнитьСвойстваСтрокиДивидендовКупоновПоРазборуТекстаИлиСоздатьОписание");
	СтруктураОписания.ОписаниеБлоков.Добавить(СтруктураБлока);
	
	
	//имяблока "#2"
	СтруктураБлока = Новый Структура;
	СтруктураБлока.Вставить("ИмяБлока", "#2");
	
	СтруктураПроверяемыхЗначений = Новый Структура();
	СтруктураПроверяемыхЗначений.Вставить("ДополнительнаяИнформация");
	СтруктураБлока.Вставить("СтруктураПроверяемыхЗначений", СтруктураПроверяемыхЗначений);
		
	СтруктураБлока.Вставить("ПроцедураЗаполненияБлока", "Объект.ЗаполнитьВидОперацииВСтрокеДивидендовКупоновПоРазборуТекстаИлиСоздатьОписание");
	СтруктураОписания.ОписаниеБлоков.Добавить(СтруктураБлока);
	
	
	//имяблока "#3"
	СтруктураБлока = Новый Структура;
	СтруктураБлока.Вставить("ИмяБлока", "#3");
	
	СтруктураПроверяемыхЗначений = Новый Структура();
	СтруктураПроверяемыхЗначений.Вставить("ТекстСтолбца1");
	СтруктураПроверяемыхЗначений.Вставить("ТекстСтолбца2");
	СтруктураПроверяемыхЗначений.Вставить("ТекстСтолбца3");
	СтруктураПроверяемыхЗначений.Вставить("ТекстСтолбца4");	
	СтруктураПроверяемыхЗначений.Вставить("НаименованиеЦБ");
	СтруктураБлока.Вставить("СтруктураПроверяемыхЗначений", СтруктураПроверяемыхЗначений);
	
	СтруктураБлока.Вставить("ПроцедураЗаполненияБлока", "Объект.ЗаполнитьВидОперацииВСтрокеДивидендовКупоновСИностраннойЦБПоРазборуТекстаИлиСоздатьОписание");
	СтруктураОписания.ОписаниеБлоков.Добавить(СтруктураБлока);
	
	//имяблока "#4"
	СтруктураБлока = Новый Структура;
	СтруктураБлока.Вставить("ИмяБлока", "#4");
	
	СтруктураПроверяемыхЗначений = Новый Структура();
	СтруктураПроверяемыхЗначений.Вставить("ДополнительнаяИнформация");
	СтруктураБлока.Вставить("СтруктураПроверяемыхЗначений", СтруктураПроверяемыхЗначений);
		
	СтруктураБлока.Вставить("ПроцедураЗаполненияБлока", "Объект.ЗаполнитьДопИнформациюВСтрокеДивидендовКупоновПоРазборуТекстаИлиСоздатьОписание");
	СтруктураОписания.ОписаниеБлоков.Добавить(СтруктураБлока);
	
	Возврат СтруктураОписания;

	
КонецФункции

Функция ДанныеТиповогоЗаполненияБлоковОбъекта() Экспорт
	
	ДанныеРежимаЗагрузкиОписания = Новый Соответствие;
	
	// Блок #1
	
	СоответствияВетокУсловий = Новый Соответствие;
	СоответствияВетокУсловий.Вставить("НомерИсходящегоДокумента", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ИСХ. №"") > 0")); 
	
	СоответствияВетокУсловий.Вставить("НаименованиеЭмитента", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ПОЛНОЕ НАИМЕНОВАНИЕ ЭМИТЕНТА"") > 0"));
	
	СоответствияВетокУсловий.Вставить("ДатаФиксацииСписка", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ДАТА ФИКСАЦИИ"") > 0"));
	
	СоответствияВетокУсловий.Вставить("ФиксацияНаУтро", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ДАТА ФИКСАЦИИ"") > 0 И Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""НА УТРО"") > 0"));

	СоответствияВетокУсловий.Вставить("НомерПлатежногоПоручения", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ПЛАТЕЖНОЕ ПОРУЧЕНИЕ"") > 0 И Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""№ ПЛ. ПОРУЧ."") > 0"));
	
	СоответствияВетокУсловий.Вставить("ДатаПлатежногоПоручения", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ДАТА ПЛ. ПОРУЧ."") > 0 И ЗначениеЗаполнено(СтруктураПроверяемыхЗначений.ТекстСтолбца2)"));
	
	СоответствияВетокУсловий.Вставить("ЦенаАО", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""РАЗМЕР ВЫПЛАТЫ НА ОДНУ АКЦИЮ"") > 0 И Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""АОИ"") > 0"));
	
	СоответствияВетокУсловий.Вставить("ЦенаАП", Новый Структура("ВидНастройки, Данные", 0, 
	"ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1) = ""АПИ"" И ЗначениеЗаполнено(СтруктураПроверяемыхЗначений.ТекстСтолбца2)"));	
	
	СоответствияВетокУсловий.Вставить("ОбщаяСумма", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ОБЩАЯ СУММА НАЧИСЛЕННЫХ ДЕНЕЖНЫХ СРЕДСТВ"") > 0 или Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ОБЩАЯ СУММА НАЧИСЛЕННОЙ ВЫПЛАТЫ"") > 0"));
	
	СоответствияВетокУсловий.Вставить("СуммаКВыплате", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""СУММА К ВЫПЛАТЕ ДЕПОНЕНТУ"") > 0 или Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""СУММА К ДОПЛАТЕ/ВЫПЛАТЕ ДЕПОНЕНТУ"") > 0"));
	
	СоответствияВетокУсловий.Вставить("ДопУдержания", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ДОПОЛНИТЕЛЬНЫЕ УДЕРЖАНИЯ"") > 0"));	
	
	СоответствияВетокУсловий.Вставить("СуммаВыплаченнаяРанее", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""СУММА"") > 0 И Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ВЫПЛАЧЕННАЯ"") > 0"));
	
	СоответствияВетокУсловий.Вставить("Д1", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ЗНАЧЕНИЕ ПОКАЗАТЕЛЯ Д1"") > 0"));
	
	СоответствияВетокУсловий.Вставить("Д2", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ЗНАЧЕНИЕ ПОКАЗАТЕЛЯ Д2"") > 0"));
	
	СоответствияВетокУсловий.Вставить("Номинал", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""НОМИНАЛ ЦЕННОЙ БУМАГИ"") > 0"));
	
	СоответствияВетокУсловий.Вставить("НаименованиеЦБ", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""НАИМЕНОВАНИЕ ЦЕННОЙ БУМАГИ"") > 0	или Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""НАИМЕНОВАНИЕ ВЫПУСКА"") > 0"));
	
	СоответствияВетокУсловий.Вставить("КодЦБ", Новый Структура("ВидНастройки, Данные", 0, 
	"ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1) = ""ISIN"""));
	
	СоответствияВетокУсловий.Вставить("ДополнительнаяИнформация", Новый Структура("ВидНастройки, Данные", 0, 
	"ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1) = ""ДОПОЛНИТЕЛЬНАЯ ИНФОРМАЦИЯ"""));
	
	СоответствияВетокУсловий.Вставить("ТипЦБ = Акция", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""ДИВИДЕНД"") > 0 или Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""АКЦИЯ"") > 0"));
	
	СоответствияВетокУсловий.Вставить("ТипЦБ = Облигация", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""КУПОН"") > 0 или Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""ПОГАШЕНИ"") > 0")); 		
	
	СоответствияВетокУсловий.Вставить("ТипЦБ = Облигация (по наименование ЦБ)", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.НаименованиеЦБ), ""ОБЛИГАЦ"") > 0")); 			
	
	СоответствияВетокУсловий.Вставить("ТипЦБ = Пай", Новый Структура("ВидНастройки, Данные", 0,
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""ПАИ"") > 0 или Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""ПАЯМ"") > 0"));
	
	СоответствияВетокУсловий.Вставить("БИК", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""НКО"") > 0 И Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""БИК"") > 0 "));
	
	СоответствияВетокУсловий.Вставить("НомерСчета", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ИНН"") > 0 И Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""СЧ. №"") > 0"));
	
	ДанныеРежимаЗагрузкиОписания.Вставить("#1", СоответствияВетокУсловий);
	
	
	//"#2"
	
	СоответствияВетокУсловий = Новый Соответствие;
	СоответствияВетокУсловий.Вставить("ВидОперации = ПогашениеНКД", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(НРег(СтруктураПроверяемыхЗначений.ДополнительнаяИнформация), ""купон"") > 0 ИЛИ Найти(НРег(СтруктураПроверяемыхЗначений.ДополнительнаяИнформация), ""выплата процентного дохода"") > 0")); 
	
	СоответствияВетокУсловий.Вставить("ВидОперации = ПогашениеЦБЧастичное", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(НРег(СтруктураПроверяемыхЗначений.ДополнительнаяИнформация), ""части"") > 0 И Найти(НРег(СтруктураПроверяемыхЗначений.ДополнительнаяИнформация), ""номинал"") > 0")); 
	
	СоответствияВетокУсловий.Вставить("ВидОперации = ПогашениеЦБПолное", Новый Структура("ВидНастройки, Данные", 0, 
	"(Найти(НРег(СтруктураПроверяемыхЗначений.ДополнительнаяИнформация), ""части"") = 0 И Найти(НРег(СтруктураПроверяемыхЗначений.ДополнительнаяИнформация), ""номинал"") > 0) ИЛИ
	|(Найти(НРег(СтруктураПроверяемыхЗначений.ДополнительнаяИнформация), ""погашение облигаций"") > 0 ИЛИ Найти(НРег(СтруктураПроверяемыхЗначений.ДополнительнаяИнформация), ""досрочное обязательное погашение облигации"") > 0)")); 
	
	ДанныеРежимаЗагрузкиОписания.Вставить("#2", СоответствияВетокУсловий); 	
	
	
	//#3
	
	СоответствияВетокУсловий = Новый Соответствие;
	СоответствияВетокУсловий.Вставить("НомерИсходящегоДокумента", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ИСХ. №"") > 0")); 
	
	СоответствияВетокУсловий.Вставить("НаименованиеЭмитента", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ПОЛНОЕ НАИМЕНОВАНИЕ ЭМИТЕНТА"") > 0"));
	
	СоответствияВетокУсловий.Вставить("ВыплатаВалюты и Доп.информация", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ВАЛЮТА ВЫПЛАТЫ"") > 0"));	
	
	СоответствияВетокУсловий.Вставить("ДатаФиксацииСписка", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ДАТА ФИКСАЦИИ"") > 0")); 	
	
	СоответствияВетокУсловий.Вставить("ФиксацияНаУтро", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ДАТА ФИКСАЦИИ"") > 0 И Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""НА УТРО"") > 0"));

	СоответствияВетокУсловий.Вставить("НомерПлатежногоПоручения", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ПЛАТЕЖНОЕ ПОРУЧЕНИЕ"") > 0 И ЗначениеЗаполнено(СтруктураПроверяемыхЗначений.ТекстСтолбца2)"));
	
	СоответствияВетокУсловий.Вставить("ДатаПлатежногоПоручения", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ДАТА ПЕРЕЧИСЛЕНИЯ ВЫПЛАТЫ"") > 0 И ЗначениеЗаполнено(СтруктураПроверяемыхЗначений.ТекстСтолбца2)"));		
	
	СоответствияВетокУсловий.Вставить("ОбщаяСумма И СуммаКВыплате", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""СУММА К ВЫПЛАТЕ ДЕПОНЕНТУ"") > 0 
	|или Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""СУММА К ДОПЛАТЕ/ВЫПЛАТЕ ДЕПОНЕНТУ"") > 0"));
	
	СоответствияВетокУсловий.Вставить("ДопУдержания", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ДОПОЛНИТЕЛЬНЫЕ УДЕРЖАНИЯ"") > 0")); 		
	
	СоответствияВетокУсловий.Вставить("СуммаВыплаченнаяРанее", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""СУММА"") > 0 И Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ВЫПЛАЧЕННАЯ"") > 0"));	
	
	СоответствияВетокУсловий.Вставить("Д1", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ЗНАЧЕНИЕ ПОКАЗАТЕЛЯ Д1"") > 0"));
	
	СоответствияВетокУсловий.Вставить("Д2", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ЗНАЧЕНИЕ ПОКАЗАТЕЛЯ Д2"") > 0"));
	
	СоответствияВетокУсловий.Вставить("НомерСчета", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""НОМЕР СЧЕТА"") > 0"));	
	
	СоответствияВетокУсловий.Вставить("ДополнительнаяИнформация и ПериодДивидендов", Новый Структура("ВидНастройки, Данные", 0, 
	"ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1) = ""НАИМЕНОВАНИЕ СОБЫТИЯ"""));	
	
	СоответствияВетокУсловий.Вставить("ТипЦБ = Акция И ДополнительнаяИнформация", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""ДИВИДЕНД"") > 0 или Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""АКЦИЯ"") > 0"));	
	
	СоответствияВетокУсловий.Вставить("ТипЦБ = Облигация", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""КУПОН"") > 0 или Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""ПОГАШЕНИ"") > 0")); 				
	
	СоответствияВетокУсловий.Вставить("ТипЦБ = Облигация (по наименованию ЦБ)", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.НаименованиеЦБ), ""ОБЛИГАЦ"") > 0")); 			
	
	СоответствияВетокУсловий.Вставить("ТипЦБ = Пай", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""ПАИ"") > 0 или Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""ПАЯМ"") > 0"));
	
	СоответствияВетокУсловий.Вставить("БИК", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""НКО"") > 0 И Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""БИК"") > 0 "));
	
	СоответствияВетокУсловий.Вставить("НомерСчета: условие 2", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца1), ""ИНН"") > 0 И Найти(ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2), ""СЧ. №"") > 0"));
	
	СоответствияВетокУсловий.Вставить("ВидКД = CAPG", Новый Структура("ВидНастройки, Данные", 0, 
	"ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2) = ВРег(""Выплата дохода по паям/ису"")"));
	
	СоответствияВетокУсловий.Вставить("ВидКД = MCAL", Новый Структура("ВидНастройки, Данные", 0, 
	"ВРег(СтруктураПроверяемыхЗначений.ТекстСтолбца2) = ВРег(""Досрочное обязательное погашение облигации"")"));
		
	ДанныеРежимаЗагрузкиОписания.Вставить("#3", СоответствияВетокУсловий);
	
	
	//#4
	
	СоответствияВетокУсловий = Новый Соответствие;
	СоответствияВетокУсловий.Вставить("ДопИнформация = Выплата КД по облигациям", Новый Структура("ВидНастройки, Данные", 0,
	"Найти(НРег(СтруктураПроверяемыхЗначений.ДополнительнаяИнформация), ""купон"") > 0")); 
	
	СоответствияВетокУсловий.Вставить("ДопИнформация = Выплата части н.с. при частичном погашении облигаций ", Новый Структура("ВидНастройки, Данные", 0, 
	"Найти(НРег(СтруктураПроверяемыхЗначений.ДополнительнаяИнформация), ""части"") > 0 И Найти(НРег(СтруктураПроверяемыхЗначений.ДополнительнаяИнформация), ""номинал"") > 0")); 
	
	СоответствияВетокУсловий.Вставить("ДопИнформация = Выплата н.с. при погашении облигаций ", Новый Структура("ВидНастройки, Данные", 0, 
	"(Найти(НРег(СтруктураПроверяемыхЗначений.ДополнительнаяИнформация), ""части"") = 0 И Найти(НРег(СтруктураПроверяемыхЗначений.ДополнительнаяИнформация), ""номинал"") > 0) ИЛИ
	|(Найти(НРег(СтруктураПроверяемыхЗначений.ДополнительнаяИнформация), ""погашение облигаций"") > 0 ИЛИ Найти(НРег(СтруктураПроверяемыхЗначений.ДополнительнаяИнформация), ""досрочное обязательное погашение облигации"") > 0)")); 
	
	ДанныеРежимаЗагрузкиОписания.Вставить("#4", СоответствияВетокУсловий); 
	
	Возврат ДанныеРежимаЗагрузкиОписания;
	
КонецФункции




