Процедура ДобавитьЗапись(СквознойИдентификаторВызова, Система, СсылкаНаОбъект, Событие, УспешноеЗавершение, Комментарий = "") Экспорт
	
	НовЗапись = РегистрыСведений.РегистрацияИнтеграционныхСобытий.СоздатьМенеджерЗаписи();
	НовЗапись.Система = Система;
	НовЗапись.СсылкаНаОбъектСистемы = СсылкаНаОбъект;
	НовЗапись.РазделительСобытий = Новый УникальныйИдентификатор;
	НовЗапись.Событие = Событие;
	НовЗапись.УспешноеЗавершение = УспешноеЗавершение;
	НовЗапись.Комментарий = "По входящему пакету из файлового шлюза не сопоставлен документ ""Техническая операция"".";
	НовЗапись.ДатаСобытия = ТекущаяДатаСеанса();
	НовЗапись.УниверсальнаяДатаСобытия = ТекущаяУниверсальнаяДата();
	НовЗапись.ИдентификаторВызова = СквознойИдентификаторВызова;
	НовЗапись.Записать();
	
КонецПроцедуры
